{"info": {"author": "Shawn Clake", "author_email": "shawn.clake@gmail.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# Apitax\n\nPronounced: *ahhp-ehh-tax*\n\n**tl;dr: Code examples are at the very *bottom* of this documentation; however, I highly suggest you read through the documentation to learn what is possible.**\n\nFinally, as Apitax features an exponential amount of various interactions, not all of them are documented here. Experiment with the syntax, Learn from the syntax, and Enjoy Apitax!\n\n## What is it\n\nApitax is an API automation framework utilizing Commandtax and Scriptax. Commandtax is an API language which helps to quickly prototype powerful rest API requests. Scriptax is an automation language which utilizes Commandtax.\n\nA more winded (and more detailed!) description called **Why use Apitax** is at the very bottom of this documentation.\n\n## Builds and Installation\n\n### StarterPack\nI highly recommend you use the starter pack to get Apitax up and running. It provides you with a templated repository of files which you can change to better suit your application. \n\nThe Apitax StarterPack can be found here: https://github.com/Apitax/StarterPack\n\nStarterPack Benefits and Features:\n* A complete set of working files to bring up Apitax with a single command\n* Integrates Apitax/Core, Apitax/Drivers, Apitax/Scripts, and Apitax/CLI out of the box to give you a great experience\n* Provides options to launch Apitax/Dashboard as well\n* Completely customizable as if you were trying to use the raw Apitax code yourself\n* Every service launches in Docker in one swift motion\n\n##### Notes:\n* StarterPack utilizes Pip and Docker to build the application. For this reason, an internet connection is required on the machine you use to build these images.\n\n### Pip\n\nApitax on PyPi: https://pypi.org/project/apitax/\n\nUsing pip, you can bring in Apitax to your project.\n\n### Docker\nDocker is the recommended way to deploy Apitax. Please see the StarterPack for examples on how this can be achieved. While building Apitax yourself is possible, it is only recommended to do so if you are developing Apitax.\n\nWarning: Apitax/Core is a base Apitax image. It is not meant to be deployed by itself, and must be used as a base for an application image which uses Apitax. Please see the StarterPack for more details. \n\nFor the programmers out there: Think of the Apitax image as an `abstract class` in a programming language, and it is up to you to build the class that inheirits Apitax. \n\n#### DockerHub\n* Apitax is available as an image on DockerHub: https://hub.docker.com/r/shawnclake/apitax/\n\n#### Build yourself using Dockerfile\nYou can use the provided Docker file to quickly build an Apitax image. However, this image will not function correctly as it will be missing `config.txt`, `project.py`, and will have no drivers. Please see the StarterPack for more details on how this should all be included.\n\nSteps:\n* Clone the Apitax repository\n* Build the image: `docker build --no-cache -t my-amazing-image .`\n* Run the newly created image: `docker run -d -p 5080:5080 my-amazing-image`\n    * This will run the container in the background, to run the container in the foreground remove the `-d` flag.\n\n### Jenkins\n* Jenkins is available here: https://openrubicon.com/blue/organizations/jenkins/Apitax/activity\n* This address may change in the future\n* Builds are not available on the Jenkins platform, and they likely never will be\n* Builds are triggered periodically or via a Git Push\n* Build artifacts will likely be pushed to a downloads server in the near future\n    * Only non-dependency versions will be offered. On average, these are about 7.5% of the size of the versions which includes dependencies\n    * Major and minor releases will also feature a dependency build, however bug and security releases will not feature a dependency version\n    * It is best practice to always download the no-deps version and ensure you download the dependencies yourself\n\n### Pip Packaging Instructions\n* Use either Powershell or Bash\n* Building the package: `python setup.py sdist bdist_wheel`\n* Upload the package to Pypi: `twine upload dist/* -r pypi`\n* More information can be found here: https://gist.github.com/ShawnClake/759e9d09af868ef18f8c7b39d1684ad4\n\n### Readme Conversion Instructions\n* Install `pandoc` if it is not already installed: `sudo apt-get install pandoc`\n* Run the command: `pandoc -o readme.docx -f markdown -t docx README.md`\n\n### Compile Antlr Grammar from another directory\nThis is sometimes necessary due to a bug in the antlr compiler with regards to paths\n* Download the antlr compiler .jar file and save it somewhere.\n* Inside of the directory where the .jar was saved, create the following folder hierarchy\n    * build\n    * src\n    * scripts\n    * logs\n* Create a .bat or .sh file (dependent on OS) and add the following script:\n``` bash\n#!/bin/bash\ngrammardir=~/grammar\napitaxdir=~/apitax-dev/Apitax/apitax/grammar\nantlr='antlr-4.7.1-complete.jar'\njava -jar $grammardir/$antlr -Dlanguage=Python3 $grammardir/src/$2\njava -jar $grammardir/$antlr  -lib $grammardir/src -o $grammardir/build -listener -visitor -Dlanguage=Python3 $grammardir/src/$1\ncp -r $grammardir/build/* $apitaxdir/build\ncp $grammardir/src/$2 $apitaxdir/src\ncp $grammardir/src/$1 $apitaxdir/src\n```\n* Anytime you want to make changes to the grammar, do it from the new ~/grammar/src directory and run the script\n    * You must pass in your parser and lexer grammars as arguments `bash ~/grammar/run.sh Ah210.g4 AhLex210.g4`\n\n## Documentation and Usage\n\n### Commandtax - Data Gathering, Manipulating, Usage\nCommandtax is an efficient and fluent command language for Rest API's. Think of it as a better curl supporting better logging, better debugging, and more sensible flags.\n\n#### Existing\n* script \\<pathToSomeScript\\>\n    * Sequences of commands to automate the execution of API requests\n    * Scripts can include additional script commands which effectively means scripts can be nested\n    * Scripts are run in order from top to bottom, if a nested script is found it executes the nested script before continuing through the current script\n* custom \\<someCustomCommand\\>\n    * Processes a custom request which is not baked into the utility\n    * Parameters\n        * --get : Uses a get method\n        * --post : Uses a post method\n        * --put : Uses a put method\n        * --patch : Uses a patch method\n        * --delete : Uses a delete method\n        * --url : (string) The endpoint\n        * --debug : Sets debug mode\n        * --sensitive : Sets sensitive mode\n        * --data-post : (json string) Any post data\n        * --data-query : (json string) Any query parameters  ie. Endpoint.com/something?this=queryparam\n        * --data-path : (json string) Any url path variables ie. Endpoint.com/users/{path_var}/show\n\n#### Coming Soon\n* shell \\<someCommand\\>\n    * Runs the command in the shell and returns the response from the shell\t\t\n* An optional abreviated syntax for each command flag. These examples are subject to change\n    * --get -> -g\n    * --post -> -p\n    * --put -> -q\n    * --patch -> -w\n    * --delete -> -e\n    * --url -> -u\n    * --debug -> -d\n    * --sensitive -> -s\n    * --data-post -> -z\n    * --data-query -> -x\n    * --data-path -> -c\n\n\n### Scriptax - Control Flow, Scoping, and Automation\nScriptax is an API first automation language. Scriptax is not a general purpose language, instead it exists as a language tailored to optimizing automation in an API based environment.\n\n#### Language\n* `ct(required: \"\\<someCommand\\>\") {% %}`\n    * Commandtax execution\n    * A command is executed during the parsing of the line and its response is returned\n    * Supports async, callbacks\n* `get(required: \"\\<someCommand\\>\", optional: {dataObj}, optional: param1...n) {% %}`\n    * Executes a get request\n    * Data Object takes optional keys which correspond to Commandtax custom data: `post, query, path, header`\n    * Returns the result\n    * Supports async, callbacks\n* `put(required: \"\\<someCommand\\>\", optional: {dataObj}, optional: param1...n) {% %}`\n    * Executes a put request\n    * Data Object takes optional keys which correspond to Commandtax custom data: `post, query, path, header`\n    * Returns the result\n    * Supports async, callbacks\n* `patch(required: \"\\<someCommand\\>\", optional: {dataObj}, optional: param1...n) {% %}`\n    * Executes a patch request\n    * Data Object takes optional keys which correspond to Commandtax custom data: `post, query, path, header`\n    * Returns the result\n    * Supports async, callbacks\n* `post(required: \"\\<someCommand\\>\", optional: {dataObj}, optional: param1...n) {% %}`\n    * Executes a post request\n    * Data Object takes optional keys which correspond to Commandtax custom data: `post, query, path, header`\n    * Returns the result\n    * Supports async, callbacks\n* `delete(required: \"\\<someCommand\\>\", optional: {dataObj}, optional: param1...n) {% %}`\n    * Executes a delete request\n    * Data Object takes optional keys which correspond to Commandtax custom data: `post, query, path, header`\n    * Returns the result\n    * Supports async, callbacks\n* {dataObj}\n    * JSON object which includes optional arguments for the command such as:\n        * auth - The set of credentials to use for this request\n        * post - json - An object detailing any post parameters\n        * query - json - An object detailing any query parameters\n        * path - json - An object detailing any path parameters\n        * driver - The driver to use for this request\n        * strict - default: true - Whether or not the entire script should fail if the requests returns a status code >299 or <200\n* `new OpenstackNetworks(optional=parameters);`\n    * Creates a new instance of the OpenstackNetworks script\n    * The optional parameters should correspond to the sig line\n* `\\<attributes\\> \\<methodName\\>(optional=parameters) {}`\n    * Adds a method to the current script\n    * Attributes can be either `api` or `script`\n* `\\<methodName\\>(optional=parameters);`\n    * Executes a method with the optional parameters\n* `async`\n    * Add this keyword in front of any keyword which supports async to run the operation in a new thread\n    * Can also be used in front of a method statement: `api async getNetworks() { }`\n    * `async get(\"http://placeholderjson.com/users\", {}) {% %}`\n    * `someVar = async get(\"http://placeholderjson.com/users\", {}) {% %}`\n    * Callbacks execute prior to storing the result of the request into a variable\n    * Variable will be initialized with a new thread instance and once the thread completes it will be replaced with the result as returned via the callback\n* `await \\<someOptionalVar\\>;`\n    * When a variable is specified, wait until the async execution specified by that variable completes.\n    * When no variable is specified, wait until all of the open threads in the current script complete before moving on\n    * Can also be used when using a method call: `result = await openstack.getNetworks();`\n* {% %};\n    * Callback block\n    * The contents will be executed in an isolated scope, usually only having access to a `results` variable\n* `str()`\n    * Cast to string\n* `int()`\n    * Cast to rounded integer\n* `dec()`\n    * Cast to float\n* `bool()`\n    * Cast to true/false\n* `list()`\n    * Cast to list\n    * Only works on strings\n* `dict()`\n    * Cast to dictionary\n    * Works on lists, strings, ints, decs\n* `\\#`\n    * Return the length of the variable\n    * Works on strings, lists, dictionaries (Only returns the top level count)\n* `\\$`\n    * Escapes the label name such that labels which are the same as language keywords can be used\n* `\\!`\n    * When adding this to the very start of a statement, the execution of that line will not be logged or printed\n* `\\@`\n    * Returns the reflection of a variable\n* `extends(\\<someScriptPath\\>);`\n    * Adds polymorphism to the script by extending another script\n* `del(\\<someVar\\>)`\n    * Remove someVar from the current scope\n* `return \\<optionalVar\\>`\n    * Exits the script immediately and returns some expression\n* `options(optional=parameters)`\n    * Used to specify options for the script\n* `sig(param1Required, thisParam=isOptional, thisOneisRequired);`\n    * Specify parameters for a script\n* `if (condition) {}`\n    * IF statement\n* `while (condition) {}`\n    * While loop\n* `for \\<someVar\\> in \\<existingVar\\> {}`\n    * Loop through each item in a list in order\n* `for \\<someVar\\> in \\<someNumber\\> {}`\n    * Loop from 1 to someNumber and set someVar to the current iteration\n* `each \\<someList\\> {% %};`\n    * Loop through a list setting `results` to the current item and executing instructions in an isolated callback\n* `\\<someVar\\> = \\<someExpression\\>`\n    * Sets a variable\n    * Supports expressions, strings, numbers, booleans, dictionaries, lists, and commandtax responses\n* `\"this is a string {{ someVar }}\"`\n    * Injects the contents of a variable\n    * Fancy stuff is possible such as: set newVar = ct(\"{{someVar}}\")\n* `\\< someExpression \\>`\n    * Injects the expression\n    * In this case, the arrow brackets must be included\n* `from driverName import someScript as someName`\n    * This imports other scriptax to be used inside of the current script\n    * `from` and `as` are optional\n* `auth(\\<someAuthObject\\>)`\n    * Sets the default auth for the current executing script\n* `login(username={{someUser}}, password={{somePass}}, token={{someToken}}, driver={{someDriver}}, extra={{someJSONObj}})`\n    * Each parameter in login is optional. The required parameters is defined via the driver to be used by the login command. This driver is either the default script driver or the driver specified in the login parameters.\n    * Returns an auth object\n    * Can be used directly with `auth` such as: `auth login(username=test, password=test123);`\n* `endpoint(someEndpointName@someDriver)`\n    * Using the drivers `getCatalog` method, this will return the the endpoint found in the catalog of the specified driver\n    * This can be used directly with `url` such as: `url endpoint('keystone@openstack')`\n* `url(\\<someUrl\\>)`\n    * Sets the current working URL to be used in further commandtax\n* `log(\"log some output to the console & log file\")`\n    * Supports expressions\n* `// some comment`\n    * Inline comment\n* `/* some comment spanning multiple lines */`\n    * Block comment\n\n#### Scopes\nIn Scriptax, there is no global scope. Every piece of data belongs to a scope. There are many different scope types within Scriptax:\n* Script Scope - These are symbols that are accessible within an entire script. Examples of these are sig parameters or script level variables.\n* Method Scope - These are symbols that are accessible from within a method. Of course, this scope inherits from the script scope.\n* Flow/Block Scope - These are symbols that are accessible within a flow block such as if statements or loops. Of course, this scope inherits from the script scope.\n* Callback Scope - These are symbols that are accessible within a callback. Usually, a `result` variable will be accessible as well as any other values passed in via `(optional=parameter) -> {% %}` syntax. Typically callback scope is read only and any changes made to any variables in here will only be changed within the callback scope. The only exception to this is the `result` variable which is generally used to pass data back in a return style. \n\n`Script`, `Method`, and `Flow/Block` scopes will all inherit their parent scopes. `Callback` scopes on the other hand are completely isolated and must be told explicilty which symbols are allowed in and they will only be allowed in as read-only.\n\n#### Architecture\n* In Scriptax, every file is considered an object. In other words, every file is analogous to `class` in other programming and scripting languages. \n* Instances in Scriptax only ensure that variables in the script scope are unique. \n* Methods in Scriptax are inherently `static`. In other words, methods are not unique per instance and can be called on the script itself or on a script instance. If a method is called via the script itself and attempts to utilize script scope variables, an error will be thrown.\n\n#### Structure\nScriptax has a structure which must be followed or else errors will be thrown or the script will complete with errors.\n\nThe first few lines of a script are dedicated to `global_statements`. These statements include `extends`, `signature`, `options`, and finally `imports`. Scriptax is extremely strict when it comes to `global_statements` and thus they must even be in order. If you choose to use `extends` it must be the first statement in the file with no exceptions. If you choose to use `signature` it must come immediatly after `extends`, but if you aren't using `extends` then `signature` must be the first statement within the file, so on and so forth. The order of `global_statements` is as follows:\n\n1. `extends`\n2. `signature`\n3. `options`\n4. `imports`\n\nWhile `extends`, `signature`, and `options` should only ever occur 0 or 1 times within a script file, `imports` can occur 0..n times within a file. \n\nAfter the `global_statements` feel free to use any non global statements as you see fit. \n\n#### Scriptax Gotchas/Tips/Tricks\n* Accessing parameters as defined by `sig` should be done like so: `param.firstParam` where `firstParam` is the name of the parameter\n* For best compatbility with Apitax/Dashboard and Apitax/CLI, please start each Scriptax file with a `sig` line if nessecary. \n* You can use arrays via dot notation\n    * set someVar.1 = num1\n    * set someVar.2 = num2\n    * set someVar.\\<counter\\> = num3\n    * When doing this, the first usage of a variable must either be someVar = \"{}\" or an index as part of that object. Failure to do this will result in errors being thrown.\n\n#### Best Practices\n* End each script with `await;` to ensure all async requests are completed before it returns to the parent script.\n    * Ending with `await;` followed by `return \\<someVar\\>;` is also acceptable\n* Delete unused variables from the root scope when they are no longer needed `del \\<someVar\\>` \n* Only export/return necessary variables from subscripts\n* Keep the root scope as clean as possible\n* Scripts should be small, containerized pieces of code that strictly follow SRP.\n     * Think of Scripts as lego blocks, eventually you can put a bunch of them together to build something really cool\n* Scriptax is a flexible, forgiving, and powerful language\n    * Play around to see what you can and cannot do. There are too many edge cases to list explicitly.\n\n#### Coming Soon\n* A time method\n\n### Commandline Interface (CLI)\n* You can activate Apitax from the CLI directly without needing a wrapper package\n* Run the tests.py file found in the root Apitax directory, and supply the following arguments\n    * --cli : (Optional) Quickly select CLI mode\n    * --api : (Optional) Quickly select web server mode\n    * --debug : (Optional) Output the request response status, headers, and body\n    * -u <input> : (Optional) Specify the authentication username - Only applicable in CLI mode\n    * -p : (Optional) Ask for password input right away. If -u is specified, but this is not, the application will ask for a new set of credentials for authentication. But, it will use the -u value for any username fields within further requests. This allows someone to authenticate as admin, but run commands applicable to another user.\n    * -r <Input> : (Optional) The request - Only applicable in CLI mode\n    * -s <input> : (Optional) Run a script of requests specified by the file path <input>, authentication for all of these requests are specified by -u & -p\n\n### Modes\n* CLI : Make a request from the command line\n* API : Start the api server\n\n### Configuration\n* An example configuration file is stored in the root of the repo\n\n### Supported Authentication\n* Authentication is prebuilt for HTTP Basic and Token based authentication\n* Authentication is largely left up to a developer in custom scenarios\n    * Driver files facilitate this requirement\n\n### Drivers and Plugins\n** This has been redone and requires updated configuration **\n* Drivers and plugins are used to extend the functionality of Apitax to an arbitrary API\n* Drivers must be dynammically added to the application via the `project.py` file. Please see Apitax/StarterPack for an example of how this can be done.\n\n### Examples of Apitax in Action:\n\n#### Commandtax Examples\n```\ncustom --get --url <someEndpoint>\ncustom --get --url <someEndpoint> --data-param '{\"is_domain\": true}'\ncustom --post --url <someEndpoint> --data-post '{\"title\": \"im the title\"}'\ncustom --put --url <someEndpoint> \ncustom --patch --url <someEndpoint>\ncustom --delete --url <someEndpoint> \ncustom --get --url <someEndpoint> --data-param '{\"user.id\": \"1\"}'\ncustom --get --url <someEndpoint>/with/some/{ohyear}/url/params/{981} --data-param '{\"is_domain\": true}' --data-path '{\"ohyeah\":\"no\", \"981\": \"yes\"}'\n```\n`script ~/path/to/my/script.ah`\n\n#### Scriptax Examples\n\n```\n// async-tests.ah\n\nurl \"https://jsonplaceholder.typicode.com\";\n\nbob = [];\nthreads = [];\n\n/*each get(\"/users\", {})\n{%\n\turl \"https://jsonplaceholder.typicode.com\";\n\tthreads[] = async get(\"/posts\", {\n          \t\"query\": {\n                \"userId\": result.id,\n            },\n        }) {%\n        \tlog(\"The user has these posts: \" + result);    \n        %};\n%};*/\n\nfor user in get(\"/users\", {})\n    threads[] = async get(\"/posts\", {\n            \"query\": {\n                \"userId\": user.id,\n            },\n        }) {%\n        log(\"The user has these posts: \" + result);\n        //bob[] = result;\n    %};\n\nawait threads;\n\ndel threads;\n\nscript(\"apitax/grammar/scripts/base.ah\");\n\nlog(\"yo man im at the end\");\n\n\n/*for user in get(\"/users\", {})\n    threads = async get(\"/posts\", {\n            \"query\": {\n                \"userId\": user.id,\n            },\n        }) {%\n        log(\"The user has these posts: \" + result);\n        bob[] = result\n    %};\n\n//bob[] = \"hey\";\n\nfor t in threads\n\tawait t;\n\nlog(bob);\n\nlog(\"Im quite confused\");*/\n\n```\n\n```\n// base.ah\n\nurl \"https://jsonplaceholder.typicode.com\";\nfor user in get(\"/users\")\n{\n    /*result = get(\"/posts\", {\n        \"query\": {\n            \"userId\": user.id,\n        }\n    });\n    log(\"The user has these posts: \" + result);*/\n\n    log(\"the user has ID: \" + user.id);\n\n    async get(\"/posts\", {\n            \"query\": {\n                \"userId\": user.id,\n            }\n        }) {%\n        log(\"The user has these posts: \" + result);\n    %};\n\n}  \n\nresponse = post(\"/posts\", {\n    \"post\": {\n        \"title\":'foo',\n        \"body\":'bar',\n        \"userId\":1\n    }\n});\n\nlog(script(\"apitax/grammar/scripts/jen.ah\", {}, \"i am parameter 1\", \"i am parameter 2\"));\n\n//response = ;\n\nlog(\"Please \" + ct(\"tests my script\", {}, \"i should be a parameter\"));\n\n\ntestlist = [\"one\", \"two\", 'three', [\"a\", 'b', 'c', 'd'], {\"test\": \"failed\", \"yes\": \"no\"}];\n\nlog(#testlist.0);\n\n\n/*async ct(\"some command execution\")\n{\nlog(\"some integrated callback\");\n}\n\nasync ct(\"some command execution\");\n\nstatus = async ct(\"some command execution\");\n\nawait status;\n\nstatus = [firstAsync, secondAsync];\nawait status;\n\nasync bobo in get(\"/users\")\n{\n    log(\"Async callback: \" + bobo);\n}*/\n\nasync get(\"/users\");\n\n\n\nsomelabel = async get(\"/users\")\n{%\n    log(\"I am an optional callback\");\n%};\n//anotherRequest0 = async get(\"/users\");\n//anotherRequest1 = async get(\"/users\");\n//anotherRequest2 = async get(\"/users\");\n\nawait somelabel;\n\nlog(\"i am that label\" + somelabel);\n\n\nget(\"/users\") {%\n\nlog(result);\n\n%};\n\nasync get(\"/users\") {%\n\nlog(result);\n\n%};\n\n\nfor iter in 10 {\n\n    async get(\"/posts\", {\n            \"query\": {\n                \"userId\": iter,\n            }\n        }) {%\n        log(\"The user has these posts: \" + result);\n    %};\n\n}\n\nlog(\"here is where the magic happens\");\n\nget(\"/posts\", {\n        \"query\": {\n            \"userId\": 5,\n        }\n    }) {%\n    log(\"The user has these posts: \" + result);\n%};\n\n\nawait;\n\n```\n\n```\n// jen.ah\n\noptions dict('{\"params\": [\"name\", \"game\"]}');\nanswer=2+2;\nname \"quinn\";\n\nset qwer = \"im in jens script\";\n\n\nexport qwer;\n\n//export ct(\"script apitax/grammar/scripts/shawn.ah\");\n\nset iam.hope.this.works = ct(\"custom --get --url https://jsonplaceholder.typicode.com/users\");\n\nexport iam;\n\nset test = \"hello\";\n\n//return '{\"cool\": \"beans\"}';\n\nlog(params.passed.0);\n\nlog(params.passed.1);\n\nlog(params.name);\n\nlog(params.game);\n\nlog(2+2);\n\nreturn params.passed.1;\n\n//return \"test\";\n\n\nawait;\n\n```\n\n```\n// my_script.ah\n\n\noptions dict('{\"params\": [\"first\"]}');\n\nlog(\"I got here\");\n\nlog(params.first);\n\nreturn \"work\";\n\n\nawait;\n\n```\n\n\n## Why use Apitax\nLet's presume that a backend exists only as an entity that does nothing until it is told to do something.\n\nIf this is the case let's also assume there will be no interface into the backend other than a RESTful API. \n\nOkay, so let's say we want to build a frontend that will list every user's 10 most recent posts. \n\nOne way we can do this is to make an API request to retrieve a list of our users. Then, in JavaScript, we can loop through that list of users, and for each one we can make an API request to get their most recent posts. In Javascript, we can then compile this list of users together and display it. \n\nSounds simple - except how do we then speed up this process by utilizing asynchronous code. We begin to introduce all sorts of nested callbacks, desync's in our JavaScript that are complex to sort out, difficult bug testing, and we start to break DRY as we copy bits and pieces of this code to different files/pages to list different types of data in different ways.\n\nWe can solve some of our DRY problems by creating giant API classes that have helper methods for each of these types of calls, but it will still become quite a mess.\n\nWhat we want is to focus on frontend development - not the API request garbage. By doing this, we are enforcing SRP of the frontend architecture as a whole. The bulk of the frontend code should be dedicated to displaying data, getting input, and showing users responses from their input. It should not be thousands of lines of us making API calls and trying to organize the data. There has to be a simpler way, right?\n\nWhat if the frontend only had 4 different API requests to make. 1 for authentication, 1 for getting a catalog of endpoints, 1 for getting the status of the system, and finally 1 to facilitate the transfer of bidirectional data. Here is where Apitax/Commandtax comes into play. We now have a single endpoint to send a request to, and that request's payload is commandtax. \n\nGreat! Now, instead of a bunch of helper methods all over the place, now we might just have some helper string constants that store frequently used commands. Already much cleaner and more workable. But, this still doesn't solve our DRY problem, SRP, or the callback and desync hell we will face from having to make several requests in a row to accomplish a task.\n\nEnter: Scriptax. Now, any of us can create little self-contained sub module files which do these sequential requests for you. These files are called Scripts. One script might have the responsibility of getting a list of users that follows some set of parameters, and another might call that users script and then using the response returned, it could get a list of posts for each of those users and return them. \n\nOkay, now our frontend only has 1 short line of commandtax which is executing a script. If the scripts are written well, there is no more callback hell, SRP is preserved, DRY is enforced, and the data returned to us will already be in a very workable format. Kaboomskies, you just saved yourself 2 dozen lines of hard to debug JavaScript, and instead, it's a one liner that returns the data already in a workable format\n\n\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/ShawnClake/Apitax", "keywords": "restful,api,commandtax,scriptax", "license": "", "maintainer": "", "maintainer_email": "", "name": "apitaxcore", "package_url": "https://pypi.org/project/apitaxcore/", "platform": "", "project_url": "https://pypi.org/project/apitaxcore/", "project_urls": {"Homepage": "https://github.com/ShawnClake/Apitax"}, "release_url": "https://pypi.org/project/apitaxcore/3.0.9/", "requires_dist": ["python-dateutil (==2.6.0)", "typing (==3.5.2.2)", "xmltodict", "requests"], "requires_python": "", "summary": "Provides utilities and integration code which may be useful when developing various drivers for use within the Apitax framework.", "version": "3.0.9", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Apitax</h1>\n<p>Pronounced: <em>ahhp-ehh-tax</em></p>\n<p><strong>tl;dr: Code examples are at the very <em>bottom</em> of this documentation; however, I highly suggest you read through the documentation to learn what is possible.</strong></p>\n<p>Finally, as Apitax features an exponential amount of various interactions, not all of them are documented here. Experiment with the syntax, Learn from the syntax, and Enjoy Apitax!</p>\n<h2>What is it</h2>\n<p>Apitax is an API automation framework utilizing Commandtax and Scriptax. Commandtax is an API language which helps to quickly prototype powerful rest API requests. Scriptax is an automation language which utilizes Commandtax.</p>\n<p>A more winded (and more detailed!) description called <strong>Why use Apitax</strong> is at the very bottom of this documentation.</p>\n<h2>Builds and Installation</h2>\n<h3>StarterPack</h3>\n<p>I highly recommend you use the starter pack to get Apitax up and running. It provides you with a templated repository of files which you can change to better suit your application.</p>\n<p>The Apitax StarterPack can be found here: <a href=\"https://github.com/Apitax/StarterPack\" rel=\"nofollow\">https://github.com/Apitax/StarterPack</a></p>\n<p>StarterPack Benefits and Features:</p>\n<ul>\n<li>A complete set of working files to bring up Apitax with a single command</li>\n<li>Integrates Apitax/Core, Apitax/Drivers, Apitax/Scripts, and Apitax/CLI out of the box to give you a great experience</li>\n<li>Provides options to launch Apitax/Dashboard as well</li>\n<li>Completely customizable as if you were trying to use the raw Apitax code yourself</li>\n<li>Every service launches in Docker in one swift motion</li>\n</ul>\n<h5>Notes:</h5>\n<ul>\n<li>StarterPack utilizes Pip and Docker to build the application. For this reason, an internet connection is required on the machine you use to build these images.</li>\n</ul>\n<h3>Pip</h3>\n<p>Apitax on PyPi: <a href=\"https://pypi.org/project/apitax/\" rel=\"nofollow\">https://pypi.org/project/apitax/</a></p>\n<p>Using pip, you can bring in Apitax to your project.</p>\n<h3>Docker</h3>\n<p>Docker is the recommended way to deploy Apitax. Please see the StarterPack for examples on how this can be achieved. While building Apitax yourself is possible, it is only recommended to do so if you are developing Apitax.</p>\n<p>Warning: Apitax/Core is a base Apitax image. It is not meant to be deployed by itself, and must be used as a base for an application image which uses Apitax. Please see the StarterPack for more details.</p>\n<p>For the programmers out there: Think of the Apitax image as an <code>abstract class</code> in a programming language, and it is up to you to build the class that inheirits Apitax.</p>\n<h4>DockerHub</h4>\n<ul>\n<li>Apitax is available as an image on DockerHub: <a href=\"https://hub.docker.com/r/shawnclake/apitax/\" rel=\"nofollow\">https://hub.docker.com/r/shawnclake/apitax/</a></li>\n</ul>\n<h4>Build yourself using Dockerfile</h4>\n<p>You can use the provided Docker file to quickly build an Apitax image. However, this image will not function correctly as it will be missing <code>config.txt</code>, <code>project.py</code>, and will have no drivers. Please see the StarterPack for more details on how this should all be included.</p>\n<p>Steps:</p>\n<ul>\n<li>Clone the Apitax repository</li>\n<li>Build the image: <code>docker build --no-cache -t my-amazing-image .</code></li>\n<li>Run the newly created image: <code>docker run -d -p 5080:5080 my-amazing-image</code>\n<ul>\n<li>This will run the container in the background, to run the container in the foreground remove the <code>-d</code> flag.</li>\n</ul>\n</li>\n</ul>\n<h3>Jenkins</h3>\n<ul>\n<li>Jenkins is available here: <a href=\"https://openrubicon.com/blue/organizations/jenkins/Apitax/activity\" rel=\"nofollow\">https://openrubicon.com/blue/organizations/jenkins/Apitax/activity</a></li>\n<li>This address may change in the future</li>\n<li>Builds are not available on the Jenkins platform, and they likely never will be</li>\n<li>Builds are triggered periodically or via a Git Push</li>\n<li>Build artifacts will likely be pushed to a downloads server in the near future\n<ul>\n<li>Only non-dependency versions will be offered. On average, these are about 7.5% of the size of the versions which includes dependencies</li>\n<li>Major and minor releases will also feature a dependency build, however bug and security releases will not feature a dependency version</li>\n<li>It is best practice to always download the no-deps version and ensure you download the dependencies yourself</li>\n</ul>\n</li>\n</ul>\n<h3>Pip Packaging Instructions</h3>\n<ul>\n<li>Use either Powershell or Bash</li>\n<li>Building the package: <code>python setup.py sdist bdist_wheel</code></li>\n<li>Upload the package to Pypi: <code>twine upload dist/* -r pypi</code></li>\n<li>More information can be found here: <a href=\"https://gist.github.com/ShawnClake/759e9d09af868ef18f8c7b39d1684ad4\" rel=\"nofollow\">https://gist.github.com/ShawnClake/759e9d09af868ef18f8c7b39d1684ad4</a></li>\n</ul>\n<h3>Readme Conversion Instructions</h3>\n<ul>\n<li>Install <code>pandoc</code> if it is not already installed: <code>sudo apt-get install pandoc</code></li>\n<li>Run the command: <code>pandoc -o readme.docx -f markdown -t docx README.md</code></li>\n</ul>\n<h3>Compile Antlr Grammar from another directory</h3>\n<p>This is sometimes necessary due to a bug in the antlr compiler with regards to paths</p>\n<ul>\n<li>Download the antlr compiler .jar file and save it somewhere.</li>\n<li>Inside of the directory where the .jar was saved, create the following folder hierarchy\n<ul>\n<li>build</li>\n<li>src</li>\n<li>scripts</li>\n<li>logs</li>\n</ul>\n</li>\n<li>Create a .bat or .sh file (dependent on OS) and add the following script:</li>\n</ul>\n<pre><span class=\"ch\">#!/bin/bash</span>\n<span class=\"nv\">grammardir</span><span class=\"o\">=</span>~/grammar\n<span class=\"nv\">apitaxdir</span><span class=\"o\">=</span>~/apitax-dev/Apitax/apitax/grammar\n<span class=\"nv\">antlr</span><span class=\"o\">=</span><span class=\"s1\">'antlr-4.7.1-complete.jar'</span>\njava -jar <span class=\"nv\">$grammardir</span>/<span class=\"nv\">$antlr</span> -Dlanguage<span class=\"o\">=</span>Python3 <span class=\"nv\">$grammardir</span>/src/<span class=\"nv\">$2</span>\njava -jar <span class=\"nv\">$grammardir</span>/<span class=\"nv\">$antlr</span>  -lib <span class=\"nv\">$grammardir</span>/src -o <span class=\"nv\">$grammardir</span>/build -listener -visitor -Dlanguage<span class=\"o\">=</span>Python3 <span class=\"nv\">$grammardir</span>/src/<span class=\"nv\">$1</span>\ncp -r <span class=\"nv\">$grammardir</span>/build/* <span class=\"nv\">$apitaxdir</span>/build\ncp <span class=\"nv\">$grammardir</span>/src/<span class=\"nv\">$2</span> <span class=\"nv\">$apitaxdir</span>/src\ncp <span class=\"nv\">$grammardir</span>/src/<span class=\"nv\">$1</span> <span class=\"nv\">$apitaxdir</span>/src\n</pre>\n<ul>\n<li>Anytime you want to make changes to the grammar, do it from the new ~/grammar/src directory and run the script\n<ul>\n<li>You must pass in your parser and lexer grammars as arguments <code>bash ~/grammar/run.sh Ah210.g4 AhLex210.g4</code></li>\n</ul>\n</li>\n</ul>\n<h2>Documentation and Usage</h2>\n<h3>Commandtax - Data Gathering, Manipulating, Usage</h3>\n<p>Commandtax is an efficient and fluent command language for Rest API's. Think of it as a better curl supporting better logging, better debugging, and more sensible flags.</p>\n<h4>Existing</h4>\n<ul>\n<li>script &lt;pathToSomeScript&gt;\n<ul>\n<li>Sequences of commands to automate the execution of API requests</li>\n<li>Scripts can include additional script commands which effectively means scripts can be nested</li>\n<li>Scripts are run in order from top to bottom, if a nested script is found it executes the nested script before continuing through the current script</li>\n</ul>\n</li>\n<li>custom &lt;someCustomCommand&gt;\n<ul>\n<li>Processes a custom request which is not baked into the utility</li>\n<li>Parameters\n<ul>\n<li>--get : Uses a get method</li>\n<li>--post : Uses a post method</li>\n<li>--put : Uses a put method</li>\n<li>--patch : Uses a patch method</li>\n<li>--delete : Uses a delete method</li>\n<li>--url : (string) The endpoint</li>\n<li>--debug : Sets debug mode</li>\n<li>--sensitive : Sets sensitive mode</li>\n<li>--data-post : (json string) Any post data</li>\n<li>--data-query : (json string) Any query parameters  ie. Endpoint.com/something?this=queryparam</li>\n<li>--data-path : (json string) Any url path variables ie. Endpoint.com/users/{path_var}/show</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h4>Coming Soon</h4>\n<ul>\n<li>shell &lt;someCommand&gt;\n<ul>\n<li>Runs the command in the shell and returns the response from the shell</li>\n</ul>\n</li>\n<li>An optional abreviated syntax for each command flag. These examples are subject to change\n<ul>\n<li>--get -&gt; -g</li>\n<li>--post -&gt; -p</li>\n<li>--put -&gt; -q</li>\n<li>--patch -&gt; -w</li>\n<li>--delete -&gt; -e</li>\n<li>--url -&gt; -u</li>\n<li>--debug -&gt; -d</li>\n<li>--sensitive -&gt; -s</li>\n<li>--data-post -&gt; -z</li>\n<li>--data-query -&gt; -x</li>\n<li>--data-path -&gt; -c</li>\n</ul>\n</li>\n</ul>\n<h3>Scriptax - Control Flow, Scoping, and Automation</h3>\n<p>Scriptax is an API first automation language. Scriptax is not a general purpose language, instead it exists as a language tailored to optimizing automation in an API based environment.</p>\n<h4>Language</h4>\n<ul>\n<li><code>ct(required: \"\\&lt;someCommand\\&gt;\") {% %}</code>\n<ul>\n<li>Commandtax execution</li>\n<li>A command is executed during the parsing of the line and its response is returned</li>\n<li>Supports async, callbacks</li>\n</ul>\n</li>\n<li><code>get(required: \"\\&lt;someCommand\\&gt;\", optional: {dataObj}, optional: param1...n) {% %}</code>\n<ul>\n<li>Executes a get request</li>\n<li>Data Object takes optional keys which correspond to Commandtax custom data: <code>post, query, path, header</code></li>\n<li>Returns the result</li>\n<li>Supports async, callbacks</li>\n</ul>\n</li>\n<li><code>put(required: \"\\&lt;someCommand\\&gt;\", optional: {dataObj}, optional: param1...n) {% %}</code>\n<ul>\n<li>Executes a put request</li>\n<li>Data Object takes optional keys which correspond to Commandtax custom data: <code>post, query, path, header</code></li>\n<li>Returns the result</li>\n<li>Supports async, callbacks</li>\n</ul>\n</li>\n<li><code>patch(required: \"\\&lt;someCommand\\&gt;\", optional: {dataObj}, optional: param1...n) {% %}</code>\n<ul>\n<li>Executes a patch request</li>\n<li>Data Object takes optional keys which correspond to Commandtax custom data: <code>post, query, path, header</code></li>\n<li>Returns the result</li>\n<li>Supports async, callbacks</li>\n</ul>\n</li>\n<li><code>post(required: \"\\&lt;someCommand\\&gt;\", optional: {dataObj}, optional: param1...n) {% %}</code>\n<ul>\n<li>Executes a post request</li>\n<li>Data Object takes optional keys which correspond to Commandtax custom data: <code>post, query, path, header</code></li>\n<li>Returns the result</li>\n<li>Supports async, callbacks</li>\n</ul>\n</li>\n<li><code>delete(required: \"\\&lt;someCommand\\&gt;\", optional: {dataObj}, optional: param1...n) {% %}</code>\n<ul>\n<li>Executes a delete request</li>\n<li>Data Object takes optional keys which correspond to Commandtax custom data: <code>post, query, path, header</code></li>\n<li>Returns the result</li>\n<li>Supports async, callbacks</li>\n</ul>\n</li>\n<li>{dataObj}\n<ul>\n<li>JSON object which includes optional arguments for the command such as:\n<ul>\n<li>auth - The set of credentials to use for this request</li>\n<li>post - json - An object detailing any post parameters</li>\n<li>query - json - An object detailing any query parameters</li>\n<li>path - json - An object detailing any path parameters</li>\n<li>driver - The driver to use for this request</li>\n<li>strict - default: true - Whether or not the entire script should fail if the requests returns a status code &gt;299 or &lt;200</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><code>new OpenstackNetworks(optional=parameters);</code>\n<ul>\n<li>Creates a new instance of the OpenstackNetworks script</li>\n<li>The optional parameters should correspond to the sig line</li>\n</ul>\n</li>\n<li><code>\\&lt;attributes\\&gt; \\&lt;methodName\\&gt;(optional=parameters) {}</code>\n<ul>\n<li>Adds a method to the current script</li>\n<li>Attributes can be either <code>api</code> or <code>script</code></li>\n</ul>\n</li>\n<li><code>\\&lt;methodName\\&gt;(optional=parameters);</code>\n<ul>\n<li>Executes a method with the optional parameters</li>\n</ul>\n</li>\n<li><code>async</code>\n<ul>\n<li>Add this keyword in front of any keyword which supports async to run the operation in a new thread</li>\n<li>Can also be used in front of a method statement: <code>api async getNetworks() { }</code></li>\n<li><code>async get(\"http://placeholderjson.com/users\", {}) {% %}</code></li>\n<li><code>someVar = async get(\"http://placeholderjson.com/users\", {}) {% %}</code></li>\n<li>Callbacks execute prior to storing the result of the request into a variable</li>\n<li>Variable will be initialized with a new thread instance and once the thread completes it will be replaced with the result as returned via the callback</li>\n</ul>\n</li>\n<li><code>await \\&lt;someOptionalVar\\&gt;;</code>\n<ul>\n<li>When a variable is specified, wait until the async execution specified by that variable completes.</li>\n<li>When no variable is specified, wait until all of the open threads in the current script complete before moving on</li>\n<li>Can also be used when using a method call: <code>result = await openstack.getNetworks();</code></li>\n</ul>\n</li>\n<li>{% %};\n<ul>\n<li>Callback block</li>\n<li>The contents will be executed in an isolated scope, usually only having access to a <code>results</code> variable</li>\n</ul>\n</li>\n<li><code>str()</code>\n<ul>\n<li>Cast to string</li>\n</ul>\n</li>\n<li><code>int()</code>\n<ul>\n<li>Cast to rounded integer</li>\n</ul>\n</li>\n<li><code>dec()</code>\n<ul>\n<li>Cast to float</li>\n</ul>\n</li>\n<li><code>bool()</code>\n<ul>\n<li>Cast to true/false</li>\n</ul>\n</li>\n<li><code>list()</code>\n<ul>\n<li>Cast to list</li>\n<li>Only works on strings</li>\n</ul>\n</li>\n<li><code>dict()</code>\n<ul>\n<li>Cast to dictionary</li>\n<li>Works on lists, strings, ints, decs</li>\n</ul>\n</li>\n<li><code>\\#</code>\n<ul>\n<li>Return the length of the variable</li>\n<li>Works on strings, lists, dictionaries (Only returns the top level count)</li>\n</ul>\n</li>\n<li><code>\\$</code>\n<ul>\n<li>Escapes the label name such that labels which are the same as language keywords can be used</li>\n</ul>\n</li>\n<li><code>\\!</code>\n<ul>\n<li>When adding this to the very start of a statement, the execution of that line will not be logged or printed</li>\n</ul>\n</li>\n<li><code>\\@</code>\n<ul>\n<li>Returns the reflection of a variable</li>\n</ul>\n</li>\n<li><code>extends(\\&lt;someScriptPath\\&gt;);</code>\n<ul>\n<li>Adds polymorphism to the script by extending another script</li>\n</ul>\n</li>\n<li><code>del(\\&lt;someVar\\&gt;)</code>\n<ul>\n<li>Remove someVar from the current scope</li>\n</ul>\n</li>\n<li><code>return \\&lt;optionalVar\\&gt;</code>\n<ul>\n<li>Exits the script immediately and returns some expression</li>\n</ul>\n</li>\n<li><code>options(optional=parameters)</code>\n<ul>\n<li>Used to specify options for the script</li>\n</ul>\n</li>\n<li><code>sig(param1Required, thisParam=isOptional, thisOneisRequired);</code>\n<ul>\n<li>Specify parameters for a script</li>\n</ul>\n</li>\n<li><code>if (condition) {}</code>\n<ul>\n<li>IF statement</li>\n</ul>\n</li>\n<li><code>while (condition) {}</code>\n<ul>\n<li>While loop</li>\n</ul>\n</li>\n<li><code>for \\&lt;someVar\\&gt; in \\&lt;existingVar\\&gt; {}</code>\n<ul>\n<li>Loop through each item in a list in order</li>\n</ul>\n</li>\n<li><code>for \\&lt;someVar\\&gt; in \\&lt;someNumber\\&gt; {}</code>\n<ul>\n<li>Loop from 1 to someNumber and set someVar to the current iteration</li>\n</ul>\n</li>\n<li><code>each \\&lt;someList\\&gt; {% %};</code>\n<ul>\n<li>Loop through a list setting <code>results</code> to the current item and executing instructions in an isolated callback</li>\n</ul>\n</li>\n<li><code>\\&lt;someVar\\&gt; = \\&lt;someExpression\\&gt;</code>\n<ul>\n<li>Sets a variable</li>\n<li>Supports expressions, strings, numbers, booleans, dictionaries, lists, and commandtax responses</li>\n</ul>\n</li>\n<li><code>\"this is a string {{ someVar }}\"</code>\n<ul>\n<li>Injects the contents of a variable</li>\n<li>Fancy stuff is possible such as: set newVar = ct(\"{{someVar}}\")</li>\n</ul>\n</li>\n<li><code>\\&lt; someExpression \\&gt;</code>\n<ul>\n<li>Injects the expression</li>\n<li>In this case, the arrow brackets must be included</li>\n</ul>\n</li>\n<li><code>from driverName import someScript as someName</code>\n<ul>\n<li>This imports other scriptax to be used inside of the current script</li>\n<li><code>from</code> and <code>as</code> are optional</li>\n</ul>\n</li>\n<li><code>auth(\\&lt;someAuthObject\\&gt;)</code>\n<ul>\n<li>Sets the default auth for the current executing script</li>\n</ul>\n</li>\n<li><code>login(username={{someUser}}, password={{somePass}}, token={{someToken}}, driver={{someDriver}}, extra={{someJSONObj}})</code>\n<ul>\n<li>Each parameter in login is optional. The required parameters is defined via the driver to be used by the login command. This driver is either the default script driver or the driver specified in the login parameters.</li>\n<li>Returns an auth object</li>\n<li>Can be used directly with <code>auth</code> such as: <code>auth login(username=test, password=test123);</code></li>\n</ul>\n</li>\n<li><code>endpoint(someEndpointName@someDriver)</code>\n<ul>\n<li>Using the drivers <code>getCatalog</code> method, this will return the the endpoint found in the catalog of the specified driver</li>\n<li>This can be used directly with <code>url</code> such as: <code>url endpoint('keystone@openstack')</code></li>\n</ul>\n</li>\n<li><code>url(\\&lt;someUrl\\&gt;)</code>\n<ul>\n<li>Sets the current working URL to be used in further commandtax</li>\n</ul>\n</li>\n<li><code>log(\"log some output to the console &amp; log file\")</code>\n<ul>\n<li>Supports expressions</li>\n</ul>\n</li>\n<li><code>// some comment</code>\n<ul>\n<li>Inline comment</li>\n</ul>\n</li>\n<li><code>/* some comment spanning multiple lines */</code>\n<ul>\n<li>Block comment</li>\n</ul>\n</li>\n</ul>\n<h4>Scopes</h4>\n<p>In Scriptax, there is no global scope. Every piece of data belongs to a scope. There are many different scope types within Scriptax:</p>\n<ul>\n<li>Script Scope - These are symbols that are accessible within an entire script. Examples of these are sig parameters or script level variables.</li>\n<li>Method Scope - These are symbols that are accessible from within a method. Of course, this scope inherits from the script scope.</li>\n<li>Flow/Block Scope - These are symbols that are accessible within a flow block such as if statements or loops. Of course, this scope inherits from the script scope.</li>\n<li>Callback Scope - These are symbols that are accessible within a callback. Usually, a <code>result</code> variable will be accessible as well as any other values passed in via <code>(optional=parameter) -&gt; {% %}</code> syntax. Typically callback scope is read only and any changes made to any variables in here will only be changed within the callback scope. The only exception to this is the <code>result</code> variable which is generally used to pass data back in a return style.</li>\n</ul>\n<p><code>Script</code>, <code>Method</code>, and <code>Flow/Block</code> scopes will all inherit their parent scopes. <code>Callback</code> scopes on the other hand are completely isolated and must be told explicilty which symbols are allowed in and they will only be allowed in as read-only.</p>\n<h4>Architecture</h4>\n<ul>\n<li>In Scriptax, every file is considered an object. In other words, every file is analogous to <code>class</code> in other programming and scripting languages.</li>\n<li>Instances in Scriptax only ensure that variables in the script scope are unique.</li>\n<li>Methods in Scriptax are inherently <code>static</code>. In other words, methods are not unique per instance and can be called on the script itself or on a script instance. If a method is called via the script itself and attempts to utilize script scope variables, an error will be thrown.</li>\n</ul>\n<h4>Structure</h4>\n<p>Scriptax has a structure which must be followed or else errors will be thrown or the script will complete with errors.</p>\n<p>The first few lines of a script are dedicated to <code>global_statements</code>. These statements include <code>extends</code>, <code>signature</code>, <code>options</code>, and finally <code>imports</code>. Scriptax is extremely strict when it comes to <code>global_statements</code> and thus they must even be in order. If you choose to use <code>extends</code> it must be the first statement in the file with no exceptions. If you choose to use <code>signature</code> it must come immediatly after <code>extends</code>, but if you aren't using <code>extends</code> then <code>signature</code> must be the first statement within the file, so on and so forth. The order of <code>global_statements</code> is as follows:</p>\n<ol>\n<li><code>extends</code></li>\n<li><code>signature</code></li>\n<li><code>options</code></li>\n<li><code>imports</code></li>\n</ol>\n<p>While <code>extends</code>, <code>signature</code>, and <code>options</code> should only ever occur 0 or 1 times within a script file, <code>imports</code> can occur 0..n times within a file.</p>\n<p>After the <code>global_statements</code> feel free to use any non global statements as you see fit.</p>\n<h4>Scriptax Gotchas/Tips/Tricks</h4>\n<ul>\n<li>Accessing parameters as defined by <code>sig</code> should be done like so: <code>param.firstParam</code> where <code>firstParam</code> is the name of the parameter</li>\n<li>For best compatbility with Apitax/Dashboard and Apitax/CLI, please start each Scriptax file with a <code>sig</code> line if nessecary.</li>\n<li>You can use arrays via dot notation\n<ul>\n<li>set someVar.1 = num1</li>\n<li>set someVar.2 = num2</li>\n<li>set someVar.&lt;counter&gt; = num3</li>\n<li>When doing this, the first usage of a variable must either be someVar = \"{}\" or an index as part of that object. Failure to do this will result in errors being thrown.</li>\n</ul>\n</li>\n</ul>\n<h4>Best Practices</h4>\n<ul>\n<li>End each script with <code>await;</code> to ensure all async requests are completed before it returns to the parent script.\n<ul>\n<li>Ending with <code>await;</code> followed by <code>return \\&lt;someVar\\&gt;;</code> is also acceptable</li>\n</ul>\n</li>\n<li>Delete unused variables from the root scope when they are no longer needed <code>del \\&lt;someVar\\&gt;</code></li>\n<li>Only export/return necessary variables from subscripts</li>\n<li>Keep the root scope as clean as possible</li>\n<li>Scripts should be small, containerized pieces of code that strictly follow SRP.\n<ul>\n<li>Think of Scripts as lego blocks, eventually you can put a bunch of them together to build something really cool</li>\n</ul>\n</li>\n<li>Scriptax is a flexible, forgiving, and powerful language\n<ul>\n<li>Play around to see what you can and cannot do. There are too many edge cases to list explicitly.</li>\n</ul>\n</li>\n</ul>\n<h4>Coming Soon</h4>\n<ul>\n<li>A time method</li>\n</ul>\n<h3>Commandline Interface (CLI)</h3>\n<ul>\n<li>You can activate Apitax from the CLI directly without needing a wrapper package</li>\n<li>Run the tests.py file found in the root Apitax directory, and supply the following arguments\n<ul>\n<li>--cli : (Optional) Quickly select CLI mode</li>\n<li>--api : (Optional) Quickly select web server mode</li>\n<li>--debug : (Optional) Output the request response status, headers, and body</li>\n<li>-u &lt;input&gt; : (Optional) Specify the authentication username - Only applicable in CLI mode</li>\n<li>-p : (Optional) Ask for password input right away. If -u is specified, but this is not, the application will ask for a new set of credentials for authentication. But, it will use the -u value for any username fields within further requests. This allows someone to authenticate as admin, but run commands applicable to another user.</li>\n<li>-r &lt;Input&gt; : (Optional) The request - Only applicable in CLI mode</li>\n<li>-s &lt;input&gt; : (Optional) Run a script of requests specified by the file path &lt;input&gt;, authentication for all of these requests are specified by -u &amp; -p</li>\n</ul>\n</li>\n</ul>\n<h3>Modes</h3>\n<ul>\n<li>CLI : Make a request from the command line</li>\n<li>API : Start the api server</li>\n</ul>\n<h3>Configuration</h3>\n<ul>\n<li>An example configuration file is stored in the root of the repo</li>\n</ul>\n<h3>Supported Authentication</h3>\n<ul>\n<li>Authentication is prebuilt for HTTP Basic and Token based authentication</li>\n<li>Authentication is largely left up to a developer in custom scenarios\n<ul>\n<li>Driver files facilitate this requirement</li>\n</ul>\n</li>\n</ul>\n<h3>Drivers and Plugins</h3>\n<p>** This has been redone and requires updated configuration **</p>\n<ul>\n<li>Drivers and plugins are used to extend the functionality of Apitax to an arbitrary API</li>\n<li>Drivers must be dynammically added to the application via the <code>project.py</code> file. Please see Apitax/StarterPack for an example of how this can be done.</li>\n</ul>\n<h3>Examples of Apitax in Action:</h3>\n<h4>Commandtax Examples</h4>\n<pre><code>custom --get --url &lt;someEndpoint&gt;\ncustom --get --url &lt;someEndpoint&gt; --data-param '{\"is_domain\": true}'\ncustom --post --url &lt;someEndpoint&gt; --data-post '{\"title\": \"im the title\"}'\ncustom --put --url &lt;someEndpoint&gt; \ncustom --patch --url &lt;someEndpoint&gt;\ncustom --delete --url &lt;someEndpoint&gt; \ncustom --get --url &lt;someEndpoint&gt; --data-param '{\"user.id\": \"1\"}'\ncustom --get --url &lt;someEndpoint&gt;/with/some/{ohyear}/url/params/{981} --data-param '{\"is_domain\": true}' --data-path '{\"ohyeah\":\"no\", \"981\": \"yes\"}'\n</code></pre>\n<p><code>script ~/path/to/my/script.ah</code></p>\n<h4>Scriptax Examples</h4>\n<pre><code>// async-tests.ah\n\nurl \"https://jsonplaceholder.typicode.com\";\n\nbob = [];\nthreads = [];\n\n/*each get(\"/users\", {})\n{%\n\turl \"https://jsonplaceholder.typicode.com\";\n\tthreads[] = async get(\"/posts\", {\n          \t\"query\": {\n                \"userId\": result.id,\n            },\n        }) {%\n        \tlog(\"The user has these posts: \" + result);    \n        %};\n%};*/\n\nfor user in get(\"/users\", {})\n    threads[] = async get(\"/posts\", {\n            \"query\": {\n                \"userId\": user.id,\n            },\n        }) {%\n        log(\"The user has these posts: \" + result);\n        //bob[] = result;\n    %};\n\nawait threads;\n\ndel threads;\n\nscript(\"apitax/grammar/scripts/base.ah\");\n\nlog(\"yo man im at the end\");\n\n\n/*for user in get(\"/users\", {})\n    threads = async get(\"/posts\", {\n            \"query\": {\n                \"userId\": user.id,\n            },\n        }) {%\n        log(\"The user has these posts: \" + result);\n        bob[] = result\n    %};\n\n//bob[] = \"hey\";\n\nfor t in threads\n\tawait t;\n\nlog(bob);\n\nlog(\"Im quite confused\");*/\n\n</code></pre>\n<pre><code>// base.ah\n\nurl \"https://jsonplaceholder.typicode.com\";\nfor user in get(\"/users\")\n{\n    /*result = get(\"/posts\", {\n        \"query\": {\n            \"userId\": user.id,\n        }\n    });\n    log(\"The user has these posts: \" + result);*/\n\n    log(\"the user has ID: \" + user.id);\n\n    async get(\"/posts\", {\n            \"query\": {\n                \"userId\": user.id,\n            }\n        }) {%\n        log(\"The user has these posts: \" + result);\n    %};\n\n}  \n\nresponse = post(\"/posts\", {\n    \"post\": {\n        \"title\":'foo',\n        \"body\":'bar',\n        \"userId\":1\n    }\n});\n\nlog(script(\"apitax/grammar/scripts/jen.ah\", {}, \"i am parameter 1\", \"i am parameter 2\"));\n\n//response = ;\n\nlog(\"Please \" + ct(\"tests my script\", {}, \"i should be a parameter\"));\n\n\ntestlist = [\"one\", \"two\", 'three', [\"a\", 'b', 'c', 'd'], {\"test\": \"failed\", \"yes\": \"no\"}];\n\nlog(#testlist.0);\n\n\n/*async ct(\"some command execution\")\n{\nlog(\"some integrated callback\");\n}\n\nasync ct(\"some command execution\");\n\nstatus = async ct(\"some command execution\");\n\nawait status;\n\nstatus = [firstAsync, secondAsync];\nawait status;\n\nasync bobo in get(\"/users\")\n{\n    log(\"Async callback: \" + bobo);\n}*/\n\nasync get(\"/users\");\n\n\n\nsomelabel = async get(\"/users\")\n{%\n    log(\"I am an optional callback\");\n%};\n//anotherRequest0 = async get(\"/users\");\n//anotherRequest1 = async get(\"/users\");\n//anotherRequest2 = async get(\"/users\");\n\nawait somelabel;\n\nlog(\"i am that label\" + somelabel);\n\n\nget(\"/users\") {%\n\nlog(result);\n\n%};\n\nasync get(\"/users\") {%\n\nlog(result);\n\n%};\n\n\nfor iter in 10 {\n\n    async get(\"/posts\", {\n            \"query\": {\n                \"userId\": iter,\n            }\n        }) {%\n        log(\"The user has these posts: \" + result);\n    %};\n\n}\n\nlog(\"here is where the magic happens\");\n\nget(\"/posts\", {\n        \"query\": {\n            \"userId\": 5,\n        }\n    }) {%\n    log(\"The user has these posts: \" + result);\n%};\n\n\nawait;\n\n</code></pre>\n<pre><code>// jen.ah\n\noptions dict('{\"params\": [\"name\", \"game\"]}');\nanswer=2+2;\nname \"quinn\";\n\nset qwer = \"im in jens script\";\n\n\nexport qwer;\n\n//export ct(\"script apitax/grammar/scripts/shawn.ah\");\n\nset iam.hope.this.works = ct(\"custom --get --url https://jsonplaceholder.typicode.com/users\");\n\nexport iam;\n\nset test = \"hello\";\n\n//return '{\"cool\": \"beans\"}';\n\nlog(params.passed.0);\n\nlog(params.passed.1);\n\nlog(params.name);\n\nlog(params.game);\n\nlog(2+2);\n\nreturn params.passed.1;\n\n//return \"test\";\n\n\nawait;\n\n</code></pre>\n<pre><code>// my_script.ah\n\n\noptions dict('{\"params\": [\"first\"]}');\n\nlog(\"I got here\");\n\nlog(params.first);\n\nreturn \"work\";\n\n\nawait;\n\n</code></pre>\n<h2>Why use Apitax</h2>\n<p>Let's presume that a backend exists only as an entity that does nothing until it is told to do something.</p>\n<p>If this is the case let's also assume there will be no interface into the backend other than a RESTful API.</p>\n<p>Okay, so let's say we want to build a frontend that will list every user's 10 most recent posts.</p>\n<p>One way we can do this is to make an API request to retrieve a list of our users. Then, in JavaScript, we can loop through that list of users, and for each one we can make an API request to get their most recent posts. In Javascript, we can then compile this list of users together and display it.</p>\n<p>Sounds simple - except how do we then speed up this process by utilizing asynchronous code. We begin to introduce all sorts of nested callbacks, desync's in our JavaScript that are complex to sort out, difficult bug testing, and we start to break DRY as we copy bits and pieces of this code to different files/pages to list different types of data in different ways.</p>\n<p>We can solve some of our DRY problems by creating giant API classes that have helper methods for each of these types of calls, but it will still become quite a mess.</p>\n<p>What we want is to focus on frontend development - not the API request garbage. By doing this, we are enforcing SRP of the frontend architecture as a whole. The bulk of the frontend code should be dedicated to displaying data, getting input, and showing users responses from their input. It should not be thousands of lines of us making API calls and trying to organize the data. There has to be a simpler way, right?</p>\n<p>What if the frontend only had 4 different API requests to make. 1 for authentication, 1 for getting a catalog of endpoints, 1 for getting the status of the system, and finally 1 to facilitate the transfer of bidirectional data. Here is where Apitax/Commandtax comes into play. We now have a single endpoint to send a request to, and that request's payload is commandtax.</p>\n<p>Great! Now, instead of a bunch of helper methods all over the place, now we might just have some helper string constants that store frequently used commands. Already much cleaner and more workable. But, this still doesn't solve our DRY problem, SRP, or the callback and desync hell we will face from having to make several requests in a row to accomplish a task.</p>\n<p>Enter: Scriptax. Now, any of us can create little self-contained sub module files which do these sequential requests for you. These files are called Scripts. One script might have the responsibility of getting a list of users that follows some set of parameters, and another might call that users script and then using the response returned, it could get a list of posts for each of those users and return them.</p>\n<p>Okay, now our frontend only has 1 short line of commandtax which is executing a script. If the scripts are written well, there is no more callback hell, SRP is preserved, DRY is enforced, and the data returned to us will already be in a very workable format. Kaboomskies, you just saved yourself 2 dozen lines of hard to debug JavaScript, and instead, it's a one liner that returns the data already in a workable format</p>\n\n          </div>"}, "last_serial": 4466575, "releases": {"3.0.0": [{"comment_text": "", "digests": {"md5": "9248df9ce8201755e9b6d6c41c46ae26", "sha256": "96c7530cef3cec2330ec78fcb5c22b27794346d66230a7dc4a5f4da4bc389e24"}, "downloads": -1, "filename": "apitaxcore-3.0.0-py3-none-any.whl", "has_sig": false, "md5_digest": "9248df9ce8201755e9b6d6c41c46ae26", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 30281, "upload_time": "2018-09-02T16:16:26", "upload_time_iso_8601": "2018-09-02T16:16:26.838989Z", "url": "https://files.pythonhosted.org/packages/d5/46/a67b7217daad6c732ec4ab3a836e7c728831f23fcedf1b438bb469b37169/apitaxcore-3.0.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "89c44dd14dae1cff5b336afc27a49840", "sha256": "c91334c4d7830c9fddbdcee999ccaabb8c7c3fae4e7513e324a4f04b1f3d16fd"}, "downloads": -1, "filename": "apitaxcore-3.0.0.tar.gz", "has_sig": false, "md5_digest": "89c44dd14dae1cff5b336afc27a49840", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 47703, "upload_time": "2018-09-02T16:16:27", "upload_time_iso_8601": "2018-09-02T16:16:27.987047Z", "url": "https://files.pythonhosted.org/packages/a1/cc/ed2b7c9fcc5409a25b02d675dc0dcba9bb4af95f4eccb87d364cb5085a1b/apitaxcore-3.0.0.tar.gz", "yanked": false}], "3.0.1": [{"comment_text": "", "digests": {"md5": "5506755aefd17cd46480dfaaddcdc72d", "sha256": "26c6f89e1d603daf08b8b33d5cded01bc7c31b8d29c23c4579791fe34a3de48f"}, "downloads": -1, "filename": "apitaxcore-3.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "5506755aefd17cd46480dfaaddcdc72d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 30470, "upload_time": "2018-09-02T17:18:53", "upload_time_iso_8601": "2018-09-02T17:18:53.229124Z", "url": "https://files.pythonhosted.org/packages/54/c8/e7a99b69ac1ad09266ba82f9ba7957d27dcf75320676aa076a1ac5707ae0/apitaxcore-3.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "49256bc90492e57f0e7ef86297fef8b1", "sha256": "2c0ecab0168221ef1ddc1778bf6bbb07424623a4f1ec837d2cb46060b31be9bf"}, "downloads": -1, "filename": "apitaxcore-3.0.1.tar.gz", "has_sig": false, "md5_digest": "49256bc90492e57f0e7ef86297fef8b1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 47905, "upload_time": "2018-09-02T17:18:55", "upload_time_iso_8601": "2018-09-02T17:18:55.572006Z", "url": "https://files.pythonhosted.org/packages/05/ee/17845f9e23b7d5529a4334f5835719c7bff97373cad58f431c6ed34683b4/apitaxcore-3.0.1.tar.gz", "yanked": false}], "3.0.2": [{"comment_text": "", "digests": {"md5": "41bdb735ecbbb303767bf3b0516bf749", "sha256": "0e5fa754b441c6ce0809a1ec6b50fe857e68e926191fccf11e81e3f7e3c9e99b"}, "downloads": -1, "filename": "apitaxcore-3.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "41bdb735ecbbb303767bf3b0516bf749", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 30701, "upload_time": "2018-09-13T19:57:41", "upload_time_iso_8601": "2018-09-13T19:57:41.175025Z", "url": "https://files.pythonhosted.org/packages/3f/96/2c714670187d8a141ff4ed51b5d4a25413d038c8efd0da8438d1b4303e70/apitaxcore-3.0.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b7f2965d0ec4f28301c1610e46a2549f", "sha256": "a401cbefd33847b32a7bb6755458ba86a39fce09c2ea0676bf55b3543c42fb95"}, "downloads": -1, "filename": "apitaxcore-3.0.2.tar.gz", "has_sig": false, "md5_digest": "b7f2965d0ec4f28301c1610e46a2549f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 47984, "upload_time": "2018-09-13T19:57:44", "upload_time_iso_8601": "2018-09-13T19:57:44.536616Z", "url": "https://files.pythonhosted.org/packages/4d/f6/e947da4543ebc8f5569b49b88886205d19918134a54815a70b01c1171b36/apitaxcore-3.0.2.tar.gz", "yanked": false}], "3.0.3": [{"comment_text": "", "digests": {"md5": "05d5de6cfe60ac99815707ab51ed3c2a", "sha256": "9fcc4f8b703516c745fc095e13a656c0cfbb8d0ff5a2f157e9589f57374a2790"}, "downloads": -1, "filename": "apitaxcore-3.0.3-py3-none-any.whl", "has_sig": false, "md5_digest": "05d5de6cfe60ac99815707ab51ed3c2a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 31423, "upload_time": "2018-10-07T18:29:29", "upload_time_iso_8601": "2018-10-07T18:29:29.413280Z", "url": "https://files.pythonhosted.org/packages/79/79/51a118b5c412edb5ddf8725b0715a636d5bb840a27baaea8dfb239292e72/apitaxcore-3.0.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b30046e8190100ed2327729d1e9179b7", "sha256": "9b2614aa2f7698843c93462da225a24b11a5fd3ba9cc23aedae7ad29dcb32d27"}, "downloads": -1, "filename": "apitaxcore-3.0.3.tar.gz", "has_sig": false, "md5_digest": "b30046e8190100ed2327729d1e9179b7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 47986, "upload_time": "2018-10-07T18:29:33", "upload_time_iso_8601": "2018-10-07T18:29:33.396980Z", "url": "https://files.pythonhosted.org/packages/99/71/92eb300d2128d39abb2c98c8471ff54be1fc75b9480a971b3448634878bc/apitaxcore-3.0.3.tar.gz", "yanked": false}], "3.0.4": [{"comment_text": "", "digests": {"md5": "baf71d69486111cd934137588ef95304", "sha256": "e85f17a71678c2ec1fd63daee52f85adbdb8763c11d5fe67d7f772f00387a8a8"}, "downloads": -1, "filename": "apitaxcore-3.0.4-py3-none-any.whl", "has_sig": false, "md5_digest": "baf71d69486111cd934137588ef95304", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 31424, "upload_time": "2018-10-07T18:30:32", "upload_time_iso_8601": "2018-10-07T18:30:32.854813Z", "url": "https://files.pythonhosted.org/packages/9c/a6/e984cea66790b55948c472d42659ccfc2a1cb03457878ef27f0a008e8a88/apitaxcore-3.0.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "765437664ce17c6974d31e9c70fef751", "sha256": "38f1ff5245c1496be6494affd863be5838679b168d981c33bbc62a7b20c82d7a"}, "downloads": -1, "filename": "apitaxcore-3.0.4.tar.gz", "has_sig": false, "md5_digest": "765437664ce17c6974d31e9c70fef751", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 47985, "upload_time": "2018-10-07T18:30:36", "upload_time_iso_8601": "2018-10-07T18:30:36.895636Z", "url": "https://files.pythonhosted.org/packages/58/20/1ea942760ae8397efa5dedf094cdbc54f5e17f0c58a20f5ae6da5b513a4b/apitaxcore-3.0.4.tar.gz", "yanked": false}], "3.0.5": [{"comment_text": "", "digests": {"md5": "3044b45e3fdcee9b86dce0ea64f0ac02", "sha256": "4ac0b8ed75bd2f9406fa60bf9df2c804ad5b546cf389742cb3258fc7118ba171"}, "downloads": -1, "filename": "apitaxcore-3.0.5-py3-none-any.whl", "has_sig": false, "md5_digest": "3044b45e3fdcee9b86dce0ea64f0ac02", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 31415, "upload_time": "2018-10-07T18:36:50", "upload_time_iso_8601": "2018-10-07T18:36:50.430563Z", "url": "https://files.pythonhosted.org/packages/c3/ab/d619d5d1e0d3272ebcd2769abd314fbb7c502ca43950465167464f775702/apitaxcore-3.0.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f102b8f3d29cd74b6acdf569fdc9f4e5", "sha256": "3a71ec225b52e8b890723b1f3928e3870a8de6842f7784af2080fdab92e4798f"}, "downloads": -1, "filename": "apitaxcore-3.0.5.tar.gz", "has_sig": false, "md5_digest": "f102b8f3d29cd74b6acdf569fdc9f4e5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 48008, "upload_time": "2018-10-07T18:36:55", "upload_time_iso_8601": "2018-10-07T18:36:55.035564Z", "url": "https://files.pythonhosted.org/packages/c5/ac/da6a1ad3d8a3d65472215ec0e6329761a95aa15f0bdf45e9898374d10a91/apitaxcore-3.0.5.tar.gz", "yanked": false}], "3.0.6": [{"comment_text": "", "digests": {"md5": "ad7ae6cf7c2cda817f497ef8cc007184", "sha256": "f3629b70b7f2f82eaac8e43cc3132ef86541bfb31e2c9aa59d3b6c1d07a4e28e"}, "downloads": -1, "filename": "apitaxcore-3.0.6-py3-none-any.whl", "has_sig": false, "md5_digest": "ad7ae6cf7c2cda817f497ef8cc007184", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 43920, "upload_time": "2018-10-21T22:46:12", "upload_time_iso_8601": "2018-10-21T22:46:12.697437Z", "url": "https://files.pythonhosted.org/packages/dd/ff/0c4e7b82017db032745ac4fb70f9672726e35fe26344779d859989530564/apitaxcore-3.0.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6e7cdc7b119ec5dc2ac2743eb5730e13", "sha256": "9eb274fcf7395ab6d3c1ac0d51fa264d5141f35ed55efe60d3448a496dc25197"}, "downloads": -1, "filename": "apitaxcore-3.0.6.tar.gz", "has_sig": false, "md5_digest": "6e7cdc7b119ec5dc2ac2743eb5730e13", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 48057, "upload_time": "2018-10-21T22:46:14", "upload_time_iso_8601": "2018-10-21T22:46:14.777410Z", "url": "https://files.pythonhosted.org/packages/e8/67/2e03ac20b6a7400e54e912a4689f408b12a94a554ec3cff82cc878e2ebaf/apitaxcore-3.0.6.tar.gz", "yanked": false}], "3.0.7": [{"comment_text": "", "digests": {"md5": "8afbd813a86f28e5553f82e23ae00c6a", "sha256": "da299b24df9e5996a9cd922b1d18125443f4e54a50a5ac90703fec3ea32020a9"}, "downloads": -1, "filename": "apitaxcore-3.0.7-py3-none-any.whl", "has_sig": false, "md5_digest": "8afbd813a86f28e5553f82e23ae00c6a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 44344, "upload_time": "2018-11-07T18:09:34", "upload_time_iso_8601": "2018-11-07T18:09:34.312741Z", "url": "https://files.pythonhosted.org/packages/c1/d2/4fa0b181b0683355ab1495adff00dde71c111b1c221edd5d2bea6237b8ba/apitaxcore-3.0.7-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d1a6312eefc5f74a650599d5f6f68704", "sha256": "93ae649f4ad33d7296ca1f18f509e25b5f3d18b1da6bdc920417ae5590e731e0"}, "downloads": -1, "filename": "apitaxcore-3.0.7.tar.gz", "has_sig": false, "md5_digest": "d1a6312eefc5f74a650599d5f6f68704", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 48199, "upload_time": "2018-11-07T18:09:36", "upload_time_iso_8601": "2018-11-07T18:09:36.819969Z", "url": "https://files.pythonhosted.org/packages/f4/ea/8ef13597c6716baf8186e70be8164d6b209dc2c38a1552d65b4c3624c398/apitaxcore-3.0.7.tar.gz", "yanked": false}], "3.0.8": [{"comment_text": "", "digests": {"md5": "3a42ef1b2fccd0ad812c30334661c7b2", "sha256": "7c9dcb3226952890a0f1b5bc1ae88791ca8e41b79e9d92b6043d00c9fe6f8a4e"}, "downloads": -1, "filename": "apitaxcore-3.0.8-py3-none-any.whl", "has_sig": false, "md5_digest": "3a42ef1b2fccd0ad812c30334661c7b2", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 44345, "upload_time": "2018-11-07T18:29:30", "upload_time_iso_8601": "2018-11-07T18:29:30.912036Z", "url": "https://files.pythonhosted.org/packages/ae/0b/155ab86cc717d134f1f636fbb0e4cf4e079df23ea5653fde5cf4d5942efc/apitaxcore-3.0.8-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4fa2595edb43b87fd05e9e78516c08d6", "sha256": "c5db4ff6ed18c4e54c89240207011ca8d22a9af6778efef7af58466abd3aeafd"}, "downloads": -1, "filename": "apitaxcore-3.0.8.tar.gz", "has_sig": false, "md5_digest": "4fa2595edb43b87fd05e9e78516c08d6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 48199, "upload_time": "2018-11-07T18:29:33", "upload_time_iso_8601": "2018-11-07T18:29:33.639858Z", "url": "https://files.pythonhosted.org/packages/b4/48/a09545c55fcb00bcbac8f86ac20fd704349f80d6b9df2393f2bc263e848a/apitaxcore-3.0.8.tar.gz", "yanked": false}], "3.0.9": [{"comment_text": "", "digests": {"md5": "1f2e51480d96dc01fe7973c7b2be3615", "sha256": "1f9a538250bdab838fe9d7948f81d8787d053b53ca0f5bc62c43ebb06174618e"}, "downloads": -1, "filename": "apitaxcore-3.0.9-py3-none-any.whl", "has_sig": false, "md5_digest": "1f2e51480d96dc01fe7973c7b2be3615", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 44622, "upload_time": "2018-11-08T18:28:13", "upload_time_iso_8601": "2018-11-08T18:28:13.674893Z", "url": "https://files.pythonhosted.org/packages/0d/c2/0cd28cbaf54b0ec65fd71aecc4df40104ccb96a886b4449d3f2c8110f3d0/apitaxcore-3.0.9-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "cff2ab4bd829a5eebc92657587284bb0", "sha256": "00ed921534552ef58ce63f8c9ab2924a9ca9b480e29a70517145b43540a25be2"}, "downloads": -1, "filename": "apitaxcore-3.0.9.tar.gz", "has_sig": false, "md5_digest": "cff2ab4bd829a5eebc92657587284bb0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 48283, "upload_time": "2018-11-08T18:28:17", "upload_time_iso_8601": "2018-11-08T18:28:17.042389Z", "url": "https://files.pythonhosted.org/packages/7a/6a/a2102402fb02d329f4ea02b8b2124ddf3c670444e0e71ecc60f15a4b5e72/apitaxcore-3.0.9.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "1f2e51480d96dc01fe7973c7b2be3615", "sha256": "1f9a538250bdab838fe9d7948f81d8787d053b53ca0f5bc62c43ebb06174618e"}, "downloads": -1, "filename": "apitaxcore-3.0.9-py3-none-any.whl", "has_sig": false, "md5_digest": "1f2e51480d96dc01fe7973c7b2be3615", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 44622, "upload_time": "2018-11-08T18:28:13", "upload_time_iso_8601": "2018-11-08T18:28:13.674893Z", "url": "https://files.pythonhosted.org/packages/0d/c2/0cd28cbaf54b0ec65fd71aecc4df40104ccb96a886b4449d3f2c8110f3d0/apitaxcore-3.0.9-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "cff2ab4bd829a5eebc92657587284bb0", "sha256": "00ed921534552ef58ce63f8c9ab2924a9ca9b480e29a70517145b43540a25be2"}, "downloads": -1, "filename": "apitaxcore-3.0.9.tar.gz", "has_sig": false, "md5_digest": "cff2ab4bd829a5eebc92657587284bb0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 48283, "upload_time": "2018-11-08T18:28:17", "upload_time_iso_8601": "2018-11-08T18:28:17.042389Z", "url": "https://files.pythonhosted.org/packages/7a/6a/a2102402fb02d329f4ea02b8b2124ddf3c670444e0e71ecc60f15a4b5e72/apitaxcore-3.0.9.tar.gz", "yanked": false}], "timestamp": "Thu May  7 18:17:44 2020"}