{"info": {"author": "AppDynamics", "author_email": "python@appdynamics.com", "bugtrack_url": null, "classifiers": [], "description": "\nPython Agent for AppDynamics\n============================\n\n::\n\n APPDYNAMICS, INC.\n\n END USER LICENSE AGREEMENT\n\n 1. SOFTWARE LICENSE.\n\n 1.1 LICENSE GRANT.\n\n This End User License Agreement (this “Agreement”) between AppDynamics, Inc., a Delaware corporation with its principal place of business located at 303 Second Street, North Tower, 8th Floor, San Francisco, CA 94107 (“AppDynamics”) and the customer set forth in the Order Form (as defined below) (“End User”) is effective as of the date the initial Order Form is executed or the date this Agreement is referenced by the applicable purchase order (the “Effective Date”). This Agreement shall govern each order form, sales quotation, proposal, purchase order or other ordering document that references this Agreement (each an “Order Form”). Each Order Form will form part of this Agreement. Subject to the terms and conditions of this Agreement, AppDynamics hereby grants to End User, during the License Term (as defined below), a non-exclusive, non-transferable, non-sublicensable right and license to use the software-as-a-service and/or on-premises version of AppDynamics’ application intelligence software product, including one Controller, as designated in the Order Forms (the “Software”) for internal business purposes only for the quantity of units in the Order Form. AppDynamics Test & Dev Edition licenses shall only be used in test-only non-production environments. For purposes hereof, the “License Term” begins on the date AppDynamics delivers the Software license keys to End User and extends for the period specified in the applicable Order Form (unless earlier terminated in accordance with this Agreement). For the avoidance of doubt, End User’s affiliates (and employees thereof) shall not use the Software without AppDynamics’ prior written consent. Notwithstanding anything to the contrary herein, this Agreement does not supersede a signed agreement between AppDynamics and End User with respect to the Software.\n\n 1.2 RESTRICTIONS ON USE.\n\n Except as otherwise expressly provided in this Agreement, End User shall not (and shall not permit any third party to): (a) sublicense, sell, resell, transfer, assign, distribute, share, lease, rent, make any external commercial use of, outsource, use on a timeshare or service bureau, or use in an application service provider or managed service provider environment, or otherwise generate income from the Software; (b) copy the Software onto any public or distributed network, except for an internal and secure cloud computing environment; (c) cause the decompiling, disassembly, or reverse engineering of any portion of the Software, or attempt to discover any source code or other operational mechanisms of the Software (except where such restriction is expressly prohibited by law without the possibility of waiver, and then only upon prior written notice to AppDynamics); (d) modify, adapt, translate or create derivative works based on all or any part of the Software; (e) use any Third Party Software (as defined below) provided with the Software other than with the Software; (f) modify any proprietary rights notices that appear in the Software or components thereof; (g) publish the results of any benchmarking tests run on any Third Party Software; (h) use any Software in violation of any applicable laws and regulations (including any export laws, restrictions, national security controls and regulations) or outside of the license scope set forth in Section 1.1; (i) use the Software in support of any nuclear proliferation, chemical weapon, biological weapon or missile proliferation activity; (j) configure the Software to collect any (1) social security numbers or other government-issued identification numbers, (2) passwords or other authentication credentials, (3) health information, biometric data, genetic data, or payment/financial information, (4) any data relating to a person under the age of 13 years old, or (5) any other data that is subject to regulatory or contractual handling requirements (e.g., PCI, HIPAA, or state and federal data security laws) (collectively, “Prohibited Data”); or (k) use the Software to (1) store, download or transmit infringing, libelous, or otherwise unlawful or tortious material, or malicious code or malware, or (2) engage in phishing, spamming, denial-of-service attacks or other fraudulent or criminal activity, (3) interfere with or disrupt the integrity or performance of third party systems, or the Software or data contained therein, or (4) attempt to gain unauthorized access to the Software or AppDynamics' systems or networks, or (5) perform, or engage any third party to perform, authenticated or unauthenticated penetration testing, vulnerability assessments or other security assessments on the SaaS version of the Software. End User shall not export or re-export, directly or indirectly, any Software or technical data or any copy, portions or direct product thereof (i) in violation of any applicable laws and regulations, (ii) to any country for which the United States or any other government, or any agency thereof, at the time of export requires an export license or other governmental approval, including Cuba, Libya, North Korea, Iran, Iraq, or Rwanda or any other Group D:1 or E:2 country (or to a national or resident thereof) specified in the then current Supplement No. 1 to part 740 of the U.S. Export Administration Regulations (or any successor supplement or regulations, without first obtaining such license or approval) or (ii) to anyone on the U.S. Treasury Department’s list of Specially Designated Nationals or the U.S. Commerce Department’s Table of Denial Orders. End User shall, at its own expense, obtain all necessary customs, import, or other governmental authorizations and approvals.\n\n 1.3 EVALUATION USE.\n\n If End User accessed the Software pursuant to a no-fee or beta evaluation (“Evaluation Use”), then the License Term is for the period enabled by the license key for the Software provided by AppDynamics. AppDynamics shall have the right to downgrade, limit or otherwise modify the Software provided for Evaluation Use at any time without notice, and no warranty, indemnity, Maintenance or Support obligations of AppDynamics will apply to Evaluation Use. End User may use the number and type of licenses indicated by AppDynamics in writing prior to End User downloading or accessing the Software, which will be enabled by End User’s specific license key. AppDynamics has the right to immediately revoke and terminate any Evaluation Use at any time. End User agrees to provide feedback related to the Software as reasonably requested by AppDynamics. End User grants to AppDynamics, without charge, the fully paid-up, perpetual, sublicensable right to exploit such feedback for any purpose. Evaluation Use is not a guarantee of future product features and should not be relied upon in making any purchasing decisions.\n\n 1.4 UNAUTHORIZED USE.\n\n End User shall notify AppDynamics promptly of any unauthorized use of any password or account or any other known or suspected breach of security or misuse of the Software. End User is responsible for use of the Software by any and all employees, contractors, or other users that it allows to access the Software.\n\n 1.5 MAINTENANCE AND SUPPORT.\n\n “Support” is defined as AppDynamics' obligations to respond to support requests as described in Exhibit A (Enterprise Support). “Maintenance” means AppDynamics’ obligations related to error resolution, bug fixes and the provision of updates and upgrades made generally commercially available by AppDynamics in its sole discretion, all as described in Exhibit A. Subject to End User’s payment of the fees set forth in the applicable Order Form(s), AppDynamics will (a) provide Maintenance and Support for the Software, and (b) solely if End User has purchased access to the software-as-a-service version of the Software, make the Software available to End User in accordance with Exhibit B (Availability and Security). For time-limited licenses for the Software (as set forth in an Order Form, “Subscription Licenses”), the fees for Maintenance and Support are included in the fees for the Software. For perpetual licenses, (i) AppDynamics shall invoice End User the applicable fees for Maintenance and Support (“Maintenance and Support Fees”) upon execution of the Order Form, and (ii) subject to payment of the Maintenance and Support Fees, AppDynamics will provide Support for the Maintenance and Support period set forth in the Order Form, as it may be renewed (the “Maintenance and Support Term”). If Maintenance and Support terminates with respect to any perpetual licenses, and End User is in good standing under this Agreement, then End User may reinstate Maintenance and Support on payment of the cumulative Maintenance and Support Fees applicable for the period during which Maintenance and Support lapsed, plus Maintenance and Support Fees for the reinstated Maintenance and Support Term. Notwithstanding anything herein to the contrary, if End User receives Support from an authorized partner of AppDynamics (“Partner”), then the support terms agreed upon by End User and such Partner shall govern in lieu of those set forth in Exhibit A, and AppDynamics shall have no support obligations to End User.\n\n 1.6 SERVICES.\n\n Subject to the terms hereof (including payment of any applicable fees set forth in the Order Form), AppDynamics will provide the training, enablement and/or other services described in an Order Form (or statement of work referencing this Agreement), if any (“Services”). All Services will be rendered on a time and materials basis. AppDynamics will not exceed the total time purchased without prior written approval from End User. If the Services purchased have been consumed, AppDynamics will stop the Services until additional Services have been purchased. If End User elects not to purchase additional Services, then the Services will be deemed complete. If not used, pre-purchased Services and expenses expire twelve (12) months after the date purchased (unless otherwise set forth in the applicable Order Form). End User agrees to provide reasonable cooperation and information as necessary to permit AppDynamics to perform the Services. End User will reimburse AppDynamics for travel and expenses (at cost) incurred in connection with the Services (if any) by the Invoice Due Date (as defined below). Services will be performed on business days (a business day means Monday through Friday, excluding national holidays, during working hours, in the location where the Services are delivered). Saturday Services, and hours worked during the week that exceed the local working hours in a week, will be charged at the agreed rate x 1.5. Services performed on Sundays or national holidays will be charged at 2 x the agreed rate. If End User cancels or delays any scheduled Services less than ten (10) business days before the start date of such Services, then AppDynamics will deduct from End User's account (or End User will pay for) the amount of Services that were scheduled in any of the ten (10) business days following the date of cancellation (or notification of the delay, as applicable), and End User will fully reimburse AppDynamics for any reasonable travel and expenses incurred by AppDynamics for such Services (and for any Services rescheduled by End User) for which AppDynamics is unable to obtain a refund. During the License Term (for Subscription Licenses) or during the Maintenance and Support Term (for perpetual licenses), and in each case for a period of twelve (12) months thereafter, without AppDynamics’ prior written approval, End User will not solicit for employment or consultancy any AppDynamics’ employees who participated in the performance of Services.\n\n 2. FEES.\n\n 2.1 PRICING.\n\n End User will be invoiced for those amounts and at those prices set forth in an Order Form (an “Invoice”), provided, however, that, for Evaluation Use, End User shall not be billed unless otherwise specified by AppDynamics in writing prior to End User downloading or accessing (as applicable) the Software. Fees do not include any customization of the Software (nor support for any such customizations, unless otherwise agreed in writing). If End User’s usage of the Software is in excess of those amounts set forth in the Order Form, End User will be billed for those overages at a pro-rated amount for the remainder of the applicable License Term, based on AppDynamics’ then-current standard pricing. If AppDynamics believes in good faith that End User’s usage of the Software exceeds that set forth on the applicable Order Form, End User agrees to allow AppDynamics to audit End User’s use of the Software (not more frequently than twice per calendar year), upon at least twenty-four (24) hours’ notice, to determine the actual Software use, using a commercially reasonable auditing procedure. End User acknowledges that purchases made under this Agreement are neither contingent on the delivery of any future functionality or features nor dependent on any oral or written public comments made by AppDynamics regarding future functionality or features.\n\n 2.2 PAYMENTS.\n\n End User shall pay Invoices within thirty (30) days of the invoice date (the “Invoice Due Date”). If End User reasonably disputes any Invoice, (i) End User shall provide AppDynamics with written notice of such dispute, including the grounds therefor (a “Dispute Notice”), prior to the Invoice Due Date, (ii) End User and AppDynamics shall, for a period of fifteen (15) days following AppDynamics’ receipt of such Dispute Notice, negotiate in good faith to resolve the dispute and (iii) if such dispute remains unresolved at the end of such period, the parties shall retain all of their respective rights under this Agreement (including, without limitation, any action for non-payment of the fees set forth herein). All payment obligations are non-cancelable and all amounts paid are non-refundable, except (a) for amounts paid in error that are not actually due under this Agreement, and (b) as set forth in Sections 6.1 and 7.1. The fees paid by End User are exclusive of all taxes, levies, or duties imposed by taxing authorities, if any, and End User shall be responsible for payment of all such taxes, levies, or duties, excluding taxes based on AppDynamics’ income. End User represents and warrants that the billing and contact information provided to AppDynamics is complete and accurate, and AppDynamics shall have no responsibility for any Invoices that are not received due to inaccurate or missing information provided by End User. End User shall pay interest on all payments not received by the Invoice Due Date at a rate of one percent (1%) per month or the maximum amount allowed by law, whichever is lesser. All amounts due under this Agreement shall be paid by End User in full without any set-off, counterclaim, deduction or withholding (other than any deduction or withholding of tax as required by law). If requested by AppDynamics, End User will obtain and furnish to AppDynamics tax receipts or other certificates issued by the competent taxation office showing the payments of the withholding tax within a reasonable time after payment. Following written notice, AppDynamics shall be entitled to suspend End User’s access to the Software if payments are not received within thirty (30) days of the Invoice Due Date. Notwithstanding anything herein to the contrary, if End User makes its payments pursuant to this Agreement to a Partner, then the payment terms agreed by End User and such Partner shall govern to the extent anything in this Section 2 conflicts with such Partner payment terms.\n\n 3. CONFIDENTIALITY\n\n 3.1 SCOPE AND RESTRICTIONS.\n\n “Confidential Information” means all information of a party (“Disclosing Party”) disclosed to the other party (“Receiving Party”) that is designated in writing or identified as confidential at the time of disclosure or should be reasonably known by the Receiving Party to be confidential due to the nature of the information disclosed and the circumstances surrounding the disclosure. The terms of this Agreement, the Software, any technical or other documentation relating to the Software, logins, passwords and other access codes and any and all information regarding AppDynamics’ business, products and services are the Confidential Information of AppDynamics. The Receiving Party will: (i) not use the Disclosing Party’s Confidential Information for any purpose outside of this Agreement; (ii) not disclose such Confidential Information to any person or entity, other than its affiliates, employees, consultants, agents and professional advisers who have a “need to know” for the Receiving Party to exercise its rights or perform its obligations hereunder, provided that such employees, consultants, and agents are bound by agreements or, in the case of professional advisers, ethical duties respecting such Confidential Information in accordance with the terms of this Section 3; and (iii) use reasonable measures to protect the confidentiality of such Confidential Information. If the Receiving Party is required by applicable law or court order to make any disclosure of such Confidential Information, it will first give written notice of such requirement to the Disclosing Party, and, to the extent within its control, permit the Disclosing Party to intervene in any relevant proceedings to protect its interests in its Confidential Information, and provide full cooperation to the Disclosing Party in seeking to obtain such protection. Further, this Section 3 will not apply to information that the Receiving Party can document: (i) was rightfully in its possession or known to it prior to receipt without any restriction on its disclosure; (ii) is or has become public knowledge or publicly available through no fault of the Receiving Party; (iii) is rightfully obtained by the Receiving Party from a third party without breach of any confidentiality obligation; or (iv) is independently developed by employees of the Receiving Party who had no access to such information.\n\n 3.2 EQUITABLE RELIEF.\n\n The Receiving Party acknowledges that unauthorized disclosure of the Disclosing Party’s Confidential Information could cause substantial harm to the Disclosing Party for which damages alone might not be a sufficient remedy and, therefore, that upon any such disclosure by the Receiving Party the Disclosing Party will be entitled to seek appropriate equitable relief in addition to whatever other remedies it might have at law or equity.\n\n 4. PROPRIETARY RIGHTS. AppDynamics and its suppliers own and shall retain all proprietary rights, including all copyright, patent, trade secret, trademark and all other intellectual property rights, in and to the Software and the results of any Services. End User acknowledges that the rights granted under this Agreement do not provide End User with title to or ownership of the Software. Certain “free” or “open source” based software (the “FOSS Software”) and third party software included with the Software (the “Third Party Software”) is shipped with the Software but is not considered part of the Software hereunder. A list of the FOSS Software and Third Party Software is set forth on the webpage located at https://docs.appdynamics.com/display/DASH/Legal+Notices With respect to Third Party Software included with the Software, such Third Party Software suppliers are third party beneficiaries of this Agreement. End User’s use of such FOSS Software is subject to the terms of the licenses set forth on such webpage. The Software and Third Party Software may only be used by End User as prescribed by the AppDynamics documentation located at http://docs.appdynamics.com (as it may be updated from time to time, the “Documentation”).\n\n 5. TERM AND TERMINATION.\n\n The term of this Agreement begins on the Effective Date and will remain in effect until all Subscription Licenses (and Maintenance and Support Terms, if applicable) expire or until this Agreement is otherwise terminated in accordance with the terms hereof, whichever occurs first (the “Term”). This Agreement may be renewed at any time by execution of an Order Form referencing this Agreement, and any such renewal will be deemed part of the “Term” hereunder. If either party commits a material breach of this Agreement, and such breach has not been cured within thirty (30) days after receipt of written notice thereof, the non-breaching party may terminate this Agreement, except that AppDynamics may immediately terminate this Agreement and/or End User’s license to the Software upon End User’s breach of Section 1.2. Either party may also terminate this Agreement upon written notice if the other party suspends payment of its debts or experiences any other insolvency or bankruptcy-type event. Upon expiration or termination of this Agreement for any reason, (i) with respect to Subscription Licenses, all rights granted to End User shall terminate and End User shall destroy any copies of the Software and Documentation within End User’s possession and control; (ii) with respect to perpetual licenses, these will survive termination of this Agreement unless AppDynamics terminates the Agreement for End User’s breach of this Agreement in which case all rights granted to End User shall terminate and End User shall destroy any copies of the Software and Documentation within End User’s possession and control; and (iii) each Receiving Party will return or destroy, at the Disclosing Party’s option, the Disclosing Party’s Confidential Information in the Receiving Party’s possession or control. All fees that have accrued as of such expiration or termination, and Sections 1.2, 1.3, 1.4, 2, 3, 4, 5, 6.2 and 7 through 12, will survive any expiration or termination hereof.\n\n 6. WARRANTIES.\n\n 6.1 LIMITED WARRANTY.The limits below will not apply to the extent prohibited by applicable law.\n\n AppDynamics warrants that during the first thirty (30) days following the date the Software is purchased, the Software will, in all material respects, conform to the functionality described in the then-current Documentation for the applicable Software version. AppDynamics’ sole and exclusive obligation, and End User’s sole and exclusive remedy, for a breach of this warranty shall be that AppDynamics shall be required to use commercially reasonable efforts to repair or replace the Software to conform in all material respects to the Documentation, and if AppDynamics is unable to materially restore such functionality within thirty (30) days from the date of written notice of such breach, End User shall be entitled to terminate the license to the affected Software upon written notice and AppDynamics shall promptly provide a pro-rata refund of the Software license fees (or Maintenance and Support Fees, for perpetual licenses) that have been paid in advance for the remainder of the License Term for the applicable Software (beginning on the date of termination). End User must notify AppDynamics in writing of any warranty breaches within such warranty period, and End User must have installed and configured the Software in accordance with the Documentation to be eligible for the foregoing remedy.\n\n 6.2 WARRANTY DISCLAIMER.\n\n EXCEPT AS EXPRESSLY PROVIDED IN THIS SECTION 6, ALL SOFTWARE, DOCUMENTATION, MAINTENANCE AND SUPPORT AND SERVICES ARE PROVIDED “AS IS” AND APPDYNAMICS AND ITS SUPPLIERS EXPRESSLY DISCLAIM ANY AND ALL OTHER REPRESENTATIONS AND WARRANTIES, EITHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE WITH RESPECT THERETO, INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, NON-INFRINGEMENT, OR THE CONTINUOUS, UNINTERRUPTED, ERROR-FREE, VIRUS-FREE, OR SECURE ACCESS TO OR OPERATION OF THE SOFTWARE. APPDYNAMICS EXPRESSLY DISCLAIMS ANY WARRANTY AS TO THE ACCURACY OR COMPLETENESS OF ANY INFORMATION OR DATA ACCESSED OR USED IN CONNECTION WITH THE SOFTWARE, DOCUMENTATION, MAINTENANCE AND SUPPORT, OR SERVICES. AppDynamics is not responsible for any delays, delivery failures, or any other loss or damage resulting from the transfer of data over communications networks and facilities, including the Internet, and End User acknowledges that the Software and Documentation may be subject to limitations, delays and other problems inherent in the use of such communications facilities. The Software is not fault-tolerant and is not designed or intended for use in hazardous environments, including without limitation, in the operation of aircraft or other modes of human mass transportation, nuclear or chemical facilities, life support systems, implantable medical equipment, motor vehicles or weaponry systems, or any other application in which failure of the Software could lead to death or serious bodily injury of a person, or to severe physical or environmental damage (each, a “High Risk Use”). AppDynamics expressly disclaims any express or implied warranty or representation of fitness for High Risk Use. AppDynamics shall not be liable to End User for any loss, damage or harm suffered by End User that is directly or indirectly caused by End User’s unauthorized use of the Software to process Prohibited Data.\n\n 7. INDEMNIFICATION.\n\n 7.1 BY APPDYNAMICS.\n\n AppDynamics agrees at its expense to defend End User against (or, at AppDynamics’ option, settle), any third party claim to the extent such claim alleges that the Software infringes or misappropriates any patent, copyright, trademark or trade secret of a third party, and AppDynamics shall pay all costs and damages finally awarded against End User by a court of competent jurisdiction as a result of any such claim. In the event that the use of the Software is, or in AppDynamics’ sole opinion is likely to become, subject to such a claim, AppDynamics, at its option and expense, may (a) replace the applicable Software with functionally equivalent non-infringing technology, (b) obtain a license for End User’s continued use of the applicable Software, or (c) terminate the license and provide a pro-rata refund of the Software license fees (or Maintenance and Support Fees, for perpetual licenses) that have been paid in advance for the remainder of the License Term for the applicable Software (beginning on the date of termination). The foregoing indemnification obligation of AppDynamics will not apply: (1) if the Software is modified by End User or its agent; (2) if the Software is combined with other non-AppDynamics products, applications, or processes, but solely to the extent the alleged infringement is caused by such combination; or (3) to any unauthorized use of the Software. The foregoing shall be End User’s sole remedy with respect to any claim of infringement of third party intellectual property rights.\n\n 7.2 BY END USER.\n\n End User agrees to defend, at its expense, AppDynamics and its affiliates, its suppliers and its resellers against any third party claim to the extent such claim arises from or is made in connection with End User’s breach of Section 1 or End User’s negligence or willful misconduct, and End User shall pay all costs and damages finally awarded against AppDynamics by a court of competent jurisdiction as a result of any such claim.\n\n 7.3 INDEMNIFICATION REQUIREMENTS.\n\n In connection with any claim for indemnification under this Section 7, the indemnified party must promptly provide the indemnifying party with notice of any claim that the indemnified party believes is within the scope of the obligation to indemnify, provided, however, that the failure to provide such notice shall not relieve the indemnifying party of its obligations under this Section 7, except to the extent that such failure materially prejudices the indemnifying party’s defense of such claim. The indemnified party may, at its own expense, assist in the defense if it so chooses, but the indemnifying party shall control the defense and all negotiations related to the settlement of any such claim. Any such settlement intended to bind either party shall not be final without the other party’s written consent, which consent shall not be unreasonably withheld, conditioned or delayed; provided, however, that End User’s consent shall not be required when AppDynamics is the indemnifying party if the settlement involves only the payment of money by AppDynamics.\n\n 8. LIMITATION OF LIABILITY. The limits below will not apply to the extent prohibited by applicable law.\n\n 8.1 EXCEPT FOR LIABILITY ARISING OUT OF END USER’S BREACH OF SECTION 1.2 (RESTRICTIONS ON USE), IN NO EVENT SHALL EITHER PARTY BE LIABLE UNDER THIS AGREEMENT FOR ANY INDIRECT, INCIDENTAL, SPECIAL, PUNITIVE OR CONSEQUENTIAL DAMAGES, INCLUDING DAMAGES FOR LOSS OF REVENUES OR PROFITS, LOSS OF USE, BUSINESS INTERRUPTION, OR LOSS OF DATA, WHETHER IN AN ACTION IN CONTRACT OR TORT, EVEN IF THE OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n 8.2 EXCEPT FOR LIABILITY ARISING OUT OF END USER’S BREACH OF SECTION 1.2 (RESTRICTIONS ON USE), NEITHER PARTY’S LIABILITY FOR ANY DAMAGES (WHETHER FOR BREACH OF CONTRACT, MISREPRESENTATIONS, NEGLIGENCE, STRICT LIABILITY, OTHER TORTS OR OTHERWISE) UNDER THIS AGREEMENT SHALL EXCEED AN AMOUNT EQUAL TO THE TOTAL FEES PAID (PLUS FEES PAYABLE) TO APPDYNAMICS DURING THE TWELVE (12) MONTHS IMMEDIATELY PRECEDING THE CLAIM GIVING RISE TO SUCH DAMAGES. THESE LIMITATIONS SHALL APPLY NOTWITHSTANDING ANY FAILURE OF ESSENTIAL PURPOSE OF ANY REMEDY.\n\n 9. FORCE MAJEURE.\n\n Except for payment obligations, neither party hereto will be liable for defaults or delays due to acts of God, or the public enemy, acts or demands of any government or governmental agency, fires, earthquakes, floods, accidents, or other unforeseeable causes beyond its reasonable control and not due to its fault or negligence.\n\n 10. DATA COLLECTION.\n\n End User acknowledges that AppDynamics’ application server and machine software agents (the “Agents”) collect metrics that relate to the performance, health and resource of an application, its components (transactions, code libraries) and related infrastructure (nodes, tiers) that service those components. In addition, AppDynamics collects metrics on End Users’ activities, such as web pages visited, length of visit, and which features of the Software an End User uses. If End User provides AppDynamics with any personally identifiable information (“personal data”), End User represents and warrants that such information has been collected by End User in accordance with the provisions of all applicable data protection legislation and that End User has all right and consents necessary to provide such personal data to AppDynamics. End User will indemnify AppDynamics for reasonable costs and other amounts that AppDynamics may incur relating to any breach of this Section.\n\n 11. US GOVERNMENT MATTERS.\n\n As defined in FAR section 2.101, the Software and Documentation are “commercial items” and according to DFAR section 252.227 7014(a)(1) and (5) are deemed to be “commercial computer software” and “commercial computer software documentation.” Consistent with DFAR section 227.7202 and FAR section 12.212, any use modification, reproduction, release, performance, display, or disclosure of such commercial software or commercial software documentation by the U.S. Government will be governed solely by the terms of this Agreement and will be prohibited except to the extent expressly permitted by the terms of this Agreement.\n\n 12. MISCELLANEOUS.\n\n This Agreement shall be governed by and construed under the laws of the State of California, U.S.A. The parties consent to the exclusive jurisdiction and venue of the courts located in and serving San Francisco, California. Failure by either Party to exercise any of its rights under, or to enforce any provision of, this Agreement will not be deemed a waiver or forfeiture of such rights or ability to enforce such provision. If any provision of this Agreement is held by a court of competent jurisdiction to be illegal, invalid or unenforceable, such provision will be amended to achieve as nearly as possible the same economic effect of the original provision and the remainder of this Agreement will remain in full force and effect. This Agreement and its exhibits, together with the Order Form(s) and any statements of work incorporating this Agreement, if applicable, represent the entire agreement between the parties and supersede any previous or contemporaneous oral or written agreements or communications regarding the subject matter of this Agreement. The person signing or otherwise accepting this Agreement for End User represents that s/he is duly authorized by all necessary and appropriate corporate action to enter this Agreement on behalf of End User. Any modification to this Agreement must be in writing and signed by a duly authorized agent of both parties. The Uniform Computer Information Transactions Act (UCITA) does not apply to this Agreement. This Agreement shall control over additional or different terms of any purchase order, confirmation, invoice, statement of work or similar document (other than an AppDynamics Order Form, which will take precedence), even if accepted in writing by both parties, and waivers and amendments to this Agreement shall be effective only if made by non-pre-printed agreements clearly understood by both parties to be an amendment or waiver to this Agreement. For purposes of this Agreement, “including” means “including without limitation.” The rights and remedies of the parties hereunder will be deemed cumulative and not exclusive of any other right or remedy conferred by this Agreement or by law or equity. No joint venture, partnership, employment, or agency relationship exists between the parties as a result of this Agreement or use of the Software. AppDynamics reserves the right to perform its obligations from locations and/or through use of affiliates and subcontractors, worldwide, provided that AppDynamics will be responsible for such parties. End User may not assign this Agreement without the prior written approval of AppDynamics and any purported assignment in violation of this section shall be void; AppDynamics may assign, transfer or subcontract this Agreement in whole or in part. Upon any assignment of this Agreement by End User that is approved by AppDynamics, any licenses that contain an “unlimited” aspect will, with respect to End User or the successor entity, as applicable, be capped at the number of authorized Software units in use immediately prior to such assignment. End User agrees that AppDynamics may refer to End User by its trade name and logo, and may briefly describe End User’s business, in AppDynamics’ marketing materials and website. AppDynamics may give notice to End User by electronic mail to End User’s email address on record in End User’s account information, or by written communication sent by first class mail or pre-paid post to End User’s address on record in End User’s account information. End User may give notice to AppDynamics at any time by any letter delivered by nationally recognized overnight delivery service or first class postage prepaid mail to AppDynamics at the following address or such other address as may be notified to End User from time to time: AppDynamics, Inc., 303 Second Street, North Tower, 8th Floor, San Francisco, CA 94107, Attn: Legal Department. Notice under this Agreement shall be deemed given when received, if personally delivered; when receipt is electronically confirmed, if transmitted by email; the day after it is sent, if sent for next day delivery by recognized overnight delivery service; and upon receipt, if sent by certified or registered mail, return receipt requested.\n\n\n EXHIBIT A\n\n ENTERPRISE SUPPORT\n\n GENERAL REQUIREMENTS.\n\n AppDynamics will provide access to a ticketing system and email address (help@appdynamics.com), which will be available twenty-four (24) hours per day, seven (7) days per week. The email account will be maintained by qualified support specialists, who shall use commercially reasonable efforts to answer questions and resolve problems regarding the Software.\n\n HOURS OF OPERATION.\n\n Support is available twenty-four (24) hours per day, seven (7) days per week.\n\n ERROR CLASSIFICATION.\n\n Any reported errors are classified in the following manner, in each case when caused by\n the Software:\n\n Error Classification Criteria\n ==================== ========\n Urgent End User production application is down or there is a\n major malfunction, resulting in a business revenue loss and\n impacting the End User application functionality for a\n majority of users.\n\n High Critical loss of End User application functionality or\n performance, impacting the application functionality for a\n high number of users.\n\n Normal Moderate loss of End User application functionality or\n performance, impacting multiple users.\n\n Low Minor loss of End User application functionality or\n product feature in question.\n\n\n ERROR DEFINITION.\n\n An “error” means a reproducible malfunction in the Software that is reported by End User through AppDynamics’ ticketing system that prevents the Software from performing in accordance with the operating specifications described in the then-current Documentation.\n\n AUTHORIZED SUPPORT CONTACTS.\n\n Maintenance and Support will be provided solely to End User’s designated support contacts. The Order Form may indicate a maximum number of designated support contacts for End User’s service level. End User will provide its designated support contacts, including its primary email address.\n\n END USER’S OBLIGATION TO ASSIST.\n If End User reports a purported error in the Software to AppDynamics, AppDynamics’ ticketing system will request the following minimum information:\n\n A general description of the operating environment\n A list of all hardware components, operating systems and networks\n A reproducible test case\n Any log files, trace and systems files\n\n End User’s failure to provide this information may prevent or significantly delay AppDynamics’ ability to identify and fix the reported error. AppDynamics’ time to respond to any error will begin when AppDynamics has received all requested information from the End User and is able to reproduce the error.\n\n\n ERROR RESOLUTION.\n\n If AppDynamics determines there is an error in the Software, AppDynamics may, at its sole option, repair that error in the version of the Software that End User is currently using or instruct End User to install a newer version of the Software with that error repaired. AppDynamics reserves the right to provide End User with a workaround in lieu of fixing an error.\n\n\n SOFTWARE UPDATES AND UPGRADES. End User must be current on fees in order to receive access to Maintenance.\n\n\n RESPONSE TIME. AppDynamics shall respond to error tickets in accordance with the tables set forth below. AppDynamics will use reasonable means to repair the error and keep End User informed of progress. AppDynamics makes no representations as to when a full resolution of the error may be made.\n\n Error Initial Response Manager Escalation VP Escalation Email Status Updates\n ===== ================ ================== ============= ====================\n Urgent 1 Hour 1 Business Day 1 Week Daily\n High 6 Hours 1 Week 2 Weeks Weekly\n Normal 1 Business Day Quarterly Review None None\n Low 2 Business Days Semi-Annual Review None None\n\n Maintenance and Support Policy: The Maintenance and Support policy is as follows:\n\n AppDynamics provides Maintenance and Support for each version of the Software for a period of twelve (12) months after the generally available release of the next major version of the Software (a major release is a change in the first number to the right of the decimal point). For example, if version 4.1 is released on January 1, 2015, then AppDynamics will provide Maintenance and Support for version 4.0 until January 1, 2016. AppDynamics does not provide Maintenance or Support for any customized software (or components thereof).\n\n For third party software or technology used by End User with the Software but not included with the Software (a “Platform”, such as Java Virtual Machines), AppDynamics will follow the end-of-life (“EOL”) support timeline announced by the third party vendor of such Platform. AppDynamics will stop providing Maintenance and Support for an EOL’d Platform version when the Platform vendor stops providing maintenance and support for that Platform version.\n\n\n EXHIBIT B\n AVAILABILITY AND SECURITY\n\n The terms set forth in this Exhibit B apply only if End User has purchased access to the online software-as-a-service (“SaaS”) version of the Software, as indicated on the Order Form.\n\n AVAILABILITY.\n\n AppDynamics will provide System Availability (as defined below) of ninety-nine and one-half percent (99.5%) (the “Availability SLA”), excluding situations identified as “Exclusions” below. For purposes of the Availability SLA, the AppDynamics network extends to, includes and terminates at the data center located router that provides the outside interface of each of AppDynamics’ WAN connections to its backbone providers (the “AppDynamics Network”).\n\n “Exclusions” means any outage that results from any of the following:\n a. Any Maintenance performed by AppDynamics during AppDynamics’ standard Maintenance windows. AppDynamics will notify End User within forty-eight (48) hours of any standard Maintenance and within twenty-four (24) hours for other non-standard emergency Maintenance (collectively referred to herein as “Scheduled Maintenance”).\n\n b. End User's information content or application programming, or the acts or omissions of End User or its agents, including, without limitation, the following:\n 1. End User’s use of any programs not supplied by AppDynamics;\n 2. End User’s failure to provide AppDynamics with reasonable advance prior notice of any pending unusual large deployments of new nodes (i.e., adding over ten percent (10%) total nodes in less than twenty-four (24) hours);\n 3. End User’s implementation of any significant configuration changes, including changes that lead to a greater than thirty percent (30%) change in a one week period or greater than fifty percent (50%) change in a one month period in the number of key\n objects in the system including but not limited to metrics, snapshots, nodes, events and business transactions;\n 4. Any misconfiguration by End User (as determined in AppDynamics’ sole discretion), including configuration errors and unintended usage of the Software;\n 5. End User’s failure to upgrade the Agents to keep the Agent versions within six (6) months of the Controller version; or\n 6. End User’s implementation of configuration changes in the number of key objects in the Software (including metrics, snapshots, nodes, events and business transactions) that results in, or is likely to result in, an adverse impact on other customers.\n\n c. Force majeure or other circumstances beyond AppDynamics’ reasonable control that could not be avoided by its exercise of due care.\n\n d. Failures of the Internet backbone itself and the network by which End User connects to the Internet backbone or any other network unavailability outside of the AppDynamics Network, such as misconfigurations, proxies or firewalls.\n\n e. Any window of time when End User agrees that Software availability/unavailability will not be monitored or counted.\n\n f. Any problems resulting from End User combining or merging the Software with any hardware or software not supplied by AppDynamics or not identified by AppDynamics in the Documentation as being compatible with the Software.\n\n g. End User’s or any third party’s use of the Software in an unauthorized or unlawful manner.\n\n Remedies for Excessive Downtime:\n\n In the event the availability of the Software falls below the Availability SLA in a given calendar quarter, AppDynamics will pay End User a service credit (“Service Credit”) as follows, corresponding to the actual Availability of the Software during the applicable calendar quarter (on pro-rated basis for annual or multi-year fees): if the Availability is 99.5% or greater, End User is entitled to receive no credits; if the Availability is 97.0% - 99.49%, then End User is entitled to receive Service Credits equal to five percent of the fees for the applicable calendar quarter (not to exceed $280); if the Availability is 95.0% - 96.9%, then End User is entitled to receive Service Credits equal to ten percent of the fees for the applicable calendar quarter (not to exceed $560); and if the Availability is less than 95.0%, then End User is entitled to receive Service Credits equal to twenty percent of the fees for the applicable calendar quarter (not to exceed $1120). Such Service Credit will be issued as a credit against any fees owed by End User for the next calendar quarter of the Term, or, if End User does not owe any additional fees, then AppDynamics will pay End User the amount of the applicable Service Credit within thirty (30) days after the end of the calendar quarter in which such credit accrued. To receive Service Credits, End User must submit a written request to AppDynamics (to customersuccess@appdynamics.com with a copy to legal@appdynamics.com) within 15 days after the end of the quarter in which the Software was unavailable, or End User’s right to receive Service Credits with respect to such unavailability will be waived. The remedies stated in this section are End User’s sole and exclusive remedies and AppDynamics’ sole and exclusive obligations for service interruption or unavailability.\n\n “System Availability” is measured by the following formula: (n - y) *100 / n\n (1) “n” is the total number of minutes in the given calendar quarter minus the Exclusions (as defined above); and “y” is the total number of minutes in the given calendar quarter that the Controller is not accessible by End User (as determined by AppDynamics’ tools).\n (2) Specifically excluded from “n and “y” in this calculation are the Exclusions.\n\n SECURITY INFORMATION.\n\n For all End User data stored in the software-as-a-service version of the Software, AppDynamics will satisfy all of its obligations under Section 3 by maintaining the security precautions described below.\n Certifications\n AppDynamics is SOC 2 Type II compliant, meaning it has been independently audited to verify the validity and functionality of its control activities and processes. Customers may request AppDynamics’ report at any time. AppDynamics’ data center provider is also SOC 2 Type II compliant.\n\n Secure Connections\n Agents initiate connections to a single Controller, which can either be hosted on-premises by the customer or by AppDynamics via the AppDynamics’ software-as-a-service platform. The “Controller” is the central repository and analytics engine where all performance data is stored, baselined, and analyzed. If End User downloads the Agent from End User’s controller (ie., using the installation wizard provided by AppDynamics), then transport layer security (TLS) for Agent-to-Controller communication is enabled by default. For other installations, AppDynamics recommends enabling SSL/TLS encryption for Agent communications. For detailed instructions please see docs.appdynamics.com. Agents also support outbound HTTP proxies for customers using these security mechanisms. For Software user interface access, AppDynamics redirects all traffic to HTTPS.\n\n Access Controls to Data\n Access to collected data and data collection features is restricted to authenticated customer users by role-based access controls (RBAC). In addition, customer users do not have native access to run queries on the Controller’s MySQL database.\n\n Availability\n Servers for the software are operated in fault-tolerant architecture in a manner designed to ensure availability. Data is backed up nightly and stored redundantly. AppDynamics also provides an off-site backup service. Software security updates and patches are evaluated by engineers and are deployed based upon the security risks and stability benefits they offer to the Software and End Users.\n\n Security\n Access to the Software platform infrastructure and data by AppDynamics personnel is secured by authentication methods including public key authentication, passwords and network access control lists. Infrastructure and data access is restricted to AppDynamics’ employees and contractors subject to confidentiality agreements. System and network activity for the Software are regularly monitored by a team of engineers. Failed authentication attempts are audited and engineers are paged so that intrusions or threats can be investigated. Standard firewall policies are deployed to block access except to ports required for Software and Agent communication.\n\n Sensitive Data\n AppDynamics recommends on-premises (rather than software-as-a-service) deployments for customers subject to heightened regulatory oversight of data.\n\n More Information\n For more information on data privacy or security processes please contact help@appdynamics.com or your account representative. To report a suspected security breach, contact security@appdynamics.com.\n AppDynamics Proprietary and Confidential * Revision 2016.11.01\n\n\n", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://www.appdynamics.com/python", "keywords": "", "license": "See license in package description", "maintainer": "", "maintainer_email": "", "name": "appdynamics", "package_url": "https://pypi.org/project/appdynamics/", "platform": "", "project_url": "https://pypi.org/project/appdynamics/", "project_urls": {"Homepage": "https://www.appdynamics.com/python"}, "release_url": "https://pypi.org/project/appdynamics/20.3.0/", "requires_dist": ["appdynamics-bindeps-osx-x64 (==11.0); (sys_platform == \"darwin\") and (platform_machine == \"x86_64\" or platform_machine == \"AMD64\")", "appdynamics-proxysupport-osx-x64 (==1.8.0.212.1); (sys_platform == \"darwin\") and (platform_machine == \"x86_64\" or platform_machine == \"AMD64\")", "appdynamics-bindeps-linux-x86 (==11.0); (sys_platform == \"linux\" or sys_platform == \"linux2\" or sys_platform == \"linux3\" or sys_platform == \"linux4\") and (platform_machine == \"i386\" or platform_machine == \"i686\")", "appdynamics-proxysupport-linux-x86 (==1.8.0.212.1); (sys_platform == \"linux\" or sys_platform == \"linux2\" or sys_platform == \"linux3\" or sys_platform == \"linux4\") and (platform_machine == \"i386\" or platform_machine == \"i686\")", "appdynamics-bindeps-linux-x64 (==11.0); (sys_platform == \"linux\" or sys_platform == \"linux2\" or sys_platform == \"linux3\" or sys_platform == \"linux4\") and (platform_machine == \"x86_64\" or platform_machine == \"AMD64\")", "appdynamics-proxysupport-linux-x64 (==1.8.0.212.1); (sys_platform == \"linux\" or sys_platform == \"linux2\" or sys_platform == \"linux3\" or sys_platform == \"linux4\") and (platform_machine == \"x86_64\" or platform_machine == \"AMD64\")"], "requires_python": "", "summary": "Python Agent for AppDynamics", "version": "20.3.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <pre>APPDYNAMICS, INC.\n\nEND USER LICENSE AGREEMENT\n\n1. SOFTWARE LICENSE.\n\n1.1 LICENSE GRANT.\n\nThis End User License Agreement (this “Agreement”) between AppDynamics, Inc., a Delaware corporation with its principal place of business located at 303 Second Street, North Tower, 8th Floor, San Francisco, CA 94107 (“AppDynamics”) and the customer set forth in the Order Form (as defined below) (“End User”) is effective as of the date the initial Order Form is executed or the date this Agreement is referenced by the applicable purchase order (the “Effective Date”). This Agreement shall govern each order form, sales quotation, proposal, purchase order or other ordering document that references this Agreement (each an “Order Form”). Each Order Form will form part of this Agreement. Subject to the terms and conditions of this Agreement, AppDynamics hereby grants to End User, during the License Term (as defined below), a non-exclusive, non-transferable, non-sublicensable right and license to use the software-as-a-service and/or on-premises version of AppDynamics’ application intelligence software product, including one Controller, as designated in the Order Forms (the “Software”) for internal business purposes only for the quantity of units in the Order Form. AppDynamics Test &amp; Dev Edition licenses shall only be used in test-only non-production environments. For purposes hereof, the “License Term” begins on the date AppDynamics delivers the Software license keys to End User and extends for the period specified in the applicable Order Form (unless earlier terminated in accordance with this Agreement). For the avoidance of doubt, End User’s affiliates (and employees thereof) shall not use the Software without AppDynamics’ prior written consent. Notwithstanding anything to the contrary herein, this Agreement does not supersede a signed agreement between AppDynamics and End User with respect to the Software.\n\n1.2 RESTRICTIONS ON USE.\n\nExcept as otherwise expressly provided in this Agreement, End User shall not (and shall not permit any third party to): (a) sublicense, sell, resell, transfer, assign, distribute, share, lease, rent, make any external commercial use of, outsource, use on a timeshare or service bureau, or use in an application service provider or managed service provider environment, or otherwise generate income from the Software; (b) copy the Software onto any public or distributed network, except for an internal and secure cloud computing environment; (c) cause the decompiling, disassembly, or reverse engineering of any portion of the Software, or attempt to discover any source code or other operational mechanisms of the Software (except where such restriction is expressly prohibited by law without the possibility of waiver, and then only upon prior written notice to AppDynamics); (d) modify, adapt, translate or create derivative works based on all or any part of the Software; (e) use any Third Party Software (as defined below) provided with the Software other than with the Software; (f) modify any proprietary rights notices that appear in the Software or components thereof; (g) publish the results of any benchmarking tests run on any Third Party Software; (h) use any Software in violation of any applicable laws and regulations (including any export laws, restrictions, national security controls and regulations) or outside of the license scope set forth in Section 1.1; (i) use the Software in support of any nuclear proliferation, chemical weapon, biological weapon or missile proliferation activity; (j) configure the Software to collect any (1) social security numbers or other government-issued identification numbers, (2) passwords or other authentication credentials, (3) health information, biometric data, genetic data, or payment/financial information, (4) any data relating to a person under the age of 13 years old, or (5) any other data that is subject to regulatory or contractual handling requirements (e.g., PCI, HIPAA, or state and federal data security laws) (collectively, “Prohibited Data”); or (k) use the Software to (1) store, download or transmit infringing, libelous, or otherwise unlawful or tortious material, or malicious code or malware, or (2) engage in phishing, spamming, denial-of-service attacks or other fraudulent or criminal activity, (3) interfere with or disrupt the integrity or performance of third party systems, or the Software or data contained therein, or (4) attempt to gain unauthorized access to the Software or AppDynamics' systems or networks, or (5) perform, or engage any third party to perform, authenticated or unauthenticated penetration testing, vulnerability assessments or other security assessments on the SaaS version of the Software. End User shall not export or re-export, directly or indirectly, any Software or technical data or any copy, portions or direct product thereof (i) in violation of any applicable laws and regulations, (ii) to any country for which the United States or any other government, or any agency thereof, at the time of export requires an export license or other governmental approval, including Cuba, Libya, North Korea, Iran, Iraq, or Rwanda or any other Group D:1 or E:2 country (or to a national or resident thereof) specified in the then current Supplement No. 1 to part 740 of the U.S. Export Administration Regulations (or any successor supplement or regulations, without first obtaining such license or approval) or (ii) to anyone on the U.S. Treasury Department’s list of Specially Designated Nationals or the U.S. Commerce Department’s Table of Denial Orders. End User shall, at its own expense, obtain all necessary customs, import, or other governmental authorizations and approvals.\n\n1.3 EVALUATION USE.\n\nIf End User accessed the Software pursuant to a no-fee or beta evaluation (“Evaluation Use”), then the License Term is for the period enabled by the license key for the Software provided by AppDynamics. AppDynamics shall have the right to downgrade, limit or otherwise modify the Software provided for Evaluation Use at any time without notice, and no warranty, indemnity, Maintenance or Support obligations of AppDynamics will apply to Evaluation Use. End User may use the number and type of licenses indicated by AppDynamics in writing prior to End User downloading or accessing the Software, which will be enabled by End User’s specific license key. AppDynamics has the right to immediately revoke and terminate any Evaluation Use at any time. End User agrees to provide feedback related to the Software as reasonably requested by AppDynamics. End User grants to AppDynamics, without charge, the fully paid-up, perpetual, sublicensable right to exploit such feedback for any purpose. Evaluation Use is not a guarantee of future product features and should not be relied upon in making any purchasing decisions.\n\n1.4 UNAUTHORIZED USE.\n\nEnd User shall notify AppDynamics promptly of any unauthorized use of any password or account or any other known or suspected breach of security or misuse of the Software. End User is responsible for use of the Software by any and all employees, contractors, or other users that it allows to access the Software.\n\n1.5 MAINTENANCE AND SUPPORT.\n\n“Support” is defined as AppDynamics' obligations to respond to support requests as described in Exhibit A (Enterprise Support). “Maintenance” means AppDynamics’ obligations related to error resolution, bug fixes and the provision of updates and upgrades made generally commercially available by AppDynamics in its sole discretion, all as described in Exhibit A. Subject to End User’s payment of the fees set forth in the applicable Order Form(s), AppDynamics will (a) provide Maintenance and Support for the Software, and (b) solely if End User has purchased access to the software-as-a-service version of the Software, make the Software available to End User in accordance with Exhibit B (Availability and Security). For time-limited licenses for the Software (as set forth in an Order Form, “Subscription Licenses”), the fees for Maintenance and Support are included in the fees for the Software. For perpetual licenses, (i) AppDynamics shall invoice End User the applicable fees for Maintenance and Support (“Maintenance and Support Fees”) upon execution of the Order Form, and (ii) subject to payment of the Maintenance and Support Fees, AppDynamics will provide Support for the Maintenance and Support period set forth in the Order Form, as it may be renewed (the “Maintenance and Support Term”). If Maintenance and Support terminates with respect to any perpetual licenses, and End User is in good standing under this Agreement, then End User may reinstate Maintenance and Support on payment of the cumulative Maintenance and Support Fees applicable for the period during which Maintenance and Support lapsed, plus Maintenance and Support Fees for the reinstated Maintenance and Support Term. Notwithstanding anything herein to the contrary, if End User receives Support from an authorized partner of AppDynamics (“Partner”), then the support terms agreed upon by End User and such Partner shall govern in lieu of those set forth in Exhibit A, and AppDynamics shall have no support obligations to End User.\n\n1.6 SERVICES.\n\nSubject to the terms hereof (including payment of any applicable fees set forth in the Order Form), AppDynamics will provide the training, enablement and/or other services described in an Order Form (or statement of work referencing this Agreement), if any (“Services”). All Services will be rendered on a time and materials basis. AppDynamics will not exceed the total time purchased without prior written approval from End User. If the Services purchased have been consumed, AppDynamics will stop the Services until additional Services have been purchased. If End User elects not to purchase additional Services, then the Services will be deemed complete. If not used, pre-purchased Services and expenses expire twelve (12) months after the date purchased (unless otherwise set forth in the applicable Order Form). End User agrees to provide reasonable cooperation and information as necessary to permit AppDynamics to perform the Services. End User will reimburse AppDynamics for travel and expenses (at cost) incurred in connection with the Services (if any) by the Invoice Due Date (as defined below). Services will be performed on business days (a business day means Monday through Friday, excluding national holidays, during working hours, in the location where the Services are delivered). Saturday Services, and hours worked during the week that exceed the local working hours in a week, will be charged at the agreed rate x 1.5. Services performed on Sundays or national holidays will be charged at 2 x the agreed rate. If End User cancels or delays any scheduled Services less than ten (10) business days before the start date of such Services, then AppDynamics will deduct from End User's account (or End User will pay for) the amount of Services that were scheduled in any of the ten (10) business days following the date of cancellation (or notification of the delay, as applicable), and End User will fully reimburse AppDynamics for any reasonable travel and expenses incurred by AppDynamics for such Services (and for any Services rescheduled by End User) for which AppDynamics is unable to obtain a refund. During the License Term (for Subscription Licenses) or during the Maintenance and Support Term (for perpetual licenses), and in each case for a period of twelve (12) months thereafter, without AppDynamics’ prior written approval, End User will not solicit for employment or consultancy any AppDynamics’ employees who participated in the performance of Services.\n\n2. FEES.\n\n2.1 PRICING.\n\nEnd User will be invoiced for those amounts and at those prices set forth in an Order Form (an “Invoice”), provided, however, that, for Evaluation Use, End User shall not be billed unless otherwise specified by AppDynamics in writing prior to End User downloading or accessing (as applicable) the Software. Fees do not include any customization of the Software (nor support for any such customizations, unless otherwise agreed in writing). If End User’s usage of the Software is in excess of those amounts set forth in the Order Form, End User will be billed for those overages at a pro-rated amount for the remainder of the applicable License Term, based on AppDynamics’ then-current standard pricing. If AppDynamics believes in good faith that End User’s usage of the Software exceeds that set forth on the applicable Order Form, End User agrees to allow AppDynamics to audit End User’s use of the Software (not more frequently than twice per calendar year), upon at least twenty-four (24) hours’ notice, to determine the actual Software use, using a commercially reasonable auditing procedure. End User acknowledges that purchases made under this Agreement are neither contingent on the delivery of any future functionality or features nor dependent on any oral or written public comments made by AppDynamics regarding future functionality or features.\n\n2.2 PAYMENTS.\n\nEnd User shall pay Invoices within thirty (30) days of the invoice date (the “Invoice Due Date”). If End User reasonably disputes any Invoice, (i) End User shall provide AppDynamics with written notice of such dispute, including the grounds therefor (a “Dispute Notice”), prior to the Invoice Due Date, (ii) End User and AppDynamics shall, for a period of fifteen (15) days following AppDynamics’ receipt of such Dispute Notice, negotiate in good faith to resolve the dispute and (iii) if such dispute remains unresolved at the end of such period, the parties shall retain all of their respective rights under this Agreement (including, without limitation, any action for non-payment of the fees set forth herein). All payment obligations are non-cancelable and all amounts paid are non-refundable, except (a) for amounts paid in error that are not actually due under this Agreement, and (b) as set forth in Sections 6.1 and 7.1. The fees paid by End User are exclusive of all taxes, levies, or duties imposed by taxing authorities, if any, and End User shall be responsible for payment of all such taxes, levies, or duties, excluding taxes based on AppDynamics’ income. End User represents and warrants that the billing and contact information provided to AppDynamics is complete and accurate, and AppDynamics shall have no responsibility for any Invoices that are not received due to inaccurate or missing information provided by End User. End User shall pay interest on all payments not received by the Invoice Due Date at a rate of one percent (1%) per month or the maximum amount allowed by law, whichever is lesser. All amounts due under this Agreement shall be paid by End User in full without any set-off, counterclaim, deduction or withholding (other than any deduction or withholding of tax as required by law). If requested by AppDynamics, End User will obtain and furnish to AppDynamics tax receipts or other certificates issued by the competent taxation office showing the payments of the withholding tax within a reasonable time after payment. Following written notice, AppDynamics shall be entitled to suspend End User’s access to the Software if payments are not received within thirty (30) days of the Invoice Due Date. Notwithstanding anything herein to the contrary, if End User makes its payments pursuant to this Agreement to a Partner, then the payment terms agreed by End User and such Partner shall govern to the extent anything in this Section 2 conflicts with such Partner payment terms.\n\n3. CONFIDENTIALITY\n\n3.1 SCOPE AND RESTRICTIONS.\n\n“Confidential Information” means all information of a party (“Disclosing Party”) disclosed to the other party (“Receiving Party”) that is designated in writing or identified as confidential at the time of disclosure or should be reasonably known by the Receiving Party to be confidential due to the nature of the information disclosed and the circumstances surrounding the disclosure. The terms of this Agreement, the Software, any technical or other documentation relating to the Software, logins, passwords and other access codes and any and all information regarding AppDynamics’ business, products and services are the Confidential Information of AppDynamics. The Receiving Party will: (i) not use the Disclosing Party’s Confidential Information for any purpose outside of this Agreement; (ii) not disclose such Confidential Information to any person or entity, other than its affiliates, employees, consultants, agents and professional advisers who have a “need to know” for the Receiving Party to exercise its rights or perform its obligations hereunder, provided that such employees, consultants, and agents are bound by agreements or, in the case of professional advisers, ethical duties respecting such Confidential Information in accordance with the terms of this Section 3; and (iii) use reasonable measures to protect the confidentiality of such Confidential Information. If the Receiving Party is required by applicable law or court order to make any disclosure of such Confidential Information, it will first give written notice of such requirement to the Disclosing Party, and, to the extent within its control, permit the Disclosing Party to intervene in any relevant proceedings to protect its interests in its Confidential Information, and provide full cooperation to the Disclosing Party in seeking to obtain such protection. Further, this Section 3 will not apply to information that the Receiving Party can document: (i) was rightfully in its possession or known to it prior to receipt without any restriction on its disclosure; (ii) is or has become public knowledge or publicly available through no fault of the Receiving Party; (iii) is rightfully obtained by the Receiving Party from a third party without breach of any confidentiality obligation; or (iv) is independently developed by employees of the Receiving Party who had no access to such information.\n\n3.2 EQUITABLE RELIEF.\n\nThe Receiving Party acknowledges that unauthorized disclosure of the Disclosing Party’s Confidential Information could cause substantial harm to the Disclosing Party for which damages alone might not be a sufficient remedy and, therefore, that upon any such disclosure by the Receiving Party the Disclosing Party will be entitled to seek appropriate equitable relief in addition to whatever other remedies it might have at law or equity.\n\n4. PROPRIETARY RIGHTS. AppDynamics and its suppliers own and shall retain all proprietary rights, including all copyright, patent, trade secret, trademark and all other intellectual property rights, in and to the Software and the results of any Services. End User acknowledges that the rights granted under this Agreement do not provide End User with title to or ownership of the Software. Certain “free” or “open source” based software (the “FOSS Software”) and third party software included with the Software (the “Third Party Software”) is shipped with the Software but is not considered part of the Software hereunder. A list of the FOSS Software and Third Party Software is set forth on the webpage located at https://docs.appdynamics.com/display/DASH/Legal+Notices With respect to Third Party Software included with the Software, such Third Party Software suppliers are third party beneficiaries of this Agreement. End User’s use of such FOSS Software is subject to the terms of the licenses set forth on such webpage. The Software and Third Party Software may only be used by End User as prescribed by the AppDynamics documentation located at http://docs.appdynamics.com (as it may be updated from time to time, the “Documentation”).\n\n5. TERM AND TERMINATION.\n\nThe term of this Agreement begins on the Effective Date and will remain in effect until all Subscription Licenses (and Maintenance and Support Terms, if applicable) expire or until this Agreement is otherwise terminated in accordance with the terms hereof, whichever occurs first (the “Term”). This Agreement may be renewed at any time by execution of an Order Form referencing this Agreement, and any such renewal will be deemed part of the “Term” hereunder. If either party commits a material breach of this Agreement, and such breach has not been cured within thirty (30) days after receipt of written notice thereof, the non-breaching party may terminate this Agreement, except that AppDynamics may immediately terminate this Agreement and/or End User’s license to the Software upon End User’s breach of Section 1.2. Either party may also terminate this Agreement upon written notice if the other party suspends payment of its debts or experiences any other insolvency or bankruptcy-type event. Upon expiration or termination of this Agreement for any reason, (i) with respect to Subscription Licenses, all rights granted to End User shall terminate and End User shall destroy any copies of the Software and Documentation within End User’s possession and control; (ii) with respect to perpetual licenses, these will survive termination of this Agreement unless AppDynamics terminates the Agreement for End User’s breach of this Agreement in which case all rights granted to End User shall terminate and End User shall destroy any copies of the Software and Documentation within End User’s possession and control; and (iii) each Receiving Party will return or destroy, at the Disclosing Party’s option, the Disclosing Party’s Confidential Information in the Receiving Party’s possession or control. All fees that have accrued as of such expiration or termination, and Sections 1.2, 1.3, 1.4, 2, 3, 4, 5, 6.2 and 7 through 12, will survive any expiration or termination hereof.\n\n6. WARRANTIES.\n\n6.1 LIMITED WARRANTY.The limits below will not apply to the extent prohibited by applicable law.\n\nAppDynamics warrants that during the first thirty (30) days following the date the Software is purchased, the Software will, in all material respects, conform to the functionality described in the then-current Documentation for the applicable Software version. AppDynamics’ sole and exclusive obligation, and End User’s sole and exclusive remedy, for a breach of this warranty shall be that AppDynamics shall be required to use commercially reasonable efforts to repair or replace the Software to conform in all material respects to the Documentation, and if AppDynamics is unable to materially restore such functionality within thirty (30) days from the date of written notice of such breach, End User shall be entitled to terminate the license to the affected Software upon written notice and AppDynamics shall promptly provide a pro-rata refund of the Software license fees (or Maintenance and Support Fees, for perpetual licenses) that have been paid in advance for the remainder of the License Term for the applicable Software (beginning on the date of termination). End User must notify AppDynamics in writing of any warranty breaches within such warranty period, and End User must have installed and configured the Software in accordance with the Documentation to be eligible for the foregoing remedy.\n\n6.2 WARRANTY DISCLAIMER.\n\nEXCEPT AS EXPRESSLY PROVIDED IN THIS SECTION 6, ALL SOFTWARE, DOCUMENTATION, MAINTENANCE AND SUPPORT AND SERVICES ARE PROVIDED “AS IS” AND APPDYNAMICS AND ITS SUPPLIERS EXPRESSLY DISCLAIM ANY AND ALL OTHER REPRESENTATIONS AND WARRANTIES, EITHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE WITH RESPECT THERETO, INCLUDING ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, TITLE, NON-INFRINGEMENT, OR THE CONTINUOUS, UNINTERRUPTED, ERROR-FREE, VIRUS-FREE, OR SECURE ACCESS TO OR OPERATION OF THE SOFTWARE. APPDYNAMICS EXPRESSLY DISCLAIMS ANY WARRANTY AS TO THE ACCURACY OR COMPLETENESS OF ANY INFORMATION OR DATA ACCESSED OR USED IN CONNECTION WITH THE SOFTWARE, DOCUMENTATION, MAINTENANCE AND SUPPORT, OR SERVICES. AppDynamics is not responsible for any delays, delivery failures, or any other loss or damage resulting from the transfer of data over communications networks and facilities, including the Internet, and End User acknowledges that the Software and Documentation may be subject to limitations, delays and other problems inherent in the use of such communications facilities. The Software is not fault-tolerant and is not designed or intended for use in hazardous environments, including without limitation, in the operation of aircraft or other modes of human mass transportation, nuclear or chemical facilities, life support systems, implantable medical equipment, motor vehicles or weaponry systems, or any other application in which failure of the Software could lead to death or serious bodily injury of a person, or to severe physical or environmental damage (each, a “High Risk Use”). AppDynamics expressly disclaims any express or implied warranty or representation of fitness for High Risk Use. AppDynamics shall not be liable to End User for any loss, damage or harm suffered by End User that is directly or indirectly caused by End User’s unauthorized use of the Software to process Prohibited Data.\n\n7. INDEMNIFICATION.\n\n7.1 BY APPDYNAMICS.\n\nAppDynamics agrees at its expense to defend End User against (or, at AppDynamics’ option, settle), any third party claim to the extent such claim alleges that the Software infringes or misappropriates any patent, copyright, trademark or trade secret of a third party, and AppDynamics shall pay all costs and damages finally awarded against End User by a court of competent jurisdiction as a result of any such claim. In the event that the use of the Software is, or in AppDynamics’ sole opinion is likely to become, subject to such a claim, AppDynamics, at its option and expense, may (a) replace the applicable Software with functionally equivalent non-infringing technology, (b) obtain a license for End User’s continued use of the applicable Software, or (c) terminate the license and provide a pro-rata refund of the Software license fees (or Maintenance and Support Fees, for perpetual licenses) that have been paid in advance for the remainder of the License Term for the applicable Software (beginning on the date of termination). The foregoing indemnification obligation of AppDynamics will not apply: (1) if the Software is modified by End User or its agent; (2) if the Software is combined with other non-AppDynamics products, applications, or processes, but solely to the extent the alleged infringement is caused by such combination; or (3) to any unauthorized use of the Software. The foregoing shall be End User’s sole remedy with respect to any claim of infringement of third party intellectual property rights.\n\n7.2 BY END USER.\n\nEnd User agrees to defend, at its expense, AppDynamics and its affiliates, its suppliers and its resellers against any third party claim to the extent such claim arises from or is made in connection with End User’s breach of Section 1 or End User’s negligence or willful misconduct, and End User shall pay all costs and damages finally awarded against AppDynamics by a court of competent jurisdiction as a result of any such claim.\n\n7.3 INDEMNIFICATION REQUIREMENTS.\n\nIn connection with any claim for indemnification under this Section 7, the indemnified party must promptly provide the indemnifying party with notice of any claim that the indemnified party believes is within the scope of the obligation to indemnify, provided, however, that the failure to provide such notice shall not relieve the indemnifying party of its obligations under this Section 7, except to the extent that such failure materially prejudices the indemnifying party’s defense of such claim. The indemnified party may, at its own expense, assist in the defense if it so chooses, but the indemnifying party shall control the defense and all negotiations related to the settlement of any such claim. Any such settlement intended to bind either party shall not be final without the other party’s written consent, which consent shall not be unreasonably withheld, conditioned or delayed; provided, however, that End User’s consent shall not be required when AppDynamics is the indemnifying party if the settlement involves only the payment of money by AppDynamics.\n\n8. LIMITATION OF LIABILITY. The limits below will not apply to the extent prohibited by applicable law.\n\n8.1 EXCEPT FOR LIABILITY ARISING OUT OF END USER’S BREACH OF SECTION 1.2 (RESTRICTIONS ON USE), IN NO EVENT SHALL EITHER PARTY BE LIABLE UNDER THIS AGREEMENT FOR ANY INDIRECT, INCIDENTAL, SPECIAL, PUNITIVE OR CONSEQUENTIAL DAMAGES, INCLUDING DAMAGES FOR LOSS OF REVENUES OR PROFITS, LOSS OF USE, BUSINESS INTERRUPTION, OR LOSS OF DATA, WHETHER IN AN ACTION IN CONTRACT OR TORT, EVEN IF THE OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n8.2 EXCEPT FOR LIABILITY ARISING OUT OF END USER’S BREACH OF SECTION 1.2 (RESTRICTIONS ON USE), NEITHER PARTY’S LIABILITY FOR ANY DAMAGES (WHETHER FOR BREACH OF CONTRACT, MISREPRESENTATIONS, NEGLIGENCE, STRICT LIABILITY, OTHER TORTS OR OTHERWISE) UNDER THIS AGREEMENT SHALL EXCEED AN AMOUNT EQUAL TO THE TOTAL FEES PAID (PLUS FEES PAYABLE) TO APPDYNAMICS DURING THE TWELVE (12) MONTHS IMMEDIATELY PRECEDING THE CLAIM GIVING RISE TO SUCH DAMAGES. THESE LIMITATIONS SHALL APPLY NOTWITHSTANDING ANY FAILURE OF ESSENTIAL PURPOSE OF ANY REMEDY.\n\n9. FORCE MAJEURE.\n\nExcept for payment obligations, neither party hereto will be liable for defaults or delays due to acts of God, or the public enemy, acts or demands of any government or governmental agency, fires, earthquakes, floods, accidents, or other unforeseeable causes beyond its reasonable control and not due to its fault or negligence.\n\n10. DATA COLLECTION.\n\nEnd User acknowledges that AppDynamics’ application server and machine software agents (the “Agents”) collect metrics that relate to the performance, health and resource of an application, its components (transactions, code libraries) and related infrastructure (nodes, tiers) that service those components. In addition, AppDynamics collects metrics on End Users’ activities, such as web pages visited, length of visit, and which features of the Software an End User uses. If End User provides AppDynamics with any personally identifiable information (“personal data”), End User represents and warrants that such information has been collected by End User in accordance with the provisions of all applicable data protection legislation and that End User has all right and consents necessary to provide such personal data to AppDynamics. End User will indemnify AppDynamics for reasonable costs and other amounts that AppDynamics may incur relating to any breach of this Section.\n\n11. US GOVERNMENT MATTERS.\n\nAs defined in FAR section 2.101, the Software and Documentation are “commercial items” and according to DFAR section 252.227 7014(a)(1) and (5) are deemed to be “commercial computer software” and “commercial computer software documentation.” Consistent with DFAR section 227.7202 and FAR section 12.212, any use modification, reproduction, release, performance, display, or disclosure of such commercial software or commercial software documentation by the U.S. Government will be governed solely by the terms of this Agreement and will be prohibited except to the extent expressly permitted by the terms of this Agreement.\n\n12. MISCELLANEOUS.\n\nThis Agreement shall be governed by and construed under the laws of the State of California, U.S.A. The parties consent to the exclusive jurisdiction and venue of the courts located in and serving San Francisco, California. Failure by either Party to exercise any of its rights under, or to enforce any provision of, this Agreement will not be deemed a waiver or forfeiture of such rights or ability to enforce such provision. If any provision of this Agreement is held by a court of competent jurisdiction to be illegal, invalid or unenforceable, such provision will be amended to achieve as nearly as possible the same economic effect of the original provision and the remainder of this Agreement will remain in full force and effect. This Agreement and its exhibits, together with the Order Form(s) and any statements of work incorporating this Agreement, if applicable, represent the entire agreement between the parties and supersede any previous or contemporaneous oral or written agreements or communications regarding the subject matter of this Agreement. The person signing or otherwise accepting this Agreement for End User represents that s/he is duly authorized by all necessary and appropriate corporate action to enter this Agreement on behalf of End User. Any modification to this Agreement must be in writing and signed by a duly authorized agent of both parties. The Uniform Computer Information Transactions Act (UCITA) does not apply to this Agreement. This Agreement shall control over additional or different terms of any purchase order, confirmation, invoice, statement of work or similar document (other than an AppDynamics Order Form, which will take precedence), even if accepted in writing by both parties, and waivers and amendments to this Agreement shall be effective only if made by non-pre-printed agreements clearly understood by both parties to be an amendment or waiver to this Agreement. For purposes of this Agreement, “including” means “including without limitation.” The rights and remedies of the parties hereunder will be deemed cumulative and not exclusive of any other right or remedy conferred by this Agreement or by law or equity. No joint venture, partnership, employment, or agency relationship exists between the parties as a result of this Agreement or use of the Software. AppDynamics reserves the right to perform its obligations from locations and/or through use of affiliates and subcontractors, worldwide, provided that AppDynamics will be responsible for such parties. End User may not assign this Agreement without the prior written approval of AppDynamics and any purported assignment in violation of this section shall be void; AppDynamics may assign, transfer or subcontract this Agreement in whole or in part. Upon any assignment of this Agreement by End User that is approved by AppDynamics, any licenses that contain an “unlimited” aspect will, with respect to End User or the successor entity, as applicable, be capped at the number of authorized Software units in use immediately prior to such assignment. End User agrees that AppDynamics may refer to End User by its trade name and logo, and may briefly describe End User’s business, in AppDynamics’ marketing materials and website. AppDynamics may give notice to End User by electronic mail to End User’s email address on record in End User’s account information, or by written communication sent by first class mail or pre-paid post to End User’s address on record in End User’s account information. End User may give notice to AppDynamics at any time by any letter delivered by nationally recognized overnight delivery service or first class postage prepaid mail to AppDynamics at the following address or such other address as may be notified to End User from time to time: AppDynamics, Inc., 303 Second Street, North Tower, 8th Floor, San Francisco, CA 94107, Attn: Legal Department. Notice under this Agreement shall be deemed given when received, if personally delivered; when receipt is electronically confirmed, if transmitted by email; the day after it is sent, if sent for next day delivery by recognized overnight delivery service; and upon receipt, if sent by certified or registered mail, return receipt requested.\n\n\nEXHIBIT A\n\nENTERPRISE SUPPORT\n\nGENERAL REQUIREMENTS.\n\nAppDynamics will provide access to a ticketing system and email address (help@appdynamics.com), which will be available twenty-four (24) hours per day, seven (7) days per week. The email account will be maintained by qualified support specialists, who shall use commercially reasonable efforts to answer questions and resolve problems regarding the Software.\n\nHOURS OF OPERATION.\n\nSupport is available twenty-four (24) hours per day, seven (7) days per week.\n\nERROR CLASSIFICATION.\n\nAny reported errors are classified in the following manner, in each case when caused by\nthe Software:\n\nError Classification Criteria\n==================== ========\nUrgent End User production application is down or there is a\nmajor malfunction, resulting in a business revenue loss and\nimpacting the End User application functionality for a\nmajority of users.\n\nHigh Critical loss of End User application functionality or\nperformance, impacting the application functionality for a\nhigh number of users.\n\nNormal Moderate loss of End User application functionality or\nperformance, impacting multiple users.\n\nLow Minor loss of End User application functionality or\nproduct feature in question.\n\n\nERROR DEFINITION.\n\nAn “error” means a reproducible malfunction in the Software that is reported by End User through AppDynamics’ ticketing system that prevents the Software from performing in accordance with the operating specifications described in the then-current Documentation.\n\nAUTHORIZED SUPPORT CONTACTS.\n\nMaintenance and Support will be provided solely to End User’s designated support contacts. The Order Form may indicate a maximum number of designated support contacts for End User’s service level. End User will provide its designated support contacts, including its primary email address.\n\nEND USER’S OBLIGATION TO ASSIST.\nIf End User reports a purported error in the Software to AppDynamics, AppDynamics’ ticketing system will request the following minimum information:\n\nA general description of the operating environment\nA list of all hardware components, operating systems and networks\nA reproducible test case\nAny log files, trace and systems files\n\nEnd User’s failure to provide this information may prevent or significantly delay AppDynamics’ ability to identify and fix the reported error. AppDynamics’ time to respond to any error will begin when AppDynamics has received all requested information from the End User and is able to reproduce the error.\n\n\nERROR RESOLUTION.\n\nIf AppDynamics determines there is an error in the Software, AppDynamics may, at its sole option, repair that error in the version of the Software that End User is currently using or instruct End User to install a newer version of the Software with that error repaired. AppDynamics reserves the right to provide End User with a workaround in lieu of fixing an error.\n\n\nSOFTWARE UPDATES AND UPGRADES. End User must be current on fees in order to receive access to Maintenance.\n\n\nRESPONSE TIME. AppDynamics shall respond to error tickets in accordance with the tables set forth below. AppDynamics will use reasonable means to repair the error and keep End User informed of progress. AppDynamics makes no representations as to when a full resolution of the error may be made.\n\nError Initial Response Manager Escalation VP Escalation Email Status Updates\n===== ================ ================== ============= ====================\nUrgent 1 Hour 1 Business Day 1 Week Daily\nHigh 6 Hours 1 Week 2 Weeks Weekly\nNormal 1 Business Day Quarterly Review None None\nLow 2 Business Days Semi-Annual Review None None\n\nMaintenance and Support Policy: The Maintenance and Support policy is as follows:\n\nAppDynamics provides Maintenance and Support for each version of the Software for a period of twelve (12) months after the generally available release of the next major version of the Software (a major release is a change in the first number to the right of the decimal point). For example, if version 4.1 is released on January 1, 2015, then AppDynamics will provide Maintenance and Support for version 4.0 until January 1, 2016. AppDynamics does not provide Maintenance or Support for any customized software (or components thereof).\n\nFor third party software or technology used by End User with the Software but not included with the Software (a “Platform”, such as Java Virtual Machines), AppDynamics will follow the end-of-life (“EOL”) support timeline announced by the third party vendor of such Platform. AppDynamics will stop providing Maintenance and Support for an EOL’d Platform version when the Platform vendor stops providing maintenance and support for that Platform version.\n\n\nEXHIBIT B\nAVAILABILITY AND SECURITY\n\nThe terms set forth in this Exhibit B apply only if End User has purchased access to the online software-as-a-service (“SaaS”) version of the Software, as indicated on the Order Form.\n\nAVAILABILITY.\n\nAppDynamics will provide System Availability (as defined below) of ninety-nine and one-half percent (99.5%) (the “Availability SLA”), excluding situations identified as “Exclusions” below. For purposes of the Availability SLA, the AppDynamics network extends to, includes and terminates at the data center located router that provides the outside interface of each of AppDynamics’ WAN connections to its backbone providers (the “AppDynamics Network”).\n\n“Exclusions” means any outage that results from any of the following:\na. Any Maintenance performed by AppDynamics during AppDynamics’ standard Maintenance windows. AppDynamics will notify End User within forty-eight (48) hours of any standard Maintenance and within twenty-four (24) hours for other non-standard emergency Maintenance (collectively referred to herein as “Scheduled Maintenance”).\n\nb. End User's information content or application programming, or the acts or omissions of End User or its agents, including, without limitation, the following:\n1. End User’s use of any programs not supplied by AppDynamics;\n2. End User’s failure to provide AppDynamics with reasonable advance prior notice of any pending unusual large deployments of new nodes (i.e., adding over ten percent (10%) total nodes in less than twenty-four (24) hours);\n3. End User’s implementation of any significant configuration changes, including changes that lead to a greater than thirty percent (30%) change in a one week period or greater than fifty percent (50%) change in a one month period in the number of key\nobjects in the system including but not limited to metrics, snapshots, nodes, events and business transactions;\n4. Any misconfiguration by End User (as determined in AppDynamics’ sole discretion), including configuration errors and unintended usage of the Software;\n5. End User’s failure to upgrade the Agents to keep the Agent versions within six (6) months of the Controller version; or\n6. End User’s implementation of configuration changes in the number of key objects in the Software (including metrics, snapshots, nodes, events and business transactions) that results in, or is likely to result in, an adverse impact on other customers.\n\nc. Force majeure or other circumstances beyond AppDynamics’ reasonable control that could not be avoided by its exercise of due care.\n\nd. Failures of the Internet backbone itself and the network by which End User connects to the Internet backbone or any other network unavailability outside of the AppDynamics Network, such as misconfigurations, proxies or firewalls.\n\ne. Any window of time when End User agrees that Software availability/unavailability will not be monitored or counted.\n\nf. Any problems resulting from End User combining or merging the Software with any hardware or software not supplied by AppDynamics or not identified by AppDynamics in the Documentation as being compatible with the Software.\n\ng. End User’s or any third party’s use of the Software in an unauthorized or unlawful manner.\n\nRemedies for Excessive Downtime:\n\nIn the event the availability of the Software falls below the Availability SLA in a given calendar quarter, AppDynamics will pay End User a service credit (“Service Credit”) as follows, corresponding to the actual Availability of the Software during the applicable calendar quarter (on pro-rated basis for annual or multi-year fees): if the Availability is 99.5% or greater, End User is entitled to receive no credits; if the Availability is 97.0% - 99.49%, then End User is entitled to receive Service Credits equal to five percent of the fees for the applicable calendar quarter (not to exceed $280); if the Availability is 95.0% - 96.9%, then End User is entitled to receive Service Credits equal to ten percent of the fees for the applicable calendar quarter (not to exceed $560); and if the Availability is less than 95.0%, then End User is entitled to receive Service Credits equal to twenty percent of the fees for the applicable calendar quarter (not to exceed $1120). Such Service Credit will be issued as a credit against any fees owed by End User for the next calendar quarter of the Term, or, if End User does not owe any additional fees, then AppDynamics will pay End User the amount of the applicable Service Credit within thirty (30) days after the end of the calendar quarter in which such credit accrued. To receive Service Credits, End User must submit a written request to AppDynamics (to customersuccess@appdynamics.com with a copy to legal@appdynamics.com) within 15 days after the end of the quarter in which the Software was unavailable, or End User’s right to receive Service Credits with respect to such unavailability will be waived. The remedies stated in this section are End User’s sole and exclusive remedies and AppDynamics’ sole and exclusive obligations for service interruption or unavailability.\n\n“System Availability” is measured by the following formula: (n - y) *100 / n\n(1) “n” is the total number of minutes in the given calendar quarter minus the Exclusions (as defined above); and “y” is the total number of minutes in the given calendar quarter that the Controller is not accessible by End User (as determined by AppDynamics’ tools).\n(2) Specifically excluded from “n and “y” in this calculation are the Exclusions.\n\nSECURITY INFORMATION.\n\nFor all End User data stored in the software-as-a-service version of the Software, AppDynamics will satisfy all of its obligations under Section 3 by maintaining the security precautions described below.\nCertifications\nAppDynamics is SOC 2 Type II compliant, meaning it has been independently audited to verify the validity and functionality of its control activities and processes. Customers may request AppDynamics’ report at any time. AppDynamics’ data center provider is also SOC 2 Type II compliant.\n\nSecure Connections\nAgents initiate connections to a single Controller, which can either be hosted on-premises by the customer or by AppDynamics via the AppDynamics’ software-as-a-service platform. The “Controller” is the central repository and analytics engine where all performance data is stored, baselined, and analyzed. If End User downloads the Agent from End User’s controller (ie., using the installation wizard provided by AppDynamics), then transport layer security (TLS) for Agent-to-Controller communication is enabled by default. For other installations, AppDynamics recommends enabling SSL/TLS encryption for Agent communications. For detailed instructions please see docs.appdynamics.com. Agents also support outbound HTTP proxies for customers using these security mechanisms. For Software user interface access, AppDynamics redirects all traffic to HTTPS.\n\nAccess Controls to Data\nAccess to collected data and data collection features is restricted to authenticated customer users by role-based access controls (RBAC). In addition, customer users do not have native access to run queries on the Controller’s MySQL database.\n\nAvailability\nServers for the software are operated in fault-tolerant architecture in a manner designed to ensure availability. Data is backed up nightly and stored redundantly. AppDynamics also provides an off-site backup service. Software security updates and patches are evaluated by engineers and are deployed based upon the security risks and stability benefits they offer to the Software and End Users.\n\nSecurity\nAccess to the Software platform infrastructure and data by AppDynamics personnel is secured by authentication methods including public key authentication, passwords and network access control lists. Infrastructure and data access is restricted to AppDynamics’ employees and contractors subject to confidentiality agreements. System and network activity for the Software are regularly monitored by a team of engineers. Failed authentication attempts are audited and engineers are paged so that intrusions or threats can be investigated. Standard firewall policies are deployed to block access except to ports required for Software and Agent communication.\n\nSensitive Data\nAppDynamics recommends on-premises (rather than software-as-a-service) deployments for customers subject to heightened regulatory oversight of data.\n\nMore Information\nFor more information on data privacy or security processes please contact help@appdynamics.com or your account representative. To report a suspected security breach, contact security@appdynamics.com.\nAppDynamics Proprietary and Confidential * Revision 2016.11.01\n</pre>\n\n          </div>"}, "last_serial": 6896712, "releases": {"20.3.0": [{"comment_text": "", "digests": {"md5": "8996746138316f1e4500dc81287a8ae8", "sha256": "3dfec6ccb25445fa5b050d3691c9d56bac4262aa5b971690144f3343760ddc83"}, "downloads": -1, "filename": "appdynamics-20.3.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "8996746138316f1e4500dc81287a8ae8", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 229426, "upload_time": "2020-03-27T14:52:30", "upload_time_iso_8601": "2020-03-27T14:52:30.558632Z", "url": "https://files.pythonhosted.org/packages/b5/2a/76245af5c72c2910d796f58a5a34b704b53e31a702d5decce0ac00599e0e/appdynamics-20.3.0-py2.py3-none-any.whl", "yanked": false}], "4.0.0.0b4": [{"comment_text": "", "digests": {"md5": "a0aa4e988b3ba71fb9a06e5c2f8b4662", "sha256": "2cc52f68d907443b043b6b680e7a3904875e4e9353f719fddb232c46e757e366"}, "downloads": -1, "filename": "appdynamics-4.0.0.0b4-py2-none-any.whl", "has_sig": false, "md5_digest": "a0aa4e988b3ba71fb9a06e5c2f8b4662", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 161114, "upload_time": "2015-04-06T18:54:09", "upload_time_iso_8601": "2015-04-06T18:54:09.479245Z", "url": "https://files.pythonhosted.org/packages/aa/af/6dd26f682a8f45c11057f7d7ec5dcc9c1c6a24e695ee1a73578ad06187fd/appdynamics-4.0.0.0b4-py2-none-any.whl", "yanked": false}], "4.0.0.0b5": [{"comment_text": "", "digests": {"md5": "7eabb3ea5803310a482eb4c450807e51", "sha256": "160e2ba90f66f3a91ef5440ae0b63461b5a3a05fc0917982144c3c768427bff7"}, "downloads": -1, "filename": "appdynamics-4.0.0.0b5-py2-none-any.whl", "has_sig": false, "md5_digest": "7eabb3ea5803310a482eb4c450807e51", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 161849, "upload_time": "2015-04-23T18:43:00", "upload_time_iso_8601": "2015-04-23T18:43:00.210523Z", "url": "https://files.pythonhosted.org/packages/54/a1/89bf5ed4fedbcc93d934788b09493bb356592a5847d35b8e0c8fe64596f6/appdynamics-4.0.0.0b5-py2-none-any.whl", "yanked": false}], "4.0.0.0b6": [{"comment_text": "", "digests": {"md5": "d6f3a5b95567040c273133354ffc9b8e", "sha256": "81680f45f7e89c526c3bdc3eb37cfe43199db5477fc7765267b9f48dd2a1ebb6"}, "downloads": -1, "filename": "appdynamics-4.0.0.0b6-py2-none-any.whl", "has_sig": false, "md5_digest": "d6f3a5b95567040c273133354ffc9b8e", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 162172, "upload_time": "2015-04-27T22:14:27", "upload_time_iso_8601": "2015-04-27T22:14:27.682051Z", "url": "https://files.pythonhosted.org/packages/89/ac/9a1f2f5ffef3d5b8cd8e237bb5e86fddc8091f85ab387ec028f1eae4ab92/appdynamics-4.0.0.0b6-py2-none-any.whl", "yanked": false}], "4.0.0.0b7": [{"comment_text": "", "digests": {"md5": "7683984706dc98b31127084fb458eb1c", "sha256": "427a3783e29a10b0f088bc7d21996531a4d9f084763529f674d6e08ba3900ffe"}, "downloads": -1, "filename": "appdynamics-4.0.0.0b7-py2-none-any.whl", "has_sig": false, "md5_digest": "7683984706dc98b31127084fb458eb1c", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 155155, "upload_time": "2015-05-01T21:10:24", "upload_time_iso_8601": "2015-05-01T21:10:24.490012Z", "url": "https://files.pythonhosted.org/packages/57/41/f16ae9cdff9d328904643d87a99bf13316e4ff95f80fbb6e9bbe41aea190/appdynamics-4.0.0.0b7-py2-none-any.whl", "yanked": false}], "4.0.0.0b8": [{"comment_text": "", "digests": {"md5": "a2c64753bd8967a188ed32d1da7e47ab", "sha256": "0a226ff1fa6749b2769a79e05314043d746e89206c774be46a6f837acaf30012"}, "downloads": -1, "filename": "appdynamics-4.0.0.0b8-py2-none-any.whl", "has_sig": false, "md5_digest": "a2c64753bd8967a188ed32d1da7e47ab", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 174891, "upload_time": "2015-05-14T00:56:03", "upload_time_iso_8601": "2015-05-14T00:56:03.556796Z", "url": "https://files.pythonhosted.org/packages/2f/5b/3f7162c5ec935cf820e3e1a172b72dd6bc66da2df8bb3c4c81d03b46381d/appdynamics-4.0.0.0b8-py2-none-any.whl", "yanked": false}], "4.0.6.0": [{"comment_text": "", "digests": {"md5": "ef3524933440e430cfd7c070d5bcf7e8", "sha256": "db29dba8649abed813b46feb911140b3f456db16c795915c4734ffc8a0e3c011"}, "downloads": -1, "filename": "appdynamics-4.0.6.0-py2-none-any.whl", "has_sig": false, "md5_digest": "ef3524933440e430cfd7c070d5bcf7e8", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 189604, "upload_time": "2015-05-29T00:52:43", "upload_time_iso_8601": "2015-05-29T00:52:43.219426Z", "url": "https://files.pythonhosted.org/packages/20/73/ea65e50ee3c18d5419e57ca87f0c3be908957123a9f980611b5c1d429174/appdynamics-4.0.6.0-py2-none-any.whl", "yanked": false}], "4.0.6.0.1": [{"comment_text": "", "digests": {"md5": "6404f23eed45bd31dd81ed349aaa8e7d", "sha256": "12315051c693a932c34e5e2beefaaa28cb3fa583036d4c17032b10174cdd8fc9"}, "downloads": -1, "filename": "appdynamics-4.0.6.0.1-cp2-none-any.whl", "has_sig": false, "md5_digest": "6404f23eed45bd31dd81ed349aaa8e7d", "packagetype": "bdist_wheel", "python_version": "cp2", "requires_python": null, "size": 198935, "upload_time": "2015-07-07T21:59:43", "upload_time_iso_8601": "2015-07-07T21:59:43.689027Z", "url": "https://files.pythonhosted.org/packages/c7/08/f7a2f643760e7137553013086bf18903833f9f9a587a35712c1aa51bb4fe/appdynamics-4.0.6.0.1-cp2-none-any.whl", "yanked": false}], "4.1.0.0": [{"comment_text": "", "digests": {"md5": "6b028922aee43678358a3da8e4d998ef", "sha256": "7c674551b49b4c0df352f0c14599880047e6ead6efd26184592cf763227c4ce0"}, "downloads": -1, "filename": "appdynamics-4.1.0.0-py2-none-any.whl", "has_sig": false, "md5_digest": "6b028922aee43678358a3da8e4d998ef", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 193038, "upload_time": "2015-06-22T22:13:59", "upload_time_iso_8601": "2015-06-22T22:13:59.485316Z", "url": "https://files.pythonhosted.org/packages/b8/e6/aa9aea54da497959e6adc3c75d2d2f2c686e1c33baa3976b3f98490ec071/appdynamics-4.1.0.0-py2-none-any.whl", "yanked": false}], "4.1.1.0": [{"comment_text": "", "digests": {"md5": "64597a75cac94ed4677264d54f2527ab", "sha256": "9625548e7937facf0fa249839a72c19fbecab822976242e038ae8cc5d6bef17e"}, "downloads": -1, "filename": "appdynamics-4.1.1.0-py2-none-any.whl", "has_sig": false, "md5_digest": "64597a75cac94ed4677264d54f2527ab", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 195294, "upload_time": "2015-07-22T19:54:54", "upload_time_iso_8601": "2015-07-22T19:54:54.238603Z", "url": "https://files.pythonhosted.org/packages/53/b7/06581e8cb5246555597ae0bd40ee030045ff8e3a5c013f636051e688ec40/appdynamics-4.1.1.0-py2-none-any.whl", "yanked": false}], "4.1.10.2": [{"comment_text": "", "digests": {"md5": "468fcb1b959772a167781eafa1c3fd9d", "sha256": "7d795cc2b97922df22d062f2c2258a69e390d1c1570d2d72fa79b25db3a2c6ee"}, "downloads": -1, "filename": "appdynamics-4.1.10.2-py2-none-any.whl", "has_sig": false, "md5_digest": "468fcb1b959772a167781eafa1c3fd9d", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 207098, "upload_time": "2016-05-06T17:24:30", "upload_time_iso_8601": "2016-05-06T17:24:30.237706Z", "url": "https://files.pythonhosted.org/packages/77/f7/f5ca14097ed5eb8a920d4971e87e91925f72168b75edb635b4d2d74a3900/appdynamics-4.1.10.2-py2-none-any.whl", "yanked": false}], "4.1.10.3": [{"comment_text": "", "digests": {"md5": "236820cde1d9e52de605a69f0c96eea1", "sha256": "4741acc0e02a3482833db4f2770466709bd38ec7f7a60640a4fd2ffdecf48dec"}, "downloads": -1, "filename": "appdynamics-4.1.10.3-py2-none-any.whl", "has_sig": false, "md5_digest": "236820cde1d9e52de605a69f0c96eea1", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 207092, "upload_time": "2016-05-25T22:48:03", "upload_time_iso_8601": "2016-05-25T22:48:03.381250Z", "url": "https://files.pythonhosted.org/packages/59/51/8dccb69d145fe60cc02fba7b56e04adb597b7bc95c53c3037d3e33a3124e/appdynamics-4.1.10.3-py2-none-any.whl", "yanked": false}], "4.1.10.4": [{"comment_text": "", "digests": {"md5": "0e8a3c977f072d1e8c855d27b2516445", "sha256": "d346448f6cf203de617dcdf08cbe707f3734c0c6f594bb85cbb57fa92b10944f"}, "downloads": -1, "filename": "appdynamics-4.1.10.4-py2-none-any.whl", "has_sig": false, "md5_digest": "0e8a3c977f072d1e8c855d27b2516445", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 208270, "upload_time": "2016-06-22T20:01:28", "upload_time_iso_8601": "2016-06-22T20:01:28.936023Z", "url": "https://files.pythonhosted.org/packages/e7/72/7a24ff77e786bdb811c57e5557bede09b08e26231772287e383de01cd99d/appdynamics-4.1.10.4-py2-none-any.whl", "yanked": false}], "4.1.10.5": [{"comment_text": "", "digests": {"md5": "29bde5145803ab26dada366ac8575e2e", "sha256": "6f28d0b39fdcb7374e37dc835ef953d56b5185f58a3e139799d41c12186d7190"}, "downloads": -1, "filename": "appdynamics-4.1.10.5-py2-none-any.whl", "has_sig": false, "md5_digest": "29bde5145803ab26dada366ac8575e2e", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 208266, "upload_time": "2016-07-12T21:42:51", "upload_time_iso_8601": "2016-07-12T21:42:51.238178Z", "url": "https://files.pythonhosted.org/packages/bf/94/89ec9f197b51c93729f4416fe052d4f5b86dd3363b4f01c4abcc569cbbc1/appdynamics-4.1.10.5-py2-none-any.whl", "yanked": false}], "4.1.10.6": [{"comment_text": "", "digests": {"md5": "0dd02a3fd8515cef036265bcbdc7efab", "sha256": "e296372b284d9d283eddc1fb388bc455829cf212460f631ef262e86622620dc5"}, "downloads": -1, "filename": "appdynamics-4.1.10.6-py2-none-any.whl", "has_sig": false, "md5_digest": "0dd02a3fd8515cef036265bcbdc7efab", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 208266, "upload_time": "2016-07-15T21:04:06", "upload_time_iso_8601": "2016-07-15T21:04:06.062379Z", "url": "https://files.pythonhosted.org/packages/fa/97/f64f84c6336207c485fa4899e0b84fda16d8aeaf10db72f9841d70afbc5e/appdynamics-4.1.10.6-py2-none-any.whl", "yanked": false}], "4.1.2.0": [{"comment_text": "", "digests": {"md5": "12a63ecaf9352357826195eda31c1e31", "sha256": "8962cbf20bf50cd8357fbe24dfb09fc2f8454b729a8b8a1c4fb7871892fdf2f2"}, "downloads": -1, "filename": "appdynamics-4.1.2.0-py2-none-any.whl", "has_sig": false, "md5_digest": "12a63ecaf9352357826195eda31c1e31", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 200717, "upload_time": "2015-08-12T20:19:19", "upload_time_iso_8601": "2015-08-12T20:19:19.760700Z", "url": "https://files.pythonhosted.org/packages/31/f1/aab83dbcf81af716da2efaf61f9de3080cf57a051ab4a3c0e61bf6357a93/appdynamics-4.1.2.0-py2-none-any.whl", "yanked": false}], "4.1.3.0": [{"comment_text": "", "digests": {"md5": "095cadfcee81a94187090aca5a281331", "sha256": "7253cabd24eef48d23b2c521a9f4e853c1a0af86b506bd0fda04d89c2e9cef94"}, "downloads": -1, "filename": "appdynamics-4.1.3.0-py2-none-any.whl", "has_sig": false, "md5_digest": "095cadfcee81a94187090aca5a281331", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 201320, "upload_time": "2015-08-28T01:09:51", "upload_time_iso_8601": "2015-08-28T01:09:51.520418Z", "url": "https://files.pythonhosted.org/packages/a0/a3/12684ad56780442374f1eb3997e36441d7b890c9b08bed3b63bc46f65d8b/appdynamics-4.1.3.0-py2-none-any.whl", "yanked": false}], "4.1.4.0": [{"comment_text": "", "digests": {"md5": "15b37cef9e6266d55752250bb50ff836", "sha256": "25ff0c21227543ca32face1faffd0298c5a48748d3ed62a229fc88168b556e45"}, "downloads": -1, "filename": "appdynamics-4.1.4.0-py2-none-any.whl", "has_sig": false, "md5_digest": "15b37cef9e6266d55752250bb50ff836", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 206375, "upload_time": "2015-09-17T23:38:48", "upload_time_iso_8601": "2015-09-17T23:38:48.159950Z", "url": "https://files.pythonhosted.org/packages/57/b7/cff6f5c81d23a7aebc82366d24f456f46f840d3823fb07a6251b07f3ca31/appdynamics-4.1.4.0-py2-none-any.whl", "yanked": false}], "4.1.5.0": [{"comment_text": "", "digests": {"md5": "40d4387775745a02c2282fc1a714a020", "sha256": "a3dccdd536dd2fa3a16a3209b3755235f5196b92342345e990584dfc1071ab7a"}, "downloads": -1, "filename": "appdynamics-4.1.5.0-py2-none-any.whl", "has_sig": false, "md5_digest": "40d4387775745a02c2282fc1a714a020", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 206452, "upload_time": "2015-10-08T21:28:31", "upload_time_iso_8601": "2015-10-08T21:28:31.506126Z", "url": "https://files.pythonhosted.org/packages/ea/a8/d2982139810d1beba460f13356f64605ac36424d86868eab52257333eafc/appdynamics-4.1.5.0-py2-none-any.whl", "yanked": false}], "4.1.7.0": [{"comment_text": "", "digests": {"md5": "d7d78f2ebe8669f7522ddc22f449f26e", "sha256": "8049dee4a8ee5bfc348dfaef320c960d86aef29c306d5424ef8a2a8343808655"}, "downloads": -1, "filename": "appdynamics-4.1.7.0-py2-none-any.whl", "has_sig": false, "md5_digest": "d7d78f2ebe8669f7522ddc22f449f26e", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 207150, "upload_time": "2015-11-20T23:59:36", "upload_time_iso_8601": "2015-11-20T23:59:36.013045Z", "url": "https://files.pythonhosted.org/packages/14/94/b1435ae9169bc35cb8ebdc28e0bba5e90e241d3a175863697fa691fd5a9f/appdynamics-4.1.7.0-py2-none-any.whl", "yanked": false}], "4.1.7.1": [{"comment_text": "", "digests": {"md5": "76392c69f8c07fea38073bc11aee926c", "sha256": "2da32ec50408d7b5458911026f019d96850302fa613f2782dbfa611996c52615"}, "downloads": -1, "filename": "appdynamics-4.1.7.1-py2-none-any.whl", "has_sig": false, "md5_digest": "76392c69f8c07fea38073bc11aee926c", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 159207, "upload_time": "2015-11-24T02:23:03", "upload_time_iso_8601": "2015-11-24T02:23:03.813240Z", "url": "https://files.pythonhosted.org/packages/b4/93/d9d103a541e3df739b1167edb78658ffee66838898c021c7386d72dfe09e/appdynamics-4.1.7.1-py2-none-any.whl", "yanked": false}], "4.1.8.0": [{"comment_text": "", "digests": {"md5": "bd67bd15b1f7a558a3c967df899cb851", "sha256": "18b231210c2b645baea1489875ee503a065606c166737e7240fdf24695443d85"}, "downloads": -1, "filename": "appdynamics-4.1.8.0-py2-none-any.whl", "has_sig": false, "md5_digest": "bd67bd15b1f7a558a3c967df899cb851", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 207188, "upload_time": "2015-12-18T23:21:37", "upload_time_iso_8601": "2015-12-18T23:21:37.738168Z", "url": "https://files.pythonhosted.org/packages/32/68/d07e5002790795e8e2b3e6e44f156e414b0320bba4ff19d8d9c52b8ac750/appdynamics-4.1.8.0-py2-none-any.whl", "yanked": false}], "4.2.0.0": [{"comment_text": "", "digests": {"md5": "aa2a58562780126c4ea4f23374b13b0b", "sha256": "133588fdfca93ac183ad1ae0e58eb77020c8df8d603dbbdf93d075433b1fc08a"}, "downloads": -1, "filename": "appdynamics-4.2.0.0-py2-none-any.whl", "has_sig": false, "md5_digest": "aa2a58562780126c4ea4f23374b13b0b", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 212917, "upload_time": "2016-01-19T17:12:05", "upload_time_iso_8601": "2016-01-19T17:12:05.610341Z", "url": "https://files.pythonhosted.org/packages/92/12/577f77f8fca5728d1e43424c77f2405f73ac8dd15bb4fcee13317f5379e8/appdynamics-4.2.0.0-py2-none-any.whl", "yanked": false}], "4.2.0.1": [{"comment_text": "", "digests": {"md5": "00e540cd5cabec3b10690bd751728d1c", "sha256": "4ad421f11f7ef9e4e1c1387974151f127c252723610daf9ba4c413e6fed94052"}, "downloads": -1, "filename": "appdynamics-4.2.0.1-py2-none-any.whl", "has_sig": false, "md5_digest": "00e540cd5cabec3b10690bd751728d1c", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 179392, "upload_time": "2016-01-20T23:16:59", "upload_time_iso_8601": "2016-01-20T23:16:59.282714Z", "url": "https://files.pythonhosted.org/packages/c9/21/c3ed8aeed309990db69818faa537a86d4c1db086233153af6745553706a2/appdynamics-4.2.0.1-py2-none-any.whl", "yanked": false}], "4.2.1.0": [{"comment_text": "", "digests": {"md5": "c45d5d88951658423df3958c6aed1e9e", "sha256": "df77d1382ad081d5ac23cb42ce85cee90f776bca03e40d6730e6a619e6808777"}, "downloads": -1, "filename": "appdynamics-4.2.1.0-py2-none-any.whl", "has_sig": false, "md5_digest": "c45d5d88951658423df3958c6aed1e9e", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 223563, "upload_time": "2016-03-07T22:29:44", "upload_time_iso_8601": "2016-03-07T22:29:44.141457Z", "url": "https://files.pythonhosted.org/packages/40/1b/a57dacadd08669b1cb15665be022120b44a1f66e842a9463f4eef7dec856/appdynamics-4.2.1.0-py2-none-any.whl", "yanked": false}], "4.2.1.1": [{"comment_text": "", "digests": {"md5": "88bbe302c9915c36d7dda697894b9582", "sha256": "27ee0dc576a344b1ac845ea24cf143d591aac20e9b3a2a816c21df92409ee116"}, "downloads": -1, "filename": "appdynamics-4.2.1.1-py2-none-any.whl", "has_sig": false, "md5_digest": "88bbe302c9915c36d7dda697894b9582", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 216721, "upload_time": "2016-03-11T18:13:27", "upload_time_iso_8601": "2016-03-11T18:13:27.073186Z", "url": "https://files.pythonhosted.org/packages/d0/c7/656cb71eed4f5d52d0d91594088b965a1baa6d84626d400fe1a1a640fc24/appdynamics-4.2.1.1-py2-none-any.whl", "yanked": false}], "4.2.10.0": [{"comment_text": "", "digests": {"md5": "8e88762f5b7762ddf472fe592c30ab68", "sha256": "720f29c28b7627b8a068a7f6030ca5377c9e7fe945ee6f2d9346e31e0b7660a9"}, "downloads": -1, "filename": "appdynamics-4.2.10.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "8e88762f5b7762ddf472fe592c30ab68", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 208834, "upload_time": "2016-12-14T00:34:55", "upload_time_iso_8601": "2016-12-14T00:34:55.449643Z", "url": "https://files.pythonhosted.org/packages/16/00/8a911d0d6e315ef064d2363c60ea5a86dfd149a9b57e86427cc87784109c/appdynamics-4.2.10.0-py2.py3-none-any.whl", "yanked": false}], "4.2.11.0": [{"comment_text": "", "digests": {"md5": "3818fcef95a79e5eed43697d0005d905", "sha256": "9daefa48271432908977a71ceb3d9b08a6eb6531aa52bee5f704768c5c78a01d"}, "downloads": -1, "filename": "appdynamics-4.2.11.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "3818fcef95a79e5eed43697d0005d905", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 209460, "upload_time": "2016-12-29T00:42:45", "upload_time_iso_8601": "2016-12-29T00:42:45.180908Z", "url": "https://files.pythonhosted.org/packages/a8/ab/678d546037919e8cc185559c4e8153df7861c6a4ec5b67654d59171483ef/appdynamics-4.2.11.0-py2.py3-none-any.whl", "yanked": false}], "4.2.12.0": [{"comment_text": "", "digests": {"md5": "baa88d2432b67e089c58d199abbe58c7", "sha256": "0b00dbbae9d90f7f71a0a269b35ac2605e6963fe5db6784aa0ff8ad133a55f5c"}, "downloads": -1, "filename": "appdynamics-4.2.12.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "baa88d2432b67e089c58d199abbe58c7", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 209461, "upload_time": "2017-01-17T21:14:59", "upload_time_iso_8601": "2017-01-17T21:14:59.383682Z", "url": "https://files.pythonhosted.org/packages/01/19/3e91fe8a4320829cf071c15da97eb2fc8d14b5bbbd49922a090f32ef8dc9/appdynamics-4.2.12.0-py2.py3-none-any.whl", "yanked": false}], "4.2.12.1": [{"comment_text": "", "digests": {"md5": "19a153e497041db25e26e1fde2f8597a", "sha256": "b54cd1d1bc80ef016dccebfc0637dc9f0bc4902858417df8e9e473f46433497e"}, "downloads": -1, "filename": "appdynamics-4.2.12.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "19a153e497041db25e26e1fde2f8597a", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 210062, "upload_time": "2017-01-09T22:00:38", "upload_time_iso_8601": "2017-01-09T22:00:38.718846Z", "url": "https://files.pythonhosted.org/packages/da/75/80479f7455a6727a4fde8a4f612f94d129832480c667bbddbadeb1cd1a74/appdynamics-4.2.12.1-py2.py3-none-any.whl", "yanked": false}], "4.2.12.2": [{"comment_text": "", "digests": {"md5": "be1687fae86397dd53b46dade91c13b4", "sha256": "8150927d78a5c112d9e4be03c74484813c3e3b5fc40d1ec80005b49679deb918"}, "downloads": -1, "filename": "appdynamics-4.2.12.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "be1687fae86397dd53b46dade91c13b4", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 210207, "upload_time": "2017-01-10T18:35:11", "upload_time_iso_8601": "2017-01-10T18:35:11.975341Z", "url": "https://files.pythonhosted.org/packages/eb/55/ed20e1d8096d0c0db9fbaaab3628628e71a94739370c6446094fdc41139c/appdynamics-4.2.12.2-py2.py3-none-any.whl", "yanked": false}], "4.2.13.0": [{"comment_text": "", "digests": {"md5": "d18d188c047f47d0ae06835d80061cb3", "sha256": "64718b396a4f886df48926ff517274ee34af4cd885b91655b5ff04b2880bd3cc"}, "downloads": -1, "filename": "appdynamics-4.2.13.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "d18d188c047f47d0ae06835d80061cb3", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 210219, "upload_time": "2017-02-07T18:39:06", "upload_time_iso_8601": "2017-02-07T18:39:06.677755Z", "url": "https://files.pythonhosted.org/packages/88/49/0e7cdcf6901373a127e55dda1801902bd235f8a51bce055604a583e60225/appdynamics-4.2.13.0-py2.py3-none-any.whl", "yanked": false}], "4.2.13.1": [{"comment_text": "", "digests": {"md5": "db92d6ce6e2bee5b9640c42c0f75754c", "sha256": "4162065c9d01582a9a8b66f88f91742a90d5d9b3bbf954929d886ed097a6a69a"}, "downloads": -1, "filename": "appdynamics-4.2.13.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "db92d6ce6e2bee5b9640c42c0f75754c", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 211099, "upload_time": "2017-01-25T06:49:14", "upload_time_iso_8601": "2017-01-25T06:49:14.568502Z", "url": "https://files.pythonhosted.org/packages/85/1b/ecada538400251aaca53504e74afc4588fdf62c50a9c9bf78753a8e0b102/appdynamics-4.2.13.1-py2.py3-none-any.whl", "yanked": false}], "4.2.14.0": [{"comment_text": "", "digests": {"md5": "ef7cded240ea3c554864226a7d151b16", "sha256": "7448ec6fa89248ea4ef1cc618b10ceb9d445d8ee6ea6280eeacc4eb5ec8fabc2"}, "downloads": -1, "filename": "appdynamics-4.2.14.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "ef7cded240ea3c554864226a7d151b16", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 211201, "upload_time": "2017-02-22T23:46:42", "upload_time_iso_8601": "2017-02-22T23:46:42.572289Z", "url": "https://files.pythonhosted.org/packages/63/7e/827f31af3491ae4c09b5269bf9a59b712d74975ea05c75e649e69782bdd6/appdynamics-4.2.14.0-py2.py3-none-any.whl", "yanked": false}], "4.2.15.0": [{"comment_text": "", "digests": {"md5": "8c9a421d8699788ddf11375d8c0b1e06", "sha256": "f271cf5dcf28c04420b8ef06591c0c8684f37c9712b38396a77d922d85eb9bef"}, "downloads": -1, "filename": "appdynamics-4.2.15.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "8c9a421d8699788ddf11375d8c0b1e06", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 213664, "upload_time": "2017-03-16T23:32:44", "upload_time_iso_8601": "2017-03-16T23:32:44.096760Z", "url": "https://files.pythonhosted.org/packages/10/69/e539ccdccd0370fddc7722a1baa314e2d70245f6f5a9a13c01be05527904/appdynamics-4.2.15.0-py2.py3-none-any.whl", "yanked": false}], "4.2.15.1": [{"comment_text": "", "digests": {"md5": "9c4cc3e488f5ded0e5863cb3ea852465", "sha256": "9c667d6808a0f619a6846bd848ff66ca93ffd41af013537c7c9f92358b6f5636"}, "downloads": -1, "filename": "appdynamics-4.2.15.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "9c4cc3e488f5ded0e5863cb3ea852465", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 213665, "upload_time": "2017-03-30T17:56:33", "upload_time_iso_8601": "2017-03-30T17:56:33.133166Z", "url": "https://files.pythonhosted.org/packages/20/da/20535489a0cb77ff914a48e8b24881dfa5f7e4d14b6c1f4fe61635c3aaf6/appdynamics-4.2.15.1-py2.py3-none-any.whl", "yanked": false}], "4.2.2.0": [{"comment_text": "", "digests": {"md5": "a398a7fec189da5eece502aeaa73ff72", "sha256": "5a0fb52a78c0bd613cce89670bbda8023aae9a9afd02345e24142fdbebce92a4"}, "downloads": -1, "filename": "appdynamics-4.2.2.0-py2-none-any.whl", "has_sig": false, "md5_digest": "a398a7fec189da5eece502aeaa73ff72", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 223561, "upload_time": "2016-05-12T21:59:37", "upload_time_iso_8601": "2016-05-12T21:59:37.878260Z", "url": "https://files.pythonhosted.org/packages/c7/89/97bd0eedd70a2a1ed830d5821056956ae2e298a110ba5b1bd3e5e22e8f97/appdynamics-4.2.2.0-py2-none-any.whl", "yanked": false}], "4.2.2.1": [{"comment_text": "", "digests": {"md5": "107bf26ed8b519d5df2aec4c9f5cd30c", "sha256": "88ce1eb4997b7038351d9499ca51cd1caebabe4ca43ffeb34b00b86396bdfee1"}, "downloads": -1, "filename": "appdynamics-4.2.2.1-py2-none-any.whl", "has_sig": false, "md5_digest": "107bf26ed8b519d5df2aec4c9f5cd30c", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 223563, "upload_time": "2016-05-18T22:40:41", "upload_time_iso_8601": "2016-05-18T22:40:41.658337Z", "url": "https://files.pythonhosted.org/packages/55/1c/bae2bdef0212cc39a3a15673879e2fa640cd91d27328732ef54aa5f4b630/appdynamics-4.2.2.1-py2-none-any.whl", "yanked": false}], "4.2.2.2": [{"comment_text": "", "digests": {"md5": "9fd3b46d3e9ab56bc378e29e03f6af9f", "sha256": "c7a05b33cee8a64c2357162045973f9dca06a59660eea7f0e05bb7069bbe1887"}, "downloads": -1, "filename": "appdynamics-4.2.2.2-py2-none-any.whl", "has_sig": false, "md5_digest": "9fd3b46d3e9ab56bc378e29e03f6af9f", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 224730, "upload_time": "2016-06-09T23:22:57", "upload_time_iso_8601": "2016-06-09T23:22:57.796137Z", "url": "https://files.pythonhosted.org/packages/0d/95/af407caee9735c9d2d48a77cff8551643a02174b10b2181ccec4c05bcc44/appdynamics-4.2.2.2-py2-none-any.whl", "yanked": false}], "4.2.2.3": [{"comment_text": "", "digests": {"md5": "b362b2a136d7d6b98871423145cffc73", "sha256": "b26617e8179320ac51cd0ebdb2f81162a193d8735e4ff9378a61ab48105df7e4"}, "downloads": -1, "filename": "appdynamics-4.2.2.3-py2-none-any.whl", "has_sig": false, "md5_digest": "b362b2a136d7d6b98871423145cffc73", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 224740, "upload_time": "2016-08-22T23:08:20", "upload_time_iso_8601": "2016-08-22T23:08:20.841887Z", "url": "https://files.pythonhosted.org/packages/ea/80/573be54738b69e527192ad06f62561776043838e6dc5b84e787ef1a479cd/appdynamics-4.2.2.3-py2-none-any.whl", "yanked": false}], "4.2.3.0": [{"comment_text": "", "digests": {"md5": "5ae3a23aae2ed362b278c2677756ec01", "sha256": "d3d431f0b60deb45945e41e5f30649ed633c4b55ce01089fbc934f9878d2dde1"}, "downloads": -1, "filename": "appdynamics-4.2.3.0-py2-none-any.whl", "has_sig": false, "md5_digest": "5ae3a23aae2ed362b278c2677756ec01", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 221948, "upload_time": "2016-07-01T20:58:55", "upload_time_iso_8601": "2016-07-01T20:58:55.404362Z", "url": "https://files.pythonhosted.org/packages/78/57/5aca342aae84acede7b35c1a0e8ae653ea76482e920a93441733e3bc5ce0/appdynamics-4.2.3.0-py2-none-any.whl", "yanked": false}], "4.2.3.1": [{"comment_text": "", "digests": {"md5": "2ad02c83a22203d140fc728e789adfde", "sha256": "05bc2d701c696e7d346f1993f5c8085c61a1ab2c14e8eb79af61ede1d0d5a600"}, "downloads": -1, "filename": "appdynamics-4.2.3.1-py2-none-any.whl", "has_sig": false, "md5_digest": "2ad02c83a22203d140fc728e789adfde", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 221950, "upload_time": "2016-07-09T07:16:14", "upload_time_iso_8601": "2016-07-09T07:16:14.942232Z", "url": "https://files.pythonhosted.org/packages/07/05/7b0797631e002cb9a742d76058a386087324cdfb2ff3a3682581feeadf27/appdynamics-4.2.3.1-py2-none-any.whl", "yanked": false}], "4.2.3.2": [{"comment_text": "", "digests": {"md5": "4b5e428a1e3f736c4cd1360dd31e5151", "sha256": "5125645c3035d12cae6f843622f1f5605d816bd8a5d32ec79870162affdc4ee6"}, "downloads": -1, "filename": "appdynamics-4.2.3.2-py2-none-any.whl", "has_sig": false, "md5_digest": "4b5e428a1e3f736c4cd1360dd31e5151", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 221950, "upload_time": "2016-07-25T23:10:52", "upload_time_iso_8601": "2016-07-25T23:10:52.823032Z", "url": "https://files.pythonhosted.org/packages/e8/c5/9e0e35c1d7dd0308bede92d2f17ee8e58af97a2145ae6352ab9d57b1ef04/appdynamics-4.2.3.2-py2-none-any.whl", "yanked": false}], "4.2.3.3": [{"comment_text": "", "digests": {"md5": "cf3e02a036db7cbb92fbe132a14bf432", "sha256": "6b107b0106d324a429ea57605c27705be7dd6e4fdcdfd14071b9228dd04f05b7"}, "downloads": -1, "filename": "appdynamics-4.2.3.3-py2-none-any.whl", "has_sig": false, "md5_digest": "cf3e02a036db7cbb92fbe132a14bf432", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 221949, "upload_time": "2016-08-04T22:58:32", "upload_time_iso_8601": "2016-08-04T22:58:32.437786Z", "url": "https://files.pythonhosted.org/packages/dd/63/016bbfac8e7fcd25a1b674a5b6c3dea057b15a352e3aa1fff54257d34e8a/appdynamics-4.2.3.3-py2-none-any.whl", "yanked": false}], "4.2.3.4": [{"comment_text": "", "digests": {"md5": "74e6ff620b7ad8f6338edc4957c4d30e", "sha256": "d87a108b9b8783fb150cebb8e3a1cd058d7dbb9528a217b914df2273938ecd4a"}, "downloads": -1, "filename": "appdynamics-4.2.3.4-py2-none-any.whl", "has_sig": false, "md5_digest": "74e6ff620b7ad8f6338edc4957c4d30e", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 221952, "upload_time": "2016-08-25T22:34:29", "upload_time_iso_8601": "2016-08-25T22:34:29.690134Z", "url": "https://files.pythonhosted.org/packages/fb/89/4a83324e2471e8bfa30ab606fc402f9acb99ac30fbf73fbd8850aee5dd38/appdynamics-4.2.3.4-py2-none-any.whl", "yanked": false}], "4.2.4.0": [{"comment_text": "", "digests": {"md5": "6e6acf8a9807909d0a16a363bd0c16e5", "sha256": "83a4fe310a0391e4aa1f48572dbc09934918ebb27aabbd9b58e55e740f343d08"}, "downloads": -1, "filename": "appdynamics-4.2.4.0-py2-none-any.whl", "has_sig": false, "md5_digest": "6e6acf8a9807909d0a16a363bd0c16e5", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 221942, "upload_time": "2016-07-29T21:31:53", "upload_time_iso_8601": "2016-07-29T21:31:53.273047Z", "url": "https://files.pythonhosted.org/packages/91/7c/76a54af0e1b7c9d70b56880b47e3e6beb036ea2ec7b6c15dc6525f99b411/appdynamics-4.2.4.0-py2-none-any.whl", "yanked": false}], "4.2.4.1": [{"comment_text": "", "digests": {"md5": "d83686ab817a25d37a1a6d77e36da6c5", "sha256": "87a7dd02162f8c3782d7318db60beb4cbd810e370603a47c810d9c358a8525f2"}, "downloads": -1, "filename": "appdynamics-4.2.4.1-py2-none-any.whl", "has_sig": false, "md5_digest": "d83686ab817a25d37a1a6d77e36da6c5", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 221948, "upload_time": "2016-08-05T21:31:03", "upload_time_iso_8601": "2016-08-05T21:31:03.750872Z", "url": "https://files.pythonhosted.org/packages/1e/c8/c7e6c97fd33cf14ed63e29da29d1ae07eee4983daedcc638d5f43c53222c/appdynamics-4.2.4.1-py2-none-any.whl", "yanked": false}], "4.2.5.0": [{"comment_text": "", "digests": {"md5": "54813f5ece9afa5da982755e6d2f8fb9", "sha256": "dc373b33d3df41a282f36af04b735934d7167aa146c7e4f6d64beece395296fd"}, "downloads": -1, "filename": "appdynamics-4.2.5.0-py2-none-any.whl", "has_sig": false, "md5_digest": "54813f5ece9afa5da982755e6d2f8fb9", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 222393, "upload_time": "2016-08-11T23:13:02", "upload_time_iso_8601": "2016-08-11T23:13:02.267819Z", "url": "https://files.pythonhosted.org/packages/ec/d7/393664d7d561a5df3ec4dc053725c42bfd086bc0f2c5f0aa1a9969e9520a/appdynamics-4.2.5.0-py2-none-any.whl", "yanked": false}], "4.2.5.1": [{"comment_text": "", "digests": {"md5": "87c133e46daae3fd986936b5ce67ac97", "sha256": "b72064b37822f8ce544fa5b794a2859e77a47a8d7161791e221415fd04c9ce91"}, "downloads": -1, "filename": "appdynamics-4.2.5.1-py2-none-any.whl", "has_sig": false, "md5_digest": "87c133e46daae3fd986936b5ce67ac97", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 222394, "upload_time": "2016-08-24T00:00:30", "upload_time_iso_8601": "2016-08-24T00:00:30.322428Z", "url": "https://files.pythonhosted.org/packages/3c/96/9eb9d8ca460bc47f375ab0cbcf0c5cedcf772a1e298db1a63d37d4c507ec/appdynamics-4.2.5.1-py2-none-any.whl", "yanked": false}], "4.2.5.2": [{"comment_text": "", "digests": {"md5": "021701246b922c6be9ced7439e8f1935", "sha256": "406602be25637fe4c00a6847cc0a2d44a4e97fbde86af5edd66b699928d9c538"}, "downloads": -1, "filename": "appdynamics-4.2.5.2-py2-none-any.whl", "has_sig": false, "md5_digest": "021701246b922c6be9ced7439e8f1935", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 222393, "upload_time": "2016-09-01T18:51:45", "upload_time_iso_8601": "2016-09-01T18:51:45.255737Z", "url": "https://files.pythonhosted.org/packages/ea/0e/f36afc0d20d29721a497201d4f85780960db9a349bfa19cce6ca438e70cd/appdynamics-4.2.5.2-py2-none-any.whl", "yanked": false}], "4.2.6.0": [{"comment_text": "", "digests": {"md5": "652dd9862ae3f6a9b851b39d27b3c653", "sha256": "4023e99dd9caaa4d4fbd298164515c1425774e9e2edae7a9930c216c0c56849c"}, "downloads": -1, "filename": "appdynamics-4.2.6.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "652dd9862ae3f6a9b851b39d27b3c653", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 229631, "upload_time": "2016-09-08T18:26:44", "upload_time_iso_8601": "2016-09-08T18:26:44.053961Z", "url": "https://files.pythonhosted.org/packages/be/dc/f69f0b0c365cf22938c2fcf6a8f41e4ff6c78fbdca22544b9a4af0209d40/appdynamics-4.2.6.0-py2.py3-none-any.whl", "yanked": false}], "4.2.6.1": [{"comment_text": "", "digests": {"md5": "53cec86a4e6ac6ef60e7cec594a6081e", "sha256": "9c197fa933ec578b354c18c4cb482839f19de910e7b58fc9f41e3249c5c61d51"}, "downloads": -1, "filename": "appdynamics-4.2.6.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "53cec86a4e6ac6ef60e7cec594a6081e", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 180599, "upload_time": "2016-09-06T22:24:53", "upload_time_iso_8601": "2016-09-06T22:24:53.050567Z", "url": "https://files.pythonhosted.org/packages/b5/3e/6580ce93822155c7011f6574c9d7fb256b11126f68513bb4f4b3c64cf08f/appdynamics-4.2.6.1-py2.py3-none-any.whl", "yanked": false}], "4.2.6.2": [{"comment_text": "", "digests": {"md5": "d2cd95f4c036269a0e24251455367ab7", "sha256": "bed4aeaa9aa2d4e61b3b7316a1eef0564f4faf35c368f010626a5f5cd68dbe96"}, "downloads": -1, "filename": "appdynamics-4.2.6.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "d2cd95f4c036269a0e24251455367ab7", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 229619, "upload_time": "2016-09-29T00:04:51", "upload_time_iso_8601": "2016-09-29T00:04:51.781201Z", "url": "https://files.pythonhosted.org/packages/b1/7e/302906a6ce18953ea95a9f4acc8b144aca482d25612c1b58b1ed1fd8a88b/appdynamics-4.2.6.2-py2.py3-none-any.whl", "yanked": false}], "4.2.7.0": [{"comment_text": "", "digests": {"md5": "97b666fca556351b8a8d6beb3fb7d25c", "sha256": "c1872d0a6064deede270a86807cb8276d9aaa33273dfc12d08a8f41d2fbff14f"}, "downloads": -1, "filename": "appdynamics-4.2.7.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "97b666fca556351b8a8d6beb3fb7d25c", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 231494, "upload_time": "2016-09-23T19:42:26", "upload_time_iso_8601": "2016-09-23T19:42:26.795695Z", "url": "https://files.pythonhosted.org/packages/bd/f4/ccc8af2806fc9c4a0c0d11af42981295b431f01c6880c8b18d383444034f/appdynamics-4.2.7.0-py2.py3-none-any.whl", "yanked": false}], "4.2.8.0": [{"comment_text": "", "digests": {"md5": "32dbc47a57d37fa1d755035a3cc36601", "sha256": "c4562672d3290d5ce9829c8abecec95f69e4ee30a032080aec0e9bc399ba0c2a"}, "downloads": -1, "filename": "appdynamics-4.2.8.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "32dbc47a57d37fa1d755035a3cc36601", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 232410, "upload_time": "2016-10-27T23:01:13", "upload_time_iso_8601": "2016-10-27T23:01:13.950646Z", "url": "https://files.pythonhosted.org/packages/6e/4c/9d380ef3113af65c625a4730faeeff43105d1cebf0bb8ebc97028124f77c/appdynamics-4.2.8.0-py2.py3-none-any.whl", "yanked": false}], "4.2.8.1": [{"comment_text": "", "digests": {"md5": "abcdba334917f092275dc942ebc582ee", "sha256": "e5df7a6935192224b64ac04b5654f2f7a04c5c8d065a2b2bd897269c4b6d6101"}, "downloads": -1, "filename": "appdynamics-4.2.8.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "abcdba334917f092275dc942ebc582ee", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 208722, "upload_time": "2016-11-02T18:44:45", "upload_time_iso_8601": "2016-11-02T18:44:45.076242Z", "url": "https://files.pythonhosted.org/packages/2b/10/2c85059db6e94ef1f2d7abb50f2a17dcc8413ccdff3768b28c5221eeb8dc/appdynamics-4.2.8.1-py2.py3-none-any.whl", "yanked": false}], "4.2.9.0": [{"comment_text": "", "digests": {"md5": "bfac332941d956c28546383709029683", "sha256": "167882fa34202493d274586b30828ef0a4785ced4f49399f59f9674a9d642a37"}, "downloads": -1, "filename": "appdynamics-4.2.9.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "bfac332941d956c28546383709029683", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 208778, "upload_time": "2016-11-10T19:12:57", "upload_time_iso_8601": "2016-11-10T19:12:57.514403Z", "url": "https://files.pythonhosted.org/packages/83/45/76907c87866cb857354490bb5d8fcfa76a4b407685d3a903642834259fb8/appdynamics-4.2.9.0-py2.py3-none-any.whl", "yanked": false}], "4.2.9.1": [{"comment_text": "", "digests": {"md5": "444a9917ff32255c4f5ebe60b77f1bc3", "sha256": "83e16997c868163478f5dc53a7dc74f18a94ce24de791844c8793f2c82bf3c08"}, "downloads": -1, "filename": "appdynamics-4.2.9.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "444a9917ff32255c4f5ebe60b77f1bc3", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 201840, "upload_time": "2016-11-20T22:24:07", "upload_time_iso_8601": "2016-11-20T22:24:07.899241Z", "url": "https://files.pythonhosted.org/packages/a5/4e/fdcf621e2a17351941f7c79323d19599df3ad006722c3921cdf91b0f44e9/appdynamics-4.2.9.1-py2.py3-none-any.whl", "yanked": false}], "4.2.9.2": [{"comment_text": "", "digests": {"md5": "f7e6d14fdd91165b450c6ad5bf7de54c", "sha256": "ee0a5a729dc4cdd456791ca345ece1f3a2e849ab1d45976656882db6b81201ec"}, "downloads": -1, "filename": "appdynamics-4.2.9.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "f7e6d14fdd91165b450c6ad5bf7de54c", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 232478, "upload_time": "2016-11-15T21:21:27", "upload_time_iso_8601": "2016-11-15T21:21:27.640169Z", "url": "https://files.pythonhosted.org/packages/08/b8/76ad5739ab74d89c3c4207096ac8d0e444fa0129e3e570ee2a80cbe1785e/appdynamics-4.2.9.2-py2.py3-none-any.whl", "yanked": false}], "4.3.0.1": [{"comment_text": "", "digests": {"md5": "13a3713ece26e046d707a1f628a0583d", "sha256": "9aa39cb77e48e4be7d2b6c0ba74485692da073e22cb976260006149bd9079c8c"}, "downloads": -1, "filename": "appdynamics-4.3.0.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "13a3713ece26e046d707a1f628a0583d", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 218525, "upload_time": "2017-04-05T23:03:00", "upload_time_iso_8601": "2017-04-05T23:03:00.231377Z", "url": "https://files.pythonhosted.org/packages/94/63/71317f4d81f873ffba01d858eb56d71ea3f137901422e95eea42c3c91cfa/appdynamics-4.3.0.1-py2.py3-none-any.whl", "yanked": false}], "4.3.1.0": [{"comment_text": "", "digests": {"md5": "c9f003f1928b0e6509532a65e0b509f8", "sha256": "d425eab2d1e32305a866659ead97b85465760be17042272aaab53c04ad578f1f"}, "downloads": -1, "filename": "appdynamics-4.3.1.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "c9f003f1928b0e6509532a65e0b509f8", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 218526, "upload_time": "2017-05-10T20:26:42", "upload_time_iso_8601": "2017-05-10T20:26:42.356790Z", "url": "https://files.pythonhosted.org/packages/53/ed/ddddffa79e3da23701147444be2f7997a5c2c43fd8caadfc09a31e830b64/appdynamics-4.3.1.0-py2.py3-none-any.whl", "yanked": false}], "4.3.10.0": [{"comment_text": "", "digests": {"md5": "8aa21cd389acaec23f960d5e7159fecf", "sha256": "ace2c0ccf740dce18bf6b4e104c8b611bc581061fcaa6f5a8888d69d3b51683e"}, "downloads": -1, "filename": "appdynamics-4.3.10.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "8aa21cd389acaec23f960d5e7159fecf", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 180976, "upload_time": "2017-08-29T18:26:21", "upload_time_iso_8601": "2017-08-29T18:26:21.395523Z", "url": "https://files.pythonhosted.org/packages/9a/5d/710b186640929cc2864725512fa385ceab4300b7acbfaca725efd4c66764/appdynamics-4.3.10.0-py2.py3-none-any.whl", "yanked": false}], "4.3.11.0": [{"comment_text": "", "digests": {"md5": "30657bb514fabb5ab6971377122d1135", "sha256": "43d1877023074e1410567ec8047b319b6080ae7557a65116e5da12cd07efec26"}, "downloads": -1, "filename": "appdynamics-4.3.11.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "30657bb514fabb5ab6971377122d1135", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 181060, "upload_time": "2017-09-05T17:16:58", "upload_time_iso_8601": "2017-09-05T17:16:58.538300Z", "url": "https://files.pythonhosted.org/packages/1d/75/8be34c9210fa695a19902c4b2d8a886c8c24351eddfb95da56d838a02f9b/appdynamics-4.3.11.0-py2.py3-none-any.whl", "yanked": false}], "4.3.12.0": [{"comment_text": "", "digests": {"md5": "e199b4b10cdc651c419749e3401d3ca5", "sha256": "f21ae3f5cfec0aabc911364e994510942b389ccb9dd0d415eb98c6a2f12c1ca0"}, "downloads": -1, "filename": "appdynamics-4.3.12.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "e199b4b10cdc651c419749e3401d3ca5", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 180995, "upload_time": "2017-09-19T17:24:58", "upload_time_iso_8601": "2017-09-19T17:24:58.911058Z", "url": "https://files.pythonhosted.org/packages/4c/c5/8c29fa61734d3fcfc7cfe8c744ddd3bdf6b8b7f6d4b8eaae0f383f71c0b0/appdynamics-4.3.12.0-py2.py3-none-any.whl", "yanked": false}], "4.3.13.0": [{"comment_text": "", "digests": {"md5": "f2a4610e78b6cd7451326c959c3f18ce", "sha256": "a52599efa6594d692372c582e14f7d77744c9ef4bb42e851753144c00eca5349"}, "downloads": -1, "filename": "appdynamics-4.3.13.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "f2a4610e78b6cd7451326c959c3f18ce", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 180971, "upload_time": "2017-10-10T17:15:50", "upload_time_iso_8601": "2017-10-10T17:15:50.133249Z", "url": "https://files.pythonhosted.org/packages/46/ff/3c7892dc73611b33e0cec557cade186cc2420513491e40ce263e27486bdc/appdynamics-4.3.13.0-py2.py3-none-any.whl", "yanked": false}], "4.3.14.0": [{"comment_text": "", "digests": {"md5": "534a006279ed832b8cc22404c292af8a", "sha256": "26007fed59bdab2db5512bf83346ebc071be4498074acfb4ca8ab90b98f3728b"}, "downloads": -1, "filename": "appdynamics-4.3.14.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "534a006279ed832b8cc22404c292af8a", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 181126, "upload_time": "2017-10-24T18:50:03", "upload_time_iso_8601": "2017-10-24T18:50:03.652865Z", "url": "https://files.pythonhosted.org/packages/33/fa/efed8bfa78713ce55e1634c1b9f9ad94d53e17274fd3832f8c20889182ec/appdynamics-4.3.14.0-py2.py3-none-any.whl", "yanked": false}], "4.3.15.0": [{"comment_text": "", "digests": {"md5": "f76a3afb7aecb26fa30735ea07ff64f4", "sha256": "d5fc01c8b193fec7cbb3facc3bc7bd598a9d0f980e2c371820fba587f8b9fbd0"}, "downloads": -1, "filename": "appdynamics-4.3.15.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "f76a3afb7aecb26fa30735ea07ff64f4", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 181127, "upload_time": "2017-10-31T17:17:44", "upload_time_iso_8601": "2017-10-31T17:17:44.192330Z", "url": "https://files.pythonhosted.org/packages/c1/d4/34b731b68e1673ed6fad6dea30b42cc72c18072236dfd3c29c10e5506ed2/appdynamics-4.3.15.0-py2.py3-none-any.whl", "yanked": false}], "4.3.16.0": [{"comment_text": "", "digests": {"md5": "f59f8d8f719b2249c0230d8c56423526", "sha256": "b3f83218abea33cb2f4806b1effdf26ac4663ada60ca51d3467734405c3e0592"}, "downloads": -1, "filename": "appdynamics-4.3.16.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "f59f8d8f719b2249c0230d8c56423526", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 181978, "upload_time": "2017-11-07T18:17:19", "upload_time_iso_8601": "2017-11-07T18:17:19.123845Z", "url": "https://files.pythonhosted.org/packages/ae/f1/9c46f2f4c011ba0bfae6c62fb65bef736bd7f92ebe2151aaabc6f5e0fcc4/appdynamics-4.3.16.0-py2.py3-none-any.whl", "yanked": false}], "4.3.17.0": [{"comment_text": "", "digests": {"md5": "bc9fb20e6ec870e0fc2544c1515b0d7c", "sha256": "8d432477d4e113776a4f257fe5aa3ba7a48be37c0a735dea193e87f4067076ed"}, "downloads": -1, "filename": "appdynamics-4.3.17.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "bc9fb20e6ec870e0fc2544c1515b0d7c", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 182211, "upload_time": "2018-03-08T02:00:03", "upload_time_iso_8601": "2018-03-08T02:00:03.383166Z", "url": "https://files.pythonhosted.org/packages/2e/30/32c2e5b283f2fd5d74ce9040e77ab69ff2b73e94577385af1c6d0be7b0ae/appdynamics-4.3.17.0-py2.py3-none-any.whl", "yanked": false}], "4.3.18.0": [{"comment_text": "", "digests": {"md5": "f9816a640d041633d5c7946979fee8a8", "sha256": "02345b8684b6642e8fffa27e2a6ab97f0e84c1caafac72378782daf1765367ab"}, "downloads": -1, "filename": "appdynamics-4.3.18.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "f9816a640d041633d5c7946979fee8a8", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 182209, "upload_time": "2018-05-30T19:16:58", "upload_time_iso_8601": "2018-05-30T19:16:58.499622Z", "url": "https://files.pythonhosted.org/packages/85/a3/ef215e84af9b8ab102e1a1bac783b375bbb8a3d99800352b93ad0b6f0181/appdynamics-4.3.18.0-py2.py3-none-any.whl", "yanked": false}], "4.3.2.0": [{"comment_text": "", "digests": {"md5": "d9f747264f42076b70d5b67a6427010d", "sha256": "6baeeec0c89a0a3f230470129805a87be13c7e6e34bd5450db7ec49978dedd18"}, "downloads": -1, "filename": "appdynamics-4.3.2.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "d9f747264f42076b70d5b67a6427010d", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 220532, "upload_time": "2017-06-02T01:12:59", "upload_time_iso_8601": "2017-06-02T01:12:59.593622Z", "url": "https://files.pythonhosted.org/packages/57/27/86b917b2a699c45a71d29abb77fdc011984f1ddf60fca055f678de782aa5/appdynamics-4.3.2.0-py2.py3-none-any.whl", "yanked": false}], "4.3.3.0": [{"comment_text": "", "digests": {"md5": "c83cbc739c6fe3c13d2671f7bfba933d", "sha256": "d23c64f3577b3b02cfbb061d45d14bcfcb249309cf7ca9b31d3ecaa7300ccd0a"}, "downloads": -1, "filename": "appdynamics-4.3.3.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "c83cbc739c6fe3c13d2671f7bfba933d", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 220582, "upload_time": "2017-06-20T09:47:16", "upload_time_iso_8601": "2017-06-20T09:47:16.150385Z", "url": "https://files.pythonhosted.org/packages/57/5d/3fe3fd9a1da05ae5c9a1559579e2b2e5698ea21f612413f51334f96e9127/appdynamics-4.3.3.0-py2.py3-none-any.whl", "yanked": false}], "4.3.8.0": [{"comment_text": "", "digests": {"md5": "711af56b107a49ec2acbaa3584a8f5eb", "sha256": "a8f82b9e95a047f8701a56ccd813b5fd0f03a3b559169aa249899550793b1e2c"}, "downloads": -1, "filename": "appdynamics-4.3.8.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "711af56b107a49ec2acbaa3584a8f5eb", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 180372, "upload_time": "2017-08-10T23:16:45", "upload_time_iso_8601": "2017-08-10T23:16:45.644184Z", "url": "https://files.pythonhosted.org/packages/aa/40/3b6d6fb7fce30506d4d912ab006ec46473c8740bb0afb5b9ba544071ec51/appdynamics-4.3.8.0-py2.py3-none-any.whl", "yanked": false}], "4.3.9.0": [{"comment_text": "", "digests": {"md5": "bdffcfb9171f02e93eecd596cbacc93e", "sha256": "73375ad0972cbacc0c8d7f5424a1e6607f079b9c9da10c5a61c163fa8a17789c"}, "downloads": -1, "filename": "appdynamics-4.3.9.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "bdffcfb9171f02e93eecd596cbacc93e", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 180375, "upload_time": "2017-08-22T17:23:45", "upload_time_iso_8601": "2017-08-22T17:23:45.912314Z", "url": "https://files.pythonhosted.org/packages/5e/43/3001c3f0be705abb4047ccaa78e71b3eaa973e6d49cf829c721aa917bbae/appdynamics-4.3.9.0-py2.py3-none-any.whl", "yanked": false}], "4.5.0.0": [{"comment_text": "", "digests": {"md5": "4655f486f32c3d349401d7763ecd4d04", "sha256": "7d35e5f3d7c0795381e542264da187074d5eb28d104db1ab24c243c355c1eaf6"}, "downloads": -1, "filename": "appdynamics-4.5.0.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "4655f486f32c3d349401d7763ecd4d04", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 182191, "upload_time": "2018-07-11T23:35:16", "upload_time_iso_8601": "2018-07-11T23:35:16.788718Z", "url": "https://files.pythonhosted.org/packages/cb/d4/71572337a4f797fab3dfc07ebab867ec0996817070a0859e63335e5c5d39/appdynamics-4.5.0.0-py2.py3-none-any.whl", "yanked": false}], "4.5.1.0": [{"comment_text": "", "digests": {"md5": "b7d72c375eb6330a4e947d3f45df8d89", "sha256": "0142e2d0799f498c1285f6aa547fae6d0908b3747144924b61592ae0a6e5c362"}, "downloads": -1, "filename": "appdynamics-4.5.1.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "b7d72c375eb6330a4e947d3f45df8d89", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 182161, "upload_time": "2019-02-11T23:27:36", "upload_time_iso_8601": "2019-02-11T23:27:36.406283Z", "url": "https://files.pythonhosted.org/packages/6e/ea/c2965156b8e5d080d190b2a83cbc71309a899899bd009eaa1e195ae39295/appdynamics-4.5.1.0-py2.py3-none-any.whl", "yanked": false}], "4.5.2.0": [{"comment_text": "", "digests": {"md5": "7c9abac1eee1121f41d374160a90e28a", "sha256": "8aaf90d7bef7391b9ab9e1726cb104d0bd9caa97d043c731a03a49c5df48aaf7"}, "downloads": -1, "filename": "appdynamics-4.5.2.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "7c9abac1eee1121f41d374160a90e28a", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 182534, "upload_time": "2019-07-16T03:43:45", "upload_time_iso_8601": "2019-07-16T03:43:45.621414Z", "url": "https://files.pythonhosted.org/packages/99/f2/0bb371bf4ea0a9cc2976b847b8b5ef9cf490078da8b1fe0099ef23ecd434/appdynamics-4.5.2.0-py2.py3-none-any.whl", "yanked": false}], "4.5.3.0": [{"comment_text": "", "digests": {"md5": "1e86ab7648cb6406d42488c0275e85cd", "sha256": "af8e006a57489770c5db8238108635abbf45531aa401a1dfe5bdc2adbb330fc8"}, "downloads": -1, "filename": "appdynamics-4.5.3.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "1e86ab7648cb6406d42488c0275e85cd", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 182595, "upload_time": "2019-08-06T17:52:06", "upload_time_iso_8601": "2019-08-06T17:52:06.560435Z", "url": "https://files.pythonhosted.org/packages/00/d6/2ed2d9890d95ec1242b69f60c1babe1de45eaa3074aa678107d438e75684/appdynamics-4.5.3.0-py2.py3-none-any.whl", "yanked": false}], "4.5.4.0": [{"comment_text": "", "digests": {"md5": "f2623ee8e519030bee239f9c513d7cb5", "sha256": "4e54aa847ca61686336eced01e5ab052c89ffda77df2e6610d3ac2fdc49ce4ff"}, "downloads": -1, "filename": "appdynamics-4.5.4.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "f2623ee8e519030bee239f9c513d7cb5", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 182948, "upload_time": "2019-08-13T17:21:19", "upload_time_iso_8601": "2019-08-13T17:21:19.816043Z", "url": "https://files.pythonhosted.org/packages/c4/88/af1b6199456a903c66d0cf40cb790ddedcad6ba276677ee86881db970b4f/appdynamics-4.5.4.0-py2.py3-none-any.whl", "yanked": false}], "4.5.5.0": [{"comment_text": "", "digests": {"md5": "ce47479c6f0c7235d96b1b4816c544ec", "sha256": "7ba1e4ff77d1193413fe9fd8a48fbc15554064961967df198f694259ba6af253"}, "downloads": -1, "filename": "appdynamics-4.5.5.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "ce47479c6f0c7235d96b1b4816c544ec", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 182993, "upload_time": "2019-09-11T19:08:23", "upload_time_iso_8601": "2019-09-11T19:08:23.284216Z", "url": "https://files.pythonhosted.org/packages/6b/a3/dee4f79813d3e2346877f99d0c76f9c316ce182a63d5144f56f931cd3efa/appdynamics-4.5.5.0-py2.py3-none-any.whl", "yanked": false}], "4.5.6.0": [{"comment_text": "", "digests": {"md5": "053e73e5ea9738d55d7bc9a1cb7baf50", "sha256": "bcd53fe1af105a926f3beeced0e5eda29b572918d0156a8351ca4e81d1229a71"}, "downloads": -1, "filename": "appdynamics-4.5.6.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "053e73e5ea9738d55d7bc9a1cb7baf50", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 228633, "upload_time": "2019-10-21T23:06:08", "upload_time_iso_8601": "2019-10-21T23:06:08.396501Z", "url": "https://files.pythonhosted.org/packages/da/9c/91dace7b832477a12ee6a2d5f06f8ba2ef10d1045d3918961d4ce5cacef2/appdynamics-4.5.6.0-py2.py3-none-any.whl", "yanked": false}], "4.5.7.0": [{"comment_text": "", "digests": {"md5": "2d8ce04f44699c146a49de70a2a7b39b", "sha256": "5ecf8f711a43d3278e4e0d1d32b1349cb91c3894625edb9b6b46d4ba4deb425b"}, "downloads": -1, "filename": "appdynamics-4.5.7.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "2d8ce04f44699c146a49de70a2a7b39b", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 228720, "upload_time": "2019-10-25T19:03:54", "upload_time_iso_8601": "2019-10-25T19:03:54.567284Z", "url": "https://files.pythonhosted.org/packages/bf/ed/2040d8ec7088ec99dc304a4d8278bf79a1473d3c1de3cb284c1fc1bf7cdc/appdynamics-4.5.7.0-py2.py3-none-any.whl", "yanked": false}], "4.5.8.0": [{"comment_text": "", "digests": {"md5": "8a131ca376cf3fc04cd453a4acd59794", "sha256": "770bbd08f5fe97090956a680e520621fc7f0580471af04fbb80216b2044f3af5"}, "downloads": -1, "filename": "appdynamics-4.5.8.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "8a131ca376cf3fc04cd453a4acd59794", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 229114, "upload_time": "2019-11-13T00:55:33", "upload_time_iso_8601": "2019-11-13T00:55:33.381900Z", "url": "https://files.pythonhosted.org/packages/c1/39/9736ccc054ed982973efe45baf1491bf187e9431a105b163d6a087888d4b/appdynamics-4.5.8.0-py2.py3-none-any.whl", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "8996746138316f1e4500dc81287a8ae8", "sha256": "3dfec6ccb25445fa5b050d3691c9d56bac4262aa5b971690144f3343760ddc83"}, "downloads": -1, "filename": "appdynamics-20.3.0-py2.py3-none-any.whl", "has_sig": true, "md5_digest": "8996746138316f1e4500dc81287a8ae8", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 229426, "upload_time": "2020-03-27T14:52:30", "upload_time_iso_8601": "2020-03-27T14:52:30.558632Z", "url": "https://files.pythonhosted.org/packages/b5/2a/76245af5c72c2910d796f58a5a34b704b53e31a702d5decce0ac00599e0e/appdynamics-20.3.0-py2.py3-none-any.whl", "yanked": false}], "timestamp": "Thu May  7 18:17:41 2020"}