{"info": {"author": "Jake Biesinger; Daniel Newkirk; Alvin Chon; Yong Zhang; Tao (Foo) Liu", "author_email": "jake.biesinger@gmail.com; dnewkirk@uci.edu; achon@uci.edu; zy@jimmy.harvard.edu; taoliu@jimmy.harvard.edu", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Console", "Intended Audience :: Developers", "Intended Audience :: Science/Research", "License :: OSI Approved :: Artistic License", "Operating System :: MacOS :: MacOS X", "Operating System :: Microsoft :: Windows", "Operating System :: POSIX", "Programming Language :: Python :: 2.6", "Programming Language :: Python :: 2.7", "Topic :: Scientific/Engineering :: Bio-Informatics"], "description": "README for AREM 1.0.1, based on MACS 1.4.0rc2\nTime-stamp: <2011-03-01 18:21:42 Jake Biesinger>\n\n* Introduction\n\nHigh-throughput sequencing coupled to chromatin immuno-\nprecipitation (ChIP-Seq) is widely used in characterizing genome-wide\nbinding patterns of transcription factors, cofactors, chromatin modifiers,\nand other DNA binding proteins. A key step in ChIP-Seq data analysis\nis to map short reads from high-throughput sequencing to a reference\ngenome and identify peak regions enriched with short reads. Although\nseveral methods have been proposed for ChIP-Seq analysis, most ex-\nisting methods only consider reads that can be uniquely placed in the\nreference genome, and therefore have low power for detecting peaks lo-\ncated within repeat sequences. Here we introduce a probabilistic ap-\nproach for ChIP-Seq data analysis which utilizes all reads, providing a\ntruly genome-wide view of binding patterns. Reads are modeled using a\nmixture model corresponding to K enriched regions and a null genomic\nbackground. We use maximum likelihood to estimate the locations of the\nenriched regions, and implement an expectation-maximization (E-M) al-\ngorithm, called AREM, to update the alignment probabilities of each\nread to different genomic locations.\n\nFor additional information, see our paper in RECOMB 2011 or visit our website:\nhttp://cbcl.ics.uci.edu/AREM\n\nAREM is based on the popular MACS peak caller, as described below:\n\nWith the improvement of sequencing techniques, chromatin\nimmunoprecipitation followed by high throughput sequencing (ChIP-Seq)\nis getting popular to study genome-wide protein-DNA interactions. To\naddress the lack of powerful ChIP-Seq analysis method, we present a\nnovel algorithm, named Model-based Analysis of ChIP-Seq (MACS), for\nidentifying transcript factor binding sites. MACS captures the\ninfluence of genome complexity to evaluate the significance of\nenriched ChIP regions, and MACS improves the spatial resolution of\nbinding sites through combining the information of both sequencing tag\nposition and orientation. MACS can be easily used for ChIP-Seq data\nalone, or with control sample with the increase of specificity.\n\nThe original MACS package is available at: http://liulab.dfci.harvard.edu/MACS/\n\n* Install\n\nPlease check the file 'INSTALL' in the distribution.\n\n* Usage\n\nUsage: arem <-t tfile> [-n name] [-g genomesize] [options]\n\nExample: arem -t ChIP.bam -c Control.bam -f BAM -g h -n test -w --call-subpeaks\n\n\narem -- Aligning Reads by Expectation-Maximization, based on Model-based Analysis for ChIP-Sequencing (MACS)\n\nOptions:\n  --version             show program's version number and exit\n  -h, --help            show this help message and exit.\n  -t TFILE, --treatment=TFILE\n                        ChIP-seq treatment files. REQUIRED. When ELANDMULTIPET\n                        is selected, you must provide two files separated by\n                        comma, e.g.\n                        s_1_1_eland_multi.txt,s_1_2_eland_multi.txt\n  -c CFILE, --control=CFILE\n                        Control files. When ELANDMULTIPET is selected, you\n                        must provide two files separated by comma, e.g.\n                        s_2_1_eland_multi.txt,s_2_2_eland_multi.txt\n  -n NAME, --name=NAME  Experiment name, which will be used to generate output\n                        file names. DEFAULT: \"NA\"\n  -f FORMAT, --format=FORMAT\n                        Format of tag file, \"AUTO\", \"BED\" or \"ELAND\" or\n                        \"ELANDMULTI\" or \"ELANDMULTIPET\" or \"ELANDEXPORT\" or\n                        \"SAM\" or \"BAM\" or \"BOWTIE\". The default AUTO option\n                        will let MACS decide which format the file is. Please\n                        check the definition in 00README file if you choose EL\n                        AND/ELANDMULTI/ELANDMULTIPET/ELANDEXPORT/SAM/BAM/BOWTI\n                        E. DEFAULT: \"AUTO\"\n  --petdist=PETDIST     Best distance between Pair-End Tags. Only available\n                        when format is 'ELANDMULTIPET'. DEFAULT: 200\n  -g GSIZE, --gsize=GSIZE\n                        Effective genome size. It can be 1.0e+9 or 1000000000,\n                        or shortcuts:'hs' for human (2.7e9), 'mm' for mouse\n                        (1.87e9), 'ce' for C. elegans (9e7) and 'dm' for\n                        fruitfly (1.2e8), Default:hs\n  -s TSIZE, --tsize=TSIZE\n                        Tag size. This will overide the auto detected tag\n                        size. DEFAULT: 25\n  --bw=BW               Band width. This value is only used while building the\n                        shifting model. DEFAULT: 300\n  -p PVALUE, --pvalue=PVALUE\n                        Pvalue cutoff for peak detection. DEFAULT: 1e-5\n  -m MFOLD, --mfold=MFOLD\n                        Select the regions within MFOLD range of high-\n                        confidence enrichment ratio against background to\n                        build model. The regions must be lower than upper\n                        limit, and higher than the lower limit. DEFAULT:10,30\n  --nolambda            If True, MACS will use fixed background lambda as\n                        local lambda for every peak region. Normally, MACS\n                        calculates a dynamic local lambda to reflect the local\n                        bias due to potential chromatin structure.\n  --slocal=SMALLLOCAL   The small nearby region in basepairs to calculate\n                        dynamic lambda. This is used to capture the bias near\n                        the peak summit region. Invalid if there is no control\n                        data. DEFAULT: 1000\n  --llocal=LARGELOCAL   The large nearby region in basepairs to calculate\n                        dynamic lambda. This is used to capture the surround\n                        bias. DEFAULT: 10000.\n  --off-auto            Whether turn off the auto pair model process. If not\n                        set, when MACS failed to build paired model, it will\n                        use the nomodel settings, the '--shiftsize' parameter\n                        to shift and extend each tags. DEFAULT: False\n  --nomodel             Whether or not to build the shifting model. If True,\n                        MACS will not build model. by default it means\n                        shifting size = 100, try to set shiftsize to change\n                        it. DEFAULT: False\n  --shiftsize=SHIFTSIZE\n                        The arbitrary shift size in bp. When nomodel is true,\n                        MACS will use this value as 1/2 of fragment size.\n                        DEFAULT: 100\n  --keep-dup=KEEPDUPLICATES\n                        It controls the MACS behavior towards duplicate tags\n                        at the exact same location -- the same coordination\n                        and the same strand. The default 'auto' option makes\n                        MACS calculate the maximum tags at the exact same\n                        location based on binomal distribution using 1e-5 as\n                        pvalue cutoff; and the 'all' option keeps every tags.\n                        If an integer is given, at most this number of tags\n                        will be kept at the same location. Default: auto\n  --to-small            When set, scale the larger dataset down to the smaller\n                        dataset, by default, the smaller dataset will be\n                        scaled towards the larger dataset. DEFAULT: False\n  -w, --wig             Whether or not to save extended fragment pileup at\n                        every WIGEXTEND bps into a wiggle file. When --single-\n                        profile is on, only one file for the whole genome is\n                        saved. WARNING: this process is time/space consuming!!\n  -B, --bdg             Whether or not to save extended fragment pileup at\n                        every bp into a bedGraph file. When it's on, -w,\n                        --space and --call-subpeaks will be ignored. When\n                        --single-profile is on, only one file for the whole\n                        genome is saved. WARNING: this process is time/space\n                        consuming!!\n  -S, --single-profile  When set, a single wiggle file will be saved for\n                        treatment and input. Default: False\n  --space=SPACE         The resoluation for saving wiggle files, by default,\n                        MACS will save the raw tag count every 10 bps. Usable\n                        only with '--wig' option.\n  --call-subpeaks       If set, MACS will invoke Mali Salmon's PeakSplitter\n                        soft through system call. If PeakSplitter can't be\n                        found, an instruction will be shown for downloading\n                        and installing the PeakSplitter package. -w option\n                        needs to be on and -B should be off to let it work.\n                        DEFAULT: False\n  --verbose=VERBOSE     Set verbose level. 0: only show critical message, 1:\n                        show additional warning message, 2: show process\n                        information, 3: show debug messages. DEFAULT:2\n  --diag                Whether or not to produce a diagnosis report. It's up\n                        to 9X time consuming. Please check 00README file for\n                        detail. DEFAULT: False\n  --fe-min=FEMIN        For diagnostics, min fold enrichment to consider.\n                        DEFAULT: 0\n  --fe-max=FEMAX        For diagnostics, max fold enrichment to consider.\n                        DEFAULT: maximum fold enrichment\n  --fe-step=FESTEP      For diagnostics, fold enrichment step.  DEFAULT: 20\n  --no-EM               Do NOT iteratively align multi-reads by E-M. Multi-\n                        read probabilities will be based on quality scores or\n                        uniform (if --no-quals) DEFAULT : FALSE\n  --EM-converge-diff=MIN_CHANGE\n                        The minimum entropy change between iterations before\n                        halting E-M steps. DEFAULT : 1e-05\n  --EM-min-score=MIN_SCORE\n                        Minimum enrichment score. Windows below this threshold\n                        will all look the same to the aligner. DEFAULT : 1.5\n  --EM-max-score=MAX_SCORE\n                        Maximum enrichment score. Windows above this threshold\n                        will all look the same to the aligner, DEFAULT : No\n                        Maximum\n  --EM-show-graphs      generate diagnostic graphs for E-M. (requires\n                        MATPLOTLIB). DEFAULT : FALSE\n  --quality-scale=QUAL_SCALE\n                        Initial alignment probabilities are determined by read\n                        quality and mismatches. Each possible alignment is\n                        assigned a probability from the product over all bases\n                        of either 1-p(ReadError_base) when there is no\n                        mismatch, or p(ReadError_base) when the called base\n                        disagrees with the reference.  You may also select a\n                        uniform initialization. Read quality scale is the must\n                        be one of ['auto', 'sanger+33', 'illumina+64'].\n                        DEFAULT : auto\n  --random-multi        Convert all multi reads to unique reads by selecting\n                        one alignment at random for each read. DEFAULT : False\n  --no-multi            Throw away all reads that have more than one alignment\n  --no-greedy-caller    Use AREM default peak caller instead of the greedy\n                        caller. This normally results in wider, less enriched\n                        peaks, especially with multi-reads. DEFAULT : False\n  --no-map-quals        Do not use mapping probabilities as priors in each\n                        update step; just use relative enrichment. DEFAULT :\n                        False\n  --prior-snp=PRIOR_PROB_SNP\n                        Prior probability that a SNP occurs at any base in the\n                        genome. DEFAULT : 0.001\n  --write-read-probs    Write out all final reads, including their alignment\n                        probabilities as a BED file. DEFAULT : FALSE\n\n** Parameters:\n\n*** -t/--treatment FILENAME\n\nThis is the only REQUIRED parameter for MACS. If the format is\nELANDMULTIPET, user must provide two treatment files separated by\ncomma, e.g. s_1_1_eland_multi.txt,s_1_2_eland_multi.txt.\n\n*** -c/--control\n\nThe control or mock data file in either BED format or any ELAND output\nformat specified by --format option. Please follow the same direction\nas for -t/--treatment.\n\n*** -n/--name\n\nThe name string of the experiment. MACS will use this string NAME to\ncreate output files like 'NAME_peaks.xls', 'NAME_negative_peaks.xls',\n'NAME_peaks.bed' , 'NAME_summits.bed', 'NAME_model.r' and so on. So\nplease avoid any confliction between these filenames and your existing\nfiles.\n\n*** -f/--format FORMAT\n\nFormat of tag file, can be \"ELAND\", \"BED\", \"ELANDMULTI\",\n\"ELANDEXPORT\", \"ELANDMULTIPET\" (for pair-end tags), \"SAM\", \"BAM\" or\n\"BOWTIE\". Default is \"AUTO\" which will allow MACS to decide the format\nautomatically. Please use \"AUTO\" only when you combine different\nformats of files.\n\nThe BED format is defined in \"http://genome.ucsc.edu/FAQ/FAQformat#format1\".\n\nIf the format is ELAND, the file must be ELAND result output file,\neach line MUST represents only ONE tag, with fields of:\n\n 1. Sequence name (derived from file name and line number if format is not Fasta)\n 2. Sequence\n 3. Type of match: \n NM - no match found.\n QC - no matching done: QC failure (too many Ns basically).\n RM - no matching done: repeat masked (may be seen if repeatFile.txt was specified).\n U0 - Best match found was a unique exact match.\n U1 - Best match found was a unique 1-error match. \n U2 - Best match found was a unique 2-error match. \n R0 - Multiple exact matches found.\n R1 - Multiple 1-error matches found, no exact matches.\n R2 - Multiple 2-error matches found, no exact or 1-error matches.\n 4. Number of exact matches found.\n 5. Number of 1-error matches found.\n 6. Number of 2-error matches found.\n Rest of fields are only seen if a unique best match was found (i.e. the match code in field 3 begins with \"U\").\n 7. Genome file in which match was found.\n 8. Position of match (bases in file are numbered starting at 1).\n 9. Direction of match (F=forward strand, R=reverse).\n 10. How N characters in read were interpreted: (\".\"=not applicable, \"D\"=deletion, \"I\"=insertion).\n Rest of fields are only seen in the case of a unique inexact match (i.e. the match code was U1 or U2).\n 11. Position and type of first substitution error (e.g. 12A: base 12 was A, not whatever is was in read).\n 12. Position and type of first substitution error, as above. \n\nIf the format is ELANDMULTI, the file must be ELAND output file from\nmultiple-match mode, each line MUST represents only ONE tag, with\nfields of:\n\n 1. Sequence name \n 2. Sequence \n 3. Either NM, QC, RM (as described above) or the following: \n 4. x:y:z where x, y, and z are the number of exact, single-error, and 2-error matches found\n 5. Blank, if no matches found or if too many matches found, or the following:\n    BAC_plus_vector.fa:163022R1,170128F2,E_coli.fa:3909847R1 This says\n    there are two matches to BAC_plus_vector.fa: one in the reverse\n    direction starting at position 160322 with one error, one in the\n    forward direction starting at position 170128 with two\n    errors. There is also a single-error match to E_coli.fa.\n\nIf the data is from Pair-End sequencing. You can sepecify the format\nas ELANDMULTIPET ( stands for ELAND Multiple-match Pair-End Tags),\nthen the --treat (and --control if needed) parameter must be two file\nnames separated by comma. Each file must be in ELAND multiple-match\nformat described above. e.g.\n\nmacs14 --format ELANDMULTIPET -t s_1_1_eland_multi.txt,s_2_1_eland_multi.txt ...\n\nIf you use ELANDMULTIPET, you may need to modify --petdist parameter.\n\nIf the format is BAM/SAM, please check the definition in\n(http://samtools.sourceforge.net/samtools.shtml).  Pair-end mapping\nresults can be saved in a single BAM file, if so, MACS will\nautomatically keep the left mate(5' end) tag.\n\nIf the format is BOWTIE, you need to provide the ASCII bowtie output\nfile with the suffix '.map'. Please note that, you need to make sure\nthat in the bowtie output, you only keep one location for one\nread. Check the bowtie manual for detail if you want at\n(http://bowtie-bio.sourceforge.net/manual.shtml)\n\nHere is the definition for Bowtie output in ASCII characters I copied\nfrom the above webpage:\n\n   1.  Name of read that aligned\n\n   2. Orientation of read in the alignment, - for reverse complement,\n   + otherwise\n\n   3. Name of reference sequence where alignment occurs, or ordinal ID\n   if no name was provided\n\n   4. 0-based offset into the forward reference strand where leftmost\n   character of the alignment occurs\n\n   5. Read sequence (reverse-complemented if orientation is -)\n\n   6. ASCII-encoded read qualities (reversed if orientation is -). The\n   encoded quality values are on the Phred scale and the encoding is\n   ASCII-offset by 33 (ASCII char !).\n\n   7. Number of other instances where the same read aligns against the\n   same reference characters as were aligned against in this\n   alignment. This is not the number of other places the read aligns\n   with the same number of mismatches. The number in this column is\n   generally not a good proxy for that number (e.g., the number in\n   this column may be '0' while the number of other alignments with\n   the same number of mismatches might be large). This column was\n   previously described as \"Reserved\".\n\n   8. Comma-separated list of mismatch descriptors. If there are no\n   mismatches in the alignment, this field is empty. A single\n   descriptor has the format offset:reference-base>read-base. The\n   offset is expressed as a 0-based offset from the high-quality (5')\n   end of the read.\n\nNotes:\n\n1) For BED format, the 6th column of strand information is required by\nMACS. And please pay attention that the coordinates in BED format is\nzero-based and half-open\n(http://genome.ucsc.edu/FAQ/FAQtracks#tracks1).\n\n2) For plain ELAND format, only matches with match type U0, U1 or U2 is\naccepted by MACS, i.e. only the unique match for a sequence with less\nthan 3 errors is involed in calculation. If multiple hits of a single\ntag are included in your raw ELAND file, please remove the redundancy\nto keep the best hit for that sequencing tag.\n\n3) For the experiment with several replicates, it is recommended to\nconcatenate several ChIP-seq treatment files into a single file. To do\nthis, under Unix/Mac or Cygwin (for windows OS), type:\n\n$ cat replicate1.bed replicate2.bed replicate3.bed > all_replicates.bed\n\n4) ELAND export format support sometimes may not work on your\ndatasets, because people may mislabel the 11th and 12th column. MACS\nuses 11th column as the sequence name which should be the chromosome\nnames.\n\n** --petdist=PETDIST     \n\nBest distance between Pair-End Tags. Only available when format is\n'ELANDMULTIPE'. Default is 200bps. When MACS reads mapped positions\nfor 5' tag and 3' tag, it will decide the best pairing for them using\nthis best distance parameter. A simple scoring system is used as following,\n\nscore = abs(abs(p5-p3)-200)+e5+e5\n\nWhere p5 is one of the position of 5' tag, and e5 is the\nmismatch/error for this mapped position of 5' tag. p3 and e3 are for\n3' tag. Then the lowest scored paring is regarded as the best\npairing. The 5' tag position of the pair is kept in model building and\npeak calling.\n\n*** -g/--gsize\n\nPLEASE assign this parameter to fit your needs!\n\nIt's the mappable genome size or effective genome size which is\ndefined as the genome size which can be sequenced. Because of the\nrepetitive features on the chromsomes, the actual mappable genome size\nwill be smaller than the original size, about 90% or 70% of the genome\nsize. The default hs -- 2.7e9 is recommended for UCSC human hg18\nassembly. Here are all precompiled parameters for effective genome size:\n\n-g hs   =  -g 2.7e9\n-g mm   =  -g 1.87e9\n-g ce   =  -g 9e7\n-g dm   =  -g 1.2e8\n\n*** -s/--tsize\n\nThe size of sequencing tags. If you don't specify it, MACS will try to\nuse the first 10 sequences from your input treatment file to determine\nthe tag size. Specifying it will override the automatic determined tag\nsize.\n\n*** --bw\n\nThe band width which is used to scan the genome for model\nbuilding. You can set this parameter as the sonication fragment size\nexpected from wet experiment. The previous side effect on the peak\ndetection process has been removed. So this parameter only affects the\nmodel building.\n\n*** -p/--pvalue\n\nThe pvalue cutoff. Default is 1e-5.\n\n*** -m/--mfold\n\nThis parameter is used to select the regions within MFOLD range of\nhigh-confidence enrichment ratio against background to build\nmodel. The regions must be lower than upper limit, and higher than the\nlower limit of fold enrichment. DEFAULT:10,30 means using all regions\nnot too low (>10) and not too high (<30) to build paired-peaks\nmodel. If MACS can not find more than 100 regions to build model, it\nwill use the --shiftsize parameter to continue the peak detection.\n\nCheck related *--off-auto* and *--shiftsize* for detail.\n\n** --nolambda\n\nWith this flag on, MACS will use the background lambda as local\nlambda. This means MACS will not consider the local bias at peak\ncandidate regions.\n\n** --slocal, --llocal\n\nThese two parameters control which two levels of regions will be\nchecked around the peak regions to calculate the maximum lambda as\nlocal lambda. By default, MACS considers 1000bp for small local\nregion(--slocal), and 10000bps for large local region(--llocal)\nwhich captures the bias from a long range effect like an open\nchromatin domain. You can tweak these according to your\nproject. Remember that if the region is set too small, a sharp spike\nin the input data may kill the significant peak.\n\n** --off-auto\n\nWhether turn off the auto paired-peak model process. If not set, when\nMACS failed to build paired model, it will use the nomodel settings,\nthe '--shiftsize' parameter to shift and extend each tags. If set,\nMACS will be terminated if paried-peak model is failed.\n\n** --nomodel\n\nWhile on, MACS will bypass building the shifting model.\n\n** --shiftsize\n\nWhile '--nomodel' is set, MACS uses this parameter to shift tags to\ntheir midpoint. For example, if the size of binding region for your\ntranscription factor is 200 bp, and you want to bypass the model\nbuilding by MACS, this parameter can be set as 100. This option is\nonly valid when --nomodel is set or when MACS fails to build\npaired-peak model.\n\n**  --keep-dup\n\nIt controls the MACS behavior towards duplicate tags at the exact same\nlocation -- the same coordination and the same strand. The default\n'auto' option makes MACS calculate the maximum tags at the exact same\nlocation based on binomal distribution using 1e-5 as pvalue cutoff;\nand the 'all' option keeps every tags.  If an integer is given, at\nmost this number of tags will be kept at the same location. Default:\nauto\n\n** --to-small \n\nWhen set scale the larger dataset down to the smaller dataset, by\ndefault, the smaller dataset will be scaled towards the larger\ndataset.\n\n** -w/--wig\n\nIf this flag is on, MACS will store the fragment pileup in wiggle\nformat for every chromosome. The gzipped wiggle files will be stored\nin subdirectories named NAME+'_MACS_wiggle/treat' for treatment data\nand NAME+'_MACS_wiggle/control' for control data. --single-profile\noption can be combined to generate a single wig file for the whole\ngenome.\n\n** -B/--bdg\n\nIf this flag is on, MACS will store the fragment pileup in bedGraph\nformat for every chromosome. The bedGraph file is in general much\nsmaller than wiggle file. However, The process will take a little bit\nlonger than -w option, since theoratically 1bp resolution data will be\nsaved. The bedGraph files will be gzipped and stored in subdirectories\nnamed NAME+'_MACS_bedGraph/treat' for treatment and\nNAME+'_MACS_bedGraph/control' for control data.  --single-profile\noption can be combined to generate a single bedGraph file for the\nwhole genome.\n\n** -S/--single-profile (formerly --single-wig)\n\nIf this flag is on, MACS will store the fragment pileup in wiggle or\nbedGraph format for the whole genome instead of for every\nchromosomes. The gzipped wiggle files will be stored in subdirectories\nnamed EXPERIMENT_NAME+'_MACS_wiggle'+'_MACS_wiggle/treat/'\n+EXPERIMENT_NAME+'treat_afterfiting_all.wig.gz' or\n'treat_afterfiting_all.bdg.gz' for treatment data, and\nEXPERIMENT_NAME+'_MACS_wiggle'+'_MACS_wiggle/control/'\n+EXPERIMENT_NAME+'control_afterfiting_all.wig.gz' or\n'control_afterfiting_all.bdg.gz' for control data.\n\n** --space=SPACE         \n\nBy default, the resoluation for saving wiggle files is 10 bps,i.e.,\nMACS will save the raw tag count every 10 bps. You can change it along\nwith '--wig' option.\n\nNote this option doesn't work if -B/--bdg is on.\n\n** --call-subpeaks       \n\nIf set, MACS will invoke Mali Salmon's PeakSplitter software through\nsystem call. If PeakSplitter can't be found, an instruction will be\nshown for downloading and installing the PeakSplitter package. The\nPeakSplitter can refine the MACS peaks and split the wide peaks into\nsmaller subpeaks. For more information, please check the following URL:\n\nhttp://www.ebi.ac.uk/bertone/software/PeakSplitter_Cpp_usage.txt\n\nNote this option doesn't work if -B/--bdg is on.\n\n*** --verbose\n\nIf you don't want to see any message during the running of MACS, set\nit to 0. But the CRITICAL messages will never be hidden. If you want\nto see rich information like how many peaks are called for every\nchromosome, you can set it to 3 or larger than 3.\n\n** --diag\n\nA diagnosis report can be generated through this option. This report\ncan help you get an assumption about the sequencing saturation. This\nfuntion is only in beta stage.\n\n** --fe-min, --fe-max & --fe-step\n\nFor diagnostics, FEMIN and FEMAX are the minimum and maximum fold\nenrichment to consider, and FESTEP is the interval of fold\nenrichment. For example, \"--fe-min 0 --fe-max 40 --fe-step 10\" will\nlet MACS choose the following fold enrichment ranges to consider:\n[0,10), [10,20), [20,30) and [30,40).\n\n* Output files\n\n 1. NAME_peaks.xls is a tabular file which contains information about\n called peaks. You can open it in excel and sort/filter using excel\n functions. Information include: chromosome name, start position of\n peak, end position of peak, length of peak region, peak summit\n position related to the start position of peak region, number of tags\n in peak region, -10*log10(pvalue) for the peak region (e.g. pvalue\n =1e-10, then this value should be 100), fold enrichment for this\n region against random Poisson distribution with local lambda, FDR in\n percentage. Coordinates in XLS is 1-based which is different with BED\n format.\n\n 2. NAME_peaks.bed is BED format file which contains the peak\n locations. You can load it to UCSC genome browser or Affymetrix IGB\n software.\n\n 3. NAME_summits.bed is in BED format, which contains the peak summits\n locations for every peaks. The 5th column in this file is the summit\n height of fragment pileup. If you want to find the motifs at the\n binding sites, this file is recommended.\n\n 4. NAME_negative_peaks.xls is a tabular file which contains\n information about negative peaks. Negative peaks are called by\n swapping the ChIP-seq and control channel.\n\n 5. NAME_model.r is an R script which you can use to produce a PDF\n image about the model based on your data. Load it to R by:\n\n$ R --vanilla < NAME_model.r\n\nThen a pdf file NAME_model.pdf will be generated in your current\ndirectory. Note, R is required to draw this figure.\n\n 6. NAME_treat/control_afterfiting.wig.gz files in NAME_MACS_wiggle\n directory are wiggle format files which can be imported to UCSC\n genome browser/GMOD/Affy IGB. The .bdg.gz files are in bedGraph\n format which can also be imported to UCSC genome browser or be\n converted into even smaller bigWig files.\n\n 7. NAME_diag.xls is the diagnosis report. First column is for various\n fold_enrichment ranges; the second column is number of peaks for that fc\n range; after 3rd columns are the percentage of peaks covered after\n sampling 90%, 80%, 70% ... and 20% of the total tags.\n\n 8. NAME_peaks.subpeaks.bed is a text file which IS NOT in BED\n format. This file is generated by PeakSplitter\n (<http://www.ebi.ac.uk/bertone/software/PeakSplitter_Cpp_usage.txt>)\n when --call-subpeaks option is set.\n\n* Other useful links\n\nCistrome web server for ChIP-chip/seq analysis: http://cistrome.org/ap/\n\nbedTools -- a super useful toolkits for genome annotation files: http://code.google.com/p/bedtools/\n\nUCSC toolkits: http://hgdownload.cse.ucsc.edu/admin/exe/", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://cbcl.ics.uci.edu/AREM", "keywords": null, "license": "Creative", "maintainer": null, "maintainer_email": null, "name": "AREM", "package_url": "https://pypi.org/project/AREM/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/AREM/", "project_urls": {"Download": "UNKNOWN", "Homepage": "http://cbcl.ics.uci.edu/AREM"}, "release_url": "https://pypi.org/project/AREM/1.0.1/", "requires_dist": null, "requires_python": null, "summary": "Aligning Reads by Expectation-Maximization.\nBased on MACS (Model Based Analysis for ChIP-Seq data)", "version": "1.0.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            README for AREM 1.0.1, based on MACS 1.4.0rc2<br>Time-stamp: &lt;2011-03-01 18:21:42 Jake Biesinger&gt;<br><br>* Introduction<br><br>High-throughput sequencing coupled to chromatin immuno-<br>precipitation (ChIP-Seq) is widely used in characterizing genome-wide<br>binding patterns of transcription factors, cofactors, chromatin modifiers,<br>and other DNA binding proteins. A key step in ChIP-Seq data analysis<br>is to map short reads from high-throughput sequencing to a reference<br>genome and identify peak regions enriched with short reads. Although<br>several methods have been proposed for ChIP-Seq analysis, most ex-<br>isting methods only consider reads that can be uniquely placed in the<br>reference genome, and therefore have low power for detecting peaks lo-<br>cated within repeat sequences. Here we introduce a probabilistic ap-<br>proach for ChIP-Seq data analysis which utilizes all reads, providing a<br>truly genome-wide view of binding patterns. Reads are modeled using a<br>mixture model corresponding to K enriched regions and a null genomic<br>background. We use maximum likelihood to estimate the locations of the<br>enriched regions, and implement an expectation-maximization (E-M) al-<br>gorithm, called AREM, to update the alignment probabilities of each<br>read to different genomic locations.<br><br>For additional information, see our paper in RECOMB 2011 or visit our website:<br>http://cbcl.ics.uci.edu/AREM<br><br>AREM is based on the popular MACS peak caller, as described below:<br><br>With the improvement of sequencing techniques, chromatin<br>immunoprecipitation followed by high throughput sequencing (ChIP-Seq)<br>is getting popular to study genome-wide protein-DNA interactions. To<br>address the lack of powerful ChIP-Seq analysis method, we present a<br>novel algorithm, named Model-based Analysis of ChIP-Seq (MACS), for<br>identifying transcript factor binding sites. MACS captures the<br>influence of genome complexity to evaluate the significance of<br>enriched ChIP regions, and MACS improves the spatial resolution of<br>binding sites through combining the information of both sequencing tag<br>position and orientation. MACS can be easily used for ChIP-Seq data<br>alone, or with control sample with the increase of specificity.<br><br>The original MACS package is available at: http://liulab.dfci.harvard.edu/MACS/<br><br>* Install<br><br>Please check the file 'INSTALL' in the distribution.<br><br>* Usage<br><br>Usage: arem &lt;-t tfile&gt; [-n name] [-g genomesize] [options]<br><br>Example: arem -t ChIP.bam -c Control.bam -f BAM -g h -n test -w --call-subpeaks<br><br><br>arem -- Aligning Reads by Expectation-Maximization, based on Model-based Analysis for ChIP-Sequencing (MACS)<br><br>Options:<br>  --version             show program's version number and exit<br>  -h, --help            show this help message and exit.<br>  -t TFILE, --treatment=TFILE<br>                        ChIP-seq treatment files. REQUIRED. When ELANDMULTIPET<br>                        is selected, you must provide two files separated by<br>                        comma, e.g.<br>                        s_1_1_eland_multi.txt,s_1_2_eland_multi.txt<br>  -c CFILE, --control=CFILE<br>                        Control files. When ELANDMULTIPET is selected, you<br>                        must provide two files separated by comma, e.g.<br>                        s_2_1_eland_multi.txt,s_2_2_eland_multi.txt<br>  -n NAME, --name=NAME  Experiment name, which will be used to generate output<br>                        file names. DEFAULT: \"NA\"<br>  -f FORMAT, --format=FORMAT<br>                        Format of tag file, \"AUTO\", \"BED\" or \"ELAND\" or<br>                        \"ELANDMULTI\" or \"ELANDMULTIPET\" or \"ELANDEXPORT\" or<br>                        \"SAM\" or \"BAM\" or \"BOWTIE\". The default AUTO option<br>                        will let MACS decide which format the file is. Please<br>                        check the definition in 00README file if you choose EL<br>                        AND/ELANDMULTI/ELANDMULTIPET/ELANDEXPORT/SAM/BAM/BOWTI<br>                        E. DEFAULT: \"AUTO\"<br>  --petdist=PETDIST     Best distance between Pair-End Tags. Only available<br>                        when format is 'ELANDMULTIPET'. DEFAULT: 200<br>  -g GSIZE, --gsize=GSIZE<br>                        Effective genome size. It can be 1.0e+9 or 1000000000,<br>                        or shortcuts:'hs' for human (2.7e9), 'mm' for mouse<br>                        (1.87e9), 'ce' for C. elegans (9e7) and 'dm' for<br>                        fruitfly (1.2e8), Default:hs<br>  -s TSIZE, --tsize=TSIZE<br>                        Tag size. This will overide the auto detected tag<br>                        size. DEFAULT: 25<br>  --bw=BW               Band width. This value is only used while building the<br>                        shifting model. DEFAULT: 300<br>  -p PVALUE, --pvalue=PVALUE<br>                        Pvalue cutoff for peak detection. DEFAULT: 1e-5<br>  -m MFOLD, --mfold=MFOLD<br>                        Select the regions within MFOLD range of high-<br>                        confidence enrichment ratio against background to<br>                        build model. The regions must be lower than upper<br>                        limit, and higher than the lower limit. DEFAULT:10,30<br>  --nolambda            If True, MACS will use fixed background lambda as<br>                        local lambda for every peak region. Normally, MACS<br>                        calculates a dynamic local lambda to reflect the local<br>                        bias due to potential chromatin structure.<br>  --slocal=SMALLLOCAL   The small nearby region in basepairs to calculate<br>                        dynamic lambda. This is used to capture the bias near<br>                        the peak summit region. Invalid if there is no control<br>                        data. DEFAULT: 1000<br>  --llocal=LARGELOCAL   The large nearby region in basepairs to calculate<br>                        dynamic lambda. This is used to capture the surround<br>                        bias. DEFAULT: 10000.<br>  --off-auto            Whether turn off the auto pair model process. If not<br>                        set, when MACS failed to build paired model, it will<br>                        use the nomodel settings, the '--shiftsize' parameter<br>                        to shift and extend each tags. DEFAULT: False<br>  --nomodel             Whether or not to build the shifting model. If True,<br>                        MACS will not build model. by default it means<br>                        shifting size = 100, try to set shiftsize to change<br>                        it. DEFAULT: False<br>  --shiftsize=SHIFTSIZE<br>                        The arbitrary shift size in bp. When nomodel is true,<br>                        MACS will use this value as 1/2 of fragment size.<br>                        DEFAULT: 100<br>  --keep-dup=KEEPDUPLICATES<br>                        It controls the MACS behavior towards duplicate tags<br>                        at the exact same location -- the same coordination<br>                        and the same strand. The default 'auto' option makes<br>                        MACS calculate the maximum tags at the exact same<br>                        location based on binomal distribution using 1e-5 as<br>                        pvalue cutoff; and the 'all' option keeps every tags.<br>                        If an integer is given, at most this number of tags<br>                        will be kept at the same location. Default: auto<br>  --to-small            When set, scale the larger dataset down to the smaller<br>                        dataset, by default, the smaller dataset will be<br>                        scaled towards the larger dataset. DEFAULT: False<br>  -w, --wig             Whether or not to save extended fragment pileup at<br>                        every WIGEXTEND bps into a wiggle file. When --single-<br>                        profile is on, only one file for the whole genome is<br>                        saved. WARNING: this process is time/space consuming!!<br>  -B, --bdg             Whether or not to save extended fragment pileup at<br>                        every bp into a bedGraph file. When it's on, -w,<br>                        --space and --call-subpeaks will be ignored. When<br>                        --single-profile is on, only one file for the whole<br>                        genome is saved. WARNING: this process is time/space<br>                        consuming!!<br>  -S, --single-profile  When set, a single wiggle file will be saved for<br>                        treatment and input. Default: False<br>  --space=SPACE         The resoluation for saving wiggle files, by default,<br>                        MACS will save the raw tag count every 10 bps. Usable<br>                        only with '--wig' option.<br>  --call-subpeaks       If set, MACS will invoke Mali Salmon's PeakSplitter<br>                        soft through system call. If PeakSplitter can't be<br>                        found, an instruction will be shown for downloading<br>                        and installing the PeakSplitter package. -w option<br>                        needs to be on and -B should be off to let it work.<br>                        DEFAULT: False<br>  --verbose=VERBOSE     Set verbose level. 0: only show critical message, 1:<br>                        show additional warning message, 2: show process<br>                        information, 3: show debug messages. DEFAULT:2<br>  --diag                Whether or not to produce a diagnosis report. It's up<br>                        to 9X time consuming. Please check 00README file for<br>                        detail. DEFAULT: False<br>  --fe-min=FEMIN        For diagnostics, min fold enrichment to consider.<br>                        DEFAULT: 0<br>  --fe-max=FEMAX        For diagnostics, max fold enrichment to consider.<br>                        DEFAULT: maximum fold enrichment<br>  --fe-step=FESTEP      For diagnostics, fold enrichment step.  DEFAULT: 20<br>  --no-EM               Do NOT iteratively align multi-reads by E-M. Multi-<br>                        read probabilities will be based on quality scores or<br>                        uniform (if --no-quals) DEFAULT : FALSE<br>  --EM-converge-diff=MIN_CHANGE<br>                        The minimum entropy change between iterations before<br>                        halting E-M steps. DEFAULT : 1e-05<br>  --EM-min-score=MIN_SCORE<br>                        Minimum enrichment score. Windows below this threshold<br>                        will all look the same to the aligner. DEFAULT : 1.5<br>  --EM-max-score=MAX_SCORE<br>                        Maximum enrichment score. Windows above this threshold<br>                        will all look the same to the aligner, DEFAULT : No<br>                        Maximum<br>  --EM-show-graphs      generate diagnostic graphs for E-M. (requires<br>                        MATPLOTLIB). DEFAULT : FALSE<br>  --quality-scale=QUAL_SCALE<br>                        Initial alignment probabilities are determined by read<br>                        quality and mismatches. Each possible alignment is<br>                        assigned a probability from the product over all bases<br>                        of either 1-p(ReadError_base) when there is no<br>                        mismatch, or p(ReadError_base) when the called base<br>                        disagrees with the reference.  You may also select a<br>                        uniform initialization. Read quality scale is the must<br>                        be one of ['auto', 'sanger+33', 'illumina+64'].<br>                        DEFAULT : auto<br>  --random-multi        Convert all multi reads to unique reads by selecting<br>                        one alignment at random for each read. DEFAULT : False<br>  --no-multi            Throw away all reads that have more than one alignment<br>  --no-greedy-caller    Use AREM default peak caller instead of the greedy<br>                        caller. This normally results in wider, less enriched<br>                        peaks, especially with multi-reads. DEFAULT : False<br>  --no-map-quals        Do not use mapping probabilities as priors in each<br>                        update step; just use relative enrichment. DEFAULT :<br>                        False<br>  --prior-snp=PRIOR_PROB_SNP<br>                        Prior probability that a SNP occurs at any base in the<br>                        genome. DEFAULT : 0.001<br>  --write-read-probs    Write out all final reads, including their alignment<br>                        probabilities as a BED file. DEFAULT : FALSE<br><br>** Parameters:<br><br>*** -t/--treatment FILENAME<br><br>This is the only REQUIRED parameter for MACS. If the format is<br>ELANDMULTIPET, user must provide two treatment files separated by<br>comma, e.g. s_1_1_eland_multi.txt,s_1_2_eland_multi.txt.<br><br>*** -c/--control<br><br>The control or mock data file in either BED format or any ELAND output<br>format specified by --format option. Please follow the same direction<br>as for -t/--treatment.<br><br>*** -n/--name<br><br>The name string of the experiment. MACS will use this string NAME to<br>create output files like 'NAME_peaks.xls', 'NAME_negative_peaks.xls',<br>'NAME_peaks.bed' , 'NAME_summits.bed', 'NAME_model.r' and so on. So<br>please avoid any confliction between these filenames and your existing<br>files.<br><br>*** -f/--format FORMAT<br><br>Format of tag file, can be \"ELAND\", \"BED\", \"ELANDMULTI\",<br>\"ELANDEXPORT\", \"ELANDMULTIPET\" (for pair-end tags), \"SAM\", \"BAM\" or<br>\"BOWTIE\". Default is \"AUTO\" which will allow MACS to decide the format<br>automatically. Please use \"AUTO\" only when you combine different<br>formats of files.<br><br>The BED format is defined in \"http://genome.ucsc.edu/FAQ/FAQformat#format1\".<br><br>If the format is ELAND, the file must be ELAND result output file,<br>each line MUST represents only ONE tag, with fields of:<br><br> 1. Sequence name (derived from file name and line number if format is not Fasta)<br> 2. Sequence<br> 3. Type of match: <br> NM - no match found.<br> QC - no matching done: QC failure (too many Ns basically).<br> RM - no matching done: repeat masked (may be seen if repeatFile.txt was specified).<br> U0 - Best match found was a unique exact match.<br> U1 - Best match found was a unique 1-error match. <br> U2 - Best match found was a unique 2-error match. <br> R0 - Multiple exact matches found.<br> R1 - Multiple 1-error matches found, no exact matches.<br> R2 - Multiple 2-error matches found, no exact or 1-error matches.<br> 4. Number of exact matches found.<br> 5. Number of 1-error matches found.<br> 6. Number of 2-error matches found.<br> Rest of fields are only seen if a unique best match was found (i.e. the match code in field 3 begins with \"U\").<br> 7. Genome file in which match was found.<br> 8. Position of match (bases in file are numbered starting at 1).<br> 9. Direction of match (F=forward strand, R=reverse).<br> 10. How N characters in read were interpreted: (\".\"=not applicable, \"D\"=deletion, \"I\"=insertion).<br> Rest of fields are only seen in the case of a unique inexact match (i.e. the match code was U1 or U2).<br> 11. Position and type of first substitution error (e.g. 12A: base 12 was A, not whatever is was in read).<br> 12. Position and type of first substitution error, as above. <br><br>If the format is ELANDMULTI, the file must be ELAND output file from<br>multiple-match mode, each line MUST represents only ONE tag, with<br>fields of:<br><br> 1. Sequence name <br> 2. Sequence <br> 3. Either NM, QC, RM (as described above) or the following: <br> 4. x:y:z where x, y, and z are the number of exact, single-error, and 2-error matches found<br> 5. Blank, if no matches found or if too many matches found, or the following:<br>    BAC_plus_vector.fa:163022R1,170128F2,E_coli.fa:3909847R1 This says<br>    there are two matches to BAC_plus_vector.fa: one in the reverse<br>    direction starting at position 160322 with one error, one in the<br>    forward direction starting at position 170128 with two<br>    errors. There is also a single-error match to E_coli.fa.<br><br>If the data is from Pair-End sequencing. You can sepecify the format<br>as ELANDMULTIPET ( stands for ELAND Multiple-match Pair-End Tags),<br>then the --treat (and --control if needed) parameter must be two file<br>names separated by comma. Each file must be in ELAND multiple-match<br>format described above. e.g.<br><br>macs14 --format ELANDMULTIPET -t s_1_1_eland_multi.txt,s_2_1_eland_multi.txt ...<br><br>If you use ELANDMULTIPET, you may need to modify --petdist parameter.<br><br>If the format is BAM/SAM, please check the definition in<br>(http://samtools.sourceforge.net/samtools.shtml).  Pair-end mapping<br>results can be saved in a single BAM file, if so, MACS will<br>automatically keep the left mate(5' end) tag.<br><br>If the format is BOWTIE, you need to provide the ASCII bowtie output<br>file with the suffix '.map'. Please note that, you need to make sure<br>that in the bowtie output, you only keep one location for one<br>read. Check the bowtie manual for detail if you want at<br>(http://bowtie-bio.sourceforge.net/manual.shtml)<br><br>Here is the definition for Bowtie output in ASCII characters I copied<br>from the above webpage:<br><br>   1.  Name of read that aligned<br><br>   2. Orientation of read in the alignment, - for reverse complement,<br>   + otherwise<br><br>   3. Name of reference sequence where alignment occurs, or ordinal ID<br>   if no name was provided<br><br>   4. 0-based offset into the forward reference strand where leftmost<br>   character of the alignment occurs<br><br>   5. Read sequence (reverse-complemented if orientation is -)<br><br>   6. ASCII-encoded read qualities (reversed if orientation is -). The<br>   encoded quality values are on the Phred scale and the encoding is<br>   ASCII-offset by 33 (ASCII char !).<br><br>   7. Number of other instances where the same read aligns against the<br>   same reference characters as were aligned against in this<br>   alignment. This is not the number of other places the read aligns<br>   with the same number of mismatches. The number in this column is<br>   generally not a good proxy for that number (e.g., the number in<br>   this column may be '0' while the number of other alignments with<br>   the same number of mismatches might be large). This column was<br>   previously described as \"Reserved\".<br><br>   8. Comma-separated list of mismatch descriptors. If there are no<br>   mismatches in the alignment, this field is empty. A single<br>   descriptor has the format offset:reference-base&gt;read-base. The<br>   offset is expressed as a 0-based offset from the high-quality (5')<br>   end of the read.<br><br>Notes:<br><br>1) For BED format, the 6th column of strand information is required by<br>MACS. And please pay attention that the coordinates in BED format is<br>zero-based and half-open<br>(http://genome.ucsc.edu/FAQ/FAQtracks#tracks1).<br><br>2) For plain ELAND format, only matches with match type U0, U1 or U2 is<br>accepted by MACS, i.e. only the unique match for a sequence with less<br>than 3 errors is involed in calculation. If multiple hits of a single<br>tag are included in your raw ELAND file, please remove the redundancy<br>to keep the best hit for that sequencing tag.<br><br>3) For the experiment with several replicates, it is recommended to<br>concatenate several ChIP-seq treatment files into a single file. To do<br>this, under Unix/Mac or Cygwin (for windows OS), type:<br><br>$ cat replicate1.bed replicate2.bed replicate3.bed &gt; all_replicates.bed<br><br>4) ELAND export format support sometimes may not work on your<br>datasets, because people may mislabel the 11th and 12th column. MACS<br>uses 11th column as the sequence name which should be the chromosome<br>names.<br><br>** --petdist=PETDIST     <br><br>Best distance between Pair-End Tags. Only available when format is<br>'ELANDMULTIPE'. Default is 200bps. When MACS reads mapped positions<br>for 5' tag and 3' tag, it will decide the best pairing for them using<br>this best distance parameter. A simple scoring system is used as following,<br><br>score = abs(abs(p5-p3)-200)+e5+e5<br><br>Where p5 is one of the position of 5' tag, and e5 is the<br>mismatch/error for this mapped position of 5' tag. p3 and e3 are for<br>3' tag. Then the lowest scored paring is regarded as the best<br>pairing. The 5' tag position of the pair is kept in model building and<br>peak calling.<br><br>*** -g/--gsize<br><br>PLEASE assign this parameter to fit your needs!<br><br>It's the mappable genome size or effective genome size which is<br>defined as the genome size which can be sequenced. Because of the<br>repetitive features on the chromsomes, the actual mappable genome size<br>will be smaller than the original size, about 90% or 70% of the genome<br>size. The default hs -- 2.7e9 is recommended for UCSC human hg18<br>assembly. Here are all precompiled parameters for effective genome size:<br><br>-g hs   =  -g 2.7e9<br>-g mm   =  -g 1.87e9<br>-g ce   =  -g 9e7<br>-g dm   =  -g 1.2e8<br><br>*** -s/--tsize<br><br>The size of sequencing tags. If you don't specify it, MACS will try to<br>use the first 10 sequences from your input treatment file to determine<br>the tag size. Specifying it will override the automatic determined tag<br>size.<br><br>*** --bw<br><br>The band width which is used to scan the genome for model<br>building. You can set this parameter as the sonication fragment size<br>expected from wet experiment. The previous side effect on the peak<br>detection process has been removed. So this parameter only affects the<br>model building.<br><br>*** -p/--pvalue<br><br>The pvalue cutoff. Default is 1e-5.<br><br>*** -m/--mfold<br><br>This parameter is used to select the regions within MFOLD range of<br>high-confidence enrichment ratio against background to build<br>model. The regions must be lower than upper limit, and higher than the<br>lower limit of fold enrichment. DEFAULT:10,30 means using all regions<br>not too low (&gt;10) and not too high (&lt;30) to build paired-peaks<br>model. If MACS can not find more than 100 regions to build model, it<br>will use the --shiftsize parameter to continue the peak detection.<br><br>Check related *--off-auto* and *--shiftsize* for detail.<br><br>** --nolambda<br><br>With this flag on, MACS will use the background lambda as local<br>lambda. This means MACS will not consider the local bias at peak<br>candidate regions.<br><br>** --slocal, --llocal<br><br>These two parameters control which two levels of regions will be<br>checked around the peak regions to calculate the maximum lambda as<br>local lambda. By default, MACS considers 1000bp for small local<br>region(--slocal), and 10000bps for large local region(--llocal)<br>which captures the bias from a long range effect like an open<br>chromatin domain. You can tweak these according to your<br>project. Remember that if the region is set too small, a sharp spike<br>in the input data may kill the significant peak.<br><br>** --off-auto<br><br>Whether turn off the auto paired-peak model process. If not set, when<br>MACS failed to build paired model, it will use the nomodel settings,<br>the '--shiftsize' parameter to shift and extend each tags. If set,<br>MACS will be terminated if paried-peak model is failed.<br><br>** --nomodel<br><br>While on, MACS will bypass building the shifting model.<br><br>** --shiftsize<br><br>While '--nomodel' is set, MACS uses this parameter to shift tags to<br>their midpoint. For example, if the size of binding region for your<br>transcription factor is 200 bp, and you want to bypass the model<br>building by MACS, this parameter can be set as 100. This option is<br>only valid when --nomodel is set or when MACS fails to build<br>paired-peak model.<br><br>**  --keep-dup<br><br>It controls the MACS behavior towards duplicate tags at the exact same<br>location -- the same coordination and the same strand. The default<br>'auto' option makes MACS calculate the maximum tags at the exact same<br>location based on binomal distribution using 1e-5 as pvalue cutoff;<br>and the 'all' option keeps every tags.  If an integer is given, at<br>most this number of tags will be kept at the same location. Default:<br>auto<br><br>** --to-small <br><br>When set scale the larger dataset down to the smaller dataset, by<br>default, the smaller dataset will be scaled towards the larger<br>dataset.<br><br>** -w/--wig<br><br>If this flag is on, MACS will store the fragment pileup in wiggle<br>format for every chromosome. The gzipped wiggle files will be stored<br>in subdirectories named NAME+'_MACS_wiggle/treat' for treatment data<br>and NAME+'_MACS_wiggle/control' for control data. --single-profile<br>option can be combined to generate a single wig file for the whole<br>genome.<br><br>** -B/--bdg<br><br>If this flag is on, MACS will store the fragment pileup in bedGraph<br>format for every chromosome. The bedGraph file is in general much<br>smaller than wiggle file. However, The process will take a little bit<br>longer than -w option, since theoratically 1bp resolution data will be<br>saved. The bedGraph files will be gzipped and stored in subdirectories<br>named NAME+'_MACS_bedGraph/treat' for treatment and<br>NAME+'_MACS_bedGraph/control' for control data.  --single-profile<br>option can be combined to generate a single bedGraph file for the<br>whole genome.<br><br>** -S/--single-profile (formerly --single-wig)<br><br>If this flag is on, MACS will store the fragment pileup in wiggle or<br>bedGraph format for the whole genome instead of for every<br>chromosomes. The gzipped wiggle files will be stored in subdirectories<br>named EXPERIMENT_NAME+'_MACS_wiggle'+'_MACS_wiggle/treat/'<br>+EXPERIMENT_NAME+'treat_afterfiting_all.wig.gz' or<br>'treat_afterfiting_all.bdg.gz' for treatment data, and<br>EXPERIMENT_NAME+'_MACS_wiggle'+'_MACS_wiggle/control/'<br>+EXPERIMENT_NAME+'control_afterfiting_all.wig.gz' or<br>'control_afterfiting_all.bdg.gz' for control data.<br><br>** --space=SPACE         <br><br>By default, the resoluation for saving wiggle files is 10 bps,i.e.,<br>MACS will save the raw tag count every 10 bps. You can change it along<br>with '--wig' option.<br><br>Note this option doesn't work if -B/--bdg is on.<br><br>** --call-subpeaks       <br><br>If set, MACS will invoke Mali Salmon's PeakSplitter software through<br>system call. If PeakSplitter can't be found, an instruction will be<br>shown for downloading and installing the PeakSplitter package. The<br>PeakSplitter can refine the MACS peaks and split the wide peaks into<br>smaller subpeaks. For more information, please check the following URL:<br><br>http://www.ebi.ac.uk/bertone/software/PeakSplitter_Cpp_usage.txt<br><br>Note this option doesn't work if -B/--bdg is on.<br><br>*** --verbose<br><br>If you don't want to see any message during the running of MACS, set<br>it to 0. But the CRITICAL messages will never be hidden. If you want<br>to see rich information like how many peaks are called for every<br>chromosome, you can set it to 3 or larger than 3.<br><br>** --diag<br><br>A diagnosis report can be generated through this option. This report<br>can help you get an assumption about the sequencing saturation. This<br>funtion is only in beta stage.<br><br>** --fe-min, --fe-max &amp; --fe-step<br><br>For diagnostics, FEMIN and FEMAX are the minimum and maximum fold<br>enrichment to consider, and FESTEP is the interval of fold<br>enrichment. For example, \"--fe-min 0 --fe-max 40 --fe-step 10\" will<br>let MACS choose the following fold enrichment ranges to consider:<br>[0,10), [10,20), [20,30) and [30,40).<br><br>* Output files<br><br> 1. NAME_peaks.xls is a tabular file which contains information about<br> called peaks. You can open it in excel and sort/filter using excel<br> functions. Information include: chromosome name, start position of<br> peak, end position of peak, length of peak region, peak summit<br> position related to the start position of peak region, number of tags<br> in peak region, -10*log10(pvalue) for the peak region (e.g. pvalue<br> =1e-10, then this value should be 100), fold enrichment for this<br> region against random Poisson distribution with local lambda, FDR in<br> percentage. Coordinates in XLS is 1-based which is different with BED<br> format.<br><br> 2. NAME_peaks.bed is BED format file which contains the peak<br> locations. You can load it to UCSC genome browser or Affymetrix IGB<br> software.<br><br> 3. NAME_summits.bed is in BED format, which contains the peak summits<br> locations for every peaks. The 5th column in this file is the summit<br> height of fragment pileup. If you want to find the motifs at the<br> binding sites, this file is recommended.<br><br> 4. NAME_negative_peaks.xls is a tabular file which contains<br> information about negative peaks. Negative peaks are called by<br> swapping the ChIP-seq and control channel.<br><br> 5. NAME_model.r is an R script which you can use to produce a PDF<br> image about the model based on your data. Load it to R by:<br><br>$ R --vanilla &lt; NAME_model.r<br><br>Then a pdf file NAME_model.pdf will be generated in your current<br>directory. Note, R is required to draw this figure.<br><br> 6. NAME_treat/control_afterfiting.wig.gz files in NAME_MACS_wiggle<br> directory are wiggle format files which can be imported to UCSC<br> genome browser/GMOD/Affy IGB. The .bdg.gz files are in bedGraph<br> format which can also be imported to UCSC genome browser or be<br> converted into even smaller bigWig files.<br><br> 7. NAME_diag.xls is the diagnosis report. First column is for various<br> fold_enrichment ranges; the second column is number of peaks for that fc<br> range; after 3rd columns are the percentage of peaks covered after<br> sampling 90%, 80%, 70% ... and 20% of the total tags.<br><br> 8. NAME_peaks.subpeaks.bed is a text file which IS NOT in BED<br> format. This file is generated by PeakSplitter<br> (&lt;http://www.ebi.ac.uk/bertone/software/PeakSplitter_Cpp_usage.txt&gt;)<br> when --call-subpeaks option is set.<br><br>* Other useful links<br><br>Cistrome web server for ChIP-chip/seq analysis: http://cistrome.org/ap/<br><br>bedTools -- a super useful toolkits for genome annotation files: http://code.google.com/p/bedtools/<br><br>UCSC toolkits: http://hgdownload.cse.ucsc.edu/admin/exe/\n          </div>"}, "last_serial": 783716, "releases": {"1.0.0": [{"comment_text": "built for Linux-2.6.35-25-generic-x86_64-with-glibc2.4", "digests": {"md5": "8bebe15cf646163d0fc3fb8607c6593e", "sha256": "e9e3f9c27611a16f7a3938fe9fd3be1bf42e33b32546024c65198057133c550a"}, "downloads": -1, "filename": "AREM-1.0.0.linux-x86_64.tar.gz", "has_sig": false, "md5_digest": "8bebe15cf646163d0fc3fb8607c6593e", "packagetype": "bdist_dumb", "python_version": "any", "requires_python": null, "size": 128987, "upload_time": "2011-02-16T06:37:12", "upload_time_iso_8601": "2011-02-16T06:37:12.965640Z", "url": "https://files.pythonhosted.org/packages/3a/0c/8333ddea86565ad0213323798fa06b3c7c382ae0f84feab76716c99dfb19/AREM-1.0.0.linux-x86_64.tar.gz", "yanked": false}, {"comment_text": "", "digests": {"md5": "34634930e8f9436c71db40e0496b5ed8", "sha256": "cf4273c993174140bd4cbbb6cf4f2318d252a796d8316e792194b6679abb7e1d"}, "downloads": -1, "filename": "AREM-1.0.0.tar.gz", "has_sig": false, "md5_digest": "34634930e8f9436c71db40e0496b5ed8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 85758, "upload_time": "2011-02-03T01:08:14", "upload_time_iso_8601": "2011-02-03T01:08:14.304123Z", "url": "https://files.pythonhosted.org/packages/d8/1a/67b581091dac6f0cb03d1f35b0b7c0b77a8c9a72acde671d52a3a4b134dc/AREM-1.0.0.tar.gz", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "fab4d78f1fd12c691d4bd62140b927ea", "sha256": "b1d5275d4345d99e1c334bdd389f0541dfe78a1e15fd1b6397f421fbef1fe839"}, "downloads": -1, "filename": "AREM-1.0.1.tar.gz", "has_sig": false, "md5_digest": "fab4d78f1fd12c691d4bd62140b927ea", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 94889, "upload_time": "2011-05-18T06:55:12", "upload_time_iso_8601": "2011-05-18T06:55:12.563057Z", "url": "https://files.pythonhosted.org/packages/bc/0d/6db36d917d821d150f37c68839d8911e52b78c867b27372da5be41d4cc4f/AREM-1.0.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "fab4d78f1fd12c691d4bd62140b927ea", "sha256": "b1d5275d4345d99e1c334bdd389f0541dfe78a1e15fd1b6397f421fbef1fe839"}, "downloads": -1, "filename": "AREM-1.0.1.tar.gz", "has_sig": false, "md5_digest": "fab4d78f1fd12c691d4bd62140b927ea", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 94889, "upload_time": "2011-05-18T06:55:12", "upload_time_iso_8601": "2011-05-18T06:55:12.563057Z", "url": "https://files.pythonhosted.org/packages/bc/0d/6db36d917d821d150f37c68839d8911e52b78c867b27372da5be41d4cc4f/AREM-1.0.1.tar.gz", "yanked": false}], "timestamp": "Thu May  7 18:17:20 2020"}