{"info": {"author": "Raphaël Duque", "author_email": "duque@iap.fr", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Operating System :: Unix", "Programming Language :: Python :: 3"], "description": "# astro_reduce -- A Simple CCD Images Reducer for the Paris Observatory.\n\n## What does astro_reduce do?\n\n`astro_reduce` reduces raw astronomical CCD images read in FITS format with dark and flat field images. Optionally, it can interpolate missing dark fields from the ones available, and can also convert the intermediate and reduced images to PNG format for easy inspection.\n\nTo operate, `astro_reduce` is to be launched from a directory containing three folders:\n- A `DARK` folder, containing all the dark field images,\n- A `FLAT` folder, containing all flat field images,\n- A `ORIGINAL` folder, containing all the images of objects.\n\nAll files must be in FITS format, with correct filter, exposure time and object header keywords wherever relevant.\n\nWhen launched, `astro_reduce` will copy all data files to working folders (thereby backing up the original data), and apply the standard astronomical CCD image reduction process. On the way, intermediate images such as master dark fields or non-realigned object fields are safe-kept in the `tmp/` folder.\n\nAfter running, the final reduced images can be found in the `reduced/` folder. The reduction process and the nomenclature for the naming of the files in the `tmp/` and `reduced/` folders are given in the _Reduction method_ paragraph below.\n\n__Note:__ It is highly recommended to inspect the intermediate images produced by `astro_reduce` before considering the final reduced images. Also, we highly recommend you inspect your raw images and eliminate any bad ones before launching the reduction.\n\n## Installing\nThe `astro_reduce` program can be installed from the PyPI under the name `astro-reduce`. This package provides the command with all options.\n\nAlternatively, use the `setup.py` file in the project directory with `python3 setup.py install --user` to install the program locally. You should then include `~/.local/bin` (or `~/Library/Python/3.7/bin` for Mac users) to your path in order to invoke `astro_reduce` from the console.\n\n### Dependencies\n`astro_reduce` is written in Python 3.5.\n\n`astro_reduce` depends on the `click`, `astropy`, `numpy`, `scipy` and `matplotlib` Python packages, which are all available through the PyPI.\n\n## Usage\nWhen used for the first time in a directory, or when the data has been modified since the last use of `astro_reduce`, the program should be invoked with the `--setup` option:\n\n`astro_reduce --setup [OPTIONS]`\n\nThis will setup the reduction by copying all the raw data to `astro_reduce`'s working folders whilst changing the file names to standardized formats. Also, during this phase, a configuration file in the JSON format will be written. It summarizes the objects, filters and exposures times present in the original data and is used by `astro_reduce` in the reduction process. This file should be left in the directory for further reference or for later rerunning of the program.\n\n__Note:__ This first setup step is effectively a back-up of your data, as the data left in the `DARK`, `FLAT` and `ORIGINAL` folders are no longer touched during the subsequent reduction process.\n\nIf the setup has already been done in the directory by prior use of the `--setup` option, `astro_reduce` should be used without this option:\n\n`astro_reduce [OPTIONS]`\n\n`astro_reduce` has been tested on Linux and Mac platforms, and has yet to be tested on Windows.\n\n### Options\n- `-s, --setup        Sets up the directory for reduction. Use this option only the first time astro_reduce is run in the directory.`\n- `-i, --interpolate  Interpolate existing dark fields if some are missing.`\n- `-v, --verbose      Enables verbose mode (recommended).`\n- `-t, --tmppng       Write PNG format of intermediary images after reduction.`\n- `-r, --redpng       Write PNG format of reduced images after reduction.`\n- `--help             Show this message and exit.`\n\n\n## Reduction method\n### Master dark images\nFor a given exposure time, the _master dark_ is calculated as the pixel-wise __median__ of all the dark fields of that exposure. This allows to eliminate cosmic ray traces.\n\n#### Dark field interpolation\nIn the case where some dark fields are missing, `astro_reduce` can interpolate from the available master darks to obtain master darks for all the exposures necessary to reduce the object or flat images. This is done by specifying the `--interpolate` option.\n\nThe interpolation is _least-square linear_, i.e., two images A and B are determined from the available master dark images such as to __minimize the square error__ on the linear interpolation (master dark) = (exposure time) x A + B.\n\nUsing these A and B, the missing master darks are calculated according to this equation.\n\n>The FITS files for all the master dark images (deduced from dark fields or interpolated) can be found after reduction in the `tmp` directory under the names `mdark_[exposure].fits`.\n\n### Master transmission images\nThe _master transmission_ image for a given filter is an image which encompasses the relative transmission of each pixel in the optical setup (telescope optics through filter to CCD matrix). It is calculated for every filter as the __median__ over all flat field images, after __subtraction of corresponding master dark images__ and __normalization__.\n\n>The FITS files for all the master transmission images can be found after reduction in the `tmp/` directory under the names `mtrans_[filter].fits`.\n\n### Individual image reduction\nAn object image of given exposure and filter is reduced by __subtracting__ the corresponding exposure master dark image, and __dividing__ by the corresponding filter master transmission image.\n\n>The FITS files for object _obj_, with filter _filt_ and exposure time _exp_ are found in the `tmp/` folder after reduction, under the name `[obj]_[filt]_[exp]_*_aux.fits` (for _auxiliary_).\n\n### Realignment and reduction\nFinally, for each series of same exposure and filter for each object, the auxiliary files are realigned through optimization of their __mutual cross-correlations__, and then their pixel-wise __median__ image is calculated. Using the median rather than the mean allows to efficiently remove hot pixels. This will be all the more effective as dithering has been used in acquiring the images of a series.\n\nDuring the realignment, images are rolled to superpose themselves. Therefore, if the images were too misaligned to begin with, objects that roll beyond the edge can end up in odd places, potentially producing ghost images of objects. During `astro_reduce`'s run, a warning is issued to the user if any image is rolled by more than a quarter-field during the realignment.\n\n>These realigned images are the final reduced images and can be found in the `reduced/` folder after reduction, with the same names as in the preceding step.\n\n## Some things to know\n- As mentioned earlier, the original files in the `DARK`, `FLAT` and `ORIGINAL` folders are not used during the reduction process. Only their copies in the `ar_*` working folders are used.\n- In copying the original files during the setup process, `astro_reduce` in effect backs up your data.\n- `astro_reduce` will deduce the object captured in a given field from the `OBJECT` keyword entry in the file's header. In the reduction, all files of a same object, filter and exposure time are reduced and realigned together. Therefore, in order to keep different series of images of a same object separate, it is recommended to append a tag to the object name in acquiring the images of the series. For example NGC4993-1, NGC4993-2, etc.\n- During the reduction, the headers of synthetic images are filled in with the correct `OBJECT`, `FILTER`, `EXPOSURE`, `EXPTIME` and `IMAGETYP` keyword values. The other keyword values (such as the time of acquisition) are inherited from the parent images (raw darks and flats for master dark and master transmission images; raw object images for final reduced object fields).\n- `fit` and other derivatives can be used as extensions for the FITS files.\n- Remaining hot pixels in the reduced images can be the result of insufficient dithering.\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/bandang0/astro_reduce", "keywords": "astronomy reduction images automatic", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "astro-reduce", "package_url": "https://pypi.org/project/astro-reduce/", "platform": "", "project_url": "https://pypi.org/project/astro-reduce/", "project_urls": {"Homepage": "https://github.com/bandang0/astro_reduce"}, "release_url": "https://pypi.org/project/astro-reduce/2.2.0/", "requires_dist": ["click", "astropy", "scipy", "numpy", "matplotlib"], "requires_python": ">=3.5", "summary": "A Simple CCD Images Reducer for the Paris Observatory.", "version": "2.2.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>astro_reduce -- A Simple CCD Images Reducer for the Paris Observatory.</h1>\n<h2>What does astro_reduce do?</h2>\n<p><code>astro_reduce</code> reduces raw astronomical CCD images read in FITS format with dark and flat field images. Optionally, it can interpolate missing dark fields from the ones available, and can also convert the intermediate and reduced images to PNG format for easy inspection.</p>\n<p>To operate, <code>astro_reduce</code> is to be launched from a directory containing three folders:</p>\n<ul>\n<li>A <code>DARK</code> folder, containing all the dark field images,</li>\n<li>A <code>FLAT</code> folder, containing all flat field images,</li>\n<li>A <code>ORIGINAL</code> folder, containing all the images of objects.</li>\n</ul>\n<p>All files must be in FITS format, with correct filter, exposure time and object header keywords wherever relevant.</p>\n<p>When launched, <code>astro_reduce</code> will copy all data files to working folders (thereby backing up the original data), and apply the standard astronomical CCD image reduction process. On the way, intermediate images such as master dark fields or non-realigned object fields are safe-kept in the <code>tmp/</code> folder.</p>\n<p>After running, the final reduced images can be found in the <code>reduced/</code> folder. The reduction process and the nomenclature for the naming of the files in the <code>tmp/</code> and <code>reduced/</code> folders are given in the <em>Reduction method</em> paragraph below.</p>\n<p><strong>Note:</strong> It is highly recommended to inspect the intermediate images produced by <code>astro_reduce</code> before considering the final reduced images. Also, we highly recommend you inspect your raw images and eliminate any bad ones before launching the reduction.</p>\n<h2>Installing</h2>\n<p>The <code>astro_reduce</code> program can be installed from the PyPI under the name <code>astro-reduce</code>. This package provides the command with all options.</p>\n<p>Alternatively, use the <code>setup.py</code> file in the project directory with <code>python3 setup.py install --user</code> to install the program locally. You should then include <code>~/.local/bin</code> (or <code>~/Library/Python/3.7/bin</code> for Mac users) to your path in order to invoke <code>astro_reduce</code> from the console.</p>\n<h3>Dependencies</h3>\n<p><code>astro_reduce</code> is written in Python 3.5.</p>\n<p><code>astro_reduce</code> depends on the <code>click</code>, <code>astropy</code>, <code>numpy</code>, <code>scipy</code> and <code>matplotlib</code> Python packages, which are all available through the PyPI.</p>\n<h2>Usage</h2>\n<p>When used for the first time in a directory, or when the data has been modified since the last use of <code>astro_reduce</code>, the program should be invoked with the <code>--setup</code> option:</p>\n<p><code>astro_reduce --setup [OPTIONS]</code></p>\n<p>This will setup the reduction by copying all the raw data to <code>astro_reduce</code>'s working folders whilst changing the file names to standardized formats. Also, during this phase, a configuration file in the JSON format will be written. It summarizes the objects, filters and exposures times present in the original data and is used by <code>astro_reduce</code> in the reduction process. This file should be left in the directory for further reference or for later rerunning of the program.</p>\n<p><strong>Note:</strong> This first setup step is effectively a back-up of your data, as the data left in the <code>DARK</code>, <code>FLAT</code> and <code>ORIGINAL</code> folders are no longer touched during the subsequent reduction process.</p>\n<p>If the setup has already been done in the directory by prior use of the <code>--setup</code> option, <code>astro_reduce</code> should be used without this option:</p>\n<p><code>astro_reduce [OPTIONS]</code></p>\n<p><code>astro_reduce</code> has been tested on Linux and Mac platforms, and has yet to be tested on Windows.</p>\n<h3>Options</h3>\n<ul>\n<li><code>-s, --setup Sets up the directory for reduction. Use this option only the first time astro_reduce is run in the directory.</code></li>\n<li><code>-i, --interpolate Interpolate existing dark fields if some are missing.</code></li>\n<li><code>-v, --verbose Enables verbose mode (recommended).</code></li>\n<li><code>-t, --tmppng Write PNG format of intermediary images after reduction.</code></li>\n<li><code>-r, --redpng Write PNG format of reduced images after reduction.</code></li>\n<li><code>--help Show this message and exit.</code></li>\n</ul>\n<h2>Reduction method</h2>\n<h3>Master dark images</h3>\n<p>For a given exposure time, the <em>master dark</em> is calculated as the pixel-wise <strong>median</strong> of all the dark fields of that exposure. This allows to eliminate cosmic ray traces.</p>\n<h4>Dark field interpolation</h4>\n<p>In the case where some dark fields are missing, <code>astro_reduce</code> can interpolate from the available master darks to obtain master darks for all the exposures necessary to reduce the object or flat images. This is done by specifying the <code>--interpolate</code> option.</p>\n<p>The interpolation is <em>least-square linear</em>, i.e., two images A and B are determined from the available master dark images such as to <strong>minimize the square error</strong> on the linear interpolation (master dark) = (exposure time) x A + B.</p>\n<p>Using these A and B, the missing master darks are calculated according to this equation.</p>\n<blockquote>\n<p>The FITS files for all the master dark images (deduced from dark fields or interpolated) can be found after reduction in the <code>tmp</code> directory under the names <code>mdark_[exposure].fits</code>.</p>\n</blockquote>\n<h3>Master transmission images</h3>\n<p>The <em>master transmission</em> image for a given filter is an image which encompasses the relative transmission of each pixel in the optical setup (telescope optics through filter to CCD matrix). It is calculated for every filter as the <strong>median</strong> over all flat field images, after <strong>subtraction of corresponding master dark images</strong> and <strong>normalization</strong>.</p>\n<blockquote>\n<p>The FITS files for all the master transmission images can be found after reduction in the <code>tmp/</code> directory under the names <code>mtrans_[filter].fits</code>.</p>\n</blockquote>\n<h3>Individual image reduction</h3>\n<p>An object image of given exposure and filter is reduced by <strong>subtracting</strong> the corresponding exposure master dark image, and <strong>dividing</strong> by the corresponding filter master transmission image.</p>\n<blockquote>\n<p>The FITS files for object <em>obj</em>, with filter <em>filt</em> and exposure time <em>exp</em> are found in the <code>tmp/</code> folder after reduction, under the name <code>[obj]_[filt]_[exp]_*_aux.fits</code> (for <em>auxiliary</em>).</p>\n</blockquote>\n<h3>Realignment and reduction</h3>\n<p>Finally, for each series of same exposure and filter for each object, the auxiliary files are realigned through optimization of their <strong>mutual cross-correlations</strong>, and then their pixel-wise <strong>median</strong> image is calculated. Using the median rather than the mean allows to efficiently remove hot pixels. This will be all the more effective as dithering has been used in acquiring the images of a series.</p>\n<p>During the realignment, images are rolled to superpose themselves. Therefore, if the images were too misaligned to begin with, objects that roll beyond the edge can end up in odd places, potentially producing ghost images of objects. During <code>astro_reduce</code>'s run, a warning is issued to the user if any image is rolled by more than a quarter-field during the realignment.</p>\n<blockquote>\n<p>These realigned images are the final reduced images and can be found in the <code>reduced/</code> folder after reduction, with the same names as in the preceding step.</p>\n</blockquote>\n<h2>Some things to know</h2>\n<ul>\n<li>As mentioned earlier, the original files in the <code>DARK</code>, <code>FLAT</code> and <code>ORIGINAL</code> folders are not used during the reduction process. Only their copies in the <code>ar_*</code> working folders are used.</li>\n<li>In copying the original files during the setup process, <code>astro_reduce</code> in effect backs up your data.</li>\n<li><code>astro_reduce</code> will deduce the object captured in a given field from the <code>OBJECT</code> keyword entry in the file's header. In the reduction, all files of a same object, filter and exposure time are reduced and realigned together. Therefore, in order to keep different series of images of a same object separate, it is recommended to append a tag to the object name in acquiring the images of the series. For example NGC4993-1, NGC4993-2, etc.</li>\n<li>During the reduction, the headers of synthetic images are filled in with the correct <code>OBJECT</code>, <code>FILTER</code>, <code>EXPOSURE</code>, <code>EXPTIME</code> and <code>IMAGETYP</code> keyword values. The other keyword values (such as the time of acquisition) are inherited from the parent images (raw darks and flats for master dark and master transmission images; raw object images for final reduced object fields).</li>\n<li><code>fit</code> and other derivatives can be used as extensions for the FITS files.</li>\n<li>Remaining hot pixels in the reduced images can be the result of insufficient dithering.</li>\n</ul>\n\n          </div>"}, "last_serial": 6897731, "releases": {"1.0": [{"comment_text": "", "digests": {"md5": "8f3017dde3b30ff0c9f0f0ece9e4421a", "sha256": "696dfaf53055156f691f21fdc03df92e11c5d85bb8a37358ad2533780aa9b50f"}, "downloads": -1, "filename": "astro_reduce-1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "8f3017dde3b30ff0c9f0f0ece9e4421a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 10138, "upload_time": "2020-02-05T16:41:23", "upload_time_iso_8601": "2020-02-05T16:41:23.653329Z", "url": "https://files.pythonhosted.org/packages/88/66/d582f11f4efb1481fc8ecbcb3449aa5acff0042e216ef2d560327b4cbfae/astro_reduce-1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "97e825f633fefceac021d3bc78fbd3c9", "sha256": "113ccb27b9afd520e034941ac64333d59c28ab846a79fc05deee085f1e99f901"}, "downloads": -1, "filename": "astro_reduce-1.0.tar.gz", "has_sig": false, "md5_digest": "97e825f633fefceac021d3bc78fbd3c9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9373, "upload_time": "2020-02-05T16:41:26", "upload_time_iso_8601": "2020-02-05T16:41:26.006203Z", "url": "https://files.pythonhosted.org/packages/98/42/7e87f5cf8ab4e67cb78a52ac0adbec0069c0bc7c097deb5260ca56c620d6/astro_reduce-1.0.tar.gz", "yanked": false}], "1.1": [{"comment_text": "", "digests": {"md5": "145e97f6d2a4d2eb5324e3ec1725c961", "sha256": "c054e906d4bc88112860a58ed3602f8d5459228404f1118eea29ffb5808ff9e6"}, "downloads": -1, "filename": "astro_reduce-1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "145e97f6d2a4d2eb5324e3ec1725c961", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 10149, "upload_time": "2020-02-05T17:00:21", "upload_time_iso_8601": "2020-02-05T17:00:21.550790Z", "url": "https://files.pythonhosted.org/packages/cd/63/39dc2ec1d1a99ca2716243d673e2a474bb1341b8c7e1f8d85c0366465e74/astro_reduce-1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4741c034ab09e7d8a05e033473787933", "sha256": "0c0030773a8f23acff7637cc05c03a7c2ee024b265df3ed47e6fc4ad3019fde0"}, "downloads": -1, "filename": "astro_reduce-1.1.tar.gz", "has_sig": false, "md5_digest": "4741c034ab09e7d8a05e033473787933", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9380, "upload_time": "2020-02-05T17:00:24", "upload_time_iso_8601": "2020-02-05T17:00:24.010073Z", "url": "https://files.pythonhosted.org/packages/29/ef/6c17de993aa86b16a6491e2580f82a71cd7526c05d8db2723c6ee38328b2/astro_reduce-1.1.tar.gz", "yanked": false}], "2.0": [{"comment_text": "", "digests": {"md5": "f3b9f5026c20801d0b79c01c34849810", "sha256": "e2e2b22ced2f478c06eb9400554fb5aa9b550de199b6dcf7c7c9d43bc76bb21b"}, "downloads": -1, "filename": "astro_reduce-2.0-py3-none-any.whl", "has_sig": false, "md5_digest": "f3b9f5026c20801d0b79c01c34849810", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 11100, "upload_time": "2020-02-17T21:54:47", "upload_time_iso_8601": "2020-02-17T21:54:47.192221Z", "url": "https://files.pythonhosted.org/packages/40/ac/d4dfd58a3422d243156c58efddbc7cde7b0e23d54a89fe7d8b8e3b429829/astro_reduce-2.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1b0a1017f1cc9aa58ae66ae04a05569b", "sha256": "6b319cff1a9dfb06048ebcbcb20814e2fce6a01c3dee4a51a75c39b6bcc653bb"}, "downloads": -1, "filename": "astro_reduce-2.0.tar.gz", "has_sig": false, "md5_digest": "1b0a1017f1cc9aa58ae66ae04a05569b", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 10329, "upload_time": "2020-02-17T21:54:48", "upload_time_iso_8601": "2020-02-17T21:54:48.679653Z", "url": "https://files.pythonhosted.org/packages/35/c9/816093ecc949b9d2aaec77ef2c2f03330c1c850f469d482a7acc1265b29e/astro_reduce-2.0.tar.gz", "yanked": false}], "2.0a0": [{"comment_text": "", "digests": {"md5": "3267326922ed300e4ce1e7666f9dfc7a", "sha256": "e92786efa82b39aa86eb0cc5d836c8a5ed38579eb293f45028bdf9b221e67d04"}, "downloads": -1, "filename": "astro_reduce-2.0a0-py3.8.egg", "has_sig": false, "md5_digest": "3267326922ed300e4ce1e7666f9dfc7a", "packagetype": "bdist_egg", "python_version": "3.8", "requires_python": ">=3.6", "size": 17056, "upload_time": "2020-02-12T08:22:36", "upload_time_iso_8601": "2020-02-12T08:22:36.806778Z", "url": "https://files.pythonhosted.org/packages/86/c5/d0004ea9b70082d2210ac1e0b705238d7035ea2b624f155a3f575f6ea6e4/astro_reduce-2.0a0-py3.8.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "aac9794c45d3a6a3f4f41d8c76633301", "sha256": "3e3b7d53c47f8b41681bb143fc7ac07be40cb125b34a0ccd936c8183aecc2d08"}, "downloads": -1, "filename": "astro_reduce-2.0a0-py3-none-any.whl", "has_sig": false, "md5_digest": "aac9794c45d3a6a3f4f41d8c76633301", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 11019, "upload_time": "2020-02-12T08:22:35", "upload_time_iso_8601": "2020-02-12T08:22:35.030604Z", "url": "https://files.pythonhosted.org/packages/4a/57/a712d8a9ceb9dd59928c933801aba8885b99db5af98b648072c13b68f710/astro_reduce-2.0a0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "2cca6d0e43e8f648f02859ac949c9e90", "sha256": "e428aa945dd84370892543a8c460bd96531be938463fbc56698fd10cb228c71a"}, "downloads": -1, "filename": "astro_reduce-2.0a0.tar.gz", "has_sig": false, "md5_digest": "2cca6d0e43e8f648f02859ac949c9e90", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 9854, "upload_time": "2020-02-12T08:22:38", "upload_time_iso_8601": "2020-02-12T08:22:38.704736Z", "url": "https://files.pythonhosted.org/packages/01/82/bf7b0e9aa88e8c991714b9fd28b4c01eccece03aedeb6fb737fa97f5843c/astro_reduce-2.0a0.tar.gz", "yanked": false}], "2.0a1": [{"comment_text": "", "digests": {"md5": "f828ae2ecb5b016c040a433afb576d67", "sha256": "900b832ef2331fde250592253ad340b7c3690ae9c645a1345953a895d9aeff5a"}, "downloads": -1, "filename": "astro_reduce-2.0a1-py3-none-any.whl", "has_sig": false, "md5_digest": "f828ae2ecb5b016c040a433afb576d67", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 10999, "upload_time": "2020-02-12T08:30:32", "upload_time_iso_8601": "2020-02-12T08:30:32.771574Z", "url": "https://files.pythonhosted.org/packages/7e/db/c51bd0aae6cf7a4cb87bf80bac2e06c1c699d8f8f759e8d58cf87d5af834/astro_reduce-2.0a1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7110b1af270585634d09c521f71ce5b4", "sha256": "c47dbb98f565d06062b27b6ebd9e82dcf81a14c27693a0e45fefec97b787c10a"}, "downloads": -1, "filename": "astro_reduce-2.0a1.tar.gz", "has_sig": false, "md5_digest": "7110b1af270585634d09c521f71ce5b4", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 9828, "upload_time": "2020-02-12T08:30:42", "upload_time_iso_8601": "2020-02-12T08:30:42.777742Z", "url": "https://files.pythonhosted.org/packages/c6/b2/a156a7723b0eb164169b98fc0c37ca8866cde0cd72858227c63f21b14eab/astro_reduce-2.0a1.tar.gz", "yanked": false}], "2.0a2": [{"comment_text": "", "digests": {"md5": "12d7554c7d333a3580c4cb27c3583547", "sha256": "f9ae3a2ab810d9d885460bc829febad94b51dd87c13f44f84f071253a4102e59"}, "downloads": -1, "filename": "astro_reduce-2.0a2-py3-none-any.whl", "has_sig": false, "md5_digest": "12d7554c7d333a3580c4cb27c3583547", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 11013, "upload_time": "2020-02-12T08:44:00", "upload_time_iso_8601": "2020-02-12T08:44:00.329766Z", "url": "https://files.pythonhosted.org/packages/44/92/718a0a75e99195a4d6d601175f3b5ac4683fdbb913c8b66a7068afc7b29d/astro_reduce-2.0a2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b6d664e094bf34af5b0feb190036e943", "sha256": "dc14cd2862cbe6c33c105d044bfa5d8fa70d503b3420d743e68d24afb1bf77b2"}, "downloads": -1, "filename": "astro_reduce-2.0a2.tar.gz", "has_sig": false, "md5_digest": "b6d664e094bf34af5b0feb190036e943", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 9834, "upload_time": "2020-02-12T08:44:04", "upload_time_iso_8601": "2020-02-12T08:44:04.136604Z", "url": "https://files.pythonhosted.org/packages/c4/ce/aa64bd9c71c12e7852e91d5781ef736aca9771f0ca54b6b200d8e531beed/astro_reduce-2.0a2.tar.gz", "yanked": false}], "2.1": [{"comment_text": "", "digests": {"md5": "65b1d632b3bdef3936396de559922b1a", "sha256": "2ccbb95056b3d74bcf58071c9fbd9570545aefe1e57bc080bc7483268333caf2"}, "downloads": -1, "filename": "astro_reduce-2.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "65b1d632b3bdef3936396de559922b1a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 11127, "upload_time": "2020-03-26T16:06:53", "upload_time_iso_8601": "2020-03-26T16:06:53.530783Z", "url": "https://files.pythonhosted.org/packages/53/23/533d3262bce11a8cb7fa499bef2c17d3ddfa64064ba69b8f4da923955ed7/astro_reduce-2.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "41d6a4424d515eaa94950b73294c5760", "sha256": "8fb45b14db11f721b522ed71fa68873fdd0cef8ce73c4f0518311c555ec7983c"}, "downloads": -1, "filename": "astro_reduce-2.1-py3-none-any.whl", "has_sig": false, "md5_digest": "41d6a4424d515eaa94950b73294c5760", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 11096, "upload_time": "2020-02-28T10:30:41", "upload_time_iso_8601": "2020-02-28T10:30:41.243731Z", "url": "https://files.pythonhosted.org/packages/79/62/e5fdf52105889c238e9e571ddac1e86c273dcd3a7096076dde03bac2c2cd/astro_reduce-2.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "23246f36b2096cc86191ec640e85c5ff", "sha256": "a64960f9083ee66c8fb01c0e45e78dbe928e18bc3ed16fec515d29ab1ecbf10a"}, "downloads": -1, "filename": "astro_reduce-2.1.tar.gz", "has_sig": false, "md5_digest": "23246f36b2096cc86191ec640e85c5ff", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 10327, "upload_time": "2020-02-28T10:30:44", "upload_time_iso_8601": "2020-02-28T10:30:44.222780Z", "url": "https://files.pythonhosted.org/packages/6f/e3/2a2b8dda40ab88abd46f72e03422baac74e0b07a463b97cb715d2c0e450d/astro_reduce-2.1.tar.gz", "yanked": false}], "2.1.1": [{"comment_text": "", "digests": {"md5": "84b667f44c480a160c6e4a5cdedc177b", "sha256": "a96fb1d7b004b94c10d6304cbedf4530198d42239c0a7e20605f098b6c6b2d53"}, "downloads": -1, "filename": "astro_reduce-2.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "84b667f44c480a160c6e4a5cdedc177b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 10994, "upload_time": "2020-03-26T17:14:05", "upload_time_iso_8601": "2020-03-26T17:14:05.564261Z", "url": "https://files.pythonhosted.org/packages/5b/79/84796cb12a0049f143308f900732428be76ef29ce75cbd62ade917600fe4/astro_reduce-2.1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "41e91923220e9b61356072f892464331", "sha256": "6b0e870e566b98c1d021ae56e4fd20438d28703c318e0d380220ef9346d6b2f2"}, "downloads": -1, "filename": "astro_reduce-2.1.1.tar.gz", "has_sig": false, "md5_digest": "41e91923220e9b61356072f892464331", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 10207, "upload_time": "2020-03-26T17:14:06", "upload_time_iso_8601": "2020-03-26T17:14:06.837039Z", "url": "https://files.pythonhosted.org/packages/89/34/8bc3b91993cb67bb842bcabd65930a09daf3f21d9a72616b8a8941c87026/astro_reduce-2.1.1.tar.gz", "yanked": false}], "2.2.0": [{"comment_text": "", "digests": {"md5": "6f484dbfa9f5650c6e1c0e293a08091a", "sha256": "c7e4cddba88005a701df70b76b371d008b7b0198a56db000760b064d93502bb4"}, "downloads": -1, "filename": "astro_reduce-2.2.0-py3-none-any.whl", "has_sig": false, "md5_digest": "6f484dbfa9f5650c6e1c0e293a08091a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 11608, "upload_time": "2020-03-27T18:09:14", "upload_time_iso_8601": "2020-03-27T18:09:14.867442Z", "url": "https://files.pythonhosted.org/packages/fe/29/c43b89ded0e2531812a06f11e776ac4232ebbb2099e8cb94f71ee26a0092/astro_reduce-2.2.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "877a04f59e254b3c135ca2ea3793f669", "sha256": "864f1cc290b8332c355fdf474007138b256ee6b05e102812b38fc222c349ff7d"}, "downloads": -1, "filename": "astro_reduce-2.2.0.tar.gz", "has_sig": false, "md5_digest": "877a04f59e254b3c135ca2ea3793f669", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 10813, "upload_time": "2020-03-27T18:09:17", "upload_time_iso_8601": "2020-03-27T18:09:17.091670Z", "url": "https://files.pythonhosted.org/packages/5c/14/2ff1a8558184b3645707e9dbd435f260c066c3c214eeeeab74598426de12/astro_reduce-2.2.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "6f484dbfa9f5650c6e1c0e293a08091a", "sha256": "c7e4cddba88005a701df70b76b371d008b7b0198a56db000760b064d93502bb4"}, "downloads": -1, "filename": "astro_reduce-2.2.0-py3-none-any.whl", "has_sig": false, "md5_digest": "6f484dbfa9f5650c6e1c0e293a08091a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 11608, "upload_time": "2020-03-27T18:09:14", "upload_time_iso_8601": "2020-03-27T18:09:14.867442Z", "url": "https://files.pythonhosted.org/packages/fe/29/c43b89ded0e2531812a06f11e776ac4232ebbb2099e8cb94f71ee26a0092/astro_reduce-2.2.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "877a04f59e254b3c135ca2ea3793f669", "sha256": "864f1cc290b8332c355fdf474007138b256ee6b05e102812b38fc222c349ff7d"}, "downloads": -1, "filename": "astro_reduce-2.2.0.tar.gz", "has_sig": false, "md5_digest": "877a04f59e254b3c135ca2ea3793f669", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 10813, "upload_time": "2020-03-27T18:09:17", "upload_time_iso_8601": "2020-03-27T18:09:17.091670Z", "url": "https://files.pythonhosted.org/packages/5c/14/2ff1a8558184b3645707e9dbd435f260c066c3c214eeeeab74598426de12/astro_reduce-2.2.0.tar.gz", "yanked": false}], "timestamp": "Thu May  7 18:16:48 2020"}