{"info": {"author": "Brent Nash", "author_email": "brenash@amazon.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Intended Audience :: Developers", "License :: Other/Proprietary License", "Natural Language :: English", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3.6", "Topic :: Software Development :: Libraries :: Python Modules", "Topic :: Utilities"], "description": "# Python Kinesis Aggregation & Deaggregation Modules\n\nThe Kinesis Aggregation/Deaggregation Modules for Python provide the ability to do in-memory aggregation and deaggregation of standard Kinesis user records using the [Kinesis Aggregated Record Format](https://github.com/awslabs/amazon-kinesis-producer/blob/master/aggregation-format.md) to allow for more efficient transmission of records.\n\n## Installation\n\nThe Python record aggregation/deaggregation modules are available on the Python Package Index (PyPI) as [aws_kinesis_agg](https://pypi.python.org/pypi/aws_kinesis_agg).  You can install it via the `pip` command line tool:\n\n```\npip install aws_kinesis_agg\n```\n\nAlternately, you can simply copy the aws_kinesis_agg module from this repository and use it directly with the caveat that the [Google protobuf module](https://pypi.python.org/pypi/protobuf) must also be available (if you install via `pip`, this dependency will be handled for you).\n\n## Record Aggregation Module (aggregator.py)\n\nThe [aggregator.py](aggregator.py) module contains Python classes that allow you to aggregate records using the [Kinesis Aggregated Record Format](https://github.com/awslabs/amazon-kinesis-producer/blob/master/aggregation-format.md).  Using record aggregation improves throughput and reduces costs when writing producer applications that publish data to Amazon Kinesis.\n\n### Usage\n\nThe record aggregation module provides a simple interface for creating protocol buffers encoded data in a producer application. The `aws_kinesis_agg` module provides methods for efficiently packing individual records into larger aggregated records.\n\nWhen using aggregation, you create a RecordAggregator object and then provide a partition key, raw data and (optionally) an explicit hash key for each record.  You can choose to either provide a callback function that will be invoked when a fully-packed aggregated record is available or you can add records and check byte sizes or number of records until the aggregated record is suitably full.  You're guaranteed that any aggregated record returned from the RecordAggregator object will fit within a single PutRecord request to Kinesis.\n\nTo get started, import the `aws_kinesis_agg` module:\n\n```\nimport aws_kinesis_agg\n```\n\nAs you produce records in your producer application, you will aggregate them using the aggregation methods available in the `aws_kinesis_agg` module.  The `aws_kinesis_agg` module provides methods to do both iterative aggregation and callback-based aggregation.\n\n#### Iterative Aggregation\n\nThe iterative aggregation method involves adding records one at a time to the RecordAggregator and checking the response to determine when a full aggregated record is available.  The `add_user_record` method returns `None` when there is room for more records in the existing aggregated record and returns an `AggRecord` object when a full aggregated record is available for transmission.\n\n```\nfor rec in records:\n    result = kinesis_aggregator.add_user_record(rec.PartitionKey, rec.Data, rec.ExplicitHashKey)\n    if result:\n        #Send the result to Kinesis    \n```\n\n#### Callback-based Aggregation\n\nTo use callback-based aggregation, you must register a callback via the `on_record_complete` method.  As you add individual records to the `RecordAggregator` object, you will receive a callback (on a separate thread) whenever a new fully-packed aggregated record is available.\n\n```\ndef my_callback(agg_record):\n    #Send the record to Kinesis\n\n...\n\nkinesis_aggregator.on_record_complete(my_callback)\nfor rec in records:\n    kinesis_aggregator.add_user_record(rec.PartitionKey, rec.Data, rec.ExplicitHashKey)\n```\n\n### Examples\n\nThis repository includes an example script that uses the record aggregation module [aggregator.py](aggregator.py) to aggregate records and transmit them to Amazon Kinesis using callback-based aggregation. You can find this example functionality in the file [kinesis_publisher.py](src/kinesis_publisher.py), which you can use as a template for your own applications to to easily build and transmit encoded data.\n\n#### Callback-based Aggregation and Transmission Example\n\nThe example below assumes you are running Python version 2.7.x and also requires you to install and configure the `boto3` module.  You can install `boto3` via `pip install boto3` or any other normal Python install mechanism.  To configure the example to be able to publish to your Kinesis stream, make sure you follow the instructions in the [Boto3 Configuration Guide](https://boto3.readthedocs.org/en/latest/guide/configuration.html).  The example below has been stripped down for brevity, but you can still find the full working version at [kinesis_publisher.py](src/kinesis_publisher.py). The abridged example is:\n\n```\nimport boto3\nimport aws_kinesis_agg.aggregator\n\nkinesis_client = None\n\ndef send_record(agg_record):\n    global kinesis_client\n    pk, ehk, data = agg_record.get_contents()\n    kinesis_client.put_record(StreamName='MyKinesisStreamName',\n                                  Data=data,\n                                  PartitionKey=pk,\n                                  ExplicitHashKey=ehk)\n\nif __name__ == '__main__':\n    kinesis_client = boto3.client('kinesis', region_name='us-west-2')\n\n    kinesis_agg = aws_kinesis_agg.aggregator.RecordAggregator()\n    kinesis_agg.on_record_complete(send_record)\n\n    for i in range(0,1024):\n        pk, ehk, data = get_record(...)\n        kinesis_agg.add_user_record(pk, data, ehk)\n\n    #Clear out any remaining records that didn't trigger a callback yet\n    send_record(kinesis_agg.clear_and_get()) \n```\n\n\n## Record Deaggregation Module (deaggregator.py)\n\nThe [deaggregator.py](deaggregator.py) module contains Python classes that allow you to deaggregate records that were transmitted using the [Kinesis Aggregated Record Format](https://github.com/awslabs/amazon-kinesis-producer/blob/master/aggregation-format.md), including those transmitted by the Kinesis Producer Library.  This library will allow you to deaggregate aggregated records in any Python environment, including AWS Lambda.\n\n### Usage\n\nThe record deaggregation module provides a simple interface for working with Kinesis aggregated message data in a consumer application. The `aws_kinesis_agg` module provides methods for both bulk and generator-based processing. \n\nWhen using deaggregation, you provide an aggregated Kinesis Record and get back multiple Kinesis User Records. If a Kinesis Record that is provided is not an aggregated Kinesis record, that's perfectly fine - you'll just get a single record output from the single record input. A Kinesis user record which is returned from deaggregation looks like:\n\n```\n{\n    'eventVersion' : String - The version number of the Kinesis event used\n    'eventID' : String - The unique ID of this Kinesis event\n    'kinesis' :\n    {\n        'partitionKey' : String - The Partition Key provided when the record was submitted\n        'explicitHashKey' : String - The hash value used to explicitly determine the shard the data record is assigned to by overriding the partition key hash (or None if absent) \n        'data' : String - The original data transmitted by the producer (base64 encoded)\n        'kinesisSchemaVersion' : String - The version number of the Kinesis message schema used,\n        'sequenceNumber' : BigInt - The sequence number assigned to the record on submission to Kinesis\n        'subSequenceNumber' : Int - The sub-sequence number for the User Record in the aggregated record, if aggregation was in use by the producer\n        'aggregated' : Boolean - Always True for a user record extracted from a Kinesis aggregated record\n    },\n    'invokeIdentityArn' : String - The ARN of the IAM user used to invoke this Lambda function\n    'eventName' : String - Always \"aws:kinesis:record\" for a Kinesis record\n    'eventSourceARN' : String - The ARN of the source Kinesis stream\n    'eventSource' : String - Always \"aws:kinesis\" for a Kinesis record\n    'awsRegion' : String - The name of the source region for the event (e.g. \"us-east-1\")\n}\n```\n\nTo get started, import the `aws_kinesis_agg` module:\n\n`import aws_kinesis_agg`\n\nNext, when you receive a Kinesis Record in your consumer application, you will extract the user records using the deaggregation methods available in the `aws_kinesis_agg` module.\n\n**IMPORTANT**: The deaggregation methods available in the `aws_kinesis_agg` module expect input records in the same dictionary-based format that they are normally received in from AWS Lambda. See the [Programming Model for Authoring Lambda Functions in Python](https://docs.aws.amazon.com/lambda/latest/dg/python-programming-model.html) section of the AWS documentation for more details.\n\n#### Bulk Conversion\n\nThe bulk conversion method of deaggregation takes in a list of Kinesis Records, extracts all the aggregated user records and accumulates them into a list.  Any records that are passed in to this method that are not Kinesis aggregated records will be returned unchanged.  The method returns a list of Kinesis user records in the same format as they are normally delivered by Lambda's Kinesis event handler.\n\n```\nuser_records = deaggregate_records(raw_kinesis_records)\n```\n\n#### Generator-based Conversion\n\nThe generator-based conversion method of deaggregation uses a Python [generator function](https://wiki.python.org/moin/Generators) to extract user records from a raw Kinesis Record one at a time in an iterative fashion.  Any records that are passed in to this method that are not Kinesis aggregated records will be returned unchanged.  For example, you could use this code to iterate through each deaggregated record:\n\n```\nfor record in iter_deaggregate_records(raw_kinesis_records):        \n\n    #Process each record\n    pass \n```\n\n### Examples\n\nThis module includes two example AWS Lambda function in the file [lambda_function.py](src/lambda_function.py) that give you the ability to easily build new functions to process Kinesis aggregated data via AWS Lambda.\n\n#### Bulk Conversion Example\n\n```\nfrom __future__ import print_function\n\nfrom aws_kinesis_agg.deaggregator import deaggregate_records\nimport base64\n\ndef lambda_bulk_handler(event, context):\n\n    raw_kinesis_records = event['Records']\n\n    #Deaggregate all records in one call\n    user_records = deaggregate_records(raw_kinesis_records)\n\n    #Iterate through deaggregated records\n    for record in user_records:        \n\n        # Kinesis data in Python Lambdas is base64 encoded\n        payload = base64.b64decode(record['kinesis']['data'])\n\n        #TODO: Process each record\n\n    return 'Successfully processed {} records.'.format(len(user_records))\n```\n\n#### Generator-based Conversion Example\n\n```\nfrom __future__ import print_function\n\nfrom aws_kinesis_agg.deaggregator import iter_deaggregate_records\nimport base64\n\ndef lambda_generator_handler(event, context):\n\n    raw_kinesis_records = event['Records']\n    record_count = 0\n\n    #Deaggregate all records using a generator function\n    for record in iter_deaggregate_records(raw_kinesis_records):   \n\n        # Kinesis data in Python Lambdas is base64 encoded\n        payload = base64.b64decode(record['kinesis']['data'])\n\n        #TODO: Process each record\n\n        record_count += 1\n\n    return 'Successfully processed {} records.'.format(record_count)\n```\n\n### Build & Deploy a Lambda Function to process Kinesis Records\n\nOne easy way to get started processing Kinesis data is to use AWS Lambda.  By building on top of the existing [lambda_function.py](lambda_function.py) module in this repository, you can take advantage of Kinesis message deaggregation features without having to write boilerplate code.\n\nWhen you're ready to make a build and upload to AWS Lambda, you have two choices:\n\n* Follow the existing instructions at [Creating a Deployment Package (Python)](https://docs.aws.amazon.com/lambda/latest/dg/lambda-python-how-to-create-deployment-package.html)\n\nOR \n\n* At the root of this Python project, you can find a sample build file called [make_lambda_build.py](make_lambda_build.py).  This file is a platform-agnostic build script that will take the existing Python project in this demo and package it in a single build file called `python_lambda_build.zip` that you can upload directly to AWS Lambda.\n\nIn order to use the build script, make sure that the python `pip` tool is available on your command line.  If you have other `pip` dependencies, make sure to add them to the `PIP_DEPENDENCIES` list at the top of the [make_lambda_build.py](make_lambda_build.py).  Then run this command:\n\n```\npython make_lambda_build.py\n```\n\nThe build script will create a new folder called `build`, copy all the Python source files, download any necessary dependencies via `pip` and create the file `python_lambda_build.zip` that you can deploy to AWS Lambda.\n\n#### Important Build Note for AWS Lambda Users\n\nIf you choose to make your own Python zip file to deploy to AWS Lambda, be aware that the Google [protobuf](https://pypi.python.org/pypi/protobuf) module normally relies on using a Python `pth` setting to make the root `google` module importable.  If you see an error in your AWS Lambda logs such as:\n\n```\n\"Unable to import module 'lambda_function': No module named google.protobuf\"\n```\n\nYou can go into the `google` module folder (the same folder containing the `protobuf` folder) and make an empty file called `__init__.py`.  Once you rezip everything and redeploy, this should fix the error above.\n\n**NOTE**: If you used the provided [make_lambda_build.py](make_lambda_build.py) script, this issue is already handled for you.\n\n----\n\nCopyright 2014-2015 Amazon.com, Inc. or its affiliates. All Rights Reserved.\n\nLicensed under the Amazon Software License (the \"License\"). You may not use this file except in compliance with the License. A copy of the License is located at\n\n    http://aws.amazon.com/asl/\n\nor in the \"license\" file accompanying this file. This file is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, express or implied. See the License for the specific language governing permissions and limitations under the License.\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://github.com/awslabs/kinesis-aggregation", "keywords": "aws,kinesis,aggregation,deaggregation,kpl", "license": "Amazon Software License", "maintainer": "", "maintainer_email": "", "name": "aws-kinesis-agg", "package_url": "https://pypi.org/project/aws-kinesis-agg/", "platform": "", "project_url": "https://pypi.org/project/aws-kinesis-agg/", "project_urls": {"Homepage": "http://github.com/awslabs/kinesis-aggregation"}, "release_url": "https://pypi.org/project/aws-kinesis-agg/1.1.2/", "requires_dist": ["protobuf"], "requires_python": "", "summary": "Python module to assist in taking advantage of the Kinesis message aggregation format for both aggregation and deaggregation.", "version": "1.1.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Python Kinesis Aggregation &amp; Deaggregation Modules</h1>\n<p>The Kinesis Aggregation/Deaggregation Modules for Python provide the ability to do in-memory aggregation and deaggregation of standard Kinesis user records using the <a href=\"https://github.com/awslabs/amazon-kinesis-producer/blob/master/aggregation-format.md\" rel=\"nofollow\">Kinesis Aggregated Record Format</a> to allow for more efficient transmission of records.</p>\n<h2>Installation</h2>\n<p>The Python record aggregation/deaggregation modules are available on the Python Package Index (PyPI) as <a href=\"https://pypi.python.org/pypi/aws_kinesis_agg\" rel=\"nofollow\">aws_kinesis_agg</a>.  You can install it via the <code>pip</code> command line tool:</p>\n<pre><code>pip install aws_kinesis_agg\n</code></pre>\n<p>Alternately, you can simply copy the aws_kinesis_agg module from this repository and use it directly with the caveat that the <a href=\"https://pypi.python.org/pypi/protobuf\" rel=\"nofollow\">Google protobuf module</a> must also be available (if you install via <code>pip</code>, this dependency will be handled for you).</p>\n<h2>Record Aggregation Module (aggregator.py)</h2>\n<p>The <a href=\"aggregator.py\" rel=\"nofollow\">aggregator.py</a> module contains Python classes that allow you to aggregate records using the <a href=\"https://github.com/awslabs/amazon-kinesis-producer/blob/master/aggregation-format.md\" rel=\"nofollow\">Kinesis Aggregated Record Format</a>.  Using record aggregation improves throughput and reduces costs when writing producer applications that publish data to Amazon Kinesis.</p>\n<h3>Usage</h3>\n<p>The record aggregation module provides a simple interface for creating protocol buffers encoded data in a producer application. The <code>aws_kinesis_agg</code> module provides methods for efficiently packing individual records into larger aggregated records.</p>\n<p>When using aggregation, you create a RecordAggregator object and then provide a partition key, raw data and (optionally) an explicit hash key for each record.  You can choose to either provide a callback function that will be invoked when a fully-packed aggregated record is available or you can add records and check byte sizes or number of records until the aggregated record is suitably full.  You're guaranteed that any aggregated record returned from the RecordAggregator object will fit within a single PutRecord request to Kinesis.</p>\n<p>To get started, import the <code>aws_kinesis_agg</code> module:</p>\n<pre><code>import aws_kinesis_agg\n</code></pre>\n<p>As you produce records in your producer application, you will aggregate them using the aggregation methods available in the <code>aws_kinesis_agg</code> module.  The <code>aws_kinesis_agg</code> module provides methods to do both iterative aggregation and callback-based aggregation.</p>\n<h4>Iterative Aggregation</h4>\n<p>The iterative aggregation method involves adding records one at a time to the RecordAggregator and checking the response to determine when a full aggregated record is available.  The <code>add_user_record</code> method returns <code>None</code> when there is room for more records in the existing aggregated record and returns an <code>AggRecord</code> object when a full aggregated record is available for transmission.</p>\n<pre><code>for rec in records:\n    result = kinesis_aggregator.add_user_record(rec.PartitionKey, rec.Data, rec.ExplicitHashKey)\n    if result:\n        #Send the result to Kinesis    \n</code></pre>\n<h4>Callback-based Aggregation</h4>\n<p>To use callback-based aggregation, you must register a callback via the <code>on_record_complete</code> method.  As you add individual records to the <code>RecordAggregator</code> object, you will receive a callback (on a separate thread) whenever a new fully-packed aggregated record is available.</p>\n<pre><code>def my_callback(agg_record):\n    #Send the record to Kinesis\n\n...\n\nkinesis_aggregator.on_record_complete(my_callback)\nfor rec in records:\n    kinesis_aggregator.add_user_record(rec.PartitionKey, rec.Data, rec.ExplicitHashKey)\n</code></pre>\n<h3>Examples</h3>\n<p>This repository includes an example script that uses the record aggregation module <a href=\"aggregator.py\" rel=\"nofollow\">aggregator.py</a> to aggregate records and transmit them to Amazon Kinesis using callback-based aggregation. You can find this example functionality in the file <a href=\"src/kinesis_publisher.py\" rel=\"nofollow\">kinesis_publisher.py</a>, which you can use as a template for your own applications to to easily build and transmit encoded data.</p>\n<h4>Callback-based Aggregation and Transmission Example</h4>\n<p>The example below assumes you are running Python version 2.7.x and also requires you to install and configure the <code>boto3</code> module.  You can install <code>boto3</code> via <code>pip install boto3</code> or any other normal Python install mechanism.  To configure the example to be able to publish to your Kinesis stream, make sure you follow the instructions in the <a href=\"https://boto3.readthedocs.org/en/latest/guide/configuration.html\" rel=\"nofollow\">Boto3 Configuration Guide</a>.  The example below has been stripped down for brevity, but you can still find the full working version at <a href=\"src/kinesis_publisher.py\" rel=\"nofollow\">kinesis_publisher.py</a>. The abridged example is:</p>\n<pre><code>import boto3\nimport aws_kinesis_agg.aggregator\n\nkinesis_client = None\n\ndef send_record(agg_record):\n    global kinesis_client\n    pk, ehk, data = agg_record.get_contents()\n    kinesis_client.put_record(StreamName='MyKinesisStreamName',\n                                  Data=data,\n                                  PartitionKey=pk,\n                                  ExplicitHashKey=ehk)\n\nif __name__ == '__main__':\n    kinesis_client = boto3.client('kinesis', region_name='us-west-2')\n\n    kinesis_agg = aws_kinesis_agg.aggregator.RecordAggregator()\n    kinesis_agg.on_record_complete(send_record)\n\n    for i in range(0,1024):\n        pk, ehk, data = get_record(...)\n        kinesis_agg.add_user_record(pk, data, ehk)\n\n    #Clear out any remaining records that didn't trigger a callback yet\n    send_record(kinesis_agg.clear_and_get()) \n</code></pre>\n<h2>Record Deaggregation Module (deaggregator.py)</h2>\n<p>The <a href=\"deaggregator.py\" rel=\"nofollow\">deaggregator.py</a> module contains Python classes that allow you to deaggregate records that were transmitted using the <a href=\"https://github.com/awslabs/amazon-kinesis-producer/blob/master/aggregation-format.md\" rel=\"nofollow\">Kinesis Aggregated Record Format</a>, including those transmitted by the Kinesis Producer Library.  This library will allow you to deaggregate aggregated records in any Python environment, including AWS Lambda.</p>\n<h3>Usage</h3>\n<p>The record deaggregation module provides a simple interface for working with Kinesis aggregated message data in a consumer application. The <code>aws_kinesis_agg</code> module provides methods for both bulk and generator-based processing.</p>\n<p>When using deaggregation, you provide an aggregated Kinesis Record and get back multiple Kinesis User Records. If a Kinesis Record that is provided is not an aggregated Kinesis record, that's perfectly fine - you'll just get a single record output from the single record input. A Kinesis user record which is returned from deaggregation looks like:</p>\n<pre><code>{\n    'eventVersion' : String - The version number of the Kinesis event used\n    'eventID' : String - The unique ID of this Kinesis event\n    'kinesis' :\n    {\n        'partitionKey' : String - The Partition Key provided when the record was submitted\n        'explicitHashKey' : String - The hash value used to explicitly determine the shard the data record is assigned to by overriding the partition key hash (or None if absent) \n        'data' : String - The original data transmitted by the producer (base64 encoded)\n        'kinesisSchemaVersion' : String - The version number of the Kinesis message schema used,\n        'sequenceNumber' : BigInt - The sequence number assigned to the record on submission to Kinesis\n        'subSequenceNumber' : Int - The sub-sequence number for the User Record in the aggregated record, if aggregation was in use by the producer\n        'aggregated' : Boolean - Always True for a user record extracted from a Kinesis aggregated record\n    },\n    'invokeIdentityArn' : String - The ARN of the IAM user used to invoke this Lambda function\n    'eventName' : String - Always \"aws:kinesis:record\" for a Kinesis record\n    'eventSourceARN' : String - The ARN of the source Kinesis stream\n    'eventSource' : String - Always \"aws:kinesis\" for a Kinesis record\n    'awsRegion' : String - The name of the source region for the event (e.g. \"us-east-1\")\n}\n</code></pre>\n<p>To get started, import the <code>aws_kinesis_agg</code> module:</p>\n<p><code>import aws_kinesis_agg</code></p>\n<p>Next, when you receive a Kinesis Record in your consumer application, you will extract the user records using the deaggregation methods available in the <code>aws_kinesis_agg</code> module.</p>\n<p><strong>IMPORTANT</strong>: The deaggregation methods available in the <code>aws_kinesis_agg</code> module expect input records in the same dictionary-based format that they are normally received in from AWS Lambda. See the <a href=\"https://docs.aws.amazon.com/lambda/latest/dg/python-programming-model.html\" rel=\"nofollow\">Programming Model for Authoring Lambda Functions in Python</a> section of the AWS documentation for more details.</p>\n<h4>Bulk Conversion</h4>\n<p>The bulk conversion method of deaggregation takes in a list of Kinesis Records, extracts all the aggregated user records and accumulates them into a list.  Any records that are passed in to this method that are not Kinesis aggregated records will be returned unchanged.  The method returns a list of Kinesis user records in the same format as they are normally delivered by Lambda's Kinesis event handler.</p>\n<pre><code>user_records = deaggregate_records(raw_kinesis_records)\n</code></pre>\n<h4>Generator-based Conversion</h4>\n<p>The generator-based conversion method of deaggregation uses a Python <a href=\"https://wiki.python.org/moin/Generators\" rel=\"nofollow\">generator function</a> to extract user records from a raw Kinesis Record one at a time in an iterative fashion.  Any records that are passed in to this method that are not Kinesis aggregated records will be returned unchanged.  For example, you could use this code to iterate through each deaggregated record:</p>\n<pre><code>for record in iter_deaggregate_records(raw_kinesis_records):        \n\n    #Process each record\n    pass \n</code></pre>\n<h3>Examples</h3>\n<p>This module includes two example AWS Lambda function in the file <a href=\"src/lambda_function.py\" rel=\"nofollow\">lambda_function.py</a> that give you the ability to easily build new functions to process Kinesis aggregated data via AWS Lambda.</p>\n<h4>Bulk Conversion Example</h4>\n<pre><code>from __future__ import print_function\n\nfrom aws_kinesis_agg.deaggregator import deaggregate_records\nimport base64\n\ndef lambda_bulk_handler(event, context):\n\n    raw_kinesis_records = event['Records']\n\n    #Deaggregate all records in one call\n    user_records = deaggregate_records(raw_kinesis_records)\n\n    #Iterate through deaggregated records\n    for record in user_records:        \n\n        # Kinesis data in Python Lambdas is base64 encoded\n        payload = base64.b64decode(record['kinesis']['data'])\n\n        #TODO: Process each record\n\n    return 'Successfully processed {} records.'.format(len(user_records))\n</code></pre>\n<h4>Generator-based Conversion Example</h4>\n<pre><code>from __future__ import print_function\n\nfrom aws_kinesis_agg.deaggregator import iter_deaggregate_records\nimport base64\n\ndef lambda_generator_handler(event, context):\n\n    raw_kinesis_records = event['Records']\n    record_count = 0\n\n    #Deaggregate all records using a generator function\n    for record in iter_deaggregate_records(raw_kinesis_records):   \n\n        # Kinesis data in Python Lambdas is base64 encoded\n        payload = base64.b64decode(record['kinesis']['data'])\n\n        #TODO: Process each record\n\n        record_count += 1\n\n    return 'Successfully processed {} records.'.format(record_count)\n</code></pre>\n<h3>Build &amp; Deploy a Lambda Function to process Kinesis Records</h3>\n<p>One easy way to get started processing Kinesis data is to use AWS Lambda.  By building on top of the existing <a href=\"lambda_function.py\" rel=\"nofollow\">lambda_function.py</a> module in this repository, you can take advantage of Kinesis message deaggregation features without having to write boilerplate code.</p>\n<p>When you're ready to make a build and upload to AWS Lambda, you have two choices:</p>\n<ul>\n<li>Follow the existing instructions at <a href=\"https://docs.aws.amazon.com/lambda/latest/dg/lambda-python-how-to-create-deployment-package.html\" rel=\"nofollow\">Creating a Deployment Package (Python)</a></li>\n</ul>\n<p>OR</p>\n<ul>\n<li>At the root of this Python project, you can find a sample build file called <a href=\"make_lambda_build.py\" rel=\"nofollow\">make_lambda_build.py</a>.  This file is a platform-agnostic build script that will take the existing Python project in this demo and package it in a single build file called <code>python_lambda_build.zip</code> that you can upload directly to AWS Lambda.</li>\n</ul>\n<p>In order to use the build script, make sure that the python <code>pip</code> tool is available on your command line.  If you have other <code>pip</code> dependencies, make sure to add them to the <code>PIP_DEPENDENCIES</code> list at the top of the <a href=\"make_lambda_build.py\" rel=\"nofollow\">make_lambda_build.py</a>.  Then run this command:</p>\n<pre><code>python make_lambda_build.py\n</code></pre>\n<p>The build script will create a new folder called <code>build</code>, copy all the Python source files, download any necessary dependencies via <code>pip</code> and create the file <code>python_lambda_build.zip</code> that you can deploy to AWS Lambda.</p>\n<h4>Important Build Note for AWS Lambda Users</h4>\n<p>If you choose to make your own Python zip file to deploy to AWS Lambda, be aware that the Google <a href=\"https://pypi.python.org/pypi/protobuf\" rel=\"nofollow\">protobuf</a> module normally relies on using a Python <code>pth</code> setting to make the root <code>google</code> module importable.  If you see an error in your AWS Lambda logs such as:</p>\n<pre><code>\"Unable to import module 'lambda_function': No module named google.protobuf\"\n</code></pre>\n<p>You can go into the <code>google</code> module folder (the same folder containing the <code>protobuf</code> folder) and make an empty file called <code>__init__.py</code>.  Once you rezip everything and redeploy, this should fix the error above.</p>\n<p><strong>NOTE</strong>: If you used the provided <a href=\"make_lambda_build.py\" rel=\"nofollow\">make_lambda_build.py</a> script, this issue is already handled for you.</p>\n<hr>\n<p>Copyright 2014-2015 Amazon.com, Inc. or its affiliates. All Rights Reserved.</p>\n<p>Licensed under the Amazon Software License (the \"License\"). You may not use this file except in compliance with the License. A copy of the License is located at</p>\n<pre><code>http://aws.amazon.com/asl/\n</code></pre>\n<p>or in the \"license\" file accompanying this file. This file is distributed on an \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, express or implied. See the License for the specific language governing permissions and limitations under the License.</p>\n\n          </div>"}, "last_serial": 6919287, "releases": {"1.0.0": [{"comment_text": "", "digests": {"md5": "4e0fe5ca4a6b388ace299b084c4e7651", "sha256": "1bbd4e77607da5001ae27df5080e9a3cc26f0b4f5c268342655563ff328360bb"}, "downloads": -1, "filename": "aws_kinesis_agg-1.0.0.zip", "has_sig": false, "md5_digest": "4e0fe5ca4a6b388ace299b084c4e7651", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30577, "upload_time": "2016-03-29T14:15:56", "upload_time_iso_8601": "2016-03-29T14:15:56.058305Z", "url": "https://files.pythonhosted.org/packages/d6/88/1653afe42064444074ff44a5049ed6065b2b5e7a9c5c0723205cd29431e0/aws_kinesis_agg-1.0.0.zip", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "f66745680125568a670e99690caa0df2", "sha256": "707618375ef1cd8b6f3434559fd52537c889708600faf857d68fac60fe2e6bd8"}, "downloads": -1, "filename": "aws_kinesis_agg-1.0.1.zip", "has_sig": false, "md5_digest": "f66745680125568a670e99690caa0df2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30649, "upload_time": "2016-04-19T04:12:40", "upload_time_iso_8601": "2016-04-19T04:12:40.887084Z", "url": "https://files.pythonhosted.org/packages/31/5e/d5ef137d6122a58cca610c0f18a5c5a3578221bae5fe67bd7bf29454f4d4/aws_kinesis_agg-1.0.1.zip", "yanked": false}], "1.1.0": [{"comment_text": "", "digests": {"md5": "07831313d95bbb12867cd1917560ba46", "sha256": "7b9a0fbb1eaf16af1ce13ebc5e06beff7b4c2110d0377c6dc4bb8796d7ec7588"}, "downloads": -1, "filename": "aws_kinesis_agg-1.1.0.tar.gz", "has_sig": false, "md5_digest": "07831313d95bbb12867cd1917560ba46", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 21729, "upload_time": "2018-03-07T01:00:56", "upload_time_iso_8601": "2018-03-07T01:00:56.058597Z", "url": "https://files.pythonhosted.org/packages/92/0c/52f0293e8aeb737f0378153528d6c3b40e5f03a9386dc7e59927f4611682/aws_kinesis_agg-1.1.0.tar.gz", "yanked": false}], "1.1.1": [{"comment_text": "", "digests": {"md5": "304e9acc3bac7313ede7a7ef48dcafba", "sha256": "d42ab05125088f6a4f8a7be3d205df5afd71fbf019eac71c93c37446c73155e9"}, "downloads": -1, "filename": "aws_kinesis_agg-1.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "304e9acc3bac7313ede7a7ef48dcafba", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18311, "upload_time": "2019-07-10T09:11:29", "upload_time_iso_8601": "2019-07-10T09:11:29.526856Z", "url": "https://files.pythonhosted.org/packages/cd/c9/3dc89ce24666b8210c80ec5354f7f6176e3a48f212382c29e5d5e1598248/aws_kinesis_agg-1.1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "08b26bf37ad4fd6e358d5c7df7b22559", "sha256": "bc495c967eccad7b1c98352cb12daa56c27ca08a0d7e4dce6f5d33b07aa8f8ff"}, "downloads": -1, "filename": "aws_kinesis_agg-1.1.1.tar.gz", "has_sig": false, "md5_digest": "08b26bf37ad4fd6e358d5c7df7b22559", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29517, "upload_time": "2019-07-10T09:11:30", "upload_time_iso_8601": "2019-07-10T09:11:30.782334Z", "url": "https://files.pythonhosted.org/packages/64/50/d920a018605d1b3aef7f07df31a533289f54de54087566af1f983d1ce3ca/aws_kinesis_agg-1.1.1.tar.gz", "yanked": false}], "1.1.2": [{"comment_text": "", "digests": {"md5": "9ab40bf667af1a2beca934a84b099f54", "sha256": "6d2c7b31ae526d72cbab36dcf7fec08f5725999fe4712354757acea39b0397ea"}, "downloads": -1, "filename": "aws_kinesis_agg-1.1.2-py3-none-any.whl", "has_sig": false, "md5_digest": "9ab40bf667af1a2beca934a84b099f54", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18322, "upload_time": "2019-08-02T15:08:48", "upload_time_iso_8601": "2019-08-02T15:08:48.597952Z", "url": "https://files.pythonhosted.org/packages/81/c2/329b0550469282758d68e6da3a394b9ccd5c379f9ac611c004569f1e1317/aws_kinesis_agg-1.1.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b71510027112f9729a0cfa1db4429b9e", "sha256": "abb41472e5d598382577224ec65b3ae31ae66a61271b4986229ad1429d03a445"}, "downloads": -1, "filename": "aws_kinesis_agg-1.1.2.tar.gz", "has_sig": false, "md5_digest": "b71510027112f9729a0cfa1db4429b9e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29535, "upload_time": "2019-08-02T15:08:50", "upload_time_iso_8601": "2019-08-02T15:08:50.404633Z", "url": "https://files.pythonhosted.org/packages/35/e0/008d24af771cfe69561552edb920f39274d7c1527d3333a39eb048e59367/aws_kinesis_agg-1.1.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "9ab40bf667af1a2beca934a84b099f54", "sha256": "6d2c7b31ae526d72cbab36dcf7fec08f5725999fe4712354757acea39b0397ea"}, "downloads": -1, "filename": "aws_kinesis_agg-1.1.2-py3-none-any.whl", "has_sig": false, "md5_digest": "9ab40bf667af1a2beca934a84b099f54", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18322, "upload_time": "2019-08-02T15:08:48", "upload_time_iso_8601": "2019-08-02T15:08:48.597952Z", "url": "https://files.pythonhosted.org/packages/81/c2/329b0550469282758d68e6da3a394b9ccd5c379f9ac611c004569f1e1317/aws_kinesis_agg-1.1.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b71510027112f9729a0cfa1db4429b9e", "sha256": "abb41472e5d598382577224ec65b3ae31ae66a61271b4986229ad1429d03a445"}, "downloads": -1, "filename": "aws_kinesis_agg-1.1.2.tar.gz", "has_sig": false, "md5_digest": "b71510027112f9729a0cfa1db4429b9e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29535, "upload_time": "2019-08-02T15:08:50", "upload_time_iso_8601": "2019-08-02T15:08:50.404633Z", "url": "https://files.pythonhosted.org/packages/35/e0/008d24af771cfe69561552edb920f39274d7c1527d3333a39eb048e59367/aws_kinesis_agg-1.1.2.tar.gz", "yanked": false}], "timestamp": "Thu May  7 18:15:39 2020"}