{"info": {"author": "BlueDynamics Alliance", "author_email": "dev@bluedynamics.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: GNU General Public License (GPL)", "Operating System :: OS Independent", "Programming Language :: Python", "Topic :: Software Development"], "description": "============================================\nBuildout recipe managing project deployments\n============================================\n\nOverview\n========\n\n``bda.recipe.deployment`` offers a deployment cycle and helper scripts for\nbuildout based projects.\n\n\nMotivation\n==========\n\nWhile in small projects pinning checkout revisions or package versions in order\nto deploy reconstructable setups works fine, the same strategy runs out of\nit's possibilities as soon as it comes to deployment of projects where\nsteps needed to publish a new feature not always follow a consistent and\nrepeating cycle.\n\nConsider following example. A customer comes up with two feature requests. The\ncustomer always communicates with the project manager, from customer point of\nview the cycle is clear. Each feature must be tested and after approving the\nrollout could be made. Now the developer imlements feature one, and while the\nfirst feature waits for testing and approval, he wants to implement second one\nwithout influence to the approval cycle.\n\nThe deployment cycle consists of three possible installations, further called\nenvironments:\n\nDevelopment\n    The development environment is used to develop features on developers local\n    maschine.\n\nRelease Candidate\n    The environment on the testing maschine accessible for customers testing.\n\nLive\n    The tested and stable live system.\n\n\nProcess\n-------\n\nOverall process:\n\n1) Developer uses ``dev.cfg``. If changes were done\n``./bin/deploy candidate MODULENAME NEWVERSION`` is called. Modules RC-branch is\ncreated/synced and the sources section in file for rc environment is modified\nand committed.\n\n2) Release Manager uses ``rc.cfg`` on its testing checkout. After svn/git update\nand buildout (re-)run the setup contains all release candidates branches.\nSoftware can be tested. In a second cycle Release Manager can merge changes from\ndevelopment branch into rc branch.\n\n3) Release Manager decides to release a package after testing for live-usage.\nIn rc-environment ``./bin/deploy release MODULENAME `` is called and the egg is\nuploaded to the configured eggserver or saved local. The live-versions section\nin file for live-environment is modifed and committed.\n\n4) Live-System-Administrator uses ``live.cfg`` on the live-deployment maschine.\nAfter git/svn up and buildout (re-)run the most recent releases are available.\n\nOptional (if configured) the RC steps 2 and 3  can be omitted and a release may\nhappen from dev direct to live.\n\nWhile Developer and Release Candidate needs the add-on ``mr.developer``, Live\ndoes not it.\n\n\nBuildout Structure\n------------------\n\nProposed buildout structure::\n\n    dev.cfg (manual)\n    rc.cfg (manual)\n    live.cfg (manual)\n    etc/base.cfg (manual)\n    etc/deployment.cfg (manual)\n    etc/sources-dev.cfg (manual)\n    etc/sources-rc.cfg (generated)\n    etc/versions-rc.cfg (generated)\n    etc/versions-live.cfg (generated)\n    cfg/versions-global.cfg (manual, optional)\n    \ndev.cfg\n    Contains parts for local development, includes developer tools if\n    necessary. Included parts:\n\n    -``base.cfg``\n    -``versions-global.cfg``\n    -``sources-dev.cfg``,\n    -``deployment.cfg``.\n\nrc.cfg\n    Contains parts for local on a test-server. Included parts:\n\n    -``base.cfg``\n    -``versions-global.cfg``\n    -``versions-rc.cfg``\n    -``sources-rc.cfg``,\n    -``deployment.cfg``.\n\n\nlive.cfg\n    Contains parts for deployment on a live-server. Included parts:\n\n    -``base.cfg``\n    -``versions-global.cfg``\n    -``versions-live.cfg``\n\n\n\nbase.cfg\n    contains all common sections and settingsof the buildout needed by all\n    three types of environment.\n\ndeployment.cfg\n    Contains deployment specific sections and settings, such as parameters for\n    deployment and list of managed packages and which dist-server to use.\n\nglobal-versions.cfg\n    Contains the common version section. In smaller projects this can be put in\n    base.cfg\n\nsources-dev.cfg\n    Contains the sources-section for all developer controlled sources.\n\nsources-rc.cfg\n    Contains the sources for Release-Candidate setup. This file is generated by\n    scripts. It points to the automatically created branches.\n\nversions-rc.cfg\n    Contains the versions of developer controlled sources used in\n    rc-deployment. This are the packages which do not need a RC step.\n    This file is generated by scripts.\n\nversions-live.cfg\n    Contains the versions of developer controlled sources used in\n    live-deployment. This file is generated by scripts.\n\nCommands\n--------\n\nIn buildouts bin directory there are two main commands which itself have a\nbunch of sub commands, the ``deploy`` and the ``bda_deployment_helper``. Latter\nis rarely used, i.e. you may need it to fix things. So the main tool for the\ndaily usage is ``deploy``:\n\n``deploy``\n    main command for all daily tasks\n\n    subcommands are context sensitive. In Dev environment there are other\n    commands available than in RC enviroment. So in Dev this are:\n\n    ``repopasswd``\n        sets the username/ password for the pypi server\n\n    ``info``\n        prints info about managed packages.\n\n    ``version``\n        prints version of a package\n\n    ``candidate``\n        prepare a release candidate for a package, this includes creation of a\n        branch\n\n    ``release``\n        make a release of a package, this includes tagging and upload to the\n        index (or local file release) and setting the version in\n        ``versions-rc.cfg`` and ``versions-live.cfg``.\n\n    In RC the commands are:\n\n    ``repopasswd``\n         see above\n\n    ``info``\n         see above\n\n    ``version``\n         see above\n\n    ``release``\n        make a release of a package, this includes tagging and upload to the\n        index (or local file release) and setting the version in\n        ``versions-live.cfg``.\n\n    ``merge``\n        merge current trunk/master branch of a package into the rc branch\n\nAll commands and subcommands have a help to find their paramaters.\n\n\nSource Code\n===========\n\nThe sources are in a GIT DVCS with its main branches at\n`github <http://github.com/bluedynamics/bda.recipe.deployment>`_.\n\nWe'd be happy to see many forks and pull-requests to make it even better.\n\n\nContributors\n============\n\n- Jens W. Klein <jk [at] kleinundpartner [dot] at>\n\n- Robert Niederrreiter <rnix [at] squarewavea [dot] t>\n\n \nLicense\n=======\n\nCopyright (c) 2012, BlueDynamics Alliance, Austria, Switzerland, Germany\n\nGNU GENERAL PUBLIC LICENSE \n\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n0. This License applies to any program or other work which contains\n   a notice placed by the copyright holder saying it may be distributed\n   under the terms of this General Public License.  The \"Program\", below,\n   refers to any such program or work, and a \"work based on the Program\"\n   means either the Program or any derivative work under copyright law:\n   that is to say, a work containing the Program or a portion of it,\n   either verbatim or with modifications and/or translated into another\n   language.  (Hereinafter, translation is included without limitation in\n   the term \"modification\".)  Each licensee is addressed as \"you\".\n\n   Activities other than copying, distribution and modification are not\n   covered by this License; they are outside its scope.  The act of\n   running the Program is not restricted, and the output from the Program\n   is covered only if its contents constitute a work based on the\n   Program (independent of having been made by running the Program).\n   Whether that is true depends on what the Program does.\n\n1. You may copy and distribute verbatim copies of the Program's\n   source code as you receive it, in any medium, provided that you\n   conspicuously and appropriately publish on each copy an appropriate\n   copyright notice and disclaimer of warranty; keep intact all the\n   notices that refer to this License and to the absence of any warranty;\n   and give any other recipients of the Program a copy of this License\n   along with the Program.\n\n   You may charge a fee for the physical act of transferring a copy, and\n   you may at your option offer warranty protection in exchange for a fee.\n\n2  You may modify your copy or copies of the Program or any portion\n   of it, thus forming a work based on the Program, and copy and\n   distribute such modifications or work under the terms of Section 1\n   above, provided that you also meet all of these conditions:\n\n   a) You must cause the modified files to carry prominent notices\n   stating that you changed the files and the date of any change.\n\n   b) You must cause any work that you distribute or publish, that in\n   whole or in part contains or is derived from the Program or any\n   part thereof, to be licensed as a whole at no charge to all third\n   parties under the terms of this License.\n\n   c) If the modified program normally reads commands interactively\n   when run, you must cause it, when started running for such\n   interactive use in the most ordinary way, to print or display an\n   announcement including an appropriate copyright notice and a\n   notice that there is no warranty (or else, saying that you provide\n   a warranty) and that users may redistribute the program under\n   these conditions, and telling the user how to view a copy of this\n   License.  (Exception: if the Program itself is interactive but\n   does not normally print such an announcement, your work based on\n   the Program is not required to print an announcement.)\n\n   These requirements apply to the modified work as a whole.  If\n   identifiable sections of that work are not derived from the Program,\n   and can be reasonably considered independent and separate works in\n   themselves, then this License, and its terms, do not apply to those\n   sections when you distribute them as separate works.  But when you\n   distribute the same sections as part of a whole which is a work based\n   on the Program, the distribution of the whole must be on the terms of\n   this License, whose permissions for other licensees extend to the\n   entire whole, and thus to each and every part regardless of who wrote it.\n\n   Thus, it is not the intent of this section to claim rights or contest\n   your rights to work written entirely by you; rather, the intent is to\n   exercise the right to control the distribution of derivative or\n   collective works based on the Program.\n  \n   In addition, mere aggregation of another work not based on the Program\n   with the Program (or with a work based on the Program) on a volume of\n   a storage or distribution medium does not bring the other work under\n   the scope of this License.\n\n3. You may copy and distribute the Program (or a work based on it,\n   under Section 2) in object code or executable form under the terms of\n   Sections 1 and 2 above provided that you also do one of the following:\n   \n   a) Accompany it with the complete corresponding machine-readable\n   source code, which must be distributed under the terms of Sections\n   1 and 2 above on a medium customarily used for software interchange; or, \n\n   b) Accompany it with a written offer, valid for at least three\n   years, to give any third party, for a charge no more than your\n   cost of physically performing source distribution, a complete\n   machine-readable copy of the corresponding source code, to be\n   distributed under the terms of Sections 1 and 2 above on a medium\n   customarily used for software interchange; or, \n\n   c) Accompany it with the information you received as to the offer\n   to distribute corresponding source code.  (This alternative is\n   allowed only for noncommercial distribution and only if you\n   received the program in object code or executable form with such\n   an offer, in accord with Subsection b above.)\n\n   The source code for a work means the preferred form of the work for\n   making modifications to it.  For an executable work, complete source\n   code means all the source code for all modules it contains, plus any\n   associated interface definition files, plus the scripts used to\n   control compilation and installation of the executable.  However, as a\n   special exception, the source code distributed need not include\n   anything that is normally distributed (in either source or binary\n   form) with the major components (compiler, kernel, and so on) of the\n   operating system on which the executable runs, unless that component\n   itself accompanies the executable. \n\n   If distribution of executable or object code is made by offering\n   access to copy from a designated place, then offering equivalent\n   access to copy the source code from the same place counts as\n   distribution of the source code, even though third parties are not\n   compelled to copy the source along with the object code. \n\n4. You may not copy, modify, sublicense, or distribute the Program\n   except as expressly provided under this License.  Any attempt\n   otherwise to copy, modify, sublicense or distribute the Program is\n   void, and will automatically terminate your rights under this License.\n   However, parties who have received copies, or rights, from you under\n   this License will not have their licenses terminated so long as such\n   parties remain in full compliance.\n\n5. You are not required to accept this License, since you have not\n   signed it.  However, nothing else grants you permission to modify or\n   distribute the Program or its derivative works.  These actions are\n   prohibited by law if you do not accept this License.  Therefore, by\n   modifying or distributing the Program (or any work based on the\n   Program), you indicate your acceptance of this License to do so, and\n   all its terms and conditions for copying, distributing or modifying\n   the Program or works based on it.\n\n6. Each time you redistribute the Program (or any work based on the\n   Program), the recipient automatically receives a license from the\n   original licensor to copy, distribute or modify the Program subject to\n   these terms and conditions.  You may not impose any further\n   restrictions on the recipients' exercise of the rights granted herein.\n   You are not responsible for enforcing compliance by third parties to\n   this License.\n\n7. If, as a consequence of a court judgment or allegation of patent\n   infringement or for any other reason (not limited to patent issues),\n   conditions are imposed on you (whether by court order, agreement or\n   otherwise) that contradict the conditions of this License, they do not\n   excuse you from the conditions of this License.  If you cannot\n   distribute so as to satisfy simultaneously your obligations under this\n   License and any other pertinent obligations, then as a consequence you\n   may not distribute the Program at all.  For example, if a patent\n   license would not permit royalty-free redistribution of the Program by\n   all those who receive copies directly or indirectly through you, then\n   the only way you could satisfy both it and this License would be to\n   refrain entirely from distribution of the Program.\n\n   If any portion of this section is held invalid or unenforceable under\n   any particular circumstance, the balance of the section is intended to\n   apply and the section as a whole is intended to apply in other\n   circumstances.\n \n   It is not the purpose of this section to induce you to infringe any\n   patents or other property right claims or to contest validity of any\n   such claims; this section has the sole purpose of protecting the\n   integrity of the free software distribution system, which is\n   implemented by public license practices.  Many people have made\n   generous contributions to the wide range of software distributed\n   through that system in reliance on consistent application of that\n   system; it is up to the author/donor to decide if he or she is willing\n   to distribute software through any other system and a licensee cannot\n   impose that choice.\n\n   This section is intended to make thoroughly clear what is believed to\n   be a consequence of the rest of this License.\n\n8. If the distribution and/or use of the Program is restricted in\n   certain countries either by patents or by copyrighted interfaces, the\n   original copyright holder who places the Program under this License\n   may add an explicit geographical distribution limitation excluding\n   those countries, so that distribution is permitted only in or among\n   countries not thus excluded.  In such case, this License incorporates\n   the limitation as if written in the body of this License.\n \n9. The Free Software Foundation may publish revised and/or new versions\n   of the General Public License from time to time.  Such new versions will\n   be similar in spirit to the present version, but may differ in detail to\n   address new problems or concerns.\n \n   Each version is given a distinguishing version number.  If the Program\n   specifies a version number of this License which applies to it and \"any\n   later version\", you have the option of following the terms and conditions\n   either of that version or of any later version published by the Free\n   Software Foundation.  If the Program does not specify a version number of\n   this License, you may choose any version ever published by the Free Software\n   Foundation.\n\n10. If you wish to incorporate parts of the Program into other free\n    programs whose distribution conditions are different, write to the author\n    to ask for permission.  For software which is copyrighted by the Free\n    Software Foundation, write to the Free Software Foundation; we sometimes\n    make exceptions for this.  Our decision will be guided by the two goals\n    of preserving the free status of all derivatives of our free software and\n    of promoting the sharing and reuse of software generally.\n\nNO WARRANTY\n\n11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\n    FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\n    OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\n    PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\n    OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\n    TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\n    PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\n    REPAIR OR CORRECTION.\n\n12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\n    WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\n    REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\n    INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\n    OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\n    TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\n    YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\n    PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\n    POSSIBILITY OF SUCH DAMAGES.\n\nEND OF TERMS AND CONDITIONS", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://pypi.python.org/pypi/bda.recipe.deployment", "keywords": "", "license": "GPLv2", "maintainer": null, "maintainer_email": null, "name": "bda.recipe.deployment", "package_url": "https://pypi.org/project/bda.recipe.deployment/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/bda.recipe.deployment/", "project_urls": {"Download": "UNKNOWN", "Homepage": "http://pypi.python.org/pypi/bda.recipe.deployment"}, "release_url": "https://pypi.org/project/bda.recipe.deployment/2.0beta/", "requires_dist": null, "requires_python": null, "summary": "python deployment process based on buildout and mr.developer", "version": "2.0beta", "yanked": false, "html_description": "<div class=\"project-description\">\n            ============================================<br>Buildout recipe managing project deployments<br>============================================<br><br>Overview<br>========<br><br>``bda.recipe.deployment`` offers a deployment cycle and helper scripts for<br>buildout based projects.<br><br><br>Motivation<br>==========<br><br>While in small projects pinning checkout revisions or package versions in order<br>to deploy reconstructable setups works fine, the same strategy runs out of<br>it's possibilities as soon as it comes to deployment of projects where<br>steps needed to publish a new feature not always follow a consistent and<br>repeating cycle.<br><br>Consider following example. A customer comes up with two feature requests. The<br>customer always communicates with the project manager, from customer point of<br>view the cycle is clear. Each feature must be tested and after approving the<br>rollout could be made. Now the developer imlements feature one, and while the<br>first feature waits for testing and approval, he wants to implement second one<br>without influence to the approval cycle.<br><br>The deployment cycle consists of three possible installations, further called<br>environments:<br><br>Development<br>    The development environment is used to develop features on developers local<br>    maschine.<br><br>Release Candidate<br>    The environment on the testing maschine accessible for customers testing.<br><br>Live<br>    The tested and stable live system.<br><br><br>Process<br>-------<br><br>Overall process:<br><br>1) Developer uses ``dev.cfg``. If changes were done<br>``./bin/deploy candidate MODULENAME NEWVERSION`` is called. Modules RC-branch is<br>created/synced and the sources section in file for rc environment is modified<br>and committed.<br><br>2) Release Manager uses ``rc.cfg`` on its testing checkout. After svn/git update<br>and buildout (re-)run the setup contains all release candidates branches.<br>Software can be tested. In a second cycle Release Manager can merge changes from<br>development branch into rc branch.<br><br>3) Release Manager decides to release a package after testing for live-usage.<br>In rc-environment ``./bin/deploy release MODULENAME `` is called and the egg is<br>uploaded to the configured eggserver or saved local. The live-versions section<br>in file for live-environment is modifed and committed.<br><br>4) Live-System-Administrator uses ``live.cfg`` on the live-deployment maschine.<br>After git/svn up and buildout (re-)run the most recent releases are available.<br><br>Optional (if configured) the RC steps 2 and 3  can be omitted and a release may<br>happen from dev direct to live.<br><br>While Developer and Release Candidate needs the add-on ``mr.developer``, Live<br>does not it.<br><br><br>Buildout Structure<br>------------------<br><br>Proposed buildout structure::<br><br>    dev.cfg (manual)<br>    rc.cfg (manual)<br>    live.cfg (manual)<br>    etc/base.cfg (manual)<br>    etc/deployment.cfg (manual)<br>    etc/sources-dev.cfg (manual)<br>    etc/sources-rc.cfg (generated)<br>    etc/versions-rc.cfg (generated)<br>    etc/versions-live.cfg (generated)<br>    cfg/versions-global.cfg (manual, optional)<br>    <br>dev.cfg<br>    Contains parts for local development, includes developer tools if<br>    necessary. Included parts:<br><br>    -``base.cfg``<br>    -``versions-global.cfg``<br>    -``sources-dev.cfg``,<br>    -``deployment.cfg``.<br><br>rc.cfg<br>    Contains parts for local on a test-server. Included parts:<br><br>    -``base.cfg``<br>    -``versions-global.cfg``<br>    -``versions-rc.cfg``<br>    -``sources-rc.cfg``,<br>    -``deployment.cfg``.<br><br><br>live.cfg<br>    Contains parts for deployment on a live-server. Included parts:<br><br>    -``base.cfg``<br>    -``versions-global.cfg``<br>    -``versions-live.cfg``<br><br><br><br>base.cfg<br>    contains all common sections and settingsof the buildout needed by all<br>    three types of environment.<br><br>deployment.cfg<br>    Contains deployment specific sections and settings, such as parameters for<br>    deployment and list of managed packages and which dist-server to use.<br><br>global-versions.cfg<br>    Contains the common version section. In smaller projects this can be put in<br>    base.cfg<br><br>sources-dev.cfg<br>    Contains the sources-section for all developer controlled sources.<br><br>sources-rc.cfg<br>    Contains the sources for Release-Candidate setup. This file is generated by<br>    scripts. It points to the automatically created branches.<br><br>versions-rc.cfg<br>    Contains the versions of developer controlled sources used in<br>    rc-deployment. This are the packages which do not need a RC step.<br>    This file is generated by scripts.<br><br>versions-live.cfg<br>    Contains the versions of developer controlled sources used in<br>    live-deployment. This file is generated by scripts.<br><br>Commands<br>--------<br><br>In buildouts bin directory there are two main commands which itself have a<br>bunch of sub commands, the ``deploy`` and the ``bda_deployment_helper``. Latter<br>is rarely used, i.e. you may need it to fix things. So the main tool for the<br>daily usage is ``deploy``:<br><br>``deploy``<br>    main command for all daily tasks<br><br>    subcommands are context sensitive. In Dev environment there are other<br>    commands available than in RC enviroment. So in Dev this are:<br><br>    ``repopasswd``<br>        sets the username/ password for the pypi server<br><br>    ``info``<br>        prints info about managed packages.<br><br>    ``version``<br>        prints version of a package<br><br>    ``candidate``<br>        prepare a release candidate for a package, this includes creation of a<br>        branch<br><br>    ``release``<br>        make a release of a package, this includes tagging and upload to the<br>        index (or local file release) and setting the version in<br>        ``versions-rc.cfg`` and ``versions-live.cfg``.<br><br>    In RC the commands are:<br><br>    ``repopasswd``<br>         see above<br><br>    ``info``<br>         see above<br><br>    ``version``<br>         see above<br><br>    ``release``<br>        make a release of a package, this includes tagging and upload to the<br>        index (or local file release) and setting the version in<br>        ``versions-live.cfg``.<br><br>    ``merge``<br>        merge current trunk/master branch of a package into the rc branch<br><br>All commands and subcommands have a help to find their paramaters.<br><br><br>Source Code<br>===========<br><br>The sources are in a GIT DVCS with its main branches at<br>`github &lt;http://github.com/bluedynamics/bda.recipe.deployment&gt;`_.<br><br>We'd be happy to see many forks and pull-requests to make it even better.<br><br><br>Contributors<br>============<br><br>- Jens W. Klein &lt;jk [at] kleinundpartner [dot] at&gt;<br><br>- Robert Niederrreiter &lt;rnix [at] squarewavea [dot] t&gt;<br><br> <br>License<br>=======<br><br>Copyright (c) 2012, BlueDynamics Alliance, Austria, Switzerland, Germany<br><br>GNU GENERAL PUBLIC LICENSE <br><br>TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION<br><br>0. This License applies to any program or other work which contains<br>   a notice placed by the copyright holder saying it may be distributed<br>   under the terms of this General Public License.  The \"Program\", below,<br>   refers to any such program or work, and a \"work based on the Program\"<br>   means either the Program or any derivative work under copyright law:<br>   that is to say, a work containing the Program or a portion of it,<br>   either verbatim or with modifications and/or translated into another<br>   language.  (Hereinafter, translation is included without limitation in<br>   the term \"modification\".)  Each licensee is addressed as \"you\".<br><br>   Activities other than copying, distribution and modification are not<br>   covered by this License; they are outside its scope.  The act of<br>   running the Program is not restricted, and the output from the Program<br>   is covered only if its contents constitute a work based on the<br>   Program (independent of having been made by running the Program).<br>   Whether that is true depends on what the Program does.<br><br>1. You may copy and distribute verbatim copies of the Program's<br>   source code as you receive it, in any medium, provided that you<br>   conspicuously and appropriately publish on each copy an appropriate<br>   copyright notice and disclaimer of warranty; keep intact all the<br>   notices that refer to this License and to the absence of any warranty;<br>   and give any other recipients of the Program a copy of this License<br>   along with the Program.<br><br>   You may charge a fee for the physical act of transferring a copy, and<br>   you may at your option offer warranty protection in exchange for a fee.<br><br>2  You may modify your copy or copies of the Program or any portion<br>   of it, thus forming a work based on the Program, and copy and<br>   distribute such modifications or work under the terms of Section 1<br>   above, provided that you also meet all of these conditions:<br><br>   a) You must cause the modified files to carry prominent notices<br>   stating that you changed the files and the date of any change.<br><br>   b) You must cause any work that you distribute or publish, that in<br>   whole or in part contains or is derived from the Program or any<br>   part thereof, to be licensed as a whole at no charge to all third<br>   parties under the terms of this License.<br><br>   c) If the modified program normally reads commands interactively<br>   when run, you must cause it, when started running for such<br>   interactive use in the most ordinary way, to print or display an<br>   announcement including an appropriate copyright notice and a<br>   notice that there is no warranty (or else, saying that you provide<br>   a warranty) and that users may redistribute the program under<br>   these conditions, and telling the user how to view a copy of this<br>   License.  (Exception: if the Program itself is interactive but<br>   does not normally print such an announcement, your work based on<br>   the Program is not required to print an announcement.)<br><br>   These requirements apply to the modified work as a whole.  If<br>   identifiable sections of that work are not derived from the Program,<br>   and can be reasonably considered independent and separate works in<br>   themselves, then this License, and its terms, do not apply to those<br>   sections when you distribute them as separate works.  But when you<br>   distribute the same sections as part of a whole which is a work based<br>   on the Program, the distribution of the whole must be on the terms of<br>   this License, whose permissions for other licensees extend to the<br>   entire whole, and thus to each and every part regardless of who wrote it.<br><br>   Thus, it is not the intent of this section to claim rights or contest<br>   your rights to work written entirely by you; rather, the intent is to<br>   exercise the right to control the distribution of derivative or<br>   collective works based on the Program.<br>  <br>   In addition, mere aggregation of another work not based on the Program<br>   with the Program (or with a work based on the Program) on a volume of<br>   a storage or distribution medium does not bring the other work under<br>   the scope of this License.<br><br>3. You may copy and distribute the Program (or a work based on it,<br>   under Section 2) in object code or executable form under the terms of<br>   Sections 1 and 2 above provided that you also do one of the following:<br>   <br>   a) Accompany it with the complete corresponding machine-readable<br>   source code, which must be distributed under the terms of Sections<br>   1 and 2 above on a medium customarily used for software interchange; or, <br><br>   b) Accompany it with a written offer, valid for at least three<br>   years, to give any third party, for a charge no more than your<br>   cost of physically performing source distribution, a complete<br>   machine-readable copy of the corresponding source code, to be<br>   distributed under the terms of Sections 1 and 2 above on a medium<br>   customarily used for software interchange; or, <br><br>   c) Accompany it with the information you received as to the offer<br>   to distribute corresponding source code.  (This alternative is<br>   allowed only for noncommercial distribution and only if you<br>   received the program in object code or executable form with such<br>   an offer, in accord with Subsection b above.)<br><br>   The source code for a work means the preferred form of the work for<br>   making modifications to it.  For an executable work, complete source<br>   code means all the source code for all modules it contains, plus any<br>   associated interface definition files, plus the scripts used to<br>   control compilation and installation of the executable.  However, as a<br>   special exception, the source code distributed need not include<br>   anything that is normally distributed (in either source or binary<br>   form) with the major components (compiler, kernel, and so on) of the<br>   operating system on which the executable runs, unless that component<br>   itself accompanies the executable. <br><br>   If distribution of executable or object code is made by offering<br>   access to copy from a designated place, then offering equivalent<br>   access to copy the source code from the same place counts as<br>   distribution of the source code, even though third parties are not<br>   compelled to copy the source along with the object code. <br><br>4. You may not copy, modify, sublicense, or distribute the Program<br>   except as expressly provided under this License.  Any attempt<br>   otherwise to copy, modify, sublicense or distribute the Program is<br>   void, and will automatically terminate your rights under this License.<br>   However, parties who have received copies, or rights, from you under<br>   this License will not have their licenses terminated so long as such<br>   parties remain in full compliance.<br><br>5. You are not required to accept this License, since you have not<br>   signed it.  However, nothing else grants you permission to modify or<br>   distribute the Program or its derivative works.  These actions are<br>   prohibited by law if you do not accept this License.  Therefore, by<br>   modifying or distributing the Program (or any work based on the<br>   Program), you indicate your acceptance of this License to do so, and<br>   all its terms and conditions for copying, distributing or modifying<br>   the Program or works based on it.<br><br>6. Each time you redistribute the Program (or any work based on the<br>   Program), the recipient automatically receives a license from the<br>   original licensor to copy, distribute or modify the Program subject to<br>   these terms and conditions.  You may not impose any further<br>   restrictions on the recipients' exercise of the rights granted herein.<br>   You are not responsible for enforcing compliance by third parties to<br>   this License.<br><br>7. If, as a consequence of a court judgment or allegation of patent<br>   infringement or for any other reason (not limited to patent issues),<br>   conditions are imposed on you (whether by court order, agreement or<br>   otherwise) that contradict the conditions of this License, they do not<br>   excuse you from the conditions of this License.  If you cannot<br>   distribute so as to satisfy simultaneously your obligations under this<br>   License and any other pertinent obligations, then as a consequence you<br>   may not distribute the Program at all.  For example, if a patent<br>   license would not permit royalty-free redistribution of the Program by<br>   all those who receive copies directly or indirectly through you, then<br>   the only way you could satisfy both it and this License would be to<br>   refrain entirely from distribution of the Program.<br><br>   If any portion of this section is held invalid or unenforceable under<br>   any particular circumstance, the balance of the section is intended to<br>   apply and the section as a whole is intended to apply in other<br>   circumstances.<br> <br>   It is not the purpose of this section to induce you to infringe any<br>   patents or other property right claims or to contest validity of any<br>   such claims; this section has the sole purpose of protecting the<br>   integrity of the free software distribution system, which is<br>   implemented by public license practices.  Many people have made<br>   generous contributions to the wide range of software distributed<br>   through that system in reliance on consistent application of that<br>   system; it is up to the author/donor to decide if he or she is willing<br>   to distribute software through any other system and a licensee cannot<br>   impose that choice.<br><br>   This section is intended to make thoroughly clear what is believed to<br>   be a consequence of the rest of this License.<br><br>8. If the distribution and/or use of the Program is restricted in<br>   certain countries either by patents or by copyrighted interfaces, the<br>   original copyright holder who places the Program under this License<br>   may add an explicit geographical distribution limitation excluding<br>   those countries, so that distribution is permitted only in or among<br>   countries not thus excluded.  In such case, this License incorporates<br>   the limitation as if written in the body of this License.<br> <br>9. The Free Software Foundation may publish revised and/or new versions<br>   of the General Public License from time to time.  Such new versions will<br>   be similar in spirit to the present version, but may differ in detail to<br>   address new problems or concerns.<br> <br>   Each version is given a distinguishing version number.  If the Program<br>   specifies a version number of this License which applies to it and \"any<br>   later version\", you have the option of following the terms and conditions<br>   either of that version or of any later version published by the Free<br>   Software Foundation.  If the Program does not specify a version number of<br>   this License, you may choose any version ever published by the Free Software<br>   Foundation.<br><br>10. If you wish to incorporate parts of the Program into other free<br>    programs whose distribution conditions are different, write to the author<br>    to ask for permission.  For software which is copyrighted by the Free<br>    Software Foundation, write to the Free Software Foundation; we sometimes<br>    make exceptions for this.  Our decision will be guided by the two goals<br>    of preserving the free status of all derivatives of our free software and<br>    of promoting the sharing and reuse of software generally.<br><br>NO WARRANTY<br><br>11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY<br>    FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN<br>    OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES<br>    PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED<br>    OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF<br>    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS<br>    TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE<br>    PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,<br>    REPAIR OR CORRECTION.<br><br>12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING<br>    WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR<br>    REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,<br>    INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING<br>    OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED<br>    TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY<br>    YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER<br>    PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE<br>    POSSIBILITY OF SUCH DAMAGES.<br><br>END OF TERMS AND CONDITIONS\n          </div>"}, "last_serial": 1161857, "releases": {"2.0b3": [{"comment_text": "", "digests": {"md5": "d26456d45e46a5897238a59d765be984", "sha256": "31576f83aa0421be2f8286488e3edff71dfeb9303cd4f25770af42ca2dc6a400"}, "downloads": -1, "filename": "bda.recipe.deployment-2.0b3.tar.gz", "has_sig": false, "md5_digest": "d26456d45e46a5897238a59d765be984", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 33733, "upload_time": "2012-10-29T11:11:15", "upload_time_iso_8601": "2012-10-29T11:11:15.337413Z", "url": "https://files.pythonhosted.org/packages/6e/a2/e86111d5ebaa1eeacd90206826805fb5695f0956d47d4149d5e5880bce48/bda.recipe.deployment-2.0b3.tar.gz", "yanked": false}], "2.0b4": [{"comment_text": "", "digests": {"md5": "03a8b8d3d0167a2c66b65f368e8cd67b", "sha256": "8e5c8a971fd6dda25504f2ccfd24ebf81b428ff9fb675a4ea8624d1f79bb345a"}, "downloads": -1, "filename": "bda.recipe.deployment-2.0b4.tar.gz", "has_sig": false, "md5_digest": "03a8b8d3d0167a2c66b65f368e8cd67b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 31415, "upload_time": "2013-04-25T13:53:36", "upload_time_iso_8601": "2013-04-25T13:53:36.871009Z", "url": "https://files.pythonhosted.org/packages/db/3d/a9a32f8a9c3d6bc1d572e69c0d3f8355ea537063e154ed82d4a3a0f03c8b/bda.recipe.deployment-2.0b4.tar.gz", "yanked": false}], "2.0b5": [{"comment_text": "", "digests": {"md5": "f01f2e629d59b055265acdaab942164b", "sha256": "d675db722fbea6a2a73b73ac3db97ffdacce8749dce782a823b3c3183acbd01f"}, "downloads": -1, "filename": "bda.recipe.deployment-2.0b5.tar.gz", "has_sig": false, "md5_digest": "f01f2e629d59b055265acdaab942164b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 33882, "upload_time": "2013-05-02T14:15:17", "upload_time_iso_8601": "2013-05-02T14:15:17.907266Z", "url": "https://files.pythonhosted.org/packages/09/b0/04156763aa9fdccdd97e1c2c9af17848a2f60ae190b07dcbef394e9efbe8/bda.recipe.deployment-2.0b5.tar.gz", "yanked": false}], "2.0b6": [{"comment_text": "", "digests": {"md5": "05ea41c09f3591aa39677df598cefd86", "sha256": "eb86f71b0d5bae16efacfb29e285a9d5cdf37b94d4ef7b08a64626bd4d96be1f"}, "downloads": -1, "filename": "bda.recipe.deployment-2.0b6.zip", "has_sig": false, "md5_digest": "05ea41c09f3591aa39677df598cefd86", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 45062, "upload_time": "2014-01-30T09:26:31", "upload_time_iso_8601": "2014-01-30T09:26:31.757184Z", "url": "https://files.pythonhosted.org/packages/ca/84/1a3c38d187f4aa216880effae36469ebc483b4c2bb884fe5fd371f41f52c/bda.recipe.deployment-2.0b6.zip", "yanked": false}], "2.0b7": [{"comment_text": "", "digests": {"md5": "6d0f6195fcd9f1521c19b9b9566e6393", "sha256": "a4831037376afcda36f23a02d1bdefded8b0bd02bd7a8bdd07dc720723ca5d26"}, "downloads": -1, "filename": "bda.recipe.deployment-2.0b7.zip", "has_sig": false, "md5_digest": "6d0f6195fcd9f1521c19b9b9566e6393", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 45293, "upload_time": "2014-05-23T10:59:16", "upload_time_iso_8601": "2014-05-23T10:59:16.822930Z", "url": "https://files.pythonhosted.org/packages/11/b0/830fe7a777a75afadff5b94006fde3b3c91d5f15857373c104e7ac4fe555/bda.recipe.deployment-2.0b7.zip", "yanked": false}], "2.0b8": [{"comment_text": "", "digests": {"md5": "7ee399aa26fbfbef0f597413013355fb", "sha256": "f46e533031f8a31d8f0b3dd5796f60169aea84cae1252ed1c5342227aebbbf3f"}, "downloads": -1, "filename": "bda.recipe.deployment-2.0b8.tar.gz", "has_sig": false, "md5_digest": "7ee399aa26fbfbef0f597413013355fb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 24012, "upload_time": "2014-07-18T14:46:12", "upload_time_iso_8601": "2014-07-18T14:46:12.342418Z", "url": "https://files.pythonhosted.org/packages/a8/d7/4edf3468712bf6b1c72f1060f3b4aafd07164a3332882692e156e70c8287/bda.recipe.deployment-2.0b8.tar.gz", "yanked": false}], "2.0beta": [{"comment_text": "", "digests": {"md5": "a4c313dd129e0895eb8d79e1b692e966", "sha256": "44dc131d616892b23c012a1e86b5628381443644dda2aca6ae07c37a2d1f3fcf"}, "downloads": -1, "filename": "bda.recipe.deployment-2.0beta.tar.gz", "has_sig": false, "md5_digest": "a4c313dd129e0895eb8d79e1b692e966", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 31501, "upload_time": "2012-09-11T16:04:41", "upload_time_iso_8601": "2012-09-11T16:04:41.551261Z", "url": "https://files.pythonhosted.org/packages/21/ea/ea8bce5fe440a907442c69fbff338c70f4214b21797325a036044e20c1a5/bda.recipe.deployment-2.0beta.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "a4c313dd129e0895eb8d79e1b692e966", "sha256": "44dc131d616892b23c012a1e86b5628381443644dda2aca6ae07c37a2d1f3fcf"}, "downloads": -1, "filename": "bda.recipe.deployment-2.0beta.tar.gz", "has_sig": false, "md5_digest": "a4c313dd129e0895eb8d79e1b692e966", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 31501, "upload_time": "2012-09-11T16:04:41", "upload_time_iso_8601": "2012-09-11T16:04:41.551261Z", "url": "https://files.pythonhosted.org/packages/21/ea/ea8bce5fe440a907442c69fbff338c70f4214b21797325a036044e20c1a5/bda.recipe.deployment-2.0beta.tar.gz", "yanked": false}], "timestamp": "Thu May  7 18:14:35 2020"}