{"info": {"author": "Nikita Kitaev", "author_email": "kitaev@cs.berkeley.edu", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: Apache Software License", "Operating System :: OS Independent", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Topic :: Scientific/Engineering :: Artificial Intelligence", "Topic :: Text Processing :: Linguistic"], "description": "# Berkeley Neural Parser\n\nA high-accuracy parser with models for 11 languages, implemented in Python. Based on [Constituency Parsing with a Self-Attentive Encoder](https://arxiv.org/abs/1805.01052) from ACL 2018, with additional changes described in [Multilingual Constituency Parsing with Self-Attention and Pre-Training](https://arxiv.org/abs/1812.11760).\n\n## Contents\n1. [Installation](#installation)\n2. [Usage](#usage)\n3. [Available Models](#available-models)\n4. [Training](#training)\n5. [Reproducing Experiments](#reproducing-experiments)\n6. [Citation](#citation)\n7. [Credits](#credits)\n\nIf you are primarily interested in training your own parsing models, skip to the [Training](#training) section of this README.\n\n## Installation\n\nTo install the parser, run the commands:\n```bash\n$ pip install cython numpy\n$ pip install benepar[cpu]\n```\n\nCython and numpy should be installed separately prior to installing benepar. Note that `pip install benepar[cpu]` has a dependency on the `tensorflow` pip package, which is a CPU-only version of tensorflow. Use `pip install benepar[gpu]` to instead introduce a dependency on `tensorflow-gpu`. Installing a GPU-enabled version of TensorFlow will likely require additional steps; see the [official TensorFlow installation instructions](https://www.tensorflow.org/install/) for details.\n\nBenepar integrates with one of two NLP libraries for Python: [NLTK](http://www.nltk.org/) or [spaCy](https://spacy.io/).\n\nIf using NLTK, you should install the NLTK sentence and word tokenizers:\n```python\n>>> import nltk\n>>> nltk.download('punkt')\n```\n\nIf using spaCy, you should install a spaCy model for your language. For English, the installation command is:\n```sh\n$ python -m spacy download en\n```\n\nParsing models need to be downloaded separately, using the commands:\n```python\n>>> import benepar\n>>> benepar.download('benepar_en2')\n```\n\nSee the [Available Models](#available-models) section below for a full list of models.\n\n## Usage\n### Usage with NLTK\n\n```python\n>>> import benepar\n>>> parser = benepar.Parser(\"benepar_en2\")\n>>> tree = parser.parse(\"Short cuts make long delays.\")\n>>> print(tree)\n(S\n  (NP (JJ Short) (NNS cuts))\n  (VP (VBP make) (NP (JJ long) (NNS delays)))\n  (. .))\n```\n\nSpeed note: the first call to `parse` will take much longer that subsequent calls, as caches are being warmed up.\n\nThe parser can also parse pre-tokenized text. For some languages (including Chinese), this is required due to the lack of a built-in tokenizer.\n```python\n>>> parser.parse(['Short', 'cuts', 'make', 'long', 'delays', '.'])\n```\n\nUse `parse_sents` to parse multiple sentences. It accepts an entire document as a string, or a list of sentences.\n```python\n>>> parser.parse_sents(\"The time for action is now. It's never too late to do something.\")\n>>> parser.parse_sents([\"The time for action is now.\", \"It's never too late to do something.\"])\n>>> parser.parse_sents([['The', 'time', 'for', 'action', 'is', 'now', '.'], ['It', \"'s\", 'never', 'too', 'late', 'to', 'do', 'something', '.']])\n```\n\nAll parse trees returned are represented using `nltk.Tree` objects.\n\n### Usage with spaCy\n\nBenepar also ships with a component that integrates with spaCy:\n```python\n>>> import spacy\n>>> from benepar.spacy_plugin import BeneparComponent\n>>> nlp = spacy.load('en')\n>>> nlp.add_pipe(BeneparComponent(\"benepar_en2\"))\n>>> doc = nlp(u\"The time for action is now. It's never too late to do something.\")\n>>> sent = list(doc.sents)[0]\n>>> print(sent._.parse_string)\n(S (NP (NP (DT The) (NN time)) (PP (IN for) (NP (NN action)))) (VP (VBZ is) (ADVP (RB now))) (. .))\n>>> sent._.labels\n('S',)\n>>> list(sent._.children)[0]\nThe time for action\n```\n\nSince spaCy does not provide an official constituency parsing API, all methods are accessible through the extension namespaces `Span._` and `Token._`.\n\nThe following extension properties are available:\n- `Span._.labels`: a tuple of labels for the given span. A span may have multiple labels when there are unary chains in the parse tree.\n- `Span._.parse_string`: a string representation of the parse tree for a given span.\n- `Span._.constituents`: an iterator over `Span` objects for sub-constituents in a pre-order traversal of the parse tree.\n- `Span._.parent`: the parent `Span` in the parse tree.\n- `Span._.children`: an iterator over child `Span`s in the parse tree.\n- `Token._.labels`, `Token._.parse_string`, `Token._.parent`: these behave the same as calling the corresponding method on the length-one Span containing the token.\n\nThese methods will raise an exception when called on a span that is not a constituent in the parse tree. Such errors can be avoided by traversing the parse tree starting at either sentence level (by iterating over `doc.sents`) or with an individual `Token` object.\n\n## Available Models\n\nThe following trained parser models are available:\n\nModel       | Language | Info\n----------- | -------- | ----\n`benepar_en2` | English | 95.17 F1 on WSJ test set, 94 MB on disk.\n`benepar_en2_large` | English | 95.52 F1 on WSJ test set, 274 MB on disk. This model is up to 3x slower than `benepar_en2` when running on CPU; we recommend running it on a GPU instead.\n`benepar_zh` | Chinese | 91.69 F1 on CTB 5.1 test set. Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Use a package such as [jieba](https://github.com/fxsjy/jieba) for tokenization. Usage with spaCy first requires implementing Chinese support in spaCy. There is no official Chinese support in spaCy at the time of writing, but unofficial packages such as [this one](https://github.com/howl-anderson/Chinese_models_for_SpaCy) may work.\n`benepar_ar` | Arabic | Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Usage with spaCy first requires implementing Arabic support in spaCy. Accepts Unicode as input, but was trained on transliterated text (see `src/transliterate.py`); please let us know if there are any bugs.\n`benepar_de` | German | Full support for NLTK and spaCy; use `python -m spacy download de` to download spaCy model for German.\n`benepar_eu` | Basque | Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Usage with spaCy first requires implementing Basque support in spaCy.\n`benepar_fr` | French | Full support for NLTK and spaCy; use `python -m spacy download fr` to download spaCy model for French.\n`benepar_he` | Hebrew | Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Usage with spaCy first requires implementing Hebrew support in spaCy. Accepts Unicode as input, but was trained on transliterated text (see `src/transliterate.py`); please let us know if there are any bugs.\n`benepar_hu` | Hungarian | Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Usage with spaCy first requires implementing Hungarian support in spaCy.\n`benepar_ko` | Korean | Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Usage with spaCy first requires implementing Korean support in spaCy.\n`benepar_pl` | Polish | Full support for NLTK (including parsing from raw text.) Usage with spaCy first requires implementing Polish support in spaCy.\n`benepar_sv` | Swedish | Full support for NLTK (including parsing from raw text.) Usage with spaCy first requires implementing Swedish support in spaCy.\n`benepar_en` | English | **No part-of-speech tagging capabilities**: we recommend using `benepar_en2` instead. When using this model, part-of-speech tags will be inherited from either NLTK (requires `nltk.download('averaged_perceptron_tagger')`) or spaCy; however, we've found that our own tagger in models such as `benepar_en2` gives better results. This model was released to accompany our ACL 2018 paper, and is retained for compatibility. 95.07 F1 on WSJ test set.\n`benepar_en_small` | English | **No part-of-speech tagging capabilities**: we recommend using `benepar_en2` instead. This model was released to accompany our ACL 2018 paper, and is retained for compatibility. A smaller model that is 3-4x faster than the `benepar_en` when running on CPU because it uses a smaller version of ELMo. 94.65 F1 on WSJ test set.\n`benepar_en_ensemble` | English | **No part-of-speech tagging capabilities**: we recommend using `benepar_en2_large` instead. This model was released to accompany our ACL 2018 paper, and is retained for compatibility. An ensemble of two parsers: one that uses the original ELMo embeddings and one that uses the 5.5B ELMo embeddings. A GPU is highly recommended for running the ensemble. 95.43 F1 on WSJ test set.\n\n\n## Training\n\nThe code used to train our parsing models is currently different from the code used to parse sentences in the release version described above, though both are stored in this repository. The training code uses PyTorch and can be obtained by cloning this repository from GitHub. The release version uses TensorFlow instead, because it allows serializing the parsing model into a single file on disk in a way that minimizes software dependencies and reduces file size on disk.\n\n#### Software Requirements for Training\n* Python 3.6 or higher.\n* Cython 0.25.2 or any compatible version.\n* [PyTorch](http://pytorch.org/) 0.4.1. This code has not been tested with PyTorch 1.0, but it should work.\n* [EVALB](http://nlp.cs.nyu.edu/evalb/). Before starting, run `make` inside the `EVALB/` directory to compile an `evalb` executable. This will be called from Python for evaluation. If training on the SPMRL datasets, you will need to run `make` inside the `EVALB_SPMRL/` directory instead.\n* [AllenNLP](http://allennlp.org/) 0.7.0 or any compatible version (only required when using ELMo word representations)\n* [pytorch-pretrained-bert](https://github.com/huggingface/pytorch-pretrained-BERT) 0.4.0 or any compatible version (only required when using BERT word representations)\n\n#### Pre-trained Models (PyTorch)\n\nThe following pre-trained parser models are available for download:\n* [`en_charlstm_dev.93.61.pt`](https://github.com/nikitakit/self-attentive-parser/releases/download/models/en_charlstm_dev.93.61.pt): Our best English single-system parser that does not rely on external word representations\n* [`en_elmo_dev.95.21.pt`](https://github.com/nikitakit/self-attentive-parser/releases/download/models/en_elmo_dev.95.21.pt): The best English single-system parser from our ACL 2018 paper. Using this parser requires ELMo weights, which must be downloaded separately.\n\nTo use ELMo embeddings, download the following files into the `data/` folder (preserving their names):\n\n* [`elmo_2x4096_512_2048cnn_2xhighway_options.json`](https://s3-us-west-2.amazonaws.com/allennlp/models/elmo/2x4096_512_2048cnn_2xhighway/elmo_2x4096_512_2048cnn_2xhighway_options.json)\n* [`elmo_2x4096_512_2048cnn_2xhighway_weights.hdf5`](https://s3-us-west-2.amazonaws.com/allennlp/models/elmo/2x4096_512_2048cnn_2xhighway/elmo_2x4096_512_2048cnn_2xhighway_weights.hdf5)\n\nThere is currently no command-line option for configuring the locations/names of the ELMo files.\n\nPre-trained BERT weights will be automatically downloaded as needed by the `pytorch-pretrained-bert` package.\n\n### Training Instructions\n\nA new model can be trained using the command `python src/main.py train ...`. Some of the available arguments are:\n\nArgument | Description | Default\n--- | --- | ---\n`--model-path-base` | Path base to use for saving models | N/A\n`--evalb-dir` |  Path to EVALB directory | `EVALB/`\n`--train-path` | Path to training trees | `data/02-21.10way.clean`\n`--dev-path` | Path to development trees | `data/22.auto.clean`\n`--batch-size` | Number of examples per training update | 250\n`--checks-per-epoch` | Number of development evaluations per epoch | 4\n`--subbatch-max-tokens` | Maximum number of words to process in parallel while training (a full batch may not fit in GPU memory) | 2000\n`--eval-batch-size` | Number of examples to process in parallel when evaluating on the development set | 100\n`--numpy-seed` | NumPy random seed | Random\n`--use-words` | Use learned word embeddings | Do not use word embeddings\n`--use-tags` | Use predicted part-of-speech tags as input | Do not use predicted tags\n`--use-chars-lstm` | Use learned CharLSTM word representations | Do not use CharLSTM\n`--use-elmo` | Use pre-trained ELMo word representations | Do not use ELMo\n`--use-bert` | Use pre-trained BERT word representations | Do not use BERT\n`--bert-model` | Pre-trained BERT model to use if `--use-bert` is passed | `bert-base-uncased`\n`--no-bert-do-lower-case` | Instructs the BERT tokenizer to retain case information (setting should match the BERT model in use) | Perform lowercasing\n`--predict-tags` | Adds a part-of-speech tagging component and auxiliary loss to the parser | Do not predict tags\n\nAdditional arguments are available for other hyperparameters; see `make_hparams()` in `src/main.py`. These can be specified on the command line, such as `--num-layers 2` (for numerical parameters), `--use-tags` (for boolean parameters that default to False), or `--no-partitioned` (for boolean parameters that default to True).\n\nIf `--use-tags` is passed, the training and development trees are assumed to have predicted part-of-speech tags. If `--predict-tags` is passed, the data is assumed to have ground-truth tags instead. As a result, these two options can't be used simultaneously. Note that the files we provide in the `data/` folder have predicted tags, and that data with gold tags must be obtained separately.\n\nFor each development evaluation, the F-score on the development set is computed and compared to the previous best. If the current model is better, the previous model will be deleted and the current model will be saved. The new filename will be derived from the provided model path base and the development F-score.\n\nAs an example, to train an English parser using the default hyperparameters, you can use the command:\n\n```\npython src/main.py train --use-words --use-chars-lstm --model-path-base models/en_charlstm --d-char-emb 64\n```\n\nTo train an English parser that uses ELMo embeddings, the command is:\n\n```\npython src/main.py train --use-elmo --model-path-base models/en_elmo --num-layers 4\n```\n\nTo train an English parser that uses BERT, the command is:\n\n```\npython src/main.py train --use-bert --model-path-base models/en_bert --bert-model \"bert-large-uncased\" --num-layers 2 --learning-rate 0.00005 --batch-size 32 --eval-batch-size 16 --subbatch-max-tokens 500\n```\n\n### Evaluation Instructions\n\nA saved model can be evaluated on a test corpus using the command `python src/main.py test ...` with the following arguments:\n\nArgument | Description | Default\n--- | --- | ---\n`--model-path-base` | Path base of saved model | N/A\n`--evalb-dir` |  Path to EVALB directory | `EVALB/`\n`--test-path` | Path to test trees | `data/23.auto.clean`\n`--test-path-raw` | Alternative path to test trees that is used for evalb only (used to double-check that evaluation against pre-processed trees does not contain any bugs) | Compare to trees from `--test-path`\n`--eval-batch-size` | Number of examples to process in parallel when evaluating on the test set | 100\n\nIf the parser was trained to have predicted part-of-speech tags as input (via the `--use-tags` flag) the test trees are assumed to have predicted part-of-speech tags. Otherwise, the tags in the test trees are not used as input to the parser.\n\nAs an example, after extracting the pre-trained model, you can evaluate it on the test set using the following command:\n\n```\npython src/main.py test --model-path-base models/nk_base6_lstm_dev.93.61.pt\n```\n\nThe pre-trained model with CharLSTM embeddings obtains F-scores of 93.61 on the development set and 93.55 on the test set. The pre-trained model with ELMo embeddings obtains F-scores of 95.21 on the development set and 95.13 on the test set.\n\n### Using the Trained Models\n\nSee the `run_parse` function in `src/main.py` for an example of how a parser can be loaded from disk and used to parse sentences using the PyTorch codebase.\n\nThe `export/export.py` file contains the code we used to convert our ELMo-based parser to a TensorFlow graph (for use in the release version of the parser). For our BERT-based parsers, consult `export/export_bert.py` instead. This exporting code hard-codes certain hyperparameter choices, so you will likely need to tweak it to export your own models. Exporting the model to TensorFlow allows it to be stored in a single file, including all ELMo/BERT weights. We also use TensorFlow's graph transforms to shrink the model size on disk with only a tiny impact on parsing accuracy: the compressed ELMo model obtains an F1-score of 95.07 on the test set, compared to 95.13 for the uncompressed model.\n\n## Reproducing Experiments\n\nThe code used for our ACL 2018 paper is tagged `acl2018` in git. The `EXPERIMENTS.md` file in that version of the code contains additional notes about the command-line arguments we used to perform the experiments reported in our ACL 2018 paper.\n\nThe version of the code currently in this repository has added new features (such as BERT support and part-of-speech tag prediction), eliminated some of the less-performant parser variations (e.g. the CharConcat word representation), and has updated to a newer version of PyTorch. The `EXPERIMENTS.md` file now describes the commands used to train our best-performing single-system parser for each language that we evaluate on.\n\n## Citation\n\nIf you use this software for research, please cite our paper as follows:\n\n```\n@InProceedings{Kitaev-2018-SelfAttentive,\n  author    = {Kitaev, Nikita and Klein, Dan},\n  title     = {Constituency Parsing with a Self-Attentive Encoder},\n  booktitle = {Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)},\n  month     = {July},\n  year      = {2018},\n  address   = {Melbourne, Australia},\n  publisher = {Association for Computational Linguistics},\n}\n```\n\n## Credits\n\nThe code in this repository and portions of this README are based on https://github.com/mitchellstern/minimal-span-parser", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/nikitakit/self-attentive-parser", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "benepar", "package_url": "https://pypi.org/project/benepar/", "platform": "", "project_url": "https://pypi.org/project/benepar/", "project_urls": {"Homepage": "https://github.com/nikitakit/self-attentive-parser"}, "release_url": "https://pypi.org/project/benepar/0.1.2/", "requires_dist": null, "requires_python": "", "summary": "Berkeley Neural Parser", "version": "0.1.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Berkeley Neural Parser</h1>\n<p>A high-accuracy parser with models for 11 languages, implemented in Python. Based on <a href=\"https://arxiv.org/abs/1805.01052\" rel=\"nofollow\">Constituency Parsing with a Self-Attentive Encoder</a> from ACL 2018, with additional changes described in <a href=\"https://arxiv.org/abs/1812.11760\" rel=\"nofollow\">Multilingual Constituency Parsing with Self-Attention and Pre-Training</a>.</p>\n<h2>Contents</h2>\n<ol>\n<li><a href=\"#installation\" rel=\"nofollow\">Installation</a></li>\n<li><a href=\"#usage\" rel=\"nofollow\">Usage</a></li>\n<li><a href=\"#available-models\" rel=\"nofollow\">Available Models</a></li>\n<li><a href=\"#training\" rel=\"nofollow\">Training</a></li>\n<li><a href=\"#reproducing-experiments\" rel=\"nofollow\">Reproducing Experiments</a></li>\n<li><a href=\"#citation\" rel=\"nofollow\">Citation</a></li>\n<li><a href=\"#credits\" rel=\"nofollow\">Credits</a></li>\n</ol>\n<p>If you are primarily interested in training your own parsing models, skip to the <a href=\"#training\" rel=\"nofollow\">Training</a> section of this README.</p>\n<h2>Installation</h2>\n<p>To install the parser, run the commands:</p>\n<pre>$ pip install cython numpy\n$ pip install benepar<span class=\"o\">[</span>cpu<span class=\"o\">]</span>\n</pre>\n<p>Cython and numpy should be installed separately prior to installing benepar. Note that <code>pip install benepar[cpu]</code> has a dependency on the <code>tensorflow</code> pip package, which is a CPU-only version of tensorflow. Use <code>pip install benepar[gpu]</code> to instead introduce a dependency on <code>tensorflow-gpu</code>. Installing a GPU-enabled version of TensorFlow will likely require additional steps; see the <a href=\"https://www.tensorflow.org/install/\" rel=\"nofollow\">official TensorFlow installation instructions</a> for details.</p>\n<p>Benepar integrates with one of two NLP libraries for Python: <a href=\"http://www.nltk.org/\" rel=\"nofollow\">NLTK</a> or <a href=\"https://spacy.io/\" rel=\"nofollow\">spaCy</a>.</p>\n<p>If using NLTK, you should install the NLTK sentence and word tokenizers:</p>\n<pre><span class=\"o\">&gt;&gt;&gt;</span> <span class=\"kn\">import</span> <span class=\"nn\">nltk</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">nltk</span><span class=\"o\">.</span><span class=\"n\">download</span><span class=\"p\">(</span><span class=\"s1\">'punkt'</span><span class=\"p\">)</span>\n</pre>\n<p>If using spaCy, you should install a spaCy model for your language. For English, the installation command is:</p>\n<pre>$ python -m spacy download en\n</pre>\n<p>Parsing models need to be downloaded separately, using the commands:</p>\n<pre><span class=\"o\">&gt;&gt;&gt;</span> <span class=\"kn\">import</span> <span class=\"nn\">benepar</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">benepar</span><span class=\"o\">.</span><span class=\"n\">download</span><span class=\"p\">(</span><span class=\"s1\">'benepar_en2'</span><span class=\"p\">)</span>\n</pre>\n<p>See the <a href=\"#available-models\" rel=\"nofollow\">Available Models</a> section below for a full list of models.</p>\n<h2>Usage</h2>\n<h3>Usage with NLTK</h3>\n<pre><span class=\"o\">&gt;&gt;&gt;</span> <span class=\"kn\">import</span> <span class=\"nn\">benepar</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">parser</span> <span class=\"o\">=</span> <span class=\"n\">benepar</span><span class=\"o\">.</span><span class=\"n\">Parser</span><span class=\"p\">(</span><span class=\"s2\">\"benepar_en2\"</span><span class=\"p\">)</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">tree</span> <span class=\"o\">=</span> <span class=\"n\">parser</span><span class=\"o\">.</span><span class=\"n\">parse</span><span class=\"p\">(</span><span class=\"s2\">\"Short cuts make long delays.\"</span><span class=\"p\">)</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">tree</span><span class=\"p\">)</span>\n<span class=\"p\">(</span><span class=\"n\">S</span>\n  <span class=\"p\">(</span><span class=\"n\">NP</span> <span class=\"p\">(</span><span class=\"n\">JJ</span> <span class=\"n\">Short</span><span class=\"p\">)</span> <span class=\"p\">(</span><span class=\"n\">NNS</span> <span class=\"n\">cuts</span><span class=\"p\">))</span>\n  <span class=\"p\">(</span><span class=\"n\">VP</span> <span class=\"p\">(</span><span class=\"n\">VBP</span> <span class=\"n\">make</span><span class=\"p\">)</span> <span class=\"p\">(</span><span class=\"n\">NP</span> <span class=\"p\">(</span><span class=\"n\">JJ</span> <span class=\"n\">long</span><span class=\"p\">)</span> <span class=\"p\">(</span><span class=\"n\">NNS</span> <span class=\"n\">delays</span><span class=\"p\">)))</span>\n  <span class=\"p\">(</span><span class=\"o\">.</span> <span class=\"o\">.</span><span class=\"p\">))</span>\n</pre>\n<p>Speed note: the first call to <code>parse</code> will take much longer that subsequent calls, as caches are being warmed up.</p>\n<p>The parser can also parse pre-tokenized text. For some languages (including Chinese), this is required due to the lack of a built-in tokenizer.</p>\n<pre><span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">parser</span><span class=\"o\">.</span><span class=\"n\">parse</span><span class=\"p\">([</span><span class=\"s1\">'Short'</span><span class=\"p\">,</span> <span class=\"s1\">'cuts'</span><span class=\"p\">,</span> <span class=\"s1\">'make'</span><span class=\"p\">,</span> <span class=\"s1\">'long'</span><span class=\"p\">,</span> <span class=\"s1\">'delays'</span><span class=\"p\">,</span> <span class=\"s1\">'.'</span><span class=\"p\">])</span>\n</pre>\n<p>Use <code>parse_sents</code> to parse multiple sentences. It accepts an entire document as a string, or a list of sentences.</p>\n<pre><span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">parser</span><span class=\"o\">.</span><span class=\"n\">parse_sents</span><span class=\"p\">(</span><span class=\"s2\">\"The time for action is now. It's never too late to do something.\"</span><span class=\"p\">)</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">parser</span><span class=\"o\">.</span><span class=\"n\">parse_sents</span><span class=\"p\">([</span><span class=\"s2\">\"The time for action is now.\"</span><span class=\"p\">,</span> <span class=\"s2\">\"It's never too late to do something.\"</span><span class=\"p\">])</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">parser</span><span class=\"o\">.</span><span class=\"n\">parse_sents</span><span class=\"p\">([[</span><span class=\"s1\">'The'</span><span class=\"p\">,</span> <span class=\"s1\">'time'</span><span class=\"p\">,</span> <span class=\"s1\">'for'</span><span class=\"p\">,</span> <span class=\"s1\">'action'</span><span class=\"p\">,</span> <span class=\"s1\">'is'</span><span class=\"p\">,</span> <span class=\"s1\">'now'</span><span class=\"p\">,</span> <span class=\"s1\">'.'</span><span class=\"p\">],</span> <span class=\"p\">[</span><span class=\"s1\">'It'</span><span class=\"p\">,</span> <span class=\"s2\">\"'s\"</span><span class=\"p\">,</span> <span class=\"s1\">'never'</span><span class=\"p\">,</span> <span class=\"s1\">'too'</span><span class=\"p\">,</span> <span class=\"s1\">'late'</span><span class=\"p\">,</span> <span class=\"s1\">'to'</span><span class=\"p\">,</span> <span class=\"s1\">'do'</span><span class=\"p\">,</span> <span class=\"s1\">'something'</span><span class=\"p\">,</span> <span class=\"s1\">'.'</span><span class=\"p\">]])</span>\n</pre>\n<p>All parse trees returned are represented using <code>nltk.Tree</code> objects.</p>\n<h3>Usage with spaCy</h3>\n<p>Benepar also ships with a component that integrates with spaCy:</p>\n<pre><span class=\"o\">&gt;&gt;&gt;</span> <span class=\"kn\">import</span> <span class=\"nn\">spacy</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"kn\">from</span> <span class=\"nn\">benepar.spacy_plugin</span> <span class=\"kn\">import</span> <span class=\"n\">BeneparComponent</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">nlp</span> <span class=\"o\">=</span> <span class=\"n\">spacy</span><span class=\"o\">.</span><span class=\"n\">load</span><span class=\"p\">(</span><span class=\"s1\">'en'</span><span class=\"p\">)</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">nlp</span><span class=\"o\">.</span><span class=\"n\">add_pipe</span><span class=\"p\">(</span><span class=\"n\">BeneparComponent</span><span class=\"p\">(</span><span class=\"s2\">\"benepar_en2\"</span><span class=\"p\">))</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">doc</span> <span class=\"o\">=</span> <span class=\"n\">nlp</span><span class=\"p\">(</span><span class=\"sa\">u</span><span class=\"s2\">\"The time for action is now. It's never too late to do something.\"</span><span class=\"p\">)</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">sent</span> <span class=\"o\">=</span> <span class=\"nb\">list</span><span class=\"p\">(</span><span class=\"n\">doc</span><span class=\"o\">.</span><span class=\"n\">sents</span><span class=\"p\">)[</span><span class=\"mi\">0</span><span class=\"p\">]</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">sent</span><span class=\"o\">.</span><span class=\"n\">_</span><span class=\"o\">.</span><span class=\"n\">parse_string</span><span class=\"p\">)</span>\n<span class=\"p\">(</span><span class=\"n\">S</span> <span class=\"p\">(</span><span class=\"n\">NP</span> <span class=\"p\">(</span><span class=\"n\">NP</span> <span class=\"p\">(</span><span class=\"n\">DT</span> <span class=\"n\">The</span><span class=\"p\">)</span> <span class=\"p\">(</span><span class=\"n\">NN</span> <span class=\"n\">time</span><span class=\"p\">))</span> <span class=\"p\">(</span><span class=\"n\">PP</span> <span class=\"p\">(</span><span class=\"n\">IN</span> <span class=\"k\">for</span><span class=\"p\">)</span> <span class=\"p\">(</span><span class=\"n\">NP</span> <span class=\"p\">(</span><span class=\"n\">NN</span> <span class=\"n\">action</span><span class=\"p\">))))</span> <span class=\"p\">(</span><span class=\"n\">VP</span> <span class=\"p\">(</span><span class=\"n\">VBZ</span> <span class=\"ow\">is</span><span class=\"p\">)</span> <span class=\"p\">(</span><span class=\"n\">ADVP</span> <span class=\"p\">(</span><span class=\"n\">RB</span> <span class=\"n\">now</span><span class=\"p\">)))</span> <span class=\"p\">(</span><span class=\"o\">.</span> <span class=\"o\">.</span><span class=\"p\">))</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"n\">sent</span><span class=\"o\">.</span><span class=\"n\">_</span><span class=\"o\">.</span><span class=\"n\">labels</span>\n<span class=\"p\">(</span><span class=\"s1\">'S'</span><span class=\"p\">,)</span>\n<span class=\"o\">&gt;&gt;&gt;</span> <span class=\"nb\">list</span><span class=\"p\">(</span><span class=\"n\">sent</span><span class=\"o\">.</span><span class=\"n\">_</span><span class=\"o\">.</span><span class=\"n\">children</span><span class=\"p\">)[</span><span class=\"mi\">0</span><span class=\"p\">]</span>\n<span class=\"n\">The</span> <span class=\"n\">time</span> <span class=\"k\">for</span> <span class=\"n\">action</span>\n</pre>\n<p>Since spaCy does not provide an official constituency parsing API, all methods are accessible through the extension namespaces <code>Span._</code> and <code>Token._</code>.</p>\n<p>The following extension properties are available:</p>\n<ul>\n<li><code>Span._.labels</code>: a tuple of labels for the given span. A span may have multiple labels when there are unary chains in the parse tree.</li>\n<li><code>Span._.parse_string</code>: a string representation of the parse tree for a given span.</li>\n<li><code>Span._.constituents</code>: an iterator over <code>Span</code> objects for sub-constituents in a pre-order traversal of the parse tree.</li>\n<li><code>Span._.parent</code>: the parent <code>Span</code> in the parse tree.</li>\n<li><code>Span._.children</code>: an iterator over child <code>Span</code>s in the parse tree.</li>\n<li><code>Token._.labels</code>, <code>Token._.parse_string</code>, <code>Token._.parent</code>: these behave the same as calling the corresponding method on the length-one Span containing the token.</li>\n</ul>\n<p>These methods will raise an exception when called on a span that is not a constituent in the parse tree. Such errors can be avoided by traversing the parse tree starting at either sentence level (by iterating over <code>doc.sents</code>) or with an individual <code>Token</code> object.</p>\n<h2>Available Models</h2>\n<p>The following trained parser models are available:</p>\n<table>\n<thead>\n<tr>\n<th>Model</th>\n<th>Language</th>\n<th>Info</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>benepar_en2</code></td>\n<td>English</td>\n<td>95.17 F1 on WSJ test set, 94 MB on disk.</td>\n</tr>\n<tr>\n<td><code>benepar_en2_large</code></td>\n<td>English</td>\n<td>95.52 F1 on WSJ test set, 274 MB on disk. This model is up to 3x slower than <code>benepar_en2</code> when running on CPU; we recommend running it on a GPU instead.</td>\n</tr>\n<tr>\n<td><code>benepar_zh</code></td>\n<td>Chinese</td>\n<td>91.69 F1 on CTB 5.1 test set. Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Use a package such as <a href=\"https://github.com/fxsjy/jieba\" rel=\"nofollow\">jieba</a> for tokenization. Usage with spaCy first requires implementing Chinese support in spaCy. There is no official Chinese support in spaCy at the time of writing, but unofficial packages such as <a href=\"https://github.com/howl-anderson/Chinese_models_for_SpaCy\" rel=\"nofollow\">this one</a> may work.</td>\n</tr>\n<tr>\n<td><code>benepar_ar</code></td>\n<td>Arabic</td>\n<td>Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Usage with spaCy first requires implementing Arabic support in spaCy. Accepts Unicode as input, but was trained on transliterated text (see <code>src/transliterate.py</code>); please let us know if there are any bugs.</td>\n</tr>\n<tr>\n<td><code>benepar_de</code></td>\n<td>German</td>\n<td>Full support for NLTK and spaCy; use <code>python -m spacy download de</code> to download spaCy model for German.</td>\n</tr>\n<tr>\n<td><code>benepar_eu</code></td>\n<td>Basque</td>\n<td>Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Usage with spaCy first requires implementing Basque support in spaCy.</td>\n</tr>\n<tr>\n<td><code>benepar_fr</code></td>\n<td>French</td>\n<td>Full support for NLTK and spaCy; use <code>python -m spacy download fr</code> to download spaCy model for French.</td>\n</tr>\n<tr>\n<td><code>benepar_he</code></td>\n<td>Hebrew</td>\n<td>Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Usage with spaCy first requires implementing Hebrew support in spaCy. Accepts Unicode as input, but was trained on transliterated text (see <code>src/transliterate.py</code>); please let us know if there are any bugs.</td>\n</tr>\n<tr>\n<td><code>benepar_hu</code></td>\n<td>Hungarian</td>\n<td>Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Usage with spaCy first requires implementing Hungarian support in spaCy.</td>\n</tr>\n<tr>\n<td><code>benepar_ko</code></td>\n<td>Korean</td>\n<td>Usage with NLTK requires tokenized sentences (untokenized raw text is not supported.) Usage with spaCy first requires implementing Korean support in spaCy.</td>\n</tr>\n<tr>\n<td><code>benepar_pl</code></td>\n<td>Polish</td>\n<td>Full support for NLTK (including parsing from raw text.) Usage with spaCy first requires implementing Polish support in spaCy.</td>\n</tr>\n<tr>\n<td><code>benepar_sv</code></td>\n<td>Swedish</td>\n<td>Full support for NLTK (including parsing from raw text.) Usage with spaCy first requires implementing Swedish support in spaCy.</td>\n</tr>\n<tr>\n<td><code>benepar_en</code></td>\n<td>English</td>\n<td><strong>No part-of-speech tagging capabilities</strong>: we recommend using <code>benepar_en2</code> instead. When using this model, part-of-speech tags will be inherited from either NLTK (requires <code>nltk.download('averaged_perceptron_tagger')</code>) or spaCy; however, we've found that our own tagger in models such as <code>benepar_en2</code> gives better results. This model was released to accompany our ACL 2018 paper, and is retained for compatibility. 95.07 F1 on WSJ test set.</td>\n</tr>\n<tr>\n<td><code>benepar_en_small</code></td>\n<td>English</td>\n<td><strong>No part-of-speech tagging capabilities</strong>: we recommend using <code>benepar_en2</code> instead. This model was released to accompany our ACL 2018 paper, and is retained for compatibility. A smaller model that is 3-4x faster than the <code>benepar_en</code> when running on CPU because it uses a smaller version of ELMo. 94.65 F1 on WSJ test set.</td>\n</tr>\n<tr>\n<td><code>benepar_en_ensemble</code></td>\n<td>English</td>\n<td><strong>No part-of-speech tagging capabilities</strong>: we recommend using <code>benepar_en2_large</code> instead. This model was released to accompany our ACL 2018 paper, and is retained for compatibility. An ensemble of two parsers: one that uses the original ELMo embeddings and one that uses the 5.5B ELMo embeddings. A GPU is highly recommended for running the ensemble. 95.43 F1 on WSJ test set.</td>\n</tr></tbody></table>\n<h2>Training</h2>\n<p>The code used to train our parsing models is currently different from the code used to parse sentences in the release version described above, though both are stored in this repository. The training code uses PyTorch and can be obtained by cloning this repository from GitHub. The release version uses TensorFlow instead, because it allows serializing the parsing model into a single file on disk in a way that minimizes software dependencies and reduces file size on disk.</p>\n<h4>Software Requirements for Training</h4>\n<ul>\n<li>Python 3.6 or higher.</li>\n<li>Cython 0.25.2 or any compatible version.</li>\n<li><a href=\"http://pytorch.org/\" rel=\"nofollow\">PyTorch</a> 0.4.1. This code has not been tested with PyTorch 1.0, but it should work.</li>\n<li><a href=\"http://nlp.cs.nyu.edu/evalb/\" rel=\"nofollow\">EVALB</a>. Before starting, run <code>make</code> inside the <code>EVALB/</code> directory to compile an <code>evalb</code> executable. This will be called from Python for evaluation. If training on the SPMRL datasets, you will need to run <code>make</code> inside the <code>EVALB_SPMRL/</code> directory instead.</li>\n<li><a href=\"http://allennlp.org/\" rel=\"nofollow\">AllenNLP</a> 0.7.0 or any compatible version (only required when using ELMo word representations)</li>\n<li><a href=\"https://github.com/huggingface/pytorch-pretrained-BERT\" rel=\"nofollow\">pytorch-pretrained-bert</a> 0.4.0 or any compatible version (only required when using BERT word representations)</li>\n</ul>\n<h4>Pre-trained Models (PyTorch)</h4>\n<p>The following pre-trained parser models are available for download:</p>\n<ul>\n<li><a href=\"https://github.com/nikitakit/self-attentive-parser/releases/download/models/en_charlstm_dev.93.61.pt\" rel=\"nofollow\"><code>en_charlstm_dev.93.61.pt</code></a>: Our best English single-system parser that does not rely on external word representations</li>\n<li><a href=\"https://github.com/nikitakit/self-attentive-parser/releases/download/models/en_elmo_dev.95.21.pt\" rel=\"nofollow\"><code>en_elmo_dev.95.21.pt</code></a>: The best English single-system parser from our ACL 2018 paper. Using this parser requires ELMo weights, which must be downloaded separately.</li>\n</ul>\n<p>To use ELMo embeddings, download the following files into the <code>data/</code> folder (preserving their names):</p>\n<ul>\n<li><a href=\"https://s3-us-west-2.amazonaws.com/allennlp/models/elmo/2x4096_512_2048cnn_2xhighway/elmo_2x4096_512_2048cnn_2xhighway_options.json\" rel=\"nofollow\"><code>elmo_2x4096_512_2048cnn_2xhighway_options.json</code></a></li>\n<li><a href=\"https://s3-us-west-2.amazonaws.com/allennlp/models/elmo/2x4096_512_2048cnn_2xhighway/elmo_2x4096_512_2048cnn_2xhighway_weights.hdf5\" rel=\"nofollow\"><code>elmo_2x4096_512_2048cnn_2xhighway_weights.hdf5</code></a></li>\n</ul>\n<p>There is currently no command-line option for configuring the locations/names of the ELMo files.</p>\n<p>Pre-trained BERT weights will be automatically downloaded as needed by the <code>pytorch-pretrained-bert</code> package.</p>\n<h3>Training Instructions</h3>\n<p>A new model can be trained using the command <code>python src/main.py train ...</code>. Some of the available arguments are:</p>\n<table>\n<thead>\n<tr>\n<th>Argument</th>\n<th>Description</th>\n<th>Default</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>--model-path-base</code></td>\n<td>Path base to use for saving models</td>\n<td>N/A</td>\n</tr>\n<tr>\n<td><code>--evalb-dir</code></td>\n<td>Path to EVALB directory</td>\n<td><code>EVALB/</code></td>\n</tr>\n<tr>\n<td><code>--train-path</code></td>\n<td>Path to training trees</td>\n<td><code>data/02-21.10way.clean</code></td>\n</tr>\n<tr>\n<td><code>--dev-path</code></td>\n<td>Path to development trees</td>\n<td><code>data/22.auto.clean</code></td>\n</tr>\n<tr>\n<td><code>--batch-size</code></td>\n<td>Number of examples per training update</td>\n<td>250</td>\n</tr>\n<tr>\n<td><code>--checks-per-epoch</code></td>\n<td>Number of development evaluations per epoch</td>\n<td>4</td>\n</tr>\n<tr>\n<td><code>--subbatch-max-tokens</code></td>\n<td>Maximum number of words to process in parallel while training (a full batch may not fit in GPU memory)</td>\n<td>2000</td>\n</tr>\n<tr>\n<td><code>--eval-batch-size</code></td>\n<td>Number of examples to process in parallel when evaluating on the development set</td>\n<td>100</td>\n</tr>\n<tr>\n<td><code>--numpy-seed</code></td>\n<td>NumPy random seed</td>\n<td>Random</td>\n</tr>\n<tr>\n<td><code>--use-words</code></td>\n<td>Use learned word embeddings</td>\n<td>Do not use word embeddings</td>\n</tr>\n<tr>\n<td><code>--use-tags</code></td>\n<td>Use predicted part-of-speech tags as input</td>\n<td>Do not use predicted tags</td>\n</tr>\n<tr>\n<td><code>--use-chars-lstm</code></td>\n<td>Use learned CharLSTM word representations</td>\n<td>Do not use CharLSTM</td>\n</tr>\n<tr>\n<td><code>--use-elmo</code></td>\n<td>Use pre-trained ELMo word representations</td>\n<td>Do not use ELMo</td>\n</tr>\n<tr>\n<td><code>--use-bert</code></td>\n<td>Use pre-trained BERT word representations</td>\n<td>Do not use BERT</td>\n</tr>\n<tr>\n<td><code>--bert-model</code></td>\n<td>Pre-trained BERT model to use if <code>--use-bert</code> is passed</td>\n<td><code>bert-base-uncased</code></td>\n</tr>\n<tr>\n<td><code>--no-bert-do-lower-case</code></td>\n<td>Instructs the BERT tokenizer to retain case information (setting should match the BERT model in use)</td>\n<td>Perform lowercasing</td>\n</tr>\n<tr>\n<td><code>--predict-tags</code></td>\n<td>Adds a part-of-speech tagging component and auxiliary loss to the parser</td>\n<td>Do not predict tags</td>\n</tr></tbody></table>\n<p>Additional arguments are available for other hyperparameters; see <code>make_hparams()</code> in <code>src/main.py</code>. These can be specified on the command line, such as <code>--num-layers 2</code> (for numerical parameters), <code>--use-tags</code> (for boolean parameters that default to False), or <code>--no-partitioned</code> (for boolean parameters that default to True).</p>\n<p>If <code>--use-tags</code> is passed, the training and development trees are assumed to have predicted part-of-speech tags. If <code>--predict-tags</code> is passed, the data is assumed to have ground-truth tags instead. As a result, these two options can't be used simultaneously. Note that the files we provide in the <code>data/</code> folder have predicted tags, and that data with gold tags must be obtained separately.</p>\n<p>For each development evaluation, the F-score on the development set is computed and compared to the previous best. If the current model is better, the previous model will be deleted and the current model will be saved. The new filename will be derived from the provided model path base and the development F-score.</p>\n<p>As an example, to train an English parser using the default hyperparameters, you can use the command:</p>\n<pre><code>python src/main.py train --use-words --use-chars-lstm --model-path-base models/en_charlstm --d-char-emb 64\n</code></pre>\n<p>To train an English parser that uses ELMo embeddings, the command is:</p>\n<pre><code>python src/main.py train --use-elmo --model-path-base models/en_elmo --num-layers 4\n</code></pre>\n<p>To train an English parser that uses BERT, the command is:</p>\n<pre><code>python src/main.py train --use-bert --model-path-base models/en_bert --bert-model \"bert-large-uncased\" --num-layers 2 --learning-rate 0.00005 --batch-size 32 --eval-batch-size 16 --subbatch-max-tokens 500\n</code></pre>\n<h3>Evaluation Instructions</h3>\n<p>A saved model can be evaluated on a test corpus using the command <code>python src/main.py test ...</code> with the following arguments:</p>\n<table>\n<thead>\n<tr>\n<th>Argument</th>\n<th>Description</th>\n<th>Default</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>--model-path-base</code></td>\n<td>Path base of saved model</td>\n<td>N/A</td>\n</tr>\n<tr>\n<td><code>--evalb-dir</code></td>\n<td>Path to EVALB directory</td>\n<td><code>EVALB/</code></td>\n</tr>\n<tr>\n<td><code>--test-path</code></td>\n<td>Path to test trees</td>\n<td><code>data/23.auto.clean</code></td>\n</tr>\n<tr>\n<td><code>--test-path-raw</code></td>\n<td>Alternative path to test trees that is used for evalb only (used to double-check that evaluation against pre-processed trees does not contain any bugs)</td>\n<td>Compare to trees from <code>--test-path</code></td>\n</tr>\n<tr>\n<td><code>--eval-batch-size</code></td>\n<td>Number of examples to process in parallel when evaluating on the test set</td>\n<td>100</td>\n</tr></tbody></table>\n<p>If the parser was trained to have predicted part-of-speech tags as input (via the <code>--use-tags</code> flag) the test trees are assumed to have predicted part-of-speech tags. Otherwise, the tags in the test trees are not used as input to the parser.</p>\n<p>As an example, after extracting the pre-trained model, you can evaluate it on the test set using the following command:</p>\n<pre><code>python src/main.py test --model-path-base models/nk_base6_lstm_dev.93.61.pt\n</code></pre>\n<p>The pre-trained model with CharLSTM embeddings obtains F-scores of 93.61 on the development set and 93.55 on the test set. The pre-trained model with ELMo embeddings obtains F-scores of 95.21 on the development set and 95.13 on the test set.</p>\n<h3>Using the Trained Models</h3>\n<p>See the <code>run_parse</code> function in <code>src/main.py</code> for an example of how a parser can be loaded from disk and used to parse sentences using the PyTorch codebase.</p>\n<p>The <code>export/export.py</code> file contains the code we used to convert our ELMo-based parser to a TensorFlow graph (for use in the release version of the parser). For our BERT-based parsers, consult <code>export/export_bert.py</code> instead. This exporting code hard-codes certain hyperparameter choices, so you will likely need to tweak it to export your own models. Exporting the model to TensorFlow allows it to be stored in a single file, including all ELMo/BERT weights. We also use TensorFlow's graph transforms to shrink the model size on disk with only a tiny impact on parsing accuracy: the compressed ELMo model obtains an F1-score of 95.07 on the test set, compared to 95.13 for the uncompressed model.</p>\n<h2>Reproducing Experiments</h2>\n<p>The code used for our ACL 2018 paper is tagged <code>acl2018</code> in git. The <code>EXPERIMENTS.md</code> file in that version of the code contains additional notes about the command-line arguments we used to perform the experiments reported in our ACL 2018 paper.</p>\n<p>The version of the code currently in this repository has added new features (such as BERT support and part-of-speech tag prediction), eliminated some of the less-performant parser variations (e.g. the CharConcat word representation), and has updated to a newer version of PyTorch. The <code>EXPERIMENTS.md</code> file now describes the commands used to train our best-performing single-system parser for each language that we evaluate on.</p>\n<h2>Citation</h2>\n<p>If you use this software for research, please cite our paper as follows:</p>\n<pre><code>@InProceedings{Kitaev-2018-SelfAttentive,\n  author    = {Kitaev, Nikita and Klein, Dan},\n  title     = {Constituency Parsing with a Self-Attentive Encoder},\n  booktitle = {Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers)},\n  month     = {July},\n  year      = {2018},\n  address   = {Melbourne, Australia},\n  publisher = {Association for Computational Linguistics},\n}\n</code></pre>\n<h2>Credits</h2>\n<p>The code in this repository and portions of this README are based on <a href=\"https://github.com/mitchellstern/minimal-span-parser\" rel=\"nofollow\">https://github.com/mitchellstern/minimal-span-parser</a></p>\n\n          </div>"}, "last_serial": 4766996, "releases": {"0.0.1": [{"comment_text": "", "digests": {"md5": "97874371f433ba2eda89c8fe94d5a70d", "sha256": "e382e146e7e792de4d1c6bcefc9e486f71430737fa2b2a188e4d669a00661175"}, "downloads": -1, "filename": "benepar-0.0.1.tar.gz", "has_sig": false, "md5_digest": "97874371f433ba2eda89c8fe94d5a70d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 64499, "upload_time": "2018-05-29T00:04:41", "upload_time_iso_8601": "2018-05-29T00:04:41.176834Z", "url": "https://files.pythonhosted.org/packages/29/4f/2a975c72f7da21e49576a2fe5974b244c7ed7dd5175dd007d7e532708808/benepar-0.0.1.tar.gz", "yanked": false}], "0.0.1.dev1": [{"comment_text": "", "digests": {"md5": "38cb3e187fc5273222522d2423bc6a9d", "sha256": "f448d25061faeb815bd4050de41c95c8a2bd0b264f357b93e8155b7430063a5b"}, "downloads": -1, "filename": "benepar-0.0.1.dev1.tar.gz", "has_sig": false, "md5_digest": "38cb3e187fc5273222522d2423bc6a9d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 63912, "upload_time": "2018-05-27T22:35:25", "upload_time_iso_8601": "2018-05-27T22:35:25.627834Z", "url": "https://files.pythonhosted.org/packages/a4/f7/d3841c17418b400c30e867483c0fd97b485fdb53849d31490416b03262b5/benepar-0.0.1.dev1.tar.gz", "yanked": false}], "0.0.1.dev2": [{"comment_text": "", "digests": {"md5": "c0ec14a3b25a264004ac3a326c54bf75", "sha256": "acbc7111026aaf5e3c371f6bef1f8027488eeb824a8fdf47ff8bd296632822eb"}, "downloads": -1, "filename": "benepar-0.0.1.dev2.tar.gz", "has_sig": false, "md5_digest": "c0ec14a3b25a264004ac3a326c54bf75", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 64374, "upload_time": "2018-05-28T22:50:52", "upload_time_iso_8601": "2018-05-28T22:50:52.931445Z", "url": "https://files.pythonhosted.org/packages/99/92/db639161ca952b746ff0a18e360d085d40d3ece1c0bd7b67b895942e1e5f/benepar-0.0.1.dev2.tar.gz", "yanked": false}], "0.0.1.dev3": [{"comment_text": "", "digests": {"md5": "a08e0e89410a3751a7f6b1fe5d723ec0", "sha256": "9a4a1365f9eff9743c65b67cca658e41271fca4a070a08ebe6757868fc2986bb"}, "downloads": -1, "filename": "benepar-0.0.1.dev3.tar.gz", "has_sig": false, "md5_digest": "a08e0e89410a3751a7f6b1fe5d723ec0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 64369, "upload_time": "2018-05-28T23:03:35", "upload_time_iso_8601": "2018-05-28T23:03:35.878694Z", "url": "https://files.pythonhosted.org/packages/a0/53/a9b94283843b8cb4afe96e119e4c69df50103b136c700185d4fec05e9b00/benepar-0.0.1.dev3.tar.gz", "yanked": false}], "0.0.1.dev4": [{"comment_text": "", "digests": {"md5": "c3dd730dcf57c17ae06201a9273ec5d3", "sha256": "662cc6eedc6175158cad60b1df7f7f4d38c9dcc7e2cb87ff94f8597d6410418a"}, "downloads": -1, "filename": "benepar-0.0.1.dev4.tar.gz", "has_sig": false, "md5_digest": "c3dd730dcf57c17ae06201a9273ec5d3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 64510, "upload_time": "2018-05-28T23:41:05", "upload_time_iso_8601": "2018-05-28T23:41:05.501283Z", "url": "https://files.pythonhosted.org/packages/ad/50/9b18ae53ddaeeca1f1aaf6fbe70c98395611120baabf4ec86285dadad70c/benepar-0.0.1.dev4.tar.gz", "yanked": false}], "0.0.1.dev5": [{"comment_text": "", "digests": {"md5": "09f4bf508a3e5d1ec10b29750168f508", "sha256": "776debea490e26d9b52700c80902c5166519f9e213185bb0cf3266286d217f83"}, "downloads": -1, "filename": "benepar-0.0.1.dev5.tar.gz", "has_sig": false, "md5_digest": "09f4bf508a3e5d1ec10b29750168f508", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 64514, "upload_time": "2018-05-29T00:01:54", "upload_time_iso_8601": "2018-05-29T00:01:54.038215Z", "url": "https://files.pythonhosted.org/packages/ef/f2/c7c8be7ccb41d37fc7b4d1ce04c216668bc0e83d90c6325200542fbf3843/benepar-0.0.1.dev5.tar.gz", "yanked": false}], "0.0.2": [{"comment_text": "", "digests": {"md5": "7d7fd1027329b5832a4b90a262330f55", "sha256": "4cfe6f2d541f0f9e218ad91c3bdb4885031567cb65896b87571aaab2665b0e07"}, "downloads": -1, "filename": "benepar-0.0.2.tar.gz", "has_sig": false, "md5_digest": "7d7fd1027329b5832a4b90a262330f55", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 61076, "upload_time": "2018-06-20T04:33:50", "upload_time_iso_8601": "2018-06-20T04:33:50.319082Z", "url": "https://files.pythonhosted.org/packages/d1/ad/0a6760cd1e455093820803b768d91c6c16a4672c7fc3a24f51e71d10e6be/benepar-0.0.2.tar.gz", "yanked": false}], "0.0.3": [{"comment_text": "", "digests": {"md5": "98bbf36e147fca63909cd02ac7675ce2", "sha256": "7fa5576536375f29007e5d448b04f909fa1c8841daaa65e9554dc93fb3add4e0"}, "downloads": -1, "filename": "benepar-0.0.3.tar.gz", "has_sig": false, "md5_digest": "98bbf36e147fca63909cd02ac7675ce2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 61177, "upload_time": "2018-08-25T03:09:01", "upload_time_iso_8601": "2018-08-25T03:09:01.871855Z", "url": "https://files.pythonhosted.org/packages/12/a7/f5322420e6eb8528a6874e608aabf539a4759cfb324f5a63997c3eda991d/benepar-0.0.3.tar.gz", "yanked": false}], "0.1.0": [{"comment_text": "", "digests": {"md5": "742673a9b12016cd9998cd090267f69c", "sha256": "0a2372d0f4a7f97100b69cd5c4f05ab71b103508dd1c2ebe0ac9efcdad45083b"}, "downloads": -1, "filename": "benepar-0.1.0.tar.gz", "has_sig": false, "md5_digest": "742673a9b12016cd9998cd090267f69c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 67342, "upload_time": "2018-12-31T18:20:19", "upload_time_iso_8601": "2018-12-31T18:20:19.624740Z", "url": "https://files.pythonhosted.org/packages/c4/fc/d6dbd2ced6a954391e78d9e782a181bd97bcf46bcaac0221d51d6a6ba9e1/benepar-0.1.0.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "bbab393e1b77bcf39c311724704d7866", "sha256": "d4858e54249fa3c04893a014b0bd54b0bc3bd13fb513443a114a9c5893c43bfa"}, "downloads": -1, "filename": "benepar-0.1.1.tar.gz", "has_sig": false, "md5_digest": "bbab393e1b77bcf39c311724704d7866", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 67363, "upload_time": "2018-12-31T20:14:43", "upload_time_iso_8601": "2018-12-31T20:14:43.935600Z", "url": "https://files.pythonhosted.org/packages/e6/d1/ff387f5eefc49fcfc40b1e1c2f31cf9b5f7cd11b6ce922318199e3fa0526/benepar-0.1.1.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "d64ae2e8c35bf0ab20820f11f348f622", "sha256": "a1cc18c531e4438f87b5abea93aa876cd96f20ec351f2bbe69c1d9fc96347a39"}, "downloads": -1, "filename": "benepar-0.1.2.tar.gz", "has_sig": false, "md5_digest": "d64ae2e8c35bf0ab20820f11f348f622", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 72737, "upload_time": "2019-02-01T05:40:24", "upload_time_iso_8601": "2019-02-01T05:40:24.372535Z", "url": "https://files.pythonhosted.org/packages/a0/7b/6cd9c60e1613a5ad388b4f883fa2aeaddcd8a7ad0a8d5ed87e0d23f159d8/benepar-0.1.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "d64ae2e8c35bf0ab20820f11f348f622", "sha256": "a1cc18c531e4438f87b5abea93aa876cd96f20ec351f2bbe69c1d9fc96347a39"}, "downloads": -1, "filename": "benepar-0.1.2.tar.gz", "has_sig": false, "md5_digest": "d64ae2e8c35bf0ab20820f11f348f622", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 72737, "upload_time": "2019-02-01T05:40:24", "upload_time_iso_8601": "2019-02-01T05:40:24.372535Z", "url": "https://files.pythonhosted.org/packages/a0/7b/6cd9c60e1613a5ad388b4f883fa2aeaddcd8a7ad0a8d5ed87e0d23f159d8/benepar-0.1.2.tar.gz", "yanked": false}], "timestamp": "Thu May  7 22:37:47 2020"}