{"info": {"author": "Johan Andersson", "author_email": "Grokzen@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Environment :: Console", "Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.3", "Programming Language :: Python :: 3.4"], "description": "# pyKwalify\n\nYAML/JSON validation library\n\nThis framework is a port with alot added functionality of the java version of the framework kwalify that can be found at: http://www.kuwata-lab.com/kwalify/\n\nThe original source code can be found at: http://sourceforge.net/projects/kwalify/files/kwalify-java/0.5.1/\n\nThe source code of the latest release that has been used can be found at: https://github.com/sunaku/kwalify. Please note that source code is not the original authors code but a fork/upload of the last release available in ruby.\n\nThe schema this library is base and extended from: http://www.kuwata-lab.com/kwalify/ruby/users-guide.01.html#schema\n\n\n# Usage\n\nCreate a data file. `Json` and `Yaml` formats are both supported.\n\n```yaml\n- foo\n- bar\n```\n\nCreate a schema file with validation rules.\n\n```yaml\ntype: seq\nsequence:\n  - type: str\n```\n\nRun validation from cli.\n\n```bash\npykwalify -d data.yaml -s schema.yaml\n```\n\n\n## Examples\n\nThe documentation describes in detail how each keyword and type works and what is possible in each case.\n\nBut there is a lot of real world examples that can be found in the test data/files. It shows alot of examples of how all keywords and types work in practise and in combination with eachother.\n\nThe files can be found here and it shows both schema/data combinations that will work and that will fail.\n\n - `tests/files/success/`\n - `tests/files/fail/`\n - `tests/files/partial_schemas/`\n\n\n# PyYaml and ruamel.yaml\n\n`PyYaml` is the default installed yaml parser and `ruamel.yaml` is possible to install at the same time with the following command\n\n```bash\npip install 'pykwalify[ruamel]'\n\n# or for development:\n\npip install -e '.[ruamel]'\n```\n\n`ruamel.yaml` will however be used if both is installed becuase it is more up to date and includes the YAML 1.2 specification that `PyYaml` do not support.\n\n`PyYaml` will still be the default parser becuase it is used more and is still considered the default `YAML` parser in the python world.\n\nDepending on how both libraries is developed, this can change in the future in any major update.\n\n\n\n## UTF-8 and data encoding\n\nIf you have problems with unicode values not working properly when running pykwalify on python 2.7.x then try to add this environment variable to your execution\n\n```\nPYTHONIOENCODING=UTF-8 pykwalify ...\n```\n\nand it might help to force UTF-8 encoding on all string objects. If this do not work please open up a issue with your schema and data that can be used to track down the problem in the source code.\n\n\n# Project details\n\n|   |   |\n|---|---|\n| python support         | 2.7, 3.3, 3.4, 3.5, 3.6, 3.7 |\n| Source                 | https://github.com/Grokzen/pykwalify |\n| Docs (Latest release)  | http://pykwalify.readthedocs.io/en/master/ |\n| Docs (Unstable branch) | http://pykwalify.readthedocs.io/en/unstable/ |\n| Gitter (Free Chat)     | [![Gitter](https://badges.gitter.im/Join Chat.svg)](https://gitter.im/Grokzen/pykwalify?utm_source=badge&utm_medium=badge&utm_campaign=pr-badge&utm_content=badge) |\n| Changelog              | https://github.com/Grokzen/pykwalify/blob/unstable/docs/release-notes.rst |\n| Upgrade instructions   | https://github.com/Grokzen/pykwalify/blob/unstable/docs/upgrade-instructions.rst |\n| Issues                 | https://github.com/Grokzen/pykwalify/issues |\n| Travis (master)        | [![Build Status](https://travis-ci.org/Grokzen/pykwalify.svg?branch=master)](https://travis-ci.org/Grokzen/pykwalify) https://travis-ci.org/Grokzen/pykwalify |\n| Travis (unstable)      | [![Build Status](https://travis-ci.org/Grokzen/pykwalify.svg?branch=unstable)](https://travis-ci.org/Grokzen/pykwalify) https://travis-ci.org/Grokzen/pykwalify |\n| Test coverage          | [![Coverage Status](https://coveralls.io/repos/Grokzen/pykwalify/badge.png?branch=master)](https://coveralls.io/r/Grokzen/pykwalify) https://coveralls.io/github/Grokzen/pykwalify |\n| pypi                   | https://pypi.python.org/pypi/pykwalify/ |\n| Open Hub               | https://www.openhub.net/p/pykwalify |\n| License                | `MIT` https://github.com/Grokzen/pykwalify/blob/unstable/docs/license.rst |\n| Copyright              | `Copyright (c) 2013-2017 Johan Andersson` |\n| git repo               | `git clone git@github.com:Grokzen/pykwalify.git` |\n| install stable         | `pip install pykwalify` |\n| install dev            | `$ git clone git@github.com:Grokzen/pykwalify.git pykwalify`<br>`$ cd ./pykwalify`<br>`$ virtualenv .venv`<br>`$ source .venv/bin/activate`<br>`$ pip install -r dev-requirements.txt`<br>`$ pip install -e .` |\n| required dependencies  | `docopt >= 0.6.2`<br> `python-dateutil >= 2.4.2` |\n| supported yml parsers  | `PyYaml >= 3.11`<br>`ruamel.yaml >= 0.11.0` |\n\n\nRelease Notes\n=============\n\n1.6.0 (Jan 22, 2017)\n--------------------\n\nNew keywords:\n\n- Add support for keyword *example*. It does nothing and have no validation done on it.\n- Add support for keyword *version*. It does nothing and have no validation done on it.\n- Add support for keyword *date* and added support keyword *format*. This can be used to validate many different types of *datetime* objects.\n- Add support for keyword *length*. It is very similar to *range* but works primarily string types.\n- Add support for keyword *assert*. It works by running the python code *assert <assert-expr>* and check if any exception is raised.\n  This feature is considered dangerouns becuase there is only simple logic to prevent escaping out from validation.\n\nBug fixes:\n\n- Fixed a bug where regexes marked as 'required' in a map were matched as strings, rather than regexes.\n- Fixed a bug where the type validation did not work when schema specefied a sequence of map objects. It now outputs a proper `...is not a dict...` error instead.\n- Fixed a bug in *unique* validation when a key that it tried to lookup in the data would not exists.\n  Now it just ignores that it did not find any value becuase a missing value do not impact validation.\n- Fixed a bug with keyword *ident* when the rule value was verified to be a *boolean*. It now only accepts *boolean* values as expected.\n- Fixed a bug where if *allowempty* was specefied in a mapping type inside a sequence type then it would not properly validate.\n- Fixed a bug where loaded extensions would not allways work in complex & nested objects.\n- Fixed a major bug in very nested *seq* schemas where if the schema expected another *seq* but the value was something else it would not raise it as a validation error.\n  This has now been fixed and now raises the proper error.\n- Fixed a bug where include directive would not work in all cases when used inside a key in a mapping block.\n\nNew features:\n\n- It is now possible to specify a default rule when using a mapping.\n  The rule will be used whenever no other key could be found.\n  This is a port of a missing feature from original kwalify implementation.\n- Added new helper method *keywords* to *Rule* class that can output all active keywords for any *Rule* object.\n  This helps when debugging code to be able to easily dump what all active keywords for any *Rule* object.\n- Added new cli flag *--strict-rule-validation* that will validate that all used keywords in all *Rule* objects only uses the rules that is supported by each defined type.\n  If you only use a *Core* object then set *strict_rule_validation=True* when creating the *Core* object instance.\n  This feature is opt-in in this releaes but will be mandatory in *releases >= 1.7.0*.\n- Added new cli flag *--fix-ruby-style-regex* that will trim slashes from ruby style regex/patterns.\n  When using this flag the first and last */* will be trimmed of the pattern before running validation.\n  If you only use a *Core* object then set *fix_ruby_style_regex=True* when creating the *Core* object instance.\n  Default behaviour will still be that you should use python style regex values but this flag can help in some cases when you can't change the schema.\n- Added new cli flag *--allow-assertions* that will enable the otherwise blocked keyword *assert*.\n  This flag was introduced so that pykwalify would not assert assertions without user controll.\n  Default behaviour will be to raise a *CoreError* is assertion is used but not allowed explicitly.\n  If you only use a *Core* object then set *allow_assertions=True* when creating the *Core* object instance.\n\nChanged behaviour:\n\n- Removed the force of *UTF-8* encoding when importing pykwalify package. It caused issues with *jypiter notebooks* on python 2.7.x\n  Added documentation in Readme regarding the suggested solution to use *PYTHONIOENCODING=UTF-8* if the default solution do not work.\n- Validation do no longer continue to process things like *pattern*, *regex*, *timestamp*, *range* and other additional checks \n  if the type check fails. This can cause problems where previous errors will now initially be silenced when the typecheck for\n  that value fails, but reappear again when the type check is fixed. (sbrunner)\n- Catches *TypeError* when doing regex validation. That happens when the value is not a parsable string type.\n- Checking that the value is a valid dict object is now done even if the mapping keyword is not specefied in the schema.\n  This makes that check more eager and errors can apear that previously was not there.\n- Changed the sane default type if that key is not defined to be *str*. Before this, type had to be defined every time and the default type did not work as expected.\n  This is a major change and can cause validation to either fail or to stop failing depending on the case.\n- Changed validation for if a value is required and a value in a list for example is *None*. It now adds a normal validation errors instead of raising a *CoreError*.\n- Value for keyword *desc* now *MUST* be a string or a *RuleError* will be raised.\n- Value for keyword *example* now *MUST* be a string or a *RuleError* will be raised.\n- Value for keyword *name* now *MUST* be a string or a *RuleError* will be raised.\n\nGeneral changes:\n\n- Ported alot of testcases directly from *Kwalify* test data (*test-validator.yaml -> 30f.yaml & 43s.yaml*) so that this lib can have greater confidence that rules is implemented in the same way as *Kwalify*.\n- Refactored *test_core_files* method to now accept test files with multiple of documents. The method now tries to read all documents from each test file and run each document seperatly.\n  It now alos reports more detailed about what file and document that fails the test to make it easier to track down problems.\n- Major refactoring of test files to now be grouped based on what they are testing instead of a increased counter that do not represent anything.\n  It will be easier to find out what keywords lack tests and what keywords that have enough tests.\n\n\n1.5.2 (Nov 12, 2016)\n--------------------\n\n- Convert all documentation to readthedocs\n- True/False is no longer considered valid integer\n- python3 'bytes' objects is now a valid strings and text type\n- The regular PyYaml support is now deprecated in favor of ruamel.yaml, see the following link for more details about\n  PyYaml being deprecated https://bitbucket.org/xi/pyyaml/issues/59/has-this-project-been-abandoned\n  PyYaml will still be possible to use in the next major release version (1.6.0) but removed in release (1.7.0) and forward.\n- ruamel.yaml is now possible to install with the following command for local development *pip install -e '.[ruamel]'*\n  and for production, use *pip install 'pykwalify[ruamel]'*\n- ruamel.yaml is now used before PyYaml if installed on your system\n- Fixed a bug where scalar type was not validated correctly.\n- Unpin all dependencies but still maintain a minimum versions of each lib\n- Allowed mixing of regex and normal keywords when matching a string (jmacarthur)\n\n\n1.5.1 (Mar 6, 2016)\n----------------\n\n- Improvements to documentation (scottclowe).\n- Improved code linting by reworking private variables in Rule class to now be properties and updated\n  all code that used the old way.\n- Improved code linting by reworking all Log messages to render according to pep standard.\n  (By using %s and passing in variables as positional arguments)\n- Fix bug when validating sequence and value should only be unicode escaped when a string\n- Improve validation of timestamps.\n- Improve float validation to now accept strings that is valid ints that uses scientific notation, \"1e-06\" for example.\n- Update travis to test against python 3.6\n\n\n1.5.0 (Sep 30, 2015)\n--------------------\n\n- float / number type now support range restrictions\n- ranges on non number types (e.g. seq, string) now need to be non negative.\n- Fixed encoding bug triggered when both regex matching-rule 'any' and 'all' found keyword that\n  failed regex match.  Added failure unit tests to cover regex matching-rule 'any' and 'all' during\n  failed regex match.  Updated allowed rule list to include matching-rule 'all'.\n- Changed _validate_mappings method from using re.match to re.search.  This fixes bug related to\n  multiple keyword regex using matching-rule 'any'.  Added success unit tests to test default, 'any',\n  and 'all' matching-rule.\n\n\n1.4.1 (Aug 27, 2015)\n--------------------\n\n- Added tests to sdist to enable downstream packaging to run tests. No code changes in this release.\n\n\n1.4.0 (Aug 4, 2015)\n-------------------\n\n- Dropped support for python 3.2 becuase of unicode literals do not exists in python 3.2.\n- Fixed logging & raised exceptions when using unicode characters inside schemas/data/filenames.\n- Reworked all RuleError exceptions to now have better exception messages.\n- RuleError exceptions now have a unique 'error_key' that can make it easier to identify what error it is.\n- Paths for RuleErrors have been moved inside the exception as a variable.\n- Rewrote all SchemaConflict exceptions to be more human readable.\n\n\n1.3.0 (Jul 14, 2015)\n--------------------\n\n- Rewrote most of the error messages to be more human readable. See `docs/Upgrade Instructions.md`\n  for more details.\n- It is now possible to use the exceptions that was raised for each validation error. It can be\n  found in the variable `c.validation_errors_exceptions`. They contain more detailed information\n  about the error.\n\n\n1.2.0 (May 19, 2015)\n--------------------\n\n- This feature is NEW and EXPERIMENTAL.\n  Implemented support for multiple values inside in a sequence.\n  This will allow the defenition of different types that one sequence can contain. You can either require\n  each value in the sequence to be valid against one to all of the different possibilities.\n  Tests show that it still maintains backward compatibility with all old schemas but it can't be guarantee.\n  If you find a regression in this release please file a bug report so it can be fixed ASAP.\n- This feature is NEW and EXPERIMENTAL.\n  Added ability to define python files that can be used to have custom python code/functions that can be\n  called on all types so that custom/extra validation can be done on all data structures.\n- Add new keyword 'func' that is a string and is used to point to a function loaded via the extension system.\n- Add new keyword 'extensions' that can only be used on the top level of the schema. It is should be a list\n  with strings of files that should be loaded by the extension system. Paths can be relative or absolute.\n- New cli option '-e FILE' or '--extension FILE' that can be used to load extension files from cli.\n- Fixed a bug where types did not raise exceptions properly. If schema said it should be a map but data was\n  a sequence, no validation error was raised in earlier versions but now it raises a 'NotSequenceError' or \n  'NotMappingError'.\n\n\n1.1.0 (Apr 4, 2015)\n-------------------\n\n- Rework cli string that docopt uses. Removed redundant flags that docopt provides [--version & --help]\n- Add support for timestamp validation\n- Add new runtime dependency 'python-dateutil' that is used to validate timestamps\n- Change how 'any' keyword is implemented to now accept anything and not just the implemented types. (See Upgrade Instructions document for migration details)\n\n\n\n1.0.1 (Mar 8, 2015)\n-------------------\n\nSwitched back to semantic version numbering for this lib.\n\n- After the release of `15.01` the version schema was changed back from the <year>.<month> style version schema back to semantic version names. One big problem with this change is that `pypi` can't handle the change back to semantic names very well and because of this I had to remove the old releases from pypi and replace it with a single version `1.0.1`.\n- No matter what version you were using you should consider upgrading to `1.0.1`. The difference between the two versions is very small and contains mostly bugfixes and added improvements.\n- The old releases can still be obtained from `github.com` and if you really need the old version you can add the download url to your `requirements.txt` file.\n\n\n15.01 (Jan 17, 2015)\n--------------------\n\n- Fixed a bug in unique validation for mapping keys [See: PR-12] (Gonditeniz)\n\n\n\n14.12 (Dec 24, 2014)\n--------------------\n\n- Fixed broken regex matching on map keys.\n- Source files with file ending `.yml` can now be loaded\n- Added aliases to some directives to make it easier/faster to write\n   * `sequence` --> `seq` \n   * `mapping` --> `map` \n   * `required` --> `req`\n   * `regex` --> `re`\n- Reworked all testing files to reduce number of files\n\n\n\n14.08 (Aug 24, 2014)\n--------------------\n\n- First version to be uploaded to pypi\n- Keyword 'range' can now be applied to map & seq types.\n- Added many more test files.\n- Keyword 'length' was removed because 'range' can handle all cases now.\n- Keyword 'range' now correctly checks the internal keys to be integers\n- Major update to testing and increased coverage.\n\n\n\n14.06.1 (Jun 24, 2014)\n----------------------\n\n- New feature \"partial schema\". Define a small schema with a ID that can be reused at other places in the schema. See readme for details.\n- New directive \"include\" that is used to include a partial schema at the specefied location.\n- Cli and Core() now can handle multiple schema files.\n- Directive \"pattern\" can no longer be used with map to validate all keys against that regex. Use \"regex;\" inside \"mapping:\"\n- 'none' can now be used as a type\n- Many more tests added\n\n\n\n14.06 (Jun 7, 2014)\n-------------------\n\n- New version scheme [YY.MM(.Minor-Release)]\n- Added TravisCI support\n- Update runtime dependency docopt to 0.6.1\n- Update runtime dependency pyyaml to 3.11\n- Huge refactoring of logging and how it works. Logging config files is now removed and everything is alot simpler\n- Cleanup some checks that docopt now handles\n- New keyword \"regex;<regex-pattern>\" that can be used as a key in map to give more flexibility when validating map keys\n- New keyword \"matching-rule\" that can be used to control how keys should be matched\n- Added python 3.4 & python 2.7 support (See TravisCI tests for status)\n- Dropped python 3.1 support\n- Alot of refactoring of testing code.\n- Tests should now be runned with \"nosetests\" and not \"python runtests.py\"\n- Refactored alot of exceptions to be more specific (SchemaError and RuleError for example) and not a generic Exception\n- Parsed rules is now stored correctly in Core() so it can be tested from the outside\n\n\n\n0.1.2 (Jan 26, 2013)\n--------------------\n\n- Added new and experimental validation rule allowempty. (See README for more info)\n- Added TODO tracking file.\n- Reworked the CLI to now use docopt and removede argparse.\n- Implemented more typechecks, float, number, text, any\n- Now suports python 3.3.x\n- No longer support any python 2.x.y version\n- Enabled pattern for map rule. It enables the validation of all keys in that map. (See README for more info)\n- Alot more test files and now tests source_data and schema_data input arguments to core.py\n- Alot of cleanup in the test suit\n\n\n\n0.1.1 (Jan 21, 2013)\n--------------------\n\n- Reworked the structure of the project to be more clean and easy to find stuff.\n- lib/ folder is now removed and all contents is placed in the root of the project\n- All scripts is now moved to its own folder scripts/ (To use the script during dev the path to the root of the project must be in your python path somehow, recomended is to create a virtualenv and export the correct path when it activates)\n- New make target 'cleanegg'\n- Fixed path bugs in Makefile\n- Fixed path bugs in Manifest\n\n\n\n0.1.0 (Jan 20, 2013)\n--------------------\n\n- Initial stable release of pyKwalify.\n- All functions is not currently implemented but the cli/lib can be used but probably with some bugs.\n- This should be considered a Alpha release used for bug and stable testing and to be based on further new feature requests for the next version.\n- Implemented most validation rules from the original Java version of kwalify. Some is currently not implemented and can be found via [NYI] tag in output, doc & code.\n- Installable via pip (Not the official online pip repo but from the releases folder found in this repo)\n- Supports YAML & JSON files from cli and any dict/list data structure if used in lib mode.\n- Uses pythons internal logging functionality and default logging output can be changed by changing logging.ini (python 3.1.x) or logging.yaml (python 3.2.x) to change the default logging output, or use -v cli input argument to change the logging level. If in lib mode it uses your implemented python std logging.", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://github.com/grokzen/pykwalify", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "bfabio.pykwalify", "package_url": "https://pypi.org/project/bfabio.pykwalify/", "platform": "", "project_url": "https://pypi.org/project/bfabio.pykwalify/", "project_urls": {"Homepage": "http://github.com/grokzen/pykwalify"}, "release_url": "https://pypi.org/project/bfabio.pykwalify/1.6.0/", "requires_dist": null, "requires_python": "", "summary": "Python lib/cli for JSON/YAML schema validation", "version": "1.6.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            # pyKwalify<br><br>YAML/JSON validation library<br><br>This framework is a port with alot added functionality of the java version of the framework kwalify that can be found at: http://www.kuwata-lab.com/kwalify/<br><br>The original source code can be found at: http://sourceforge.net/projects/kwalify/files/kwalify-java/0.5.1/<br><br>The source code of the latest release that has been used can be found at: https://github.com/sunaku/kwalify. Please note that source code is not the original authors code but a fork/upload of the last release available in ruby.<br><br>The schema this library is base and extended from: http://www.kuwata-lab.com/kwalify/ruby/users-guide.01.html#schema<br><br><br># Usage<br><br>Create a data file. `Json` and `Yaml` formats are both supported.<br><br>```yaml<br>- foo<br>- bar<br>```<br><br>Create a schema file with validation rules.<br><br>```yaml<br>type: seq<br>sequence:<br>  - type: str<br>```<br><br>Run validation from cli.<br><br>```bash<br>pykwalify -d data.yaml -s schema.yaml<br>```<br><br><br>## Examples<br><br>The documentation describes in detail how each keyword and type works and what is possible in each case.<br><br>But there is a lot of real world examples that can be found in the test data/files. It shows alot of examples of how all keywords and types work in practise and in combination with eachother.<br><br>The files can be found here and it shows both schema/data combinations that will work and that will fail.<br><br> - `tests/files/success/`<br> - `tests/files/fail/`<br> - `tests/files/partial_schemas/`<br><br><br># PyYaml and ruamel.yaml<br><br>`PyYaml` is the default installed yaml parser and `ruamel.yaml` is possible to install at the same time with the following command<br><br>```bash<br>pip install 'pykwalify[ruamel]'<br><br># or for development:<br><br>pip install -e '.[ruamel]'<br>```<br><br>`ruamel.yaml` will however be used if both is installed becuase it is more up to date and includes the YAML 1.2 specification that `PyYaml` do not support.<br><br>`PyYaml` will still be the default parser becuase it is used more and is still considered the default `YAML` parser in the python world.<br><br>Depending on how both libraries is developed, this can change in the future in any major update.<br><br><br><br>## UTF-8 and data encoding<br><br>If you have problems with unicode values not working properly when running pykwalify on python 2.7.x then try to add this environment variable to your execution<br><br>```<br>PYTHONIOENCODING=UTF-8 pykwalify ...<br>```<br><br>and it might help to force UTF-8 encoding on all string objects. If this do not work please open up a issue with your schema and data that can be used to track down the problem in the source code.<br><br><br># Project details<br><br>|   |   |<br>|---|---|<br>| python support         | 2.7, 3.3, 3.4, 3.5, 3.6, 3.7 |<br>| Source                 | https://github.com/Grokzen/pykwalify |<br>| Docs (Latest release)  | http://pykwalify.readthedocs.io/en/master/ |<br>| Docs (Unstable branch) | http://pykwalify.readthedocs.io/en/unstable/ |<br>| Gitter (Free Chat)     | [![Gitter](https://badges.gitter.im/Join Chat.svg)](https://gitter.im/Grokzen/pykwalify?utm_source=badge&amp;utm_medium=badge&amp;utm_campaign=pr-badge&amp;utm_content=badge) |<br>| Changelog              | https://github.com/Grokzen/pykwalify/blob/unstable/docs/release-notes.rst |<br>| Upgrade instructions   | https://github.com/Grokzen/pykwalify/blob/unstable/docs/upgrade-instructions.rst |<br>| Issues                 | https://github.com/Grokzen/pykwalify/issues |<br>| Travis (master)        | [![Build Status](https://travis-ci.org/Grokzen/pykwalify.svg?branch=master)](https://travis-ci.org/Grokzen/pykwalify) https://travis-ci.org/Grokzen/pykwalify |<br>| Travis (unstable)      | [![Build Status](https://travis-ci.org/Grokzen/pykwalify.svg?branch=unstable)](https://travis-ci.org/Grokzen/pykwalify) https://travis-ci.org/Grokzen/pykwalify |<br>| Test coverage          | [![Coverage Status](https://coveralls.io/repos/Grokzen/pykwalify/badge.png?branch=master)](https://coveralls.io/r/Grokzen/pykwalify) https://coveralls.io/github/Grokzen/pykwalify |<br>| pypi                   | https://pypi.python.org/pypi/pykwalify/ |<br>| Open Hub               | https://www.openhub.net/p/pykwalify |<br>| License                | `MIT` https://github.com/Grokzen/pykwalify/blob/unstable/docs/license.rst |<br>| Copyright              | `Copyright (c) 2013-2017 Johan Andersson` |<br>| git repo               | `git clone git@github.com:Grokzen/pykwalify.git` |<br>| install stable         | `pip install pykwalify` |<br>| install dev            | `$ git clone git@github.com:Grokzen/pykwalify.git pykwalify`&lt;br&gt;`$ cd ./pykwalify`&lt;br&gt;`$ virtualenv .venv`&lt;br&gt;`$ source .venv/bin/activate`&lt;br&gt;`$ pip install -r dev-requirements.txt`&lt;br&gt;`$ pip install -e .` |<br>| required dependencies  | `docopt &gt;= 0.6.2`&lt;br&gt; `python-dateutil &gt;= 2.4.2` |<br>| supported yml parsers  | `PyYaml &gt;= 3.11`&lt;br&gt;`ruamel.yaml &gt;= 0.11.0` |<br><br><br>Release Notes<br>=============<br><br>1.6.0 (Jan 22, 2017)<br>--------------------<br><br>New keywords:<br><br>- Add support for keyword *example*. It does nothing and have no validation done on it.<br>- Add support for keyword *version*. It does nothing and have no validation done on it.<br>- Add support for keyword *date* and added support keyword *format*. This can be used to validate many different types of *datetime* objects.<br>- Add support for keyword *length*. It is very similar to *range* but works primarily string types.<br>- Add support for keyword *assert*. It works by running the python code *assert &lt;assert-expr&gt;* and check if any exception is raised.<br>  This feature is considered dangerouns becuase there is only simple logic to prevent escaping out from validation.<br><br>Bug fixes:<br><br>- Fixed a bug where regexes marked as 'required' in a map were matched as strings, rather than regexes.<br>- Fixed a bug where the type validation did not work when schema specefied a sequence of map objects. It now outputs a proper `...is not a dict...` error instead.<br>- Fixed a bug in *unique* validation when a key that it tried to lookup in the data would not exists.<br>  Now it just ignores that it did not find any value becuase a missing value do not impact validation.<br>- Fixed a bug with keyword *ident* when the rule value was verified to be a *boolean*. It now only accepts *boolean* values as expected.<br>- Fixed a bug where if *allowempty* was specefied in a mapping type inside a sequence type then it would not properly validate.<br>- Fixed a bug where loaded extensions would not allways work in complex &amp; nested objects.<br>- Fixed a major bug in very nested *seq* schemas where if the schema expected another *seq* but the value was something else it would not raise it as a validation error.<br>  This has now been fixed and now raises the proper error.<br>- Fixed a bug where include directive would not work in all cases when used inside a key in a mapping block.<br><br>New features:<br><br>- It is now possible to specify a default rule when using a mapping.<br>  The rule will be used whenever no other key could be found.<br>  This is a port of a missing feature from original kwalify implementation.<br>- Added new helper method *keywords* to *Rule* class that can output all active keywords for any *Rule* object.<br>  This helps when debugging code to be able to easily dump what all active keywords for any *Rule* object.<br>- Added new cli flag *--strict-rule-validation* that will validate that all used keywords in all *Rule* objects only uses the rules that is supported by each defined type.<br>  If you only use a *Core* object then set *strict_rule_validation=True* when creating the *Core* object instance.<br>  This feature is opt-in in this releaes but will be mandatory in *releases &gt;= 1.7.0*.<br>- Added new cli flag *--fix-ruby-style-regex* that will trim slashes from ruby style regex/patterns.<br>  When using this flag the first and last */* will be trimmed of the pattern before running validation.<br>  If you only use a *Core* object then set *fix_ruby_style_regex=True* when creating the *Core* object instance.<br>  Default behaviour will still be that you should use python style regex values but this flag can help in some cases when you can't change the schema.<br>- Added new cli flag *--allow-assertions* that will enable the otherwise blocked keyword *assert*.<br>  This flag was introduced so that pykwalify would not assert assertions without user controll.<br>  Default behaviour will be to raise a *CoreError* is assertion is used but not allowed explicitly.<br>  If you only use a *Core* object then set *allow_assertions=True* when creating the *Core* object instance.<br><br>Changed behaviour:<br><br>- Removed the force of *UTF-8* encoding when importing pykwalify package. It caused issues with *jypiter notebooks* on python 2.7.x<br>  Added documentation in Readme regarding the suggested solution to use *PYTHONIOENCODING=UTF-8* if the default solution do not work.<br>- Validation do no longer continue to process things like *pattern*, *regex*, *timestamp*, *range* and other additional checks <br>  if the type check fails. This can cause problems where previous errors will now initially be silenced when the typecheck for<br>  that value fails, but reappear again when the type check is fixed. (sbrunner)<br>- Catches *TypeError* when doing regex validation. That happens when the value is not a parsable string type.<br>- Checking that the value is a valid dict object is now done even if the mapping keyword is not specefied in the schema.<br>  This makes that check more eager and errors can apear that previously was not there.<br>- Changed the sane default type if that key is not defined to be *str*. Before this, type had to be defined every time and the default type did not work as expected.<br>  This is a major change and can cause validation to either fail or to stop failing depending on the case.<br>- Changed validation for if a value is required and a value in a list for example is *None*. It now adds a normal validation errors instead of raising a *CoreError*.<br>- Value for keyword *desc* now *MUST* be a string or a *RuleError* will be raised.<br>- Value for keyword *example* now *MUST* be a string or a *RuleError* will be raised.<br>- Value for keyword *name* now *MUST* be a string or a *RuleError* will be raised.<br><br>General changes:<br><br>- Ported alot of testcases directly from *Kwalify* test data (*test-validator.yaml -&gt; 30f.yaml &amp; 43s.yaml*) so that this lib can have greater confidence that rules is implemented in the same way as *Kwalify*.<br>- Refactored *test_core_files* method to now accept test files with multiple of documents. The method now tries to read all documents from each test file and run each document seperatly.<br>  It now alos reports more detailed about what file and document that fails the test to make it easier to track down problems.<br>- Major refactoring of test files to now be grouped based on what they are testing instead of a increased counter that do not represent anything.<br>  It will be easier to find out what keywords lack tests and what keywords that have enough tests.<br><br><br>1.5.2 (Nov 12, 2016)<br>--------------------<br><br>- Convert all documentation to readthedocs<br>- True/False is no longer considered valid integer<br>- python3 'bytes' objects is now a valid strings and text type<br>- The regular PyYaml support is now deprecated in favor of ruamel.yaml, see the following link for more details about<br>  PyYaml being deprecated https://bitbucket.org/xi/pyyaml/issues/59/has-this-project-been-abandoned<br>  PyYaml will still be possible to use in the next major release version (1.6.0) but removed in release (1.7.0) and forward.<br>- ruamel.yaml is now possible to install with the following command for local development *pip install -e '.[ruamel]'*<br>  and for production, use *pip install 'pykwalify[ruamel]'*<br>- ruamel.yaml is now used before PyYaml if installed on your system<br>- Fixed a bug where scalar type was not validated correctly.<br>- Unpin all dependencies but still maintain a minimum versions of each lib<br>- Allowed mixing of regex and normal keywords when matching a string (jmacarthur)<br><br><br>1.5.1 (Mar 6, 2016)<br>----------------<br><br>- Improvements to documentation (scottclowe).<br>- Improved code linting by reworking private variables in Rule class to now be properties and updated<br>  all code that used the old way.<br>- Improved code linting by reworking all Log messages to render according to pep standard.<br>  (By using %s and passing in variables as positional arguments)<br>- Fix bug when validating sequence and value should only be unicode escaped when a string<br>- Improve validation of timestamps.<br>- Improve float validation to now accept strings that is valid ints that uses scientific notation, \"1e-06\" for example.<br>- Update travis to test against python 3.6<br><br><br>1.5.0 (Sep 30, 2015)<br>--------------------<br><br>- float / number type now support range restrictions<br>- ranges on non number types (e.g. seq, string) now need to be non negative.<br>- Fixed encoding bug triggered when both regex matching-rule 'any' and 'all' found keyword that<br>  failed regex match.  Added failure unit tests to cover regex matching-rule 'any' and 'all' during<br>  failed regex match.  Updated allowed rule list to include matching-rule 'all'.<br>- Changed _validate_mappings method from using re.match to re.search.  This fixes bug related to<br>  multiple keyword regex using matching-rule 'any'.  Added success unit tests to test default, 'any',<br>  and 'all' matching-rule.<br><br><br>1.4.1 (Aug 27, 2015)<br>--------------------<br><br>- Added tests to sdist to enable downstream packaging to run tests. No code changes in this release.<br><br><br>1.4.0 (Aug 4, 2015)<br>-------------------<br><br>- Dropped support for python 3.2 becuase of unicode literals do not exists in python 3.2.<br>- Fixed logging &amp; raised exceptions when using unicode characters inside schemas/data/filenames.<br>- Reworked all RuleError exceptions to now have better exception messages.<br>- RuleError exceptions now have a unique 'error_key' that can make it easier to identify what error it is.<br>- Paths for RuleErrors have been moved inside the exception as a variable.<br>- Rewrote all SchemaConflict exceptions to be more human readable.<br><br><br>1.3.0 (Jul 14, 2015)<br>--------------------<br><br>- Rewrote most of the error messages to be more human readable. See `docs/Upgrade Instructions.md`<br>  for more details.<br>- It is now possible to use the exceptions that was raised for each validation error. It can be<br>  found in the variable `c.validation_errors_exceptions`. They contain more detailed information<br>  about the error.<br><br><br>1.2.0 (May 19, 2015)<br>--------------------<br><br>- This feature is NEW and EXPERIMENTAL.<br>  Implemented support for multiple values inside in a sequence.<br>  This will allow the defenition of different types that one sequence can contain. You can either require<br>  each value in the sequence to be valid against one to all of the different possibilities.<br>  Tests show that it still maintains backward compatibility with all old schemas but it can't be guarantee.<br>  If you find a regression in this release please file a bug report so it can be fixed ASAP.<br>- This feature is NEW and EXPERIMENTAL.<br>  Added ability to define python files that can be used to have custom python code/functions that can be<br>  called on all types so that custom/extra validation can be done on all data structures.<br>- Add new keyword 'func' that is a string and is used to point to a function loaded via the extension system.<br>- Add new keyword 'extensions' that can only be used on the top level of the schema. It is should be a list<br>  with strings of files that should be loaded by the extension system. Paths can be relative or absolute.<br>- New cli option '-e FILE' or '--extension FILE' that can be used to load extension files from cli.<br>- Fixed a bug where types did not raise exceptions properly. If schema said it should be a map but data was<br>  a sequence, no validation error was raised in earlier versions but now it raises a 'NotSequenceError' or <br>  'NotMappingError'.<br><br><br>1.1.0 (Apr 4, 2015)<br>-------------------<br><br>- Rework cli string that docopt uses. Removed redundant flags that docopt provides [--version &amp; --help]<br>- Add support for timestamp validation<br>- Add new runtime dependency 'python-dateutil' that is used to validate timestamps<br>- Change how 'any' keyword is implemented to now accept anything and not just the implemented types. (See Upgrade Instructions document for migration details)<br><br><br><br>1.0.1 (Mar 8, 2015)<br>-------------------<br><br>Switched back to semantic version numbering for this lib.<br><br>- After the release of `15.01` the version schema was changed back from the &lt;year&gt;.&lt;month&gt; style version schema back to semantic version names. One big problem with this change is that `pypi` can't handle the change back to semantic names very well and because of this I had to remove the old releases from pypi and replace it with a single version `1.0.1`.<br>- No matter what version you were using you should consider upgrading to `1.0.1`. The difference between the two versions is very small and contains mostly bugfixes and added improvements.<br>- The old releases can still be obtained from `github.com` and if you really need the old version you can add the download url to your `requirements.txt` file.<br><br><br>15.01 (Jan 17, 2015)<br>--------------------<br><br>- Fixed a bug in unique validation for mapping keys [See: PR-12] (Gonditeniz)<br><br><br><br>14.12 (Dec 24, 2014)<br>--------------------<br><br>- Fixed broken regex matching on map keys.<br>- Source files with file ending `.yml` can now be loaded<br>- Added aliases to some directives to make it easier/faster to write<br>   * `sequence` --&gt; `seq` <br>   * `mapping` --&gt; `map` <br>   * `required` --&gt; `req`<br>   * `regex` --&gt; `re`<br>- Reworked all testing files to reduce number of files<br><br><br><br>14.08 (Aug 24, 2014)<br>--------------------<br><br>- First version to be uploaded to pypi<br>- Keyword 'range' can now be applied to map &amp; seq types.<br>- Added many more test files.<br>- Keyword 'length' was removed because 'range' can handle all cases now.<br>- Keyword 'range' now correctly checks the internal keys to be integers<br>- Major update to testing and increased coverage.<br><br><br><br>14.06.1 (Jun 24, 2014)<br>----------------------<br><br>- New feature \"partial schema\". Define a small schema with a ID that can be reused at other places in the schema. See readme for details.<br>- New directive \"include\" that is used to include a partial schema at the specefied location.<br>- Cli and Core() now can handle multiple schema files.<br>- Directive \"pattern\" can no longer be used with map to validate all keys against that regex. Use \"regex;\" inside \"mapping:\"<br>- 'none' can now be used as a type<br>- Many more tests added<br><br><br><br>14.06 (Jun 7, 2014)<br>-------------------<br><br>- New version scheme [YY.MM(.Minor-Release)]<br>- Added TravisCI support<br>- Update runtime dependency docopt to 0.6.1<br>- Update runtime dependency pyyaml to 3.11<br>- Huge refactoring of logging and how it works. Logging config files is now removed and everything is alot simpler<br>- Cleanup some checks that docopt now handles<br>- New keyword \"regex;&lt;regex-pattern&gt;\" that can be used as a key in map to give more flexibility when validating map keys<br>- New keyword \"matching-rule\" that can be used to control how keys should be matched<br>- Added python 3.4 &amp; python 2.7 support (See TravisCI tests for status)<br>- Dropped python 3.1 support<br>- Alot of refactoring of testing code.<br>- Tests should now be runned with \"nosetests\" and not \"python runtests.py\"<br>- Refactored alot of exceptions to be more specific (SchemaError and RuleError for example) and not a generic Exception<br>- Parsed rules is now stored correctly in Core() so it can be tested from the outside<br><br><br><br>0.1.2 (Jan 26, 2013)<br>--------------------<br><br>- Added new and experimental validation rule allowempty. (See README for more info)<br>- Added TODO tracking file.<br>- Reworked the CLI to now use docopt and removede argparse.<br>- Implemented more typechecks, float, number, text, any<br>- Now suports python 3.3.x<br>- No longer support any python 2.x.y version<br>- Enabled pattern for map rule. It enables the validation of all keys in that map. (See README for more info)<br>- Alot more test files and now tests source_data and schema_data input arguments to core.py<br>- Alot of cleanup in the test suit<br><br><br><br>0.1.1 (Jan 21, 2013)<br>--------------------<br><br>- Reworked the structure of the project to be more clean and easy to find stuff.<br>- lib/ folder is now removed and all contents is placed in the root of the project<br>- All scripts is now moved to its own folder scripts/ (To use the script during dev the path to the root of the project must be in your python path somehow, recomended is to create a virtualenv and export the correct path when it activates)<br>- New make target 'cleanegg'<br>- Fixed path bugs in Makefile<br>- Fixed path bugs in Manifest<br><br><br><br>0.1.0 (Jan 20, 2013)<br>--------------------<br><br>- Initial stable release of pyKwalify.<br>- All functions is not currently implemented but the cli/lib can be used but probably with some bugs.<br>- This should be considered a Alpha release used for bug and stable testing and to be based on further new feature requests for the next version.<br>- Implemented most validation rules from the original Java version of kwalify. Some is currently not implemented and can be found via [NYI] tag in output, doc &amp; code.<br>- Installable via pip (Not the official online pip repo but from the releases folder found in this repo)<br>- Supports YAML &amp; JSON files from cli and any dict/list data structure if used in lib mode.<br>- Uses pythons internal logging functionality and default logging output can be changed by changing logging.ini (python 3.1.x) or logging.yaml (python 3.2.x) to change the default logging output, or use -v cli input argument to change the logging level. If in lib mode it uses your implemented python std logging.\n          </div>"}, "last_serial": 3302748, "releases": {"1.6.0": [{"comment_text": "", "digests": {"md5": "0930a185b065ba40cde59a18982f7cf0", "sha256": "0103a2680b5b00c82013c4605f6589939e943486e2aa4123b5c950873560bdda"}, "downloads": -1, "filename": "bfabio.pykwalify-1.6.0.tar.gz", "has_sig": false, "md5_digest": "0930a185b065ba40cde59a18982f7cf0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 63483, "upload_time": "2017-11-03T10:11:16", "upload_time_iso_8601": "2017-11-03T10:11:16.583301Z", "url": "https://files.pythonhosted.org/packages/79/ea/8342e08b5195d9d19db79200bbd2c1f2484345d007a91466fae9136c8aa0/bfabio.pykwalify-1.6.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "0930a185b065ba40cde59a18982f7cf0", "sha256": "0103a2680b5b00c82013c4605f6589939e943486e2aa4123b5c950873560bdda"}, "downloads": -1, "filename": "bfabio.pykwalify-1.6.0.tar.gz", "has_sig": false, "md5_digest": "0930a185b065ba40cde59a18982f7cf0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 63483, "upload_time": "2017-11-03T10:11:16", "upload_time_iso_8601": "2017-11-03T10:11:16.583301Z", "url": "https://files.pythonhosted.org/packages/79/ea/8342e08b5195d9d19db79200bbd2c1f2484345d007a91466fae9136c8aa0/bfabio.pykwalify-1.6.0.tar.gz", "yanked": false}], "timestamp": "Thu May  7 22:37:41 2020"}