{"info": {"author": "Scott Green/Nano Nano Ltd", "author_email": "scott@bitty.tax", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Console", "Intended Audience :: End Users/Desktop", "License :: OSI Approved :: GNU Affero General Public License v3", "Natural Language :: English", "Operating System :: MacOS", "Operating System :: Microsoft :: Windows", "Operating System :: POSIX", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3.8", "Topic :: Office/Business :: Financial :: Accounting"], "description": "![BittyTax logo](https://github.com/BittyTax/BittyTax/raw/master/img/BittyTax.png)\n[![Version badge][version-badge]][version] [![License badge][license-badge]][license] [![Python badge][python-badge]][python] [![Discord badge][discord-badge]][discord]\n# BittyTax\nBittyTax is a collection of command-line tools to help you manage your cryptoasset accounts. Allowing you to audit, value and calculate your annual UK Capital Gains and Income Tax.\n\nThis tool is designed to be used by someone who is already familiar with cryptoasset taxation rules in the UK. HMRC has published guidance, some useful links are provided in the [Resources](#resources) section at the end.\n\nBittyTax comprises of the following tools.\n\n1. `bittytax` - process your transaction records and generate a PDF tax report (see [Accounting Tool](#accounting-tool)) \n\n2. `bittytax_conv` - convert your wallet and exchange files into transaction records (see [Conversion Tool](#conversion-tool))\n\n3. `bittytax_price` - (optional) lookup historic price data for cryptoassets and foreign currencies (see [Price Tool](#price-tool))\n\n## Disclaimer\nThis software is copyright (c) Nano Nano Ltd, and licensed for use under the AGPLv3 License, see [LICENSE](https://github.com/BittyTax/BittyTax/blob/master/LICENSE) file for details.\n\nNano Nano Ltd does not provide tax, legal, accounting or financial advice. This software and its content are provided for information only, and as such should not be relied upon for tax, legal, accounting or financial advice.\n\nYou should obtain specific professional advice from a professional accountant, tax or legal/financial advisor before you take any action.\n\nThis software is provided 'as is', Nano Nano Ltd does not give any warranties of any kind, express or implied, as to the suitability or usability of this software, or any of its content.\n\n## Getting Started\n\n### Prerequisites\nYou need to have Python 2.7 or 3.x installed on your machine before you can install BittyTax. MacOS and most Linux distributions already come with Python pre-installed.\n\nIf you need to install Python we recommend you install Python 3.x, see https://wiki.python.org/moin/BeginnersGuide/Download for instructions.\n\n**Note:** BittyTax is currently in Beta version (see the [CHANGELOG](https://github.com/BittyTax/BittyTax/blob/master/CHANGELOG.md) file for details) it has been tested on MacOS and Windows 10, using both Python 2.7, and Python 3.7.\n\n### Installing\n\nTo install the latest release:\n```console\n    $ pip install BittyTax\n```\n\nor [download the ZIP file](https://github.com/BittyTax/BittyTax/archive/master.zip), unpack, navigate to the top level of the repository and install using:\n\n```console\n    $ python setup.py install\n```\n\nNote: This will install the latest unreleased version which may include untested changes, check the [CHANGELOG](https://github.com/BittyTax/BittyTax/blob/master/CHANGELOG.md).\n\n### Upgrade\n\nTo upgrade to the latest release:\n\n```console\n    $ pip install --upgrade BittyTax\n```\n\n## Transaction Records\nBittyTax is only as accurate as the data you provide it, it is essential that you keep records of ALL cryptoasset transactions - not just trades but also records of spending, gifts send and received, etc.\n\nThe `bittytax_conv` tool is provided to assist with this transaction record keeping, it allows data exported from various different wallets and exchanges to be processed into the format required by the `bittytax` accounting tool. Manual entry or editing of this data may also be required. It is vital that converted data files are reviewed against the raw data and audited before use.\n\nTransaction records can be stored in an Excel or CSV file. Excel is preferred as it makes editing and managing your data easier. Data can be split across multiple worksheets, for example, you might want to split up transactions by wallet or exchange, or by transaction type. With Excel you can also annotate your records, append additional data columns, or even include the original raw data for reference.\n\nA transaction record is represented as a row of data which contains the following fields in the order given.\n\n| Field | Type | Description |\n| --- | --- | ---|\n| Type | `Deposit` | Tokens deposited to a wallet you own  \n| | `Mining` | Tokens received as income from mining |\n| | `Income` | Tokens received as other income |\n| | `Gift-Received` | Tokens received as a gift |\n| | `Withdrawal` | Tokens withdrawn from a wallet you own |\n| | `Spend` | Tokens spent on goods or services |\n| | `Gift-Sent` | Tokens sent as a gift |\n| | `Charity-Sent` | Tokens sent to a charity as a gift |\n| | `Trade` | Tokens exchanged for another token or fiat currency |\n| Buy Quantity | | Quantity of the asset acquired |\n| Buy Asset | | Symbol name of the asset acquired |\n| Buy Value | | Value in UK pounds (GBP) of the asset acquired |\n| Sell Quantity | |  Quantity of the asset disposed |\n| Sell Asset | | Symbol name  of the asset disposed |\n| Sell Value | | Value in UK pounds (GBP) of the asset disposed |\n| Fee Quantity | | Quantity of the fee |\n| Fee Asset | | Symbol name of the asset used for fees |\n| Fee Value | | Value in UK ponds (GBP) of the fee |\n| Wallet | | Name of wallet |\n| Timestamp | | Date/time of transaction |\n\nThe transaction Type dictates which fields in the row are required, either (M)andatory or (O)ptional.   \n\n| Type | Buy Quantity | Buy Asset | Buy Value | Sell Quantity | Sell Asset | Sell Value | Fee Quantity | Fee Asset | Fee Value | Wallet | Timestamp |\n| --- | --- | --- | --- | --- | --- | --- | --- | --- | --- | ---| --- |\n| `Deposit` | M | M |   |||| O | O |  | O | M |\n| `Mining` | M | M | O |||| O | O | O| O | M |\n| `Income` | M | M | O |||| O | O | O| O | M |\n| `Gift-Received` | M | M | O |||| O | O | O| O | M |\n| `Withdrawal` |||| M | M |   | O | O |   | O | M |\n| `Spend` |||| M | M | O | O | O | O | O | M |\n| `Gift-Sent` |||| M | M | O | O | O | O | O | M |\n| `Charity-Sent` |||| M | M | O | O | O | O | O | M |\n| `Trade` | M | M | O | M | M | O | O | O | O | O | M\n\n- If fees are specified, the Buy or Sell Quantity should be the gross amount (i.e. prior to any fee adjustment).\n\n- The Buy Value, Sell Value and Fee Value fields are always optional, if you don't provide a fixed value, bittytax will calculate the value for you via one of it's price data sources.\n\n- Wallet name is optional, but recommended if you want to audit your cryptoasset balances across multiple wallets.  \n\n- Timestamp should be in the format `YYYY-MM-DDTHH:MM:SS ZZZ`, recognised timezones (ZZZ) are GMT, BST and UTC.\n\n- Cryptoasset symbol names need to be consistent throughout your transaction records. For example, Bitcoin Cash was referred to as both BCC and BCH at the time of the first fork, but also more recently as BCHABC or BAB. The symbol name you choose should match the symbol name used by the price data source, otherwise valuations will fail, see [Price Tool](#price-tool) for more information.\n\n- Transaction records can be listed in any order, bittytax will sort them by Timestamp before processing.\n\nExample files are provided in both [Excel](https://github.com/BittyTax/BittyTax/blob/master/data/example.xlsx) and [CSV](https://github.com/BittyTax/BittyTax/blob/master/data/example.csv) format.\n\n### Deposit\nA `Deposit` is a transfer transaction record, indicating the receipt of cryptoasset tokens to a wallet you control. For example, you might have deposited tokens to a wallet on an exchange, ready to be traded.\n\nDeposit should NOT be used to record transfers to someone else's wallet, this would be categorised as either a `Gift-Sent` or  a `Spend`. \n\nThere should be an equivalent `Withdrawal` transaction record for every deposit, since tokens are always moving out of one wallet into another. The quantity of tokens deposited will normally be less than the quantity withdrawn due to network transaction fees. Deposits and Withdrawals are not taxable events. \n\nThe Deposit type can also be used to record fiat deposits into an exchange, although this is not used for tax calculations it will be used for auditing purposes.\n\n### Withdrawal\nA `Withdrawal` is a transfer transaction record, it indicates tokens being sent from a wallet you control. It is always used in combination with a `Deposit` transaction.\n\nThe Withdrawal type can also be used to record fiat withdrawals from an exchange.\n\n### Mining\nThe `Mining` transaction type is used to identify tokens received as income from mining. The `Income` transaction type could also be used to record this, its use is purely descriptive.\n\nThese transaction records will appear within your income tax report.\n\n### Income\nThe `Income` transaction type is used to identify tokens received as other income.\n\nThese transaction records will appear within your income tax report.\n\n### Gift-Received\nThe `gift-received` transaction type is used to record cryptoasset tokens received as a gift.\n\nA gift received is not taxed as income.\n\n### Spend\nA `Spend` is a disposal transaction record, it's used to capture the spending of tokens on goods or services.\n\nAs a disposal transaction, it is applicable for Capital Gains tax.\n\n### Gift-Sent\nA `Gift-Sent` is a disposal transaction record, it identifies cryptoasset tokens sent as a gift.\n\nAs a disposal transaction, it is applicable for Capital Gains tax.\n\n### Charity-Sent\nA `Charity-Sent` is a disposal transaction record, it identifies cryptoasset tokens sent to a charity as a gift. It's handling is the same as a `Gift-Sent`, it's purpose is purely descriptive.\n\n### Trade\nThe `Trade` transaction type records the exchange of one cryptoasset for another, or for fiat currency.\n\nThis could be for one for the following reasons.\n\n- Fiat-to-crypto *(acquisition)*\n- Crypto-to-crypto *(disposal)*\n- Crypto-to-fiat *(disposal)*\n\nIn the case of a fiat-to-crypto trade, the Sell Asset would be fiat, i.e. GBP, or whatever currency you used, and Sell Quantity would contain the amount. There is no reason to specify the Sell Value if the currency is GBP.\n\nIn the opposite case, crypto-to-fiat, the Buy Asset would be fiat, and the Buy Quantity the amount in fiat.\n\nTrades which are a *disposal* are applicable for Capital Gains tax.\n\n### Other types?\nBelow is a list of some other situations which you might need to record, but which don't have a specific transaction type defined. These could be added in the future if users feel it would be of benefit.\n\n1. **Airdrop** - These tokens can be recorded as either a `Gift-Received`, if nothing was done in return for them, or `Income` if the distribution of tokens was dependant upon providing a service or other conditions, see [HMRC Guidance on Airdrops](https://www.gov.uk/government/publications/tax-on-cryptoassets/cryptoassets-for-individuals#airdrops).  \n1. **Dust clean** - Some exchanges remove very small amounts (dust) of cryptoasset tokens from wallets after a period of time, since these are too small to be traded or withdrawn. This can be captured as a `Spend` with a Sell Value of 0.  \n1. **Fork** - If a cryptoasset you own forks, and a new cryptoasset is created, this can be recorded as a `Gift-Received` but with a Buy Value of 0. This assumes that you are not splitting the cost between the original and new cryptoasset. Currently it is not possible to derive a cost from the original cryptoasset and apportion this to the new one. See [HMRC Guidance on Blockchain forks](https://www.gov.uk/government/publications/tax-on-cryptoassets/cryptoassets-for-individuals#fork).\n1. **Gift to spouse** - If cryptoasset tokens are gifted to your spouse, it can be recorded as a `Gift-Sent` but with a Sell Value of 0.\n1. **Margin funding** - Tokens received from an exchange in return for margin funding can be captured as `Income`.\n1. **Lost** - Tokens which have been lost, i.e. the private keys are unrecoverable, have to be reported/accepted by HMRC as a *\"negligible value claim\"*. These are treated as a disposal, followed by a re-acquisition for the amount lost, since technically you still own the cryptoasset. This can be recorded as a crypto-to-fiat `Trade` with a GBP cost of 0, followed by a fiat-to-crypto `Trade` for exactly the same quantity of the cryptoasset, also with a cost of 0. See [HMRC Guidance on losing public and private keys](https://www.gov.uk/government/publications/tax-on-cryptoassets/cryptoassets-for-individuals#losing-public-and-private-keys).\n1. **Staking** - Tokens received from Proof of Stake (POS) can be recorded as `Mining` or `Income`.\n\n## Accounting Tool\nOnce you have all of your transaction records stored in an Excel or CSV file you can use `bittytax` to process them and generate your report.\n\n    bittytax <filename>\n\n### PDF Report\nBy default the report is given the filename `BittyTax_Report.pdf`. You can see an example file [here](https://github.com/BittyTax/BittyTax/blob/master/data/BittyTax_Report.pdf).\n\nIf you want to use a different filename or to specify a folder, you can use the `-o` option as shown below.\n\n    bittytax <filename> -o <output_filename>\n\nThe PDF generator can be a bit slow when handling large amounts of data. If you prefer, you can output the report to the terminal window by using the `--nopdf` option.\n\n    bittytax <filename> --nopdf\n\nThe report is split into the following sections.\n\n1. [Audit](#audit)\n2. [Tax Report](#tax-report) (per year)\n3. Appendix - [Price Data](#price-data) (per year)\n4. Appendix - [Current Holdings](#current-holdings)\n\n#### Audit\nThe imported transaction records are audited by calculating what the final balances should be for each asset in your wallet.\n\nIf the balances listed in the report don't match, it could be that your transaction records are incomplete.\n\nIf you do get issues, you can use the `-d` or `--debug` option to turn on logging (see [Audit Transaction Records](#audit-transaction-records)).\n\nAlthough important, the audit can be disabled by using the `-s` or `--skipaudit` option.\n\n#### Tax Report\nBy default, tax reports are produced for all years which contain taxable events.\n\nIf you only want a report for a specific year you can do this using the `-ty` or `--taxyear` option. \n\n    bittytax <filename> -ty 2020\n\nFull details of the tax calculations can be seen by turning on the debug output (see [Processing](#processing)).\n\n#### Capital Gains\nCryptoasset disposals are listed in date order and by asset.\n\nFor a \"Bed and Breakfast\" disposal, the date of the buyback is given in brackets.\n\nIf a disposal results in a loss, the negative amount is highlighted in red.\n\nTotals are listed per asset (if more than 1 disposal) as well as the totals for that tax year.\n\nThe **Summary** section provides enough information for you to complete the \"Other property, assets and gains\" section within your self assessment tax return, or to give to your accountant to complete.\n\nIf the disposal proceeds exceed more than 4 times the annual tax-free allowance this is shown. HMRC requires you to report this in your self assessment even if the gain was within your annual allowance.\n\nHMRC also requires you to include details of each gain or loss. You can use the `--summary` option in combination with `--taxyear` to generate a PDF report which only includes the capital gains disposals and summary for that specific tax year, this can then be attached to your self assessment.\n\nThe **Tax Estimate** section is given purely as an estimate. Capital gains tax figures are calculated at both the basic and higher rate, and take into consideration the full tax-free allowance.  \n\nObviously you would need to take into account other capital gains/losses in the same year, and use the correct tax rate according to your income. Always consult with a professional accountant before filing.\n\n#### Income\nIncome events are listed in date order and by asset, with totals per asset (if more than 1 event).\n\nTotals are also given per Income Type (i.e `Mining` and `Income`), as well as the totals for that tax year.\n\nYou should check with an accountant for how this should be reported according to your personal situation.\n\n#### Price Data\nThe appendix section contains all the historic price data which bittytax has used in the tax calculations.\n\nThis includes both fiat and crypto prices, split by tax year.\n\nIt is important to check that the symbol names of your assets have been interpreted correctly, and that the prices look reasonable, otherwise your tax calculations will be incorrect. See [Price Tool](#price-tool) for more information on how price data is retrieved.\n\nLinks are provided against each price, pointing to the exact data source API which was used to retrieve the data. \n\n#### Current Holdings\nThe appendix section also contains details of your remaining cryptoasset balances. The cost (including fees), the current valuation, and the calculated gain (or loss) are shown.\n\nBy default, empty wallets are excluded, this setting can be changed in the config file, see [Config](#config).\n\nThe data source used for the current price is the same used for historic price data.\n\n### Processing\nYou can turn on debug using the `-d` or `--debug` option to see full details of how the transaction records are processed.\n\n1. [Import Transaction Records](#import-transaction-records)\n2. [Audit Transaction Records](#audit-transaction-records)\n3. [Split Transaction Records](#split-transaction-records)\n3. [Pool Same Day](#pool-same-day)\n4. [Match \"same day\" Rule](#match-same-day-rule)\n5. [Match \"bed and breakfast\" Rule](#match-bed-and-breakfast-rule)\n6. [Process Unmatched (Section 104)](#process-unmatched-section-104)\n7. [Process Income](#process-income)\n\n#### Import Transaction Records\nFirst the transaction records are imported and validated according to their transaction type, making sure that the correct mandatory and optional fields are included.\n\nIn the log, the worksheet name (Excel only) and row number are shown against the raw record data being imported.\n\nEmpty rows are allowed, and filtered out during the import.\n\nEach record is given a unique Transaction ID (TID), these are allocated in chronological order (using the timestamp) regardless of the file ordering.\n\n```\nINFO -- : ==IMPORT TRANSACTION RECORDS FROM EXCEL FILE: example.xlsx ==\nDEBUG -- : 'Sheet1' Row[2]: ['Deposit', '870.0', 'GBP', '', '', '', '', '', '', '', 'LocalBitcoins', '2013-05-24T20:16:46 UTC'] TID:1\nDEBUG -- : 'Sheet1' Row[3]: ['Trade', '10.0', 'BTC', '', '870.0', 'GBP', '', '', '', '', 'LocalBitcoins', '2013-05-24T20:17:40 UTC'] TID:2\nDEBUG -- : 'Sheet1' Row[4]: ['Withdrawal', '', '', '', '10.0', 'BTC', '', '', '', '', 'LocalBitcoins', '2013-05-24T20:20:49 UTC'] TID:3\nDEBUG -- : 'Sheet1' Row[5]: ['Deposit', '10.0', 'BTC', '', '', '', '', '', '', '', 'Desktop wallet', '2013-05-24T21:20:49 BST'] TID:4\nDEBUG -- : 'Sheet1' Row[6]: ['Deposit', '2693.8', 'USD', '', '', '', '', '', '', '', 'Bitstamp', '2014-05-29T08:33:00 UTC'] TID:5\nDEBUG -- : 'Sheet1' Row[7]: ['Spend', '', '', '', '0.002435', 'BTC', '0.8', '', '', '', 'Desktop wallet', '2014-06-26T12:25:02 BST'] TID:6\nDEBUG -- : 'Sheet1' Row[8]: ['Gift-Sent', '', '', '', '0.02757', 'BTC', '', '', '', '', 'Desktop wallet', '2014-07-18T14:12:47 BST'] TID:7\nDEBUG -- : 'Sheet1' Row[9]: ['Trade', '0.41525742', 'BTC', '', '257.53', 'USD', '', '1.29', 'USD', '', 'Bitstamp', '2014-07-23T10:58:00 UTC'] TID:8\nDEBUG -- : 'Sheet1' Row[10]: ['Trade', '0.58474258', 'BTC', '', '362.63', 'USD', '', '1.82', 'USD', '', 'Bitstamp', '2014-07-23T10:58:00 UTC'] TID:9\n```\n#### Audit Transaction Records\nThe audit function takes the transaction records, and then replays them in chronological order.\n\nThe simulation of tokens (and also fiat) being moved between wallets allows you to compare the calculated final balances against your real world wallets and exchange balances.\n\nBittytax will raise a warning if a cryptoasset balance goes negative during the audit, this could happen if the time ordering of your transaction records is not accurate.\n\nThe log shows for each transaction record (TR) which wallets are being updated.\n\nThe wallet name and asset name are shown with its balance, and in brackets the quantity that has been added or subtracted.\n\n```console\nINFO -- : == AUDIT TRANSACTION RECORDS==\n...\nDEBUG -- : TR [TID:8] Trade: 0.41525742 BTC <- 257.53 USD + Fee=1.29 USD 'Bitstamp' 2014-07-23T11:58:00 BST\nDEBUG -- : Bitstamp:BTC=0.41525742 (+0.41525742)\nDEBUG -- : Bitstamp:USD=2,436.27 (-257.53)\nDEBUG -- : Bitstamp:USD=2,434.98 (-1.29)\nDEBUG -- : TR [TID:9] Trade: 0.58474258 BTC <- 362.63 USD + Fee=1.82 USD 'Bitstamp' 2014-07-23T11:58:00 BST\nDEBUG -- : Bitstamp:BTC=1 (+0.58474258)\nDEBUG -- : Bitstamp:USD=2,072.35 (-362.63)\nDEBUG -- : Bitstamp:USD=2,070.53 (-1.82)\nDEBUG -- : TR [TID:10] Trade: 0.86 BTC <- 521.16 USD + Fee=2.51 USD 'Bitstamp' 2014-07-24T14:08:00 BST\nDEBUG -- : Bitstamp:BTC=1.86 (+0.86)\nDEBUG -- : Bitstamp:USD=1,549.37 (-521.16)\nDEBUG -- : Bitstamp:USD=1,546.86 (-2.51)\nDEBUG -- : TR [TID:11] Trade: 0.9 BTC <- 545.7 USD + Fee=2.51 USD 'Bitstamp' 2014-07-24T14:08:00 BST\nDEBUG -- : Bitstamp:BTC=2.76 (+0.9)\nDEBUG -- : Bitstamp:USD=1,001.16 (-545.7)\nDEBUG -- : Bitstamp:USD=998.65 (-2.51)\nDEBUG -- : TR [TID:12] Trade: 1.64037953 BTC <- 994.07 USD + Fee=4.58 USD 'Bitstamp' 2014-07-24T14:09:00 BST\nDEBUG -- : Bitstamp:BTC=4.40037953 (+1.64037953)\nDEBUG -- : Bitstamp:USD=4.58 (-994.07)\nDEBUG -- : Bitstamp:USD=0 (-4.58)\nDEBUG -- : TR [TID:13] Withdrawal: 4.40037953 BTC 'Bitstamp' 2014-07-24T22:01:00 BST\nDEBUG -- : Bitstamp:BTC=0 (-4.40037953)\n```\n\n#### Split Transaction Records\nBefore any tax calculations can take place, transaction records need to be split into their constitute parts, in terms of cryptoasset buys and cryptoasset sells, each with their own valuation in GBP.\n\nThis requires the buy, sell and fee assets in the transaction record first to be given a valuation, that is unless a fixed value has already been specified, or the asset is already in GBP.\n\nValuations are calculated via one of the historic price date sources, see [Price Tool](#price-tool) for how.\n\nNote that `Deposit` and `Withdrawal` transactions are not taxable events so no valuation is required.\n\nIn the log, any transaction buys (T-Buy) or sells (T-Sell) that are created by the split are shown below the transaction record (TR). These transactions have unique TIDs allocated sequentially based on the parent transaction ID, i.e. (34.1, 34.2, 34.3, etc).\n\nIf historic price data has been used for the valuation, it is indicated by the `~` symbol, fixed values are show as `=`.\n\nGBP values are displayed with 2 decimal places, although no actual rounding has taken place. Rounding only happens when a taxable event is recorded.\n\nTimestamps are normalised to be in local time (GMT or BST), this is so that tax calculations for the same day will be correct.\n\n##### Fee Handling\nEach buy or sell transaction can include a fee. Its value is populated by the fee specified in the transaction record.\n\nIf a transaction record involves more than one cryptoasset (i.e. a `Trade` crypto-to-crypto) then the fee's valuation has to be split evenly between the buy and sell transactions.\n\nIf the fee asset is also a cryptoasset, then paying the fee counts as a separate disposal. This is recorded by adding an additional `Spend` transaction.\n\nSince `Deposit` and `Withdrawal` transactions are not taxable, any additional `Spend` transactions created for these are also flagged as non-taxable.\n\nNon-taxable transactions are marked with `*` in the log and have no GBP valuation.\n\n```console\nINFO -- : ==SPLIT TRANSACTION RECORDS==\n...\nDEBUG -- : TR [TID:2] Trade: 10 BTC <- 870 GBP 'LocalBitcoins' 2013-05-24T20:17:40 UTC\nDEBUG -- : T-Buy [TID:2.1] Trade: 10 BTC (=£870.00 GBP) 'LocalBitcoins' 2013-05-24T21:17:40 BST\n...\n\nDEBUG -- : TR [TID:32] Withdrawal: 7.0002 BTC 'Desktop wallet' 2017-03-24T22:57:44 GMT\nDEBUG -- : T-Sell* [TID:32.1] Withdrawal: 7.0002 BTC 'Desktop wallet' 2017-03-24T22:57:44 GMT\nDEBUG -- : TR [TID:33] Deposit: 7 BTC 'Poloniex' 2017-03-24T22:57:44 UTC\nDEBUG -- : T-Buy* [TID:33.1] Deposit: 7 BTC 'Poloniex' 2017-03-24T22:57:44 GMT\nDEBUG -- : TR [TID:34] Trade: 1.00000013 ETH <- 0.03729998 BTC + Fee=0.0015 ETH 'Poloniex' 2017-04-12T19:38:26 UTC\nDEBUG -- : Price on 2017-04-12, 1 BTC=969.6202 GBP via CoinDesk (Bitcoin)\nDEBUG -- : Price on 2017-04-12, 1 BTC=£969.62 GBP, 0.03729998 BTC=£36.17 GBP\nDEBUG -- : T-Buy [TID:34.1] Trade: 1.00000013 ETH (~£36.17 GBP) + Fee=~£0.03 GBP 'Poloniex' 2017-04-12T20:38:26 BST\nDEBUG -- : T-Sell [TID:34.2] Trade: 0.03729998 BTC (~£36.17 GBP) + Fee=~£0.03 GBP 'Poloniex' 2017-04-12T20:38:26 BST\nDEBUG -- : T-Sell [TID:34.3] Spend: 0.0015 ETH (~£0.05 GBP) 'Poloniex' 2017-04-12T20:38:26 BST\n\n```\n\n### Pool Same Day\nHMRC stipulates that [\"*All shares of the same class in the same company acquired by the same person on the same day and in the same capacity are treated as though they were acquired by a single transaction*\"](https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg51560#IDATX33F) this applies in the same way to disposals.\n\nTokens of the same cryptoasset, acquired on the same day, are pooled together into a single buy transaction, the same applies for tokens disposed of on the same day. These are pooled into a single sell transaction.\n\nOnly taxable transactions (i.e. acquisitions and disposals) are included within these pools.\n\nPooled transactions are indicated by a transaction count at the end, shown within square brackets. The transactions contained within the pool are then indented below it.\n\n```console\nINFO -- : ==POOL SAME DAY TRANSACTIONS==\nDEBUG -- : T-Buy [TID:2.1] Trade: 10 BTC (=£870.00 GBP) 'LocalBitcoins' 2013-05-24T21:17:40 BST\nDEBUG -- : T-Sell* [TID:3.1] Withdrawal: 10 BTC 'LocalBitcoins' 2013-05-24T21:20:49 BST\nDEBUG -- : T-Buy* [TID:4.1] Deposit: 10 BTC 'Desktop wallet' 2013-05-24T21:20:49 BST\nDEBUG -- : T-Sell [TID:6.1] Spend: 0.002435 BTC (=£0.80 GBP) 'Desktop wallet' 2014-06-26T12:25:02 BST\nDEBUG -- : T-Sell [TID:7.1] Gift-Sent: 0.02757 BTC (~£10.14 GBP) 'Desktop wallet' 2014-07-18T14:12:47 BST\nDEBUG -- : T-Buy [TID:8.1] Trade: 1 BTC (~£364.22 GBP) + Fee=~£1.83 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [2]\nDEBUG -- :   T-Buy [TID:8.1] Trade: 0.41525742 BTC (~£151.25 GBP) + Fee=~£0.76 GBP 'Bitstamp' 2014-07-23T11:58:00 BST\nDEBUG -- :   T-Buy [TID:9.1] Trade: 0.58474258 BTC (~£212.97 GBP) + Fee=~£1.07 GBP 'Bitstamp' 2014-07-23T11:58:00 BST\n```\n\n### Match \"same day\" Rule\nSee [\"*The “same day” rule TCGA92/S105(1)*\"](https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg51560#IDATX33F).\n\nThis tax function matches any buy and sell transactions, of the same cryptoasset, that occur on the same day. \n\nIf the buy and sell quantities do not match, the transaction with the larger quantity will be split into two, and the cost and fee apportioned between them.\n\nThis allows a gain, or a loss, to be calculated for the matching transactions, taking into consideration the combined fees. The transaction containing the remainder is then carried forward, and used in further tax calculations.\n\nIn the log, you can see which transactions have been \"*Same Day*\" matched, and where a buy or sell has been split.  \n\nNew transactions created by a split are allocated the next TID in sequence.\n\n```console\nINFO -- : ==MATCH SAME DAY TRANSACTIONS==\n...\nDEBUG -- : T-Sell [TID:34.3] Spend: 0.62207655 ETH (~£22.50 GBP) 'Poloniex' 2017-04-12T20:38:26 BST [4]\nDEBUG -- : T-Buy [TID:34.1] Trade: 249.23062521 ETH (~£9,012.71 GBP) + Fee=~£11.25 GBP 'Poloniex' 2017-04-12T20:38:26 BST [4] (Same Day)\nDEBUG -- : split: T-Buy [TID:34.4] Trade: 0.62207655 ETH (~£22.50 GBP) + Fee=~£0.03 GBP 'Poloniex' 2017-04-12T20:38:26 BST [4]\nDEBUG -- : split: T-Buy [TID:34.5] Trade: 248.60854866 ETH (~£8,990.22 GBP) + Fee=~£11.22 GBP 'Poloniex' 2017-04-12T20:38:26 BST [4]\nDEBUG -- :  Gain=£-0.03 (proceeds=£22.50 - cost=£22.50 - fees=£0.03)\n```\n\n### Match \"bed and breakfast\" Rule\n\nSee [\"*The “bed and breakfast” rule TCGA92/S106A(5) and (5A)*\"](https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg51560#IDATR33F).\n\nThis tax functions matches sells to buybacks of the same cryptoasset which occur within 30 days.\n\nAs with the [\"same day\"](#match-same-day-rule) rule, if the buy and sell quantities do not match, the transactions will be split. \n\nTransactions are sorted by timestamp, and matched in chronological order.\n\nAny matched \"same day\" transactions are excluded from this rule.\n\nIn the log, you can see which transactions have been matched by the \"*Bed & Breakfast*\" rule, the number of days between the sell and buyback are also shown.   \n\n```console\nINFO -- : ==MATCH BED & BREAKFAST TRANSACTIONS==\n...\nDEBUG -- : T-Sell [TID:18.2] Trade: 5.32294271 BTC (~£1,474.69 GBP) + Fee=~£1.47 GBP 'Poloniex' 2016-01-27T22:09:19 GMT [5]\nDEBUG -- : T-Buy [TID:23.5] Trade: 5.54195456 BTC (~£1,471.32 GBP) + Fee=~£1.47 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [9] (Bed & Breakfast, 2 days)\nDEBUG -- : split: T-Buy [TID:23.6] Trade: 5.32294271 BTC (~£1,413.17 GBP) + Fee=~£1.41 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [9]\nDEBUG -- : split: T-Buy [TID:23.7] Trade: 0.21901185 BTC (~£58.14 GBP) + Fee=~£0.06 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [9]\nDEBUG -- :  Gain=£58.63 (proceeds=£1,474.69 - cost=£1,413.17 - fees=£2.89)\n```\n\n### Process Unmatched (Section 104)\nAny transactions which remain unmatched are processed according to Section 104 Taxation of Capital Gains Act 1992.\n\nEach cryptoasset is held in its own pool, known as a Section 104 holding, the unmatched transactions are processed in chronological order.\n\nAs tokens are acquired, the total cost and total fees for that cryptoasset holding increases.\n\nIf all tokens in a holding are disposed of, the cost will be the total cost of that cryptoasset holding, and likewise, the fees would be the total fees.\n\nIf only some tokens are disposed of, the cost is calculated as a fraction of the total cost. This fraction is calculated by the number of tokens disposed of, divided by the total number of tokens held. The fees are also calculated as a fraction in the same way.\n\nThe gain or loss, is then calculated by subtracting this cost and any fees from the proceeds of the disposal. Fees are included from both the Section 104 holding (acquisition fees) and also the disposal fee.\n\nFor non-taxable transactions such as `Withdrawal` and `Deposit`, the tokens are removed, and then re-added to the holding, but at zero cost. \n\n**NOTE:** It is important that no disposal event happens to a holding between a `Withdrawal` and a `Deposit`. This is because the tokens are removed temporarily, so would impact the cost calculation.\n\nIn the log, before the Section 104 calculations, the updated transactions are listed for clarity, this includes any new \"split\" transactions which have been added by the matching function.\n\nTransactions which have been matched, and so excluded from the Section 104 holding, are denoted with (M) at the end.\n```console\nDEBUG -- : ==UPDATED TRANSACTIONS==\nDEBUG -- : T-Buy [TID:2.1] Trade: 10 BTC (=£870.00 GBP) 'LocalBitcoins' 2013-05-24T21:17:40 BST\nDEBUG -- : T-Sell* [TID:3.1] Withdrawal: 10 BTC 'LocalBitcoins' 2013-05-24T21:20:49 BST\nDEBUG -- : T-Buy* [TID:4.1] Deposit: 10 BTC 'Desktop wallet' 2013-05-24T21:20:49 BST\nDEBUG -- : T-Sell [TID:6.1] Spend: 0.002435 BTC (=£0.80 GBP) 'Desktop wallet' 2014-06-26T12:25:02 BST (M)\nDEBUG -- : T-Sell [TID:7.1] Gift-Sent: 0.02757 BTC (~£10.14 GBP) 'Desktop wallet' 2014-07-18T14:12:47 BST (M)\nDEBUG -- : T-Buy [TID:8.2] Trade: 0.002435 BTC (~£0.89 GBP) + Fee=~£0.00 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [2] (M)\nDEBUG -- : T-Buy [TID:8.4] Trade: 0.02757 BTC (~£10.04 GBP) + Fee=~£0.05 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [2] (M)\nDEBUG -- : T-Buy [TID:8.5] Trade: 0.969995 BTC (~£353.29 GBP) + Fee=~£1.77 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [2]\n```\n\nAs the unmatched transactions are processed, the impact it has on the individual holding is shown in the log.\n\nWhen a disposal takes place, the gain calculation is then shown below. \n\n```console\nINFO -- : ==PROCESS UNMATCHED TRANSACTIONS==\n...\nDEBUG -- : T-Buy [TID:18.5] Trade: 843.00981977 ETH (~£1,471.74 GBP) + Fee=~£1.47 GBP 'Poloniex' 2016-01-27T22:04:21 GMT [5]\nDEBUG -- : ETH=843.00981977 (+843.00981977) cost=£1,471.74 GBP (+£1,471.74 GBP) fees=£1.47 GBP (+£1.47 GBP)\nDEBUG -- : T-Sell [TID:23.2] Trade: 843.00981977 ETH (~£1,474.27 GBP) + Fee=~£1.47 GBP 'Poloniex' 2016-01-29T14:12:31 GMT [9] (Disposal)\nDEBUG -- : ETH=0 (-843.00981977) cost=£0.00 GBP (-£1,471.74 GBP) fees=£0.00 GBP (-£1.47 GBP)\nDEBUG -- :  Gain=£-0.42 (proceeds=£1,474.27 - cost=£1,471.74 - fees=£2.95)\n```\n\n### Process Income\nThis function searches through all the original transactions, and records any that are applicable for income tax. Currently this is only `Mining` and `Income` transaction types.\n\n## Conversion Tool\nThe bittytax conversion tool `bittytax_conv` takes all of the data files exported from your wallets and exchanges, normalises these into the transaction record format required by bittytax, and consolidates them into a single Excel spreadsheet for you to review, make edits, and add any missing records.\n\nDon't worry if you don't have Microsoft Excel installed, these spreadsheets also work with [OpenOffice](https://www.openoffice.org) or [LibreOffice](https://www.libreoffice.org).\n\nEach converted file appears within its own worksheet, data files of the same format are aggregated together. The transaction records and the original raw data appear side by side, sorted by timestamp, making it easier for you to review and to provide traceability.\n\nThe converter takes care of all the cell formatting to ensure that all decimal places are displayed correctly, and if numbers exceed 15-digits of precision (an Excel limitation) they are stored as text to prevent any truncation.\n\nFor most wallet files, transactions can only be categorised as deposits or withdrawals. You will need to edit these to reflect your real transactions, i.e. spends, gifts, income, etc. With Excel it's easy, the valid options are selectable via a dropdown menu.\n\n**Wallets:**\n- Electrum\n- Ledger Live\n- Qt Wallet (i.e. Bitcoin Core)\n- Trezor\n\n**Exchanges:**\n- Binance\n- Bitfinex\n- Bitstamp\n- Bittrex\n- ChangeTip \n- Circle\n- Coinbase\n- Coinbase Pro\n- Coinfloor\n- Cryptopia\n- Cryptsy\n- Gatehub\n- HitBTC\n- KuCoin\n- OKEx\n- Poloniex\n- TradeSatoshi\n- Uphold\n- Wirex\n\n**Explorers:**\n- Etherscan\n\n### Usage\nThe help command displays a full list of recognised data file formats, as well as details of all command line arguments.\n\n    bittytax_conv --help\n\nTo use the conversion tool (assuming you've already exported your data), just enter the filenames of all your data files, in any order, as command arguments.\n\nMost terminals allow you to drag and drop files from the desktop into the terminal window, this saves you time by giving you the correct file path without having to enter it manually.\n\n    bittytax_conv <filename> [<filename> ...]\n\nEach file is analysed to try and match it against one of the recognised formats. If successful, an Excel file will be generated with the default filename `BittyTax_Records.xlsx`. Unrecognised files are skipped and a warning displayed.\n\nIf you want to change the default filename you can use the `-o` argument followed by the output filename.\n\n    bittytax_conv <filename> [<filename> ...] -o <output filename>\n\n### Duplicate Records\n\nFor some exchanges you have to repeatedly download your transaction history, this can happen if the exchange only lets you run a report for the previous 3 months.\n\nIf you have multiple export files for the same exchange, these can all be passed into the conversion tool which by default will group them together into the same worksheet and sort them by timestamp.\n\nIf there is any overlap in the reporting period this can result in duplicate entries which will cause your data not to balance.\n\nOne solution is to manually remove these duplicates, another is for the conversion tool to do it for you by specifying the `--duplicates` argument.\n\nThis option should be used with care, since some exchange files can appear to have exact duplicates, but can be due to partially filled orders within the exact same time period, with same order id and even same amount!\n\n### Unidentified Cryptoassets\n\nSome wallet exports do not specify the actual cryptoasset being used. This will result in an error when the file is processed.\n\nThe `-ca` or `--cryptoasset` argument can be used to manually specify the asset.\n\n    bittytax_conv -ca BTC <filename>\n\nIf you have multiple wallet files with this issue, you can either process each one individually, and then consolidate them into a single spreadsheet. Or you could edit the asset name in the spreadsheet for any which are incorrect.\n\n### Output Formats\n\nThe default output format is Excel, but you can also choose CSV or RECAP by using the `--format` argument.\n\n**CSV**\n\nCSV is the legacy format used by bittytax which outputs transaction records directly into the terminal window, unless an output filename is specified.\n\nA useful feature of the CSV format is that the output can be piped directly into bittytax.\n\n    bittytax_conv --format CSV <filename> | bittytax\n\nThis will instantly show you what the remaining balance of each asset should be for that wallet or exchange file. Bear in mind that for some exchanges (I will try and list them below) the data provided will not balance exactly. This is probably due to the rounding used in the export file being different to that used internally by the exchange.\n\n**Recap**\n\nYou can also use the conversion tool to convert your wallet or exchange files into the import CSV format used by Recap (see https://help.recap.io/en/articles/2631702-importing-csvs-into-custom-accounts).\n\n    bittytax_conv --format RECAP <filename>\n\n### Notes:\n1. Some exchanges only allow the export of trades, this means transaction records of deposits and withdrawals will have to be created manually, otherwise the assets will not balance.\n1. Bitfinex - when exporting your data, make sure the \"*Date Format*\" is set to \"*DD-MM-YY*\" which is the default.\n1. ChangeTip - the conversion tool requires your username(s) to be configured, this is to identify which transactions are a gift received or a gift sent, (see [Config](#config)).\n1. Coinbase - has many different export formats, bittytax recognises the \"*Transactions history*\" and \"*Buys, sells, and merchant payouts*\" reports (also known as \"*Transfers*\"). Coinbase provides these reports for each individual wallet (both fiat and crypto). It's possible to end up with duplicate transaction records (i.e. one for the GBP wallet and another for the BTC wallet), these have to be filtered manually, the converter will flag some of these duplicates it finds by setting the transaction type to Duplicate.\n1. Coinbase Pro - the converter recognises both the \"*Fills Report*\" export for trades and the \"*Account Report*\" export for deposits and withdrawals. Please note, the \"*Account Report*\" also contains details of the trades (\"*match*\") but with less detail, these are filtered by the tool to prevent duplicates.\n1. GateHub - some exports contain incomplete data (i.e. no counter asset in an \"*exchange*\"), these are possibly failed transactions, the tool will filter them and raise a warning for you to review, the data still appears to balance correctly. Any Ripple network fees which cannot be attributed to a \"*payment*\" or an \"*exchange*\" will be included separately as a Spend transaction record.\n1. Qt Wallet - by default, unconfirmed transactions are filtered by the conversion tool, if you want to include them use the `-uc` or `--unconfirmed` command argument.\n1. Exchanges which do not balance (just some dust left) are Cryptopia, OKEx, TradeSatoshi.\n\n## Price Tool\nThe bittytax price tool `bittytax_price` allows you to lookup current and historic prices of cryptoassets and foreign currencies. Its use is not strictly required as part of the process of completing your accounts but provides a useful insight into the prices which bittytax will assign when it comes to value your cryptoassets in UK pounds.\n\n**Data Sources:**\nThe following price data sources are used.\n\n- [Exchange Rates API](https://exchangeratesapi.io) - foreign currency exchange rates *(primary fiat)*\n- [Rates API](https://ratesapi.io) - foreign currency exchange rates *(secondary fiat)*\n- [CoinDesk BPI](https://www.coindesk.com/api) - bitcoin price index *(primary bitcoin)*\n- [Crypto Compare](https://min-api.cryptocompare.com) - cryptoasset prices *(primary crypto, secondary bitcoin)*\n- [Coin Gecko](https://www.coingecko.com/en/api) - cryptoasset prices *(secondary crypto)*\n- [Coin Paprika](https://coinpaprika.com/api/) - cryptoasset prices\n\nThe priority (primary, secondary, etc) to which data source is used and for which asset is controlled by the `bittytax.conf` config file, (see [Config](#config)). If your cryptoasset cannot be identified by the primary data source, the secondary source will be used, and so on. \n\nAll price data is cached within the .bittytax/cache folder in your home directory, this is to prevent repeated lookups and reduce load on the APIs which could fail due to throttling.\n\n### Usage\nTo use the tool you need to pass the asset symbol name, either for a cryptoasset (i.e. BTC) or a foreign currency (i.e. USD), the second argument is only required for historic data lookups, the date must be in the format (YYYY-MM-DD). If the date is not specified the current price will be returned.\n\n    bittytax_price asset [date]\n\nIf the lookup is successful not only will the price be displayed in the terminal window, but also the data source used and the full name of the asset. This is useful in making sure the asset symbol you are using in your transaction records is the correct one.\n\n```console\n$ bittytax_price ETH\nINFO -- : 1 ETH=£124.93 GBP via CryptoCompare (Ethereum)\n```\n\nSince there is no standardisation of cryptoasset symbols, it's possible that the same symbol has two different meanings across different data sources. For example, BTCP is Bitcoin Private on CryptoCompare, but also Bitcoin Pro on CoinGecko.\n\nIf bittytax is not picking up the correct price for you, you can change the config so that the asset symbol only uses the data source you require, see [Config](#config).   \n\nYou can use the help command argument to display a full list of the command line arguments. \n\n    bittytax_price --help\n\nAnother useful function of the price tool is to calculate the historic price of a specific transaction, you can use the `-q` or `--quantity` argument to specify the quantity to price, this can be used as a memory jogger if you are looking at old wallet transactions and trying to remember what it was you spent your crypto on.\n\n```console\n$ bittytax_price BTC 2014-06-24 -q 0.002435\nINFO -- : 1 BTC=£338.59 GBP via CoinDesk (Bitcoin)\nINFO -- : 0.002435 BTC=£0.82 GBP\n```\n\n### Notes:\n1. Not all data source APIs return prices in UK pounds (GBP), for this reason cryptoasset prices are requested in BTC and then converted from BTC into UK pounds (GBP) as a two step process.\n1. Some APIs return multiple prices for the same day, if this is the case then the 'close' price is always used.\n1. Historical price data is held for each data source as a separate JSON file in the .bittytax/cache folder within your home directory.\n\n## Config\nThe `bittytax.conf` file resides in the .bittytax folder within your home directory.\n\nThe [default](https://github.com/BittyTax/BittyTax/blob/master/config/bittytax.conf) file created at runtime should cater for most users.\n\nIf you need to change anything, the parameters are described below, the file is in YAML format.\n\n| Parameter | Default | Description |\n| --- | --- | --- |\n| `fiat_list:` | `['GBP', 'EUR', 'USD']` | List of fiat symbols used |\n| `crypto_list:` | `['BTC', 'ETH', 'XRP', 'LTC', 'BCH', 'USDT']` | List of prioritised cryptoasset symbols | \n| `trade_asset_type:` | `2` | Method used to calculate asset value in a trade |\n| `show_empty_wallets:` | `True` | Include empty wallets in current holdings report |\n| `transfers_include:` | `True` | Include transfer transactions in tax calculations |\n| `data_source_select:` | `{'BTC': ['CoinDesk']}` | Map asset to a specific data source(s) for prices | \n| `data_source_fiat:` | `['ExchangeRatesAPI', 'RatesAPI']` | Default data source(s) to use for fiat prices |\n| `data_source_crypto:` | `['CryptoCompare', 'CoinGecko']` | Default data source(s) to use for cryptoasset prices |\n| `usernames:` | | List of usernames as used by ChangeTip |\n\n### fiat_list\nUsed to differentiate between fiat and cryptoassets symbols, make sure you configure all fiat currencies which appear within your transaction records here.\n\n### crypto_list\nIdentifies which cryptoasset takes priority when calculating the value of a crypto-to-crypto trade (see [trade_asset_type](#trade_asset_type)). The priority is taken in sequence, so in an ETH/BTC trade, the value of the Bitcoin would be used in preference to Ethereum when pricing the trade.\n\nThe list should contain the most prevalent cryptoassets which appear in exchange trading pairs, these are predominantly the higher market cap. tokens.\n\n### trade_asset_type\nControls the method used to calculate the asset value of a trade:\n\n- `0` = Buy asset value  \n- `1` = Sell asset value  \n- `2` = Priority asset value *(recommended)*  \n\nFor every trade there are always two assets involved, fiat-to-crypto, crypto-to-fiat or crypto-to-crypto. When bittytax is trying to calculate the value of a trade, it uses this parameter to determine which asset value should be used to price the trade in UK pounds.\n\nFor trades involving fiat, it's obvious that we want to price the asset using the fiat value, but for crypto-to-crypto trades it's not so straight forward. \n\nThe recommended setting is `2` (Priority), this means that the asset value chosen will be selected according to the priority order defined by the `fiat_list` and `crypto_list` parameters combined. Fiat will always be chosen first, followed by the most prevalent cryptoasset.\n\nSetting this parameter to `1` or `2` will result in either the buy asset value or the sell asset value always being used, regardless of whether the trades involved fiat or not. \n\n### show_empty_wallets\nInclude empty wallets in the current holdings report. Can be set to `True` or `False`.\n\n### transfers_include\nInclude transfer transaction types (i.e. Deposit, Withdrawal) in tax calculations. Can be set to `True` (recommended) or `False`.\n\nAlthough these transactions types are non-taxable they do affect the cost basis of your cryptoasset holding.\n\n### data_source_select\nMaps a specific asset symbol to a list of data sources in priority order.\n\nThis parameter overrides the any data sources defined by `data_source_fiat` and `data_source_crypto`, see below.\n\nBy default, only an entry for BTC exists, this selects CoinDesk as the primary data source for bitcoin prices, and CryptoCompare as the secondary. \n\nIf, for example you wanted BTCP to use only the CoinGecko data source, you would change the config as follows.\n\n```yaml\ndata_source_select: {\n    'BTC': ['CoinDesk', 'CryptoCompare'],\n    'BTCP': ['CoinGecko'],\n    }\n```\n\n### data_source_fiat\nSpecifies which data source(s), in priority order, will be used for retrieving foreign currency exchange rates.\n\n```yaml\ndata_source_fiat:\n    ['ExchangeRatesAPI', 'RatesAPI']\n```\n\nSupported data sources for fiat are:\n- `ExchangeRatesAPI`\n- `RatesAPI`\n\n### data_source_crypto\nSpecifies which data source(s), in priority order, will be used for retrieving cryptoasset prices.\n\n```yaml\ndata_source_crypto:\n    ['CryptoCompare', 'CoinGecko']\n```\n\nSupported data sources for cryptoassets are:\n- `CoinDesk`\n- `CryptoCompare`\n- `CoinGecko`\n- `CoinPaprika`\n\n### usernames\nThis parameter is only used by the conversion tool.\n\nIt's required for ChangeTip data files, the list of username(s) is used to identify which transactions are gifts received and gifts sent.\n\nAn example is shown below.\n```yaml\nusernames:\n    ['Bitty_Bot', 'BittyBot']\n```\n\n## Future\nIdeas for the project roadmap, let me know what you would fine most useful, or any new features you would like to see.\n\n### General\n- Document code\n- Add tests\n\n### Conversion Tool\n- Convert data from clipboard. Some wallets/exchanges don't provide an export function, it should be possible to copy the transaction data directly from the webpage and have the conversion tool analysis this data and then convert it into the transaction record format.\n- Add exchange APIs to automatically convert new trades into the transaction record format.\n\n### Price Tool\n- Add command option to list supported cryptoassets symbols/names for a specific data source(s).\n\n### Accounting Tool\n- BittyTax integration with Excel. The command line interface is not for everyone, by integrating with Excel (or OpenOffice) this would greatly improve the user experience.\n- Add export function for QuickBooks (QBXML format), to include transactions records with exchange rate data added.\n- Tax rules for other countries\n\n## Resources\n**HMRC Links:**\n- https://www.gov.uk/government/publications/tax-on-cryptoassets/cryptoassets-for-individuals\n- https://www.gov.uk/guidance/check-if-you-need-to-pay-tax-when-you-receive-cryptoassets\n- https://www.gov.uk/guidance/check-if-you-need-to-pay-tax-when-you-sell-cryptoassets\n- https://www.gov.uk/guidance/non-cash-pay-shares-commodities-you-provide-to-your-employees\n- https://www.gov.uk/hmrc-internal-manuals/vat-finance-manual/vatfin2330\n- https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg12100\n- https://www.gov.uk/government/publications/cryptoassets-taskforce\n\n**HMRC Webinar**\n- https://www.youtube.com/watch?v=EzNebqkw13w\n\n[version-badge]: https://img.shields.io/pypi/v/BittyTax.svg\n[license-badge]: https://img.shields.io/pypi/l/BittyTax.svg\n[python-badge]: https://img.shields.io/pypi/pyversions/BittyTax.svg\n[discord-badge]: https://img.shields.io/discord/581493570112847872.svg\n[version]: https://pypi.org/project/BittyTax/\n[license]: https://github.com/BittyTax/BittyTax/blob/master/LICENSE\n[discord]: https://discord.gg/NHE3QFt\n[python]: https://wiki.python.org/moin/BeginnersGuide/Download\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "https://github.com/BittyTax/BittyTax/archive/v0.3.2.zip", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/BittyTax/BittyTax", "keywords": "bittytax cryptoasset cryptocurrency crypto tax", "license": "AGPLv3", "maintainer": "", "maintainer_email": "", "name": "BittyTax", "package_url": "https://pypi.org/project/BittyTax/", "platform": "", "project_url": "https://pypi.org/project/BittyTax/", "project_urls": {"Download": "https://github.com/BittyTax/BittyTax/archive/v0.3.2.zip", "Homepage": "https://github.com/BittyTax/BittyTax"}, "release_url": "https://pypi.org/project/BittyTax/0.3.2/", "requires_dist": ["python-dateutil", "requests", "pyyaml", "xlrd", "xlsxwriter", "jinja2", "xhtml2pdf"], "requires_python": "", "summary": "Cryptoasset accounting, auditing and UK tax calculations (Capital Gains/Income Tax)", "version": "0.3.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><img alt=\"BittyTax logo\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/01b28e4c8d84c7867d1874032b596c8e6c11aca2/68747470733a2f2f6769746875622e636f6d2f42697474795461782f42697474795461782f7261772f6d61737465722f696d672f42697474795461782e706e67\">\n<a href=\"https://pypi.org/project/BittyTax/\" rel=\"nofollow\"><img alt=\"Version badge\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/41d910488633654e9addeaff40544a3e2adef07f/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f42697474795461782e737667\"></a> <a href=\"https://github.com/BittyTax/BittyTax/blob/master/LICENSE\" rel=\"nofollow\"><img alt=\"License badge\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/63c457161736c59e48f75ceb8947cda57dfb5d89/68747470733a2f2f696d672e736869656c64732e696f2f707970692f6c2f42697474795461782e737667\"></a> <a href=\"https://wiki.python.org/moin/BeginnersGuide/Download\" rel=\"nofollow\"><img alt=\"Python badge\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/250483e3e19e8d2ab11d7efa3cd13e7bf01387f7/68747470733a2f2f696d672e736869656c64732e696f2f707970692f707976657273696f6e732f42697474795461782e737667\"></a> <a href=\"https://discord.gg/NHE3QFt\" rel=\"nofollow\"><img alt=\"Discord badge\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/b3fc0190d5669a8edba8a025c46be9800c65f193/68747470733a2f2f696d672e736869656c64732e696f2f646973636f72642f3538313439333537303131323834373837322e737667\"></a></p>\n<h1>BittyTax</h1>\n<p>BittyTax is a collection of command-line tools to help you manage your cryptoasset accounts. Allowing you to audit, value and calculate your annual UK Capital Gains and Income Tax.</p>\n<p>This tool is designed to be used by someone who is already familiar with cryptoasset taxation rules in the UK. HMRC has published guidance, some useful links are provided in the <a href=\"#resources\" rel=\"nofollow\">Resources</a> section at the end.</p>\n<p>BittyTax comprises of the following tools.</p>\n<ol>\n<li>\n<p><code>bittytax</code> - process your transaction records and generate a PDF tax report (see <a href=\"#accounting-tool\" rel=\"nofollow\">Accounting Tool</a>)</p>\n</li>\n<li>\n<p><code>bittytax_conv</code> - convert your wallet and exchange files into transaction records (see <a href=\"#conversion-tool\" rel=\"nofollow\">Conversion Tool</a>)</p>\n</li>\n<li>\n<p><code>bittytax_price</code> - (optional) lookup historic price data for cryptoassets and foreign currencies (see <a href=\"#price-tool\" rel=\"nofollow\">Price Tool</a>)</p>\n</li>\n</ol>\n<h2>Disclaimer</h2>\n<p>This software is copyright (c) Nano Nano Ltd, and licensed for use under the AGPLv3 License, see <a href=\"https://github.com/BittyTax/BittyTax/blob/master/LICENSE\" rel=\"nofollow\">LICENSE</a> file for details.</p>\n<p>Nano Nano Ltd does not provide tax, legal, accounting or financial advice. This software and its content are provided for information only, and as such should not be relied upon for tax, legal, accounting or financial advice.</p>\n<p>You should obtain specific professional advice from a professional accountant, tax or legal/financial advisor before you take any action.</p>\n<p>This software is provided 'as is', Nano Nano Ltd does not give any warranties of any kind, express or implied, as to the suitability or usability of this software, or any of its content.</p>\n<h2>Getting Started</h2>\n<h3>Prerequisites</h3>\n<p>You need to have Python 2.7 or 3.x installed on your machine before you can install BittyTax. MacOS and most Linux distributions already come with Python pre-installed.</p>\n<p>If you need to install Python we recommend you install Python 3.x, see <a href=\"https://wiki.python.org/moin/BeginnersGuide/Download\" rel=\"nofollow\">https://wiki.python.org/moin/BeginnersGuide/Download</a> for instructions.</p>\n<p><strong>Note:</strong> BittyTax is currently in Beta version (see the <a href=\"https://github.com/BittyTax/BittyTax/blob/master/CHANGELOG.md\" rel=\"nofollow\">CHANGELOG</a> file for details) it has been tested on MacOS and Windows 10, using both Python 2.7, and Python 3.7.</p>\n<h3>Installing</h3>\n<p>To install the latest release:</p>\n<pre><span class=\"gp\">    $</span> pip install BittyTax\n</pre>\n<p>or <a href=\"https://github.com/BittyTax/BittyTax/archive/master.zip\" rel=\"nofollow\">download the ZIP file</a>, unpack, navigate to the top level of the repository and install using:</p>\n<pre><span class=\"gp\">    $</span> python setup.py install\n</pre>\n<p>Note: This will install the latest unreleased version which may include untested changes, check the <a href=\"https://github.com/BittyTax/BittyTax/blob/master/CHANGELOG.md\" rel=\"nofollow\">CHANGELOG</a>.</p>\n<h3>Upgrade</h3>\n<p>To upgrade to the latest release:</p>\n<pre><span class=\"gp\">    $</span> pip install --upgrade BittyTax\n</pre>\n<h2>Transaction Records</h2>\n<p>BittyTax is only as accurate as the data you provide it, it is essential that you keep records of ALL cryptoasset transactions - not just trades but also records of spending, gifts send and received, etc.</p>\n<p>The <code>bittytax_conv</code> tool is provided to assist with this transaction record keeping, it allows data exported from various different wallets and exchanges to be processed into the format required by the <code>bittytax</code> accounting tool. Manual entry or editing of this data may also be required. It is vital that converted data files are reviewed against the raw data and audited before use.</p>\n<p>Transaction records can be stored in an Excel or CSV file. Excel is preferred as it makes editing and managing your data easier. Data can be split across multiple worksheets, for example, you might want to split up transactions by wallet or exchange, or by transaction type. With Excel you can also annotate your records, append additional data columns, or even include the original raw data for reference.</p>\n<p>A transaction record is represented as a row of data which contains the following fields in the order given.</p>\n<table>\n<thead>\n<tr>\n<th>Field</th>\n<th>Type</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Type</td>\n<td><code>Deposit</code></td>\n<td>Tokens deposited to a wallet you own</td>\n</tr>\n<tr>\n<td></td>\n<td><code>Mining</code></td>\n<td>Tokens received as income from mining</td>\n</tr>\n<tr>\n<td></td>\n<td><code>Income</code></td>\n<td>Tokens received as other income</td>\n</tr>\n<tr>\n<td></td>\n<td><code>Gift-Received</code></td>\n<td>Tokens received as a gift</td>\n</tr>\n<tr>\n<td></td>\n<td><code>Withdrawal</code></td>\n<td>Tokens withdrawn from a wallet you own</td>\n</tr>\n<tr>\n<td></td>\n<td><code>Spend</code></td>\n<td>Tokens spent on goods or services</td>\n</tr>\n<tr>\n<td></td>\n<td><code>Gift-Sent</code></td>\n<td>Tokens sent as a gift</td>\n</tr>\n<tr>\n<td></td>\n<td><code>Charity-Sent</code></td>\n<td>Tokens sent to a charity as a gift</td>\n</tr>\n<tr>\n<td></td>\n<td><code>Trade</code></td>\n<td>Tokens exchanged for another token or fiat currency</td>\n</tr>\n<tr>\n<td>Buy Quantity</td>\n<td></td>\n<td>Quantity of the asset acquired</td>\n</tr>\n<tr>\n<td>Buy Asset</td>\n<td></td>\n<td>Symbol name of the asset acquired</td>\n</tr>\n<tr>\n<td>Buy Value</td>\n<td></td>\n<td>Value in UK pounds (GBP) of the asset acquired</td>\n</tr>\n<tr>\n<td>Sell Quantity</td>\n<td></td>\n<td>Quantity of the asset disposed</td>\n</tr>\n<tr>\n<td>Sell Asset</td>\n<td></td>\n<td>Symbol name  of the asset disposed</td>\n</tr>\n<tr>\n<td>Sell Value</td>\n<td></td>\n<td>Value in UK pounds (GBP) of the asset disposed</td>\n</tr>\n<tr>\n<td>Fee Quantity</td>\n<td></td>\n<td>Quantity of the fee</td>\n</tr>\n<tr>\n<td>Fee Asset</td>\n<td></td>\n<td>Symbol name of the asset used for fees</td>\n</tr>\n<tr>\n<td>Fee Value</td>\n<td></td>\n<td>Value in UK ponds (GBP) of the fee</td>\n</tr>\n<tr>\n<td>Wallet</td>\n<td></td>\n<td>Name of wallet</td>\n</tr>\n<tr>\n<td>Timestamp</td>\n<td></td>\n<td>Date/time of transaction</td>\n</tr></tbody></table>\n<p>The transaction Type dictates which fields in the row are required, either (M)andatory or (O)ptional.</p>\n<table>\n<thead>\n<tr>\n<th>Type</th>\n<th>Buy Quantity</th>\n<th>Buy Asset</th>\n<th>Buy Value</th>\n<th>Sell Quantity</th>\n<th>Sell Asset</th>\n<th>Sell Value</th>\n<th>Fee Quantity</th>\n<th>Fee Asset</th>\n<th>Fee Value</th>\n<th>Wallet</th>\n<th>Timestamp</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>Deposit</code></td>\n<td>M</td>\n<td>M</td>\n<td></td>\n<td></td>\n<td></td>\n<td></td>\n<td>O</td>\n<td>O</td>\n<td></td>\n<td>O</td>\n<td>M</td>\n</tr>\n<tr>\n<td><code>Mining</code></td>\n<td>M</td>\n<td>M</td>\n<td>O</td>\n<td></td>\n<td></td>\n<td></td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>M</td>\n</tr>\n<tr>\n<td><code>Income</code></td>\n<td>M</td>\n<td>M</td>\n<td>O</td>\n<td></td>\n<td></td>\n<td></td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>M</td>\n</tr>\n<tr>\n<td><code>Gift-Received</code></td>\n<td>M</td>\n<td>M</td>\n<td>O</td>\n<td></td>\n<td></td>\n<td></td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>M</td>\n</tr>\n<tr>\n<td><code>Withdrawal</code></td>\n<td></td>\n<td></td>\n<td></td>\n<td>M</td>\n<td>M</td>\n<td></td>\n<td>O</td>\n<td>O</td>\n<td></td>\n<td>O</td>\n<td>M</td>\n</tr>\n<tr>\n<td><code>Spend</code></td>\n<td></td>\n<td></td>\n<td></td>\n<td>M</td>\n<td>M</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>M</td>\n</tr>\n<tr>\n<td><code>Gift-Sent</code></td>\n<td></td>\n<td></td>\n<td></td>\n<td>M</td>\n<td>M</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>M</td>\n</tr>\n<tr>\n<td><code>Charity-Sent</code></td>\n<td></td>\n<td></td>\n<td></td>\n<td>M</td>\n<td>M</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>M</td>\n</tr>\n<tr>\n<td><code>Trade</code></td>\n<td>M</td>\n<td>M</td>\n<td>O</td>\n<td>M</td>\n<td>M</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>O</td>\n<td>M</td>\n</tr></tbody></table>\n<ul>\n<li>\n<p>If fees are specified, the Buy or Sell Quantity should be the gross amount (i.e. prior to any fee adjustment).</p>\n</li>\n<li>\n<p>The Buy Value, Sell Value and Fee Value fields are always optional, if you don't provide a fixed value, bittytax will calculate the value for you via one of it's price data sources.</p>\n</li>\n<li>\n<p>Wallet name is optional, but recommended if you want to audit your cryptoasset balances across multiple wallets.</p>\n</li>\n<li>\n<p>Timestamp should be in the format <code>YYYY-MM-DDTHH:MM:SS ZZZ</code>, recognised timezones (ZZZ) are GMT, BST and UTC.</p>\n</li>\n<li>\n<p>Cryptoasset symbol names need to be consistent throughout your transaction records. For example, Bitcoin Cash was referred to as both BCC and BCH at the time of the first fork, but also more recently as BCHABC or BAB. The symbol name you choose should match the symbol name used by the price data source, otherwise valuations will fail, see <a href=\"#price-tool\" rel=\"nofollow\">Price Tool</a> for more information.</p>\n</li>\n<li>\n<p>Transaction records can be listed in any order, bittytax will sort them by Timestamp before processing.</p>\n</li>\n</ul>\n<p>Example files are provided in both <a href=\"https://github.com/BittyTax/BittyTax/blob/master/data/example.xlsx\" rel=\"nofollow\">Excel</a> and <a href=\"https://github.com/BittyTax/BittyTax/blob/master/data/example.csv\" rel=\"nofollow\">CSV</a> format.</p>\n<h3>Deposit</h3>\n<p>A <code>Deposit</code> is a transfer transaction record, indicating the receipt of cryptoasset tokens to a wallet you control. For example, you might have deposited tokens to a wallet on an exchange, ready to be traded.</p>\n<p>Deposit should NOT be used to record transfers to someone else's wallet, this would be categorised as either a <code>Gift-Sent</code> or  a <code>Spend</code>.</p>\n<p>There should be an equivalent <code>Withdrawal</code> transaction record for every deposit, since tokens are always moving out of one wallet into another. The quantity of tokens deposited will normally be less than the quantity withdrawn due to network transaction fees. Deposits and Withdrawals are not taxable events.</p>\n<p>The Deposit type can also be used to record fiat deposits into an exchange, although this is not used for tax calculations it will be used for auditing purposes.</p>\n<h3>Withdrawal</h3>\n<p>A <code>Withdrawal</code> is a transfer transaction record, it indicates tokens being sent from a wallet you control. It is always used in combination with a <code>Deposit</code> transaction.</p>\n<p>The Withdrawal type can also be used to record fiat withdrawals from an exchange.</p>\n<h3>Mining</h3>\n<p>The <code>Mining</code> transaction type is used to identify tokens received as income from mining. The <code>Income</code> transaction type could also be used to record this, its use is purely descriptive.</p>\n<p>These transaction records will appear within your income tax report.</p>\n<h3>Income</h3>\n<p>The <code>Income</code> transaction type is used to identify tokens received as other income.</p>\n<p>These transaction records will appear within your income tax report.</p>\n<h3>Gift-Received</h3>\n<p>The <code>gift-received</code> transaction type is used to record cryptoasset tokens received as a gift.</p>\n<p>A gift received is not taxed as income.</p>\n<h3>Spend</h3>\n<p>A <code>Spend</code> is a disposal transaction record, it's used to capture the spending of tokens on goods or services.</p>\n<p>As a disposal transaction, it is applicable for Capital Gains tax.</p>\n<h3>Gift-Sent</h3>\n<p>A <code>Gift-Sent</code> is a disposal transaction record, it identifies cryptoasset tokens sent as a gift.</p>\n<p>As a disposal transaction, it is applicable for Capital Gains tax.</p>\n<h3>Charity-Sent</h3>\n<p>A <code>Charity-Sent</code> is a disposal transaction record, it identifies cryptoasset tokens sent to a charity as a gift. It's handling is the same as a <code>Gift-Sent</code>, it's purpose is purely descriptive.</p>\n<h3>Trade</h3>\n<p>The <code>Trade</code> transaction type records the exchange of one cryptoasset for another, or for fiat currency.</p>\n<p>This could be for one for the following reasons.</p>\n<ul>\n<li>Fiat-to-crypto <em>(acquisition)</em></li>\n<li>Crypto-to-crypto <em>(disposal)</em></li>\n<li>Crypto-to-fiat <em>(disposal)</em></li>\n</ul>\n<p>In the case of a fiat-to-crypto trade, the Sell Asset would be fiat, i.e. GBP, or whatever currency you used, and Sell Quantity would contain the amount. There is no reason to specify the Sell Value if the currency is GBP.</p>\n<p>In the opposite case, crypto-to-fiat, the Buy Asset would be fiat, and the Buy Quantity the amount in fiat.</p>\n<p>Trades which are a <em>disposal</em> are applicable for Capital Gains tax.</p>\n<h3>Other types?</h3>\n<p>Below is a list of some other situations which you might need to record, but which don't have a specific transaction type defined. These could be added in the future if users feel it would be of benefit.</p>\n<ol>\n<li><strong>Airdrop</strong> - These tokens can be recorded as either a <code>Gift-Received</code>, if nothing was done in return for them, or <code>Income</code> if the distribution of tokens was dependant upon providing a service or other conditions, see <a href=\"https://www.gov.uk/government/publications/tax-on-cryptoassets/cryptoassets-for-individuals#airdrops\" rel=\"nofollow\">HMRC Guidance on Airdrops</a>.</li>\n<li><strong>Dust clean</strong> - Some exchanges remove very small amounts (dust) of cryptoasset tokens from wallets after a period of time, since these are too small to be traded or withdrawn. This can be captured as a <code>Spend</code> with a Sell Value of 0.</li>\n<li><strong>Fork</strong> - If a cryptoasset you own forks, and a new cryptoasset is created, this can be recorded as a <code>Gift-Received</code> but with a Buy Value of 0. This assumes that you are not splitting the cost between the original and new cryptoasset. Currently it is not possible to derive a cost from the original cryptoasset and apportion this to the new one. See <a href=\"https://www.gov.uk/government/publications/tax-on-cryptoassets/cryptoassets-for-individuals#fork\" rel=\"nofollow\">HMRC Guidance on Blockchain forks</a>.</li>\n<li><strong>Gift to spouse</strong> - If cryptoasset tokens are gifted to your spouse, it can be recorded as a <code>Gift-Sent</code> but with a Sell Value of 0.</li>\n<li><strong>Margin funding</strong> - Tokens received from an exchange in return for margin funding can be captured as <code>Income</code>.</li>\n<li><strong>Lost</strong> - Tokens which have been lost, i.e. the private keys are unrecoverable, have to be reported/accepted by HMRC as a <em>\"negligible value claim\"</em>. These are treated as a disposal, followed by a re-acquisition for the amount lost, since technically you still own the cryptoasset. This can be recorded as a crypto-to-fiat <code>Trade</code> with a GBP cost of 0, followed by a fiat-to-crypto <code>Trade</code> for exactly the same quantity of the cryptoasset, also with a cost of 0. See <a href=\"https://www.gov.uk/government/publications/tax-on-cryptoassets/cryptoassets-for-individuals#losing-public-and-private-keys\" rel=\"nofollow\">HMRC Guidance on losing public and private keys</a>.</li>\n<li><strong>Staking</strong> - Tokens received from Proof of Stake (POS) can be recorded as <code>Mining</code> or <code>Income</code>.</li>\n</ol>\n<h2>Accounting Tool</h2>\n<p>Once you have all of your transaction records stored in an Excel or CSV file you can use <code>bittytax</code> to process them and generate your report.</p>\n<pre><code>bittytax &lt;filename&gt;\n</code></pre>\n<h3>PDF Report</h3>\n<p>By default the report is given the filename <code>BittyTax_Report.pdf</code>. You can see an example file <a href=\"https://github.com/BittyTax/BittyTax/blob/master/data/BittyTax_Report.pdf\" rel=\"nofollow\">here</a>.</p>\n<p>If you want to use a different filename or to specify a folder, you can use the <code>-o</code> option as shown below.</p>\n<pre><code>bittytax &lt;filename&gt; -o &lt;output_filename&gt;\n</code></pre>\n<p>The PDF generator can be a bit slow when handling large amounts of data. If you prefer, you can output the report to the terminal window by using the <code>--nopdf</code> option.</p>\n<pre><code>bittytax &lt;filename&gt; --nopdf\n</code></pre>\n<p>The report is split into the following sections.</p>\n<ol>\n<li><a href=\"#audit\" rel=\"nofollow\">Audit</a></li>\n<li><a href=\"#tax-report\" rel=\"nofollow\">Tax Report</a> (per year)</li>\n<li>Appendix - <a href=\"#price-data\" rel=\"nofollow\">Price Data</a> (per year)</li>\n<li>Appendix - <a href=\"#current-holdings\" rel=\"nofollow\">Current Holdings</a></li>\n</ol>\n<h4>Audit</h4>\n<p>The imported transaction records are audited by calculating what the final balances should be for each asset in your wallet.</p>\n<p>If the balances listed in the report don't match, it could be that your transaction records are incomplete.</p>\n<p>If you do get issues, you can use the <code>-d</code> or <code>--debug</code> option to turn on logging (see <a href=\"#audit-transaction-records\" rel=\"nofollow\">Audit Transaction Records</a>).</p>\n<p>Although important, the audit can be disabled by using the <code>-s</code> or <code>--skipaudit</code> option.</p>\n<h4>Tax Report</h4>\n<p>By default, tax reports are produced for all years which contain taxable events.</p>\n<p>If you only want a report for a specific year you can do this using the <code>-ty</code> or <code>--taxyear</code> option.</p>\n<pre><code>bittytax &lt;filename&gt; -ty 2020\n</code></pre>\n<p>Full details of the tax calculations can be seen by turning on the debug output (see <a href=\"#processing\" rel=\"nofollow\">Processing</a>).</p>\n<h4>Capital Gains</h4>\n<p>Cryptoasset disposals are listed in date order and by asset.</p>\n<p>For a \"Bed and Breakfast\" disposal, the date of the buyback is given in brackets.</p>\n<p>If a disposal results in a loss, the negative amount is highlighted in red.</p>\n<p>Totals are listed per asset (if more than 1 disposal) as well as the totals for that tax year.</p>\n<p>The <strong>Summary</strong> section provides enough information for you to complete the \"Other property, assets and gains\" section within your self assessment tax return, or to give to your accountant to complete.</p>\n<p>If the disposal proceeds exceed more than 4 times the annual tax-free allowance this is shown. HMRC requires you to report this in your self assessment even if the gain was within your annual allowance.</p>\n<p>HMRC also requires you to include details of each gain or loss. You can use the <code>--summary</code> option in combination with <code>--taxyear</code> to generate a PDF report which only includes the capital gains disposals and summary for that specific tax year, this can then be attached to your self assessment.</p>\n<p>The <strong>Tax Estimate</strong> section is given purely as an estimate. Capital gains tax figures are calculated at both the basic and higher rate, and take into consideration the full tax-free allowance.</p>\n<p>Obviously you would need to take into account other capital gains/losses in the same year, and use the correct tax rate according to your income. Always consult with a professional accountant before filing.</p>\n<h4>Income</h4>\n<p>Income events are listed in date order and by asset, with totals per asset (if more than 1 event).</p>\n<p>Totals are also given per Income Type (i.e <code>Mining</code> and <code>Income</code>), as well as the totals for that tax year.</p>\n<p>You should check with an accountant for how this should be reported according to your personal situation.</p>\n<h4>Price Data</h4>\n<p>The appendix section contains all the historic price data which bittytax has used in the tax calculations.</p>\n<p>This includes both fiat and crypto prices, split by tax year.</p>\n<p>It is important to check that the symbol names of your assets have been interpreted correctly, and that the prices look reasonable, otherwise your tax calculations will be incorrect. See <a href=\"#price-tool\" rel=\"nofollow\">Price Tool</a> for more information on how price data is retrieved.</p>\n<p>Links are provided against each price, pointing to the exact data source API which was used to retrieve the data.</p>\n<h4>Current Holdings</h4>\n<p>The appendix section also contains details of your remaining cryptoasset balances. The cost (including fees), the current valuation, and the calculated gain (or loss) are shown.</p>\n<p>By default, empty wallets are excluded, this setting can be changed in the config file, see <a href=\"#config\" rel=\"nofollow\">Config</a>.</p>\n<p>The data source used for the current price is the same used for historic price data.</p>\n<h3>Processing</h3>\n<p>You can turn on debug using the <code>-d</code> or <code>--debug</code> option to see full details of how the transaction records are processed.</p>\n<ol>\n<li><a href=\"#import-transaction-records\" rel=\"nofollow\">Import Transaction Records</a></li>\n<li><a href=\"#audit-transaction-records\" rel=\"nofollow\">Audit Transaction Records</a></li>\n<li><a href=\"#split-transaction-records\" rel=\"nofollow\">Split Transaction Records</a></li>\n<li><a href=\"#pool-same-day\" rel=\"nofollow\">Pool Same Day</a></li>\n<li><a href=\"#match-same-day-rule\" rel=\"nofollow\">Match \"same day\" Rule</a></li>\n<li><a href=\"#match-bed-and-breakfast-rule\" rel=\"nofollow\">Match \"bed and breakfast\" Rule</a></li>\n<li><a href=\"#process-unmatched-section-104\" rel=\"nofollow\">Process Unmatched (Section 104)</a></li>\n<li><a href=\"#process-income\" rel=\"nofollow\">Process Income</a></li>\n</ol>\n<h4>Import Transaction Records</h4>\n<p>First the transaction records are imported and validated according to their transaction type, making sure that the correct mandatory and optional fields are included.</p>\n<p>In the log, the worksheet name (Excel only) and row number are shown against the raw record data being imported.</p>\n<p>Empty rows are allowed, and filtered out during the import.</p>\n<p>Each record is given a unique Transaction ID (TID), these are allocated in chronological order (using the timestamp) regardless of the file ordering.</p>\n<pre><code>INFO -- : ==IMPORT TRANSACTION RECORDS FROM EXCEL FILE: example.xlsx ==\nDEBUG -- : 'Sheet1' Row[2]: ['Deposit', '870.0', 'GBP', '', '', '', '', '', '', '', 'LocalBitcoins', '2013-05-24T20:16:46 UTC'] TID:1\nDEBUG -- : 'Sheet1' Row[3]: ['Trade', '10.0', 'BTC', '', '870.0', 'GBP', '', '', '', '', 'LocalBitcoins', '2013-05-24T20:17:40 UTC'] TID:2\nDEBUG -- : 'Sheet1' Row[4]: ['Withdrawal', '', '', '', '10.0', 'BTC', '', '', '', '', 'LocalBitcoins', '2013-05-24T20:20:49 UTC'] TID:3\nDEBUG -- : 'Sheet1' Row[5]: ['Deposit', '10.0', 'BTC', '', '', '', '', '', '', '', 'Desktop wallet', '2013-05-24T21:20:49 BST'] TID:4\nDEBUG -- : 'Sheet1' Row[6]: ['Deposit', '2693.8', 'USD', '', '', '', '', '', '', '', 'Bitstamp', '2014-05-29T08:33:00 UTC'] TID:5\nDEBUG -- : 'Sheet1' Row[7]: ['Spend', '', '', '', '0.002435', 'BTC', '0.8', '', '', '', 'Desktop wallet', '2014-06-26T12:25:02 BST'] TID:6\nDEBUG -- : 'Sheet1' Row[8]: ['Gift-Sent', '', '', '', '0.02757', 'BTC', '', '', '', '', 'Desktop wallet', '2014-07-18T14:12:47 BST'] TID:7\nDEBUG -- : 'Sheet1' Row[9]: ['Trade', '0.41525742', 'BTC', '', '257.53', 'USD', '', '1.29', 'USD', '', 'Bitstamp', '2014-07-23T10:58:00 UTC'] TID:8\nDEBUG -- : 'Sheet1' Row[10]: ['Trade', '0.58474258', 'BTC', '', '362.63', 'USD', '', '1.82', 'USD', '', 'Bitstamp', '2014-07-23T10:58:00 UTC'] TID:9\n</code></pre>\n<h4>Audit Transaction Records</h4>\n<p>The audit function takes the transaction records, and then replays them in chronological order.</p>\n<p>The simulation of tokens (and also fiat) being moved between wallets allows you to compare the calculated final balances against your real world wallets and exchange balances.</p>\n<p>Bittytax will raise a warning if a cryptoasset balance goes negative during the audit, this could happen if the time ordering of your transaction records is not accurate.</p>\n<p>The log shows for each transaction record (TR) which wallets are being updated.</p>\n<p>The wallet name and asset name are shown with its balance, and in brackets the quantity that has been added or subtracted.</p>\n<pre><span class=\"go\">INFO -- : == AUDIT TRANSACTION RECORDS==</span>\n<span class=\"go\">...</span>\n<span class=\"go\">DEBUG -- : TR [TID:8] Trade: 0.41525742 BTC &lt;- 257.53 USD + Fee=1.29 USD 'Bitstamp' 2014-07-23T11:58:00 BST</span>\n<span class=\"go\">DEBUG -- : Bitstamp:BTC=0.41525742 (+0.41525742)</span>\n<span class=\"go\">DEBUG -- : Bitstamp:USD=2,436.27 (-257.53)</span>\n<span class=\"go\">DEBUG -- : Bitstamp:USD=2,434.98 (-1.29)</span>\n<span class=\"go\">DEBUG -- : TR [TID:9] Trade: 0.58474258 BTC &lt;- 362.63 USD + Fee=1.82 USD 'Bitstamp' 2014-07-23T11:58:00 BST</span>\n<span class=\"go\">DEBUG -- : Bitstamp:BTC=1 (+0.58474258)</span>\n<span class=\"go\">DEBUG -- : Bitstamp:USD=2,072.35 (-362.63)</span>\n<span class=\"go\">DEBUG -- : Bitstamp:USD=2,070.53 (-1.82)</span>\n<span class=\"go\">DEBUG -- : TR [TID:10] Trade: 0.86 BTC &lt;- 521.16 USD + Fee=2.51 USD 'Bitstamp' 2014-07-24T14:08:00 BST</span>\n<span class=\"go\">DEBUG -- : Bitstamp:BTC=1.86 (+0.86)</span>\n<span class=\"go\">DEBUG -- : Bitstamp:USD=1,549.37 (-521.16)</span>\n<span class=\"go\">DEBUG -- : Bitstamp:USD=1,546.86 (-2.51)</span>\n<span class=\"go\">DEBUG -- : TR [TID:11] Trade: 0.9 BTC &lt;- 545.7 USD + Fee=2.51 USD 'Bitstamp' 2014-07-24T14:08:00 BST</span>\n<span class=\"go\">DEBUG -- : Bitstamp:BTC=2.76 (+0.9)</span>\n<span class=\"go\">DEBUG -- : Bitstamp:USD=1,001.16 (-545.7)</span>\n<span class=\"go\">DEBUG -- : Bitstamp:USD=998.65 (-2.51)</span>\n<span class=\"go\">DEBUG -- : TR [TID:12] Trade: 1.64037953 BTC &lt;- 994.07 USD + Fee=4.58 USD 'Bitstamp' 2014-07-24T14:09:00 BST</span>\n<span class=\"go\">DEBUG -- : Bitstamp:BTC=4.40037953 (+1.64037953)</span>\n<span class=\"go\">DEBUG -- : Bitstamp:USD=4.58 (-994.07)</span>\n<span class=\"go\">DEBUG -- : Bitstamp:USD=0 (-4.58)</span>\n<span class=\"go\">DEBUG -- : TR [TID:13] Withdrawal: 4.40037953 BTC 'Bitstamp' 2014-07-24T22:01:00 BST</span>\n<span class=\"go\">DEBUG -- : Bitstamp:BTC=0 (-4.40037953)</span>\n</pre>\n<h4>Split Transaction Records</h4>\n<p>Before any tax calculations can take place, transaction records need to be split into their constitute parts, in terms of cryptoasset buys and cryptoasset sells, each with their own valuation in GBP.</p>\n<p>This requires the buy, sell and fee assets in the transaction record first to be given a valuation, that is unless a fixed value has already been specified, or the asset is already in GBP.</p>\n<p>Valuations are calculated via one of the historic price date sources, see <a href=\"#price-tool\" rel=\"nofollow\">Price Tool</a> for how.</p>\n<p>Note that <code>Deposit</code> and <code>Withdrawal</code> transactions are not taxable events so no valuation is required.</p>\n<p>In the log, any transaction buys (T-Buy) or sells (T-Sell) that are created by the split are shown below the transaction record (TR). These transactions have unique TIDs allocated sequentially based on the parent transaction ID, i.e. (34.1, 34.2, 34.3, etc).</p>\n<p>If historic price data has been used for the valuation, it is indicated by the <code>~</code> symbol, fixed values are show as <code>=</code>.</p>\n<p>GBP values are displayed with 2 decimal places, although no actual rounding has taken place. Rounding only happens when a taxable event is recorded.</p>\n<p>Timestamps are normalised to be in local time (GMT or BST), this is so that tax calculations for the same day will be correct.</p>\n<h5>Fee Handling</h5>\n<p>Each buy or sell transaction can include a fee. Its value is populated by the fee specified in the transaction record.</p>\n<p>If a transaction record involves more than one cryptoasset (i.e. a <code>Trade</code> crypto-to-crypto) then the fee's valuation has to be split evenly between the buy and sell transactions.</p>\n<p>If the fee asset is also a cryptoasset, then paying the fee counts as a separate disposal. This is recorded by adding an additional <code>Spend</code> transaction.</p>\n<p>Since <code>Deposit</code> and <code>Withdrawal</code> transactions are not taxable, any additional <code>Spend</code> transactions created for these are also flagged as non-taxable.</p>\n<p>Non-taxable transactions are marked with <code>*</code> in the log and have no GBP valuation.</p>\n<pre><span class=\"go\">INFO -- : ==SPLIT TRANSACTION RECORDS==</span>\n<span class=\"go\">...</span>\n<span class=\"go\">DEBUG -- : TR [TID:2] Trade: 10 BTC &lt;- 870 GBP 'LocalBitcoins' 2013-05-24T20:17:40 UTC</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:2.1] Trade: 10 BTC (=£870.00 GBP) 'LocalBitcoins' 2013-05-24T21:17:40 BST</span>\n<span class=\"go\">...</span>\n\n<span class=\"go\">DEBUG -- : TR [TID:32] Withdrawal: 7.0002 BTC 'Desktop wallet' 2017-03-24T22:57:44 GMT</span>\n<span class=\"go\">DEBUG -- : T-Sell* [TID:32.1] Withdrawal: 7.0002 BTC 'Desktop wallet' 2017-03-24T22:57:44 GMT</span>\n<span class=\"go\">DEBUG -- : TR [TID:33] Deposit: 7 BTC 'Poloniex' 2017-03-24T22:57:44 UTC</span>\n<span class=\"go\">DEBUG -- : T-Buy* [TID:33.1] Deposit: 7 BTC 'Poloniex' 2017-03-24T22:57:44 GMT</span>\n<span class=\"go\">DEBUG -- : TR [TID:34] Trade: 1.00000013 ETH &lt;- 0.03729998 BTC + Fee=0.0015 ETH 'Poloniex' 2017-04-12T19:38:26 UTC</span>\n<span class=\"go\">DEBUG -- : Price on 2017-04-12, 1 BTC=969.6202 GBP via CoinDesk (Bitcoin)</span>\n<span class=\"go\">DEBUG -- : Price on 2017-04-12, 1 BTC=£969.62 GBP, 0.03729998 BTC=£36.17 GBP</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:34.1] Trade: 1.00000013 ETH (~£36.17 GBP) + Fee=~£0.03 GBP 'Poloniex' 2017-04-12T20:38:26 BST</span>\n<span class=\"go\">DEBUG -- : T-Sell [TID:34.2] Trade: 0.03729998 BTC (~£36.17 GBP) + Fee=~£0.03 GBP 'Poloniex' 2017-04-12T20:38:26 BST</span>\n<span class=\"go\">DEBUG -- : T-Sell [TID:34.3] Spend: 0.0015 ETH (~£0.05 GBP) 'Poloniex' 2017-04-12T20:38:26 BST</span>\n</pre>\n<h3>Pool Same Day</h3>\n<p>HMRC stipulates that <a href=\"https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg51560#IDATX33F\" rel=\"nofollow\">\"<em>All shares of the same class in the same company acquired by the same person on the same day and in the same capacity are treated as though they were acquired by a single transaction</em>\"</a> this applies in the same way to disposals.</p>\n<p>Tokens of the same cryptoasset, acquired on the same day, are pooled together into a single buy transaction, the same applies for tokens disposed of on the same day. These are pooled into a single sell transaction.</p>\n<p>Only taxable transactions (i.e. acquisitions and disposals) are included within these pools.</p>\n<p>Pooled transactions are indicated by a transaction count at the end, shown within square brackets. The transactions contained within the pool are then indented below it.</p>\n<pre><span class=\"go\">INFO -- : ==POOL SAME DAY TRANSACTIONS==</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:2.1] Trade: 10 BTC (=£870.00 GBP) 'LocalBitcoins' 2013-05-24T21:17:40 BST</span>\n<span class=\"go\">DEBUG -- : T-Sell* [TID:3.1] Withdrawal: 10 BTC 'LocalBitcoins' 2013-05-24T21:20:49 BST</span>\n<span class=\"go\">DEBUG -- : T-Buy* [TID:4.1] Deposit: 10 BTC 'Desktop wallet' 2013-05-24T21:20:49 BST</span>\n<span class=\"go\">DEBUG -- : T-Sell [TID:6.1] Spend: 0.002435 BTC (=£0.80 GBP) 'Desktop wallet' 2014-06-26T12:25:02 BST</span>\n<span class=\"go\">DEBUG -- : T-Sell [TID:7.1] Gift-Sent: 0.02757 BTC (~£10.14 GBP) 'Desktop wallet' 2014-07-18T14:12:47 BST</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:8.1] Trade: 1 BTC (~£364.22 GBP) + Fee=~£1.83 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [2]</span>\n<span class=\"go\">DEBUG -- :   T-Buy [TID:8.1] Trade: 0.41525742 BTC (~£151.25 GBP) + Fee=~£0.76 GBP 'Bitstamp' 2014-07-23T11:58:00 BST</span>\n<span class=\"go\">DEBUG -- :   T-Buy [TID:9.1] Trade: 0.58474258 BTC (~£212.97 GBP) + Fee=~£1.07 GBP 'Bitstamp' 2014-07-23T11:58:00 BST</span>\n</pre>\n<h3>Match \"same day\" Rule</h3>\n<p>See <a href=\"https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg51560#IDATX33F\" rel=\"nofollow\">\"<em>The “same day” rule TCGA92/S105(1)</em>\"</a>.</p>\n<p>This tax function matches any buy and sell transactions, of the same cryptoasset, that occur on the same day.</p>\n<p>If the buy and sell quantities do not match, the transaction with the larger quantity will be split into two, and the cost and fee apportioned between them.</p>\n<p>This allows a gain, or a loss, to be calculated for the matching transactions, taking into consideration the combined fees. The transaction containing the remainder is then carried forward, and used in further tax calculations.</p>\n<p>In the log, you can see which transactions have been \"<em>Same Day</em>\" matched, and where a buy or sell has been split.</p>\n<p>New transactions created by a split are allocated the next TID in sequence.</p>\n<pre><span class=\"go\">INFO -- : ==MATCH SAME DAY TRANSACTIONS==</span>\n<span class=\"go\">...</span>\n<span class=\"go\">DEBUG -- : T-Sell [TID:34.3] Spend: 0.62207655 ETH (~£22.50 GBP) 'Poloniex' 2017-04-12T20:38:26 BST [4]</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:34.1] Trade: 249.23062521 ETH (~£9,012.71 GBP) + Fee=~£11.25 GBP 'Poloniex' 2017-04-12T20:38:26 BST [4] (Same Day)</span>\n<span class=\"go\">DEBUG -- : split: T-Buy [TID:34.4] Trade: 0.62207655 ETH (~£22.50 GBP) + Fee=~£0.03 GBP 'Poloniex' 2017-04-12T20:38:26 BST [4]</span>\n<span class=\"go\">DEBUG -- : split: T-Buy [TID:34.5] Trade: 248.60854866 ETH (~£8,990.22 GBP) + Fee=~£11.22 GBP 'Poloniex' 2017-04-12T20:38:26 BST [4]</span>\n<span class=\"go\">DEBUG -- :  Gain=£-0.03 (proceeds=£22.50 - cost=£22.50 - fees=£0.03)</span>\n</pre>\n<h3>Match \"bed and breakfast\" Rule</h3>\n<p>See <a href=\"https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg51560#IDATR33F\" rel=\"nofollow\">\"<em>The “bed and breakfast” rule TCGA92/S106A(5) and (5A)</em>\"</a>.</p>\n<p>This tax functions matches sells to buybacks of the same cryptoasset which occur within 30 days.</p>\n<p>As with the <a href=\"#match-same-day-rule\" rel=\"nofollow\">\"same day\"</a> rule, if the buy and sell quantities do not match, the transactions will be split.</p>\n<p>Transactions are sorted by timestamp, and matched in chronological order.</p>\n<p>Any matched \"same day\" transactions are excluded from this rule.</p>\n<p>In the log, you can see which transactions have been matched by the \"<em>Bed &amp; Breakfast</em>\" rule, the number of days between the sell and buyback are also shown.</p>\n<pre><span class=\"go\">INFO -- : ==MATCH BED &amp; BREAKFAST TRANSACTIONS==</span>\n<span class=\"go\">...</span>\n<span class=\"go\">DEBUG -- : T-Sell [TID:18.2] Trade: 5.32294271 BTC (~£1,474.69 GBP) + Fee=~£1.47 GBP 'Poloniex' 2016-01-27T22:09:19 GMT [5]</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:23.5] Trade: 5.54195456 BTC (~£1,471.32 GBP) + Fee=~£1.47 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [9] (Bed &amp; Breakfast, 2 days)</span>\n<span class=\"go\">DEBUG -- : split: T-Buy [TID:23.6] Trade: 5.32294271 BTC (~£1,413.17 GBP) + Fee=~£1.41 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [9]</span>\n<span class=\"go\">DEBUG -- : split: T-Buy [TID:23.7] Trade: 0.21901185 BTC (~£58.14 GBP) + Fee=~£0.06 GBP 'Poloniex' 2016-01-29T13:51:01 GMT [9]</span>\n<span class=\"go\">DEBUG -- :  Gain=£58.63 (proceeds=£1,474.69 - cost=£1,413.17 - fees=£2.89)</span>\n</pre>\n<h3>Process Unmatched (Section 104)</h3>\n<p>Any transactions which remain unmatched are processed according to Section 104 Taxation of Capital Gains Act 1992.</p>\n<p>Each cryptoasset is held in its own pool, known as a Section 104 holding, the unmatched transactions are processed in chronological order.</p>\n<p>As tokens are acquired, the total cost and total fees for that cryptoasset holding increases.</p>\n<p>If all tokens in a holding are disposed of, the cost will be the total cost of that cryptoasset holding, and likewise, the fees would be the total fees.</p>\n<p>If only some tokens are disposed of, the cost is calculated as a fraction of the total cost. This fraction is calculated by the number of tokens disposed of, divided by the total number of tokens held. The fees are also calculated as a fraction in the same way.</p>\n<p>The gain or loss, is then calculated by subtracting this cost and any fees from the proceeds of the disposal. Fees are included from both the Section 104 holding (acquisition fees) and also the disposal fee.</p>\n<p>For non-taxable transactions such as <code>Withdrawal</code> and <code>Deposit</code>, the tokens are removed, and then re-added to the holding, but at zero cost.</p>\n<p><strong>NOTE:</strong> It is important that no disposal event happens to a holding between a <code>Withdrawal</code> and a <code>Deposit</code>. This is because the tokens are removed temporarily, so would impact the cost calculation.</p>\n<p>In the log, before the Section 104 calculations, the updated transactions are listed for clarity, this includes any new \"split\" transactions which have been added by the matching function.</p>\n<p>Transactions which have been matched, and so excluded from the Section 104 holding, are denoted with (M) at the end.</p>\n<pre><span class=\"go\">DEBUG -- : ==UPDATED TRANSACTIONS==</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:2.1] Trade: 10 BTC (=£870.00 GBP) 'LocalBitcoins' 2013-05-24T21:17:40 BST</span>\n<span class=\"go\">DEBUG -- : T-Sell* [TID:3.1] Withdrawal: 10 BTC 'LocalBitcoins' 2013-05-24T21:20:49 BST</span>\n<span class=\"go\">DEBUG -- : T-Buy* [TID:4.1] Deposit: 10 BTC 'Desktop wallet' 2013-05-24T21:20:49 BST</span>\n<span class=\"go\">DEBUG -- : T-Sell [TID:6.1] Spend: 0.002435 BTC (=£0.80 GBP) 'Desktop wallet' 2014-06-26T12:25:02 BST (M)</span>\n<span class=\"go\">DEBUG -- : T-Sell [TID:7.1] Gift-Sent: 0.02757 BTC (~£10.14 GBP) 'Desktop wallet' 2014-07-18T14:12:47 BST (M)</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:8.2] Trade: 0.002435 BTC (~£0.89 GBP) + Fee=~£0.00 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [2] (M)</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:8.4] Trade: 0.02757 BTC (~£10.04 GBP) + Fee=~£0.05 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [2] (M)</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:8.5] Trade: 0.969995 BTC (~£353.29 GBP) + Fee=~£1.77 GBP 'Bitstamp' 2014-07-23T11:58:00 BST [2]</span>\n</pre>\n<p>As the unmatched transactions are processed, the impact it has on the individual holding is shown in the log.</p>\n<p>When a disposal takes place, the gain calculation is then shown below.</p>\n<pre><span class=\"go\">INFO -- : ==PROCESS UNMATCHED TRANSACTIONS==</span>\n<span class=\"go\">...</span>\n<span class=\"go\">DEBUG -- : T-Buy [TID:18.5] Trade: 843.00981977 ETH (~£1,471.74 GBP) + Fee=~£1.47 GBP 'Poloniex' 2016-01-27T22:04:21 GMT [5]</span>\n<span class=\"go\">DEBUG -- : ETH=843.00981977 (+843.00981977) cost=£1,471.74 GBP (+£1,471.74 GBP) fees=£1.47 GBP (+£1.47 GBP)</span>\n<span class=\"go\">DEBUG -- : T-Sell [TID:23.2] Trade: 843.00981977 ETH (~£1,474.27 GBP) + Fee=~£1.47 GBP 'Poloniex' 2016-01-29T14:12:31 GMT [9] (Disposal)</span>\n<span class=\"go\">DEBUG -- : ETH=0 (-843.00981977) cost=£0.00 GBP (-£1,471.74 GBP) fees=£0.00 GBP (-£1.47 GBP)</span>\n<span class=\"go\">DEBUG -- :  Gain=£-0.42 (proceeds=£1,474.27 - cost=£1,471.74 - fees=£2.95)</span>\n</pre>\n<h3>Process Income</h3>\n<p>This function searches through all the original transactions, and records any that are applicable for income tax. Currently this is only <code>Mining</code> and <code>Income</code> transaction types.</p>\n<h2>Conversion Tool</h2>\n<p>The bittytax conversion tool <code>bittytax_conv</code> takes all of the data files exported from your wallets and exchanges, normalises these into the transaction record format required by bittytax, and consolidates them into a single Excel spreadsheet for you to review, make edits, and add any missing records.</p>\n<p>Don't worry if you don't have Microsoft Excel installed, these spreadsheets also work with <a href=\"https://www.openoffice.org\" rel=\"nofollow\">OpenOffice</a> or <a href=\"https://www.libreoffice.org\" rel=\"nofollow\">LibreOffice</a>.</p>\n<p>Each converted file appears within its own worksheet, data files of the same format are aggregated together. The transaction records and the original raw data appear side by side, sorted by timestamp, making it easier for you to review and to provide traceability.</p>\n<p>The converter takes care of all the cell formatting to ensure that all decimal places are displayed correctly, and if numbers exceed 15-digits of precision (an Excel limitation) they are stored as text to prevent any truncation.</p>\n<p>For most wallet files, transactions can only be categorised as deposits or withdrawals. You will need to edit these to reflect your real transactions, i.e. spends, gifts, income, etc. With Excel it's easy, the valid options are selectable via a dropdown menu.</p>\n<p><strong>Wallets:</strong></p>\n<ul>\n<li>Electrum</li>\n<li>Ledger Live</li>\n<li>Qt Wallet (i.e. Bitcoin Core)</li>\n<li>Trezor</li>\n</ul>\n<p><strong>Exchanges:</strong></p>\n<ul>\n<li>Binance</li>\n<li>Bitfinex</li>\n<li>Bitstamp</li>\n<li>Bittrex</li>\n<li>ChangeTip</li>\n<li>Circle</li>\n<li>Coinbase</li>\n<li>Coinbase Pro</li>\n<li>Coinfloor</li>\n<li>Cryptopia</li>\n<li>Cryptsy</li>\n<li>Gatehub</li>\n<li>HitBTC</li>\n<li>KuCoin</li>\n<li>OKEx</li>\n<li>Poloniex</li>\n<li>TradeSatoshi</li>\n<li>Uphold</li>\n<li>Wirex</li>\n</ul>\n<p><strong>Explorers:</strong></p>\n<ul>\n<li>Etherscan</li>\n</ul>\n<h3>Usage</h3>\n<p>The help command displays a full list of recognised data file formats, as well as details of all command line arguments.</p>\n<pre><code>bittytax_conv --help\n</code></pre>\n<p>To use the conversion tool (assuming you've already exported your data), just enter the filenames of all your data files, in any order, as command arguments.</p>\n<p>Most terminals allow you to drag and drop files from the desktop into the terminal window, this saves you time by giving you the correct file path without having to enter it manually.</p>\n<pre><code>bittytax_conv &lt;filename&gt; [&lt;filename&gt; ...]\n</code></pre>\n<p>Each file is analysed to try and match it against one of the recognised formats. If successful, an Excel file will be generated with the default filename <code>BittyTax_Records.xlsx</code>. Unrecognised files are skipped and a warning displayed.</p>\n<p>If you want to change the default filename you can use the <code>-o</code> argument followed by the output filename.</p>\n<pre><code>bittytax_conv &lt;filename&gt; [&lt;filename&gt; ...] -o &lt;output filename&gt;\n</code></pre>\n<h3>Duplicate Records</h3>\n<p>For some exchanges you have to repeatedly download your transaction history, this can happen if the exchange only lets you run a report for the previous 3 months.</p>\n<p>If you have multiple export files for the same exchange, these can all be passed into the conversion tool which by default will group them together into the same worksheet and sort them by timestamp.</p>\n<p>If there is any overlap in the reporting period this can result in duplicate entries which will cause your data not to balance.</p>\n<p>One solution is to manually remove these duplicates, another is for the conversion tool to do it for you by specifying the <code>--duplicates</code> argument.</p>\n<p>This option should be used with care, since some exchange files can appear to have exact duplicates, but can be due to partially filled orders within the exact same time period, with same order id and even same amount!</p>\n<h3>Unidentified Cryptoassets</h3>\n<p>Some wallet exports do not specify the actual cryptoasset being used. This will result in an error when the file is processed.</p>\n<p>The <code>-ca</code> or <code>--cryptoasset</code> argument can be used to manually specify the asset.</p>\n<pre><code>bittytax_conv -ca BTC &lt;filename&gt;\n</code></pre>\n<p>If you have multiple wallet files with this issue, you can either process each one individually, and then consolidate them into a single spreadsheet. Or you could edit the asset name in the spreadsheet for any which are incorrect.</p>\n<h3>Output Formats</h3>\n<p>The default output format is Excel, but you can also choose CSV or RECAP by using the <code>--format</code> argument.</p>\n<p><strong>CSV</strong></p>\n<p>CSV is the legacy format used by bittytax which outputs transaction records directly into the terminal window, unless an output filename is specified.</p>\n<p>A useful feature of the CSV format is that the output can be piped directly into bittytax.</p>\n<pre><code>bittytax_conv --format CSV &lt;filename&gt; | bittytax\n</code></pre>\n<p>This will instantly show you what the remaining balance of each asset should be for that wallet or exchange file. Bear in mind that for some exchanges (I will try and list them below) the data provided will not balance exactly. This is probably due to the rounding used in the export file being different to that used internally by the exchange.</p>\n<p><strong>Recap</strong></p>\n<p>You can also use the conversion tool to convert your wallet or exchange files into the import CSV format used by Recap (see <a href=\"https://help.recap.io/en/articles/2631702-importing-csvs-into-custom-accounts\" rel=\"nofollow\">https://help.recap.io/en/articles/2631702-importing-csvs-into-custom-accounts</a>).</p>\n<pre><code>bittytax_conv --format RECAP &lt;filename&gt;\n</code></pre>\n<h3>Notes:</h3>\n<ol>\n<li>Some exchanges only allow the export of trades, this means transaction records of deposits and withdrawals will have to be created manually, otherwise the assets will not balance.</li>\n<li>Bitfinex - when exporting your data, make sure the \"<em>Date Format</em>\" is set to \"<em>DD-MM-YY</em>\" which is the default.</li>\n<li>ChangeTip - the conversion tool requires your username(s) to be configured, this is to identify which transactions are a gift received or a gift sent, (see <a href=\"#config\" rel=\"nofollow\">Config</a>).</li>\n<li>Coinbase - has many different export formats, bittytax recognises the \"<em>Transactions history</em>\" and \"<em>Buys, sells, and merchant payouts</em>\" reports (also known as \"<em>Transfers</em>\"). Coinbase provides these reports for each individual wallet (both fiat and crypto). It's possible to end up with duplicate transaction records (i.e. one for the GBP wallet and another for the BTC wallet), these have to be filtered manually, the converter will flag some of these duplicates it finds by setting the transaction type to Duplicate.</li>\n<li>Coinbase Pro - the converter recognises both the \"<em>Fills Report</em>\" export for trades and the \"<em>Account Report</em>\" export for deposits and withdrawals. Please note, the \"<em>Account Report</em>\" also contains details of the trades (\"<em>match</em>\") but with less detail, these are filtered by the tool to prevent duplicates.</li>\n<li>GateHub - some exports contain incomplete data (i.e. no counter asset in an \"<em>exchange</em>\"), these are possibly failed transactions, the tool will filter them and raise a warning for you to review, the data still appears to balance correctly. Any Ripple network fees which cannot be attributed to a \"<em>payment</em>\" or an \"<em>exchange</em>\" will be included separately as a Spend transaction record.</li>\n<li>Qt Wallet - by default, unconfirmed transactions are filtered by the conversion tool, if you want to include them use the <code>-uc</code> or <code>--unconfirmed</code> command argument.</li>\n<li>Exchanges which do not balance (just some dust left) are Cryptopia, OKEx, TradeSatoshi.</li>\n</ol>\n<h2>Price Tool</h2>\n<p>The bittytax price tool <code>bittytax_price</code> allows you to lookup current and historic prices of cryptoassets and foreign currencies. Its use is not strictly required as part of the process of completing your accounts but provides a useful insight into the prices which bittytax will assign when it comes to value your cryptoassets in UK pounds.</p>\n<p><strong>Data Sources:</strong>\nThe following price data sources are used.</p>\n<ul>\n<li><a href=\"https://exchangeratesapi.io\" rel=\"nofollow\">Exchange Rates API</a> - foreign currency exchange rates <em>(primary fiat)</em></li>\n<li><a href=\"https://ratesapi.io\" rel=\"nofollow\">Rates API</a> - foreign currency exchange rates <em>(secondary fiat)</em></li>\n<li><a href=\"https://www.coindesk.com/api\" rel=\"nofollow\">CoinDesk BPI</a> - bitcoin price index <em>(primary bitcoin)</em></li>\n<li><a href=\"https://min-api.cryptocompare.com\" rel=\"nofollow\">Crypto Compare</a> - cryptoasset prices <em>(primary crypto, secondary bitcoin)</em></li>\n<li><a href=\"https://www.coingecko.com/en/api\" rel=\"nofollow\">Coin Gecko</a> - cryptoasset prices <em>(secondary crypto)</em></li>\n<li><a href=\"https://coinpaprika.com/api/\" rel=\"nofollow\">Coin Paprika</a> - cryptoasset prices</li>\n</ul>\n<p>The priority (primary, secondary, etc) to which data source is used and for which asset is controlled by the <code>bittytax.conf</code> config file, (see <a href=\"#config\" rel=\"nofollow\">Config</a>). If your cryptoasset cannot be identified by the primary data source, the secondary source will be used, and so on.</p>\n<p>All price data is cached within the .bittytax/cache folder in your home directory, this is to prevent repeated lookups and reduce load on the APIs which could fail due to throttling.</p>\n<h3>Usage</h3>\n<p>To use the tool you need to pass the asset symbol name, either for a cryptoasset (i.e. BTC) or a foreign currency (i.e. USD), the second argument is only required for historic data lookups, the date must be in the format (YYYY-MM-DD). If the date is not specified the current price will be returned.</p>\n<pre><code>bittytax_price asset [date]\n</code></pre>\n<p>If the lookup is successful not only will the price be displayed in the terminal window, but also the data source used and the full name of the asset. This is useful in making sure the asset symbol you are using in your transaction records is the correct one.</p>\n<pre><span class=\"gp\">$</span> bittytax_price ETH\n<span class=\"go\">INFO -- : 1 ETH=£124.93 GBP via CryptoCompare (Ethereum)</span>\n</pre>\n<p>Since there is no standardisation of cryptoasset symbols, it's possible that the same symbol has two different meanings across different data sources. For example, BTCP is Bitcoin Private on CryptoCompare, but also Bitcoin Pro on CoinGecko.</p>\n<p>If bittytax is not picking up the correct price for you, you can change the config so that the asset symbol only uses the data source you require, see <a href=\"#config\" rel=\"nofollow\">Config</a>.</p>\n<p>You can use the help command argument to display a full list of the command line arguments.</p>\n<pre><code>bittytax_price --help\n</code></pre>\n<p>Another useful function of the price tool is to calculate the historic price of a specific transaction, you can use the <code>-q</code> or <code>--quantity</code> argument to specify the quantity to price, this can be used as a memory jogger if you are looking at old wallet transactions and trying to remember what it was you spent your crypto on.</p>\n<pre><span class=\"gp\">$</span> bittytax_price BTC <span class=\"m\">2014</span>-06-24 -q <span class=\"m\">0</span>.002435\n<span class=\"go\">INFO -- : 1 BTC=£338.59 GBP via CoinDesk (Bitcoin)</span>\n<span class=\"go\">INFO -- : 0.002435 BTC=£0.82 GBP</span>\n</pre>\n<h3>Notes:</h3>\n<ol>\n<li>Not all data source APIs return prices in UK pounds (GBP), for this reason cryptoasset prices are requested in BTC and then converted from BTC into UK pounds (GBP) as a two step process.</li>\n<li>Some APIs return multiple prices for the same day, if this is the case then the 'close' price is always used.</li>\n<li>Historical price data is held for each data source as a separate JSON file in the .bittytax/cache folder within your home directory.</li>\n</ol>\n<h2>Config</h2>\n<p>The <code>bittytax.conf</code> file resides in the .bittytax folder within your home directory.</p>\n<p>The <a href=\"https://github.com/BittyTax/BittyTax/blob/master/config/bittytax.conf\" rel=\"nofollow\">default</a> file created at runtime should cater for most users.</p>\n<p>If you need to change anything, the parameters are described below, the file is in YAML format.</p>\n<table>\n<thead>\n<tr>\n<th>Parameter</th>\n<th>Default</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>fiat_list:</code></td>\n<td><code>['GBP', 'EUR', 'USD']</code></td>\n<td>List of fiat symbols used</td>\n</tr>\n<tr>\n<td><code>crypto_list:</code></td>\n<td><code>['BTC', 'ETH', 'XRP', 'LTC', 'BCH', 'USDT']</code></td>\n<td>List of prioritised cryptoasset symbols</td>\n</tr>\n<tr>\n<td><code>trade_asset_type:</code></td>\n<td><code>2</code></td>\n<td>Method used to calculate asset value in a trade</td>\n</tr>\n<tr>\n<td><code>show_empty_wallets:</code></td>\n<td><code>True</code></td>\n<td>Include empty wallets in current holdings report</td>\n</tr>\n<tr>\n<td><code>transfers_include:</code></td>\n<td><code>True</code></td>\n<td>Include transfer transactions in tax calculations</td>\n</tr>\n<tr>\n<td><code>data_source_select:</code></td>\n<td><code>{'BTC': ['CoinDesk']}</code></td>\n<td>Map asset to a specific data source(s) for prices</td>\n</tr>\n<tr>\n<td><code>data_source_fiat:</code></td>\n<td><code>['ExchangeRatesAPI', 'RatesAPI']</code></td>\n<td>Default data source(s) to use for fiat prices</td>\n</tr>\n<tr>\n<td><code>data_source_crypto:</code></td>\n<td><code>['CryptoCompare', 'CoinGecko']</code></td>\n<td>Default data source(s) to use for cryptoasset prices</td>\n</tr>\n<tr>\n<td><code>usernames:</code></td>\n<td></td>\n<td>List of usernames as used by ChangeTip</td>\n</tr></tbody></table>\n<h3>fiat_list</h3>\n<p>Used to differentiate between fiat and cryptoassets symbols, make sure you configure all fiat currencies which appear within your transaction records here.</p>\n<h3>crypto_list</h3>\n<p>Identifies which cryptoasset takes priority when calculating the value of a crypto-to-crypto trade (see <a href=\"#trade_asset_type\" rel=\"nofollow\">trade_asset_type</a>). The priority is taken in sequence, so in an ETH/BTC trade, the value of the Bitcoin would be used in preference to Ethereum when pricing the trade.</p>\n<p>The list should contain the most prevalent cryptoassets which appear in exchange trading pairs, these are predominantly the higher market cap. tokens.</p>\n<h3>trade_asset_type</h3>\n<p>Controls the method used to calculate the asset value of a trade:</p>\n<ul>\n<li><code>0</code> = Buy asset value</li>\n<li><code>1</code> = Sell asset value</li>\n<li><code>2</code> = Priority asset value <em>(recommended)</em></li>\n</ul>\n<p>For every trade there are always two assets involved, fiat-to-crypto, crypto-to-fiat or crypto-to-crypto. When bittytax is trying to calculate the value of a trade, it uses this parameter to determine which asset value should be used to price the trade in UK pounds.</p>\n<p>For trades involving fiat, it's obvious that we want to price the asset using the fiat value, but for crypto-to-crypto trades it's not so straight forward.</p>\n<p>The recommended setting is <code>2</code> (Priority), this means that the asset value chosen will be selected according to the priority order defined by the <code>fiat_list</code> and <code>crypto_list</code> parameters combined. Fiat will always be chosen first, followed by the most prevalent cryptoasset.</p>\n<p>Setting this parameter to <code>1</code> or <code>2</code> will result in either the buy asset value or the sell asset value always being used, regardless of whether the trades involved fiat or not.</p>\n<h3>show_empty_wallets</h3>\n<p>Include empty wallets in the current holdings report. Can be set to <code>True</code> or <code>False</code>.</p>\n<h3>transfers_include</h3>\n<p>Include transfer transaction types (i.e. Deposit, Withdrawal) in tax calculations. Can be set to <code>True</code> (recommended) or <code>False</code>.</p>\n<p>Although these transactions types are non-taxable they do affect the cost basis of your cryptoasset holding.</p>\n<h3>data_source_select</h3>\n<p>Maps a specific asset symbol to a list of data sources in priority order.</p>\n<p>This parameter overrides the any data sources defined by <code>data_source_fiat</code> and <code>data_source_crypto</code>, see below.</p>\n<p>By default, only an entry for BTC exists, this selects CoinDesk as the primary data source for bitcoin prices, and CryptoCompare as the secondary.</p>\n<p>If, for example you wanted BTCP to use only the CoinGecko data source, you would change the config as follows.</p>\n<pre><span class=\"nt\">data_source_select</span><span class=\"p\">:</span> <span class=\"p p-Indicator\">{</span>\n    <span class=\"s\">'BTC'</span><span class=\"p p-Indicator\">:</span> <span class=\"p p-Indicator\">[</span><span class=\"s\">'CoinDesk'</span><span class=\"p p-Indicator\">,</span> <span class=\"s\">'CryptoCompare'</span><span class=\"p p-Indicator\">],</span>\n    <span class=\"s\">'BTCP'</span><span class=\"p p-Indicator\">:</span> <span class=\"p p-Indicator\">[</span><span class=\"s\">'CoinGecko'</span><span class=\"p p-Indicator\">],</span>\n    <span class=\"p p-Indicator\">}</span>\n</pre>\n<h3>data_source_fiat</h3>\n<p>Specifies which data source(s), in priority order, will be used for retrieving foreign currency exchange rates.</p>\n<pre><span class=\"nt\">data_source_fiat</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">[</span><span class=\"s\">'ExchangeRatesAPI'</span><span class=\"p p-Indicator\">,</span> <span class=\"s\">'RatesAPI'</span><span class=\"p p-Indicator\">]</span>\n</pre>\n<p>Supported data sources for fiat are:</p>\n<ul>\n<li><code>ExchangeRatesAPI</code></li>\n<li><code>RatesAPI</code></li>\n</ul>\n<h3>data_source_crypto</h3>\n<p>Specifies which data source(s), in priority order, will be used for retrieving cryptoasset prices.</p>\n<pre><span class=\"nt\">data_source_crypto</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">[</span><span class=\"s\">'CryptoCompare'</span><span class=\"p p-Indicator\">,</span> <span class=\"s\">'CoinGecko'</span><span class=\"p p-Indicator\">]</span>\n</pre>\n<p>Supported data sources for cryptoassets are:</p>\n<ul>\n<li><code>CoinDesk</code></li>\n<li><code>CryptoCompare</code></li>\n<li><code>CoinGecko</code></li>\n<li><code>CoinPaprika</code></li>\n</ul>\n<h3>usernames</h3>\n<p>This parameter is only used by the conversion tool.</p>\n<p>It's required for ChangeTip data files, the list of username(s) is used to identify which transactions are gifts received and gifts sent.</p>\n<p>An example is shown below.</p>\n<pre><span class=\"nt\">usernames</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">[</span><span class=\"s\">'Bitty_Bot'</span><span class=\"p p-Indicator\">,</span> <span class=\"s\">'BittyBot'</span><span class=\"p p-Indicator\">]</span>\n</pre>\n<h2>Future</h2>\n<p>Ideas for the project roadmap, let me know what you would fine most useful, or any new features you would like to see.</p>\n<h3>General</h3>\n<ul>\n<li>Document code</li>\n<li>Add tests</li>\n</ul>\n<h3>Conversion Tool</h3>\n<ul>\n<li>Convert data from clipboard. Some wallets/exchanges don't provide an export function, it should be possible to copy the transaction data directly from the webpage and have the conversion tool analysis this data and then convert it into the transaction record format.</li>\n<li>Add exchange APIs to automatically convert new trades into the transaction record format.</li>\n</ul>\n<h3>Price Tool</h3>\n<ul>\n<li>Add command option to list supported cryptoassets symbols/names for a specific data source(s).</li>\n</ul>\n<h3>Accounting Tool</h3>\n<ul>\n<li>BittyTax integration with Excel. The command line interface is not for everyone, by integrating with Excel (or OpenOffice) this would greatly improve the user experience.</li>\n<li>Add export function for QuickBooks (QBXML format), to include transactions records with exchange rate data added.</li>\n<li>Tax rules for other countries</li>\n</ul>\n<h2>Resources</h2>\n<p><strong>HMRC Links:</strong></p>\n<ul>\n<li><a href=\"https://www.gov.uk/government/publications/tax-on-cryptoassets/cryptoassets-for-individuals\" rel=\"nofollow\">https://www.gov.uk/government/publications/tax-on-cryptoassets/cryptoassets-for-individuals</a></li>\n<li><a href=\"https://www.gov.uk/guidance/check-if-you-need-to-pay-tax-when-you-receive-cryptoassets\" rel=\"nofollow\">https://www.gov.uk/guidance/check-if-you-need-to-pay-tax-when-you-receive-cryptoassets</a></li>\n<li><a href=\"https://www.gov.uk/guidance/check-if-you-need-to-pay-tax-when-you-sell-cryptoassets\" rel=\"nofollow\">https://www.gov.uk/guidance/check-if-you-need-to-pay-tax-when-you-sell-cryptoassets</a></li>\n<li><a href=\"https://www.gov.uk/guidance/non-cash-pay-shares-commodities-you-provide-to-your-employees\" rel=\"nofollow\">https://www.gov.uk/guidance/non-cash-pay-shares-commodities-you-provide-to-your-employees</a></li>\n<li><a href=\"https://www.gov.uk/hmrc-internal-manuals/vat-finance-manual/vatfin2330\" rel=\"nofollow\">https://www.gov.uk/hmrc-internal-manuals/vat-finance-manual/vatfin2330</a></li>\n<li><a href=\"https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg12100\" rel=\"nofollow\">https://www.gov.uk/hmrc-internal-manuals/capital-gains-manual/cg12100</a></li>\n<li><a href=\"https://www.gov.uk/government/publications/cryptoassets-taskforce\" rel=\"nofollow\">https://www.gov.uk/government/publications/cryptoassets-taskforce</a></li>\n</ul>\n<p><strong>HMRC Webinar</strong></p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=EzNebqkw13w\" rel=\"nofollow\">https://www.youtube.com/watch?v=EzNebqkw13w</a></li>\n</ul>\n\n          </div>"}, "last_serial": 7001738, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "0e005fa0060d32ae51ff919bfdeb8a03", "sha256": "084fb5ec1d2969fd7b197e1cd7c1a90af5f5744060e409ee93c58acda64e244b"}, "downloads": -1, "filename": "BittyTax-0.1.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "0e005fa0060d32ae51ff919bfdeb8a03", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 70125, "upload_time": "2019-05-23T22:54:54", "upload_time_iso_8601": "2019-05-23T22:54:54.403730Z", "url": "https://files.pythonhosted.org/packages/0f/9e/93286cb8ce0f7b109781cfc56737e1c60937e841607c5b68b808135cbbe0/BittyTax-0.1.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b506dcda54c0795684a4a8dce5b6b259", "sha256": "23c49095719c04642352d3062d068857e1d5e8d713545fc64faafa3055fdd793"}, "downloads": -1, "filename": "BittyTax-0.1.0.tar.gz", "has_sig": false, "md5_digest": "b506dcda54c0795684a4a8dce5b6b259", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 82326, "upload_time": "2019-05-23T22:54:57", "upload_time_iso_8601": "2019-05-23T22:54:57.146349Z", "url": "https://files.pythonhosted.org/packages/87/77/a5c99e8bf0c135f95b257a49027f8f76526434448fa37b34d443baf56a53/BittyTax-0.1.0.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "a54fc6fc17b99e5da090bfb4788df3e7", "sha256": "21f220267883c8a744a419e5e21326f8f4e7d9adc5da46bfeef1d51ac024b7f1"}, "downloads": -1, "filename": "BittyTax-0.1.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "a54fc6fc17b99e5da090bfb4788df3e7", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 65584, "upload_time": "2019-05-29T20:30:14", "upload_time_iso_8601": "2019-05-29T20:30:14.871239Z", "url": "https://files.pythonhosted.org/packages/6f/c1/b67b16773962f9c37db74cc36c0ed5546262851552bdc3d6726ac9eeb463/BittyTax-0.1.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0dd58d6523783cdd460bce04908bc4ee", "sha256": "aa3ae9e6621c37d964d71a818bd81c00cebb91be3910679653419698aff58d3f"}, "downloads": -1, "filename": "BittyTax-0.1.1.tar.gz", "has_sig": false, "md5_digest": "0dd58d6523783cdd460bce04908bc4ee", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 83314, "upload_time": "2019-05-29T20:30:16", "upload_time_iso_8601": "2019-05-29T20:30:16.906797Z", "url": "https://files.pythonhosted.org/packages/9a/98/d2219672bd31a0b3116975372b18d9d475210cbdc3017b3949f163f6fdb4/BittyTax-0.1.1.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "0d0a1201930cfa2dba46f9c43b450f27", "sha256": "c477fa11ab310dfb9dad32e4f5cfb32f64a1549444558d83aa03995a5fb396ea"}, "downloads": -1, "filename": "BittyTax-0.1.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "0d0a1201930cfa2dba46f9c43b450f27", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 67926, "upload_time": "2019-06-30T15:24:33", "upload_time_iso_8601": "2019-06-30T15:24:33.245615Z", "url": "https://files.pythonhosted.org/packages/26/a3/dd10a6f6e47c84511c7678e11224cf088e375ef722aad2a1ea47117a754f/BittyTax-0.1.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "3966df8820101cccbee3a15301d3b5fb", "sha256": "8d93758b681421cda8fa1b3221f55d9faf788df38c51b2edd80d6887c501c768"}, "downloads": -1, "filename": "BittyTax-0.1.2.tar.gz", "has_sig": false, "md5_digest": "3966df8820101cccbee3a15301d3b5fb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 84477, "upload_time": "2019-06-30T15:24:35", "upload_time_iso_8601": "2019-06-30T15:24:35.407186Z", "url": "https://files.pythonhosted.org/packages/d4/e7/d298311177c8286742b2b45d2094746fa2640c7e1ea1e93d3a6ff846be99/BittyTax-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "6ddb407c55e0d35310cfc915fa54c153", "sha256": "9decfe26dc4013d2391504197e6c7c8a6e86a6d645f41b812485b1c3166a0b75"}, "downloads": -1, "filename": "BittyTax-0.1.3-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "6ddb407c55e0d35310cfc915fa54c153", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 71899, "upload_time": "2019-08-14T09:14:39", "upload_time_iso_8601": "2019-08-14T09:14:39.279908Z", "url": "https://files.pythonhosted.org/packages/63/9e/1673f86d6124a6cac12b207d7a89a0ddcd548244eb5b787eb564238eff1c/BittyTax-0.1.3-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "976e8b2f34c9483daa4d80e4f5c0fe2d", "sha256": "06083770f0c5fdd46855276f68bb81df65331ce94886ec84afae7d2dc6e51c8d"}, "downloads": -1, "filename": "BittyTax-0.1.3.tar.gz", "has_sig": false, "md5_digest": "976e8b2f34c9483daa4d80e4f5c0fe2d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 87319, "upload_time": "2019-08-14T09:14:41", "upload_time_iso_8601": "2019-08-14T09:14:41.368908Z", "url": "https://files.pythonhosted.org/packages/34/02/3924e2fa93fd7bb143d46531f745713d28ecd56ba8a1ec4742513f540650/BittyTax-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "a52ae5aad4123afbd354fec7db82fc7d", "sha256": "29b574e7778d3e67532aa3c77c8b132e083692e89391e21a1e2d9e3dc33271de"}, "downloads": -1, "filename": "BittyTax-0.1.4-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "a52ae5aad4123afbd354fec7db82fc7d", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 72148, "upload_time": "2019-08-28T12:49:02", "upload_time_iso_8601": "2019-08-28T12:49:02.127197Z", "url": "https://files.pythonhosted.org/packages/32/6c/113dc9cf55a93e39b4195b3b8df44cf1b1b14f3438cd5c1a8f38519d2849/BittyTax-0.1.4-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "03b223dc1356b88e020293ebf32df3e0", "sha256": "55606f6236b663538e793288556a9be0119a0915f26851cc8599ef92a05a75e2"}, "downloads": -1, "filename": "BittyTax-0.1.4.tar.gz", "has_sig": false, "md5_digest": "03b223dc1356b88e020293ebf32df3e0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 87545, "upload_time": "2019-08-28T12:49:03", "upload_time_iso_8601": "2019-08-28T12:49:03.925119Z", "url": "https://files.pythonhosted.org/packages/3e/32/b253243a135257bf1998e4378d44df6b2348f25b9dd963c7dc93a53afb2c/BittyTax-0.1.4.tar.gz", "yanked": false}], "0.2.0": [{"comment_text": "", "digests": {"md5": "92539b379366fe4b334e306c5139616d", "sha256": "26a31a96ceef0f4bfa321466742fafaecfd3ddaee0aaf921508cebb3cee42e34"}, "downloads": -1, "filename": "BittyTax-0.2.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "92539b379366fe4b334e306c5139616d", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 81436, "upload_time": "2019-10-30T13:57:00", "upload_time_iso_8601": "2019-10-30T13:57:00.998312Z", "url": "https://files.pythonhosted.org/packages/ab/23/39e638159a62ea3476406e3f70c6c1bb95f8d2a87d26141741fbeff83969/BittyTax-0.2.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e753e8b7877f90e391f2dcfe5bd10b1f", "sha256": "e2c3881eef09d20437571c359923458787ffafca1763f0e0b277418c5632793f"}, "downloads": -1, "filename": "BittyTax-0.2.0.tar.gz", "has_sig": false, "md5_digest": "e753e8b7877f90e391f2dcfe5bd10b1f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 93618, "upload_time": "2019-10-30T13:57:02", "upload_time_iso_8601": "2019-10-30T13:57:02.884987Z", "url": "https://files.pythonhosted.org/packages/06/81/ae94904dabd6eae6f949a25e166ba76bca41373948721f6414ac6a3cb525/BittyTax-0.2.0.tar.gz", "yanked": false}], "0.2.1": [{"comment_text": "", "digests": {"md5": "b20364c0226c05f1685cdd65338e3d96", "sha256": "b12eec14303acda6577649db168bdc7a8dcb989db77ffa4df062a10b57656036"}, "downloads": -1, "filename": "BittyTax-0.2.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "b20364c0226c05f1685cdd65338e3d96", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 73464, "upload_time": "2020-03-07T18:19:02", "upload_time_iso_8601": "2020-03-07T18:19:02.486912Z", "url": "https://files.pythonhosted.org/packages/cb/ff/67295dd3c607fc85a185ac0f62ea3a1c516cd8f339b165da844850aa7100/BittyTax-0.2.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5245132c0e125aebb98cb533191b77f0", "sha256": "11fb3ae6ca2fe021cbc2e284d37d20ed19a8fb714fbf93fa295ff8d12d9767bc"}, "downloads": -1, "filename": "BittyTax-0.2.1.tar.gz", "has_sig": false, "md5_digest": "5245132c0e125aebb98cb533191b77f0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 98957, "upload_time": "2020-03-07T18:19:04", "upload_time_iso_8601": "2020-03-07T18:19:04.199336Z", "url": "https://files.pythonhosted.org/packages/56/c9/e2ca2b2ff502bb529cd71209cfdaff2e23c48df4b3f1fc3d73c4025cd0b6/BittyTax-0.2.1.tar.gz", "yanked": false}], "0.3.0": [{"comment_text": "", "digests": {"md5": "36efb90c20e3147b31140d3650036f71", "sha256": "0e02edce1736573fb27a1753eabf0e5b45827c0c3afd23584ea3227c9703a4de"}, "downloads": -1, "filename": "BittyTax-0.3.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "36efb90c20e3147b31140d3650036f71", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 41379, "upload_time": "2020-04-11T11:48:41", "upload_time_iso_8601": "2020-04-11T11:48:41.813933Z", "url": "https://files.pythonhosted.org/packages/96/e9/c9c6356e31644ad7bf1597f6d271f00706df773c8503bdb94aecac548429/BittyTax-0.3.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "87ad3758f837fbab17fc3deaed7f1eee", "sha256": "0b3bd120d189bd7d2b83a1eeb8a411b5749a023e0afc6ff39ff238240f82faac"}, "downloads": -1, "filename": "BittyTax-0.3.0.tar.gz", "has_sig": false, "md5_digest": "87ad3758f837fbab17fc3deaed7f1eee", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 82294, "upload_time": "2020-04-11T11:48:43", "upload_time_iso_8601": "2020-04-11T11:48:43.585754Z", "url": "https://files.pythonhosted.org/packages/3f/24/6d630387451359156d29d8c72e9f881a3eac5c2e9bc808b3bb956d822e31/BittyTax-0.3.0.tar.gz", "yanked": false}], "0.3.1": [{"comment_text": "", "digests": {"md5": "3759269c3f9b6cf091ea197e61f1a939", "sha256": "88ea015bc635f3c9a3ed1ef9ec113274dea7af87e007f623615fe3894d68dea0"}, "downloads": -1, "filename": "BittyTax-0.3.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "3759269c3f9b6cf091ea197e61f1a939", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 58987, "upload_time": "2020-04-11T12:19:49", "upload_time_iso_8601": "2020-04-11T12:19:49.133935Z", "url": "https://files.pythonhosted.org/packages/0e/ec/d4b921aada8fea8c276b931abef225102c4c1d6a863c4a8176855c617c58/BittyTax-0.3.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "28e8d0e283ef6532ef73d73bf367fe3b", "sha256": "c1bab9e2c18c3b3f43059c4f47a04af65e58c6b47fb386702fb0dd04417b38a0"}, "downloads": -1, "filename": "BittyTax-0.3.1.tar.gz", "has_sig": false, "md5_digest": "28e8d0e283ef6532ef73d73bf367fe3b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 94029, "upload_time": "2020-04-11T12:19:50", "upload_time_iso_8601": "2020-04-11T12:19:50.852619Z", "url": "https://files.pythonhosted.org/packages/3f/8f/55a45e56899800cc83f8f785ec5beaf4ae72252f90842f605ecb20df5e6a/BittyTax-0.3.1.tar.gz", "yanked": false}], "0.3.2": [{"comment_text": "", "digests": {"md5": "3ee2a14d9d6b1305083cb85e25d381aa", "sha256": "d66c98711450860851a6534c8f14a31d55b75c5ab2ea6f5a6498153fcb8e18a6"}, "downloads": -1, "filename": "BittyTax-0.3.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "3ee2a14d9d6b1305083cb85e25d381aa", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 81233, "upload_time": "2020-04-11T21:29:37", "upload_time_iso_8601": "2020-04-11T21:29:37.114298Z", "url": "https://files.pythonhosted.org/packages/69/e5/bb947561cc85bef7ac825bf963318c1cef63b0be6f284949fd3fe3a866b0/BittyTax-0.3.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "09720b55f053c50a930bbfb4433afca5", "sha256": "95bf468cac2e439192a08400eca37dc884554b07bfd0d2871ea195111950ee52"}, "downloads": -1, "filename": "BittyTax-0.3.2.tar.gz", "has_sig": false, "md5_digest": "09720b55f053c50a930bbfb4433afca5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 103108, "upload_time": "2020-04-11T21:29:38", "upload_time_iso_8601": "2020-04-11T21:29:38.907881Z", "url": "https://files.pythonhosted.org/packages/16/b2/d8bf8a60ca8e0b6b9d1016bda473b778ef800b3cb5f8c1664e88869471ff/BittyTax-0.3.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "3ee2a14d9d6b1305083cb85e25d381aa", "sha256": "d66c98711450860851a6534c8f14a31d55b75c5ab2ea6f5a6498153fcb8e18a6"}, "downloads": -1, "filename": "BittyTax-0.3.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "3ee2a14d9d6b1305083cb85e25d381aa", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 81233, "upload_time": "2020-04-11T21:29:37", "upload_time_iso_8601": "2020-04-11T21:29:37.114298Z", "url": "https://files.pythonhosted.org/packages/69/e5/bb947561cc85bef7ac825bf963318c1cef63b0be6f284949fd3fe3a866b0/BittyTax-0.3.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "09720b55f053c50a930bbfb4433afca5", "sha256": "95bf468cac2e439192a08400eca37dc884554b07bfd0d2871ea195111950ee52"}, "downloads": -1, "filename": "BittyTax-0.3.2.tar.gz", "has_sig": false, "md5_digest": "09720b55f053c50a930bbfb4433afca5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 103108, "upload_time": "2020-04-11T21:29:38", "upload_time_iso_8601": "2020-04-11T21:29:38.907881Z", "url": "https://files.pythonhosted.org/packages/16/b2/d8bf8a60ca8e0b6b9d1016bda473b778ef800b3cb5f8c1664e88869471ff/BittyTax-0.3.2.tar.gz", "yanked": false}], "timestamp": "Thu May  7 22:37:13 2020"}