{"info": {"author": "BlueChipTek", "author_email": "joe@bluechiptek.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: GNU General Public License v3 (GPLv3)", "Programming Language :: Python :: 3 :: Only"], "description": "# CLOUDHEALTH TOOLS\n\nPython3 library and CLI tool to manage CloudHealth.\n\n## INSTALLATION\n\nInstallation for normal everyday usage is done via `pip`.\n\n```\npip3 install chtools\n```\n\nFor development and testing a `requirements-dev.txt` file has been provided for installation of necessary Python packages.\n\n## CONFIGURATION\n\nYou will need a CloudHealth API Key to use any of these utilities. You can get your CloudHealth API key by the steps outlined here - https://github.com/CloudHealth/cht_api_guide#getting-an-api-key.\n\nYou can set the API Key either via a `CH_API_KEY` environment variable or via a `--api-key` argument.\n\nAs a provider you can specify a `--client-api-id` argument to perform actions against a tenant.\n\n\n## CLI TOOL USAGE\n\nA `chtools` CLI utility is the main way the CloudHealth tools are intended to be used. The `chtools` has several \"subcommands\" to indicated what feature of CloudHealth you would like to interact with. Each feature has several \"subcommands\" to indication what action you wish to take. In general it's:\n\n```\n$ chtools featrue command --arg-name arg-value\n```\n\nSpecific examples looks like this\n\n```\n$ chtools aws-account create --name new-account --assume-role-arn arn:aws:iam::123456789012:role/CloudHealth\n$ chtools perspective get-schema --name my-perspective\n```\n\nYou can specify `help` for the feature or command to get context specific help.\n\n### GLOBAL ARGS\nInfo on args that apply to all features and commands can be viewed via help. Refer to the actual output of help to ensure latest info.\n\n```\nusage: chtools [--api-key API_KEY] [--client-api-id CLIENT_API_ID]\n               [--log-level LOG_LEVEL]\n               {aws-account,perspective,help}\n\nCLI to interact with CloudHealth.\n\npositional arguments:\n  {aws-account,perspective,help}\n                        CloudHealth feature that you wish to interact with.\n\noptional arguments:\n  --api-key API_KEY     CloudHealth API Key. May also be set via the\n                        CH_API_KEY environmental variable.\n  --client-api-id CLIENT_API_ID\n                        CloudHealth client API ID.\n  --log-level LOG_LEVEL\n                        Log level sent to the console.\n```\n\n### aws-account\nThe `aws-account` feature is used to create and manage AWS accounts. Info on the args that can be used when using the `aws-account` feature can be viewed via help. Refer to the actual output of help to ensure latest info.\n\n```\nusage: chtools aws-account [--account-id ACCOUNT_ID]\n                           [--assume-role-arn ASSUME_ROLE_ARN]\n                           [--dbr-bucket DBR_BUCKET] [--name NAME]\n                           [--owner-id OWNER_ID] [--spec-file SPEC_FILE]\n                           [--schema-file SCHEMA_FILE]\n                           {create,delete,get-schema,get-spec,help,list,update}\n\nCreate and manage AWS Accounts\n\npositional arguments:\n  {create,delete,get-schema,get-spec,help,list,update}\n                        Account action to take.\n\noptional arguments:\n  --account-id ACCOUNT_ID\n                        CloudHealth Account Id for the AWS Account to interact\n                        with. Can not specify with --name or --owner-id.\n  --assume-role-arn ASSUME_ROLE_ARN\n                        The ARN of the role that account should use to connect\n                        to the AWS Account\n  --dbr-bucket DBR_BUCKET\n                        The name of the bucket used to store the DBR reports.\n  --name NAME           Name of the AWS Account to interact with. Can not\n                        specify with --account-id or --owner-id when getting\n                        schema or spec. Specifying name with create or update\n                        with change the accounts name.\n  --owner-id OWNER_ID   AWS Account Id for the AWS Account to interact with.\n                        Can not specify with --name or --account-id.\n  --spec-file SPEC_FILE\n                        Path to the YAML spec file to create or update an AWS\n                        Account.\n  --schema-file SCHEMA_FILE\n                        Path to the JSON spec file to create or update an AWS\n                        Account.\n```\n\n\nCreating or deleting account is only in the context of CloudHealth's connection to the AWS account. CLI Args can be use to supply most common config options needed to connect to an account.\n\n```\n$ chtools aws-account create --name my-account --assume-role-arn arn:aws:iam::123456789012:role/CloudHealth --dbr-bucket org-ch-dbr-bucket\n```\nIf you wish to supply more config options, say for example configure CloudTrail bucket, then you will need to use a JSON schema or YAML spec file (spec file is just the JSON Schema in YAML format). You can specify the schema or spec file as the input to the command. See the CloudHealth API docs and contents of `tests/account_data` for more details on the AWS Account schema.\n\nA few notes:\n* Currently the CUR bucket can not be set via API :-(\n* `account-id` refers the id number of the AWS Account in CloudHealth. This is different than the AWS Account id for the account, which is refereed to as `owner-id`.\n\n\n### perspective\nThe `perspective` feature is used to create and manage CloudHealth perspectives. Interaction with perspectives is done either via [raw JSON schemas as described in the CloudHealth API Guide](http://apidocs.cloudhealthtech.com/#perspectives_introduction-to-perspectives-api) or via YAML based spec files.\n\nThe YAML based spec files are based on the JSON schema, but some \"syntactical sugar\" has been implemented to make them a bit more human friendly. YAML spec files support the following features:\n\n* In the schema a rule can either ba a `filter` rule or a `categorize` rule. In the Web UI the `filter` rules are refereed to as `search` rules. Spec files allow you to use `filter` and `search` interchangeably.\n* You don't need to worry about ref_ids or constructing Dynamic Groupings. You can reference the name of a perspective group you'd like the rule to use instead of needing the ref_id. `chtools perspective` will retrieve the correct ref_id based on the name or generate a new one if it's a new perspective group. This means new perspective groups are created just by referring to them.\n* In the schema, `filter` rules use the `to` key to determine the perspective group it references, while `categorize` uses `ref_id`. Spec files allow you to use `to` for `categorize` as well, this makes things a bit more consistent between the two rule types. *Note: `categorize` rules currently have both a `to` and `name` keys, but spec will may drop the need to specify the `name` key in the future.*\n* The schema has many keys that require only a single item list as a value. Spec files support these as just string values.\n* Spec files support lists of asset types for `filter` rules. A rule in the schema can only apply to a single asset type. This can lead to many rules that do almost the exact same thing. For example to get all taggable financial assets into a perspective group you need to includes rules for the assets: `AwsAsset`, `AwsTaggableAsset` & `AwsEmrCluster` *(it's possible the last one `AwsEmrCluster` is no longer needed)*. If you had three tags you wanted use to put into a single perspective group, then you would need 9 rules, 1 per tag per asset type. This features does need to be used with caution as some asset types don't really make sense with certain condition clauses. Recommended to just stick to combining asset types that utilize `tag_field`. Asset types included in a list like this should be considered logical ORs.\n\nInfo on the args that can be used when using the `perspective` feature can be viewed via help. Refer to the actual output of help to ensure latest info.\n\n```\nusage: chtools perspective [--name NAME] [--spec-file SPEC_FILE]\n                           [--schema-file SCHEMA_FILE]\n                           {create,delete,empty-archive,get-schema,get-spec,help,list,update}\n\nCreate and manage perspectives\n\npositional arguments:\n  {create,delete,empty-archive,get-schema,get-spec,help,list,update}\n                        Perspective action to take.\n\noptional arguments:\n  --name NAME           Name of the perspective to get or delete. Name for\n                        create or update will come from the spec or schema\n                        file.\n  --spec-file SPEC_FILE\n                        Path to the file containing YAML spec used to create\n                        or update the perspective.\n  --schema-file SCHEMA_FILE\n                        Path to the file containing JSON schema used to create\n                        or update the perspective.\n```\n\n*Note*: Initally `chtools perspective` was released as a stand alone CLI utility called `perspective-tool`. `chtools perspective` is functionally equivalent to `perspective-tool` (same code, just different CLI wrapper). `perspective-tool` is still available, but should be considered depreciated.\n\n#### SPEC FILES\nBeing familiar with [CloudHealth Perspective Schemas](http://apidocs.cloudhealthtech.com/#perspectives_introduction-to-perspectives-api) will help when dealing with spec files.\n\nExamples of spec files can be found in `tests/perspective_data/specs`.\n\nIt's also a good idea to create a rule in the Web GUI and then use the `chtools perspective get-spec --name perspective-name` to look at the YAML spec for that perspective.\n\nSpec files used by `chtools perspective` are in YAML and support the following top-level keys, which all are required. Note all keys are lower case.\n\n * name: Name of the perspective.\n * include_in_reports: string 'true' or 'false'.\n * match_lowercase_tag_field: boolean. If true, then filter rules will always match the lowercase value of the tag_field in the filter rule clauses. For example if the rule matches the tag name of \"Test\" then a clause will be added to match the tag name of \"test\" as well.\n * match_lowercase_tag_val: boolean. Same as match_lowercase_tag_field but for the values of the tag instead of the tag name.\n * rules: A list of rule mappings.\n * merges: If a perspective contains a `categorize` rule then a list of merge mappings can be provided to merge Dynamic Groups.\n\nEach rule is a YAML mapping, with two types of rules `filter` and `categorize`.\n\n`filter` rules have the following keys:\n\n * type: either `filter` or `search`\n * asset: either a string of a valid asset type or a list of valid asset types. Some asset types may not make sense together in the same rule.\n * to: The name of the perspective group that resources matching this rule should be assigned to. New groups will be created as needed.\n * condition: A YAML mapping with the following keys:\n   * clauses: a list of clauses. It's really best to just go look at examples in `tests/perspective_data/specs` for what clauses look like. There can be nuances from one clause type to another, so it's best to create the rule in web GUI and then export the spec and see how it has been generated.\n   * combine_with: required and only allowed if the list of clauses include more than one item. Set to either OR or AND (uppercase) based on how you want the clauses evaluated.\n\n**Warning:** CloudHealth Perspectives API does not support deleting perspective groups via the API. Groups that should be deleted via the API will have their associated rules deleted, this will cause them to appear aqua green the Web UI making it easy to identify what should be removed manually.\n\n`categorize` rules have the following keys for categorizing by tag. If you want to categorize by something else, then create the rule in web GUI and then export the spec and see how it's been generated.\n * type: `categorize`\n * asset: a string of a valid asset type (list not supported here for now, not sure API will support).\n * to: The name of the perspective group resources matching this rule should be assigned to. New groups will be created as needed. Should be set to be the same as `name`.\n * name: This is the name that will of the perspective group that will be  displayed. Should be the set to be the same as `to`.\n * tag_field: The name of the tag to categorize by.\n\nIf a perspective has a one or more `categorize` rules then you may specify mappings defining Dynamic Group merges. Each mapping is to have the following keys.\n * name: The name of the categorize rule that this merge applies to.\n * type: Must be `Group`.\n * to: The name of the Dynamic Group in which the other groups will be merged. This group must exist (i.e. If the Dynamic Groups are based off of tags then CloudHealth must have discovered an asset with that tag and created a Dynamic Group for that tag value).\n * from: A list of Dynamic Groups that will be merged into the Dynamic Group specified by the `to` key. Like the `to` key, the values provide here must match the name of Dynamic Groups that already exist. Either `from` or `from_regex` must be specified (i.e. only one can be specified).\n * from_regex: A list of regexs that will be used to determine what Dynamic Groups should be merged. Any group matching on the regexs will be merged with the group specified by the `to` key. A spec where a group is merged with two different groups will fail to apply. Merges are only evaluated at the time the spec is applied (i.e. either when the perspective is created or updated). The regexs do not necessarily have to match an existing group. Because each Dynamic Group is evaluated at the time the spec is applied you could specify group regexs to match existing and future group. You would then apply the spec on a schedule, such as daily, to merge any newly created groups. Either `from` or `from_regex` must be specified (i.e. only one can be specified).\n\n\n**Warning:** CloudHealth Perspectives API does not support unmerging groups or changing the group in which a group has already been merged. If you need to unmerge or change the merge configuration (other than merging new groups), then it's recommended to use the `Delete All` button in the CloudHealth web GUI and update the perspective using the new spec.\n\n\n## Caveats\nThe goal is for this tool to be somewhat generic, but it has really only been tested for certain use cases specific to deal with AWS resources.", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/bluechiptek/cloudhealth-tools", "keywords": "", "license": "GPLv3", "maintainer": "", "maintainer_email": "", "name": "chtools", "package_url": "https://pypi.org/project/chtools/", "platform": "", "project_url": "https://pypi.org/project/chtools/", "project_urls": {"Homepage": "https://github.com/bluechiptek/cloudhealth-tools"}, "release_url": "https://pypi.org/project/chtools/2.3.1/", "requires_dist": null, "requires_python": ">=3", "summary": "Automation Tools for CloudHealth", "version": "2.3.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>CLOUDHEALTH TOOLS</h1>\n<p>Python3 library and CLI tool to manage CloudHealth.</p>\n<h2>INSTALLATION</h2>\n<p>Installation for normal everyday usage is done via <code>pip</code>.</p>\n<pre><code>pip3 install chtools\n</code></pre>\n<p>For development and testing a <code>requirements-dev.txt</code> file has been provided for installation of necessary Python packages.</p>\n<h2>CONFIGURATION</h2>\n<p>You will need a CloudHealth API Key to use any of these utilities. You can get your CloudHealth API key by the steps outlined here - <a href=\"https://github.com/CloudHealth/cht_api_guide#getting-an-api-key\" rel=\"nofollow\">https://github.com/CloudHealth/cht_api_guide#getting-an-api-key</a>.</p>\n<p>You can set the API Key either via a <code>CH_API_KEY</code> environment variable or via a <code>--api-key</code> argument.</p>\n<p>As a provider you can specify a <code>--client-api-id</code> argument to perform actions against a tenant.</p>\n<h2>CLI TOOL USAGE</h2>\n<p>A <code>chtools</code> CLI utility is the main way the CloudHealth tools are intended to be used. The <code>chtools</code> has several \"subcommands\" to indicated what feature of CloudHealth you would like to interact with. Each feature has several \"subcommands\" to indication what action you wish to take. In general it's:</p>\n<pre><code>$ chtools featrue command --arg-name arg-value\n</code></pre>\n<p>Specific examples looks like this</p>\n<pre><code>$ chtools aws-account create --name new-account --assume-role-arn arn:aws:iam::123456789012:role/CloudHealth\n$ chtools perspective get-schema --name my-perspective\n</code></pre>\n<p>You can specify <code>help</code> for the feature or command to get context specific help.</p>\n<h3>GLOBAL ARGS</h3>\n<p>Info on args that apply to all features and commands can be viewed via help. Refer to the actual output of help to ensure latest info.</p>\n<pre><code>usage: chtools [--api-key API_KEY] [--client-api-id CLIENT_API_ID]\n               [--log-level LOG_LEVEL]\n               {aws-account,perspective,help}\n\nCLI to interact with CloudHealth.\n\npositional arguments:\n  {aws-account,perspective,help}\n                        CloudHealth feature that you wish to interact with.\n\noptional arguments:\n  --api-key API_KEY     CloudHealth API Key. May also be set via the\n                        CH_API_KEY environmental variable.\n  --client-api-id CLIENT_API_ID\n                        CloudHealth client API ID.\n  --log-level LOG_LEVEL\n                        Log level sent to the console.\n</code></pre>\n<h3>aws-account</h3>\n<p>The <code>aws-account</code> feature is used to create and manage AWS accounts. Info on the args that can be used when using the <code>aws-account</code> feature can be viewed via help. Refer to the actual output of help to ensure latest info.</p>\n<pre><code>usage: chtools aws-account [--account-id ACCOUNT_ID]\n                           [--assume-role-arn ASSUME_ROLE_ARN]\n                           [--dbr-bucket DBR_BUCKET] [--name NAME]\n                           [--owner-id OWNER_ID] [--spec-file SPEC_FILE]\n                           [--schema-file SCHEMA_FILE]\n                           {create,delete,get-schema,get-spec,help,list,update}\n\nCreate and manage AWS Accounts\n\npositional arguments:\n  {create,delete,get-schema,get-spec,help,list,update}\n                        Account action to take.\n\noptional arguments:\n  --account-id ACCOUNT_ID\n                        CloudHealth Account Id for the AWS Account to interact\n                        with. Can not specify with --name or --owner-id.\n  --assume-role-arn ASSUME_ROLE_ARN\n                        The ARN of the role that account should use to connect\n                        to the AWS Account\n  --dbr-bucket DBR_BUCKET\n                        The name of the bucket used to store the DBR reports.\n  --name NAME           Name of the AWS Account to interact with. Can not\n                        specify with --account-id or --owner-id when getting\n                        schema or spec. Specifying name with create or update\n                        with change the accounts name.\n  --owner-id OWNER_ID   AWS Account Id for the AWS Account to interact with.\n                        Can not specify with --name or --account-id.\n  --spec-file SPEC_FILE\n                        Path to the YAML spec file to create or update an AWS\n                        Account.\n  --schema-file SCHEMA_FILE\n                        Path to the JSON spec file to create or update an AWS\n                        Account.\n</code></pre>\n<p>Creating or deleting account is only in the context of CloudHealth's connection to the AWS account. CLI Args can be use to supply most common config options needed to connect to an account.</p>\n<pre><code>$ chtools aws-account create --name my-account --assume-role-arn arn:aws:iam::123456789012:role/CloudHealth --dbr-bucket org-ch-dbr-bucket\n</code></pre>\n<p>If you wish to supply more config options, say for example configure CloudTrail bucket, then you will need to use a JSON schema or YAML spec file (spec file is just the JSON Schema in YAML format). You can specify the schema or spec file as the input to the command. See the CloudHealth API docs and contents of <code>tests/account_data</code> for more details on the AWS Account schema.</p>\n<p>A few notes:</p>\n<ul>\n<li>Currently the CUR bucket can not be set via API :-(</li>\n<li><code>account-id</code> refers the id number of the AWS Account in CloudHealth. This is different than the AWS Account id for the account, which is refereed to as <code>owner-id</code>.</li>\n</ul>\n<h3>perspective</h3>\n<p>The <code>perspective</code> feature is used to create and manage CloudHealth perspectives. Interaction with perspectives is done either via <a href=\"http://apidocs.cloudhealthtech.com/#perspectives_introduction-to-perspectives-api\" rel=\"nofollow\">raw JSON schemas as described in the CloudHealth API Guide</a> or via YAML based spec files.</p>\n<p>The YAML based spec files are based on the JSON schema, but some \"syntactical sugar\" has been implemented to make them a bit more human friendly. YAML spec files support the following features:</p>\n<ul>\n<li>In the schema a rule can either ba a <code>filter</code> rule or a <code>categorize</code> rule. In the Web UI the <code>filter</code> rules are refereed to as <code>search</code> rules. Spec files allow you to use <code>filter</code> and <code>search</code> interchangeably.</li>\n<li>You don't need to worry about ref_ids or constructing Dynamic Groupings. You can reference the name of a perspective group you'd like the rule to use instead of needing the ref_id. <code>chtools perspective</code> will retrieve the correct ref_id based on the name or generate a new one if it's a new perspective group. This means new perspective groups are created just by referring to them.</li>\n<li>In the schema, <code>filter</code> rules use the <code>to</code> key to determine the perspective group it references, while <code>categorize</code> uses <code>ref_id</code>. Spec files allow you to use <code>to</code> for <code>categorize</code> as well, this makes things a bit more consistent between the two rule types. <em>Note: <code>categorize</code> rules currently have both a <code>to</code> and <code>name</code> keys, but spec will may drop the need to specify the <code>name</code> key in the future.</em></li>\n<li>The schema has many keys that require only a single item list as a value. Spec files support these as just string values.</li>\n<li>Spec files support lists of asset types for <code>filter</code> rules. A rule in the schema can only apply to a single asset type. This can lead to many rules that do almost the exact same thing. For example to get all taggable financial assets into a perspective group you need to includes rules for the assets: <code>AwsAsset</code>, <code>AwsTaggableAsset</code> &amp; <code>AwsEmrCluster</code> <em>(it's possible the last one <code>AwsEmrCluster</code> is no longer needed)</em>. If you had three tags you wanted use to put into a single perspective group, then you would need 9 rules, 1 per tag per asset type. This features does need to be used with caution as some asset types don't really make sense with certain condition clauses. Recommended to just stick to combining asset types that utilize <code>tag_field</code>. Asset types included in a list like this should be considered logical ORs.</li>\n</ul>\n<p>Info on the args that can be used when using the <code>perspective</code> feature can be viewed via help. Refer to the actual output of help to ensure latest info.</p>\n<pre><code>usage: chtools perspective [--name NAME] [--spec-file SPEC_FILE]\n                           [--schema-file SCHEMA_FILE]\n                           {create,delete,empty-archive,get-schema,get-spec,help,list,update}\n\nCreate and manage perspectives\n\npositional arguments:\n  {create,delete,empty-archive,get-schema,get-spec,help,list,update}\n                        Perspective action to take.\n\noptional arguments:\n  --name NAME           Name of the perspective to get or delete. Name for\n                        create or update will come from the spec or schema\n                        file.\n  --spec-file SPEC_FILE\n                        Path to the file containing YAML spec used to create\n                        or update the perspective.\n  --schema-file SCHEMA_FILE\n                        Path to the file containing JSON schema used to create\n                        or update the perspective.\n</code></pre>\n<p><em>Note</em>: Initally <code>chtools perspective</code> was released as a stand alone CLI utility called <code>perspective-tool</code>. <code>chtools perspective</code> is functionally equivalent to <code>perspective-tool</code> (same code, just different CLI wrapper). <code>perspective-tool</code> is still available, but should be considered depreciated.</p>\n<h4>SPEC FILES</h4>\n<p>Being familiar with <a href=\"http://apidocs.cloudhealthtech.com/#perspectives_introduction-to-perspectives-api\" rel=\"nofollow\">CloudHealth Perspective Schemas</a> will help when dealing with spec files.</p>\n<p>Examples of spec files can be found in <code>tests/perspective_data/specs</code>.</p>\n<p>It's also a good idea to create a rule in the Web GUI and then use the <code>chtools perspective get-spec --name perspective-name</code> to look at the YAML spec for that perspective.</p>\n<p>Spec files used by <code>chtools perspective</code> are in YAML and support the following top-level keys, which all are required. Note all keys are lower case.</p>\n<ul>\n<li>name: Name of the perspective.</li>\n<li>include_in_reports: string 'true' or 'false'.</li>\n<li>match_lowercase_tag_field: boolean. If true, then filter rules will always match the lowercase value of the tag_field in the filter rule clauses. For example if the rule matches the tag name of \"Test\" then a clause will be added to match the tag name of \"test\" as well.</li>\n<li>match_lowercase_tag_val: boolean. Same as match_lowercase_tag_field but for the values of the tag instead of the tag name.</li>\n<li>rules: A list of rule mappings.</li>\n<li>merges: If a perspective contains a <code>categorize</code> rule then a list of merge mappings can be provided to merge Dynamic Groups.</li>\n</ul>\n<p>Each rule is a YAML mapping, with two types of rules <code>filter</code> and <code>categorize</code>.</p>\n<p><code>filter</code> rules have the following keys:</p>\n<ul>\n<li>type: either <code>filter</code> or <code>search</code></li>\n<li>asset: either a string of a valid asset type or a list of valid asset types. Some asset types may not make sense together in the same rule.</li>\n<li>to: The name of the perspective group that resources matching this rule should be assigned to. New groups will be created as needed.</li>\n<li>condition: A YAML mapping with the following keys:\n<ul>\n<li>clauses: a list of clauses. It's really best to just go look at examples in <code>tests/perspective_data/specs</code> for what clauses look like. There can be nuances from one clause type to another, so it's best to create the rule in web GUI and then export the spec and see how it has been generated.</li>\n<li>combine_with: required and only allowed if the list of clauses include more than one item. Set to either OR or AND (uppercase) based on how you want the clauses evaluated.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Warning:</strong> CloudHealth Perspectives API does not support deleting perspective groups via the API. Groups that should be deleted via the API will have their associated rules deleted, this will cause them to appear aqua green the Web UI making it easy to identify what should be removed manually.</p>\n<p><code>categorize</code> rules have the following keys for categorizing by tag. If you want to categorize by something else, then create the rule in web GUI and then export the spec and see how it's been generated.</p>\n<ul>\n<li>type: <code>categorize</code></li>\n<li>asset: a string of a valid asset type (list not supported here for now, not sure API will support).</li>\n<li>to: The name of the perspective group resources matching this rule should be assigned to. New groups will be created as needed. Should be set to be the same as <code>name</code>.</li>\n<li>name: This is the name that will of the perspective group that will be  displayed. Should be the set to be the same as <code>to</code>.</li>\n<li>tag_field: The name of the tag to categorize by.</li>\n</ul>\n<p>If a perspective has a one or more <code>categorize</code> rules then you may specify mappings defining Dynamic Group merges. Each mapping is to have the following keys.</p>\n<ul>\n<li>name: The name of the categorize rule that this merge applies to.</li>\n<li>type: Must be <code>Group</code>.</li>\n<li>to: The name of the Dynamic Group in which the other groups will be merged. This group must exist (i.e. If the Dynamic Groups are based off of tags then CloudHealth must have discovered an asset with that tag and created a Dynamic Group for that tag value).</li>\n<li>from: A list of Dynamic Groups that will be merged into the Dynamic Group specified by the <code>to</code> key. Like the <code>to</code> key, the values provide here must match the name of Dynamic Groups that already exist. Either <code>from</code> or <code>from_regex</code> must be specified (i.e. only one can be specified).</li>\n<li>from_regex: A list of regexs that will be used to determine what Dynamic Groups should be merged. Any group matching on the regexs will be merged with the group specified by the <code>to</code> key. A spec where a group is merged with two different groups will fail to apply. Merges are only evaluated at the time the spec is applied (i.e. either when the perspective is created or updated). The regexs do not necessarily have to match an existing group. Because each Dynamic Group is evaluated at the time the spec is applied you could specify group regexs to match existing and future group. You would then apply the spec on a schedule, such as daily, to merge any newly created groups. Either <code>from</code> or <code>from_regex</code> must be specified (i.e. only one can be specified).</li>\n</ul>\n<p><strong>Warning:</strong> CloudHealth Perspectives API does not support unmerging groups or changing the group in which a group has already been merged. If you need to unmerge or change the merge configuration (other than merging new groups), then it's recommended to use the <code>Delete All</code> button in the CloudHealth web GUI and update the perspective using the new spec.</p>\n<h2>Caveats</h2>\n<p>The goal is for this tool to be somewhat generic, but it has really only been tested for certain use cases specific to deal with AWS resources.</p>\n\n          </div>"}, "last_serial": 4951447, "releases": {"1.0.6": [{"comment_text": "", "digests": {"md5": "7a9f3c801419b7bafe7b400169caf846", "sha256": "4b18777d22b56e3de89081df7339b8739e2a3f0d4063b710be58c6404543311e"}, "downloads": -1, "filename": "chtools-1.0.6.tar.gz", "has_sig": false, "md5_digest": "7a9f3c801419b7bafe7b400169caf846", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 10362, "upload_time": "2018-07-23T23:32:15", "upload_time_iso_8601": "2018-07-23T23:32:15.216901Z", "url": "https://files.pythonhosted.org/packages/cc/80/2d0df27a4cce9c6b7904bb8ee85d762ef72d6236bd956eb1d4ec07660325/chtools-1.0.6.tar.gz", "yanked": false}], "2.0.0": [{"comment_text": "", "digests": {"md5": "6d7352d02ac8bf9699fcb47c55d00333", "sha256": "350584afa3da02661fe6c3ebedb398ba445620ead1f63c982f3d096ffb1f514f"}, "downloads": -1, "filename": "chtools-2.0.0.tar.gz", "has_sig": false, "md5_digest": "6d7352d02ac8bf9699fcb47c55d00333", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 12530, "upload_time": "2018-10-11T01:18:20", "upload_time_iso_8601": "2018-10-11T01:18:20.382900Z", "url": "https://files.pythonhosted.org/packages/60/df/c3d909b99bdb1bd108ff8928fd7d40e9d24894b865e86d59f090935018d6/chtools-2.0.0.tar.gz", "yanked": false}], "2.0.1": [{"comment_text": "", "digests": {"md5": "a86407746452a123d5d3267f8fecf00f", "sha256": "e99301a0e850a7c8c7dd073be675afd381072048d8f51e8d57c22a9507200793"}, "downloads": -1, "filename": "chtools-2.0.1.tar.gz", "has_sig": false, "md5_digest": "a86407746452a123d5d3267f8fecf00f", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 12551, "upload_time": "2018-10-11T01:25:26", "upload_time_iso_8601": "2018-10-11T01:25:26.655730Z", "url": "https://files.pythonhosted.org/packages/18/91/d46f63c027fea5b5a1cfc372952335beaad7501d758786766228f7d50b34/chtools-2.0.1.tar.gz", "yanked": false}], "2.1.0": [{"comment_text": "", "digests": {"md5": "e240f2eec66cee4445e474bb4a827d25", "sha256": "773dbefa462736786346688b4446fdec71a5d68f0f346d4af00d2ca411e0ac94"}, "downloads": -1, "filename": "chtools-2.1.0.tar.gz", "has_sig": false, "md5_digest": "e240f2eec66cee4445e474bb4a827d25", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 13477, "upload_time": "2019-01-10T01:56:48", "upload_time_iso_8601": "2019-01-10T01:56:48.336811Z", "url": "https://files.pythonhosted.org/packages/68/66/198a674d0ab5bf3fe290ffcb1b55627aaa31defab52e4e4da9124c8f27fb/chtools-2.1.0.tar.gz", "yanked": false}], "2.1.1": [{"comment_text": "", "digests": {"md5": "1ae1d59a37e809b5baf5af5bac07f2f5", "sha256": "d45da1a929b8ffea0002aa78743d1363d27b8e70476f93ee7ce9571bbf815022"}, "downloads": -1, "filename": "chtools-2.1.1.tar.gz", "has_sig": false, "md5_digest": "1ae1d59a37e809b5baf5af5bac07f2f5", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 13529, "upload_time": "2019-01-10T23:14:51", "upload_time_iso_8601": "2019-01-10T23:14:51.834968Z", "url": "https://files.pythonhosted.org/packages/22/60/7bb0d4efae73228a61c2963ea0536aabf13229dd4f832e45e0b6d42c88aa/chtools-2.1.1.tar.gz", "yanked": false}], "2.2.0": [{"comment_text": "", "digests": {"md5": "f25b0e2c3aa8f49163615662aa5b6a83", "sha256": "b6e367912915dd2f3ed5c8f07bd12257418158508744c34dc762c5c2c3b36943"}, "downloads": -1, "filename": "chtools-2.2.0.tar.gz", "has_sig": false, "md5_digest": "f25b0e2c3aa8f49163615662aa5b6a83", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 22171, "upload_time": "2019-01-26T19:30:13", "upload_time_iso_8601": "2019-01-26T19:30:13.514911Z", "url": "https://files.pythonhosted.org/packages/26/a4/4ecbc75c73872807093a76166478f33e45fb67dd596b80dd0278faf2a1ef/chtools-2.2.0.tar.gz", "yanked": false}], "2.3.0": [{"comment_text": "", "digests": {"md5": "336cffeca9a8ce90e21b3717db04a962", "sha256": "5efcebd97c2c216e82e1917196801396486faae4f2cbc4752f3f84126b70f916"}, "downloads": -1, "filename": "chtools-2.3.0.tar.gz", "has_sig": false, "md5_digest": "336cffeca9a8ce90e21b3717db04a962", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 26287, "upload_time": "2019-03-04T20:14:38", "upload_time_iso_8601": "2019-03-04T20:14:38.826787Z", "url": "https://files.pythonhosted.org/packages/47/56/791cf6147d3113516eecee2fb249a09c13e7d689edcf5537329e44907a13/chtools-2.3.0.tar.gz", "yanked": false}], "2.3.1": [{"comment_text": "", "digests": {"md5": "31f7754d70846341072f3d93808fbfff", "sha256": "eebb29aae5b26ece571bd29b9cb9b33c9900baf1add176bf94b670f17a52b78d"}, "downloads": -1, "filename": "chtools-2.3.1.tar.gz", "has_sig": false, "md5_digest": "31f7754d70846341072f3d93808fbfff", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 27185, "upload_time": "2019-03-17T21:12:33", "upload_time_iso_8601": "2019-03-17T21:12:33.495891Z", "url": "https://files.pythonhosted.org/packages/ea/5b/58565902616bc504f1b3ae7ce0defdbf714d5a9ee1258fe07527a90c055c/chtools-2.3.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "31f7754d70846341072f3d93808fbfff", "sha256": "eebb29aae5b26ece571bd29b9cb9b33c9900baf1add176bf94b670f17a52b78d"}, "downloads": -1, "filename": "chtools-2.3.1.tar.gz", "has_sig": false, "md5_digest": "31f7754d70846341072f3d93808fbfff", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 27185, "upload_time": "2019-03-17T21:12:33", "upload_time_iso_8601": "2019-03-17T21:12:33.495891Z", "url": "https://files.pythonhosted.org/packages/ea/5b/58565902616bc504f1b3ae7ce0defdbf714d5a9ee1258fe07527a90c055c/chtools-2.3.1.tar.gz", "yanked": false}], "timestamp": "Thu May  7 22:19:27 2020"}