{"info": {"author": "Maxim Biro", "author_email": "nurupo.contributions@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Environment :: Console", "Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Natural Language :: English", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: Implementation :: CPython", "Topic :: Software Development"], "description": "# CI Release Publisher\n\nA script for publishing Travis-CI build artifacts on GitHub Releases.\n\nMainly geared towards publishing nightly/continuous builds, which Travis-CI has no native support of, but can also be used to publish release builds.\n\n## Table of contents\n\n- [Features](#features)\n- [Terminology](#terminology)\n- [CI Release Publisher vs. Travis-CI's GitHub Releases deployment](#ci-release-publisher-vs-travis-cis-github-releases-deployment)\n  - [Short comparison](#short-comparison)\n  - [Detailed comparison](#detailed-comparison)\n- [Handling race conditions](#handling-race-conditions)\n- [Installation](#Installation)\n  - [Signatures](#signatures)\n- [Usage](#usage)\n  - [Security consideration](#security-consideration)\n  - [Publishing to the same repository](#publishing-to-the-same-repository)\n  - [Publishing to a different repository](#publishing-to-a-different-repository)\n  - [Doing everything in a different repository](#doing-everything-in-a-different-repository)\n- [Options](#options)\n- [Troubleshooting](#troubleshooting)\n- [Projects using CI Release Publisher](#projects-using-ci-release-publisher)\n- [License](#license)\n\n## Features\n\n- Two flavors of a nightly/continuous release:\n  - **Latest Release**: a `ci-<branch>-latest` tagged release that will be kept updated to contain build artifacts of the latest Travis-CI build for the branch\n  - **Numbered Release**: a `ci-<branch>-<build-number>` tagged release that will contain build artifacts of `<build-number>` Travis-CI build for the branch\n    - Retention policies for Numbered Releases:\n        - Keep only the last N numbered releases for the branch, extra numbered releases will be deleted starting with the lowest `<build-number>` first (i.e. oldest release first)\n        - Keep only numbered releases that were published within the last N seconds (i.e. delete all numbered releases older than N seconds)\n- **Tag Release**: a regular release that is made only on a tag push\n- Customize release information of each of the three release types independently:\n  - Release name\n  - Release body (e.g. set it to a list of hashes of all build artifacts)\n  - Draft flag (e.g. if you want the releases to be private)\n  - Pre-release flag (e.g. when every nightly is a production release!)\n  - Target commit\n- Race condition proof - no matter how many builds or jobs per build you have running in parallel, no release will get corrupted due to a race condition\n- Allows publishing to a different GitHub repository's Releases page\n- Supports public GitHub repos (tested), but should also work with private GitHub repos and self-hosted GitHub instances (both are not tested)\n\n## Terminology\n\nLet's define some terms we will use throughout this file, things might get confusing if you don't know them.\n\n### CI Release Publisher terms\n\nSee **Latest Release**, **Numbered Release** and **Tag Release** in [Features](#features).\n\n### Travis-CI terms\n\n**Job** - A single process consisting of git cloning your repository and then running arbitrary commands on the machine, usually to build and/or test the software that is in the repository.\n\n**Stage** - A set of jobs. Stages allow to enforce job execution order. All jobs within a stage run in parallel, however each stage runs sequentially, e.g. jobs in stage2 won't start running until all of the jobs in stage1 complete. This feature also sometimes called Pipeline, for example in GitLab CI.\n\n**Build** - A set of stages. If at least one job in a builds fails - the build gets marked as failed. Builds are created whenever you push to a GitHub repository that has Travis-CI configured for it. In a very minimal case a build has just one stage with one job in it.\n\nHere is an example of a build having 5 stages and 15 jobs: [url](https://travis-ci.org/qTox/qTox/builds/406143072), [screenshot](https://i.imgur.com/K1hAR9R.png).\n\n### GitHub terms\n\n**Release** - A feature allowing to associate downloadable files with an existing git tag. Mainly used for distributing the software and software-related files. All releases can be viewed on a dedicated Releases page of a GitHub repository, on which releases are ordered by their creation time.\n\n**Draft Release** - A release that is \"private\", i.e. visible only to people who have priviliged access to the repository (Write or Admin repository permissions). A draft release can be changed to a non-draft release, making it public and creating a git tag for it if it didn't exist before.\n\n**Pre-release Release** - A release that is visibly marked as not production-ready. Ideal for nightly/continuous releases.\n\n## CI Release Publisher vs. Travis-CI's GitHub Releases deployment\n\nTravis-CI provides [GitHub Releases deployment option](https://docs.travis-ci.com/user/deployment/releases/) that many are familiar with, so let's make a quick comparison of how CI Release Publisher differs from Travis-CI's deployment option.\n\n### Short comparison\n\nHere is a table summarizing the comparison if you don't want to read through it.\n\n| Features                         | CI Release Publisher  | Travis-CI             |\n|----------------------------------|-----------------------|-----------------------|\n| Tag Release                      | yes                   | yes                   |\n| Latest Release                   | yes                   | no*                   |\n| Numbered Releases                | yes                   | no                    |\n| Customizable release information | yes                   | yes**                 |\n| Race condition proof             | yes                   | no                    |\n| Proper draft releases            | yes                   | no                    |\n\n`*` -- can be done [with some extra bash commands](https://github.com/travis-ci/travis-ci/issues/8622#issuecomment-354912673), but is not part of Travis-CI's GitHub Releases deployment feature set and also won't be race condition proof.\n\n`**` -- Travis-CI's release body [can't contain new lines](https://github.com/travis-ci/dpl/issues/155), so you can't include multiline changelog in it, which means that you wouldn't be able to list hashes of artifacts, for example.\n\n### Detailed comparison\n\nTravis-CI's GitHub Releases deployment option works great for non-draft Tag Releases. In fact, if that's all you need, then you should strongly consider using Travis-CI's GitHub Releases deployment option over CI Release Publisher, as Travis-CI provides about the same amount of release customization as CI Release Publisher (sans the support of new lines in the release body).\n\nHowever, on this the usefulness of Travis-CI's GitHub Releases deployment ends. Travis-CI falls short if you want to set a release body containing new lines, create a race condition proof Tag Release, create any kind of draft release, create a Latest Release, or create a Numbered Release.\n\n#### New lines in release body\n\nTravis-CI doesn't support new lines when specifying release's body [due to Travis-CI's component handling deployment having problems with new lines](https://github.com/travis-ci/dpl/issues/155). CI Release Publisher doesn't have this limitation.\n\n#### Tag Release\n\nTravis-CI's Tag Releases are not race condition proof. You can push a tag to GitHub, which will create a Travis-CI build, then delete the tag and push it again, supposedly pointing to some new fixup commit this time around, which will create another Travis-CI build. You will now have two Travis-CI builds running in parallel and uploading artifacts to the same tag release, which is a race condition. You might end up with a release some artifacts of which come from the first build and some from the second build which has the fix you pushed. CI Release Publisher doesn't have this issue, it makes sure that a Tag Release will contain artifacts only from the latest build for that tag.\n\n#### Draft release\n\nThe issue with Travis-CI's draft releases is that while for non-draft releases Travis-CI creates just a single release for the whole build containing artifacts of all jobs, which is what you want, for draft releases Travis-CI instead creates numerous draft releases, one for every single job in the build, which is not you want. For example, if you have 10 jobs then you will get 10 draft releases, each containing artifacts of only that one particular job, when you actually expected to get just one draft release containing artifacts of all the 10 jobs. Just changing `draft: false` to `draft: true` in Travis-CI changes the behaviour so drastically. CI Release Publisher has no such issue, it creates just one final release containing artifacts of all jobs, both when creating draft and non-draft releases.\n\n#### Latest Release\n\nAs far as the issue with Latest Release goes, Travis-CI's GitHub Releases deployment simply doesn't support creating such releases. There is no option for it. There is, however, [a workaround](https://github.com/travis-ci/travis-ci/issues/8622#issuecomment-354912673) that allows to achieve creating Latest Release on Travis-CI, but it requires running some additional bash/git commands and has a race condition that might result in a release being corrupted, i.e. it allows several builds editing the same release at the same time. CI Release Publisher supports creating Latest Release and it does so without race conditions.\n\n#### Numbered Release\n\nTravis-CI doesn't support creating Numbered Releases either. Although you could create them with the same workaround that you can use to create Latest Release, there is no easy way to delete previous Numbered Releases without using GitHub API. If you think you could avoid using GitHub API by expanding the workaround to use `git` command line program to delete git tags in order to delete releases -- that wouldn't work, if a git tag of a GitHub release is deleted the release doesn't get deleted, it remains but changes to a draft. There would also be a race condition with deleting previous Numbered Releases this way as they might still be in the process of being created by another builds as you delete them, which might result in those builds creating incomplete releases. To do it properly you'd need to essentially re-invent CI Release Publisher.\n\n## Handling race conditions\n\nSpecial care was taken to make sure that CI Release Publisher avoids race conditions, especially the ones that can corrupt a release -- result in a release that doesn't contain all of the artifacts, or a release in which some artifacts come from one build, and thus one commit, but other from another. This section will talk about CI Release Publisher features, about how, if implemented naively, they would have race conditions, and how does CI Release Publisher avoid those race conditions. This is not a complete list of the race conditions CI Release Publisher has to deal with, but it gives a good idea about how CI Release Publisher works.\n\nThere are two primary points at which race conditions can occur: when jobs run in parallel and when builds run in parallel. We consider only the builds within the same branch/tag as in CI Release Publisher builds from different branches/tags can't affect each other.\n\n### Jobs running in parallel\n\nThe goal of CI Release Publisher is to create a release containing artifacts of a all artifact-producing jobs for a build. A naive way to do so would be to make jobs create a GitHub release, let them upload their artifacts into it and that's it, done -- we would have a single release with all jobs' artifacts.\n\nWhile this naive implementation would work if jobs execute sequentially, it has a race condition when two or more jobs run in parallel and they try to create a GitHub release. The jobs would check GitHub API to see if some other job from this build has already created a release which should be used instead of creating a new one, but because they can check it all at the same time, multiple jobs can end up seeing that no other job has created a release yet and decide to create one, which will result in multiple releases being created for this build, with build artifacts divided among them. Multiple releases being created for a single build is definitely not what we want, and there is no easy way to prevent it. GitHub API happily creates as many instances of identical draft releases as you ask it to, without raising any errors, so we can't use GitHub API as a race gate keeper that will pass only the the first job trying to create a release and reject all other.\n\nCI Release Publisher solves this issue by serializing the creation of the release for the build, it makes it so that only one job is responsible for creating the release, but this comes at the cost of having a separate Stage in the build. CI Release Publisher makes each artifact-producing job create a unique temporary store release containing build artifacts of just that job, and then, in the following Stage, it collects all of those artifacts from the temporary store releases, deletes those releases, and creates a proper release containing all of those artifacts. That way there is only one job that creates the (final) release and thus no race condition can occur as it's not racing with anyone.\n\nWhile this successfully solves the race issue, it has a slight disadvantage. If the build fails before it reaches the publishing stage, all those temporary store releases won't be deleted and would litter the Releases page, though only repo admins can see draft releases listed on it. This is mostly solved by making jobs before the publishing stage check if the build is failing and deleting those releases, that way we don't have to rely solely on the publishing stage to remove them.\n\n### Builds running in parallel\n\nThe main issue with builds running in parallel is that it's possible for several builds to modify the same release at the same time.\n\n#### Latest Release\n\nA Latest Release is a release containing the artifacts of the latest build for a branch. A Latest Release always has the same `ci-<branch>-latest` tag name, so you can easily link to it in README or on website, since the URL won't change. There is always no more than one Latest Release per branch. A naive implementation of the Latest Release feature would be to make each build delete the existing Latest Release, if any, and create a new one with current build's artifacts.\n\nThis naive implementation would work if builds are executed sequentially, but it has a race condition when two or more builds run in parallel and they try to delete and create the Latest Release. There are several thing that can go wrong. Firstly, we can have one build deleting a release that another build might be in the process of uploading artifacts to, which will make the uploading build throw an exception and fail -- and rightfully so, as we consider a release that has artifacts missing a failure. Secondly, we can have a situation when the newer build finishes earlier than the older one due to code changes or removal of some build steps, which will result in the older build being the last one to delete and then re-create Latest Release, meaning that the Latest Release will contain artifacts of the older build instead of the newer one.\n\nCI Release Publisher solves this issue by updating (deleting and then re-creating) the Latest Release only if the current build is the latest build for the branch. It checks Travis-CI API to get the build number of the latest build for the branch, and if it's not the build number of the current build, it skips updating the Latest Release, leaving it to a newer build instead. This way only one build modifies the Latest Release -- the modification is serialized. This solves both the first and the second of the mentioned issues. It additionally protects Latest Release against being downgraded to contain artifacts of an older build when someone restarts an old Travis-CI build.\n\nThe downside of this solution is, paradoxically, that only the latest build can update the Latest Release. In a situation when you have multiple builds running in parallel, with all but the latest succeeding, all those succeeded builds will pass on updating the Latest Release, leaving it up to the latest build, but because that build has failed, it won't reach the publishing Stage and won't update any releases, so you will end up with the Latest Release not being updated at all. There is no workaround for this, so just try to make sure that your builds don't fail and follow up a failed build with a fixed one.\n\nBy the way, you might notice that this solution still leaves out a race condition, specifically the case of when a new build gets created right after the older build checks Travis-CI API to make sure that it's the latest build for the branch -- this could lead to both builds updating the Latest Release as both will think that they are the latest builds. However, such race condition is ruled out as impossible, as it takes just a couple of GitHub API calls, literally less than a second, for the older build to update the Latest Release after checking with Travis-CI API. All it has to do is 1) call GitHub API to delete the previous latest release and 2) call the GitHub API again to change the tag name of an already created release with all artifacts already uploaded to the proper Latest Release tag name. The newly created build likely hasn't even started yet, more so got to the release publishing Stage, to the point where it updates Latest Release, in such short time. So there should be no chance of the both builds updating the release at the same time.\n\n#### Tag Release\n\nTag Release is implemented very similarly to Latest Release and doesn't deal with any new race condition issues, so there is nothing really to say about it.\n\n#### Numbered Release\n\nA Numbered Release is a release containing the artifacts of a specific build. Numbered Releases use `ci-<branch>-<build-number>` tag name, so unlike Latest Release, the release URL is always different. Numbered Releases have a retention policy options that dictate when existing Numbered Releases should be deleted. A naive implementation for the Numbered Release feature would be to make each build create a new Numbered Release for this build and delete existing Numbered Releases that are subject to deletion by the retention policy.\n\nThis naive implementation would work if builds are executed sequentially, but it has a race condition when two or more builds run in parallel, as an old build might be still in the process of uploading artifacts to its Numbered Release when a new build deletes that release, causing the older build to error due to it unable to upload the rest of the artifacts to a no longer existing release, which will cause the old build to fail.\n\nCI Release Publisher solves this issue by executing the retention policy only on finished releases. It can do so because it can distinguish between in-progress and finished releases. When a release is just created, it has a special tag name indicating that it's in progress, and once all work on it is done, it gets renamed to a proper tag name. CI Release Publisher ignores all in-progress releases as not to fail the builds still working on them, considering only finished releases. This is no just a Numbered Release thing, CI Release Publisher does it for all of the release types, but it's especially important in Numbered Releases case. It also allows the repository owners to see which automated releases were completed and which are still in progress or failed without ever completing.\n\nThere are several downsides to this solution. Firstly, if the publishing job fails or gets canceled in the middle of running it's possible for it to leave an in-progress draft release, littering the Releases page. This issue is solved by adding additional cleanup code that removes existing in-progress releases if the corresponding builds are no longer running, according to Travis-CI API. Secondly, due to the retention policy considering only finished releases, the in-progress releases will slip past the retention policy. For example, if there are N builds running in parallel, all having in-progress releases, and the retention policy is set to keep at most M latest Numbered Releases, those N in-progress releases will slip past the retention policy, resulting in N+M Numbered Releases being kept. There is no solution for this issue. In practice this is not a big issue, as the N in practice tends to be rather small, often even zero, and the next build is going to execute the retention policy and delete any extra Numbered Releases, keeping only M in place.\n\n## Installation\n\nMake sure you use Python 3.5 or higher.\n\nFrom source:\n\n```bash\npython setup.py install\n```\n\nFrom PyPi:\n\n```bash\npip install ci_release_publisher\n```\n\n### Signatures\n\nPyPi packages are PGP signed with a subkey of the following primary key:\n\n```\nKey fingerprint = 1D4E 9375 AD9B D50F 80FF  55AC 6F55 0977 4B1E F0C2\n```\n\nThe signatures are uploaded to PyPi. Note that `pip` doesn't verify signatures, you have to do so manually. Also, PyPi website [hides the signature files from the download list on purpose](https://github.com/pypa/warehouse/issues/3356), so to get the signature files you have to append `.asc` at the end of download URLs.\n\nYou can download the package, verify its signature and install with something like the following:\n\n```bash\nwget \"$(pip download ci_release_publisher | grep 'http.*ci_release_publisher-' | awk '{print $NF}').asc\"\ngpg --no-default-keyring --keyring \"$PWD/tmp_keyring.gpg\" --recv-key '1D4E 9375 AD9B D50F 80FF  55AC 6F55 0977 4B1E F0C2'\ngpg --no-default-keyring --keyring \"$PWD/tmp_keyring.gpg\" --verify ci_release_publisher-*.asc\n# Read the output of the command above, you can't rely on its exit code as it's\n# 0, i.e. success, even if the key has expired or has been revoked\nrm ci_release_publisher-*.asc\nrm tmp_keyring.gpg\npip install --no-index --find-links \"$PWD\" ci_release_publisher-*\n```\n\nOf course that won't verify any of the dependencies CI Release Publisher is using.\n\nDue to keyservers sometimes failing to reply with a key, it's suggested to verify signatures locally and rely on the hash when running on Travis-CI. This is what [`scripts/install.sh`](scripts/install.sh) is set to do (verifying the hash).\n\n## Usage\n\n### Security consideration\n\nBefore using CI Release Publisher, you must consider the security implications that come with using it.\n\nIn order to use CI Release Publisher, you must create a new GitHub user, make that user a collaborator in a repository you wish to publish releases to, giving the user Write/push access to the repository which is required to create releases, generate an access token for that user and store it in an environment variable on Travis-CI. All of this is needed so that the CI Release Publisher script would be able to authenticate as the user with GitHub API and create releases in the desired repository.\n\nThe issue is that if the access token gets leaked, someone could use it to push code into the repository, delete/edit issue comments, push into PR branches, replace release files with malicious binaries, etc. -- do all kinds of nasty things. GitHub doesn't provide much in terms of restricting what an access token can be used for.\n\nThere are primary three different ways to use CI Release Publisher based on the security risk you are willing to take:\n\n- Publishing to the same repository\n\n    This is the same way Travis-CI's GitHub Releases deployment works. Travis-CI stores the access token for the main repository with the full write access to it. This represents the greatest security risk, since if the token is leaked, your main repository is at risk. If you already use such access token for some other Travis-CI automation -- you are already exposed to this risk.\n\n- Publishing to a different repository\n\n    Building still happens on Travis-CI of the main repository, but the build artifacts are published to a different repository. Travis-CI stores the access token with the full write access to the other repository now. This lowers the security risk considerably, since if the access token is leaked only the other repository would be affected by it, the main repository would be safe.\n\n- Doing everything in a different repository\n\n    Building happens on Travis-CI of the repository other than the main one and the build artifacts are published into the same other repository. The whole process is separate from the main repository and can be used to setup personal builds of other projects. This lowers the risk even further than just publishing to a different repository does, since it's the other repository's Travis-CI that stores the access token now, which you should be able to restrict access to better than the main repository's Travis-CI. However, since the building happens in other repository's Travis-CI, it doesn't know when git push events happen in the main repository, so you won't be able to build on every git push to the main repository, instead you would have to use Travis-CI's Cron Jobs to run a build once a day.\n\nHere is a table summarizing the three ways to make releases:\n\n|                                              | Same repo | Different repo | Separate       |\n|----------------------------------------------|-----------|----------------|----------------|\n| Main repo access token permissions           | Write     | Read           | Read           |\n| Different repo access token permissions      | -         | Write          | Write          |\n| Access token stored in Travis-CI of          | Main repo | Main repo      | Different repo |\n| Artifact production happens on Travis-CI of  | Main repo | Main repo      | Different repo |\n| Releases can be made on every main repo push | Yes       | Yes            | No             |\n\n### Publishing to the same repository\n\n1. [Create a new GitHub user](https://github.com/join) that will be used solely for creating releases. For security reasons, we advise that you create a separate user for every repository you want to setup releases for.\n2. Under that user, [create a new Personal Access Token](https://github.com/settings/tokens/new) with `repo` access checked if you use `travis-ci.com` or with just `public_repo` access checked if you use `travis-ci.org`.\n3. On the Settings page for your repository on Travis-CI, e.g. https://travis-ci.org/nurupo/ci-release-publisher/settings, under Environment Variables, add a new environment variable with the name `GITHUB_ACCESS_TOKEN` and the access token you got off GitHub as the value. Make sure \"Display value in build log\" is unchecked when adding it. If you already use `GITHUB_ACCESS_TOKEN` for something else, you can name the variable `CIRP_GITHUB_ACCESS_TOKEN` instead.\n4. Invite the user as a collaborator to the repository such that the user has Write access to the repository, i.e. can push into it.\n5. Accept the invite as the new user.\n6. As the new user, log into Travis-CI, which would prompt you to authorize Travis-CI to access your GitHub information -- accept that.\n7. Make sure the new user can access Travis-CI page with build details for the repository.\n\n    ---\n\n    It's advised to create a new user per repository because [there were](https://blog.travis-ci.com/2016-07-07-security-advisory-encrypted-variables) multiple [security incidents](https://blog.travis-ci.com/2017-05-08-security-advisory) when GitHub access tokens stored in Travis-CI environment variables were leaked, which essentially equals to the user account the access token belongs to being compromised, as the attacker would be able to push code, publish releases, etc. into all repositories the user has access to. Creating a user per repository helps to limit the possible damage that can be done if the API key does get leaked. Note, however, that [GitHub ToS](https://help.github.com/articles/github-terms-of-service/#3-account-requirements) allows you to have only one \"machine account\", creating more accounts would technically violate ToS and should be done at your own risk. To minimize the damage even more, set your GitHub repository to disallow force pushes on all branches, require all changes to go through PRs before they get merged and require PRs to be reviewed by other contributors -- that way it's less likely someone would be able to sneak malicious code change in the repository if the access token does get compromised.\n\n    ---\n\n8. In your `.travis.yml`, identify jobs that produce artifacts.\n\n    At the end of the `script` section of all artifact producing jobs add:\n\n    ```yaml\n    - .travis/cirp/cleanup1.sh\n    - .travis/cirp/store.sh \"$TRAVIS_BUILD_DIR/artifacts\"\n    - .travis/cirp/cleanup2.sh\n    ```\n\n    where `$TRAVIS_BUILD_DIR/artifacts` is the path where the artifacts can be found. This will store the artifacts in a temporary store release. We will download them back and delete these temporary store releases in a publishing stage later in the build.\n\n    Now identify artifact producing stages. If a stage contains at least one artifact producing job, we call it an artifact producing stage. It can contain other jobs that don't produce artifacts. You can have as many artifact producing stages as you want, with as many stages that don't produce artifacts before, after and in between them as you want.\n\n    At the end of `script` section of all jobs that are in artifact producing stages but don't actually produce artifacts, add:\n\n    ```yaml\n    - .travis/cirp/cleanup1.sh\n    - .travis/cirp/cleanup2.sh\n    ```\n\n    This will remove the temporary store releases in case of a build failure so that they don't litter your Releases page.\n\n    Find the last artifact producing stage. If you have any stages after it, you can pick any of them to add the publishing job to. If you don't have any stages after it, you can create a publishing stage with the publishing job in it. You can have only one publishing job in the entire build, it must be positioned after all the artifact producing jobs, in separate stage from artifact producing jobs. You should not put the publishing job in the same stage as an artifact producing job. Your publishing job should look like this:\n\n    ```yaml\n    if: type != pull_request\n    script:\n      - export ARTIFACTS_DIR=\"$(mktemp -d)\"\n      - .travis/cirp/collect.sh \"$ARTIFACTS_DIR\"\n      - .travis/cirp/cleanup4.sh\n      - .travis/cirp/publish.sh \"$ARTIFACTS_DIR\"\n      - .travis/cirp/cleanup5.sh\n    ```\n\n    where `$ARTIFACTS_DIR` is the path where artifacts from the temporary store releases will be downloaded.\n\n    Now identify all stages that don't produce artifacts between the first artifact producing stage and the publishing stage, if there are any. Add the following at the end of `script` section of those jobs:\n\n    ```yaml\n    - .travis/cirp/cleanup3.sh\n    ```\n\n    This will remove the temporary store releases in case of a build failure so that they don't litter your Releases page.\n\n    You should add the following to your `.travis.yml` to avoid Travis-CI building the tags GitHub will be creating due to CI Release Publisher creating non-draft releases:\n\n    ```yaml\n    branches:\n      except:\n        - # Do not run Travis-CI builds on tags CI Release Publisher creates as it\n        - # will lead to endless (recursive?) tag creation and Travis-CI running\n        - /^ci-.+$/\n    ```\n\n    ---\n\n    Here is a sample `.travis.yml` before following these instructions. `...` are omitted parts and `env` is used for commenting on jobs. This is a rather extensive example, with a lot of stages and jobs, which should hopefully cover most of the cases.\n\n    ```yaml\n    ...\n\n    matrix:\n      include:\n        - stage: \"Stage 1\"\n          env: JOB=\"1\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n        - stage: \"Stage 2\"\n          env: JOB=\"2\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n        - stage: \"Stage 2\"\n          env: JOB=\"3\" DESC=\"This job produces artifacts\"\n          script:\n            - ...\n        - stage: \"Stage 3\"\n          env: JOB=\"4\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n        - stage: \"Stage 4\"\n          env: JOB=\"5\" DESC=\"This job produces artifacts\"\n          script:\n            - ...\n        - stage: \"Stage 4\"\n          env: JOB=\"6\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n        - stage: \"Stage 5\"\n          env: JOB=\"7\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n        - stage: \"Stage 6\"\n          env: JOB=\"8\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n        - stage: \"Stage 7\"\n          env: JOB=\"9\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n    ...\n    ```\n\n    First, let's identify the artifact producing jobs. These are Job 3 and 5.\n\n    We will add the following to the end of the `script` section of Job 3 and 5:\n\n    ```yaml\n    - .travis/cirp/cleanup1.sh\n    - .travis/cirp/store.sh \"$TRAVIS_BUILD_DIR/artifacts\"\n    - .travis/cirp/cleanup2.sh\n    ```\n\n    Since jobs 3 and 5 are artifact producing jobs, this means that the stages they are in, Stage 2 and Stage 4, are the artifact producing stages.\n\n    We will add the following at the end of `script` section of all jobs in Stage 2 and 4 that are not jobs 3 and 5, that's Job 2 and 6:\n\n    ```yaml\n    - .travis/cirp/cleanup1.sh\n    - .travis/cirp/cleanup2.sh\n    ```\n\n    Since Stage 4 is the last artifact producing stage, we can add the publishing job to any stage after it -- Stage 5, 6 or 7 -- or create a new publishing stage, e.g. Stage 8. For the sake of the example, let's say that we want to add the publishing job to Stage 6.\n\n    We will add the following job to the existing Stage 6:\n\n    ```yaml\n    - stage: \"Stage 6\"\n      env: JOB=\"8.5\" DESC=\"This is a publishing job\"\n      if: type != pull_request\n      script:\n        - export ARTIFACTS_DIR=\"$(mktemp -d)\"\n        - .travis/cirp/collect.sh \"$ARTIFACTS_DIR\"\n        - .travis/cirp/cleanup4.sh\n        - .travis/cirp/publish.sh \"$ARTIFACTS_DIR\"\n        - .travis/cirp/cleanup5.sh\n    ```\n\n    With Stage 2 being the first artifact producing stage and Stage 6 being the publishing stage, there are only two stages between them that are not artifact producing stages -- Stage 3 and 5.\n\n    We will add the following to `script` section of all jobs in Stage 3 and 5, that's Job 4 and 7:\n\n    ```yaml\n    - .travis/cirp/cleanup3.sh\n    ```\n\n    Now just to add the branch exception and we are done:\n\n    ```yaml\n    branches:\n      except:\n        - # Do not run Travis-CI builds on tags CI Release Publisher creates as it\n        - # will lead to endless (recursive?) tag creation and Travis-CI running\n        - /^ci-.+$/\n    ```\n\n    If we follow the instructions, our `.travis.yml` will change to:\n\n    ```yaml\n    ...\n\n    matrix:\n      include:\n        - stage: \"Stage 1\"\n          env: JOB=\"1\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n        - stage: \"Stage 2\"\n          env: JOB=\"2\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n            - .travis/cirp/cleanup1.sh\n            - .travis/cirp/cleanup2.sh\n        - stage: \"Stage 2\"\n          env: JOB=\"3\" DESC=\"This job produces artifacts\"\n          script:\n            - ...\n            - .travis/cirp/cleanup1.sh\n            - .travis/cirp/store.sh \"$TRAVIS_BUILD_DIR/artifacts\"\n            - .travis/cirp/cleanup2.sh\n        - stage: \"Stage 3\"\n          env: JOB=\"4\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n            - .travis/cirp/cleanup3.sh\n        - stage: \"Stage 4\"\n          env: JOB=\"5\" DESC=\"This job produces artifacts\"\n          script:\n            - ...\n            - .travis/cirp/cleanup1.sh\n            - .travis/cirp/store.sh \"$TRAVIS_BUILD_DIR/artifacts\"\n            - .travis/cirp/cleanup2.sh\n        - stage: \"Stage 4\"\n          env: JOB=\"6\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n            - .travis/cirp/cleanup1.sh\n            - .travis/cirp/cleanup2.sh\n        - stage: \"Stage 5\"\n          env: JOB=\"7\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n            - .travis/cirp/cleanup3.sh\n        - stage: \"Stage 6\"\n          env: JOB=\"8\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n        - stage: \"Stage 6\"\n          env: JOB=\"8.5\" DESC=\"This is a publishing job\"\n          if: type != pull_request\n          script:\n            - export ARTIFACTS_DIR=\"$(mktemp -d)\"\n            - .travis/cirp/collect.sh \"$ARTIFACTS_DIR\"\n            - .travis/cirp/cleanup4.sh\n            - .travis/cirp/publish.sh \"$ARTIFACTS_DIR\"\n            - .travis/cirp/cleanup5.sh\n        - stage: \"Stage 7\"\n          env: JOB=\"9\" DESC=\"This job doesn't produce any artifacts\"\n          script:\n            - ...\n\n    branches:\n      except:\n        - # Do not run Travis-CI builds on tags CI Release Publisher creates as it\n        - # will lead to endless (recursive?) tag creation and Travis-CI running\n        - /^ci-.+$/\n    ...\n    ```\n\n    `.travis/cirp/*.sh` are helper scripts that you can find in the [`scripts`](scripts) directory.\n\n9. General dos and don'ts.\n\n    Dos:\n    - Do use [`.travis/cirp/*.sh`](scripts) helper scripts, they check for some important preconditions to be met before installing all of CI Release Publisher's dependencies and calling it.\n    - Do modify `publish.sh` script to call the `publish` command with the arguments you want.\n    - Do set an appropriate `--latest-release-check-event-type` argument in the `publish` command if you are creating Latest Release and use multiple build types: push, cron, api, etc., but run CI Release Publisher only on a subset of them.\n    - Do run things between the `collect.sh` and `publish.sh` calls. For example calculate hashes of the artifacts and include them as a file in the artifacts directory for `publish.sh` to upload, or modify `publish.sh` to calculate the hashes and pass them as the release body text argument, or generate a changelog and set it as the release body text.\n    - Do modify `store.sh` script to call the `store` command with the arguments you want.\n    - Do modify `install.sh` for your needs.\n    - Do modify `check_precondition.sh` for your needs.\n    - Do use Travis-CI's `allow_failures` feature if you want to allow an artifact producing job to fail, the `cleanup*.sh` scripts will make sure that the build artifacts of these jobs are not included in the release.\n    - Do set `--tag-prefix` on all of the python script invocations in all `*.sh` scripts if you already use branch names or tag names that start with `ci-`or `_ci-` for something else, as CI Release publisher might delete them.\n    - Do set `--tag-prefix-incomplete-releases` on all of the python script invocations in all `*.sh` scripts if you have branches or tags that differ by the starting `_`, e.g. `<name>` and `_<name>`, as CI Release publisher might delete them.\n\n    Don'ts:\n    - Don't modify `cleanup*.sh` scripts, especially the arguments passed to `cleanup` commands. They are the exact arguments you want to call `cleanup` commands with, changing them without having a deep understanding of why they are needed will very likely break things.\n    - Don't remove `cleanup*.sh` calls from your `travis.yml`. They are rather numerous, but they are there to minimize the littering of the Releases page with draft releases. Also, some other commands, like `store`, depend on the exact `cleanup` command to be called right before them and will misbehave if the cleanup is removed.\n    - Don't re-arrange the order in which `*.sh` scripts are called, doing so will break the logic.\n\n### Publishing to a different repository\n\n1. Follow all the steps from [Publishing to the same repository](#publishing-to-the-same-repository), except that you add the access token to main repository's Travis-CI for the step 3 and invite the new user to a different, non-main, repository for the step 4.\n\n2. In addition to the `.travis.yml` modifications done in the step 8, you should set `CIRP_GITHUB_REPO_SLUG` environment variable before calling CI Release Publisher, to tell it that it should publish releases to a different repository. `CIRP_GITHUB_REPO_SLUG` should be set to `<github-user-or-org-name>/<repo-name>`, i.e. the part of repository URL with \"https://github.com/\" dropped, e.g. for `https://github.com/nurupo/ci-release-publisher` that would be `nurupo/ci-release-publisher`. Since it needs to be set every time you run CI Release Publisher, it's easier [to set it globally](https://docs.travis-ci.com/user/environment-variables/#global-variables) like this:\n\n    ```yaml\n    env:\n      global:\n        - CIRP_GITHUB_REPO_SLUG=\"nurupo/ci-release-publisher\"\n    ```\n\n3. Make sure the GitHub repository you want to publish releases to has at least one commit, since GitHub releases are just constructs on top of git tags and you can't have git tags without having any commits.\n\nIn contrast to publishing to the same repository, CI Release Publisher doesn't set `target_commitish` to `$TRAVIS_COMMIT` in [the release creating GtHub API call](https://developer.github.com/v3/repos/releases/#create-a-release) when publishing to a different repository, it leaves it empty, which means that [the release will be created with a tag referencing the default branch for the GitHub rpository](https://developer.github.com/v3/repos/releases/#create-a-release). It's done so because if you set `target_commitish` to `$TRAVIS_COMMIT`, which is the commit that was just pushed to the main repository, and such commit doesn't exist in the different repository -- GitHub API would error out since it can't create a tag for a non-existing commit. It's a fair assumption that the different repository won't be up-to-date with whatever was just pushed to the main repository. You can override this behavior by providing `--*target-commitish` arguments to CI Release Publisher's `store` and `publish` commands.\n\n### Doing everything in a different repository\n\nThe idea here is to setup a Travis-CI cron build in a different repository to run daily/weekly/monthly which will `git pull` a branch of the main repository, modify `.travis.yml` of the repository we just pulled so that it would use CI Release Publisher to create build artifacts and publish them in the current repository, and `git push` it all into some branch of the different repository. The act of pushing will start another Travis-CI build, which this time will publish releases. We don't want to publish releases in the cron build because if there are several artifact producing jobs, each doing `git pull` on the main repository, it's possible that the main repository will get new commits pushed while our build is running resulting in some jobs pulling an older history and other a newer one, so the resulting build artifacts might be of different commits. By pulling the main repository in the cron build and pushing it into a different repository's branch we guarantee that all jobs will work on the same revision of the main repository.\n\n1. Follow the steps 1-7 in [Publishing to the same repository](#publishing-to-the-same-repository), storing the access token into the different repository's Travis-CI and inviting the new user to the different repository.\n\n2. Follow steps 8 and 9 to create `.travis.build.yml` file, which is what we will replace main repository's `.travis.yml` with.\n\n3. Create a `.travis.yml` with:\n\n    ```yaml\n    env:\n      - MAIN_REPO_SLUG=\"nurupo/ci-release-publisher\" MAIN_REPO_BRANCH=\"master\" DIFFERENT_REPO_BRANCH=\"build\"\n\n    cache:\n      directories:\n        - /tmp/cirp\n\n    script:\n      - ./update_branch.sh\n    ```\n\n    Modify the environment variables appropriately.\n\n    We use [Travis-CI's cache functionality](https://docs.travis-ci.com/user/caching/) to store the hash of the latest commit we have made a release for, so that we don't create a new release next time if nothing has changed in the main repository. Of course there are cases when you want to make a new release even though nothing has changed in the main repository, e.g. when one of the dependencies updates, like OpenSSL, but this is out of scope of this example and you could expand on this caching solution to cover that.\n\n    Note that [Travis-CI's cache expiers in 28 days](https://docs.travis-ci.com/user/caching/#caches-expiration) for open source projects (it's longer for private projects), while it's not specified how much time passes between Travis-CI's monthly cron builds. The exact time at which Travis-CI runs cron builds is documented as implementation-defined, so Travis-CI can change it at any time, but based on some observations, it currently seems to run monthly cron builds at the exact same date and time as the first monthly cron job has ran but with a month incremented, e.g. 2019-02-19 09:00:00 -> 2019-03-19 09:00:00 -> 2019-04-19 09:00:00 -> 2019-05-19 09:00:00. If that's the case, then at least 28 days would pass since the last run, meaning that the cache would always expire by the time the next monthly cron build runs, so you probably won't be benefiting from using the cache in your monthly cron builds.\n\n4. Create a `update_branch.sh` file, marking it as executable, with something like the following (it's likely you will want to customize this):\n\n    ```bash\n    #!/usr/bin/env bash\n\n    set -euo pipefail\n\n    # Put away our travis config for now\n    cp .travis.${DIFFERENT_REPO_BRANCH}.yml ..\n\n    # Checkout main repository's branch\n    git remote rm origin\n    git remote add origin https://$GITHUB_ACCESS_TOKEN@github.com/$TRAVIS_REPO_SLUG > /dev/null 2>&1\n    git remote add upstream https://github.com/$MAIN_REPO_SLUG > /dev/null 2>&1\n    git fetch upstream > /dev/null 2>&1\n    git branch -D $DIFFERENT_REPO_BRANCH || true\n    git checkout -b $DIFFERENT_REPO_BRANCH upstream/$MAIN_REPO_BRANCH\n    git log -1\n\n    # Don't create a new release if the main repository hasn't updated since the previous release\n    if [ -f \"/tmp/cirp/previous_runs_commit\" ]; then\n      if [ \"$(cat /tmp/cirp/previous_runs_commit)\" == \"$(git rev-parse HEAD)\" ]; then\n        echo \"The main repository hasn't been updated since the last release. Exiting.\"\n        exit 0\n      else\n        # Main repo got new commits in it\n        git rev-parse HEAD > /tmp/cirp/previous_runs_commit\n      fi\n    else\n      # Caching last commit information as it doesn't exist\n      mkdir -p /tmp/cirp\n      git rev-parse HEAD > /tmp/cirp/previous_runs_commit\n    fi\n\n    # Patch up the main repo's Travis-CI configuration so that it creates releases\n    mv ../.travis.${DIFFERENT_REPO_BRANCH}.yml .travis.yml\n    # you might want to patch more things here, perhaps add some bash scripts that\n    # .travis.${DIFFERENT_REPO_BRANCH}.yml will be calling that are not present in\n    # the main repo, apply actual patch files, sed things, etc.\n\n    # Push the changes to our branch\n    git config --global user.email \"new-users-email@example.com\"\n    git config --global user.name \"new-users-name\"\n    git commit -am \"Modify upstream repo for building\"\n    git push origin $DIFFERENT_REPO_BRANCH --force > /dev/null 2>&1\n    ```\n\n    Change `$GITHUB_ACCESS_TOKEN` to `$CIRP_GITHUB_ACCESS_TOKEN` if you are using the latter, and include the access token into `git remote add upstream` command's URL if the main repository is private, otherwise we wouldn't be able to clone it. Change `new-users-email@example.com` to new user's email address and `new-users-name` to new user's name. Remove output of all commands that might leak the access token with `> /dev/null 2>&1`, and make sure you don't expose `.git/config` anywhere, since that's where all remote URLs with access tokens in them are stored. Travis-CI has [documentation](https://docs.travis-ci.com/user/best-practices-security/#recommendations-on-how-to-avoid-leaking-secrets-to-build-logs) on best practices of preventing access tokens from being leaked to build logs.\n\n    Note that this simple `update_branch.sh` script won't create releases for any tags created in the main repository, but you could expand it to do so.\n\n5. Modify `.travis.yml` and `update_branch.sh` to your needs.\n6. Push `.travis.yml`, `update_branch.sh` and `.travis.build.yml` into the different repository.\n7. After you push, make sure the build gets created on Travis-CI, that it succeeds, that in turn it creates yet another build which succeeds and creates releases.\n8. Go to the Settings page of your repository on Travis-CI, e.g. https://travis-ci.org/nurupo/ci-release-publisher/settings, and under \"Cron Jobs\" set it to run a cron build of the branch you pushed the files to daily, weekly or monthly.\n\n## Options\n\nIt's often useful to know what options a program provides before installing it, so here are options for the available commands.\n\nNote that CI Release Publisher uses `$TRAVIS_` environment variables to know which branch it's running on, whether a tag was pushed and so on, so you won't see command line arguments on specifying things CI Release Publisher can already get from the `$TRAVIS_` environment variables.\nIt also uses `$CIRP_` environment variables for API tokens and some other options.\n\n```\n$ ci-release-publisher --help\nusage: ci-release-publisher [-h] [--version] [--travis-api-url TRAVIS_API_URL]\n                            [--github-api-url GITHUB_API_URL]\n                            [--tag-prefix TAG_PREFIX]\n                            [--tag-prefix-incomplete-releases TAG_PREFIX_TMP]\n                            {store,cleanup_store,collect,publish,cleanup_publish}\n                            ...\n\nA script for publishing Travis-CI build artifacts on GitHub Releases\n\npositional arguments:\n  {store,cleanup_store,collect,publish,cleanup_publish}\n    store               Store artifacts of the current job in a draft release\n                        for the later collection by a job calling the\n                        \"publish\" command.\n    cleanup_store       Delete the releases created by the \"store\" command.\n    collect             Collect artifacts from all draft releases created by\n                        the \"store\" command during the current build in a\n                        directory.\n    publish             Publish releases with artifacts from a directory.\n    cleanup_publish     Delete incomplete releases left over by the \"publish\"\n                        command by the current and previous builds.\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --version             show program's version number and exit\n  --travis-api-url TRAVIS_API_URL\n                        Use a custom Travis-CI API URL, e.g. for self-hosted\n                        Travis-CI Enterprise instance. Should be an URL to the\n                        API endpoint, e.g. \"https://travis.example.com/api\".\n  --github-api-url GITHUB_API_URL\n                        Use a custom GitHib API URL, e.g. for self-hosted\n                        GitHub Enterprise instance. Should be an URL to the\n                        API endpoint, e.g. \"https://api.github.com\".\n  --tag-prefix TAG_PREFIX\n                        git tag prefix to use when creating releases.\n  --tag-prefix-incomplete-releases TAG_PREFIX_TMP\n                        An additional git tag prefix, on top of the existing\n                        one, to use for indicating incomplete, in-progress\n                        releases.\n```\n\n```\n$ ci-release-publisher store --help\nusage: ci-release-publisher store [-h] [--release-name RELEASE_NAME]\n                                  [--release-body RELEASE_BODY]\n                                  ARTIFACT_DIR\n\npositional arguments:\n  ARTIFACT_DIR          Path to a directory containing artifacts that need to\n                        be stored.\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --release-name RELEASE_NAME\n                        Release name text. If not specified a predefined text\n                        is used.\n  --release-body RELEASE_BODY\n                        Release body text. If not specified a predefined text\n                        is used.\n```\n\n```\n$ ci-release-publisher cleanup_store --help\nusage: ci-release-publisher cleanup_store [-h] --scope\n                                          {current-job,current-build,previous-finished-builds}\n                                          [{current-job,current-build,previous-finished-builds} ...]\n                                          --release {complete,incomplete}\n                                          [{complete,incomplete} ...]\n                                          [--on-nonallowed-failure]\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --scope {current-job,current-build,previous-finished-builds} [{current-job,current-build,previous-finished-builds} ...]\n                        Scope to cleanup.\n  --release {complete,incomplete} [{complete,incomplete} ...]\n                        Release to cleanup.\n  --on-nonallowed-failure\n                        Cleanup only if the current build has a job that both\n                        has failed and doesn't have allow_failure set on it,\n                        i.e. the current build is going to fail once the\n                        current stage finishes running.\n```\n\n```\n$ ci-release-publisher collect --help\nusage: ci-release-publisher collect [-h] ARTIFACT_DIR\n\npositional arguments:\n  ARTIFACT_DIR  Path to a directory where artifacts should be collected to.\n\noptional arguments:\n  -h, --help    show this help message and exit\n```\n\n```\n$ ci-release-publisher publish --help\nusage: ci-release-publisher publish [-h] [--latest-release]\n                                    [--latest-release-name LATEST_RELEASE_NAME]\n                                    [--latest-release-body LATEST_RELEASE_BODY]\n                                    [--latest-release-draft]\n                                    [--latest-release-prerelease]\n                                    [--latest-release-target-commitish LATEST_RELEASE_TARGET_COMMITISH]\n                                    [--latest-release-check-event-type {any,api,cron,push} [{any,api,cron,push} ...]]\n                                    [--numbered-release]\n                                    [--numbered-release-keep-count NUMBERED_RELEASE_KEEP_COUNT]\n                                    [--numbered-release-keep-time NUMBERED_RELEASE_KEEP_TIME]\n                                    [--numbered-release-name NUMBERED_RELEASE_NAME]\n                                    [--numbered-release-body NUMBERED_RELEASE_BODY]\n                                    [--numbered-release-draft]\n                                    [--numbered-release-prerelease]\n                                    [--numbered-release-target-commitish NUMBERED_RELEASE_TARGET_COMMITISH]\n                                    [--tag-release]\n                                    [--tag-release-name TAG_RELEASE_NAME]\n                                    [--tag-release-body TAG_RELEASE_BODY]\n                                    [--tag-release-draft]\n                                    [--tag-release-prerelease]\n                                    [--tag-release-target-commitish TAG_RELEASE_TARGET_COMMITISH]\n                                    [--tag-release-force-recreate]\n                                    ARTIFACT_DIR\n\npositional arguments:\n  ARTIFACT_DIR          Path to a directory containing build artifacts to\n                        publish.\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --latest-release      Publish latest release. The same \"ci-<branch>-latest\"\n                        tag release will be re-used (re-created) by each\n                        build.\n  --latest-release-name LATEST_RELEASE_NAME\n                        Release name text. If not specified a predefined text\n                        is used.\n  --latest-release-body LATEST_RELEASE_BODY\n                        Release body text. If not specified a predefined text\n                        is used.\n  --latest-release-draft\n                        Publish as a draft.\n  --latest-release-prerelease\n                        Publish as a prerelease.\n  --latest-release-target-commitish LATEST_RELEASE_TARGET_COMMITISH\n                        Commit the release should point to. By default it's\n                        set to $TRAVIS_COMMIT when publishing to the same repo\n                        and not set when publishing to a different repo.\n  --latest-release-check-event-type {any,api,cron,push} [{any,api,cron,push} ...]\n                        Consider only builds of specific event types when\n                        checking if the current build is the latest. If not\n                        specified, \"any\" is used.\n  --numbered-release    Publish a numbered release. A separate\n                        \"ci-<branch>-<build_number>\" release will be made for\n                        each build. You must specify at least one of\n                        --numbered-release-keep-* arguments specifying the\n                        strategy for keeping numbered builds.\n  --numbered-release-keep-count NUMBERED_RELEASE_KEEP_COUNT\n                        Number of numbered releases to keep. If set to 0, this\n                        check is disabled, otherwise if the number of numbered\n                        releases exceeds that number, the oldest numbered\n                        release will be deleted. Note that due to a race\n                        condition of several Travis-CI builds running at the\n                        same time, although unlikely, it's possible for the\n                        number of kept numbered releases to exceed that number\n                        by the number of concurrent Travis-CI builds running.\n  --numbered-release-keep-time NUMBERED_RELEASE_KEEP_TIME\n                        How long to keep the numbered releases for, in\n                        seconds. If set to 0, this check is disabled,\n                        otherwise all numbered releases that are older than\n                        the specified amount of seconds will be deleted.\n  --numbered-release-name NUMBERED_RELEASE_NAME\n                        Release name text. If not specified a predefined text\n                        is used.\n  --numbered-release-body NUMBERED_RELEASE_BODY\n                        Release body text. If not specified a predefined text\n                        is used.\n  --numbered-release-draft\n                        Publish as a draft.\n  --numbered-release-prerelease\n                        Publish as a prerelease.\n  --numbered-release-target-commitish NUMBERED_RELEASE_TARGET_COMMITISH\n                        Commit the release should point to. By default it's\n                        set to $TRAVIS_COMMIT when publishing to the same repo\n                        and not set when publishing to a different repo.\n  --tag-release         Publish a release for a pushed tag. A separate \"<tag>\"\n                        release will be made whenever a tag is pushed.\n  --tag-release-name TAG_RELEASE_NAME\n                        Release name text. If not specified a predefined text\n                        is used.\n  --tag-release-body TAG_RELEASE_BODY\n                        Release body text. If not specified a predefined text\n                        is used.\n  --tag-release-draft   Publish as a draft.\n  --tag-release-prerelease\n                        Publish as a prerelease.\n  --tag-release-target-commitish TAG_RELEASE_TARGET_COMMITISH\n                        Commit the release should point to. By default it's\n                        set to $TRAVIS_COMMIT when publishing to the same repo\n                        and not set when publishing to a different repo.\n  --tag-release-force-recreate\n                        Force recreation of the release if it already exists.\n                        DANGER. You almost never want to enable this option.\n                        When enabled, your existing tag release will be\n                        deleted, all of its text and artifacts will be forever\n                        lost, and a new tag release will be created based on\n                        this build. Note that by enabling this, someone might\n                        accidentally (or not) restart a tag release build on\n                        Travis-CI, causing the release to be recreated. You\n                        have been warned.\n```\n\n```\n$ ci-release-publisher cleanup_publish --help\nusage: ci-release-publisher cleanup_publish [-h]\n\noptional arguments:\n  -h, --help  show this help message and exit\n```\n\n## Troubleshooting\n\nIn order to prevent GitHub access token from being leaked, CI Release Publisher catches all exceptions and prints out only the exception type and message, avoiding printing out the stack trace, as the access token is often passed as a function argument and might show up in the stack trace. Travis-CI does replace environment variable values with `[secure]` in its logs, so it's mostly a precaution in case Python prints them encoded one way or another. Although a good security measure, it also means that you don't know where exactly in the code exceptions are coming from. Luckily there are just a few common exceptions that happen when using CI Release Publisher incorrectly, most of which have to do with using the wrong API endpoint for either GitHub or Travis-CI, incorrect GitHub access token or an access token with insufficient permissions set. This section tries to document those exceptions based on just exception type and message.\n\n### `JSONDecodeError`\n\nIf you are getting:\n\n```\nJSONDecodeError: Expecting value: line 1 column 1 (char 0)\n```\n\nit's likely that Travis-CI can't authenticate CI Release Publisher using the GitHub access token provided. Make sure you have set the right scope on the access token, e.g. `repo` for Travis-CI on `.com` and `public_repo` for Travis-CI on `.org`, and that you have logged into Travis-CI web interface at least once as the GitHub user whose access token you are using, authorizing Travis-CI to access that user's GitHub account, so that Travis-CI would create an account for the GitHub user.\n\nIf you have access to `$GITHUB_ACCESS_TOKEN` locally on your machine, you can test Travis-CI authentication with GitHub access token using this cURL command:\n\n```bash\ncurl -v -X POST \\\n-H \"Accept: application/vnd.travis-ci.2.1+json\" \\\n-d 'github_token=$GITHUB_ACCESS_TOKEN' \\\n'https://api.travis-ci.org/auth/github'\n```\n\nYou want to see a 2xx HTTP code and a Travis-CI access token as a payload in the reply. Again, run this curl command locally, don't run it on Travis-CI as it might reveal `$GITHUB_ACCESS_TOKEN` and it will reveal your Travis-CI access token on success.\n\n### `RetryError`\n\nIf you are getting:\n\n```\nRetryError: HTTPSConnectionPool(host='api.travis-ci.com', port=443): Max retries exceeded with url: /auth/github?github_token=[secure] (Caused by ResponseError('too many 403 error responses'))\n```\n\nit's likely that Travis-CI can't authenticate CI Release Publisher using the GitHub access token provided due to GitHub rate limiting Travis-CI. A workaround is to set `CIRP_TRAVIS_ACCESS_TOKEN` environment variable to the [new GitHub user's Travis-CI API token](https://travis-ci.org/account/preferences), then CI Release Publisher will avoid calling this problematic API endpoint altogether.\n\n### `BadCredentialsException`\n\nIf you are getting:\n\n```\nBadCredentialsException: 401 {'message': 'Bad credentials', 'documentation_url': 'https://developer.github.com/v3'}\n```\n\nthen it means that the GitHub access token you provided doesn't have enough permissions to create releases in the target GitHub repository. Make sure you have invited the new user to the repository, the new user has accepted the invitation and they have been granted the full write access to it.\n\n## Projects using CI Release Publisher\n\n| Project                                                                    | Comment                                                                                                    |\n|----------------------------------------------------------------------------|------------------------------------------------------------------------------------------------------------|\n| [vlc-pause-click-plugin](https://github.com/nurupo/vlc-pause-click-plugin) | [Publishes to a different repo](https://github.com/nurupo/vlc-pause-click-plugin-nightly-builds/releases). |\n| [qTox](https://github.com/qTox/qTox)                                       | [Publishes to a different repo](https://github.com/qTox/qTox-nightly-releases/releases).                   |\n\nFeel free to open an issue requesting to add your project to the list.\n\n## License\n\nMIT\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/nurupo/ci-release-publisher", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "ci-release-publisher", "package_url": "https://pypi.org/project/ci-release-publisher/", "platform": "", "project_url": "https://pypi.org/project/ci-release-publisher/", "project_urls": {"Homepage": "https://github.com/nurupo/ci-release-publisher"}, "release_url": "https://pypi.org/project/ci-release-publisher/0.2.0/", "requires_dist": ["PyGithub (>=1.42)", "requests (>=2.20.0)"], "requires_python": ">=3.5", "summary": "A script for publishing Travis-CI build artifacts on GitHub Releases", "version": "0.2.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>CI Release Publisher</h1>\n<p>A script for publishing Travis-CI build artifacts on GitHub Releases.</p>\n<p>Mainly geared towards publishing nightly/continuous builds, which Travis-CI has no native support of, but can also be used to publish release builds.</p>\n<h2>Table of contents</h2>\n<ul>\n<li><a href=\"#features\" rel=\"nofollow\">Features</a></li>\n<li><a href=\"#terminology\" rel=\"nofollow\">Terminology</a></li>\n<li><a href=\"#ci-release-publisher-vs-travis-cis-github-releases-deployment\" rel=\"nofollow\">CI Release Publisher vs. Travis-CI's GitHub Releases deployment</a>\n<ul>\n<li><a href=\"#short-comparison\" rel=\"nofollow\">Short comparison</a></li>\n<li><a href=\"#detailed-comparison\" rel=\"nofollow\">Detailed comparison</a></li>\n</ul>\n</li>\n<li><a href=\"#handling-race-conditions\" rel=\"nofollow\">Handling race conditions</a></li>\n<li><a href=\"#Installation\" rel=\"nofollow\">Installation</a>\n<ul>\n<li><a href=\"#signatures\" rel=\"nofollow\">Signatures</a></li>\n</ul>\n</li>\n<li><a href=\"#usage\" rel=\"nofollow\">Usage</a>\n<ul>\n<li><a href=\"#security-consideration\" rel=\"nofollow\">Security consideration</a></li>\n<li><a href=\"#publishing-to-the-same-repository\" rel=\"nofollow\">Publishing to the same repository</a></li>\n<li><a href=\"#publishing-to-a-different-repository\" rel=\"nofollow\">Publishing to a different repository</a></li>\n<li><a href=\"#doing-everything-in-a-different-repository\" rel=\"nofollow\">Doing everything in a different repository</a></li>\n</ul>\n</li>\n<li><a href=\"#options\" rel=\"nofollow\">Options</a></li>\n<li><a href=\"#troubleshooting\" rel=\"nofollow\">Troubleshooting</a></li>\n<li><a href=\"#projects-using-ci-release-publisher\" rel=\"nofollow\">Projects using CI Release Publisher</a></li>\n<li><a href=\"#license\" rel=\"nofollow\">License</a></li>\n</ul>\n<h2>Features</h2>\n<ul>\n<li>Two flavors of a nightly/continuous release:\n<ul>\n<li><strong>Latest Release</strong>: a <code>ci-&lt;branch&gt;-latest</code> tagged release that will be kept updated to contain build artifacts of the latest Travis-CI build for the branch</li>\n<li><strong>Numbered Release</strong>: a <code>ci-&lt;branch&gt;-&lt;build-number&gt;</code> tagged release that will contain build artifacts of <code>&lt;build-number&gt;</code> Travis-CI build for the branch\n<ul>\n<li>Retention policies for Numbered Releases:\n<ul>\n<li>Keep only the last N numbered releases for the branch, extra numbered releases will be deleted starting with the lowest <code>&lt;build-number&gt;</code> first (i.e. oldest release first)</li>\n<li>Keep only numbered releases that were published within the last N seconds (i.e. delete all numbered releases older than N seconds)</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><strong>Tag Release</strong>: a regular release that is made only on a tag push</li>\n<li>Customize release information of each of the three release types independently:\n<ul>\n<li>Release name</li>\n<li>Release body (e.g. set it to a list of hashes of all build artifacts)</li>\n<li>Draft flag (e.g. if you want the releases to be private)</li>\n<li>Pre-release flag (e.g. when every nightly is a production release!)</li>\n<li>Target commit</li>\n</ul>\n</li>\n<li>Race condition proof - no matter how many builds or jobs per build you have running in parallel, no release will get corrupted due to a race condition</li>\n<li>Allows publishing to a different GitHub repository's Releases page</li>\n<li>Supports public GitHub repos (tested), but should also work with private GitHub repos and self-hosted GitHub instances (both are not tested)</li>\n</ul>\n<h2>Terminology</h2>\n<p>Let's define some terms we will use throughout this file, things might get confusing if you don't know them.</p>\n<h3>CI Release Publisher terms</h3>\n<p>See <strong>Latest Release</strong>, <strong>Numbered Release</strong> and <strong>Tag Release</strong> in <a href=\"#features\" rel=\"nofollow\">Features</a>.</p>\n<h3>Travis-CI terms</h3>\n<p><strong>Job</strong> - A single process consisting of git cloning your repository and then running arbitrary commands on the machine, usually to build and/or test the software that is in the repository.</p>\n<p><strong>Stage</strong> - A set of jobs. Stages allow to enforce job execution order. All jobs within a stage run in parallel, however each stage runs sequentially, e.g. jobs in stage2 won't start running until all of the jobs in stage1 complete. This feature also sometimes called Pipeline, for example in GitLab CI.</p>\n<p><strong>Build</strong> - A set of stages. If at least one job in a builds fails - the build gets marked as failed. Builds are created whenever you push to a GitHub repository that has Travis-CI configured for it. In a very minimal case a build has just one stage with one job in it.</p>\n<p>Here is an example of a build having 5 stages and 15 jobs: <a href=\"https://travis-ci.org/qTox/qTox/builds/406143072\" rel=\"nofollow\">url</a>, <a href=\"https://i.imgur.com/K1hAR9R.png\" rel=\"nofollow\">screenshot</a>.</p>\n<h3>GitHub terms</h3>\n<p><strong>Release</strong> - A feature allowing to associate downloadable files with an existing git tag. Mainly used for distributing the software and software-related files. All releases can be viewed on a dedicated Releases page of a GitHub repository, on which releases are ordered by their creation time.</p>\n<p><strong>Draft Release</strong> - A release that is \"private\", i.e. visible only to people who have priviliged access to the repository (Write or Admin repository permissions). A draft release can be changed to a non-draft release, making it public and creating a git tag for it if it didn't exist before.</p>\n<p><strong>Pre-release Release</strong> - A release that is visibly marked as not production-ready. Ideal for nightly/continuous releases.</p>\n<h2>CI Release Publisher vs. Travis-CI's GitHub Releases deployment</h2>\n<p>Travis-CI provides <a href=\"https://docs.travis-ci.com/user/deployment/releases/\" rel=\"nofollow\">GitHub Releases deployment option</a> that many are familiar with, so let's make a quick comparison of how CI Release Publisher differs from Travis-CI's deployment option.</p>\n<h3>Short comparison</h3>\n<p>Here is a table summarizing the comparison if you don't want to read through it.</p>\n<table>\n<thead>\n<tr>\n<th>Features</th>\n<th>CI Release Publisher</th>\n<th>Travis-CI</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Tag Release</td>\n<td>yes</td>\n<td>yes</td>\n</tr>\n<tr>\n<td>Latest Release</td>\n<td>yes</td>\n<td>no*</td>\n</tr>\n<tr>\n<td>Numbered Releases</td>\n<td>yes</td>\n<td>no</td>\n</tr>\n<tr>\n<td>Customizable release information</td>\n<td>yes</td>\n<td>yes**</td>\n</tr>\n<tr>\n<td>Race condition proof</td>\n<td>yes</td>\n<td>no</td>\n</tr>\n<tr>\n<td>Proper draft releases</td>\n<td>yes</td>\n<td>no</td>\n</tr></tbody></table>\n<p><code>*</code> -- can be done <a href=\"https://github.com/travis-ci/travis-ci/issues/8622#issuecomment-354912673\" rel=\"nofollow\">with some extra bash commands</a>, but is not part of Travis-CI's GitHub Releases deployment feature set and also won't be race condition proof.</p>\n<p><code>**</code> -- Travis-CI's release body <a href=\"https://github.com/travis-ci/dpl/issues/155\" rel=\"nofollow\">can't contain new lines</a>, so you can't include multiline changelog in it, which means that you wouldn't be able to list hashes of artifacts, for example.</p>\n<h3>Detailed comparison</h3>\n<p>Travis-CI's GitHub Releases deployment option works great for non-draft Tag Releases. In fact, if that's all you need, then you should strongly consider using Travis-CI's GitHub Releases deployment option over CI Release Publisher, as Travis-CI provides about the same amount of release customization as CI Release Publisher (sans the support of new lines in the release body).</p>\n<p>However, on this the usefulness of Travis-CI's GitHub Releases deployment ends. Travis-CI falls short if you want to set a release body containing new lines, create a race condition proof Tag Release, create any kind of draft release, create a Latest Release, or create a Numbered Release.</p>\n<h4>New lines in release body</h4>\n<p>Travis-CI doesn't support new lines when specifying release's body <a href=\"https://github.com/travis-ci/dpl/issues/155\" rel=\"nofollow\">due to Travis-CI's component handling deployment having problems with new lines</a>. CI Release Publisher doesn't have this limitation.</p>\n<h4>Tag Release</h4>\n<p>Travis-CI's Tag Releases are not race condition proof. You can push a tag to GitHub, which will create a Travis-CI build, then delete the tag and push it again, supposedly pointing to some new fixup commit this time around, which will create another Travis-CI build. You will now have two Travis-CI builds running in parallel and uploading artifacts to the same tag release, which is a race condition. You might end up with a release some artifacts of which come from the first build and some from the second build which has the fix you pushed. CI Release Publisher doesn't have this issue, it makes sure that a Tag Release will contain artifacts only from the latest build for that tag.</p>\n<h4>Draft release</h4>\n<p>The issue with Travis-CI's draft releases is that while for non-draft releases Travis-CI creates just a single release for the whole build containing artifacts of all jobs, which is what you want, for draft releases Travis-CI instead creates numerous draft releases, one for every single job in the build, which is not you want. For example, if you have 10 jobs then you will get 10 draft releases, each containing artifacts of only that one particular job, when you actually expected to get just one draft release containing artifacts of all the 10 jobs. Just changing <code>draft: false</code> to <code>draft: true</code> in Travis-CI changes the behaviour so drastically. CI Release Publisher has no such issue, it creates just one final release containing artifacts of all jobs, both when creating draft and non-draft releases.</p>\n<h4>Latest Release</h4>\n<p>As far as the issue with Latest Release goes, Travis-CI's GitHub Releases deployment simply doesn't support creating such releases. There is no option for it. There is, however, <a href=\"https://github.com/travis-ci/travis-ci/issues/8622#issuecomment-354912673\" rel=\"nofollow\">a workaround</a> that allows to achieve creating Latest Release on Travis-CI, but it requires running some additional bash/git commands and has a race condition that might result in a release being corrupted, i.e. it allows several builds editing the same release at the same time. CI Release Publisher supports creating Latest Release and it does so without race conditions.</p>\n<h4>Numbered Release</h4>\n<p>Travis-CI doesn't support creating Numbered Releases either. Although you could create them with the same workaround that you can use to create Latest Release, there is no easy way to delete previous Numbered Releases without using GitHub API. If you think you could avoid using GitHub API by expanding the workaround to use <code>git</code> command line program to delete git tags in order to delete releases -- that wouldn't work, if a git tag of a GitHub release is deleted the release doesn't get deleted, it remains but changes to a draft. There would also be a race condition with deleting previous Numbered Releases this way as they might still be in the process of being created by another builds as you delete them, which might result in those builds creating incomplete releases. To do it properly you'd need to essentially re-invent CI Release Publisher.</p>\n<h2>Handling race conditions</h2>\n<p>Special care was taken to make sure that CI Release Publisher avoids race conditions, especially the ones that can corrupt a release -- result in a release that doesn't contain all of the artifacts, or a release in which some artifacts come from one build, and thus one commit, but other from another. This section will talk about CI Release Publisher features, about how, if implemented naively, they would have race conditions, and how does CI Release Publisher avoid those race conditions. This is not a complete list of the race conditions CI Release Publisher has to deal with, but it gives a good idea about how CI Release Publisher works.</p>\n<p>There are two primary points at which race conditions can occur: when jobs run in parallel and when builds run in parallel. We consider only the builds within the same branch/tag as in CI Release Publisher builds from different branches/tags can't affect each other.</p>\n<h3>Jobs running in parallel</h3>\n<p>The goal of CI Release Publisher is to create a release containing artifacts of a all artifact-producing jobs for a build. A naive way to do so would be to make jobs create a GitHub release, let them upload their artifacts into it and that's it, done -- we would have a single release with all jobs' artifacts.</p>\n<p>While this naive implementation would work if jobs execute sequentially, it has a race condition when two or more jobs run in parallel and they try to create a GitHub release. The jobs would check GitHub API to see if some other job from this build has already created a release which should be used instead of creating a new one, but because they can check it all at the same time, multiple jobs can end up seeing that no other job has created a release yet and decide to create one, which will result in multiple releases being created for this build, with build artifacts divided among them. Multiple releases being created for a single build is definitely not what we want, and there is no easy way to prevent it. GitHub API happily creates as many instances of identical draft releases as you ask it to, without raising any errors, so we can't use GitHub API as a race gate keeper that will pass only the the first job trying to create a release and reject all other.</p>\n<p>CI Release Publisher solves this issue by serializing the creation of the release for the build, it makes it so that only one job is responsible for creating the release, but this comes at the cost of having a separate Stage in the build. CI Release Publisher makes each artifact-producing job create a unique temporary store release containing build artifacts of just that job, and then, in the following Stage, it collects all of those artifacts from the temporary store releases, deletes those releases, and creates a proper release containing all of those artifacts. That way there is only one job that creates the (final) release and thus no race condition can occur as it's not racing with anyone.</p>\n<p>While this successfully solves the race issue, it has a slight disadvantage. If the build fails before it reaches the publishing stage, all those temporary store releases won't be deleted and would litter the Releases page, though only repo admins can see draft releases listed on it. This is mostly solved by making jobs before the publishing stage check if the build is failing and deleting those releases, that way we don't have to rely solely on the publishing stage to remove them.</p>\n<h3>Builds running in parallel</h3>\n<p>The main issue with builds running in parallel is that it's possible for several builds to modify the same release at the same time.</p>\n<h4>Latest Release</h4>\n<p>A Latest Release is a release containing the artifacts of the latest build for a branch. A Latest Release always has the same <code>ci-&lt;branch&gt;-latest</code> tag name, so you can easily link to it in README or on website, since the URL won't change. There is always no more than one Latest Release per branch. A naive implementation of the Latest Release feature would be to make each build delete the existing Latest Release, if any, and create a new one with current build's artifacts.</p>\n<p>This naive implementation would work if builds are executed sequentially, but it has a race condition when two or more builds run in parallel and they try to delete and create the Latest Release. There are several thing that can go wrong. Firstly, we can have one build deleting a release that another build might be in the process of uploading artifacts to, which will make the uploading build throw an exception and fail -- and rightfully so, as we consider a release that has artifacts missing a failure. Secondly, we can have a situation when the newer build finishes earlier than the older one due to code changes or removal of some build steps, which will result in the older build being the last one to delete and then re-create Latest Release, meaning that the Latest Release will contain artifacts of the older build instead of the newer one.</p>\n<p>CI Release Publisher solves this issue by updating (deleting and then re-creating) the Latest Release only if the current build is the latest build for the branch. It checks Travis-CI API to get the build number of the latest build for the branch, and if it's not the build number of the current build, it skips updating the Latest Release, leaving it to a newer build instead. This way only one build modifies the Latest Release -- the modification is serialized. This solves both the first and the second of the mentioned issues. It additionally protects Latest Release against being downgraded to contain artifacts of an older build when someone restarts an old Travis-CI build.</p>\n<p>The downside of this solution is, paradoxically, that only the latest build can update the Latest Release. In a situation when you have multiple builds running in parallel, with all but the latest succeeding, all those succeeded builds will pass on updating the Latest Release, leaving it up to the latest build, but because that build has failed, it won't reach the publishing Stage and won't update any releases, so you will end up with the Latest Release not being updated at all. There is no workaround for this, so just try to make sure that your builds don't fail and follow up a failed build with a fixed one.</p>\n<p>By the way, you might notice that this solution still leaves out a race condition, specifically the case of when a new build gets created right after the older build checks Travis-CI API to make sure that it's the latest build for the branch -- this could lead to both builds updating the Latest Release as both will think that they are the latest builds. However, such race condition is ruled out as impossible, as it takes just a couple of GitHub API calls, literally less than a second, for the older build to update the Latest Release after checking with Travis-CI API. All it has to do is 1) call GitHub API to delete the previous latest release and 2) call the GitHub API again to change the tag name of an already created release with all artifacts already uploaded to the proper Latest Release tag name. The newly created build likely hasn't even started yet, more so got to the release publishing Stage, to the point where it updates Latest Release, in such short time. So there should be no chance of the both builds updating the release at the same time.</p>\n<h4>Tag Release</h4>\n<p>Tag Release is implemented very similarly to Latest Release and doesn't deal with any new race condition issues, so there is nothing really to say about it.</p>\n<h4>Numbered Release</h4>\n<p>A Numbered Release is a release containing the artifacts of a specific build. Numbered Releases use <code>ci-&lt;branch&gt;-&lt;build-number&gt;</code> tag name, so unlike Latest Release, the release URL is always different. Numbered Releases have a retention policy options that dictate when existing Numbered Releases should be deleted. A naive implementation for the Numbered Release feature would be to make each build create a new Numbered Release for this build and delete existing Numbered Releases that are subject to deletion by the retention policy.</p>\n<p>This naive implementation would work if builds are executed sequentially, but it has a race condition when two or more builds run in parallel, as an old build might be still in the process of uploading artifacts to its Numbered Release when a new build deletes that release, causing the older build to error due to it unable to upload the rest of the artifacts to a no longer existing release, which will cause the old build to fail.</p>\n<p>CI Release Publisher solves this issue by executing the retention policy only on finished releases. It can do so because it can distinguish between in-progress and finished releases. When a release is just created, it has a special tag name indicating that it's in progress, and once all work on it is done, it gets renamed to a proper tag name. CI Release Publisher ignores all in-progress releases as not to fail the builds still working on them, considering only finished releases. This is no just a Numbered Release thing, CI Release Publisher does it for all of the release types, but it's especially important in Numbered Releases case. It also allows the repository owners to see which automated releases were completed and which are still in progress or failed without ever completing.</p>\n<p>There are several downsides to this solution. Firstly, if the publishing job fails or gets canceled in the middle of running it's possible for it to leave an in-progress draft release, littering the Releases page. This issue is solved by adding additional cleanup code that removes existing in-progress releases if the corresponding builds are no longer running, according to Travis-CI API. Secondly, due to the retention policy considering only finished releases, the in-progress releases will slip past the retention policy. For example, if there are N builds running in parallel, all having in-progress releases, and the retention policy is set to keep at most M latest Numbered Releases, those N in-progress releases will slip past the retention policy, resulting in N+M Numbered Releases being kept. There is no solution for this issue. In practice this is not a big issue, as the N in practice tends to be rather small, often even zero, and the next build is going to execute the retention policy and delete any extra Numbered Releases, keeping only M in place.</p>\n<h2>Installation</h2>\n<p>Make sure you use Python 3.5 or higher.</p>\n<p>From source:</p>\n<pre>python setup.py install\n</pre>\n<p>From PyPi:</p>\n<pre>pip install ci_release_publisher\n</pre>\n<h3>Signatures</h3>\n<p>PyPi packages are PGP signed with a subkey of the following primary key:</p>\n<pre><code>Key fingerprint = 1D4E 9375 AD9B D50F 80FF  55AC 6F55 0977 4B1E F0C2\n</code></pre>\n<p>The signatures are uploaded to PyPi. Note that <code>pip</code> doesn't verify signatures, you have to do so manually. Also, PyPi website <a href=\"https://github.com/pypa/warehouse/issues/3356\" rel=\"nofollow\">hides the signature files from the download list on purpose</a>, so to get the signature files you have to append <code>.asc</code> at the end of download URLs.</p>\n<p>You can download the package, verify its signature and install with something like the following:</p>\n<pre>wget <span class=\"s2\">\"</span><span class=\"k\">$(</span>pip download ci_release_publisher <span class=\"p\">|</span> grep <span class=\"s1\">'http.*ci_release_publisher-'</span> <span class=\"p\">|</span> awk <span class=\"s1\">'{print $NF}'</span><span class=\"k\">)</span><span class=\"s2\">.asc\"</span>\ngpg --no-default-keyring --keyring <span class=\"s2\">\"</span><span class=\"nv\">$PWD</span><span class=\"s2\">/tmp_keyring.gpg\"</span> --recv-key <span class=\"s1\">'1D4E 9375 AD9B D50F 80FF  55AC 6F55 0977 4B1E F0C2'</span>\ngpg --no-default-keyring --keyring <span class=\"s2\">\"</span><span class=\"nv\">$PWD</span><span class=\"s2\">/tmp_keyring.gpg\"</span> --verify ci_release_publisher-*.asc\n<span class=\"c1\"># Read the output of the command above, you can't rely on its exit code as it's</span>\n<span class=\"c1\"># 0, i.e. success, even if the key has expired or has been revoked</span>\nrm ci_release_publisher-*.asc\nrm tmp_keyring.gpg\npip install --no-index --find-links <span class=\"s2\">\"</span><span class=\"nv\">$PWD</span><span class=\"s2\">\"</span> ci_release_publisher-*\n</pre>\n<p>Of course that won't verify any of the dependencies CI Release Publisher is using.</p>\n<p>Due to keyservers sometimes failing to reply with a key, it's suggested to verify signatures locally and rely on the hash when running on Travis-CI. This is what <a href=\"scripts/install.sh\" rel=\"nofollow\"><code>scripts/install.sh</code></a> is set to do (verifying the hash).</p>\n<h2>Usage</h2>\n<h3>Security consideration</h3>\n<p>Before using CI Release Publisher, you must consider the security implications that come with using it.</p>\n<p>In order to use CI Release Publisher, you must create a new GitHub user, make that user a collaborator in a repository you wish to publish releases to, giving the user Write/push access to the repository which is required to create releases, generate an access token for that user and store it in an environment variable on Travis-CI. All of this is needed so that the CI Release Publisher script would be able to authenticate as the user with GitHub API and create releases in the desired repository.</p>\n<p>The issue is that if the access token gets leaked, someone could use it to push code into the repository, delete/edit issue comments, push into PR branches, replace release files with malicious binaries, etc. -- do all kinds of nasty things. GitHub doesn't provide much in terms of restricting what an access token can be used for.</p>\n<p>There are primary three different ways to use CI Release Publisher based on the security risk you are willing to take:</p>\n<ul>\n<li>\n<p>Publishing to the same repository</p>\n<p>This is the same way Travis-CI's GitHub Releases deployment works. Travis-CI stores the access token for the main repository with the full write access to it. This represents the greatest security risk, since if the token is leaked, your main repository is at risk. If you already use such access token for some other Travis-CI automation -- you are already exposed to this risk.</p>\n</li>\n<li>\n<p>Publishing to a different repository</p>\n<p>Building still happens on Travis-CI of the main repository, but the build artifacts are published to a different repository. Travis-CI stores the access token with the full write access to the other repository now. This lowers the security risk considerably, since if the access token is leaked only the other repository would be affected by it, the main repository would be safe.</p>\n</li>\n<li>\n<p>Doing everything in a different repository</p>\n<p>Building happens on Travis-CI of the repository other than the main one and the build artifacts are published into the same other repository. The whole process is separate from the main repository and can be used to setup personal builds of other projects. This lowers the risk even further than just publishing to a different repository does, since it's the other repository's Travis-CI that stores the access token now, which you should be able to restrict access to better than the main repository's Travis-CI. However, since the building happens in other repository's Travis-CI, it doesn't know when git push events happen in the main repository, so you won't be able to build on every git push to the main repository, instead you would have to use Travis-CI's Cron Jobs to run a build once a day.</p>\n</li>\n</ul>\n<p>Here is a table summarizing the three ways to make releases:</p>\n<table>\n<thead>\n<tr>\n<th></th>\n<th>Same repo</th>\n<th>Different repo</th>\n<th>Separate</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Main repo access token permissions</td>\n<td>Write</td>\n<td>Read</td>\n<td>Read</td>\n</tr>\n<tr>\n<td>Different repo access token permissions</td>\n<td>-</td>\n<td>Write</td>\n<td>Write</td>\n</tr>\n<tr>\n<td>Access token stored in Travis-CI of</td>\n<td>Main repo</td>\n<td>Main repo</td>\n<td>Different repo</td>\n</tr>\n<tr>\n<td>Artifact production happens on Travis-CI of</td>\n<td>Main repo</td>\n<td>Main repo</td>\n<td>Different repo</td>\n</tr>\n<tr>\n<td>Releases can be made on every main repo push</td>\n<td>Yes</td>\n<td>Yes</td>\n<td>No</td>\n</tr></tbody></table>\n<h3>Publishing to the same repository</h3>\n<ol>\n<li>\n<p><a href=\"https://github.com/join\" rel=\"nofollow\">Create a new GitHub user</a> that will be used solely for creating releases. For security reasons, we advise that you create a separate user for every repository you want to setup releases for.</p>\n</li>\n<li>\n<p>Under that user, <a href=\"https://github.com/settings/tokens/new\" rel=\"nofollow\">create a new Personal Access Token</a> with <code>repo</code> access checked if you use <code>travis-ci.com</code> or with just <code>public_repo</code> access checked if you use <code>travis-ci.org</code>.</p>\n</li>\n<li>\n<p>On the Settings page for your repository on Travis-CI, e.g. <a href=\"https://travis-ci.org/nurupo/ci-release-publisher/settings\" rel=\"nofollow\">https://travis-ci.org/nurupo/ci-release-publisher/settings</a>, under Environment Variables, add a new environment variable with the name <code>GITHUB_ACCESS_TOKEN</code> and the access token you got off GitHub as the value. Make sure \"Display value in build log\" is unchecked when adding it. If you already use <code>GITHUB_ACCESS_TOKEN</code> for something else, you can name the variable <code>CIRP_GITHUB_ACCESS_TOKEN</code> instead.</p>\n</li>\n<li>\n<p>Invite the user as a collaborator to the repository such that the user has Write access to the repository, i.e. can push into it.</p>\n</li>\n<li>\n<p>Accept the invite as the new user.</p>\n</li>\n<li>\n<p>As the new user, log into Travis-CI, which would prompt you to authorize Travis-CI to access your GitHub information -- accept that.</p>\n</li>\n<li>\n<p>Make sure the new user can access Travis-CI page with build details for the repository.</p>\n<hr>\n<p>It's advised to create a new user per repository because <a href=\"https://blog.travis-ci.com/2016-07-07-security-advisory-encrypted-variables\" rel=\"nofollow\">there were</a> multiple <a href=\"https://blog.travis-ci.com/2017-05-08-security-advisory\" rel=\"nofollow\">security incidents</a> when GitHub access tokens stored in Travis-CI environment variables were leaked, which essentially equals to the user account the access token belongs to being compromised, as the attacker would be able to push code, publish releases, etc. into all repositories the user has access to. Creating a user per repository helps to limit the possible damage that can be done if the API key does get leaked. Note, however, that <a href=\"https://help.github.com/articles/github-terms-of-service/#3-account-requirements\" rel=\"nofollow\">GitHub ToS</a> allows you to have only one \"machine account\", creating more accounts would technically violate ToS and should be done at your own risk. To minimize the damage even more, set your GitHub repository to disallow force pushes on all branches, require all changes to go through PRs before they get merged and require PRs to be reviewed by other contributors -- that way it's less likely someone would be able to sneak malicious code change in the repository if the access token does get compromised.</p>\n<hr>\n</li>\n<li>\n<p>In your <code>.travis.yml</code>, identify jobs that produce artifacts.</p>\n<p>At the end of the <code>script</code> section of all artifact producing jobs add:</p>\n<pre><span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup1.sh</span>\n<span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/store.sh \"$TRAVIS_BUILD_DIR/artifacts\"</span>\n<span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup2.sh</span>\n</pre>\n<p>where <code>$TRAVIS_BUILD_DIR/artifacts</code> is the path where the artifacts can be found. This will store the artifacts in a temporary store release. We will download them back and delete these temporary store releases in a publishing stage later in the build.</p>\n<p>Now identify artifact producing stages. If a stage contains at least one artifact producing job, we call it an artifact producing stage. It can contain other jobs that don't produce artifacts. You can have as many artifact producing stages as you want, with as many stages that don't produce artifacts before, after and in between them as you want.</p>\n<p>At the end of <code>script</code> section of all jobs that are in artifact producing stages but don't actually produce artifacts, add:</p>\n<pre><span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup1.sh</span>\n<span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup2.sh</span>\n</pre>\n<p>This will remove the temporary store releases in case of a build failure so that they don't litter your Releases page.</p>\n<p>Find the last artifact producing stage. If you have any stages after it, you can pick any of them to add the publishing job to. If you don't have any stages after it, you can create a publishing stage with the publishing job in it. You can have only one publishing job in the entire build, it must be positioned after all the artifact producing jobs, in separate stage from artifact producing jobs. You should not put the publishing job in the same stage as an artifact producing job. Your publishing job should look like this:</p>\n<pre><span class=\"nt\">if</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">type != pull_request</span>\n<span class=\"nt\">script</span><span class=\"p\">:</span>\n  <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">export ARTIFACTS_DIR=\"$(mktemp -d)\"</span>\n  <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/collect.sh \"$ARTIFACTS_DIR\"</span>\n  <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup4.sh</span>\n  <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/publish.sh \"$ARTIFACTS_DIR\"</span>\n  <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup5.sh</span>\n</pre>\n<p>where <code>$ARTIFACTS_DIR</code> is the path where artifacts from the temporary store releases will be downloaded.</p>\n<p>Now identify all stages that don't produce artifacts between the first artifact producing stage and the publishing stage, if there are any. Add the following at the end of <code>script</code> section of those jobs:</p>\n<pre><span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup3.sh</span>\n</pre>\n<p>This will remove the temporary store releases in case of a build failure so that they don't litter your Releases page.</p>\n<p>You should add the following to your <code>.travis.yml</code> to avoid Travis-CI building the tags GitHub will be creating due to CI Release Publisher creating non-draft releases:</p>\n<pre><span class=\"nt\">branches</span><span class=\"p\">:</span>\n  <span class=\"nt\">except</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"c1\"># Do not run Travis-CI builds on tags CI Release Publisher creates as it</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"c1\"># will lead to endless (recursive?) tag creation and Travis-CI running</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">/^ci-.+$/</span>\n</pre>\n<hr>\n<p>Here is a sample <code>.travis.yml</code> before following these instructions. <code>...</code> are omitted parts and <code>env</code> is used for commenting on jobs. This is a rather extensive example, with a lot of stages and jobs, which should hopefully cover most of the cases.</p>\n<pre><span class=\"nn\">...</span>\n\n<span class=\"nt\">matrix</span><span class=\"p\">:</span>\n  <span class=\"nt\">include</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">1\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"1\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">2\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"2\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">2\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"3\" DESC=\"This job produces artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">3\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"4\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">4\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"5\" DESC=\"This job produces artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">4\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"6\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">5\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"7\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">6\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"8\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">7\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"9\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n<span class=\"nn\">...</span>\n</pre>\n<p>First, let's identify the artifact producing jobs. These are Job 3 and 5.</p>\n<p>We will add the following to the end of the <code>script</code> section of Job 3 and 5:</p>\n<pre><span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup1.sh</span>\n<span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/store.sh \"$TRAVIS_BUILD_DIR/artifacts\"</span>\n<span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup2.sh</span>\n</pre>\n<p>Since jobs 3 and 5 are artifact producing jobs, this means that the stages they are in, Stage 2 and Stage 4, are the artifact producing stages.</p>\n<p>We will add the following at the end of <code>script</code> section of all jobs in Stage 2 and 4 that are not jobs 3 and 5, that's Job 2 and 6:</p>\n<pre><span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup1.sh</span>\n<span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup2.sh</span>\n</pre>\n<p>Since Stage 4 is the last artifact producing stage, we can add the publishing job to any stage after it -- Stage 5, 6 or 7 -- or create a new publishing stage, e.g. Stage 8. For the sake of the example, let's say that we want to add the publishing job to Stage 6.</p>\n<p>We will add the following job to the existing Stage 6:</p>\n<pre><span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">6\"</span>\n  <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"8.5\" DESC=\"This is a publishing job\"</span>\n  <span class=\"nt\">if</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">type != pull_request</span>\n  <span class=\"nt\">script</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">export ARTIFACTS_DIR=\"$(mktemp -d)\"</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/collect.sh \"$ARTIFACTS_DIR\"</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup4.sh</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/publish.sh \"$ARTIFACTS_DIR\"</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup5.sh</span>\n</pre>\n<p>With Stage 2 being the first artifact producing stage and Stage 6 being the publishing stage, there are only two stages between them that are not artifact producing stages -- Stage 3 and 5.</p>\n<p>We will add the following to <code>script</code> section of all jobs in Stage 3 and 5, that's Job 4 and 7:</p>\n<pre><span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup3.sh</span>\n</pre>\n<p>Now just to add the branch exception and we are done:</p>\n<pre><span class=\"nt\">branches</span><span class=\"p\">:</span>\n  <span class=\"nt\">except</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"c1\"># Do not run Travis-CI builds on tags CI Release Publisher creates as it</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"c1\"># will lead to endless (recursive?) tag creation and Travis-CI running</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">/^ci-.+$/</span>\n</pre>\n<p>If we follow the instructions, our <code>.travis.yml</code> will change to:</p>\n<pre><span class=\"nn\">...</span>\n\n<span class=\"nt\">matrix</span><span class=\"p\">:</span>\n  <span class=\"nt\">include</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">1\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"1\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">2\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"2\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup1.sh</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup2.sh</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">2\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"3\" DESC=\"This job produces artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup1.sh</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/store.sh \"$TRAVIS_BUILD_DIR/artifacts\"</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup2.sh</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">3\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"4\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup3.sh</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">4\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"5\" DESC=\"This job produces artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup1.sh</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/store.sh \"$TRAVIS_BUILD_DIR/artifacts\"</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup2.sh</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">4\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"6\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup1.sh</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup2.sh</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">5\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"7\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup3.sh</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">6\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"8\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">6\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"8.5\" DESC=\"This is a publishing job\"</span>\n      <span class=\"nt\">if</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">type != pull_request</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">export ARTIFACTS_DIR=\"$(mktemp -d)\"</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/collect.sh \"$ARTIFACTS_DIR\"</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup4.sh</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/publish.sh \"$ARTIFACTS_DIR\"</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">.travis/cirp/cleanup5.sh</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"nt\">stage</span><span class=\"p\">:</span> <span class=\"s\">\"Stage</span><span class=\"nv\"> </span><span class=\"s\">7\"</span>\n      <span class=\"nt\">env</span><span class=\"p\">:</span> <span class=\"l l-Scalar l-Scalar-Plain\">JOB=\"9\" DESC=\"This job doesn't produce any artifacts\"</span>\n      <span class=\"nt\">script</span><span class=\"p\">:</span>\n        <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">...</span>\n\n<span class=\"nt\">branches</span><span class=\"p\">:</span>\n  <span class=\"nt\">except</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"c1\"># Do not run Travis-CI builds on tags CI Release Publisher creates as it</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"c1\"># will lead to endless (recursive?) tag creation and Travis-CI running</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">/^ci-.+$/</span>\n<span class=\"nn\">...</span>\n</pre>\n<p><code>.travis/cirp/*.sh</code> are helper scripts that you can find in the <a href=\"scripts\" rel=\"nofollow\"><code>scripts</code></a> directory.</p>\n</li>\n<li>\n<p>General dos and don'ts.</p>\n<p>Dos:</p>\n<ul>\n<li>Do use <a href=\"scripts\" rel=\"nofollow\"><code>.travis/cirp/*.sh</code></a> helper scripts, they check for some important preconditions to be met before installing all of CI Release Publisher's dependencies and calling it.</li>\n<li>Do modify <code>publish.sh</code> script to call the <code>publish</code> command with the arguments you want.</li>\n<li>Do set an appropriate <code>--latest-release-check-event-type</code> argument in the <code>publish</code> command if you are creating Latest Release and use multiple build types: push, cron, api, etc., but run CI Release Publisher only on a subset of them.</li>\n<li>Do run things between the <code>collect.sh</code> and <code>publish.sh</code> calls. For example calculate hashes of the artifacts and include them as a file in the artifacts directory for <code>publish.sh</code> to upload, or modify <code>publish.sh</code> to calculate the hashes and pass them as the release body text argument, or generate a changelog and set it as the release body text.</li>\n<li>Do modify <code>store.sh</code> script to call the <code>store</code> command with the arguments you want.</li>\n<li>Do modify <code>install.sh</code> for your needs.</li>\n<li>Do modify <code>check_precondition.sh</code> for your needs.</li>\n<li>Do use Travis-CI's <code>allow_failures</code> feature if you want to allow an artifact producing job to fail, the <code>cleanup*.sh</code> scripts will make sure that the build artifacts of these jobs are not included in the release.</li>\n<li>Do set <code>--tag-prefix</code> on all of the python script invocations in all <code>*.sh</code> scripts if you already use branch names or tag names that start with <code>ci-</code>or <code>_ci-</code> for something else, as CI Release publisher might delete them.</li>\n<li>Do set <code>--tag-prefix-incomplete-releases</code> on all of the python script invocations in all <code>*.sh</code> scripts if you have branches or tags that differ by the starting <code>_</code>, e.g. <code>&lt;name&gt;</code> and <code>_&lt;name&gt;</code>, as CI Release publisher might delete them.</li>\n</ul>\n<p>Don'ts:</p>\n<ul>\n<li>Don't modify <code>cleanup*.sh</code> scripts, especially the arguments passed to <code>cleanup</code> commands. They are the exact arguments you want to call <code>cleanup</code> commands with, changing them without having a deep understanding of why they are needed will very likely break things.</li>\n<li>Don't remove <code>cleanup*.sh</code> calls from your <code>travis.yml</code>. They are rather numerous, but they are there to minimize the littering of the Releases page with draft releases. Also, some other commands, like <code>store</code>, depend on the exact <code>cleanup</code> command to be called right before them and will misbehave if the cleanup is removed.</li>\n<li>Don't re-arrange the order in which <code>*.sh</code> scripts are called, doing so will break the logic.</li>\n</ul>\n</li>\n</ol>\n<h3>Publishing to a different repository</h3>\n<ol>\n<li>\n<p>Follow all the steps from <a href=\"#publishing-to-the-same-repository\" rel=\"nofollow\">Publishing to the same repository</a>, except that you add the access token to main repository's Travis-CI for the step 3 and invite the new user to a different, non-main, repository for the step 4.</p>\n</li>\n<li>\n<p>In addition to the <code>.travis.yml</code> modifications done in the step 8, you should set <code>CIRP_GITHUB_REPO_SLUG</code> environment variable before calling CI Release Publisher, to tell it that it should publish releases to a different repository. <code>CIRP_GITHUB_REPO_SLUG</code> should be set to <code>&lt;github-user-or-org-name&gt;/&lt;repo-name&gt;</code>, i.e. the part of repository URL with \"<a href=\"https://github.com/\" rel=\"nofollow\">https://github.com/</a>\" dropped, e.g. for <code>https://github.com/nurupo/ci-release-publisher</code> that would be <code>nurupo/ci-release-publisher</code>. Since it needs to be set every time you run CI Release Publisher, it's easier <a href=\"https://docs.travis-ci.com/user/environment-variables/#global-variables\" rel=\"nofollow\">to set it globally</a> like this:</p>\n<pre><span class=\"nt\">env</span><span class=\"p\">:</span>\n  <span class=\"nt\">global</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">CIRP_GITHUB_REPO_SLUG=\"nurupo/ci-release-publisher\"</span>\n</pre>\n</li>\n<li>\n<p>Make sure the GitHub repository you want to publish releases to has at least one commit, since GitHub releases are just constructs on top of git tags and you can't have git tags without having any commits.</p>\n</li>\n</ol>\n<p>In contrast to publishing to the same repository, CI Release Publisher doesn't set <code>target_commitish</code> to <code>$TRAVIS_COMMIT</code> in <a href=\"https://developer.github.com/v3/repos/releases/#create-a-release\" rel=\"nofollow\">the release creating GtHub API call</a> when publishing to a different repository, it leaves it empty, which means that <a href=\"https://developer.github.com/v3/repos/releases/#create-a-release\" rel=\"nofollow\">the release will be created with a tag referencing the default branch for the GitHub rpository</a>. It's done so because if you set <code>target_commitish</code> to <code>$TRAVIS_COMMIT</code>, which is the commit that was just pushed to the main repository, and such commit doesn't exist in the different repository -- GitHub API would error out since it can't create a tag for a non-existing commit. It's a fair assumption that the different repository won't be up-to-date with whatever was just pushed to the main repository. You can override this behavior by providing <code>--*target-commitish</code> arguments to CI Release Publisher's <code>store</code> and <code>publish</code> commands.</p>\n<h3>Doing everything in a different repository</h3>\n<p>The idea here is to setup a Travis-CI cron build in a different repository to run daily/weekly/monthly which will <code>git pull</code> a branch of the main repository, modify <code>.travis.yml</code> of the repository we just pulled so that it would use CI Release Publisher to create build artifacts and publish them in the current repository, and <code>git push</code> it all into some branch of the different repository. The act of pushing will start another Travis-CI build, which this time will publish releases. We don't want to publish releases in the cron build because if there are several artifact producing jobs, each doing <code>git pull</code> on the main repository, it's possible that the main repository will get new commits pushed while our build is running resulting in some jobs pulling an older history and other a newer one, so the resulting build artifacts might be of different commits. By pulling the main repository in the cron build and pushing it into a different repository's branch we guarantee that all jobs will work on the same revision of the main repository.</p>\n<ol>\n<li>\n<p>Follow the steps 1-7 in <a href=\"#publishing-to-the-same-repository\" rel=\"nofollow\">Publishing to the same repository</a>, storing the access token into the different repository's Travis-CI and inviting the new user to the different repository.</p>\n</li>\n<li>\n<p>Follow steps 8 and 9 to create <code>.travis.build.yml</code> file, which is what we will replace main repository's <code>.travis.yml</code> with.</p>\n</li>\n<li>\n<p>Create a <code>.travis.yml</code> with:</p>\n<pre><span class=\"nt\">env</span><span class=\"p\">:</span>\n  <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">MAIN_REPO_SLUG=\"nurupo/ci-release-publisher\" MAIN_REPO_BRANCH=\"master\" DIFFERENT_REPO_BRANCH=\"build\"</span>\n\n<span class=\"nt\">cache</span><span class=\"p\">:</span>\n  <span class=\"nt\">directories</span><span class=\"p\">:</span>\n    <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">/tmp/cirp</span>\n\n<span class=\"nt\">script</span><span class=\"p\">:</span>\n  <span class=\"p p-Indicator\">-</span> <span class=\"l l-Scalar l-Scalar-Plain\">./update_branch.sh</span>\n</pre>\n<p>Modify the environment variables appropriately.</p>\n<p>We use <a href=\"https://docs.travis-ci.com/user/caching/\" rel=\"nofollow\">Travis-CI's cache functionality</a> to store the hash of the latest commit we have made a release for, so that we don't create a new release next time if nothing has changed in the main repository. Of course there are cases when you want to make a new release even though nothing has changed in the main repository, e.g. when one of the dependencies updates, like OpenSSL, but this is out of scope of this example and you could expand on this caching solution to cover that.</p>\n<p>Note that <a href=\"https://docs.travis-ci.com/user/caching/#caches-expiration\" rel=\"nofollow\">Travis-CI's cache expiers in 28 days</a> for open source projects (it's longer for private projects), while it's not specified how much time passes between Travis-CI's monthly cron builds. The exact time at which Travis-CI runs cron builds is documented as implementation-defined, so Travis-CI can change it at any time, but based on some observations, it currently seems to run monthly cron builds at the exact same date and time as the first monthly cron job has ran but with a month incremented, e.g. 2019-02-19 09:00:00 -&gt; 2019-03-19 09:00:00 -&gt; 2019-04-19 09:00:00 -&gt; 2019-05-19 09:00:00. If that's the case, then at least 28 days would pass since the last run, meaning that the cache would always expire by the time the next monthly cron build runs, so you probably won't be benefiting from using the cache in your monthly cron builds.</p>\n</li>\n<li>\n<p>Create a <code>update_branch.sh</code> file, marking it as executable, with something like the following (it's likely you will want to customize this):</p>\n<pre><span class=\"ch\">#!/usr/bin/env bash</span>\n\n<span class=\"nb\">set</span> -euo pipefail\n\n<span class=\"c1\"># Put away our travis config for now</span>\ncp .travis.<span class=\"si\">${</span><span class=\"nv\">DIFFERENT_REPO_BRANCH</span><span class=\"si\">}</span>.yml ..\n\n<span class=\"c1\"># Checkout main repository's branch</span>\ngit remote rm origin\ngit remote add origin https://<span class=\"nv\">$GITHUB_ACCESS_TOKEN</span>@github.com/<span class=\"nv\">$TRAVIS_REPO_SLUG</span> &gt; /dev/null <span class=\"m\">2</span>&gt;<span class=\"p\">&amp;</span><span class=\"m\">1</span>\ngit remote add upstream https://github.com/<span class=\"nv\">$MAIN_REPO_SLUG</span> &gt; /dev/null <span class=\"m\">2</span>&gt;<span class=\"p\">&amp;</span><span class=\"m\">1</span>\ngit fetch upstream &gt; /dev/null <span class=\"m\">2</span>&gt;<span class=\"p\">&amp;</span><span class=\"m\">1</span>\ngit branch -D <span class=\"nv\">$DIFFERENT_REPO_BRANCH</span> <span class=\"o\">||</span> <span class=\"nb\">true</span>\ngit checkout -b <span class=\"nv\">$DIFFERENT_REPO_BRANCH</span> upstream/<span class=\"nv\">$MAIN_REPO_BRANCH</span>\ngit log -1\n\n<span class=\"c1\"># Don't create a new release if the main repository hasn't updated since the previous release</span>\n<span class=\"k\">if</span> <span class=\"o\">[</span> -f <span class=\"s2\">\"/tmp/cirp/previous_runs_commit\"</span> <span class=\"o\">]</span><span class=\"p\">;</span> <span class=\"k\">then</span>\n  <span class=\"k\">if</span> <span class=\"o\">[</span> <span class=\"s2\">\"</span><span class=\"k\">$(</span>cat /tmp/cirp/previous_runs_commit<span class=\"k\">)</span><span class=\"s2\">\"</span> <span class=\"o\">==</span> <span class=\"s2\">\"</span><span class=\"k\">$(</span>git rev-parse HEAD<span class=\"k\">)</span><span class=\"s2\">\"</span> <span class=\"o\">]</span><span class=\"p\">;</span> <span class=\"k\">then</span>\n    <span class=\"nb\">echo</span> <span class=\"s2\">\"The main repository hasn't been updated since the last release. Exiting.\"</span>\n    <span class=\"nb\">exit</span> <span class=\"m\">0</span>\n  <span class=\"k\">else</span>\n    <span class=\"c1\"># Main repo got new commits in it</span>\n    git rev-parse HEAD &gt; /tmp/cirp/previous_runs_commit\n  <span class=\"k\">fi</span>\n<span class=\"k\">else</span>\n  <span class=\"c1\"># Caching last commit information as it doesn't exist</span>\n  mkdir -p /tmp/cirp\n  git rev-parse HEAD &gt; /tmp/cirp/previous_runs_commit\n<span class=\"k\">fi</span>\n\n<span class=\"c1\"># Patch up the main repo's Travis-CI configuration so that it creates releases</span>\nmv ../.travis.<span class=\"si\">${</span><span class=\"nv\">DIFFERENT_REPO_BRANCH</span><span class=\"si\">}</span>.yml .travis.yml\n<span class=\"c1\"># you might want to patch more things here, perhaps add some bash scripts that</span>\n<span class=\"c1\"># .travis.${DIFFERENT_REPO_BRANCH}.yml will be calling that are not present in</span>\n<span class=\"c1\"># the main repo, apply actual patch files, sed things, etc.</span>\n\n<span class=\"c1\"># Push the changes to our branch</span>\ngit config --global user.email <span class=\"s2\">\"new-users-email@example.com\"</span>\ngit config --global user.name <span class=\"s2\">\"new-users-name\"</span>\ngit commit -am <span class=\"s2\">\"Modify upstream repo for building\"</span>\ngit push origin <span class=\"nv\">$DIFFERENT_REPO_BRANCH</span> --force &gt; /dev/null <span class=\"m\">2</span>&gt;<span class=\"p\">&amp;</span><span class=\"m\">1</span>\n</pre>\n<p>Change <code>$GITHUB_ACCESS_TOKEN</code> to <code>$CIRP_GITHUB_ACCESS_TOKEN</code> if you are using the latter, and include the access token into <code>git remote add upstream</code> command's URL if the main repository is private, otherwise we wouldn't be able to clone it. Change <code>new-users-email@example.com</code> to new user's email address and <code>new-users-name</code> to new user's name. Remove output of all commands that might leak the access token with <code>&gt; /dev/null 2&gt;&amp;1</code>, and make sure you don't expose <code>.git/config</code> anywhere, since that's where all remote URLs with access tokens in them are stored. Travis-CI has <a href=\"https://docs.travis-ci.com/user/best-practices-security/#recommendations-on-how-to-avoid-leaking-secrets-to-build-logs\" rel=\"nofollow\">documentation</a> on best practices of preventing access tokens from being leaked to build logs.</p>\n<p>Note that this simple <code>update_branch.sh</code> script won't create releases for any tags created in the main repository, but you could expand it to do so.</p>\n</li>\n<li>\n<p>Modify <code>.travis.yml</code> and <code>update_branch.sh</code> to your needs.</p>\n</li>\n<li>\n<p>Push <code>.travis.yml</code>, <code>update_branch.sh</code> and <code>.travis.build.yml</code> into the different repository.</p>\n</li>\n<li>\n<p>After you push, make sure the build gets created on Travis-CI, that it succeeds, that in turn it creates yet another build which succeeds and creates releases.</p>\n</li>\n<li>\n<p>Go to the Settings page of your repository on Travis-CI, e.g. <a href=\"https://travis-ci.org/nurupo/ci-release-publisher/settings\" rel=\"nofollow\">https://travis-ci.org/nurupo/ci-release-publisher/settings</a>, and under \"Cron Jobs\" set it to run a cron build of the branch you pushed the files to daily, weekly or monthly.</p>\n</li>\n</ol>\n<h2>Options</h2>\n<p>It's often useful to know what options a program provides before installing it, so here are options for the available commands.</p>\n<p>Note that CI Release Publisher uses <code>$TRAVIS_</code> environment variables to know which branch it's running on, whether a tag was pushed and so on, so you won't see command line arguments on specifying things CI Release Publisher can already get from the <code>$TRAVIS_</code> environment variables.\nIt also uses <code>$CIRP_</code> environment variables for API tokens and some other options.</p>\n<pre><code>$ ci-release-publisher --help\nusage: ci-release-publisher [-h] [--version] [--travis-api-url TRAVIS_API_URL]\n                            [--github-api-url GITHUB_API_URL]\n                            [--tag-prefix TAG_PREFIX]\n                            [--tag-prefix-incomplete-releases TAG_PREFIX_TMP]\n                            {store,cleanup_store,collect,publish,cleanup_publish}\n                            ...\n\nA script for publishing Travis-CI build artifacts on GitHub Releases\n\npositional arguments:\n  {store,cleanup_store,collect,publish,cleanup_publish}\n    store               Store artifacts of the current job in a draft release\n                        for the later collection by a job calling the\n                        \"publish\" command.\n    cleanup_store       Delete the releases created by the \"store\" command.\n    collect             Collect artifacts from all draft releases created by\n                        the \"store\" command during the current build in a\n                        directory.\n    publish             Publish releases with artifacts from a directory.\n    cleanup_publish     Delete incomplete releases left over by the \"publish\"\n                        command by the current and previous builds.\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --version             show program's version number and exit\n  --travis-api-url TRAVIS_API_URL\n                        Use a custom Travis-CI API URL, e.g. for self-hosted\n                        Travis-CI Enterprise instance. Should be an URL to the\n                        API endpoint, e.g. \"https://travis.example.com/api\".\n  --github-api-url GITHUB_API_URL\n                        Use a custom GitHib API URL, e.g. for self-hosted\n                        GitHub Enterprise instance. Should be an URL to the\n                        API endpoint, e.g. \"https://api.github.com\".\n  --tag-prefix TAG_PREFIX\n                        git tag prefix to use when creating releases.\n  --tag-prefix-incomplete-releases TAG_PREFIX_TMP\n                        An additional git tag prefix, on top of the existing\n                        one, to use for indicating incomplete, in-progress\n                        releases.\n</code></pre>\n<pre><code>$ ci-release-publisher store --help\nusage: ci-release-publisher store [-h] [--release-name RELEASE_NAME]\n                                  [--release-body RELEASE_BODY]\n                                  ARTIFACT_DIR\n\npositional arguments:\n  ARTIFACT_DIR          Path to a directory containing artifacts that need to\n                        be stored.\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --release-name RELEASE_NAME\n                        Release name text. If not specified a predefined text\n                        is used.\n  --release-body RELEASE_BODY\n                        Release body text. If not specified a predefined text\n                        is used.\n</code></pre>\n<pre><code>$ ci-release-publisher cleanup_store --help\nusage: ci-release-publisher cleanup_store [-h] --scope\n                                          {current-job,current-build,previous-finished-builds}\n                                          [{current-job,current-build,previous-finished-builds} ...]\n                                          --release {complete,incomplete}\n                                          [{complete,incomplete} ...]\n                                          [--on-nonallowed-failure]\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --scope {current-job,current-build,previous-finished-builds} [{current-job,current-build,previous-finished-builds} ...]\n                        Scope to cleanup.\n  --release {complete,incomplete} [{complete,incomplete} ...]\n                        Release to cleanup.\n  --on-nonallowed-failure\n                        Cleanup only if the current build has a job that both\n                        has failed and doesn't have allow_failure set on it,\n                        i.e. the current build is going to fail once the\n                        current stage finishes running.\n</code></pre>\n<pre><code>$ ci-release-publisher collect --help\nusage: ci-release-publisher collect [-h] ARTIFACT_DIR\n\npositional arguments:\n  ARTIFACT_DIR  Path to a directory where artifacts should be collected to.\n\noptional arguments:\n  -h, --help    show this help message and exit\n</code></pre>\n<pre><code>$ ci-release-publisher publish --help\nusage: ci-release-publisher publish [-h] [--latest-release]\n                                    [--latest-release-name LATEST_RELEASE_NAME]\n                                    [--latest-release-body LATEST_RELEASE_BODY]\n                                    [--latest-release-draft]\n                                    [--latest-release-prerelease]\n                                    [--latest-release-target-commitish LATEST_RELEASE_TARGET_COMMITISH]\n                                    [--latest-release-check-event-type {any,api,cron,push} [{any,api,cron,push} ...]]\n                                    [--numbered-release]\n                                    [--numbered-release-keep-count NUMBERED_RELEASE_KEEP_COUNT]\n                                    [--numbered-release-keep-time NUMBERED_RELEASE_KEEP_TIME]\n                                    [--numbered-release-name NUMBERED_RELEASE_NAME]\n                                    [--numbered-release-body NUMBERED_RELEASE_BODY]\n                                    [--numbered-release-draft]\n                                    [--numbered-release-prerelease]\n                                    [--numbered-release-target-commitish NUMBERED_RELEASE_TARGET_COMMITISH]\n                                    [--tag-release]\n                                    [--tag-release-name TAG_RELEASE_NAME]\n                                    [--tag-release-body TAG_RELEASE_BODY]\n                                    [--tag-release-draft]\n                                    [--tag-release-prerelease]\n                                    [--tag-release-target-commitish TAG_RELEASE_TARGET_COMMITISH]\n                                    [--tag-release-force-recreate]\n                                    ARTIFACT_DIR\n\npositional arguments:\n  ARTIFACT_DIR          Path to a directory containing build artifacts to\n                        publish.\n\noptional arguments:\n  -h, --help            show this help message and exit\n  --latest-release      Publish latest release. The same \"ci-&lt;branch&gt;-latest\"\n                        tag release will be re-used (re-created) by each\n                        build.\n  --latest-release-name LATEST_RELEASE_NAME\n                        Release name text. If not specified a predefined text\n                        is used.\n  --latest-release-body LATEST_RELEASE_BODY\n                        Release body text. If not specified a predefined text\n                        is used.\n  --latest-release-draft\n                        Publish as a draft.\n  --latest-release-prerelease\n                        Publish as a prerelease.\n  --latest-release-target-commitish LATEST_RELEASE_TARGET_COMMITISH\n                        Commit the release should point to. By default it's\n                        set to $TRAVIS_COMMIT when publishing to the same repo\n                        and not set when publishing to a different repo.\n  --latest-release-check-event-type {any,api,cron,push} [{any,api,cron,push} ...]\n                        Consider only builds of specific event types when\n                        checking if the current build is the latest. If not\n                        specified, \"any\" is used.\n  --numbered-release    Publish a numbered release. A separate\n                        \"ci-&lt;branch&gt;-&lt;build_number&gt;\" release will be made for\n                        each build. You must specify at least one of\n                        --numbered-release-keep-* arguments specifying the\n                        strategy for keeping numbered builds.\n  --numbered-release-keep-count NUMBERED_RELEASE_KEEP_COUNT\n                        Number of numbered releases to keep. If set to 0, this\n                        check is disabled, otherwise if the number of numbered\n                        releases exceeds that number, the oldest numbered\n                        release will be deleted. Note that due to a race\n                        condition of several Travis-CI builds running at the\n                        same time, although unlikely, it's possible for the\n                        number of kept numbered releases to exceed that number\n                        by the number of concurrent Travis-CI builds running.\n  --numbered-release-keep-time NUMBERED_RELEASE_KEEP_TIME\n                        How long to keep the numbered releases for, in\n                        seconds. If set to 0, this check is disabled,\n                        otherwise all numbered releases that are older than\n                        the specified amount of seconds will be deleted.\n  --numbered-release-name NUMBERED_RELEASE_NAME\n                        Release name text. If not specified a predefined text\n                        is used.\n  --numbered-release-body NUMBERED_RELEASE_BODY\n                        Release body text. If not specified a predefined text\n                        is used.\n  --numbered-release-draft\n                        Publish as a draft.\n  --numbered-release-prerelease\n                        Publish as a prerelease.\n  --numbered-release-target-commitish NUMBERED_RELEASE_TARGET_COMMITISH\n                        Commit the release should point to. By default it's\n                        set to $TRAVIS_COMMIT when publishing to the same repo\n                        and not set when publishing to a different repo.\n  --tag-release         Publish a release for a pushed tag. A separate \"&lt;tag&gt;\"\n                        release will be made whenever a tag is pushed.\n  --tag-release-name TAG_RELEASE_NAME\n                        Release name text. If not specified a predefined text\n                        is used.\n  --tag-release-body TAG_RELEASE_BODY\n                        Release body text. If not specified a predefined text\n                        is used.\n  --tag-release-draft   Publish as a draft.\n  --tag-release-prerelease\n                        Publish as a prerelease.\n  --tag-release-target-commitish TAG_RELEASE_TARGET_COMMITISH\n                        Commit the release should point to. By default it's\n                        set to $TRAVIS_COMMIT when publishing to the same repo\n                        and not set when publishing to a different repo.\n  --tag-release-force-recreate\n                        Force recreation of the release if it already exists.\n                        DANGER. You almost never want to enable this option.\n                        When enabled, your existing tag release will be\n                        deleted, all of its text and artifacts will be forever\n                        lost, and a new tag release will be created based on\n                        this build. Note that by enabling this, someone might\n                        accidentally (or not) restart a tag release build on\n                        Travis-CI, causing the release to be recreated. You\n                        have been warned.\n</code></pre>\n<pre><code>$ ci-release-publisher cleanup_publish --help\nusage: ci-release-publisher cleanup_publish [-h]\n\noptional arguments:\n  -h, --help  show this help message and exit\n</code></pre>\n<h2>Troubleshooting</h2>\n<p>In order to prevent GitHub access token from being leaked, CI Release Publisher catches all exceptions and prints out only the exception type and message, avoiding printing out the stack trace, as the access token is often passed as a function argument and might show up in the stack trace. Travis-CI does replace environment variable values with <code>[secure]</code> in its logs, so it's mostly a precaution in case Python prints them encoded one way or another. Although a good security measure, it also means that you don't know where exactly in the code exceptions are coming from. Luckily there are just a few common exceptions that happen when using CI Release Publisher incorrectly, most of which have to do with using the wrong API endpoint for either GitHub or Travis-CI, incorrect GitHub access token or an access token with insufficient permissions set. This section tries to document those exceptions based on just exception type and message.</p>\n<h3><code>JSONDecodeError</code></h3>\n<p>If you are getting:</p>\n<pre><code>JSONDecodeError: Expecting value: line 1 column 1 (char 0)\n</code></pre>\n<p>it's likely that Travis-CI can't authenticate CI Release Publisher using the GitHub access token provided. Make sure you have set the right scope on the access token, e.g. <code>repo</code> for Travis-CI on <code>.com</code> and <code>public_repo</code> for Travis-CI on <code>.org</code>, and that you have logged into Travis-CI web interface at least once as the GitHub user whose access token you are using, authorizing Travis-CI to access that user's GitHub account, so that Travis-CI would create an account for the GitHub user.</p>\n<p>If you have access to <code>$GITHUB_ACCESS_TOKEN</code> locally on your machine, you can test Travis-CI authentication with GitHub access token using this cURL command:</p>\n<pre>curl -v -X POST <span class=\"se\">\\</span>\n-H <span class=\"s2\">\"Accept: application/vnd.travis-ci.2.1+json\"</span> <span class=\"se\">\\</span>\n-d <span class=\"s1\">'github_token=$GITHUB_ACCESS_TOKEN'</span> <span class=\"se\">\\</span>\n<span class=\"s1\">'https://api.travis-ci.org/auth/github'</span>\n</pre>\n<p>You want to see a 2xx HTTP code and a Travis-CI access token as a payload in the reply. Again, run this curl command locally, don't run it on Travis-CI as it might reveal <code>$GITHUB_ACCESS_TOKEN</code> and it will reveal your Travis-CI access token on success.</p>\n<h3><code>RetryError</code></h3>\n<p>If you are getting:</p>\n<pre><code>RetryError: HTTPSConnectionPool(host='api.travis-ci.com', port=443): Max retries exceeded with url: /auth/github?github_token=[secure] (Caused by ResponseError('too many 403 error responses'))\n</code></pre>\n<p>it's likely that Travis-CI can't authenticate CI Release Publisher using the GitHub access token provided due to GitHub rate limiting Travis-CI. A workaround is to set <code>CIRP_TRAVIS_ACCESS_TOKEN</code> environment variable to the <a href=\"https://travis-ci.org/account/preferences\" rel=\"nofollow\">new GitHub user's Travis-CI API token</a>, then CI Release Publisher will avoid calling this problematic API endpoint altogether.</p>\n<h3><code>BadCredentialsException</code></h3>\n<p>If you are getting:</p>\n<pre><code>BadCredentialsException: 401 {'message': 'Bad credentials', 'documentation_url': 'https://developer.github.com/v3'}\n</code></pre>\n<p>then it means that the GitHub access token you provided doesn't have enough permissions to create releases in the target GitHub repository. Make sure you have invited the new user to the repository, the new user has accepted the invitation and they have been granted the full write access to it.</p>\n<h2>Projects using CI Release Publisher</h2>\n<table>\n<thead>\n<tr>\n<th>Project</th>\n<th>Comment</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><a href=\"https://github.com/nurupo/vlc-pause-click-plugin\" rel=\"nofollow\">vlc-pause-click-plugin</a></td>\n<td><a href=\"https://github.com/nurupo/vlc-pause-click-plugin-nightly-builds/releases\" rel=\"nofollow\">Publishes to a different repo</a>.</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/qTox/qTox\" rel=\"nofollow\">qTox</a></td>\n<td><a href=\"https://github.com/qTox/qTox-nightly-releases/releases\" rel=\"nofollow\">Publishes to a different repo</a>.</td>\n</tr></tbody></table>\n<p>Feel free to open an issue requesting to add your project to the list.</p>\n<h2>License</h2>\n<p>MIT</p>\n\n          </div>"}, "last_serial": 6684548, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "2d93c44dd3612012119da9bbc51de655", "sha256": "384bd9e2b0dd344381c01948e567bb26151636d6fd9b70fc58ef94aeb6be9466"}, "downloads": -1, "filename": "ci_release_publisher-0.1.0-py3-none-any.whl", "has_sig": true, "md5_digest": "2d93c44dd3612012119da9bbc51de655", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 37844, "upload_time": "2019-05-30T02:58:36", "upload_time_iso_8601": "2019-05-30T02:58:36.172160Z", "url": "https://files.pythonhosted.org/packages/03/e9/b57c3e5d846a0bf5df5a420104cd3b4c752d360f11795b52236375e9dfb8/ci_release_publisher-0.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7191dcd8dbab123a8b2d7b327c21e73a", "sha256": "cfac81d6123906fd9127172199449ba7c217746311b9149c0d717decf561e90c"}, "downloads": -1, "filename": "ci_release_publisher-0.1.0.tar.gz", "has_sig": true, "md5_digest": "7191dcd8dbab123a8b2d7b327c21e73a", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 64442, "upload_time": "2019-05-30T02:58:38", "upload_time_iso_8601": "2019-05-30T02:58:38.525716Z", "url": "https://files.pythonhosted.org/packages/75/c1/2992e8443fc5d830a0aed6c7cb7f974ef9e5bd55c3c94ed03274b26494ac/ci_release_publisher-0.1.0.tar.gz", "yanked": false}], "0.1.0rc1": [{"comment_text": "", "digests": {"md5": "f8725dc85fbdd04ad5207918180503fa", "sha256": "5a7f0ad6ccfb6017974db42fb1ecfe8b3f9cc1c16ac68107a94979252baa16e3"}, "downloads": -1, "filename": "ci_release_publisher-0.1.0rc1-py3-none-any.whl", "has_sig": true, "md5_digest": "f8725dc85fbdd04ad5207918180503fa", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 38108, "upload_time": "2019-05-25T10:17:35", "upload_time_iso_8601": "2019-05-25T10:17:35.548868Z", "url": "https://files.pythonhosted.org/packages/68/b4/09a9cb93342d211f35544b5d817f9b5fd579de5745ba8ec87fe4ef5634c4/ci_release_publisher-0.1.0rc1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a653dae32c01e7505b9dc01638eca97f", "sha256": "4ac23988d33ee47d1697b7f18b486b8930101ac2f9da1cd3344c8c7679bb8b22"}, "downloads": -1, "filename": "ci_release_publisher-0.1.0rc1.tar.gz", "has_sig": true, "md5_digest": "a653dae32c01e7505b9dc01638eca97f", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 63761, "upload_time": "2019-05-25T10:17:38", "upload_time_iso_8601": "2019-05-25T10:17:38.383236Z", "url": "https://files.pythonhosted.org/packages/e7/83/67950b3690d876a2d3571ba4199e0f56aa2e4d4534f6c0ccc7753f833d35/ci_release_publisher-0.1.0rc1.tar.gz", "yanked": false}], "0.2.0": [{"comment_text": "", "digests": {"md5": "d6ce20df230ce9d317e86b6958320294", "sha256": "da7f139e90c57fb64ed2eb83c883ad6434d7c0598c843f7be7b572377bed4bc4"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0-py3-none-any.whl", "has_sig": true, "md5_digest": "d6ce20df230ce9d317e86b6958320294", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 39293, "upload_time": "2020-02-23T16:40:07", "upload_time_iso_8601": "2020-02-23T16:40:07.500027Z", "url": "https://files.pythonhosted.org/packages/c2/66/208843a01f44cb53bb7aa643d2d8b5c103a135cb0724e6fa02ddcb258c64/ci_release_publisher-0.2.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a59b8a790de1777cb187c709774bad9b", "sha256": "e8e1e000b71ad6cd3a4730787d3cb11190d8b2deb974640a87fb980294feffa6"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0.tar.gz", "has_sig": true, "md5_digest": "a59b8a790de1777cb187c709774bad9b", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 67096, "upload_time": "2020-02-23T16:40:09", "upload_time_iso_8601": "2020-02-23T16:40:09.196188Z", "url": "https://files.pythonhosted.org/packages/98/4f/b67b4ca4daecfbf9b2bbf78d6bd9e218b3752ac27d332f024a56d3e6b4f8/ci_release_publisher-0.2.0.tar.gz", "yanked": false}], "0.2.0a1": [{"comment_text": "", "digests": {"md5": "8a2add140ef669424672f2eb47397c9b", "sha256": "bbf821a90ff6bb537b76ca629ee1f4f64c2f785550ac09ad715a97234c481ccd"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0a1-py3-none-any.whl", "has_sig": true, "md5_digest": "8a2add140ef669424672f2eb47397c9b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 38773, "upload_time": "2019-07-22T13:48:54", "upload_time_iso_8601": "2019-07-22T13:48:54.584374Z", "url": "https://files.pythonhosted.org/packages/3a/f3/74dd7617b70ee7e49a816a3a535755605390cbecf62161854dd29160dc7c/ci_release_publisher-0.2.0a1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b7b429ca8b19e54f34bc1a1c97a4b631", "sha256": "e3641c378b6dd07f8919c023b35c16f926b1aa4a9f582c33770628063f8861c0"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0a1.tar.gz", "has_sig": true, "md5_digest": "b7b429ca8b19e54f34bc1a1c97a4b631", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 65648, "upload_time": "2019-07-22T13:48:56", "upload_time_iso_8601": "2019-07-22T13:48:56.736906Z", "url": "https://files.pythonhosted.org/packages/73/ea/7f22df4c6374d49b4eccd1c75514306b34ae81ac26bddf93ee4bc9cb30da/ci_release_publisher-0.2.0a1.tar.gz", "yanked": false}], "0.2.0a2": [{"comment_text": "", "digests": {"md5": "6771adbb4653de1648d4a8f7133f3338", "sha256": "e8e1c6ea761d8a156037b5f922817619a6c4005a9ca4f7497e667e61246efcc1"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0a2-py3-none-any.whl", "has_sig": true, "md5_digest": "6771adbb4653de1648d4a8f7133f3338", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 38772, "upload_time": "2019-07-23T07:20:35", "upload_time_iso_8601": "2019-07-23T07:20:35.362178Z", "url": "https://files.pythonhosted.org/packages/b4/53/24b302f8396bcc06163a8b5242aea375aebc31f9e7ec1241717465e3e58c/ci_release_publisher-0.2.0a2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "de40930a2591bc2419d028c475823cc8", "sha256": "d337c5f5037ebdf8d835ccd202b33121dfb3d6d022eac5dae0895c6837cec92f"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0a2.tar.gz", "has_sig": true, "md5_digest": "de40930a2591bc2419d028c475823cc8", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 65665, "upload_time": "2019-07-23T07:20:38", "upload_time_iso_8601": "2019-07-23T07:20:38.243888Z", "url": "https://files.pythonhosted.org/packages/7c/00/d14cfb07d2ac7eaa3467db6eb7398c021c35cecd52977c5c07303034ef76/ci_release_publisher-0.2.0a2.tar.gz", "yanked": false}], "0.2.0a3": [{"comment_text": "", "digests": {"md5": "b152be7c67a99fa43c8677c642f32267", "sha256": "399d0c645ea115d72c646c87e3b4094af04018c5bcb6a95abed4c09cdeec8bd3"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0a3-py3-none-any.whl", "has_sig": true, "md5_digest": "b152be7c67a99fa43c8677c642f32267", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 38790, "upload_time": "2019-07-23T09:11:17", "upload_time_iso_8601": "2019-07-23T09:11:17.906279Z", "url": "https://files.pythonhosted.org/packages/27/2e/ecf74b4edb23bd5db6a4daf67446e91ed1feefddb4790069aaead7033d95/ci_release_publisher-0.2.0a3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "38a6051e072129c425f76fd8b9449974", "sha256": "48c971d574ca6ff8c45e85e6960275cf6ec87ae1358160b5e8c3bd3ee839856e"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0a3.tar.gz", "has_sig": true, "md5_digest": "38a6051e072129c425f76fd8b9449974", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 65669, "upload_time": "2019-07-23T09:11:20", "upload_time_iso_8601": "2019-07-23T09:11:20.267646Z", "url": "https://files.pythonhosted.org/packages/a2/6e/94f63c997e3e2d8660ac0c443d7a30a6b4f9416578172b46730b78337a6c/ci_release_publisher-0.2.0a3.tar.gz", "yanked": false}], "0.2.0a4": [{"comment_text": "", "digests": {"md5": "358f120f485f196087a7b126966a3cc8", "sha256": "0d5dff991bad83b2f06bfac8fa5ddd4b9789a076950adc15eb3838a7665bf964"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0a4-py3-none-any.whl", "has_sig": true, "md5_digest": "358f120f485f196087a7b126966a3cc8", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 39181, "upload_time": "2019-09-12T10:09:30", "upload_time_iso_8601": "2019-09-12T10:09:30.588700Z", "url": "https://files.pythonhosted.org/packages/7f/d8/3243a9017c4e1d7234fe0e4bb0da11f733188a8ce4a03dde9b99f42b3232/ci_release_publisher-0.2.0a4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ea356da129f23ef5420d59f5fb98f90b", "sha256": "430d7912fe8bf9f918d294a8f028f70fcf43f5ed4ed29b5b74f2fd9b51450c4e"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0a4.tar.gz", "has_sig": true, "md5_digest": "ea356da129f23ef5420d59f5fb98f90b", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 66583, "upload_time": "2019-09-12T10:09:32", "upload_time_iso_8601": "2019-09-12T10:09:32.433550Z", "url": "https://files.pythonhosted.org/packages/e6/ef/7dad214a0cdcf1b22428aad0b49f183c43e5c52077a97df914b59666490b/ci_release_publisher-0.2.0a4.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "d6ce20df230ce9d317e86b6958320294", "sha256": "da7f139e90c57fb64ed2eb83c883ad6434d7c0598c843f7be7b572377bed4bc4"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0-py3-none-any.whl", "has_sig": true, "md5_digest": "d6ce20df230ce9d317e86b6958320294", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 39293, "upload_time": "2020-02-23T16:40:07", "upload_time_iso_8601": "2020-02-23T16:40:07.500027Z", "url": "https://files.pythonhosted.org/packages/c2/66/208843a01f44cb53bb7aa643d2d8b5c103a135cb0724e6fa02ddcb258c64/ci_release_publisher-0.2.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a59b8a790de1777cb187c709774bad9b", "sha256": "e8e1e000b71ad6cd3a4730787d3cb11190d8b2deb974640a87fb980294feffa6"}, "downloads": -1, "filename": "ci_release_publisher-0.2.0.tar.gz", "has_sig": true, "md5_digest": "a59b8a790de1777cb187c709774bad9b", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 67096, "upload_time": "2020-02-23T16:40:09", "upload_time_iso_8601": "2020-02-23T16:40:09.196188Z", "url": "https://files.pythonhosted.org/packages/98/4f/b67b4ca4daecfbf9b2bbf78d6bd9e218b3752ac27d332f024a56d3e6b4f8/ci_release_publisher-0.2.0.tar.gz", "yanked": false}], "timestamp": "Thu May  7 22:19:19 2020"}