{"info": {"author": "Thierry Benita - atReal", "author_email": "contact@atreal.net", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "License :: OSI Approved :: Zope Public License", "Programming Language :: Python"], "description": "Zope External Editor\n====================\n\nIntroduction\n------------\n\n  The Zope External Editor is a new way to integrate Zope more seamlessly with\n  client-side tools. It has the following features:\n    \n  - Edit objects locally, directly from the ZMI or from your web application.\n  \n  - Works with any graphical editor application that can open a file from the \n    command line, including: emacs, gvim, xemacs, nedit, gimp, openoffice.org,\n    MS Office, Photoshop, etc.\n\n  - Automatically saves changes back to Zope without ending the editing session.\n\n  - Associate any client-side editor application with any Zope object by\n    meta-type or content-type. Both text and binary object content can be\n    edited.\n\n  - Locks objects while they are being edited. Automatically unlocks them when\n    the editing session ends.\n\n  - Can add file extensions automatically to improve syntax highlighting or \n    file type detection.\n  \n  - Works with basic auth, cookie auth and Zope versions. Credentials are\n    automatically passed down to the helper application. No need to\n    reauthenticate.\n    \n  - https support (Openssl required)\n  \n  - proxy support (might fail with some proxies ; contact us if you get\n    an issue)\n  \nUsing It\n--------\n\n    Use of the application is about as easy as using the ZMI once your browser\n    is configured (see the installation instructions). To edit an object\n    externally, just click on the pencil icon next to the object in the ZMI,\n    or on the specific direct edit action in your application.\n    The object will be downloaded and opened using the editor application you\n    have chosen (you will be prompted the first time to choose an editor). \n\n    You edit the object just like any other file. When you save the changes in\n    your editor, they are automatically uploaded back to Zope in the\n    background. While the object is open in your editor, it is locked in Zope\n    to prevent concurrent editing. When you end your editing session (ie you\n    close your editor) the object is unlocked.\n\nHow it Works\n------------\n  \n    Ok, so this all sounds a bit too good to be true, no? So how the heck does\n    it work anyway? First I'll give you a block diagram::\n    \n      +------------+     +------------+     +---------+        +------+\n      | Editor App | <-- | Helper App | <-- | Browser | <-/ /- | Zope |\n      +------------+     +------------+     +---------+        +------+\n                  ^       ^     ^                                ^\n                   \\     /       \\                              /\n                    v   v         -----------------------/ /----\n                   -------\n                  / Local \\\n                  \\  File /\n                   -------\n                   \n    Now the key to getting this to work is solving the problem that the editor\n    cannot know about Zope, and must only deal with local files. Also, there is\n    no standard way to communication with editors, so the only communication\n    channel can be the local file which contains the object's content or code.\n    \n    It is trivial to get the browser to fire up your editor when you download\n    a particular type of data with your browser. But that does you little good,\n    since the browser no longer involves itself once the data is downloaded. It\n    just creates a temp file and fires off the registered application, passing\n    it the file path. Once the editor is running, it is only aware of the local\n    file, and has no concept of where it originated from.\n    \n    To solve this problem, we have developed a helper application whose job is\n    essentially two-fold:\n    \n    - Determine the correct editor to launch for a given Zope object\n    \n    - Get the data back into Zope when the changes are saved\n\n    So, let's take a step by step look at how it works:\n\n    1. You click on the external editor link (the pencil icon) in the Zope \n       management interface (This might be a special action).\n       \n    2. The product code on the server creates a response that encapsulates the\n       necessary meta-data (URL, meta-type, content-type, cookies, etc) and the\n       content of the Zope object, which can be text or binary data. The\n       response has the contrived content-type \"application/x-zope-edit\" and\n       the file extension \".zem\".\n\n    3. The browser receives the request, and finds our helper application\n       registered for \"application/x-zope-edit\" or the extension \".zem\".\n       It saves the response data locally to disk and spawns the helper app\n       to process it.\n\n    4. The helper app, reads its config file and the response data file. The\n       meta-data from the file is parsed and the content is copied to a new\n       temporary file. The appropriate editor program is determined based on\n       the data file and the configuration.\n       \n    5. The editor is launched as a sub-process of the helper app, passing it the\n       file containing the content data.\n       \n    6. If so configured, the helper app sends a WebDAV lock request back to Zope\n       to lock the object.\n       \n    7. Every so often (if so configured), the helper app stats the content file\n       to see if it has been changed. If so, it sends an HTTP PUT request\n       back to Zope containing the new data.\n       \n    8. When the editor is closed, the content file is checked one more time and\n       uploaded if it has changed. Then a WebDAV unlock request is sent to Zope.\n       \n    9. The helper application exits.\n    \nConfiguration\n-------------\n  \n    The helper application supports several configuration options, each of\n    which can be triggered in any combination of object meta-type, content-type\n    or domain. This allows you to create appropriate behavior for different\n    types of Zope objects and content or even different servers. The\n    configuration file is stored in the file  \"~/.zope-external-edit\" (Unix) or\n    \"~\\ZopeEdit.ini\" (Windows). If no configuration file is found when the\n    helper application starts, a default config file is created in your home\n    directory.\n\n    The configuration file follows the standard Python ConfigParser format,\n    which is pretty much like the old .ini file format from windows. The file\n    consists of sections and options in the following format::\n\n      [section 1]\n      option1 = value\n      option2 = value\n\n      [section 2]\n      ...\n    \n    Options\n    \n      The available options for all sections of the config file are:\n\n      editor -- Command line or plugin name used to invoke the editor\n      application. On Windows, if no editor setting is found for an object you\n      edit, the helper app will search the file type registry for an\n      appropriate editor based on the content-type or file extension of the\n      object (which can be specified using the extension option below). By\n      default, the file path of the local file being edited is appended to\n      this command line. To insert the file path in the middle of your\n      command, use \"$1\" for Unix and \"%1\" for Windows respectively.\n\n      save_interval -- (float) The interval in seconds that the helper \n      application checks the edited file for changes.\n\n      use_locks -- (1 or 0) Whether to use WebDAV locking. The user editing must\n      have the proper WebDAV related permissions for this to work.\n      \n      always_borrow_locks -- (1 or 0) When use_locks is enabled this features\n      suppresses warnings when trying to edit an object you have already locked.\n      When enabled, external editor will always \"borrow\" the existing lock token\n      instead of doing the locking itself. This is useful when using CMFStaging\n      for instance. If omitted, this option defaults to 0.\n\n      cleanup_files -- (1 or 0) Whether to delete the temp files created.\n      WARNING the temp file coming from the browser contains authentication\n      information and therefore setting this to 0 is a security risk,\n      especially on shared machines. If set to 1, that file is deleted at the\n      earliest opportunity, before the editor is even spawned. Set to 0 for\n      debugging only.\n\n      extension -- (text) The file extension to add to the content file. Allows\n      better handling of images and can improve syntax highlighting.\n\n      temp_dir -- (path) Path to store local copies of object data being\n      edited. Defaults to operating system temp directory. *Note: this setting\n      has no apparent effect on Windows* 8^(\n      \n      long_file_name -- (1 or 0) Whether to include the whole path to the \n      object including the hostname in the file name (the default) or just the\n      id of the object being edited. Turn this option off for shorter file\n      names in your editors, and for editors that don't like long names.\n\n      file_name_separator -- (string) Character or characters used to separate\n      path elements in long files names used by external editor. Defaults to\n      a comma (,). This must be a legal character for use in file names on\n      your platorm (i.e., don't use a path separator character!). This option\n      is ignored if 'long_file_name' is set to 0.\n\n    Sections\n    \n      The sections of the configuration file specify the types of objects and\n      content that the options beneath them apply to.\n      \n      There is only one mandatory section '[general]', which should define all\n      of the above options that do not have a default value. If no other\n      section defines an option for a given object, the general settings are\n      used.\n\n      Additional sections can apply to a particular domain, content-type or\n      meta-type. Since objects can have all these properties, the options are\n      applied in this order of precedence.\n\n      - '[content-type:text/html]' -- Options by whole content-type come first\n      \n      - '[content-type:text/\\*]' -- Options by major content-type come second.\n      \n      - '[meta-type:File]' -- Options by Zope meta-type are third.\n\n      - '[domain:www.mydomain.com]' -- Options by domain follow. Several\n        sections can be added for each domain level if desired.\n      \n      - '[general]' -- General options are last.\n      \n      This scheme allows you to specify an extension by content-type, the\n      editor by meta-type, the locking settings by domain and the remaining \n      options under general for a given object.\n      \n  Editor Plugins\n\n    For tighter client-side integration, external editor has a plugin system\n    that allows it to interact directly with supported applications.\n\n    On Windows this generally means using COM to invoke the application, open\n    the content file and wait for the user to save and close the file. Because\n    each application has different remote scripting capabilities and APIs,\n    editor specific plugins must be written tailored to each supported\n    application and platform.\n\n    This system allows external editor to efficiently connect to running\n    applications without relaunching them and therefore fully support MDI \n    environments. The following applications currently have plugin support::\n\n      Application       Platform    Plugin Module Name(s)\n      ===================================================\n      HomeSite          Windows     homesite5, homesite\n      Dreamweaver       Windows     dreamweaver\t\n\n    External editor will attempt to load a plugin for any application before\n    using the general editor control method. It does this by matching the\n    name of the application executable file (sans extension) in the editor\n    command line with the available plugins. \n\n    Because plugins do not require the path of the editor application to work,\n    you can simply specify the plugin module name for your editor in the\n    configuration file if desired. For example, to specify Photoshop for all\n    image files, use add the following section to your config file\n    (ZopeEdit.ini on Windows)::\n\n      [content-type:image/*]\n      editor=photoshop\n\n    This is only a shortcut and specifying the full application path will\n    still use the plugin where possible.\n\n    Plugin Notes\n\n      Photoshop -- Photoshop's COM API is quite limited, and external editor\n      cannot detect that you have closed a file until you exit the entire\n      application (it can still detect saves). Therefore you may want to turn \n      off DAV locking (use_locks=0) or borrow locks (always_borrow_locks=1)\n      when using it.\n\n      Dreamweaver -- External editor cannot detect when you have finished \n      editing a single file. Objects edited with Dreamweaver will remain\n      locked on the server until you exit the application. As with Photoshop\n      above, you may want to turn off locking for Dreamweaver.\n\n      If your favorite editor needs a plugin because the general support is\n      not good enough, please let me know. Keep in mind that I must be able to\n      run a copy of the application in order to develop a plugin for it. So, \n      unless the application is free, or a full demo is available for download\n      I won't be able to help much. Plugins are not difficult to write, and I\n      encourage you to write one for your favorite editor, start by reading\n      one of the existing ones. I am happy to include third-party plugins with\n      the distribution.\n    \n  Permissions\n  \n    External editing is governed by the permission \"Use external editor\".\n    Users with this permission can launch external editor from editable\n    objects. In order to save changes, users will need additional permissions\n    appropriate for the objects they are editing.\n    \n    If users wish to use the built-in locking support, they must have the\n    \"WebDAV access\", \"WebDAV Lock items\" and \"WebDAV Unlock items\" permissions\n    for the objects they are editing.\n    \n    If these permissions are not set in Zope, then the helper application will\n    receive unauthorized errors from Zope which it will present to the user.\n      \n  Integrating with External Editor\n  \n    The external editor product in zope installs a globally available object\n    that can format objects accessible through FTP/DAV for use by the helper\n    application. You can take advantage of this functionality easily in your\n    own content management applications.\n    \n    Say you have an FTP editable object, \"document\", in a Zope folder named\n    \"my_stuff\". The URL to view the object would be::\n    \n      http://zopeserver/my_stuff/document\n      \n    The URL to kick off the external editor on this document would be::\n    \n      http://zopeserver/my_stuff/externalEdit_/document\n      \n    Now, this may look a bit odd to you if you are used to tacking views on to\n    the end of the URL. Because '\\externalEdit_' is required to work on Python\n    Scripts and Page Templates, which swallow the remaining path segments on\n    the URL following themselves, you must put the call to '\\externalEdit_'\n    *directly before* the object to be edited. You could do this in ZPT using\n    some TAL in a Page Template like::\n\n      <a href='edit' \n         attributes='href\n         string:${here/aq_parent/absolute_url}/externalEdit_/${here/getId}'>\n         Edit Locally\n      </a>\n      \n    As an alternative, you can also pass the path the object you want to edit\n    directly to the \\externalEdit_ object when you call its index_html method.\n    It can be called either directly by URL or from a python script.\n    \\externalEdit_ will return the proper response data for the object to edit.\n    Here are some examples::\n\n      http://zopeserver/externalEdit_?path=/my_stuff/document\n      \n      return context.externalEdit_.index_html(\n          context.REQUEST, context.RESPONSE, path='/my_stuff/document')\n\n    When integrating External Editor with a CMS that already uses DAV\n    locks, it will, by default allow users to borrow locks made on the server\n    after displaying a confirmation dialog box. Although you can make this\n    automatic by specifying 'always_borrow_locks = 1' in the External Editor\n    config file, it may be desireable to make this the default behavior when\n    using that server. To facilitate this, you can specify that locks \n    should be automatically borrowed in the URL (New in 0.7)::\n\n      http://zopeserver/my_stuff/externalEdit_/document?borrow_lock=1\n      \n    External Editor also defines a global method that you can call to insert\n    pencil icon links for appropriate objects. The method automatically checks\n    if the object supports external editing and whether the user has the \"Use\n    external editor\" permission for that object. If both are true, it returns\n    the HTML code to insert the external editor icon link. Otherwise it returns\n    an empty string.\n\n    The method is '\\externalEditLink_(object)'. The object argument is the\n    object to create the link for if appropriate. Here is some example page\n    template code that inserts links to objects in the current folder and the\n    external editor icon where appropriate::\n\n      <div tal:repeat=\"object here/objectValues\">\n        <a href=\"#\" \n           tal:attributes=\"href object/absolute_url\"\n           tal:content=\"object/title_or_id\">Object Title</a>\n        <span tal:replace=\"structure python:here.externalEditLink_(object)\" />\n      </div>       \n\nConclusion\n----------\n  \n    I hope you enjoy using this software. If you have any comments, suggestions\n    or would like to report a bug, send an email to this version maintainer:\n    \n      Thierry Benita\n      \n      contact@atreal.net\n\n      http://www.atreal.net\n\n\nSpecial thanks for their help and contributions\n-----------------------------------------------\n\n      * Wayne Glover - excellent texting and reports makes ZopeEdit go ahead !\n\n      * Alexandre Gouraud - contributor of the Digest authentification method\n\nAuthors\n---------\n\n(c) 2010, Thierry Benita, Jean-Nicolas Bes, atReal, Casey Duncan, contributors atReal and Zope Corporation. All rights reserved.\n\nChangelog\n=========\n\n01/03/2011 - 1.0.0\n------------------\n\n    - new linux debian/ubuntu packaging\n    - better user experience : less but more explicit messages \n    - translated in English / French / Spanish (contribs welcome !)\n    - the config file allows multiple editors for a given mimetype : \n      the first one that is available is used\n    - the users's configuration file is stored in :\n      .config/collective.zopeedit (Linux) \n      Application Data\\collective.zopeedit (Windows)\n    - all options have default values\n    - automatic application detection based on the desktop environment (Linux)\n    - new icon (Windows, Linux)\n    - MS VCRedist in included into the windows package\n    - libreoffice support\n    - locks management improvements\n    - new default values make ZopeEdit faster\n\n29/11/2010 - 0.12.7\n-------------------\n\n    - install from egg\n    - disable automatic proxy detection by default as it may have side effects\n      when a proxy can't handle the request while a direct connexion is ok\n\n19/11/2010 - 0.12.6\n-------------------\n\n    - more debug messages in zopeRequest for proxy connection\n\n17/11/2010 - 0.12.5\n-------------------\n\n    - automatic proxy detection => all OS !\n    - integration of new metadata received from server\n    - more logs in zopeRequest\n    - more debug logs\n    - log level debug by default\n\n17/11/2010 - 0.12.4\n-------------------\n\n    - update man page\n    - remove useless plugins\n    - coding rules / cleanup\n    - add lock file detection support for gvim\n    - remove calls to os.spawnvp (deprecated)\n\n10/11/2010 - 0.12.3\n-------------------\n\n    - add pythonwin windows libs\n\n10/11/2010 - 0.12.2\n-------------------\n\n    - fix bug related to proxy + ssl starting from python2.5\n    - remove libs that are included in MS Redistributable : it seems that they\n      are useless when redistributable is installed, and they can't avoid\n      installing redistributable\n\n09/11/2010 - 0.12.1\n-------------------\n\n    - switch to python 2.6 for windows\n    - bugfix in gettext initialization\n    - encode the file's title into the system encoding\n    - add missing dll mfc90.dll provided and mandatory for python2.6\n    - unlock the file before the edition end confirmation message\n    - default lock duration is 1 day instead of 1 week\n    - support for digest authentification (contrib from David Versmisse)\n    - bugfix in debug messages\n    - windows : make message boxes system modal\n    - contributors\n    - translations update\n\n03/11/2010 - 0.12.0\n-------------------\n\n    - Translations added (French + English)\n    - fix bug in translations in order to provide utf-8 to all popup messages\n    - simplify the message when everything was ok : inform the user that the\n      edition is closed and ok instead of asking questions.\n\n20/05/2010 - 0.11.0\n-------------------\n\n    - don't encode the title in order to be able to print it in user' messages\n    - Linux - support for Freemind mind mappings\n    - first osx compatible version ; needs to be tested on all platforms before\n      release\n\n18/03/2010 - 0.10.0\n-------------------\n\n    - NGINX fix 1 : unable to unlock in https behind NGINX\n\n01/04/2009 - 0.9.11\n-------------------\n\n    - Windows : switch to python 2.5\n\n05/10/2009 - 0.9.11 pre1\n------------------------\n\n    - bugfix LINUX : http_proxy env variable not correctly taken into account\n    - Linux : switch from python2.4 to python2.5\n    - CMFEditions basic support : \n      New option to activate/deactivate version control in zopeedit\n      When a file is modified and saved, a new version is created before \n      save\n    - improvement in log file and in messages\n    - default log level is now info instead of debug\n\n04/26/2009 - 0.9.10\n-------------------\n\n    - unification of EditorProcess for windows and linux. Now only one class.\n    - new isAlive algorythm allowing multiple monitoring \n      functions and priorities\n    - new monitoring function for lock files \n      (openoffice.org 3.0 is now supported)\n    - new default configuration : you need to update your personnal settings \n      in order to get openoffice.org 3 working\n    - bugfix in ini files\n    - isalive improvements\n\n02/24/2009 - 0.9.9.3\n--------------------\n\n    - handle correctly use_locks = False:\n      don't open the file when you use locks and can't lock\n      set use_locks to false if you really want to edit the file and can't lock\n    - bugfix : proxy to https site\n    - bugfix : proxy address starting with \"\\http://\"\n    - log level made possible\n    - logs when end startup process\n    - isAlive improvements, especially when the editor takes time to start\n    - ZopeEdit : New option : config_editor\n    - ZopeEdit : Propose to re-create user config if exists\n    - ZopeEdit.ini : empty proxy option, config_editor = notepad\n    - Windows Installer : add ZopeExternalEditor to Program menu\n    - general-type for images in order to open them with gvim\n    - isAlive improvement for short time editions\n    - proxy empty option in config file\n    - command without filename opens default editor with zopeedit option file\n    - basic proxy support : no authentificated proxy yet\n      proxy parameter in preferences\n      http_proxy taken into account\n    - bugfix - messages\n\n11/20/2008 - 0.9.8 final\n------------------------\n\n    - error in traceback save\n    - general_types : typo\n    - replace spaces in file name when we don't want long name\n    - use mktemp for traceback\n    - don't crash if Title has characters that are not iso-8858-1 compliant.\n\n10/19/2008 - 0.9.8-beta2\n------------------------\n\n    - Enhancement : logs messages have now different log levels. \n    - Enhancement : Log is in \"debug\" mode by default. \n      This may be changed later.\n    - Enhancement : datetime in front of every log entry.\n    - Enhancement : Title of the file edited is retrieved and used \n      for close message.\n    - Enhancement : Log file is now written during execution. \n    - Enhancement : Log file may be read and is not any more deleted \n      when there is a crash.\n    - Enhancement : Log file can be read while zopeedit is running.\n    - Enhancement : Keep log by default.\n    - Enhancement : Borrow locks by default.\n    - Enhancement : Save interval is 5 seconds by default.\n    - Enhancement : Max isalive counter is 5 by default.\n    - Enhancement : Temporary file name to be edited is short \n      (without path) by default.\n    - Bugfix : .zope file is now deleted\n    - Enhancement : failures are logged as errors or exceptions\n    - Enhancement : simpler messages for current messages\n    - Bugfix : unlock file when the editor failed to start\n    - Enhancement : log message when file failed to save back to the server\n    - Enhancement : log message when unlock failed\n    - Enhancement : log message when file's modification is detected\n    - Bugfix : detect editor close during first loops,\n      when editor is monitored by file\n    - Enhancement : parameters for server and client encoding, \n      used to display file Title\n    - Enhancement : no more parameters needed. This makes upgrades simpler. \n    - Enhancement : All options but default editor (posix) and lock duration are now commented\n\n\n08/26/2008 - 0.9.8-beta1\n------------------------\n\n    - Borrow lock when the file is locked by the current user\n    - Message to user when there is a file save issue\n    - Message to user in order to re-open the last version of the file\n      when it can't been saved\n    - Network errors handling\n    - Keep log and temporary file when there is a it's impossible \n      to save or unlock\n    - control file save issues. \n      In case of problem, propose to re-open local copy for local backup.\n    - interaction with user for cases where zopeedit \n      can't handle the editor automatically\n    - now compatible will ALL editors !!\n    - deep rewrite of parts of code    \n    - Default option : always borrow locks = true\n    - mimetypes for excel and powerpoint under linux \n      in default configuration file\n\n06/26/2008 - 0-9-7-ar Release\n-----------------------------\n\n    - Bugfix : start gimp with -n in order to start a new process\n    - Improvements in Lock/Unlock process\n\tLock is applied before file open\n\tLock is removed after final file upload\n    - New option manage_locks\n    - New and more detailed logs\n    - Now more ask user what to do when something happens about locks in the default configuration\n    - No more plugins for MS Office : the new standard process seems to work better with different MS Office versions\n    - Important bugfix in order to avoid losing file's modifications when : close and answer 'yes' to save\n    - More precautions in order to avoid opening an old version of a file (a user opens while another user is closing the file) ; check patched ExterbalEditor in order to be really reliable.\n\n05/28/2008 - 0-9-6-ar Release\n-----------------------------\n\n    - logs from isAlive in order to log the way we track changes\n    - New configuration option lock_timeout in order to configure\n      the lock duration on the client side\n    - Cleanup\n\n04/10/2008 - 0-9-5-ar Release\n-----------------------------\n\n    - better isAlive algorithm\n\n06/28/2007 - 0.9.4-ar Release\n-----------------------------\n\n    - better support for forking applications without pluggin\n    - windows and posix systems support\n\n01/03/2007 - 0.9.3 Release\n--------------------------\n\n    - Fixed issue with 'manage_FTPget' overriding the 'Content-Type'\n      header.\n    - Only run ExpandEnvironmentStrings on win32 systems.\n\n9/14/2006 - 0.9.2 Release\n-------------------------\n\n    - Added 'skip_data' option to make External Editor send out only\n      the metadata part and skip appending data to the 'body'.\n    - Add a simple callback registry that can be used to add extra\n      metadata headers or set special response headers when a file is\n      edited through External Editor.\n    - Use rfc822.Message for parsing the metadata of the file being\n      edited.\n    - Don't emit a warning about deprecated 'methods' in Zope >= 2.10.\n    - Fixed acquisition issue in manage_main.dtml to sync up with the\n      same fix applied to Zope.\n\n6/23/2005 - 0.9.1 Release\n-------------------------\n\n    - Older pyc files for plugins were included in the 0.9 release.\n      This version has the most up to date plugins.\n\n6/20/2005 - 0.9 Release\n-----------------------\n\n    - When using the Excel plugin, errors were seen by users like\n      \"TypeError: This object does not support enumeration\".  We now\n      make the user deal with these.\n    - When using the Excel plugin, errors were intermittently raised to the\n      user in the form \"Fatal error: <unknown>.Path\" and the user could\n      subsequently not save the document back to Zope because the\n      external editor process had quit.\n    - Changes to documents intermittently may not have been saved back to Zope\n      when using any plugin that involved COM (Word, Excel, Powerpoint, etc).\n    - If Word was exited before a user actively saved, if there were\n      outstanding changes in the document being edited, those changes\n      would not be saved to the server despite the user answering\n      \"yes\" to the \"do you want to save before you exit\" dialog\n      presented by Word.\n    - The \"title\" attribute of the object being externally edited is\n      now available within the set of headers returned by EE to the\n      zopeedit client.\n    - Detecting whether the client has External Editor installed from\n      within IE using JavaScript or VBScript is now possible, assuming\n      that the client software is installed via the InnoSetup\n      installer.  See \"win32/ocx.txt\" for more info.\n    - External Editor now compatible with objects that return a\n      \"filestream iterator\" in Zope 2.7.1+. (if upgrading: this fix\n      does not require an update to EE client, just the EE Zope\n      product).\n    - Properly escape hyphens in man page. Thanks to Federico Sevilla III.\n    - Check if the editor was launched before locking the file in Zope. This\n      prevents errors if the editor is closed before the lock request \n      completes.\n    - Do not ask the user what editor to use on Posix platforms. Instead just\n      tell the user to edit the config file. The askstring()\n      function does not work with a hidden root Tk window in Python 2.3.4.\n      Thanks to Christopher Mann.\n\n7/13/04 - 0.8 release\n---------------------\n  \n    - Add external editor icon to ZMI breadcrumbs for editable objects.\n    - Compiled windows helper app binary using Python 2.3.4, Pythonwin build\n      163 and py2exe 0.5.\n    - Add Dreamweaver plugin contributed by Manuel Aristaránn. Thanks also\n      to Anton Stonor.\n    - Add ZMI support for Zope 2.7's ordered folder objects.      \n    - Fix bug detecting basic auth info from older versions of CookieCrumber.\n      Thanks to David D. Smith and Federico Sevilla III.\n    - Workaround IE browser error when running over SSL. Thanks to \n      Marc-Aurèle Darche.\n    - Add \".zem\" file extension support for MacOS X (especially Mac IE),\n      to ease helper app integration where MIME support is lacking. Thanks\n      to Zac Bir.\n    - Added \"long_file_name\" and \"file_name_separator\" config options.\n    - Fixed bug which happened under Win32 when editing an Excel file\n      using the Excel plugin where the symptom was a \"Call was\n      rejected by callee\" COM error. Thanks to Chris McDonough.\n\n4/23/04 - 0.7.2 Release\n-----------------------\n\n    - Change default configuration to use .txt extension for text/plain only. \n      Add extensions for css and javascript files.\n    - Fixed packaging bug in Windows binary which disabled several plugins.\n      This fixes \"Editor did not launch properly\" errors for MSOffice\n      among others.\n    - Fixed a bug where very short editing sessions where no changes were\n      made could make EE think the editor never launched. Thanks to Maik Ihde.\n\n11/7/03 - 0.7.1 Release (affects win32 binary only)\n---------------------------------------------------\n\n    - Fix encoding bug in windows binary. Thanks to Chris McDonough.  \n    - Added tip for configuring IE to save files over SSL. Thanks to\n      Jonah Bossewitch.\n\n4/1/03 - 0.7 Release\n--------------------\n\n    - Added working distutils setup for Unix.\n\n    - You can now specify from the server that the helper app should\n      borrow a lock by passing borrow_lock=1 via the request, thus\n      suppressing the dialog box which appears by default. Thanks\n      to Shane Hathaway.\n\n    - Improved open file check in Word and Powerpoint plugins \n      thanks to Yura Petrov.\n\n    - Added plugins for Microsoft Word, Excel and Powerpoint.\n\n    - Added the man page from the Debian distro. Thanks go out to\n      Federico Sevilla III and Andreas Tille\n\n11/02/02 - 0.6 Release\n----------------------\n\n    - Built Windows helper app using Python 2.2.2 and PythonWin 148.\n\n    - The \\externalEdit_ object now accepts a path argument to the object to\n      edit, allowing URLs like: \"\\http://zope/\\externalEdit_?path=/some/object\".\n      This allows external editor to play better with applications making use\n      of traversal magic of their own. Thanks to Tres Seaver.\n\n    - Fixed NameError bug in unlock retry code. Thanks to Federico Sevilla III.\n\n    - Added a workaround for non-compliant SSL servers. The software now\n      silently ignores \"EOF occurred in violation of protocol\" errors coming\n      from httplib. Thanks to Christopher Deckard.\n\n    - Removed stderr writes to cure \"Invalid File Descriptor\" errors on\n      Windows. Thanks to Martijn Peters.\n\n    - Added Photoshop plugin (win32)\n\n    - Added HomeSite plugin (win32)\n\n    - Added win32 editor plugin support for the helper application.\n\n8/19/02 - 0.5 Release\n---------------------\n\n    - Added patch for Zope find template so that you can use external editor\n      directly from find results in the ZMI. Thanks to Jim Washington.\n\n    - Factored out external editor link generator. Product now registers\n      a global method \"\\externalEditLink_\" which can be called to generate\n      the external editor icon link for any object.\n\n    - External editing is now governed by the \"Use external editor\" permission\n      to allow non-managers to use it. Users must also have the permissions to\n      edit/modify the objects they edit, plus do WebDAV locking if desired.\n      Thanks to Reineke and others.\n\n    - Unix editor command line parsing is much more robust now and properly\n      handles quoted arguments. You can also specify the \"$1\" placeholder in the\n      editor command to denote where the content file name is inserted. If\n      omitted it is appended to the end of the command line. \"%1\" continues to\n      work similarly for Windows. Thanks to Marc St-Jean.\n\n    - Fixed bug editing large (chunked) files and images. External editor now\n      streams their data properly to the client. Thanks to all the users who\n      reported various symptoms of this bug.\n\n    - Fixed bug editing objects inside a Squishdot site. Thanks to Kevin Salt.\n\n    - Added the capability to borrow exising DAV locks. This allows external\n      editor to play well with other systems using locks, such as CMFStaging. A\n      new configuration flag, always_borrow_locks can be set to suppress the\n      borrow lock warning dialog when editing.\n\n    - Fixed auth bug when product was used with mysqlUserFolder. Thanks to\n      ViNiL.\n\n6/30/02 - 0.4.2 Release (affects win32 binary only)\n---------------------------------------------------\n\n    - Added SSL support to Windows binary package. Thanks to Federico \n      Sevilla III\n\n6/29/02 - 0.4.1 Release\n-----------------------\n\n    - Fixed dangling dav lock bug on fatal errors. Thanks to Marc St-Jean.\n    - Fixed content_type bug, now checks if it is callable. Thanks to Arnaud \n      Bienvenu.\n    - Fixed bug with editing binary data on Windows. Thanks to Eric Kamm.\n    - Fixed bug setting the editor on Posix platforms.\n\n6/24/02 - 0.4 Release\n---------------------\n\n    - Added --version command line argument\n    - Made manage_FTPget the default source for the editable content, instead\n      of document_src which was broken for CMF Wiki Pages.\n    - Fixed Windows \"body_file\" bug.\n    - Added binary build support for Windows using py2exe and Inno setup.\n    - Fixed Windows config file locator. It now looks in the program directory\n      and then the user's home directory (if specified)\n    - Fixed bug in Windows registry editor lookup.\n\n6/16/02 - 0.3 Release\n---------------------\n\n    - Improved behavior when saving after lock attempts fail.\n    - Now works on Windows (applause) using Pythonwin. Much overall\n      refactoring to abstract process control. Thanks to Oliver Deckmyn,\n      Gabriel Genellina and Arno Gross for testing, patches and suggestions.\n    - Added \"temp_dir\" configuration option for specifying a different\n      temp file directory then the OS default. Also further improved \n      temp file name generation.\n    - Added support for domain specific configuration options.\n    - Fixed trailing newline bug in encoded auth data coming from\n      CookieCrumbler. Thanks to Harald Koschinski.\n    - You can now pass command line arguments to the editor in the config file,\n      or wrap the editor in an xterm without using a shell script.\n    - Rewrote \"Editor did not launch\" error message so it makes more sense.\n    - Fixed https detection bug. External editor is now tested and working with\n      https. Many thanks to Hans-Dieter Stich and Martin Grönemeyer for their \n      assistance and ideas.\n    - Made it possible to edit objects that are methods of ZClasses. Thanks to\n      Jim Washington\n    - Refactored link generation code in manage_main so that it uses\n      the parent's absolute_url rather than URL1. Thanks to\n      Jim Washington\n    - Removed implicit save in Configuration class destructor\n    - Added caching headers to prevent client-side caching of edit data.\n      Thanks to Gabriel Genellina for pointing this out.\n    - Added improved support for editing CMF documents\n    - Eliminated spurious \"Editor did not launch\" errors on short sessions\n      or when other errors occurred.\n\n5/16/02 - 0.2 Release\n---------------------\n\n    - Fixed product uninstallation bug\n\n5/15/02 - 0.1\n-------------\n\n    - Initial release", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://svn.plone.org/svn/collective/collective.zopeedit/", "keywords": "zope plone externaleditor zopeedit edition", "license": "ZPL", "maintainer": null, "maintainer_email": null, "name": "collective.zopeedit", "package_url": "https://pypi.org/project/collective.zopeedit/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/collective.zopeedit/", "project_urls": {"Download": "UNKNOWN", "Homepage": "http://svn.plone.org/svn/collective/collective.zopeedit/"}, "release_url": "https://pypi.org/project/collective.zopeedit/1.0.0/", "requires_dist": null, "requires_python": null, "summary": "ZopeEdit : External Editor Client", "version": "1.0.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <div id=\"zope-external-editor\">\n<h2>Zope External Editor</h2>\n<div id=\"introduction\">\n<h3>Introduction</h3>\n<blockquote>\n<p>The Zope External Editor is a new way to integrate Zope more seamlessly with\nclient-side tools. It has the following features:</p>\n<ul>\n<li>Edit objects locally, directly from the ZMI or from your web application.</li>\n<li>Works with any graphical editor application that can open a file from the\ncommand line, including: emacs, gvim, xemacs, nedit, gimp, openoffice.org,\nMS Office, Photoshop, etc.</li>\n<li>Automatically saves changes back to Zope without ending the editing session.</li>\n<li>Associate any client-side editor application with any Zope object by\nmeta-type or content-type. Both text and binary object content can be\nedited.</li>\n<li>Locks objects while they are being edited. Automatically unlocks them when\nthe editing session ends.</li>\n<li>Can add file extensions automatically to improve syntax highlighting or\nfile type detection.</li>\n<li>Works with basic auth, cookie auth and Zope versions. Credentials are\nautomatically passed down to the helper application. No need to\nreauthenticate.</li>\n<li>https support (Openssl required)</li>\n<li>proxy support (might fail with some proxies ; contact us if you get\nan issue)</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"using-it\">\n<h3>Using It</h3>\n<blockquote>\n<p>Use of the application is about as easy as using the ZMI once your browser\nis configured (see the installation instructions). To edit an object\nexternally, just click on the pencil icon next to the object in the ZMI,\nor on the specific direct edit action in your application.\nThe object will be downloaded and opened using the editor application you\nhave chosen (you will be prompted the first time to choose an editor).</p>\n<p>You edit the object just like any other file. When you save the changes in\nyour editor, they are automatically uploaded back to Zope in the\nbackground. While the object is open in your editor, it is locked in Zope\nto prevent concurrent editing. When you end your editing session (ie you\nclose your editor) the object is unlocked.</p>\n</blockquote>\n</div>\n<div id=\"how-it-works\">\n<h3>How it Works</h3>\n<blockquote>\n<p>Ok, so this all sounds a bit too good to be true, no? So how the heck does\nit work anyway? First I’ll give you a block diagram:</p>\n<pre>+------------+     +------------+     +---------+        +------+\n| Editor App | &lt;-- | Helper App | &lt;-- | Browser | &lt;-/ /- | Zope |\n+------------+     +------------+     +---------+        +------+\n            ^       ^     ^                                ^\n             \\     /       \\                              /\n              v   v         -----------------------/ /----\n             -------\n            / Local \\\n            \\  File /\n             -------\n</pre>\n<p>Now the key to getting this to work is solving the problem that the editor\ncannot know about Zope, and must only deal with local files. Also, there is\nno standard way to communication with editors, so the only communication\nchannel can be the local file which contains the object’s content or code.</p>\n<p>It is trivial to get the browser to fire up your editor when you download\na particular type of data with your browser. But that does you little good,\nsince the browser no longer involves itself once the data is downloaded. It\njust creates a temp file and fires off the registered application, passing\nit the file path. Once the editor is running, it is only aware of the local\nfile, and has no concept of where it originated from.</p>\n<p>To solve this problem, we have developed a helper application whose job is\nessentially two-fold:</p>\n<ul>\n<li>Determine the correct editor to launch for a given Zope object</li>\n<li>Get the data back into Zope when the changes are saved</li>\n</ul>\n<p>So, let’s take a step by step look at how it works:</p>\n<ol>\n<li>You click on the external editor link (the pencil icon) in the Zope\nmanagement interface (This might be a special action).</li>\n<li>The product code on the server creates a response that encapsulates the\nnecessary meta-data (URL, meta-type, content-type, cookies, etc) and the\ncontent of the Zope object, which can be text or binary data. The\nresponse has the contrived content-type “application/x-zope-edit” and\nthe file extension “.zem”.</li>\n<li>The browser receives the request, and finds our helper application\nregistered for “application/x-zope-edit” or the extension “.zem”.\nIt saves the response data locally to disk and spawns the helper app\nto process it.</li>\n<li>The helper app, reads its config file and the response data file. The\nmeta-data from the file is parsed and the content is copied to a new\ntemporary file. The appropriate editor program is determined based on\nthe data file and the configuration.</li>\n<li>The editor is launched as a sub-process of the helper app, passing it the\nfile containing the content data.</li>\n<li>If so configured, the helper app sends a WebDAV lock request back to Zope\nto lock the object.</li>\n<li>Every so often (if so configured), the helper app stats the content file\nto see if it has been changed. If so, it sends an HTTP PUT request\nback to Zope containing the new data.</li>\n<li>When the editor is closed, the content file is checked one more time and\nuploaded if it has changed. Then a WebDAV unlock request is sent to Zope.</li>\n<li>The helper application exits.</li>\n</ol>\n</blockquote>\n</div>\n<div id=\"configuration\">\n<h3>Configuration</h3>\n<blockquote>\n<blockquote>\n<p>The helper application supports several configuration options, each of\nwhich can be triggered in any combination of object meta-type, content-type\nor domain. This allows you to create appropriate behavior for different\ntypes of Zope objects and content or even different servers. The\nconfiguration file is stored in the file  “~/.zope-external-edit” (Unix) or\n“~ZopeEdit.ini” (Windows). If no configuration file is found when the\nhelper application starts, a default config file is created in your home\ndirectory.</p>\n<p>The configuration file follows the standard Python ConfigParser format,\nwhich is pretty much like the old .ini file format from windows. The file\nconsists of sections and options in the following format:</p>\n<pre>[section 1]\noption1 = value\noption2 = value\n\n[section 2]\n...\n</pre>\n<p>Options</p>\n<blockquote>\n<p>The available options for all sections of the config file are:</p>\n<p>editor – Command line or plugin name used to invoke the editor\napplication. On Windows, if no editor setting is found for an object you\nedit, the helper app will search the file type registry for an\nappropriate editor based on the content-type or file extension of the\nobject (which can be specified using the extension option below). By\ndefault, the file path of the local file being edited is appended to\nthis command line. To insert the file path in the middle of your\ncommand, use “$1” for Unix and “%1” for Windows respectively.</p>\n<p>save_interval – (float) The interval in seconds that the helper\napplication checks the edited file for changes.</p>\n<p>use_locks – (1 or 0) Whether to use WebDAV locking. The user editing must\nhave the proper WebDAV related permissions for this to work.</p>\n<p>always_borrow_locks – (1 or 0) When use_locks is enabled this features\nsuppresses warnings when trying to edit an object you have already locked.\nWhen enabled, external editor will always “borrow” the existing lock token\ninstead of doing the locking itself. This is useful when using CMFStaging\nfor instance. If omitted, this option defaults to 0.</p>\n<p>cleanup_files – (1 or 0) Whether to delete the temp files created.\nWARNING the temp file coming from the browser contains authentication\ninformation and therefore setting this to 0 is a security risk,\nespecially on shared machines. If set to 1, that file is deleted at the\nearliest opportunity, before the editor is even spawned. Set to 0 for\ndebugging only.</p>\n<p>extension – (text) The file extension to add to the content file. Allows\nbetter handling of images and can improve syntax highlighting.</p>\n<p>temp_dir – (path) Path to store local copies of object data being\nedited. Defaults to operating system temp directory. <em>Note: this setting\nhas no apparent effect on Windows</em> 8^(</p>\n<p>long_file_name – (1 or 0) Whether to include the whole path to the\nobject including the hostname in the file name (the default) or just the\nid of the object being edited. Turn this option off for shorter file\nnames in your editors, and for editors that don’t like long names.</p>\n<p>file_name_separator – (string) Character or characters used to separate\npath elements in long files names used by external editor. Defaults to\na comma (,). This must be a legal character for use in file names on\nyour platorm (i.e., don’t use a path separator character!). This option\nis ignored if ‘long_file_name’ is set to 0.</p>\n</blockquote>\n<p>Sections</p>\n<blockquote>\n<p>The sections of the configuration file specify the types of objects and\ncontent that the options beneath them apply to.</p>\n<p>There is only one mandatory section ‘[general]’, which should define all\nof the above options that do not have a default value. If no other\nsection defines an option for a given object, the general settings are\nused.</p>\n<p>Additional sections can apply to a particular domain, content-type or\nmeta-type. Since objects can have all these properties, the options are\napplied in this order of precedence.</p>\n<ul>\n<li>‘[content-type:text/html]’ – Options by whole content-type come first</li>\n<li>‘[content-type:text/*]’ – Options by major content-type come second.</li>\n<li>‘[meta-type:File]’ – Options by Zope meta-type are third.</li>\n<li>‘[domain:www.mydomain.com]’ – Options by domain follow. Several\nsections can be added for each domain level if desired.</li>\n<li>‘[general]’ – General options are last.</li>\n</ul>\n<p>This scheme allows you to specify an extension by content-type, the\neditor by meta-type, the locking settings by domain and the remaining\noptions under general for a given object.</p>\n</blockquote>\n</blockquote>\n<p>Editor Plugins</p>\n<blockquote>\n<p>For tighter client-side integration, external editor has a plugin system\nthat allows it to interact directly with supported applications.</p>\n<p>On Windows this generally means using COM to invoke the application, open\nthe content file and wait for the user to save and close the file. Because\neach application has different remote scripting capabilities and APIs,\neditor specific plugins must be written tailored to each supported\napplication and platform.</p>\n<p>This system allows external editor to efficiently connect to running\napplications without relaunching them and therefore fully support MDI\nenvironments. The following applications currently have plugin support:</p>\n<pre>Application       Platform    Plugin Module Name(s)\n===================================================\nHomeSite          Windows     homesite5, homesite\nDreamweaver       Windows     dreamweaver\n</pre>\n<p>External editor will attempt to load a plugin for any application before\nusing the general editor control method. It does this by matching the\nname of the application executable file (sans extension) in the editor\ncommand line with the available plugins.</p>\n<p>Because plugins do not require the path of the editor application to work,\nyou can simply specify the plugin module name for your editor in the\nconfiguration file if desired. For example, to specify Photoshop for all\nimage files, use add the following section to your config file\n(ZopeEdit.ini on Windows):</p>\n<pre>[content-type:image/*]\neditor=photoshop\n</pre>\n<p>This is only a shortcut and specifying the full application path will\nstill use the plugin where possible.</p>\n<p>Plugin Notes</p>\n<blockquote>\n<p>Photoshop – Photoshop’s COM API is quite limited, and external editor\ncannot detect that you have closed a file until you exit the entire\napplication (it can still detect saves). Therefore you may want to turn\noff DAV locking (use_locks=0) or borrow locks (always_borrow_locks=1)\nwhen using it.</p>\n<p>Dreamweaver – External editor cannot detect when you have finished\nediting a single file. Objects edited with Dreamweaver will remain\nlocked on the server until you exit the application. As with Photoshop\nabove, you may want to turn off locking for Dreamweaver.</p>\n<p>If your favorite editor needs a plugin because the general support is\nnot good enough, please let me know. Keep in mind that I must be able to\nrun a copy of the application in order to develop a plugin for it. So,\nunless the application is free, or a full demo is available for download\nI won’t be able to help much. Plugins are not difficult to write, and I\nencourage you to write one for your favorite editor, start by reading\none of the existing ones. I am happy to include third-party plugins with\nthe distribution.</p>\n</blockquote>\n</blockquote>\n<p>Permissions</p>\n<blockquote>\n<p>External editing is governed by the permission “Use external editor”.\nUsers with this permission can launch external editor from editable\nobjects. In order to save changes, users will need additional permissions\nappropriate for the objects they are editing.</p>\n<p>If users wish to use the built-in locking support, they must have the\n“WebDAV access”, “WebDAV Lock items” and “WebDAV Unlock items” permissions\nfor the objects they are editing.</p>\n<p>If these permissions are not set in Zope, then the helper application will\nreceive unauthorized errors from Zope which it will present to the user.</p>\n</blockquote>\n<p>Integrating with External Editor</p>\n<blockquote>\n<p>The external editor product in zope installs a globally available object\nthat can format objects accessible through FTP/DAV for use by the helper\napplication. You can take advantage of this functionality easily in your\nown content management applications.</p>\n<p>Say you have an FTP editable object, “document”, in a Zope folder named\n“my_stuff”. The URL to view the object would be:</p>\n<pre>http://zopeserver/my_stuff/document\n</pre>\n<p>The URL to kick off the external editor on this document would be:</p>\n<pre>http://zopeserver/my_stuff/externalEdit_/document\n</pre>\n<p>Now, this may look a bit odd to you if you are used to tacking views on to\nthe end of the URL. Because ‘externalEdit_’ is required to work on Python\nScripts and Page Templates, which swallow the remaining path segments on\nthe URL following themselves, you must put the call to ‘externalEdit_’\n<em>directly before</em> the object to be edited. You could do this in ZPT using\nsome TAL in a Page Template like:</p>\n<pre>&lt;a href='edit'\n   attributes='href\n   string:${here/aq_parent/absolute_url}/externalEdit_/${here/getId}'&gt;\n   Edit Locally\n&lt;/a&gt;\n</pre>\n<p>As an alternative, you can also pass the path the object you want to edit\ndirectly to the externalEdit_ object when you call its index_html method.\nIt can be called either directly by URL or from a python script.\nexternalEdit_ will return the proper response data for the object to edit.\nHere are some examples:</p>\n<pre>http://zopeserver/externalEdit_?path=/my_stuff/document\n\nreturn context.externalEdit_.index_html(\n    context.REQUEST, context.RESPONSE, path='/my_stuff/document')\n</pre>\n<p>When integrating External Editor with a CMS that already uses DAV\nlocks, it will, by default allow users to borrow locks made on the server\nafter displaying a confirmation dialog box. Although you can make this\nautomatic by specifying ‘always_borrow_locks = 1’ in the External Editor\nconfig file, it may be desireable to make this the default behavior when\nusing that server. To facilitate this, you can specify that locks\nshould be automatically borrowed in the URL (New in 0.7):</p>\n<pre>http://zopeserver/my_stuff/externalEdit_/document?borrow_lock=1\n</pre>\n<p>External Editor also defines a global method that you can call to insert\npencil icon links for appropriate objects. The method automatically checks\nif the object supports external editing and whether the user has the “Use\nexternal editor” permission for that object. If both are true, it returns\nthe HTML code to insert the external editor icon link. Otherwise it returns\nan empty string.</p>\n<p>The method is ‘externalEditLink_(object)’. The object argument is the\nobject to create the link for if appropriate. Here is some example page\ntemplate code that inserts links to objects in the current folder and the\nexternal editor icon where appropriate:</p>\n<pre>&lt;div tal:repeat=\"object here/objectValues\"&gt;\n  &lt;a href=\"#\"\n     tal:attributes=\"href object/absolute_url\"\n     tal:content=\"object/title_or_id\"&gt;Object Title&lt;/a&gt;\n  &lt;span tal:replace=\"structure python:here.externalEditLink_(object)\" /&gt;\n&lt;/div&gt;\n</pre>\n</blockquote>\n</blockquote>\n</div>\n<div id=\"conclusion\">\n<h3>Conclusion</h3>\n<blockquote>\n<p>I hope you enjoy using this software. If you have any comments, suggestions\nor would like to report a bug, send an email to this version maintainer:</p>\n<blockquote>\n<p>Thierry Benita</p>\n<p><a href=\"mailto:contact%40atreal.net\">contact<span>@</span>atreal<span>.</span>net</a></p>\n<p><a href=\"http://www.atreal.net\" rel=\"nofollow\">http://www.atreal.net</a></p>\n</blockquote>\n</blockquote>\n</div>\n<div id=\"special-thanks-for-their-help-and-contributions\">\n<h3>Special thanks for their help and contributions</h3>\n<blockquote>\n<ul>\n<li>Wayne Glover - excellent texting and reports makes ZopeEdit go ahead !</li>\n<li>Alexandre Gouraud - contributor of the Digest authentification method</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"authors\">\n<h3>Authors</h3>\n<ol>\n<li>2010, Thierry Benita, Jean-Nicolas Bes, atReal, Casey Duncan, contributors atReal and Zope Corporation. All rights reserved.</li>\n</ol>\n</div>\n</div>\n<div id=\"changelog\">\n<h2>Changelog</h2>\n<div id=\"id1\">\n<h3>01/03/2011 - 1.0.0</h3>\n<blockquote>\n<ul>\n<li>new linux debian/ubuntu packaging</li>\n<li>better user experience : less but more explicit messages</li>\n<li>translated in English / French / Spanish (contribs welcome !)</li>\n<li>the config file allows multiple editors for a given mimetype :\nthe first one that is available is used</li>\n<li>the users’s configuration file is stored in :\n.config/collective.zopeedit (Linux)\nApplication Datacollective.zopeedit (Windows)</li>\n<li>all options have default values</li>\n<li>automatic application detection based on the desktop environment (Linux)</li>\n<li>new icon (Windows, Linux)</li>\n<li>MS VCRedist in included into the windows package</li>\n<li>libreoffice support</li>\n<li>locks management improvements</li>\n<li>new default values make ZopeEdit faster</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id2\">\n<h3>29/11/2010 - 0.12.7</h3>\n<blockquote>\n<ul>\n<li>install from egg</li>\n<li>disable automatic proxy detection by default as it may have side effects\nwhen a proxy can’t handle the request while a direct connexion is ok</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id3\">\n<h3>19/11/2010 - 0.12.6</h3>\n<blockquote>\n<ul>\n<li>more debug messages in zopeRequest for proxy connection</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id4\">\n<h3>17/11/2010 - 0.12.5</h3>\n<blockquote>\n<ul>\n<li>automatic proxy detection =&gt; all OS !</li>\n<li>integration of new metadata received from server</li>\n<li>more logs in zopeRequest</li>\n<li>more debug logs</li>\n<li>log level debug by default</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id5\">\n<h3>17/11/2010 - 0.12.4</h3>\n<blockquote>\n<ul>\n<li>update man page</li>\n<li>remove useless plugins</li>\n<li>coding rules / cleanup</li>\n<li>add lock file detection support for gvim</li>\n<li>remove calls to os.spawnvp (deprecated)</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id6\">\n<h3>10/11/2010 - 0.12.3</h3>\n<blockquote>\n<ul>\n<li>add pythonwin windows libs</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id7\">\n<h3>10/11/2010 - 0.12.2</h3>\n<blockquote>\n<ul>\n<li>fix bug related to proxy + ssl starting from python2.5</li>\n<li>remove libs that are included in MS Redistributable : it seems that they\nare useless when redistributable is installed, and they can’t avoid\ninstalling redistributable</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id8\">\n<h3>09/11/2010 - 0.12.1</h3>\n<blockquote>\n<ul>\n<li>switch to python 2.6 for windows</li>\n<li>bugfix in gettext initialization</li>\n<li>encode the file’s title into the system encoding</li>\n<li>add missing dll mfc90.dll provided and mandatory for python2.6</li>\n<li>unlock the file before the edition end confirmation message</li>\n<li>default lock duration is 1 day instead of 1 week</li>\n<li>support for digest authentification (contrib from David Versmisse)</li>\n<li>bugfix in debug messages</li>\n<li>windows : make message boxes system modal</li>\n<li>contributors</li>\n<li>translations update</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id9\">\n<h3>03/11/2010 - 0.12.0</h3>\n<blockquote>\n<ul>\n<li>Translations added (French + English)</li>\n<li>fix bug in translations in order to provide utf-8 to all popup messages</li>\n<li>simplify the message when everything was ok : inform the user that the\nedition is closed and ok instead of asking questions.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id10\">\n<h3>20/05/2010 - 0.11.0</h3>\n<blockquote>\n<ul>\n<li>don’t encode the title in order to be able to print it in user’ messages</li>\n<li>Linux - support for Freemind mind mappings</li>\n<li>first osx compatible version ; needs to be tested on all platforms before\nrelease</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id11\">\n<h3>18/03/2010 - 0.10.0</h3>\n<blockquote>\n<ul>\n<li>NGINX fix 1 : unable to unlock in https behind NGINX</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id12\">\n<h3>01/04/2009 - 0.9.11</h3>\n<blockquote>\n<ul>\n<li>Windows : switch to python 2.5</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"pre1\">\n<h3>05/10/2009 - 0.9.11 pre1</h3>\n<blockquote>\n<ul>\n<li>bugfix LINUX : http_proxy env variable not correctly taken into account</li>\n<li>Linux : switch from python2.4 to python2.5</li>\n<li>CMFEditions basic support :\nNew option to activate/deactivate version control in zopeedit\nWhen a file is modified and saved, a new version is created before\nsave</li>\n<li>improvement in log file and in messages</li>\n<li>default log level is now info instead of debug</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id13\">\n<h3>04/26/2009 - 0.9.10</h3>\n<blockquote>\n<ul>\n<li>unification of EditorProcess for windows and linux. Now only one class.</li>\n<li>new isAlive algorythm allowing multiple monitoring\nfunctions and priorities</li>\n<li>new monitoring function for lock files\n(openoffice.org 3.0 is now supported)</li>\n<li>new default configuration : you need to update your personnal settings\nin order to get openoffice.org 3 working</li>\n<li>bugfix in ini files</li>\n<li>isalive improvements</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id14\">\n<h3>02/24/2009 - 0.9.9.3</h3>\n<blockquote>\n<ul>\n<li>handle correctly use_locks = False:\ndon’t open the file when you use locks and can’t lock\nset use_locks to false if you really want to edit the file and can’t lock</li>\n<li>bugfix : proxy to https site</li>\n<li>bugfix : proxy address starting with “http://”</li>\n<li>log level made possible</li>\n<li>logs when end startup process</li>\n<li>isAlive improvements, especially when the editor takes time to start</li>\n<li>ZopeEdit : New option : config_editor</li>\n<li>ZopeEdit : Propose to re-create user config if exists</li>\n<li>ZopeEdit.ini : empty proxy option, config_editor = notepad</li>\n<li>Windows Installer : add ZopeExternalEditor to Program menu</li>\n<li>general-type for images in order to open them with gvim</li>\n<li>isAlive improvement for short time editions</li>\n<li>proxy empty option in config file</li>\n<li>command without filename opens default editor with zopeedit option file</li>\n<li>basic proxy support : no authentificated proxy yet\nproxy parameter in preferences\nhttp_proxy taken into account</li>\n<li>bugfix - messages</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"final\">\n<h3>11/20/2008 - 0.9.8 final</h3>\n<blockquote>\n<ul>\n<li>error in traceback save</li>\n<li>general_types : typo</li>\n<li>replace spaces in file name when we don’t want long name</li>\n<li>use mktemp for traceback</li>\n<li>don’t crash if Title has characters that are not iso-8858-1 compliant.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"beta2\">\n<h3>10/19/2008 - 0.9.8-beta2</h3>\n<blockquote>\n<ul>\n<li>Enhancement : logs messages have now different log levels.</li>\n<li>Enhancement : Log is in “debug” mode by default.\nThis may be changed later.</li>\n<li>Enhancement : datetime in front of every log entry.</li>\n<li>Enhancement : Title of the file edited is retrieved and used\nfor close message.</li>\n<li>Enhancement : Log file is now written during execution.</li>\n<li>Enhancement : Log file may be read and is not any more deleted\nwhen there is a crash.</li>\n<li>Enhancement : Log file can be read while zopeedit is running.</li>\n<li>Enhancement : Keep log by default.</li>\n<li>Enhancement : Borrow locks by default.</li>\n<li>Enhancement : Save interval is 5 seconds by default.</li>\n<li>Enhancement : Max isalive counter is 5 by default.</li>\n<li>Enhancement : Temporary file name to be edited is short\n(without path) by default.</li>\n<li>Bugfix : .zope file is now deleted</li>\n<li>Enhancement : failures are logged as errors or exceptions</li>\n<li>Enhancement : simpler messages for current messages</li>\n<li>Bugfix : unlock file when the editor failed to start</li>\n<li>Enhancement : log message when file failed to save back to the server</li>\n<li>Enhancement : log message when unlock failed</li>\n<li>Enhancement : log message when file’s modification is detected</li>\n<li>Bugfix : detect editor close during first loops,\nwhen editor is monitored by file</li>\n<li>Enhancement : parameters for server and client encoding,\nused to display file Title</li>\n<li>Enhancement : no more parameters needed. This makes upgrades simpler.</li>\n<li>Enhancement : All options but default editor (posix) and lock duration are now commented</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"beta1\">\n<h3>08/26/2008 - 0.9.8-beta1</h3>\n<blockquote>\n<ul>\n<li>Borrow lock when the file is locked by the current user</li>\n<li>Message to user when there is a file save issue</li>\n<li>Message to user in order to re-open the last version of the file\nwhen it can’t been saved</li>\n<li>Network errors handling</li>\n<li>Keep log and temporary file when there is a it’s impossible\nto save or unlock</li>\n<li>control file save issues.\nIn case of problem, propose to re-open local copy for local backup.</li>\n<li>interaction with user for cases where zopeedit\ncan’t handle the editor automatically</li>\n<li>now compatible will ALL editors !!</li>\n<li>deep rewrite of parts of code</li>\n<li>Default option : always borrow locks = true</li>\n<li>mimetypes for excel and powerpoint under linux\nin default configuration file</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"ar-release\">\n<h3>06/26/2008 - 0-9-7-ar Release</h3>\n<blockquote>\n<ul>\n<li>Bugfix : start gimp with -n in order to start a new process</li>\n<li><dl>\n<dt>Improvements in Lock/Unlock process</dt>\n<dd>Lock is applied before file open\nLock is removed after final file upload</dd>\n</dl>\n</li>\n<li>New option manage_locks</li>\n<li>New and more detailed logs</li>\n<li>Now more ask user what to do when something happens about locks in the default configuration</li>\n<li>No more plugins for MS Office : the new standard process seems to work better with different MS Office versions</li>\n<li>Important bugfix in order to avoid losing file’s modifications when : close and answer ‘yes’ to save</li>\n<li>More precautions in order to avoid opening an old version of a file (a user opens while another user is closing the file) ; check patched ExterbalEditor in order to be really reliable.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id15\">\n<h3>05/28/2008 - 0-9-6-ar Release</h3>\n<blockquote>\n<ul>\n<li>logs from isAlive in order to log the way we track changes</li>\n<li>New configuration option lock_timeout in order to configure\nthe lock duration on the client side</li>\n<li>Cleanup</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id16\">\n<h3>04/10/2008 - 0-9-5-ar Release</h3>\n<blockquote>\n<ul>\n<li>better isAlive algorithm</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id17\">\n<h3>06/28/2007 - 0.9.4-ar Release</h3>\n<blockquote>\n<ul>\n<li>better support for forking applications without pluggin</li>\n<li>windows and posix systems support</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"release\">\n<h3>01/03/2007 - 0.9.3 Release</h3>\n<blockquote>\n<ul>\n<li>Fixed issue with ‘manage_FTPget’ overriding the ‘Content-Type’\nheader.</li>\n<li>Only run ExpandEnvironmentStrings on win32 systems.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id18\">\n<h3>9/14/2006 - 0.9.2 Release</h3>\n<blockquote>\n<ul>\n<li>Added ‘skip_data’ option to make External Editor send out only\nthe metadata part and skip appending data to the ‘body’.</li>\n<li>Add a simple callback registry that can be used to add extra\nmetadata headers or set special response headers when a file is\nedited through External Editor.</li>\n<li>Use rfc822.Message for parsing the metadata of the file being\nedited.</li>\n<li>Don’t emit a warning about deprecated ‘methods’ in Zope &gt;= 2.10.</li>\n<li>Fixed acquisition issue in manage_main.dtml to sync up with the\nsame fix applied to Zope.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id19\">\n<h3>6/23/2005 - 0.9.1 Release</h3>\n<blockquote>\n<ul>\n<li>Older pyc files for plugins were included in the 0.9 release.\nThis version has the most up to date plugins.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id20\">\n<h3>6/20/2005 - 0.9 Release</h3>\n<blockquote>\n<ul>\n<li>When using the Excel plugin, errors were seen by users like\n“TypeError: This object does not support enumeration”.  We now\nmake the user deal with these.</li>\n<li>When using the Excel plugin, errors were intermittently raised to the\nuser in the form “Fatal error: &lt;unknown&gt;.Path” and the user could\nsubsequently not save the document back to Zope because the\nexternal editor process had quit.</li>\n<li>Changes to documents intermittently may not have been saved back to Zope\nwhen using any plugin that involved COM (Word, Excel, Powerpoint, etc).</li>\n<li>If Word was exited before a user actively saved, if there were\noutstanding changes in the document being edited, those changes\nwould not be saved to the server despite the user answering\n“yes” to the “do you want to save before you exit” dialog\npresented by Word.</li>\n<li>The “title” attribute of the object being externally edited is\nnow available within the set of headers returned by EE to the\nzopeedit client.</li>\n<li>Detecting whether the client has External Editor installed from\nwithin IE using JavaScript or VBScript is now possible, assuming\nthat the client software is installed via the InnoSetup\ninstaller.  See “win32/ocx.txt” for more info.</li>\n<li>External Editor now compatible with objects that return a\n“filestream iterator” in Zope 2.7.1+. (if upgrading: this fix\ndoes not require an update to EE client, just the EE Zope\nproduct).</li>\n<li>Properly escape hyphens in man page. Thanks to Federico Sevilla III.</li>\n<li>Check if the editor was launched before locking the file in Zope. This\nprevents errors if the editor is closed before the lock request\ncompletes.</li>\n<li>Do not ask the user what editor to use on Posix platforms. Instead just\ntell the user to edit the config file. The askstring()\nfunction does not work with a hidden root Tk window in Python 2.3.4.\nThanks to Christopher Mann.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id21\">\n<h3>7/13/04 - 0.8 release</h3>\n<blockquote>\n<ul>\n<li>Add external editor icon to ZMI breadcrumbs for editable objects.</li>\n<li>Compiled windows helper app binary using Python 2.3.4, Pythonwin build\n163 and py2exe 0.5.</li>\n<li>Add Dreamweaver plugin contributed by Manuel Aristaránn. Thanks also\nto Anton Stonor.</li>\n<li>Add ZMI support for Zope 2.7’s ordered folder objects.</li>\n<li>Fix bug detecting basic auth info from older versions of CookieCrumber.\nThanks to David D. Smith and Federico Sevilla III.</li>\n<li>Workaround IE browser error when running over SSL. Thanks to\nMarc-Aurèle Darche.</li>\n<li>Add “.zem” file extension support for MacOS X (especially Mac IE),\nto ease helper app integration where MIME support is lacking. Thanks\nto Zac Bir.</li>\n<li>Added “long_file_name” and “file_name_separator” config options.</li>\n<li>Fixed bug which happened under Win32 when editing an Excel file\nusing the Excel plugin where the symptom was a “Call was\nrejected by callee” COM error. Thanks to Chris McDonough.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id22\">\n<h3>4/23/04 - 0.7.2 Release</h3>\n<blockquote>\n<ul>\n<li>Change default configuration to use .txt extension for text/plain only.\nAdd extensions for css and javascript files.</li>\n<li>Fixed packaging bug in Windows binary which disabled several plugins.\nThis fixes “Editor did not launch properly” errors for MSOffice\namong others.</li>\n<li>Fixed a bug where very short editing sessions where no changes were\nmade could make EE think the editor never launched. Thanks to Maik Ihde.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"release-affects-win32-binary-only\">\n<h3>11/7/03 - 0.7.1 Release (affects win32 binary only)</h3>\n<blockquote>\n<ul>\n<li>Fix encoding bug in windows binary. Thanks to Chris McDonough.</li>\n<li>Added tip for configuring IE to save files over SSL. Thanks to\nJonah Bossewitch.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id23\">\n<h3>4/1/03 - 0.7 Release</h3>\n<blockquote>\n<ul>\n<li>Added working distutils setup for Unix.</li>\n<li>You can now specify from the server that the helper app should\nborrow a lock by passing borrow_lock=1 via the request, thus\nsuppressing the dialog box which appears by default. Thanks\nto Shane Hathaway.</li>\n<li>Improved open file check in Word and Powerpoint plugins\nthanks to Yura Petrov.</li>\n<li>Added plugins for Microsoft Word, Excel and Powerpoint.</li>\n<li>Added the man page from the Debian distro. Thanks go out to\nFederico Sevilla III and Andreas Tille</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id24\">\n<h3>11/02/02 - 0.6 Release</h3>\n<blockquote>\n<ul>\n<li>Built Windows helper app using Python 2.2.2 and PythonWin 148.</li>\n<li>The externalEdit_ object now accepts a path argument to the object to\nedit, allowing URLs like: “http://zope/externalEdit_?path=/some/object”.\nThis allows external editor to play better with applications making use\nof traversal magic of their own. Thanks to Tres Seaver.</li>\n<li>Fixed NameError bug in unlock retry code. Thanks to Federico Sevilla III.</li>\n<li>Added a workaround for non-compliant SSL servers. The software now\nsilently ignores “EOF occurred in violation of protocol” errors coming\nfrom httplib. Thanks to Christopher Deckard.</li>\n<li>Removed stderr writes to cure “Invalid File Descriptor” errors on\nWindows. Thanks to Martijn Peters.</li>\n<li>Added Photoshop plugin (win32)</li>\n<li>Added HomeSite plugin (win32)</li>\n<li>Added win32 editor plugin support for the helper application.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id25\">\n<h3>8/19/02 - 0.5 Release</h3>\n<blockquote>\n<ul>\n<li>Added patch for Zope find template so that you can use external editor\ndirectly from find results in the ZMI. Thanks to Jim Washington.</li>\n<li>Factored out external editor link generator. Product now registers\na global method “externalEditLink_” which can be called to generate\nthe external editor icon link for any object.</li>\n<li>External editing is now governed by the “Use external editor” permission\nto allow non-managers to use it. Users must also have the permissions to\nedit/modify the objects they edit, plus do WebDAV locking if desired.\nThanks to Reineke and others.</li>\n<li>Unix editor command line parsing is much more robust now and properly\nhandles quoted arguments. You can also specify the “$1” placeholder in the\neditor command to denote where the content file name is inserted. If\nomitted it is appended to the end of the command line. “%1” continues to\nwork similarly for Windows. Thanks to Marc St-Jean.</li>\n<li>Fixed bug editing large (chunked) files and images. External editor now\nstreams their data properly to the client. Thanks to all the users who\nreported various symptoms of this bug.</li>\n<li>Fixed bug editing objects inside a Squishdot site. Thanks to Kevin Salt.</li>\n<li>Added the capability to borrow exising DAV locks. This allows external\neditor to play well with other systems using locks, such as CMFStaging. A\nnew configuration flag, always_borrow_locks can be set to suppress the\nborrow lock warning dialog when editing.</li>\n<li>Fixed auth bug when product was used with mysqlUserFolder. Thanks to\nViNiL.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id26\">\n<h3>6/30/02 - 0.4.2 Release (affects win32 binary only)</h3>\n<blockquote>\n<ul>\n<li>Added SSL support to Windows binary package. Thanks to Federico\nSevilla III</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id27\">\n<h3>6/29/02 - 0.4.1 Release</h3>\n<blockquote>\n<ul>\n<li>Fixed dangling dav lock bug on fatal errors. Thanks to Marc St-Jean.</li>\n<li>Fixed content_type bug, now checks if it is callable. Thanks to Arnaud\nBienvenu.</li>\n<li>Fixed bug with editing binary data on Windows. Thanks to Eric Kamm.</li>\n<li>Fixed bug setting the editor on Posix platforms.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id28\">\n<h3>6/24/02 - 0.4 Release</h3>\n<blockquote>\n<ul>\n<li>Added –version command line argument</li>\n<li>Made manage_FTPget the default source for the editable content, instead\nof document_src which was broken for CMF Wiki Pages.</li>\n<li>Fixed Windows “body_file” bug.</li>\n<li>Added binary build support for Windows using py2exe and Inno setup.</li>\n<li>Fixed Windows config file locator. It now looks in the program directory\nand then the user’s home directory (if specified)</li>\n<li>Fixed bug in Windows registry editor lookup.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id29\">\n<h3>6/16/02 - 0.3 Release</h3>\n<blockquote>\n<ul>\n<li>Improved behavior when saving after lock attempts fail.</li>\n<li>Now works on Windows (applause) using Pythonwin. Much overall\nrefactoring to abstract process control. Thanks to Oliver Deckmyn,\nGabriel Genellina and Arno Gross for testing, patches and suggestions.</li>\n<li>Added “temp_dir” configuration option for specifying a different\ntemp file directory then the OS default. Also further improved\ntemp file name generation.</li>\n<li>Added support for domain specific configuration options.</li>\n<li>Fixed trailing newline bug in encoded auth data coming from\nCookieCrumbler. Thanks to Harald Koschinski.</li>\n<li>You can now pass command line arguments to the editor in the config file,\nor wrap the editor in an xterm without using a shell script.</li>\n<li>Rewrote “Editor did not launch” error message so it makes more sense.</li>\n<li>Fixed https detection bug. External editor is now tested and working with\nhttps. Many thanks to Hans-Dieter Stich and Martin Grönemeyer for their\nassistance and ideas.</li>\n<li>Made it possible to edit objects that are methods of ZClasses. Thanks to\nJim Washington</li>\n<li>Refactored link generation code in manage_main so that it uses\nthe parent’s absolute_url rather than URL1. Thanks to\nJim Washington</li>\n<li>Removed implicit save in Configuration class destructor</li>\n<li>Added caching headers to prevent client-side caching of edit data.\nThanks to Gabriel Genellina for pointing this out.</li>\n<li>Added improved support for editing CMF documents</li>\n<li>Eliminated spurious “Editor did not launch” errors on short sessions\nor when other errors occurred.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id30\">\n<h3>5/16/02 - 0.2 Release</h3>\n<blockquote>\n<ul>\n<li>Fixed product uninstallation bug</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"id31\">\n<h3>5/15/02 - 0.1</h3>\n<blockquote>\n<ul>\n<li>Initial release</li>\n</ul>\n</blockquote>\n</div>\n</div>\n\n          </div>"}, "last_serial": 3356249, "releases": {"0.12.6": [{"comment_text": "", "digests": {"md5": "37a2c2360e4c4f2ba5451b32e3023ea6", "sha256": "61c305ae9b6eb5359a3721646d2151d9192ee81e0c1c113c07df9351d75b28c5"}, "downloads": -1, "filename": "collective.zopeedit-0.12.6-py2.6.egg", "has_sig": false, "md5_digest": "37a2c2360e4c4f2ba5451b32e3023ea6", "packagetype": "bdist_egg", "python_version": "2.6", "requires_python": null, "size": 1403419, "upload_time": "2010-11-29T10:25:50", "upload_time_iso_8601": "2010-11-29T10:25:50.451832Z", "url": "https://files.pythonhosted.org/packages/06/8d/b510207a95e8076b163c42e446e01f9f3c4d7b83c869d7b03167a29921c1/collective.zopeedit-0.12.6-py2.6.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "f8f9247a854e278cdecf411e0879bcd1", "sha256": "d26f9fcac66ec2c0b63c49e5a871671821b73df337a494b4f3c7911e3e69e066"}, "downloads": -1, "filename": "collective.zopeedit-0.12.6.tar.gz", "has_sig": false, "md5_digest": "f8f9247a854e278cdecf411e0879bcd1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1365732, "upload_time": "2010-11-29T10:25:32", "upload_time_iso_8601": "2010-11-29T10:25:32.816450Z", "url": "https://files.pythonhosted.org/packages/17/6e/068554b88375435d5da0458f281e43f254096f4d2c91fbe95e6440183b17/collective.zopeedit-0.12.6.tar.gz", "yanked": false}], "0.12.7": [{"comment_text": "", "digests": {"md5": "231b87db289511cf157987f04d8f3db8", "sha256": "eb4baa87a7312d90b76e158e17246bb97bf38b755aa57215ba322f859534ac73"}, "downloads": -1, "filename": "collective.zopeedit-0.12.7.zip", "has_sig": false, "md5_digest": "231b87db289511cf157987f04d8f3db8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1388695, "upload_time": "2010-11-29T18:45:10", "upload_time_iso_8601": "2010-11-29T18:45:10.653407Z", "url": "https://files.pythonhosted.org/packages/1a/69/dfdef74af46fb013c0459022be31bd7a8c7e792dfab0965327f1ad32d63a/collective.zopeedit-0.12.7.zip", "yanked": false}], "1.0.0": [{"comment_text": "", "digests": {"md5": "79b1e0264dacc8e9868da1142223ad8e", "sha256": "4ffe070c8b7e96f9bd8b40f04efbdd36a8f49da1493fa2be3fa83bece80d9c78"}, "downloads": -1, "filename": "collective.zopeedit-1.0.0-py2.6.egg", "has_sig": false, "md5_digest": "79b1e0264dacc8e9868da1142223ad8e", "packagetype": "bdist_egg", "python_version": "2.6", "requires_python": null, "size": 1426688, "upload_time": "2011-03-04T16:48:36", "upload_time_iso_8601": "2011-03-04T16:48:36.433444Z", "url": "https://files.pythonhosted.org/packages/46/f7/893720e85896e6080dfa6442e649f8d87da5ea8078c1414918c9e285db0c/collective.zopeedit-1.0.0-py2.6.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "ac7b6c7c5e5e6b95b8282783472f0247", "sha256": "edf84eaf526b8c7d3abc50e00f855113429be9d5979b2e86fdd3ce8aab461784"}, "downloads": -1, "filename": "collective.zopeedit-1.0.0.tar.gz", "has_sig": false, "md5_digest": "ac7b6c7c5e5e6b95b8282783472f0247", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 79909, "upload_time": "2011-03-04T16:47:46", "upload_time_iso_8601": "2011-03-04T16:47:46.882837Z", "url": "https://files.pythonhosted.org/packages/6d/c7/3174cc9c0c321ac1f62ee4ea7832a48265c095eb747a2f92cfd2c5bb779b/collective.zopeedit-1.0.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "79b1e0264dacc8e9868da1142223ad8e", "sha256": "4ffe070c8b7e96f9bd8b40f04efbdd36a8f49da1493fa2be3fa83bece80d9c78"}, "downloads": -1, "filename": "collective.zopeedit-1.0.0-py2.6.egg", "has_sig": false, "md5_digest": "79b1e0264dacc8e9868da1142223ad8e", "packagetype": "bdist_egg", "python_version": "2.6", "requires_python": null, "size": 1426688, "upload_time": "2011-03-04T16:48:36", "upload_time_iso_8601": "2011-03-04T16:48:36.433444Z", "url": "https://files.pythonhosted.org/packages/46/f7/893720e85896e6080dfa6442e649f8d87da5ea8078c1414918c9e285db0c/collective.zopeedit-1.0.0-py2.6.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "ac7b6c7c5e5e6b95b8282783472f0247", "sha256": "edf84eaf526b8c7d3abc50e00f855113429be9d5979b2e86fdd3ce8aab461784"}, "downloads": -1, "filename": "collective.zopeedit-1.0.0.tar.gz", "has_sig": false, "md5_digest": "ac7b6c7c5e5e6b95b8282783472f0247", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 79909, "upload_time": "2011-03-04T16:47:46", "upload_time_iso_8601": "2011-03-04T16:47:46.882837Z", "url": "https://files.pythonhosted.org/packages/6d/c7/3174cc9c0c321ac1f62ee4ea7832a48265c095eb747a2f92cfd2c5bb779b/collective.zopeedit-1.0.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:44:40 2020"}