{"info": {"author": "BlueDynamics Alliance", "author_email": "dev@bluedynamics.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Environment :: Web Environment", "Framework :: Plone", "Framework :: Plone :: 4.3", "Framework :: Plone :: 5.0", "Framework :: Plone :: 5.1", "License :: OSI Approved :: GNU General Public License v2 (GPLv2)", "Programming Language :: Python", "Programming Language :: Python :: 2.7", "Topic :: Internet :: WWW/HTTP", "Topic :: Internet :: WWW/HTTP :: Dynamic Content", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "============================================================\nWorkflow transition based on publication and expiration date\n============================================================\n\nOnce one of the effective range dates was reached an automatic workflow transition is executed and changes the workflow state with its managed permissions.\n\nThis is intended as an alternative implementation of the `Dexterity <http://docs.plone.org/external/plone.app.dexterity/docs/index.html>`_ IPublication behavior.\n\n.. contents:: Table of Contents\n\nMotivation\n==========\n\nBecause the Plone default publication and expiration functionality lacks in terms of security we decided to create this addon.\n\nFor instance: In default Plone if a contents publication date is not reached, it does not show up in the navigation, the search and so on.\nBut it can still be accessed directly, by entering its URL, by a json request, or in many other ways. The same is true for expired content.\n\nFor contents that need more security, we want proper security handling using zopes access control mechanism and CMF/plones workflow functionality.\n\nInstallation\n============\n\nIn your buildout or ``setup.py`` depend on ``collective.wfeffectiverange``.\n\nRun buildout.\n\nIn your profiles ``metadata.xml`` depend on ``profile-collective.wfeffectiverange:default`` or manually activate it in Plone control panels addon section.\n\nIn your content types GenericSetup XML file replace ``<element value=\"plone.app.dexterity.behaviors.metadata.IDublinCore\"/>`` by::\n\n  <element value=\"plone.app.dexterity.behaviors.metadata.IBasic\"/>\n  <element value=\"collective.wfeffectiverange.behaviors.IWFEffectiveRange\"/>\n  <element value=\"plone.app.dexterity.behaviors.metadata.ICategorization\"/>\n  <element value=\"plone.app.dexterity.behaviors.metadata.IOwnership\"/>\n\nAlternatively - when working TTW - do the same in the ``Dexterity content types`` control panel under the Behavior tab.\n\nConfigure a clock-server job with @@wfeffectiverange-ticker as method.\nHow to setup a clock-server http://docs.plone.org/develop/plone/misc/asyncronoustasks.html\n\n\nUse cases\n=========\n\nOn Publish\n----------\n\n- The user creates an unpublished content item.\n- The user sets a publication date and time in the future. With this date he has to select a valid workflow transition.\n- Valid means, it is a workflow transition which would be possible to select from plones default plone workflow menu.\n- The selected transition will be automatically executed at the given date and time.\n\n\nOn Expiration\n-------------\n\n- First the user creates and publishes the content.\n- Then the user edits again and sets a expiration date and time in the future. With this date he has to select a valid workflow transition.\n- Valid means, it is a workflow transition which would be possible to select from plones default plone workflow menu.\n- The selected transition will be automatically executed at the given date and time.\n\n\nOn Both\n-------\n\n- The user created an unpublished content.\n- Then the user sets a publication date and time in the future. With this date he has to select a valid workflow transition.\n- Valid means, it is a workflow transition which would be possible to select from plones default plone workflow menu.\n- Then he also sets an expiration date and time in the future, after the publication date.\n- With this date he has to select a valid workflow transition.\n- Here valid means, a workflow transition from the target state of the transition entered for the publication associated states.\n- The selected transitions are automatically executed at the given date and time.\n\n\nAbort manual set transition\n---------------------------\n\n- The user has set an publication or expiration date like in the use case 1, 2 or 3.\n- The user selects a workflow from the plone default workflow menu, or invokes it in any other way.\n- The workflow transition will be aborted and an error message is shown.\n\n\nPublication date in past\n------------------------\n\n- The user edits content created by use case 1 after the publication date and the transition was executed.\n- Now the publication transition field is empty and can not be set because the publication date is in the past.\n\n\nRe-Editing\n----------\n\n- The user edits content created by use case 1 after the publication date and the transition was executed.\n- Then the user can follow use case 2.\n\n\nImplementation\n==============\n\nThe use cases are implemented by providing a dexterity behavior, zope cronjob and a workflow subscriber.\n\nFor each content type where this behavior is set, it will lookup the workflow gets the possible transitions and provides them as a zope vocabulary. It will also check that the selected transitions don't interfere with each other.\n\nUnder the edit section, the dates tab will be replaced.\nThis behavior will replace publication/expiration fields within the dates tab and adds a fields to select the target workflow transition, including vocabularies, validations and invariants.\n\nA server-side json view delivers the transitions for the expiration date after a publishing date is set, in order to provide a proper vocabulary.\n\nIn order to make it work, you have to configure a cron job to check if the desired workflow transition date has been met. See install section\n\n\nLimitations\n===========\n\nNo support if a content type has two workflows.\n\n\nSource Code and Contributions\n=============================\n\nIf you want to help with the development (reporting, improvement, update, bug-fixing, ...) of ``collective.wfeffectiverange`` this is a great idea!\n\nPlease file any issues or ideas for enhancement at the `issue tracker <https://github.com/collective/collective.wfeffectiverange/issues>`_.\n\nThe code is located in the `github collective <https://github.com/collective/collective.wfeffectiverange>`_.\n\nYou can clone it or `get access to the github-collective <http://collective.github.com/>`_ and work directly on the project.\n\nMaintainer is Jens Klein and the BlueDynamics Alliance developer team. We appreciate any contribution and if a release is needed to be done on pypi,\nplease just contact one of us `dev@bluedynamics dot com <mailto:dev@bluedynamics.com>`_\n\nContributors\n============\n\n- Benjamin Stefaner <bs@kleinundpartner.at> - development\n\n- Jens W. Klein <jens@bluedynamics.com> - development\n\n- Peter Holzer <peter.holzer@agitator.com> - use case, development\n\n\nChanges\n=======\n\n2.0.0 (2016-12-08)\n------------------\n\n- Upgrade for Plone5/Plone4 compatibility\n  [agitator]\n\n\n1.8.2 (unreleased)\n------------------\n\n- Nothing changed yet.\n\n\n1.8.1 (2016-12-08)\n------------------\n\n- Fix #3: ``KeyError: u'--NOVALUE--'`` if nothing selected within behavior tab.\n  [jensens]\n\n\n1.8.0 (2016-11-24)\n------------------\n\n- Fix: Refactor vocabulary in order to be simpler and to take submitted form data into account.\n  [jensens]\n\n- Fix: Translate transitions\n  [jensens]\n\n- Fix: addform used parents transition vocabulary.\n  [jensens]\n\n- Removed plone4cron dependency\n  [jensens]\n\n- Code overhaul.\n  [jensens]\n\n\n1.7.1 (2015-11-30)\n------------------\n\n- Fixed target state vocab reload with plone4.csrffixes\n\n\n1.7 (2015-10-30)\n----------------\n\n- support for plone.protect and plone4.csrffixes\n  [agitator]\n\n- load js only for authenticated users\n  [agitator]\n\n\n1.6 (2015-02-04)\n----------------\n\n- support for translations with plone.app.multilingual\n- disabled interfering inline validation\n  [agitator]\n\n\n1.5 (2014-12-18)\n----------------\n\n- added german translations\n- js fix for existing expiration transition\n- no caching/merging for ajax reload-vocab\n  [agitator]\n\n\n1.4 (2014-10-20)\n----------------\n\n- Bugfix: Subscriber had a problem with both transitions set.\n  [jensens, 2014-10-20]\n\n\n1.3 (2014-10-20)\n----------------\n\n- Bugfix: Marker interface on behavior was missing after a change so indexer\n  did not grip. Due to a bug in plone.app.dexterity itself we cant procide\n  the marker. So we bind the indexer to a general interface.\n  [jensens, 2014-10-20]\n\n\n1.2 (2014-10-18)\n----------------\n\n- Bugfix: Set a default to not fail if no transition was set initially.\n  [jensens, 2014-10-18]\n\n1.1 (2014-09-23)\n----------------\n\n- fix: keep transition after form validation error. respect base_url for view\n  calls. fixes with vocab fetching.\n  [benniboy, 2014-09-23]\n\n1.0.1 (2014-09-22)\n------------------\n\n- fix: ticker view name was wrong.\n  [jensens, 2014-09-22]\n\n1.0 (2014-09-22)\n----------------\n\n- Initial implementation.\n  [jensens, benniboy, 2014-09-22]\n\nLicense\n=======\n\nCopyright (c) 2014, BlueDynamics Alliance, Austria, Switzerland, Germany\n\nGNU GENERAL PUBLIC LICENSE\n\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n0. This License applies to any program or other work which contains\n   a notice placed by the copyright holder saying it may be distributed\n   under the terms of this General Public License.  The \"Program\", below,\n   refers to any such program or work, and a \"work based on the Program\"\n   means either the Program or any derivative work under copyright law:\n   that is to say, a work containing the Program or a portion of it,\n   either verbatim or with modifications and/or translated into another\n   language.  (Hereinafter, translation is included without limitation in\n   the term \"modification\".)  Each licensee is addressed as \"you\".\n\n   Activities other than copying, distribution and modification are not\n   covered by this License; they are outside its scope.  The act of\n   running the Program is not restricted, and the output from the Program\n   is covered only if its contents constitute a work based on the\n   Program (independent of having been made by running the Program).\n   Whether that is true depends on what the Program does.\n\n1. You may copy and distribute verbatim copies of the Program's\n   source code as you receive it, in any medium, provided that you\n   conspicuously and appropriately publish on each copy an appropriate\n   copyright notice and disclaimer of warranty; keep intact all the\n   notices that refer to this License and to the absence of any warranty;\n   and give any other recipients of the Program a copy of this License\n   along with the Program.\n\n   You may charge a fee for the physical act of transferring a copy, and\n   you may at your option offer warranty protection in exchange for a fee.\n\n2  You may modify your copy or copies of the Program or any portion\n   of it, thus forming a work based on the Program, and copy and\n   distribute such modifications or work under the terms of Section 1\n   above, provided that you also meet all of these conditions:\n\n   a) You must cause the modified files to carry prominent notices\n   stating that you changed the files and the date of any change.\n\n   b) You must cause any work that you distribute or publish, that in\n   whole or in part contains or is derived from the Program or any\n   part thereof, to be licensed as a whole at no charge to all third\n   parties under the terms of this License.\n\n   c) If the modified program normally reads commands interactively\n   when run, you must cause it, when started running for such\n   interactive use in the most ordinary way, to print or display an\n   announcement including an appropriate copyright notice and a\n   notice that there is no warranty (or else, saying that you provide\n   a warranty) and that users may redistribute the program under\n   these conditions, and telling the user how to view a copy of this\n   License.  (Exception: if the Program itself is interactive but\n   does not normally print such an announcement, your work based on\n   the Program is not required to print an announcement.)\n\n   These requirements apply to the modified work as a whole.  If\n   identifiable sections of that work are not derived from the Program,\n   and can be reasonably considered independent and separate works in\n   themselves, then this License, and its terms, do not apply to those\n   sections when you distribute them as separate works.  But when you\n   distribute the same sections as part of a whole which is a work based\n   on the Program, the distribution of the whole must be on the terms of\n   this License, whose permissions for other licensees extend to the\n   entire whole, and thus to each and every part regardless of who wrote it.\n\n   Thus, it is not the intent of this section to claim rights or contest\n   your rights to work written entirely by you; rather, the intent is to\n   exercise the right to control the distribution of derivative or\n   collective works based on the Program.\n\n   In addition, mere aggregation of another work not based on the Program\n   with the Program (or with a work based on the Program) on a volume of\n   a storage or distribution medium does not bring the other work under\n   the scope of this License.\n\n3. You may copy and distribute the Program (or a work based on it,\n   under Section 2) in object code or executable form under the terms of\n   Sections 1 and 2 above provided that you also do one of the following:\n\n   a) Accompany it with the complete corresponding machine-readable\n   source code, which must be distributed under the terms of Sections\n   1 and 2 above on a medium customarily used for software interchange; or,\n\n   b) Accompany it with a written offer, valid for at least three\n   years, to give any third party, for a charge no more than your\n   cost of physically performing source distribution, a complete\n   machine-readable copy of the corresponding source code, to be\n   distributed under the terms of Sections 1 and 2 above on a medium\n   customarily used for software interchange; or,\n\n   c) Accompany it with the information you received as to the offer\n   to distribute corresponding source code.  (This alternative is\n   allowed only for noncommercial distribution and only if you\n   received the program in object code or executable form with such\n   an offer, in accord with Subsection b above.)\n\n   The source code for a work means the preferred form of the work for\n   making modifications to it.  For an executable work, complete source\n   code means all the source code for all modules it contains, plus any\n   associated interface definition files, plus the scripts used to\n   control compilation and installation of the executable.  However, as a\n   special exception, the source code distributed need not include\n   anything that is normally distributed (in either source or binary\n   form) with the major components (compiler, kernel, and so on) of the\n   operating system on which the executable runs, unless that component\n   itself accompanies the executable.\n\n   If distribution of executable or object code is made by offering\n   access to copy from a designated place, then offering equivalent\n   access to copy the source code from the same place counts as\n   distribution of the source code, even though third parties are not\n   compelled to copy the source along with the object code.\n\n4. You may not copy, modify, sublicense, or distribute the Program\n   except as expressly provided under this License.  Any attempt\n   otherwise to copy, modify, sublicense or distribute the Program is\n   void, and will automatically terminate your rights under this License.\n   However, parties who have received copies, or rights, from you under\n   this License will not have their licenses terminated so long as such\n   parties remain in full compliance.\n\n5. You are not required to accept this License, since you have not\n   signed it.  However, nothing else grants you permission to modify or\n   distribute the Program or its derivative works.  These actions are\n   prohibited by law if you do not accept this License.  Therefore, by\n   modifying or distributing the Program (or any work based on the\n   Program), you indicate your acceptance of this License to do so, and\n   all its terms and conditions for copying, distributing or modifying\n   the Program or works based on it.\n\n6. Each time you redistribute the Program (or any work based on the\n   Program), the recipient automatically receives a license from the\n   original licensor to copy, distribute or modify the Program subject to\n   these terms and conditions.  You may not impose any further\n   restrictions on the recipients' exercise of the rights granted herein.\n   You are not responsible for enforcing compliance by third parties to\n   this License.\n\n7. If, as a consequence of a court judgment or allegation of patent\n   infringement or for any other reason (not limited to patent issues),\n   conditions are imposed on you (whether by court order, agreement or\n   otherwise) that contradict the conditions of this License, they do not\n   excuse you from the conditions of this License.  If you cannot\n   distribute so as to satisfy simultaneously your obligations under this\n   License and any other pertinent obligations, then as a consequence you\n   may not distribute the Program at all.  For example, if a patent\n   license would not permit royalty-free redistribution of the Program by\n   all those who receive copies directly or indirectly through you, then\n   the only way you could satisfy both it and this License would be to\n   refrain entirely from distribution of the Program.\n\n   If any portion of this section is held invalid or unenforceable under\n   any particular circumstance, the balance of the section is intended to\n   apply and the section as a whole is intended to apply in other\n   circumstances.\n\n   It is not the purpose of this section to induce you to infringe any\n   patents or other property right claims or to contest validity of any\n   such claims; this section has the sole purpose of protecting the\n   integrity of the free software distribution system, which is\n   implemented by public license practices.  Many people have made\n   generous contributions to the wide range of software distributed\n   through that system in reliance on consistent application of that\n   system; it is up to the author/donor to decide if he or she is willing\n   to distribute software through any other system and a licensee cannot\n   impose that choice.\n\n   This section is intended to make thoroughly clear what is believed to\n   be a consequence of the rest of this License.\n\n8. If the distribution and/or use of the Program is restricted in\n   certain countries either by patents or by copyrighted interfaces, the\n   original copyright holder who places the Program under this License\n   may add an explicit geographical distribution limitation excluding\n   those countries, so that distribution is permitted only in or among\n   countries not thus excluded.  In such case, this License incorporates\n   the limitation as if written in the body of this License.\n\n9. The Free Software Foundation may publish revised and/or new versions\n   of the General Public License from time to time.  Such new versions will\n   be similar in spirit to the present version, but may differ in detail to\n   address new problems or concerns.\n\n   Each version is given a distinguishing version number.  If the Program\n   specifies a version number of this License which applies to it and \"any\n   later version\", you have the option of following the terms and conditions\n   either of that version or of any later version published by the Free\n   Software Foundation.  If the Program does not specify a version number of\n   this License, you may choose any version ever published by the Free Software\n   Foundation.\n\n10. If you wish to incorporate parts of the Program into other free\n    programs whose distribution conditions are different, write to the author\n    to ask for permission.  For software which is copyrighted by the Free\n    Software Foundation, write to the Free Software Foundation; we sometimes\n    make exceptions for this.  Our decision will be guided by the two goals\n    of preserving the free status of all derivatives of our free software and\n    of promoting the sharing and reuse of software generally.\n\nNO WARRANTY\n\n11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\n    FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\n    OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\n    PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\n    OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n    MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\n    TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\n    PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\n    REPAIR OR CORRECTION.\n\n12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\n    WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\n    REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\n    INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\n    OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\n    TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\n    YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\n    PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\n    POSSIBILITY OF SUCH DAMAGES.\n\nEND OF TERMS AND CONDITIONS", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://pypi.python.org/pypi/collective.wfeffectiverange", "keywords": "workflow cms security zope plone publication date", "license": "GNU General Public Licence", "maintainer": "", "maintainer_email": "", "name": "collective.wfeffectiverange", "package_url": "https://pypi.org/project/collective.wfeffectiverange/", "platform": "", "project_url": "https://pypi.org/project/collective.wfeffectiverange/", "project_urls": {"Homepage": "https://pypi.python.org/pypi/collective.wfeffectiverange"}, "release_url": "https://pypi.org/project/collective.wfeffectiverange/2.0.0/", "requires_dist": null, "requires_python": "", "summary": "Workflowed effective range (Plone/Dexterity)", "version": "2.0.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>Once one of the effective range dates was reached an automatic workflow transition is executed and changes the workflow state with its managed permissions.</p>\n<p>This is intended as an alternative implementation of the <a href=\"http://docs.plone.org/external/plone.app.dexterity/docs/index.html\" rel=\"nofollow\">Dexterity</a> IPublication behavior.</p>\n<div id=\"table-of-contents\">\n<p>Table of Contents</p>\n<ul>\n<li><a href=\"#motivation\" id=\"id14\" rel=\"nofollow\">Motivation</a></li>\n<li><a href=\"#installation\" id=\"id15\" rel=\"nofollow\">Installation</a></li>\n<li><a href=\"#use-cases\" id=\"id16\" rel=\"nofollow\">Use cases</a><ul>\n<li><a href=\"#on-publish\" id=\"id17\" rel=\"nofollow\">On Publish</a></li>\n<li><a href=\"#on-expiration\" id=\"id18\" rel=\"nofollow\">On Expiration</a></li>\n<li><a href=\"#on-both\" id=\"id19\" rel=\"nofollow\">On Both</a></li>\n<li><a href=\"#abort-manual-set-transition\" id=\"id20\" rel=\"nofollow\">Abort manual set transition</a></li>\n<li><a href=\"#publication-date-in-past\" id=\"id21\" rel=\"nofollow\">Publication date in past</a></li>\n<li><a href=\"#re-editing\" id=\"id22\" rel=\"nofollow\">Re-Editing</a></li>\n</ul>\n</li>\n<li><a href=\"#implementation\" id=\"id23\" rel=\"nofollow\">Implementation</a></li>\n<li><a href=\"#limitations\" id=\"id24\" rel=\"nofollow\">Limitations</a></li>\n<li><a href=\"#source-code-and-contributions\" id=\"id25\" rel=\"nofollow\">Source Code and Contributions</a></li>\n<li><a href=\"#contributors\" id=\"id26\" rel=\"nofollow\">Contributors</a></li>\n<li><a href=\"#changes\" id=\"id27\" rel=\"nofollow\">Changes</a><ul>\n<li><a href=\"#id1\" id=\"id28\" rel=\"nofollow\">2.0.0 (2016-12-08)</a></li>\n<li><a href=\"#unreleased\" id=\"id29\" rel=\"nofollow\">1.8.2 (unreleased)</a></li>\n<li><a href=\"#id2\" id=\"id30\" rel=\"nofollow\">1.8.1 (2016-12-08)</a></li>\n<li><a href=\"#id3\" id=\"id31\" rel=\"nofollow\">1.8.0 (2016-11-24)</a></li>\n<li><a href=\"#id4\" id=\"id32\" rel=\"nofollow\">1.7.1 (2015-11-30)</a></li>\n<li><a href=\"#id5\" id=\"id33\" rel=\"nofollow\">1.7 (2015-10-30)</a></li>\n<li><a href=\"#id6\" id=\"id34\" rel=\"nofollow\">1.6 (2015-02-04)</a></li>\n<li><a href=\"#id7\" id=\"id35\" rel=\"nofollow\">1.5 (2014-12-18)</a></li>\n<li><a href=\"#id8\" id=\"id36\" rel=\"nofollow\">1.4 (2014-10-20)</a></li>\n<li><a href=\"#id9\" id=\"id37\" rel=\"nofollow\">1.3 (2014-10-20)</a></li>\n<li><a href=\"#id10\" id=\"id38\" rel=\"nofollow\">1.2 (2014-10-18)</a></li>\n<li><a href=\"#id11\" id=\"id39\" rel=\"nofollow\">1.1 (2014-09-23)</a></li>\n<li><a href=\"#id12\" id=\"id40\" rel=\"nofollow\">1.0.1 (2014-09-22)</a></li>\n<li><a href=\"#id13\" id=\"id41\" rel=\"nofollow\">1.0 (2014-09-22)</a></li>\n</ul>\n</li>\n<li><a href=\"#license\" id=\"id42\" rel=\"nofollow\">License</a></li>\n</ul>\n</div>\n<div id=\"motivation\">\n<h2><a href=\"#id14\" rel=\"nofollow\">Motivation</a></h2>\n<p>Because the Plone default publication and expiration functionality lacks in terms of security we decided to create this addon.</p>\n<p>For instance: In default Plone if a contents publication date is not reached, it does not show up in the navigation, the search and so on.\nBut it can still be accessed directly, by entering its URL, by a json request, or in many other ways. The same is true for expired content.</p>\n<p>For contents that need more security, we want proper security handling using zopes access control mechanism and CMF/plones workflow functionality.</p>\n</div>\n<div id=\"installation\">\n<h2><a href=\"#id15\" rel=\"nofollow\">Installation</a></h2>\n<p>In your buildout or <tt>setup.py</tt> depend on <tt>collective.wfeffectiverange</tt>.</p>\n<p>Run buildout.</p>\n<p>In your profiles <tt>metadata.xml</tt> depend on <tt><span class=\"pre\">profile-collective.wfeffectiverange:default</span></tt> or manually activate it in Plone control panels addon section.</p>\n<p>In your content types GenericSetup XML file replace <tt>&lt;element <span class=\"pre\">value=\"plone.app.dexterity.behaviors.metadata.IDublinCore\"/&gt;</span></tt> by:</p>\n<pre>&lt;element value=\"plone.app.dexterity.behaviors.metadata.IBasic\"/&gt;\n&lt;element value=\"collective.wfeffectiverange.behaviors.IWFEffectiveRange\"/&gt;\n&lt;element value=\"plone.app.dexterity.behaviors.metadata.ICategorization\"/&gt;\n&lt;element value=\"plone.app.dexterity.behaviors.metadata.IOwnership\"/&gt;\n</pre>\n<p>Alternatively - when working TTW - do the same in the <tt>Dexterity content types</tt> control panel under the Behavior tab.</p>\n<p>Configure a clock-server job with @@wfeffectiverange-ticker as method.\nHow to setup a clock-server <a href=\"http://docs.plone.org/develop/plone/misc/asyncronoustasks.html\" rel=\"nofollow\">http://docs.plone.org/develop/plone/misc/asyncronoustasks.html</a></p>\n</div>\n<div id=\"use-cases\">\n<h2><a href=\"#id16\" rel=\"nofollow\">Use cases</a></h2>\n<div id=\"on-publish\">\n<h3><a href=\"#id17\" rel=\"nofollow\">On Publish</a></h3>\n<ul>\n<li>The user creates an unpublished content item.</li>\n<li>The user sets a publication date and time in the future. With this date he has to select a valid workflow transition.</li>\n<li>Valid means, it is a workflow transition which would be possible to select from plones default plone workflow menu.</li>\n<li>The selected transition will be automatically executed at the given date and time.</li>\n</ul>\n</div>\n<div id=\"on-expiration\">\n<h3><a href=\"#id18\" rel=\"nofollow\">On Expiration</a></h3>\n<ul>\n<li>First the user creates and publishes the content.</li>\n<li>Then the user edits again and sets a expiration date and time in the future. With this date he has to select a valid workflow transition.</li>\n<li>Valid means, it is a workflow transition which would be possible to select from plones default plone workflow menu.</li>\n<li>The selected transition will be automatically executed at the given date and time.</li>\n</ul>\n</div>\n<div id=\"on-both\">\n<h3><a href=\"#id19\" rel=\"nofollow\">On Both</a></h3>\n<ul>\n<li>The user created an unpublished content.</li>\n<li>Then the user sets a publication date and time in the future. With this date he has to select a valid workflow transition.</li>\n<li>Valid means, it is a workflow transition which would be possible to select from plones default plone workflow menu.</li>\n<li>Then he also sets an expiration date and time in the future, after the publication date.</li>\n<li>With this date he has to select a valid workflow transition.</li>\n<li>Here valid means, a workflow transition from the target state of the transition entered for the publication associated states.</li>\n<li>The selected transitions are automatically executed at the given date and time.</li>\n</ul>\n</div>\n<div id=\"abort-manual-set-transition\">\n<h3><a href=\"#id20\" rel=\"nofollow\">Abort manual set transition</a></h3>\n<ul>\n<li>The user has set an publication or expiration date like in the use case 1, 2 or 3.</li>\n<li>The user selects a workflow from the plone default workflow menu, or invokes it in any other way.</li>\n<li>The workflow transition will be aborted and an error message is shown.</li>\n</ul>\n</div>\n<div id=\"publication-date-in-past\">\n<h3><a href=\"#id21\" rel=\"nofollow\">Publication date in past</a></h3>\n<ul>\n<li>The user edits content created by use case 1 after the publication date and the transition was executed.</li>\n<li>Now the publication transition field is empty and can not be set because the publication date is in the past.</li>\n</ul>\n</div>\n<div id=\"re-editing\">\n<h3><a href=\"#id22\" rel=\"nofollow\">Re-Editing</a></h3>\n<ul>\n<li>The user edits content created by use case 1 after the publication date and the transition was executed.</li>\n<li>Then the user can follow use case 2.</li>\n</ul>\n</div>\n</div>\n<div id=\"implementation\">\n<h2><a href=\"#id23\" rel=\"nofollow\">Implementation</a></h2>\n<p>The use cases are implemented by providing a dexterity behavior, zope cronjob and a workflow subscriber.</p>\n<p>For each content type where this behavior is set, it will lookup the workflow gets the possible transitions and provides them as a zope vocabulary. It will also check that the selected transitions don’t interfere with each other.</p>\n<p>Under the edit section, the dates tab will be replaced.\nThis behavior will replace publication/expiration fields within the dates tab and adds a fields to select the target workflow transition, including vocabularies, validations and invariants.</p>\n<p>A server-side json view delivers the transitions for the expiration date after a publishing date is set, in order to provide a proper vocabulary.</p>\n<p>In order to make it work, you have to configure a cron job to check if the desired workflow transition date has been met. See install section</p>\n</div>\n<div id=\"limitations\">\n<h2><a href=\"#id24\" rel=\"nofollow\">Limitations</a></h2>\n<p>No support if a content type has two workflows.</p>\n</div>\n<div id=\"source-code-and-contributions\">\n<h2><a href=\"#id25\" rel=\"nofollow\">Source Code and Contributions</a></h2>\n<p>If you want to help with the development (reporting, improvement, update, bug-fixing, …) of <tt>collective.wfeffectiverange</tt> this is a great idea!</p>\n<p>Please file any issues or ideas for enhancement at the <a href=\"https://github.com/collective/collective.wfeffectiverange/issues\" rel=\"nofollow\">issue tracker</a>.</p>\n<p>The code is located in the <a href=\"https://github.com/collective/collective.wfeffectiverange\" rel=\"nofollow\">github collective</a>.</p>\n<p>You can clone it or <a href=\"http://collective.github.com/\" rel=\"nofollow\">get access to the github-collective</a> and work directly on the project.</p>\n<p>Maintainer is Jens Klein and the BlueDynamics Alliance developer team. We appreciate any contribution and if a release is needed to be done on pypi,\nplease just contact one of us <a href=\"mailto:dev%40bluedynamics.com\">dev<span>@</span>bluedynamics dot com</a></p>\n</div>\n<div id=\"contributors\">\n<h2><a href=\"#id26\" rel=\"nofollow\">Contributors</a></h2>\n<ul>\n<li>Benjamin Stefaner &lt;<a href=\"mailto:bs%40kleinundpartner.at\">bs<span>@</span>kleinundpartner<span>.</span>at</a>&gt; - development</li>\n<li>Jens W. Klein &lt;<a href=\"mailto:jens%40bluedynamics.com\">jens<span>@</span>bluedynamics<span>.</span>com</a>&gt; - development</li>\n<li>Peter Holzer &lt;<a href=\"mailto:peter.holzer%40agitator.com\">peter<span>.</span>holzer<span>@</span>agitator<span>.</span>com</a>&gt; - use case, development</li>\n</ul>\n</div>\n<div id=\"changes\">\n<h2><a href=\"#id27\" rel=\"nofollow\">Changes</a></h2>\n<div id=\"id1\">\n<h3><a href=\"#id28\" rel=\"nofollow\">2.0.0 (2016-12-08)</a></h3>\n<ul>\n<li>Upgrade for Plone5/Plone4 compatibility\n[agitator]</li>\n</ul>\n</div>\n<div id=\"unreleased\">\n<h3><a href=\"#id29\" rel=\"nofollow\">1.8.2 (unreleased)</a></h3>\n<ul>\n<li>Nothing changed yet.</li>\n</ul>\n</div>\n<div id=\"id2\">\n<h3><a href=\"#id30\" rel=\"nofollow\">1.8.1 (2016-12-08)</a></h3>\n<ul>\n<li>Fix #3: <tt>KeyError: <span class=\"pre\">u'--NOVALUE--'</span></tt> if nothing selected within behavior tab.\n[jensens]</li>\n</ul>\n</div>\n<div id=\"id3\">\n<h3><a href=\"#id31\" rel=\"nofollow\">1.8.0 (2016-11-24)</a></h3>\n<ul>\n<li>Fix: Refactor vocabulary in order to be simpler and to take submitted form data into account.\n[jensens]</li>\n<li>Fix: Translate transitions\n[jensens]</li>\n<li>Fix: addform used parents transition vocabulary.\n[jensens]</li>\n<li>Removed plone4cron dependency\n[jensens]</li>\n<li>Code overhaul.\n[jensens]</li>\n</ul>\n</div>\n<div id=\"id4\">\n<h3><a href=\"#id32\" rel=\"nofollow\">1.7.1 (2015-11-30)</a></h3>\n<ul>\n<li>Fixed target state vocab reload with plone4.csrffixes</li>\n</ul>\n</div>\n<div id=\"id5\">\n<h3><a href=\"#id33\" rel=\"nofollow\">1.7 (2015-10-30)</a></h3>\n<ul>\n<li>support for plone.protect and plone4.csrffixes\n[agitator]</li>\n<li>load js only for authenticated users\n[agitator]</li>\n</ul>\n</div>\n<div id=\"id6\">\n<h3><a href=\"#id34\" rel=\"nofollow\">1.6 (2015-02-04)</a></h3>\n<ul>\n<li>support for translations with plone.app.multilingual</li>\n<li>disabled interfering inline validation\n[agitator]</li>\n</ul>\n</div>\n<div id=\"id7\">\n<h3><a href=\"#id35\" rel=\"nofollow\">1.5 (2014-12-18)</a></h3>\n<ul>\n<li>added german translations</li>\n<li>js fix for existing expiration transition</li>\n<li>no caching/merging for ajax reload-vocab\n[agitator]</li>\n</ul>\n</div>\n<div id=\"id8\">\n<h3><a href=\"#id36\" rel=\"nofollow\">1.4 (2014-10-20)</a></h3>\n<ul>\n<li>Bugfix: Subscriber had a problem with both transitions set.\n[jensens, 2014-10-20]</li>\n</ul>\n</div>\n<div id=\"id9\">\n<h3><a href=\"#id37\" rel=\"nofollow\">1.3 (2014-10-20)</a></h3>\n<ul>\n<li>Bugfix: Marker interface on behavior was missing after a change so indexer\ndid not grip. Due to a bug in plone.app.dexterity itself we cant procide\nthe marker. So we bind the indexer to a general interface.\n[jensens, 2014-10-20]</li>\n</ul>\n</div>\n<div id=\"id10\">\n<h3><a href=\"#id38\" rel=\"nofollow\">1.2 (2014-10-18)</a></h3>\n<ul>\n<li>Bugfix: Set a default to not fail if no transition was set initially.\n[jensens, 2014-10-18]</li>\n</ul>\n</div>\n<div id=\"id11\">\n<h3><a href=\"#id39\" rel=\"nofollow\">1.1 (2014-09-23)</a></h3>\n<ul>\n<li>fix: keep transition after form validation error. respect base_url for view\ncalls. fixes with vocab fetching.\n[benniboy, 2014-09-23]</li>\n</ul>\n</div>\n<div id=\"id12\">\n<h3><a href=\"#id40\" rel=\"nofollow\">1.0.1 (2014-09-22)</a></h3>\n<ul>\n<li>fix: ticker view name was wrong.\n[jensens, 2014-09-22]</li>\n</ul>\n</div>\n<div id=\"id13\">\n<h3><a href=\"#id41\" rel=\"nofollow\">1.0 (2014-09-22)</a></h3>\n<ul>\n<li>Initial implementation.\n[jensens, benniboy, 2014-09-22]</li>\n</ul>\n</div>\n</div>\n<div id=\"license\">\n<h2><a href=\"#id42\" rel=\"nofollow\">License</a></h2>\n<p>Copyright (c) 2014, BlueDynamics Alliance, Austria, Switzerland, Germany</p>\n<p>GNU GENERAL PUBLIC LICENSE</p>\n<p>TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION</p>\n<ol>\n<li><p>This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The “Program”, below,\nrefers to any such program or work, and a “work based on the Program”\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term “modification”.)  Each licensee is addressed as “you”.</p>\n<p>Activities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.</p>\n</li>\n<li><p>You may copy and distribute verbatim copies of the Program’s\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.</p>\n<p>You may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.</p>\n</li>\n</ol>\n<dl>\n<dt>2  You may modify your copy or copies of the Program or any portion</dt>\n<dd><p>of it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:</p>\n<p>a) You must cause the modified files to carry prominent notices\nstating that you changed the files and the date of any change.</p>\n<p>b) You must cause any work that you distribute or publish, that in\nwhole or in part contains or is derived from the Program or any\npart thereof, to be licensed as a whole at no charge to all third\nparties under the terms of this License.</p>\n<p>c) If the modified program normally reads commands interactively\nwhen run, you must cause it, when started running for such\ninteractive use in the most ordinary way, to print or display an\nannouncement including an appropriate copyright notice and a\nnotice that there is no warranty (or else, saying that you provide\na warranty) and that users may redistribute the program under\nthese conditions, and telling the user how to view a copy of this\nLicense.  (Exception: if the Program itself is interactive but\ndoes not normally print such an announcement, your work based on\nthe Program is not required to print an announcement.)</p>\n<p>These requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.</p>\n<p>Thus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.</p>\n<p>In addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.</p>\n</dd>\n</dl>\n<ol>\n<li><p>You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:</p>\n<p>a) Accompany it with the complete corresponding machine-readable\nsource code, which must be distributed under the terms of Sections\n1 and 2 above on a medium customarily used for software interchange; or,</p>\n<p>b) Accompany it with a written offer, valid for at least three\nyears, to give any third party, for a charge no more than your\ncost of physically performing source distribution, a complete\nmachine-readable copy of the corresponding source code, to be\ndistributed under the terms of Sections 1 and 2 above on a medium\ncustomarily used for software interchange; or,</p>\n<p>c) Accompany it with the information you received as to the offer\nto distribute corresponding source code.  (This alternative is\nallowed only for noncommercial distribution and only if you\nreceived the program in object code or executable form with such\nan offer, in accord with Subsection b above.)</p>\n<p>The source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.</p>\n<p>If distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.</p>\n</li>\n<li><p>You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.</p>\n</li>\n<li><p>You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.</p>\n</li>\n<li><p>Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients’ exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.</p>\n</li>\n<li><p>If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.</p>\n<p>If any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.</p>\n<p>It is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.</p>\n<p>This section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.</p>\n</li>\n<li><p>If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.</p>\n</li>\n<li><p>The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.</p>\n<p>Each version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and “any\nlater version”, you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.</p>\n</li>\n<li><p>If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.</p>\n</li>\n</ol>\n<p>NO WARRANTY</p>\n<ol>\n<li>BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM “AS IS” WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.</li>\n<li>IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.</li>\n</ol>\n<p>END OF TERMS AND CONDITIONS</p>\n</div>\n\n          </div>"}, "last_serial": 2507072, "releases": {"1.0": [{"comment_text": "", "digests": {"md5": "f3f210ce30374bb94de4507e0d3f00cb", "sha256": "d88ef185adb73ed34e5921702e18ec4bbb4e612fe8cfb76d84f54de1c5a9bd26"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.0.zip", "has_sig": false, "md5_digest": "f3f210ce30374bb94de4507e0d3f00cb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 33193, "upload_time": "2014-09-22T09:27:18", "upload_time_iso_8601": "2014-09-22T09:27:18.107586Z", "url": "https://files.pythonhosted.org/packages/a4/a0/fc0a3cabdcb00ec7c4d9271b8d9cff2b5a1865ec87ce2a540070abf1449f/collective.wfeffectiverange-1.0.zip", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "eb9eed19c13938a482c5577d684b877b", "sha256": "e868e5c28004e602fc1cde7786216d588d895cd89c75a184dac42874760ccbc0"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.0.1.zip", "has_sig": false, "md5_digest": "eb9eed19c13938a482c5577d684b877b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 37589, "upload_time": "2014-09-22T09:42:57", "upload_time_iso_8601": "2014-09-22T09:42:57.087618Z", "url": "https://files.pythonhosted.org/packages/1c/06/798bfa96e8bcf086734a4f6494018dfccdbac4bf4d0728a66723c3a0d809/collective.wfeffectiverange-1.0.1.zip", "yanked": false}], "1.1": [{"comment_text": "", "digests": {"md5": "687118299474c358e3cdc5eb08a3bfa0", "sha256": "6a3edc3bacb5ebab28174907043eb074a76cc41fa659e464fb08c6fb7f9ed3cc"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.1.zip", "has_sig": false, "md5_digest": "687118299474c358e3cdc5eb08a3bfa0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 38007, "upload_time": "2014-09-23T11:00:37", "upload_time_iso_8601": "2014-09-23T11:00:37.330488Z", "url": "https://files.pythonhosted.org/packages/7b/68/887fd10f0770ed2934dd7313e7a9b11a09bb30a0248c85255538a4ae0b62/collective.wfeffectiverange-1.1.zip", "yanked": false}], "1.2": [{"comment_text": "", "digests": {"md5": "8f44fb3ee165ea84c1c3e061c340468d", "sha256": "6cc08d74bdb476d79aff994f65c900de9586c5addc6bab1124f0d49ae721f516"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.2.zip", "has_sig": false, "md5_digest": "8f44fb3ee165ea84c1c3e061c340468d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 38208, "upload_time": "2014-10-18T13:21:54", "upload_time_iso_8601": "2014-10-18T13:21:54.607648Z", "url": "https://files.pythonhosted.org/packages/bf/ef/acb4528fac7edc5240106b6b5ab10d1d6957c8673136a49c5884c992432c/collective.wfeffectiverange-1.2.zip", "yanked": false}], "1.3": [{"comment_text": "", "digests": {"md5": "ca1eaa09ffe22b8ddcedc94b2f80a301", "sha256": "03eef53ce7aeec606f42cffefaa0fc62d35511c6d4044bb046cfd92a95020662"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.3.zip", "has_sig": false, "md5_digest": "ca1eaa09ffe22b8ddcedc94b2f80a301", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 38680, "upload_time": "2014-10-20T13:34:04", "upload_time_iso_8601": "2014-10-20T13:34:04.261218Z", "url": "https://files.pythonhosted.org/packages/35/c7/86ae192a9bcc9521dbb1ceed564c5efe78ed65b632ca16453fa7c936d624/collective.wfeffectiverange-1.3.zip", "yanked": false}], "1.4": [{"comment_text": "", "digests": {"md5": "45dad9d7f755382e300da8b8a8f73f9f", "sha256": "40fd58c42a8b116cbcdc5142c0cc28c72676f91c6f44b6f80ea98279539a0e2b"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.4.zip", "has_sig": false, "md5_digest": "45dad9d7f755382e300da8b8a8f73f9f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 38802, "upload_time": "2014-10-20T15:22:03", "upload_time_iso_8601": "2014-10-20T15:22:03.509549Z", "url": "https://files.pythonhosted.org/packages/12/24/9e8343c5d7f6fe8e91578a9694af5a6b423c4a2d881d75f8ec616c4c5abb/collective.wfeffectiverange-1.4.zip", "yanked": false}], "1.5": [{"comment_text": "", "digests": {"md5": "6182050f0976fc65122901dbaa7ae9fc", "sha256": "bfa836f2959f5c792f65d4761a75414b8f61b02453535fba84f91d398a1619fc"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.5.zip", "has_sig": false, "md5_digest": "6182050f0976fc65122901dbaa7ae9fc", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42078, "upload_time": "2014-12-18T08:19:41", "upload_time_iso_8601": "2014-12-18T08:19:41.754303Z", "url": "https://files.pythonhosted.org/packages/94/21/d8a94398bd9bd94b9bbfca377105aa4110c2ca8399265d363963eef1aaf0/collective.wfeffectiverange-1.5.zip", "yanked": false}], "1.6": [{"comment_text": "", "digests": {"md5": "e24196cfc44f8baf1216bfb9fc04e247", "sha256": "23a20618d6ba932f4a73df3dbe1c1f95814921bd0b7b2b98c7a0e18167046c72"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.6.zip", "has_sig": false, "md5_digest": "e24196cfc44f8baf1216bfb9fc04e247", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42942, "upload_time": "2015-02-04T11:08:36", "upload_time_iso_8601": "2015-02-04T11:08:36.426481Z", "url": "https://files.pythonhosted.org/packages/e8/70/fa3814e85f304f7907dadf1321f25235166f65a6d870b2ade7bf58fcca27/collective.wfeffectiverange-1.6.zip", "yanked": false}], "1.7": [{"comment_text": "", "digests": {"md5": "657c4edabc8147479aa2d015cc6a68f4", "sha256": "ea0012d96cf78638b7ba210ef03ff14dc2bc46c83ee219b69c3a2a67ac89b63f"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.7.zip", "has_sig": false, "md5_digest": "657c4edabc8147479aa2d015cc6a68f4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 43199, "upload_time": "2015-10-30T10:34:11", "upload_time_iso_8601": "2015-10-30T10:34:11.378168Z", "url": "https://files.pythonhosted.org/packages/a4/ae/701430b6e15ac6d3e9307004ce8551d719e6c153c38312968c9b38880ae5/collective.wfeffectiverange-1.7.zip", "yanked": false}], "1.7.1": [{"comment_text": "", "digests": {"md5": "0d3c1cfb41d51311f476c203bb601c37", "sha256": "2d7a793b30a62458dbe634cce2556fa728d11bf5f395e4e214cc2a79e82fc6ba"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.7.1.zip", "has_sig": false, "md5_digest": "0d3c1cfb41d51311f476c203bb601c37", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 43429, "upload_time": "2015-11-30T09:20:54", "upload_time_iso_8601": "2015-11-30T09:20:54.353309Z", "url": "https://files.pythonhosted.org/packages/e7/e0/ac54fc7bfe78af6cd959f61ff5cd594467114f8fab90e6dd9e2db6bc42f5/collective.wfeffectiverange-1.7.1.zip", "yanked": false}], "1.8.0": [{"comment_text": "", "digests": {"md5": "be6910693a90c527fb66fe0b6635486d", "sha256": "5a9c5117b820c065bd307b5e18c8dd78fa8445e8b742f079f47bb3d93b7a4239"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.8.0.tar.gz", "has_sig": false, "md5_digest": "be6910693a90c527fb66fe0b6635486d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26460, "upload_time": "2016-11-24T12:24:51", "upload_time_iso_8601": "2016-11-24T12:24:51.337227Z", "url": "https://files.pythonhosted.org/packages/d5/9b/c1710d4feb38cab1ef130a8e67bfde54d9b5a3376309f5f0f1373d3ad1f6/collective.wfeffectiverange-1.8.0.tar.gz", "yanked": false}], "1.8.1": [{"comment_text": "", "digests": {"md5": "2e10a351b685101ad443a72136dcd6f4", "sha256": "a6e31d4320c66db96fa3a2e7fd3bcc6ac4780f8fcf19a6dc208434b47b4d93d7"}, "downloads": -1, "filename": "collective.wfeffectiverange-1.8.1.tar.gz", "has_sig": false, "md5_digest": "2e10a351b685101ad443a72136dcd6f4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27828, "upload_time": "2016-12-08T14:54:03", "upload_time_iso_8601": "2016-12-08T14:54:03.525391Z", "url": "https://files.pythonhosted.org/packages/ff/72/7eda537cb41f22b35b7cc965a433119d27a19898b3f2defada72309a46f2/collective.wfeffectiverange-1.8.1.tar.gz", "yanked": false}], "2.0.0": [{"comment_text": "", "digests": {"md5": "3c81baf66f835bba5d52b199b2704a1b", "sha256": "b3e63fb386d05a29a75754d282d05e1ae25cc7b7428ac61bc241433a676e8039"}, "downloads": -1, "filename": "collective.wfeffectiverange-2.0.0.tar.gz", "has_sig": false, "md5_digest": "3c81baf66f835bba5d52b199b2704a1b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 28631, "upload_time": "2016-12-08T15:45:16", "upload_time_iso_8601": "2016-12-08T15:45:16.749098Z", "url": "https://files.pythonhosted.org/packages/f4/84/bfe52bc01778bd098e6a9fb967c6b5ab700bde466676ce514a4a71e8844b/collective.wfeffectiverange-2.0.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "3c81baf66f835bba5d52b199b2704a1b", "sha256": "b3e63fb386d05a29a75754d282d05e1ae25cc7b7428ac61bc241433a676e8039"}, "downloads": -1, "filename": "collective.wfeffectiverange-2.0.0.tar.gz", "has_sig": false, "md5_digest": "3c81baf66f835bba5d52b199b2704a1b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 28631, "upload_time": "2016-12-08T15:45:16", "upload_time_iso_8601": "2016-12-08T15:45:16.749098Z", "url": "https://files.pythonhosted.org/packages/f4/84/bfe52bc01778bd098e6a9fb967c6b5ab700bde466676ce514a4a71e8844b/collective.wfeffectiverange-2.0.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:44:42 2020"}