{"info": {"author": "Alexander Huras", "author_email": "athuras@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3"], "description": "Compositor: Morphologically Optimal ASCII-Art\n=============================================\n\nHave you ever thought to yourself \"Wouldn't it be nice if I had a command line utility to generating ASCII-art?\"\nI know I have.\n\nTypical ASCII art generators choose a palette of characters of some size K, and reduce the grey-mapped color depth to about K-bits of fidelity, and then simply map each unique color in the image, to an equivalently \"dark\" character in the palette.\n\nThe advantages associated with this are fairly obvious: it's inexpensive, but this convenience comes with a terrible price: the ascii composite 'images' are of significantly reduced fidelity. This can be improved by simply increasing the effective resolution of the ascii-art image; however wouldn't it be nice if we could exploit the gamut of geometry that monospace-typographers have already built into our fonts?\n\nEnter Compositor:\n\nAt its heart, Compositor overlays true-type font-renderings of each character from a \"palette\" on top of each sub-image, and matches based on an arbitrary objective function.\nBy default, we use a simple (but highly effective) sum-of-error function; this enables characters to be chosen not only on their 'darkness' but also their morphology (i.e. straight lines vs curves and loops).\nAdditionally, Compositor exposes a simplified image preprocessing interface, which is useful for 'noisy', or poorly equalised, or otherwise images whose native ASCII representations would be (to put it mildly) ugly as sin.\n\nThis software is more of an experiment than anything else, so expect terrible, terrible system retribution (and possibly really serendipitously interesting results) for using 'crazy' parameters, and avoid rendering fonts at sizes below say 12-18pt.", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/athuras/Compositor", "keywords": null, "license": "MIT", "maintainer": null, "maintainer_email": null, "name": "Compositor", "package_url": "https://pypi.org/project/Compositor/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/Compositor/", "project_urls": {"Download": "UNKNOWN", "Homepage": "https://github.com/athuras/Compositor"}, "release_url": "https://pypi.org/project/Compositor/1.0.1/", "requires_dist": null, "requires_python": null, "summary": "Morphologically Optimal ASCII Art", "version": "1.0.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>Have you ever thought to yourself “Wouldn’t it be nice if I had a command line utility to generating ASCII-art?”\nI know I have.</p>\n<p>Typical ASCII art generators choose a palette of characters of some size K, and reduce the grey-mapped color depth to about K-bits of fidelity, and then simply map each unique color in the image, to an equivalently “dark” character in the palette.</p>\n<p>The advantages associated with this are fairly obvious: it’s inexpensive, but this convenience comes with a terrible price: the ascii composite ‘images’ are of significantly reduced fidelity. This can be improved by simply increasing the effective resolution of the ascii-art image; however wouldn’t it be nice if we could exploit the gamut of geometry that monospace-typographers have already built into our fonts?</p>\n<p>Enter Compositor:</p>\n<p>At its heart, Compositor overlays true-type font-renderings of each character from a “palette” on top of each sub-image, and matches based on an arbitrary objective function.\nBy default, we use a simple (but highly effective) sum-of-error function; this enables characters to be chosen not only on their ‘darkness’ but also their morphology (i.e. straight lines vs curves and loops).\nAdditionally, Compositor exposes a simplified image preprocessing interface, which is useful for ‘noisy’, or poorly equalised, or otherwise images whose native ASCII representations would be (to put it mildly) ugly as sin.</p>\n<p>This software is more of an experiment than anything else, so expect terrible, terrible system retribution (and possibly really serendipitously interesting results) for using ‘crazy’ parameters, and avoid rendering fonts at sizes below say 12-18pt.</p>\n\n          </div>"}, "last_serial": 1356716, "releases": {"1.0.0": [], "1.0.1": []}, "urls": [], "timestamp": "Fri May  8 00:44:11 2020"}