{"info": {"author": "Samuel J. Hill", "author_email": "samuelhill2022@northwestern.edu", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Console", "Intended Audience :: Science/Research", "License :: OSI Approved :: BSD License", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# CompanionsKQML and Pythonian\n\nThis page describes the new Pythonian agent architecture. For a history and some of the reasoning behind the architecture choices see the [archive folder and associated README.md](https://github.com/SamuelHill/companionsKQML/tree/master/archive). For a simple (high level) catalog of the features available in this package see the [README.md in the companionsKQML folder](https://github.com/SamuelHill/companionsKQML/tree/master/companionsKQML). For a detailed documentation of the available functions and objects see the [docs folder and associated README.md](https://github.com/SamuelHill/companionsKQML/tree/master/docs). For an example agent or to test the system with Companions see the [test folder and associated README.md](https://github.com/SamuelHill/companionsKQML/tree/master/test).\n\n## Install\n\n`python3 -m pip install companionsKQML`\n\n[See us on pypi](https://pypi.org/project/companionsKQML/)!\n\n## System requirements\n\n1. Companions\n2. Python >= 3.6 (may work for some other 3.x versions, currently being tested in 3.6.5)\n3. pip (to install this package and all dependencies)\n\n## Making a Pythonian agent\n\nIf you want Companion to have access to some functionality in python, you can create a Pythonian agent to meet that need. Generally, it is suggested you make a new Pythonian agent and not arbitrarily add to an existing one. For example, if you want functionality from spacy, then it is suggested that you create a new spacy agent. An obvious exception to this is if an existing agent is strongly related to the new desired functionality and uses the same python modules.\n\nTo create a new Pythonian agent, you will create a python class that extends Pythonian. In this class, you will implement the desired functionality via adding asks, achieves, or subscription patterns in the `__init__` method. The asks and achieves require functions to either use for responding to an ask or achieve on, and normally these functions are also defined inside the class, but these functions can technically come from anywhere so long as they are callable. The only other times you must put code inside the class is when you want to generally use the kqml message sending capabilities. For an indepth example check of the [test/test_agent.py code](https://github.com/SamuelHill/companionsKQML/blob/master/test/test_agent.py). The basic setup is:\n\n```python3\nclass CustomPythonianAgent(Pythonian):\n    name = \"CustomPythonianAgent\"\n\n    def __init__(self, **kwargs):\n        super().__init__(**kwargs)\n        # your setup code here...\n```\n\nTo instantiate the agent when calling this module, there is a convenience function you can use to allow for command line arguments to specify a handful of parameters at runtime. As well as allowing for more flexible agents, the convenience function has a further nicety in that it will attempt to check for a running Companions agent on your system and, if found, can get the port it is hosted at automatically. This extra feature is also available through the `init_check_companions` constructor as we want the `__init__` method to remain simple for now. The command line argument function is called as follows:\n\n```python3\nif __name__ == \"__main__\":\n    agent = CustomPythonianAgent.parse_command_line_args()\n```\n\nThis function parses the sys.args list and passes the appropriate flagged values along to create a new instance of the class. The flags associated with this function are:\n* -u (--url) followed by some string, url where Companions kqml server is hosted - corresponds to host kwarg (-h is taken by help)\n* -p (--port) followed by some int, port Companions kqml server is open on\n* -l (--listener_port) followed by some int, port pythonian kqml server is open on\n* -d (--debug) present stores true - this overrides the default value in init, whether or not to log debug messages\n* -v (--verify_port) present stores true - this matches the default value in init_check_companions, whether or not to verify the port number by checking the pid in the portnum.dat file (created by either running Companions locally or in an exe) against the pid found on the running process where the portnum.dat file was found. This again is only applicable to starting an agent using this function, and this verify is just a more stringent test on the port number for our extra search for Companions.\n\nTo utilize the check for companions on its own without expecting command line args (any time you may want to benefit from detecting a running companion but are not running the agent you create as a module):\n\n```python3\nif __name__ == \"__main__\":\n    agent = CustomPythonianAgent.init_check_companions()\n```\n\nThis function will take the exact same keyword arguments as the the `__init__` function below with the addition of a *verify_port* boolean that defaults to false. The verify_port keyword has the same function as the flag by the same name used in the `parse_command_line_args` function.\n\nAlternatively, you can just create the agent through a normal the `__init__` and use keyword arguments to specify a handful of parameters:\n\n```python3\nif __name__ == \"__main__\":\n    agent = CustomPythonianAgent()\n```\n\nThe parameters (`kwargs`) are *host* (default = `'localhost'`), *port* (default = `9000`), *listener_port* (default = `8950`), and *debug* (default = `False`). If you are running a Companion on a different machine set *host* to be the ip address (as a string) with the *port* properly set. The *listener_port* is the port that you will be sending messages from so set it according to any firewall or other port blocking that you may have, this shouldn't be a problem for local work (Companions on the same machine). *Debug* sets the logger level so a value of `True` will print all debug and log statements to the console (console logging is the default behavior we use) while a value of `False` will only print the log statements.\n\n## Receiving performatives from Companions\n\nCompanions may communicate with a Pythonian agent by sending KQML messages to it. The head of each message indicates the performative of the message. The sections below describe the performatives that are currently supported and how to add that functionality to your pythonian agent.\n\n### achieve\n\nIf you want a function to be available to Companion via an achieve message, then you will need to add the function to the achieves that the agent knows about. This can be done in the `__init__` method like so:\n\n```python3\ndef __init__(self, **kwargs):\n    super().__init__(**kwargs)\n    self.add_achieve(my_custom_achieve_function)\n```\n\nwhere `my_custom_achieve_function` is some function you have defined. Alternatively you can define the function inside the class and pass it along as `self.my_custom_achieve_function` - this is shown in the test code with static functions. Additionaly, if you would like to give the ask a name to be called by Companions other than the function name you can write:\n\n```python3\nself.add_achieve(my_custom_achieve_function, 'new_function_name')\n```\n\nThe return value of this function will be sent to Companions via a tell message. The return is sent as a tell to Companions with the content set to the return value passed through the listify function (converts python objects to KQML equivalents). This means that you should be able to pass most objects in (at a minimum the objects passed in need to be able to be turned to strings).\n\n### ask-one\n\nIf you want to make a query available to Companion via an ask message, then you will need to add a function to the class to perform the processing necessary for the query. To recognize that function as a query, you need to add it to the asks the agent knows about in much the same way that you add and achieve. The major difference in how asks and achieve work then is based on the call and return structure. Achieves achieve a task with some function while asks reply to querys with the requested informationm, this is accomplished by calling the python function and binding the returned results to the query pattern. As such, in addition to the name of the ask (the predicate) and the function to be called, you may want to note how the query pattern should be formed for easy reference. For example, the code below (inside `__init__`) adds a function we have defined to the agents ask predicates which only takes in one input and should only return one element.\n\n```python3\n# (my_custom_ask_function ?_input ?return)\nself.add_ask(my_custom_ask_function)\n```\n\nSimilar to how you can add a custom name for achieves, you can add custom names for asks:\n\n```python3\n# (new_function_name ?_input ?return)\nself.add_ask(my_custom_ask_function, 'new_function_name')\n```\n\nThe return value of this function will be sent to Companion via a tell message. The return value should have the same number (or greater) of elements as there are variables in the query. This means the return value should either be a single element (`None` included) or a list of elements, and all elements should be able to be turned into strings (they have a `__str__` method in the object). The return is sent back to Companions via the response to query mechanism in CompanionsKQMLModule, in this function the response sent back is either a binding list of variables to elements in the results, or a pattern substitution (default) with the variables in the ask substituted by the result elements.\n\n### subscribe\n\nSubscriptions are a little more complicated as is it requires both advertising a subscription and subscribing to it before you can start updating the subscribers for a given subscription. However, to make this easier the `add_subscription` function handles advertising the subscription for you (which can even be put inside the init after the super init call to advertise immediately after registering). For example, to advertise the `'(custom_query_pattern ?x)'` pattern:\n\n```python3\nself.add_subscription('(custom_query_pattern ?x)')  # inside __init__ function...\n```\n\nOnce the subscription is advertised Companions agents can subscribe to it via subscribe messages that tell the pythonian agent to respond (with a tell) when any updates to a given query are found. The query that an agent is subscribing to needs to be one that the pythonian agent is advertising as subscribable. An example of the session-reasoner subscribing to junk mail is the following (not sure on the proper way to do this from Companions ui, this is from lisp console):\n\n```cl\n(agents::subscribe-to-all *sr* '(custom_query_pattern ?x) #'print-reply-callback)\n```\n\nOnce you have subscribers to a subscription, you can start updating the data relevant to your query via the `update_subscription` function. This function needs to have the same pattern that you passed in to `add_subscription`. For example, to update the above pattern we can make a function in our class that always will link to that subscription pattern:\n\n```python3\ndef update_custom_query_pattern(self, data):\n    self.update_subscription('(custom_query_pattern ?x)', data)\n```\n\nA note, the pattern is sent back to Companions in a tell as either the input data bound to the variables in the pattern or as a binding list. Make sure that the data can properly map onto the variables in the pattern.\n\n### tell\n\nWhen the Companion sends a tell to the pythonian agent, it currently logs the message and sends a None in response. This is useful for debugging and can be overwritten if a specific tell functionality is needed.\n\n### ping\n\nYou do not need to do anything for this, as the Pythonian agent will automatically reply to this message. However, if you do not want the log cluttered with ping updates, inside Companions click the 'Toggle status updates' button to stop sending those pings.\n\n## Sending performatives to Companions\n\n### insert\n\nTo push new knowledge to Companions, a Pythonian agent may use the insert performative. This will take some data (which is the content of the performative) and send it to Companions. On the Companions side, this will be added to working memory and be added to the KB. If you want to have it only go to WM and not the KB, then there is a WM-only flag. There are functions available for inserting single facts, inserting into a microtheory, and inserting a list of facts as a microtheory.\n\nNote that many use cases should probably use subscriptions instead of just pushing data to Companions. Subscriptions allow an agent to indicate that it is looking for certain pieces of knowledge, and when another agent acquires that knowledge it sends it off to the subscribing agent. This is ideal for asynchronous interactions between the agents, and a good use case is when a human is interacting with the Companion and you want Companion to go off an do something while the interaction continues.\n\n### achieve_on_agent\n\nA Pythonian agent can use `achieve_on_agent` to send a message to a Companions agent to kick off a command via achieve. It takes some data (a string in the form of a plan call) and the name of the agent that should perform the achieve. Of course, the achieve needs to be defined on the Companion's side.\n\n## Managing data types\n\nKQML has a syntax similar to lisp and to make utilizing KQML easier pykqml has several objects that are both generated from parsing messages and used in the sending of messages. On top of these objects we have added two methods which simplify transforming python type objects into KQML objects. In addition to the methods that convert from python to the expected KQML objects, there are two functions for converting from the KQML objects to python type objects. All four of these helper functions live in companionsKQMLModule to help keep Pythonian clear of lower level details.\n\n### listify\n\nListify takes in any python object and returns the appropriate KQML object from pykqml. Listify readily handles lists, dicts, bools, strings, and tuples, and can handle any other object that has a str representation.\n\n### performative\n\nPerformative allows you to pass in a string with the well formed KQML query instead of creating a performative and setting each value (`msg = KQMLPerformative('achieve')` followed by `msg.set('content', data)`). So long as you remember to add colons before the key (e.g. `:content data`) and close all parens, creating well formed KQML strings isn't too hard. As well, we often are using a base query and filling in the blanks so fstrings fit this task quite well. You can still set new key value pairs on the KQMLPerformative object returned by a call to *performative* to do any modifications to your template.\n\n### convert_to_boolean\n\nWe use some lisp conventions to determine how a KQML element should be converted to a Boolean. If the KQML element is `nil` or `()` then `convert_to_boolean` will return `False`. Otherwise, it returns `True`.\n\n### convert_to_int\n\nIf the KQML element is a `KQMLToken` or `KQMLString`, then the internal data of these tokens are cast to an int. Otherwise, the original value is returned cast to an int.\n\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://github.com/SamuelHill/companionsKQML", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "companionsKQML", "package_url": "https://pypi.org/project/companionsKQML/", "platform": "", "project_url": "https://pypi.org/project/companionsKQML/", "project_urls": {"Homepage": "http://github.com/SamuelHill/companionsKQML", "Qualitative Reasoning Group": "http://www.qrg.northwestern.edu/"}, "release_url": "https://pypi.org/project/companionsKQML/1.1/", "requires_dist": ["pykqml (>=1.1)", "psutil (>=5.6.5)", "python-dateutil (>=2.8.1)"], "requires_python": ">=3.0", "summary": "Companions agents in Python.", "version": "1.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>CompanionsKQML and Pythonian</h1>\n<p>This page describes the new Pythonian agent architecture. For a history and some of the reasoning behind the architecture choices see the <a href=\"https://github.com/SamuelHill/companionsKQML/tree/master/archive\" rel=\"nofollow\">archive folder and associated README.md</a>. For a simple (high level) catalog of the features available in this package see the <a href=\"https://github.com/SamuelHill/companionsKQML/tree/master/companionsKQML\" rel=\"nofollow\">README.md in the companionsKQML folder</a>. For a detailed documentation of the available functions and objects see the <a href=\"https://github.com/SamuelHill/companionsKQML/tree/master/docs\" rel=\"nofollow\">docs folder and associated README.md</a>. For an example agent or to test the system with Companions see the <a href=\"https://github.com/SamuelHill/companionsKQML/tree/master/test\" rel=\"nofollow\">test folder and associated README.md</a>.</p>\n<h2>Install</h2>\n<p><code>python3 -m pip install companionsKQML</code></p>\n<p><a href=\"https://pypi.org/project/companionsKQML/\" rel=\"nofollow\">See us on pypi</a>!</p>\n<h2>System requirements</h2>\n<ol>\n<li>Companions</li>\n<li>Python &gt;= 3.6 (may work for some other 3.x versions, currently being tested in 3.6.5)</li>\n<li>pip (to install this package and all dependencies)</li>\n</ol>\n<h2>Making a Pythonian agent</h2>\n<p>If you want Companion to have access to some functionality in python, you can create a Pythonian agent to meet that need. Generally, it is suggested you make a new Pythonian agent and not arbitrarily add to an existing one. For example, if you want functionality from spacy, then it is suggested that you create a new spacy agent. An obvious exception to this is if an existing agent is strongly related to the new desired functionality and uses the same python modules.</p>\n<p>To create a new Pythonian agent, you will create a python class that extends Pythonian. In this class, you will implement the desired functionality via adding asks, achieves, or subscription patterns in the <code>__init__</code> method. The asks and achieves require functions to either use for responding to an ask or achieve on, and normally these functions are also defined inside the class, but these functions can technically come from anywhere so long as they are callable. The only other times you must put code inside the class is when you want to generally use the kqml message sending capabilities. For an indepth example check of the <a href=\"https://github.com/SamuelHill/companionsKQML/blob/master/test/test_agent.py\" rel=\"nofollow\">test/test_agent.py code</a>. The basic setup is:</p>\n<pre><span class=\"k\">class</span> <span class=\"nc\">CustomPythonianAgent</span><span class=\"p\">(</span><span class=\"n\">Pythonian</span><span class=\"p\">):</span>\n    <span class=\"n\">name</span> <span class=\"o\">=</span> <span class=\"s2\">\"CustomPythonianAgent\"</span>\n\n    <span class=\"k\">def</span> <span class=\"fm\">__init__</span><span class=\"p\">(</span><span class=\"bp\">self</span><span class=\"p\">,</span> <span class=\"o\">**</span><span class=\"n\">kwargs</span><span class=\"p\">):</span>\n        <span class=\"nb\">super</span><span class=\"p\">()</span><span class=\"o\">.</span><span class=\"fm\">__init__</span><span class=\"p\">(</span><span class=\"o\">**</span><span class=\"n\">kwargs</span><span class=\"p\">)</span>\n        <span class=\"c1\"># your setup code here...</span>\n</pre>\n<p>To instantiate the agent when calling this module, there is a convenience function you can use to allow for command line arguments to specify a handful of parameters at runtime. As well as allowing for more flexible agents, the convenience function has a further nicety in that it will attempt to check for a running Companions agent on your system and, if found, can get the port it is hosted at automatically. This extra feature is also available through the <code>init_check_companions</code> constructor as we want the <code>__init__</code> method to remain simple for now. The command line argument function is called as follows:</p>\n<pre><span class=\"k\">if</span> <span class=\"vm\">__name__</span> <span class=\"o\">==</span> <span class=\"s2\">\"__main__\"</span><span class=\"p\">:</span>\n    <span class=\"n\">agent</span> <span class=\"o\">=</span> <span class=\"n\">CustomPythonianAgent</span><span class=\"o\">.</span><span class=\"n\">parse_command_line_args</span><span class=\"p\">()</span>\n</pre>\n<p>This function parses the sys.args list and passes the appropriate flagged values along to create a new instance of the class. The flags associated with this function are:</p>\n<ul>\n<li>-u (--url) followed by some string, url where Companions kqml server is hosted - corresponds to host kwarg (-h is taken by help)</li>\n<li>-p (--port) followed by some int, port Companions kqml server is open on</li>\n<li>-l (--listener_port) followed by some int, port pythonian kqml server is open on</li>\n<li>-d (--debug) present stores true - this overrides the default value in init, whether or not to log debug messages</li>\n<li>-v (--verify_port) present stores true - this matches the default value in init_check_companions, whether or not to verify the port number by checking the pid in the portnum.dat file (created by either running Companions locally or in an exe) against the pid found on the running process where the portnum.dat file was found. This again is only applicable to starting an agent using this function, and this verify is just a more stringent test on the port number for our extra search for Companions.</li>\n</ul>\n<p>To utilize the check for companions on its own without expecting command line args (any time you may want to benefit from detecting a running companion but are not running the agent you create as a module):</p>\n<pre><span class=\"k\">if</span> <span class=\"vm\">__name__</span> <span class=\"o\">==</span> <span class=\"s2\">\"__main__\"</span><span class=\"p\">:</span>\n    <span class=\"n\">agent</span> <span class=\"o\">=</span> <span class=\"n\">CustomPythonianAgent</span><span class=\"o\">.</span><span class=\"n\">init_check_companions</span><span class=\"p\">()</span>\n</pre>\n<p>This function will take the exact same keyword arguments as the the <code>__init__</code> function below with the addition of a <em>verify_port</em> boolean that defaults to false. The verify_port keyword has the same function as the flag by the same name used in the <code>parse_command_line_args</code> function.</p>\n<p>Alternatively, you can just create the agent through a normal the <code>__init__</code> and use keyword arguments to specify a handful of parameters:</p>\n<pre><span class=\"k\">if</span> <span class=\"vm\">__name__</span> <span class=\"o\">==</span> <span class=\"s2\">\"__main__\"</span><span class=\"p\">:</span>\n    <span class=\"n\">agent</span> <span class=\"o\">=</span> <span class=\"n\">CustomPythonianAgent</span><span class=\"p\">()</span>\n</pre>\n<p>The parameters (<code>kwargs</code>) are <em>host</em> (default = <code>'localhost'</code>), <em>port</em> (default = <code>9000</code>), <em>listener_port</em> (default = <code>8950</code>), and <em>debug</em> (default = <code>False</code>). If you are running a Companion on a different machine set <em>host</em> to be the ip address (as a string) with the <em>port</em> properly set. The <em>listener_port</em> is the port that you will be sending messages from so set it according to any firewall or other port blocking that you may have, this shouldn't be a problem for local work (Companions on the same machine). <em>Debug</em> sets the logger level so a value of <code>True</code> will print all debug and log statements to the console (console logging is the default behavior we use) while a value of <code>False</code> will only print the log statements.</p>\n<h2>Receiving performatives from Companions</h2>\n<p>Companions may communicate with a Pythonian agent by sending KQML messages to it. The head of each message indicates the performative of the message. The sections below describe the performatives that are currently supported and how to add that functionality to your pythonian agent.</p>\n<h3>achieve</h3>\n<p>If you want a function to be available to Companion via an achieve message, then you will need to add the function to the achieves that the agent knows about. This can be done in the <code>__init__</code> method like so:</p>\n<pre><span class=\"k\">def</span> <span class=\"fm\">__init__</span><span class=\"p\">(</span><span class=\"bp\">self</span><span class=\"p\">,</span> <span class=\"o\">**</span><span class=\"n\">kwargs</span><span class=\"p\">):</span>\n    <span class=\"nb\">super</span><span class=\"p\">()</span><span class=\"o\">.</span><span class=\"fm\">__init__</span><span class=\"p\">(</span><span class=\"o\">**</span><span class=\"n\">kwargs</span><span class=\"p\">)</span>\n    <span class=\"bp\">self</span><span class=\"o\">.</span><span class=\"n\">add_achieve</span><span class=\"p\">(</span><span class=\"n\">my_custom_achieve_function</span><span class=\"p\">)</span>\n</pre>\n<p>where <code>my_custom_achieve_function</code> is some function you have defined. Alternatively you can define the function inside the class and pass it along as <code>self.my_custom_achieve_function</code> - this is shown in the test code with static functions. Additionaly, if you would like to give the ask a name to be called by Companions other than the function name you can write:</p>\n<pre><span class=\"bp\">self</span><span class=\"o\">.</span><span class=\"n\">add_achieve</span><span class=\"p\">(</span><span class=\"n\">my_custom_achieve_function</span><span class=\"p\">,</span> <span class=\"s1\">'new_function_name'</span><span class=\"p\">)</span>\n</pre>\n<p>The return value of this function will be sent to Companions via a tell message. The return is sent as a tell to Companions with the content set to the return value passed through the listify function (converts python objects to KQML equivalents). This means that you should be able to pass most objects in (at a minimum the objects passed in need to be able to be turned to strings).</p>\n<h3>ask-one</h3>\n<p>If you want to make a query available to Companion via an ask message, then you will need to add a function to the class to perform the processing necessary for the query. To recognize that function as a query, you need to add it to the asks the agent knows about in much the same way that you add and achieve. The major difference in how asks and achieve work then is based on the call and return structure. Achieves achieve a task with some function while asks reply to querys with the requested informationm, this is accomplished by calling the python function and binding the returned results to the query pattern. As such, in addition to the name of the ask (the predicate) and the function to be called, you may want to note how the query pattern should be formed for easy reference. For example, the code below (inside <code>__init__</code>) adds a function we have defined to the agents ask predicates which only takes in one input and should only return one element.</p>\n<pre><span class=\"c1\"># (my_custom_ask_function ?_input ?return)</span>\n<span class=\"bp\">self</span><span class=\"o\">.</span><span class=\"n\">add_ask</span><span class=\"p\">(</span><span class=\"n\">my_custom_ask_function</span><span class=\"p\">)</span>\n</pre>\n<p>Similar to how you can add a custom name for achieves, you can add custom names for asks:</p>\n<pre><span class=\"c1\"># (new_function_name ?_input ?return)</span>\n<span class=\"bp\">self</span><span class=\"o\">.</span><span class=\"n\">add_ask</span><span class=\"p\">(</span><span class=\"n\">my_custom_ask_function</span><span class=\"p\">,</span> <span class=\"s1\">'new_function_name'</span><span class=\"p\">)</span>\n</pre>\n<p>The return value of this function will be sent to Companion via a tell message. The return value should have the same number (or greater) of elements as there are variables in the query. This means the return value should either be a single element (<code>None</code> included) or a list of elements, and all elements should be able to be turned into strings (they have a <code>__str__</code> method in the object). The return is sent back to Companions via the response to query mechanism in CompanionsKQMLModule, in this function the response sent back is either a binding list of variables to elements in the results, or a pattern substitution (default) with the variables in the ask substituted by the result elements.</p>\n<h3>subscribe</h3>\n<p>Subscriptions are a little more complicated as is it requires both advertising a subscription and subscribing to it before you can start updating the subscribers for a given subscription. However, to make this easier the <code>add_subscription</code> function handles advertising the subscription for you (which can even be put inside the init after the super init call to advertise immediately after registering). For example, to advertise the <code>'(custom_query_pattern ?x)'</code> pattern:</p>\n<pre><span class=\"bp\">self</span><span class=\"o\">.</span><span class=\"n\">add_subscription</span><span class=\"p\">(</span><span class=\"s1\">'(custom_query_pattern ?x)'</span><span class=\"p\">)</span>  <span class=\"c1\"># inside __init__ function...</span>\n</pre>\n<p>Once the subscription is advertised Companions agents can subscribe to it via subscribe messages that tell the pythonian agent to respond (with a tell) when any updates to a given query are found. The query that an agent is subscribing to needs to be one that the pythonian agent is advertising as subscribable. An example of the session-reasoner subscribing to junk mail is the following (not sure on the proper way to do this from Companions ui, this is from lisp console):</p>\n<pre><span class=\"p\">(</span><span class=\"nv\">agents::subscribe-to-all</span> <span class=\"vg\">*sr*</span> <span class=\"o\">'</span><span class=\"p\">(</span><span class=\"nv\">custom_query_pattern</span> <span class=\"nv\">?x</span><span class=\"p\">)</span> <span class=\"nf\">#'</span><span class=\"nv\">print-reply-callback</span><span class=\"p\">)</span>\n</pre>\n<p>Once you have subscribers to a subscription, you can start updating the data relevant to your query via the <code>update_subscription</code> function. This function needs to have the same pattern that you passed in to <code>add_subscription</code>. For example, to update the above pattern we can make a function in our class that always will link to that subscription pattern:</p>\n<pre><span class=\"k\">def</span> <span class=\"nf\">update_custom_query_pattern</span><span class=\"p\">(</span><span class=\"bp\">self</span><span class=\"p\">,</span> <span class=\"n\">data</span><span class=\"p\">):</span>\n    <span class=\"bp\">self</span><span class=\"o\">.</span><span class=\"n\">update_subscription</span><span class=\"p\">(</span><span class=\"s1\">'(custom_query_pattern ?x)'</span><span class=\"p\">,</span> <span class=\"n\">data</span><span class=\"p\">)</span>\n</pre>\n<p>A note, the pattern is sent back to Companions in a tell as either the input data bound to the variables in the pattern or as a binding list. Make sure that the data can properly map onto the variables in the pattern.</p>\n<h3>tell</h3>\n<p>When the Companion sends a tell to the pythonian agent, it currently logs the message and sends a None in response. This is useful for debugging and can be overwritten if a specific tell functionality is needed.</p>\n<h3>ping</h3>\n<p>You do not need to do anything for this, as the Pythonian agent will automatically reply to this message. However, if you do not want the log cluttered with ping updates, inside Companions click the 'Toggle status updates' button to stop sending those pings.</p>\n<h2>Sending performatives to Companions</h2>\n<h3>insert</h3>\n<p>To push new knowledge to Companions, a Pythonian agent may use the insert performative. This will take some data (which is the content of the performative) and send it to Companions. On the Companions side, this will be added to working memory and be added to the KB. If you want to have it only go to WM and not the KB, then there is a WM-only flag. There are functions available for inserting single facts, inserting into a microtheory, and inserting a list of facts as a microtheory.</p>\n<p>Note that many use cases should probably use subscriptions instead of just pushing data to Companions. Subscriptions allow an agent to indicate that it is looking for certain pieces of knowledge, and when another agent acquires that knowledge it sends it off to the subscribing agent. This is ideal for asynchronous interactions between the agents, and a good use case is when a human is interacting with the Companion and you want Companion to go off an do something while the interaction continues.</p>\n<h3>achieve_on_agent</h3>\n<p>A Pythonian agent can use <code>achieve_on_agent</code> to send a message to a Companions agent to kick off a command via achieve. It takes some data (a string in the form of a plan call) and the name of the agent that should perform the achieve. Of course, the achieve needs to be defined on the Companion's side.</p>\n<h2>Managing data types</h2>\n<p>KQML has a syntax similar to lisp and to make utilizing KQML easier pykqml has several objects that are both generated from parsing messages and used in the sending of messages. On top of these objects we have added two methods which simplify transforming python type objects into KQML objects. In addition to the methods that convert from python to the expected KQML objects, there are two functions for converting from the KQML objects to python type objects. All four of these helper functions live in companionsKQMLModule to help keep Pythonian clear of lower level details.</p>\n<h3>listify</h3>\n<p>Listify takes in any python object and returns the appropriate KQML object from pykqml. Listify readily handles lists, dicts, bools, strings, and tuples, and can handle any other object that has a str representation.</p>\n<h3>performative</h3>\n<p>Performative allows you to pass in a string with the well formed KQML query instead of creating a performative and setting each value (<code>msg = KQMLPerformative('achieve')</code> followed by <code>msg.set('content', data)</code>). So long as you remember to add colons before the key (e.g. <code>:content data</code>) and close all parens, creating well formed KQML strings isn't too hard. As well, we often are using a base query and filling in the blanks so fstrings fit this task quite well. You can still set new key value pairs on the KQMLPerformative object returned by a call to <em>performative</em> to do any modifications to your template.</p>\n<h3>convert_to_boolean</h3>\n<p>We use some lisp conventions to determine how a KQML element should be converted to a Boolean. If the KQML element is <code>nil</code> or <code>()</code> then <code>convert_to_boolean</code> will return <code>False</code>. Otherwise, it returns <code>True</code>.</p>\n<h3>convert_to_int</h3>\n<p>If the KQML element is a <code>KQMLToken</code> or <code>KQMLString</code>, then the internal data of these tokens are cast to an int. Otherwise, the original value is returned cast to an int.</p>\n\n          </div>"}, "last_serial": 6763687, "releases": {"1.0": [{"comment_text": "", "digests": {"md5": "2db9f3d1c133a2adbc9d4b1d124c6ee4", "sha256": "a8acc2d9220bf17299b9a52a05dda45a218b6d7c5a89e8e9393b8de0d0d6b0ec"}, "downloads": -1, "filename": "companionsKQML-1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "2db9f3d1c133a2adbc9d4b1d124c6ee4", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.0", "size": 23632, "upload_time": "2020-03-02T19:56:33", "upload_time_iso_8601": "2020-03-02T19:56:33.838551Z", "url": "https://files.pythonhosted.org/packages/89/11/4928222492d6b204e453b9ae847d2a393964bd098a87cf54ae22d81da87c/companionsKQML-1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "61f920b79620d47efdd6f5606c47f721", "sha256": "5d9227ecf2e0833983c89f237bd636f45e979e6ed8956f45470638ca87beabdc"}, "downloads": -1, "filename": "companionsKQML-1.0.tar.gz", "has_sig": false, "md5_digest": "61f920b79620d47efdd6f5606c47f721", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.0", "size": 22861, "upload_time": "2020-03-02T19:56:36", "upload_time_iso_8601": "2020-03-02T19:56:36.002547Z", "url": "https://files.pythonhosted.org/packages/b4/41/ae34f045f68f6b27a1106471f87411b8003240317385aa1e86eb377c4254/companionsKQML-1.0.tar.gz", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "4b2142511648f72bae8f5af8c27145ef", "sha256": "a9bbe0ebf4c546f17df4350f330c699031e83c9f33f4f5d61a172d3dc26219fa"}, "downloads": -1, "filename": "companionsKQML-1.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "4b2142511648f72bae8f5af8c27145ef", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.0", "size": 23714, "upload_time": "2020-03-02T21:25:42", "upload_time_iso_8601": "2020-03-02T21:25:42.910082Z", "url": "https://files.pythonhosted.org/packages/fd/df/b5541fe57cac0ca637356774f2ebe749eead62bd139d676daf512f10f86f/companionsKQML-1.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f69ec855b38e39dab465d1d200329faf", "sha256": "d7f091d10cadd117ce1b839afc5795552bed75cd2cbb50a95d7dd8ddfafd2bfd"}, "downloads": -1, "filename": "companionsKQML-1.0.1.tar.gz", "has_sig": false, "md5_digest": "f69ec855b38e39dab465d1d200329faf", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.0", "size": 22970, "upload_time": "2020-03-02T21:25:43", "upload_time_iso_8601": "2020-03-02T21:25:43.722341Z", "url": "https://files.pythonhosted.org/packages/af/91/d08e97fec69c5b1113bda7feefb3650ed11b57c4be3ac6802666a9e9a21a/companionsKQML-1.0.1.tar.gz", "yanked": false}], "1.0.2": [{"comment_text": "", "digests": {"md5": "77d3e5b3f4b7b586cc2b95e06707e2e7", "sha256": "1f238be9139dd389bd744d983bf5fa72dfa4447800500b838c03f69e8460a3de"}, "downloads": -1, "filename": "companionsKQML-1.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "77d3e5b3f4b7b586cc2b95e06707e2e7", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.0", "size": 23769, "upload_time": "2020-03-02T22:03:34", "upload_time_iso_8601": "2020-03-02T22:03:34.902401Z", "url": "https://files.pythonhosted.org/packages/04/25/3cfe77af001cdcf202630d615e7d3ff2a5f24beaebb290ea84395a25f3aa/companionsKQML-1.0.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ab996e395b6eaaf56916bc4a3b16b87f", "sha256": "069b728056dcb3cb0415b12930cb50ccc0fec83e088895e3b7ac6bc91d6828ba"}, "downloads": -1, "filename": "companionsKQML-1.0.2.tar.gz", "has_sig": false, "md5_digest": "ab996e395b6eaaf56916bc4a3b16b87f", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.0", "size": 23020, "upload_time": "2020-03-02T22:03:36", "upload_time_iso_8601": "2020-03-02T22:03:36.238866Z", "url": "https://files.pythonhosted.org/packages/99/08/0de53f8096a70f67e8f74c22ca149891610ddc4631568d2b15d65afeb9ae/companionsKQML-1.0.2.tar.gz", "yanked": false}], "1.1": [{"comment_text": "", "digests": {"md5": "61869334f7c853f16f296fb5a325dfb5", "sha256": "45e1fe11bde28fe41f96daf16bb7e07a88b6aec1862ad13ef75ba367dfb0ebae"}, "downloads": -1, "filename": "companionsKQML-1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "61869334f7c853f16f296fb5a325dfb5", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.0", "size": 24638, "upload_time": "2020-03-06T17:43:36", "upload_time_iso_8601": "2020-03-06T17:43:36.522779Z", "url": "https://files.pythonhosted.org/packages/3b/a3/abcaaca974c2315d9554bf66b6668509b54f3d65b98290cc3b3487e52cd7/companionsKQML-1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "cf5e2e66e73ef596c83714db016e04c4", "sha256": "9fe823fea716b4bc1b5792aacfef031bacb73b556a04cbb5375443e2e04562c7"}, "downloads": -1, "filename": "companionsKQML-1.1.tar.gz", "has_sig": false, "md5_digest": "cf5e2e66e73ef596c83714db016e04c4", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.0", "size": 23978, "upload_time": "2020-03-06T17:43:38", "upload_time_iso_8601": "2020-03-06T17:43:38.676979Z", "url": "https://files.pythonhosted.org/packages/7d/18/882efe998c01c08480b4918f0e36cfb17b1f4e84a489b87a602f4d8154c2/companionsKQML-1.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "61869334f7c853f16f296fb5a325dfb5", "sha256": "45e1fe11bde28fe41f96daf16bb7e07a88b6aec1862ad13ef75ba367dfb0ebae"}, "downloads": -1, "filename": "companionsKQML-1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "61869334f7c853f16f296fb5a325dfb5", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.0", "size": 24638, "upload_time": "2020-03-06T17:43:36", "upload_time_iso_8601": "2020-03-06T17:43:36.522779Z", "url": "https://files.pythonhosted.org/packages/3b/a3/abcaaca974c2315d9554bf66b6668509b54f3d65b98290cc3b3487e52cd7/companionsKQML-1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "cf5e2e66e73ef596c83714db016e04c4", "sha256": "9fe823fea716b4bc1b5792aacfef031bacb73b556a04cbb5375443e2e04562c7"}, "downloads": -1, "filename": "companionsKQML-1.1.tar.gz", "has_sig": false, "md5_digest": "cf5e2e66e73ef596c83714db016e04c4", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.0", "size": 23978, "upload_time": "2020-03-06T17:43:38", "upload_time_iso_8601": "2020-03-06T17:43:38.676979Z", "url": "https://files.pythonhosted.org/packages/7d/18/882efe998c01c08480b4918f0e36cfb17b1f4e84a489b87a602f4d8154c2/companionsKQML-1.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:44:18 2020"}