{"info": {"author": "Paula Gomis Rosa, Arturo González Vilanova, Marta López Balastegui", "author_email": "marta.lopez01@estudiant.upf.edu, paula.gomis01@estudiant.upf.edu, arturo.gonzalez01@estudiant.upf.edu", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Programming Language :: Python :: 3"], "description": "<img src=\"https://cdn.pixabay.com/photo/2017/10/25/06/13/protein-icon-2887050_960_720.png\" title=\"ComplexConstructorLogo\" alt=\"ComplexConstructorLogo\" height=\"100\" width=\"100\">\n\n<!-- [![FVCproductions](https://avatars1.githubusercontent.com/u/4284691?v=3&s=200)](http://fvcproductions.com) -->\n\n<!--***INSERT GRAPHIC HERE (include hyperlink in image)***-->\n\n# Complex Constructor\n\n> Generate macrocomplexes superimposing paired interacting elements\n\n> protein - protein or protein - DNA\n\n> the result is stored in a PDB file\n\n## Table of Content\n\n- [Why building complexes?](#whybuildingcomplexes?)\n- [Installation](#installation)\n- [Options](#options)\n- [Examples](#examples)\n- [Performance](#performance)\n- [Limitations](#limitations)\n- [Team](#team)\n\n\n## Why building complexes?\n\nThe total number of proteins in humans is around 20K. From this quantity we already know the structure of 4K proteins. However, for 6K we have good templates and for other 6K of them, we have reasonably good templates; that means we have more or less 50-70% of the structure of human proteins covered.\n\nOn the other hand, the number of interactions that may occur between all the proteins is still unknown. There are some studies estimating 130-650K interactions, while others estimate more than millions. In this context, 120K interactions are confirmed from experiments and only 7K structures of complexes are known, which is a very small proportion of the total number of possible interactions anyway.\n\nSo, the complex-structure coverage, including homologs, is around the 30%, much less than the mentioned coverage of monomers. That means there is still a long way to go into the complex-structure study field. \n\nThe 3D structure of interacting proteins is necessary for them to develop their function. It is also fundamental for molecular recognition and contributes to the complexity of protein interaction networks. However, identifying the structure of interacting proteins forming complexes, is not an easy task. In monomers, homology modelling can be used to nearly cover all folds to determine a protein structure but, for interactions that is not enough. \n\nComplex Constructor tries to generate macrocomplex structures. To do so, the superimposing technique is used: it receives a list of pdb files, each of these files contains the structure of an interacting pair and, by superimposing the common elements of different pairs, it builds the final structure. Although there are other methods to generate macrocomplexes, the superimposition is fast and effective. Furthermore, not only protein-protein interacting pairs can be analyzed, but also proteins with DNA, to end up generating a macrocomplex structure of proteins and DNA chains. \n\nThe core of Complex Constructor is the `constructor` function, which is the responsible of the building process. The pdbs of the interacting pairs are analyzed and classified using the information of the FASTA file. The common chains in different pdb files are identified: they will have more than 99% of identity in their sequences. After this classification, `constructor` begins to append elements to the macrocomplex: it starts with a pair, then it looks for another pair that has a common chain with the starting one and, if after superimposing the common chain, the structure has not clashed, it appends the new chain. Like this, the macrocomplex has now three chains. In the next step, the process will be repeated by looking for another pair, superimposing the common chain and checking the possible clashes. The program is described [here](#performance).\n\nIn addition, as a lot of complexes follow a determined stoichiometry, Complex Constructor can also make the construction following it. If a stoichiometry is defined, the final structure will contain the exact number of elements indicated by it. In other case, the structure will contain each different chain only once. \n\nFinally, a new pdb file with the resulting structure of the macrocomplex is stored in the output folder called `outputFolder_model.pdb`.\n\n<!-- Chimera comparison with prediction etc  --> \n\n\n## Installation\n\nPrerequisites:\n\n- Python 3.0 `https://www.python.org/download/releases/3.0/`\n\nThere are two different ways to download the package: using `pip3` or cloning the repo.\n\n### Option 1. Install from pip\n\n- Install Complex Constructor with the Python package installer `pip3`\n\n```shell\n$ pip3 install complexconstructor\n```\n\n### Option 2. Clone\n\n- Otherwise, you can clone the repo to your local machine\n\n```shell\n$ git clone https://github.com/Argonvi/SBI-PYT_Project.git\n```  \n\n- Install the package\n\n```shell\n$ cd SBI-PYT_Project\n$ sudo python3 setup.py install\n```\n### Setup\n\nComplex Constructor requires the package BioPython `https://biopython.org/wiki/Download` \n\n- The installation is easy using Python package management tool `pip3`\n\n```shell\n$ pip3 install biopython\n$ pip3 install biopython --upgrade\n```\n\n### Download the data to run the examples\n\nTo run the different [examples](#examples) of this tutorial, download the folder `examples`. Inside it you can find all the required inputs to execute the examples.\n\nYou can download the compressed folder with the following command:\n\n```shell\n$ wget https://github.com/Argonvi/SBI-PYT_Project/raw/master/examples.tar.gz\n```\nThen uncompress with:\n```shell\n$ tar xvfz examples.tar.gz\n```\n\n## Options\n\nComplex Constructor can be run using command-line arguments or using the graphical interface.\n\n### Command-line\n\nYou can introduce the different arguments via command-line:\n\n#### Mandatory arguments\n\nTo execute Complex Constructor three arguments are required:\n\n- `-fa` `--fasta`: FASTA file with the sequences of the proteins or DNA that will conform the complex.\n\n- `-pdb` `--pdbDir`: directory containing the pdb files with the structure of the pairs that will conform the complex.\n\n- `-o` `--output`: name of the directory where the complex results will be stored. \n\n> Note that, if the output directory already exists, the results will be overwritten.\n\n\n#### Optional arguments\n\n- `-v` `--verbose`: show the detailed progression of the building process in a file called 'ComplexConstructor.log'. It will be stored in the output directory.\n\n- `-st` `--stoichiometry`: name of the file in .txt format containing the stoichiometry of the complex. The information of the stoichiometry must be in the following order: the ID of the sequence chain (concordant with the FASTA file ID) followed by ':' and the number of times it has to be present in the complex. \n\n     `ID_FASTA_file` : `stoichiometry` One per line. \n     \n     In case this option is not used, the program will build the complex using each chain only once.\n     \n     Take a look at some examples [here](#examples).\n     \n     \n     \n     \n### Graphical interface\n\nOtherwise, the macrocomplex can also be built using the graphical interface:\n\n```shell\n$  cconstruct -gui\n```\n\n>In this case just the `-gui` tag is needed!\n\n- To build the macrocomplex fill in the main window requirements. As for running the program via command-line, a FASTA file with the sequences and a directory with the pdb files of the interacting pairs are required. In addition, a name for the folder where the results will be stored is needed, after typing it you should confirm it. \n\n> Note that, to select the PDB directory you have to enter in the desired directory and then select it. You can see how it works in the [examples](#examples).\n\nFurthermore, additional options can be set:\n\n<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/GUI.gif\" title=\"GUI\" alt=\"GUI\" style=\"max-width:70%;\" >\n\n- In the main window you can specify if you want to create a log file where the process of the execution will be displayed. It will be stored in the output directory.\n\n- In the top menu, in the 'Options' dropdown, there is the 'Add Stoichiometry' option. You can upload a file with a determined stoichiometry to be applied to the macrocomplex. As said before, the format of this file has to be the ID of the sequence, concordant with the one in the FASTA file, followed by ':' and a number. This number will be the number of times the corresponding sequence will be in the final complex.\n\nFinally, in the top menu you can consult the Complex Constructor 'Help' as well.\n\n## Examples\n\nAs said before, to generate any macrocomplex structure it is required the FASTA file and a direcory with paired structures in pdb format. All the data needed to execute the following examples is in the folder `examples`, remember that you have to download it as described in the [installation](#installation) section.  \n\n- The output folder will be created in the 'current' directory, the one from which you execute the Complex Constructor. Our recommendation to follow the following examples is to create a working directory, for example `ComplexConstructorModels`, and place the `examples` directory inside it, `ComplexConstructorModels/examples`. Now navigate using the `cd` command to reach `ComplexConstructorModels` directory.\n\n```shell\n$  cd ComplexConstructorModels\n```\n\nLike this, the output folders will be stored in this directory. \n\n> Inside the folder `examples` there are all the examples we will describe in this tutorial in the corresponding directories: `1gzx`, `5fj8`, etc. Each of them contains the required files to run Complex Constructor and also a pdb file of the reference structure, `exampleRef.pdb`, in order to check the superimposition between the constructed model and the real structure. \n\n### 1GZX\n\nLet's begin with the first example, the protein 1GZX. It is a small complex composed by two different amino acid chains and each one of them appears two times (stoichiometry 2A2B), so the final structure has four chains. In order to perform the construction of T state haemoglobin (1GZX), we need a .txt file where the stoichiometry is specified. This file can be found in the folder `examples/1gzx` and it is called `1gzx_st.txt`:\n\n```shell\n1GZXa:2\n1GZXb:2\n```\n\n1. Command line execution:\n\n```shell\n$ cconstruct -fa examples/1gzx/1gzx.fa -pdb examples/1gzx/1gzxDir -o 1GZX -st examples/1gzx/1gzx_st.txt -v\n```\n\n- `-fa`, mandatory: followed by the location of the FASTA file `1gzx.fa`.\n\n> This file contains two IDs followed by the corresponding sequence, e.g. `1GZXa`, `1GZXb`. Note that, the IDs in `1gzx_st.txt` have to be concordant with them.\n\n- `-pdb`, mandatory: followed by the location of the directory with paired structures in pdb, that is `1gzxDir`.\n\n> In this case inside this folder we should have at least three pdb files, e.g. `1gzx_AB.pdb`, `1gzx_AC.pdb`, `1gzx_AD.pdb`. If there are redundant pairs they won't be considered. \n\n- `-o`, mandatory: followed by the name of the output directory where the results will be stored, `1GZX`. \n\n> If a directory with the same name already exists in the working folder it will be overwritten.\n\n- `-st`: followed by the location of the file that contains the stoichiometry information, that is, the file  `1gzx_st.txt`.\n\n- `-v`: when it is used it turns ON the verbose option. It is always recommended to create a logfile where the process information will be displayed. In order to deactivate the creation of the logfile, do not add the `-v` flag. \n\n2. Graphical interface execution:\n\n<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/1gzxExample/1GZX.gif\" title=\"1gzxGUI\" alt=\"1gzxGUI\" style=\"max-width:60%;\" >\n\nThe resulting structure is stored in the current directory, `ComplexConstructorModels`, in the folder `1GZX`, file `1GZX_model.pdb`.\n\n\n\n| **Complex Constructor** | **Reference structure** | **Superimposition** |\n| :---: | :---: | :---: |\n|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/1gzxExample/1gzxCC.png\" title=\"1gzxCC\" alt=\"1gzxCC\"  height=250 >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/1gzxExample/1gzxREF.png\" title=\"1gzxREF\" alt=\"1gzxREF\" height=250  >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/1gzxExample/1gzxREF_CC.png\" title=\"1gzxREF_CC\" alt=\"1gzxREF_CC\" height=250 >\n\nIn the superimposition image we can observe the reference structure in red and the structure obtained with Complex Constructor in blue. We observe that the colours are mixed in most of the chains as our model fits the reference downloaded from PDB quite well.        \nUsing Chimera we computed the RMSD between 146 pruned atom pairs and obtained a result of 0.000 angstroms.\n\n### 3KUY\n\n3KUY is a complex composed by a DNA coil and a core made of protein chains. There are four  different amino acid chains and one nucleotide chain, all of them have stoichiometry two, making a total of 10 chains. The procedure to run this example is the same as the explained before. The data to construct the complex is inside the folder `examples/3kuy`. Execution with command-line arguments:\n\n```shell\n$ cconstruct -fa examples/3kuy/3kuy.fa -pdb examples/3kuy/3kuyDir -o 3KUY -st examples/3kuy/3kuy_st.txt -v\n```\n\nThe resulting structure is stored in the file `3KUY_model.pdb`, which is in the directory `3KUY`.\n\n>  In order to construct this complex (and all the following examples) using the graphical interface, we should repeat the same process as the one explained in the previous example, but in this case, we will take the inputs from the folder `examples/3kuy`.\n\n \n\n| **Complex Constructor** | **Reference structure** | **Superimposition** |\n| :---: | :---: | :---: |\n|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/3kuyExample/3kuyCC.png\" title=\"3kuyCC\" alt=\"3kuyCC\" height=260  >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/3kuyExample/3kuyRef.png\" title=\"3kuyref\" alt=\"3kuyRef\" height=260  >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/3kuyExample/3kuyRef_CC.png\" title=\"3kuyRef_CC\" alt=\"3kuyRef_CC\" height=260 >\n\nIn the superimposition image we can observe the amino acid chains of the reference structure in red and the DNA chains in yellow. The colours of the structure obtained with Complex Constructor are blue and orange respectively.   \nWe observe that the whole complex is correctly constructed and after superimposing the obtained structure with the structure downloaded from PDB, we can see that both protein chains and DNA chains fit quite well with the reference structure.    \nThe RMSD computed with Chimera between 106 pruned atom pairs is 0.000 angstroms.\n\n### 4R3O\nThe Human 20S Proteasome (4R3O), is a bigger complex but just made of amino acid chains. It is symmetric and it is composed by 14 different chains, all of them with stoichiometry  two, making a total of 28 chains in the complex. Its input data can be found in `examples/4r3o`. Execution with command-line arguments:\n\n\n```shell\n$ cconstruc -fa examples/4r3o/4r3o.fa -pdb examples/4r3o/4r3oDir -o 4R3O -st examples/4r3o/4r3o_st.txt -v\n```\n\nThe resulting structure is stored in the file `4R3O_model.pdb`, which is in the directory `4R3O`.\n\n\n| **Complex Constructor** | **Reference structure** | **Superimposition** |\n| :----: | :----: | :----: |\n|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/4r3oExample/4r3oCC.png\" title=\"4r3oCC\" alt=\"4r3oCC\"  height=240 >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/4r3oExample/4r3oRef.png\" title=\"4r3oref\" alt=\"4r3oRef\" height=240  >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/4r3oExample/4r3oRef_CC.png\" title=\"4r3oRef_CC\" alt=\"4r3oRef_CC\" height=240 >\n\nIn this case, as well, the constructed model fits the reference structure.     \nThe RMSD between 250 pruned atom pairs is 0.000 angstroms.\n\n### 5FJ8\n\nThe next complex is composed by amino acid and nucleotide sequences but, in this case, it is not symmetric. It is composed by 20 different chains and all of them are present just once in the structure. The required inputs for the construction are in `examples/5fj8`. \n\n```shell\n$ ccontruct -fa examples/5fj8/5fj8.fa -pdb examples/5fj8/5fj8Dir -o 5FJ8 -st examples/5fj8/5fj8_st.txt -v\n```\n\nThe resulting structure is stored in the file `5FJ8_model.pdb`, which is in the directory `5FJ8`.\n\n| **Complex Constructor** | **Reference structure** | **Superimposition** |\n| :---: | :---: | :---: |\n|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/5fj8Example/5fj8CC.png\" title=\"5fj8CC\" alt=\"5fj8CC\"  height=240 >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/5fj8Example/5fj8Ref.png\" title=\"5fj8ref\" alt=\"5fj8Ref\"  height=240>|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/5fj8Example/5fj8Ref_CC.png\" title=\"5fj8Ref_CC\" alt=\"5fj8Ref_CC\" height=240>\n\nThe created model and the reference structure are superimposed quite well as in previous cases. In this particular case, the amino acid chain Q, had several amino acids labelled as 'unknown' in the pdb files and as 'X' in the FASTA sequence. To deal with this, we had to take out these 35 amino acids from input files (FASTA file and pdb files), and so, the Q chain is partly constructed in the model. Nevertheless, the rest of the structure is correctly reproduced.     \nThe RMSD between 1422 pruned atom pairs is 0.000 angstroms.\n\n### 6GMH\nAnother non-symmetric example, but also with DNA sequences, is 6GMH. It has 17 amino acid chains and 3 DNA chains and as in the previous case, all of them appear only once in the structure. The required inputs for the construction are in `examples/6gmh`.\n\n```shell\n$ cconstruct -fa examples/6gmh/6gmh.fa -pdb examples/6gmh/6gmhDir -o 6GMH -st examples/6gmh/6gmh_st.txt -v\n```\n\nThe resulting structure is stored in the file `6GMH_model.pdb`, which is in the directory `6GMH`.\n\n\n| **Complex Constructor** | **Reference structure** | **Superimposition** |\n| :---: | :---: | :---: |\n|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/6gmhExample/6gmhCC.png\" title=\"6gmhCC\" alt=\"6gmhCC\"  height=240 >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/6gmhExample/6gmhREF.png\" title=\"6gmhref\" alt=\"6gmhRef\" height=240  >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/6gmhExample/6gmhREF_CC.png\" title=\"6gmhRef_CC\" alt=\"6gmhRef_CC\"  height=240 >\n\nIn this case, the pdb structure had bigger regions labelled as 'unknown'. As those regions are not recognized by Complex Constructor, we removed them from the input pdb pairs and from the FASTA sequences, as in the previous example. In the Q chain, from a total of 884 amino acids, 300 of them were labelled as 'unknown', so only 584 remained in order to construct the model, (that is why this chain is not completely constructed in our model). It happened to be the same in chain M, but in this case only 8 amino acids were missing. On the other hand, the chains U, V and X had to be completely deleted in our model, since all their amino acid were labelled as 'unknown' in the pdb file.      \nEven though we had to remove several amino acids and some chains, the model is well constructed and it fits the reference structure as in previous examples, (as we can see in the image of the superimposition).     \nThe RMSD between 1441 pruned atom pairs is 0.000 angstroms.\n\n\n\n\n### 6M17\nWe have tried to build a newer complex such as 6m17, which is a membrane protein of the SARS coronavirus. It has been released at PDB on march 2020.  Knowing the structure of this membrane protein and how it interacts with other proteins can be very useful in order to find a vaccine or a drug that prevents us from this virus.  It has three different amino acid chains and all of them have stoichiometry two, making a total of 6 chains.  The data to construct the complex is inside the folder `examples/6m17`. Execution with command-line arguments:\n\n```shell\n$ cconstruct -fa examples/6m17/6m17.fa -pdb examples/6m17/6m17Dir -o 6M17 -st examples/6m17/6m17_st.txt -v\n```\n\nThe resulting structure is stored in the file `6M17_model.pdb`, which is in the directory `6M17`.\n\n \n\n| **Complex Constructor** | **Reference structure** | **Superimposition** |\n| :---: | :---: | :---: |\n|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/6m17Example/6m17CC.png\" title=\"6m17CC\" alt=\"6m17CC\" height=230  >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/6m17Example/6m17REF.png\" title=\"6m17REF\" alt=\"6m17REF\" height=230  >|<img src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/6m17Example/6m17REF_CC.png\" title=\"6m17REF_CC\" alt=\"6m17REF_CC\" height=230 >\n  \nWe observe that the whole complex is correctly constructed and after superimposing the obtained structure with the structure from PDB, we can see that all the chains fit quite well with the reference structure.    \nThe RMSD computed with Chimera between 748 pruned atom pairs is 0.000 angstroms.\n\n\n\n\n\n### Enterovirus capsid\nIn order to see how the Complex Constructor works with a complex whose structure is unknown, we have run Complex Constructor with an enterovirus capsid, composed by three different amino acid chains. To execute this example, we provide a stoichiometry file with stoichiometry equal to 18 for all three chains. However, with a total of 54 chains the complex is not totally constructed. \n\nThe following image shows the construction of the complex with stoichiometry 32, a total of 96 chains. To perform the construction with so many chains, we had to modify the script: the program was able to generate a total of 54 chains, with letters A-Z and a-z, so the maximum stoichiometry for three chains was 18. In addition to this limitation, ICM and Chimera, allow a maximum of 99999 atoms to be represented, and the complex exceeded this number.\n\nTo solve both issues, we made modifications for this particular case so that we could create two different pdb files, like this, we divided the pdb structure in two files `ENTV_model_part1.pdb` and `ENTV_model_part2.pdb`, to be able to repeat the chain letters in the second file and open both files with ICM or Chimera. These two pdb files are included in the directory `examples/entv`. \n\nNevertheless, as the modifications were just performed to build this particular case, the stoichiometry file that we have included to run this example, is the one that will work with the 'default' script, this is, stoichiometry equal to 18 for all the three chains. Like this, the resulting pdb file will be partly constructed. To run the enterovirus capside 'reduced' example use the following commands: \n\n```shell\n$ python3 complexconstructor -fa examples/entv/entv.fa -pdb examples/entv/entvDir -o ENTV -st examples/entv/entv_st.txt -v\n\n```\n\nThe resulting structure is in directory `ENTV`, in the file `ENTV_model.pdb`, with the 'reduced' structure.\n\nThe 'extended' structure, contained in `ENTV_model_part1.pdb` and `ENTV_model_part2.pdb`, is as follows:\n\n\n<img  hspace=\"70\" src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/entvExample/entv.gif\" title=\"entv\" alt=\"entv\" style=\"max-width:60%;\" >\n\nWe can see that, the structure is not completed yet, but using a third pbd would allow adding more chains and complete the complex. The structure of the capside is correctly visualized. \n\n## Performance\n\n<img align=\"center\" src=\"https://raw.githubusercontent.com/Argonvi/SBI-PYT_Project/master/assets/ComplexBuilderDiagram_.jpg\" title=\"ComplexConstructorLogo\" alt=\"ComplexConstructorDiagram\" >\n\n- Before adding a new chain to the macrocomplex, the number of clashes between the new chain and the previous structure is checked. The function `sequence_clashing` calculates how many CA, P or N1 atoms from the new chain are closer than 2 angstroms to any other CA, P or N1 atom of the previous macrocomplex, this is, the number of clashes. If the number of clashes is above 35, the new chain won't be added to the macrocomplex. \n\n### Structure of the package\n\n#### ComplexConstructor\n\n- `main.py`: main module of Complex Constructor. It connects with all the rest of modules. \n\n- `utilities.py`: module with all the functions needed to run the construction of macrocomplexes, as the `constructor` function or `superimpositor`.\n\n- `argparser.py`: reads and organizes the command-line arguments.\n\n- `interface.py`: contains the configuration of the graphical interface and passes the inputs to the main module.\n\n- `logProgress.py`: this module creates the log file and its contents when the verbose option is selected.\n\n- `helpText.py`: it is a module with the help text to be added to the graphical interface 'Help' option.\n\n\n## Limitations\n\n- The main limitation of the program is the preparation of the input files. The FASTA file must have each ID just once and the sequences must be unique, that means, if a structure has a stoichiometry 2A2B, the FASTA file should contain just once the sequence of the chain A and once the sequence of the chain B.\n\n- Furthermore, as we have set that the sequence identity should be over 99%, the sequences in the pdb files and those in the FASTA file should be almost identical in order to be identified as the same sequence. Nevertheless, it is not a big limitation as it is a parameter that could be changed in the code if needed. \n\n- The amino acids labelled as 'unknown' in the pdb files and as 'X' in the FASTA sequences, cannot be correctly identified so they should not be present in the input files. As a consequence, those chains containing unknown amino acids are just partly constructed in the final model. \n\n- We would have also liked to check the Z-score for the macrocomplexes with unknown structure through the energy analysis. We thought about creating a .cmd file to be executed with ProSa 2003 in order to create a file with the z-score table. Like this, we would have been able to check if the structure was energetically valid. However, as the Prosa software is temporarily inaccessible we have left this part of the analysis for the moment.\n\n\n## Team\n| <a href=\"https://github.com/Paulagomis\" target=\"_blank\">**Paula Gomis Rosa**</a> | <a href=\"https://github.com/Argonvi\" target=\"_blank\">**Arturo González Vilanova**</a> | <a href=\"https://github.com/MartaLoBalastegui\" target=\"_blank\">**Marta López Balastegui**</a> |\n| :---: |:---:| :---:|\n| [![PaulaGomis](https://avatars2.githubusercontent.com/u/60719236?s=400&v=4)](https://github.com/Paulagomis)    | [![ArturoGonzalez](https://avatars1.githubusercontent.com/u/59646158?s=400&v=4)](https://github.com/Argonvi) | [![MartaLopez](https://avatars3.githubusercontent.com/u/44771228?s=400&v=4)](https://github.com/MartaLoBalastegui)  |", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/Argonvi/SBI-PYT_Project", "keywords": "macrocomplex bioinformatics structural pdb protein", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "complexconstructor", "package_url": "https://pypi.org/project/complexconstructor/", "platform": "", "project_url": "https://pypi.org/project/complexconstructor/", "project_urls": {"Homepage": "https://github.com/Argonvi/SBI-PYT_Project"}, "release_url": "https://pypi.org/project/complexconstructor/0.1.6/", "requires_dist": null, "requires_python": "", "summary": "Generate macrocomplexes superimposing       paired interacting elements.", "version": "0.1.6", "yanked": false, "html_description": "<div class=\"project-description\">\n            <img alt=\"ComplexConstructorLogo\" height=\"100\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8c0d8fb8095f71417a984bcbd5c56ae336a1a88a/68747470733a2f2f63646e2e706978616261792e636f6d2f70686f746f2f323031372f31302f32352f30362f31332f70726f7465696e2d69636f6e2d323838373035305f3936305f3732302e706e67\" width=\"100\">\n\n\n<h1>Complex Constructor</h1>\n<blockquote>\n<p>Generate macrocomplexes superimposing paired interacting elements</p>\n</blockquote>\n<blockquote>\n<p>protein - protein or protein - DNA</p>\n</blockquote>\n<blockquote>\n<p>the result is stored in a PDB file</p>\n</blockquote>\n<h2>Table of Content</h2>\n<ul>\n<li><a href=\"#whybuildingcomplexes?\" rel=\"nofollow\">Why building complexes?</a></li>\n<li><a href=\"#installation\" rel=\"nofollow\">Installation</a></li>\n<li><a href=\"#options\" rel=\"nofollow\">Options</a></li>\n<li><a href=\"#examples\" rel=\"nofollow\">Examples</a></li>\n<li><a href=\"#performance\" rel=\"nofollow\">Performance</a></li>\n<li><a href=\"#limitations\" rel=\"nofollow\">Limitations</a></li>\n<li><a href=\"#team\" rel=\"nofollow\">Team</a></li>\n</ul>\n<h2>Why building complexes?</h2>\n<p>The total number of proteins in humans is around 20K. From this quantity we already know the structure of 4K proteins. However, for 6K we have good templates and for other 6K of them, we have reasonably good templates; that means we have more or less 50-70% of the structure of human proteins covered.</p>\n<p>On the other hand, the number of interactions that may occur between all the proteins is still unknown. There are some studies estimating 130-650K interactions, while others estimate more than millions. In this context, 120K interactions are confirmed from experiments and only 7K structures of complexes are known, which is a very small proportion of the total number of possible interactions anyway.</p>\n<p>So, the complex-structure coverage, including homologs, is around the 30%, much less than the mentioned coverage of monomers. That means there is still a long way to go into the complex-structure study field.</p>\n<p>The 3D structure of interacting proteins is necessary for them to develop their function. It is also fundamental for molecular recognition and contributes to the complexity of protein interaction networks. However, identifying the structure of interacting proteins forming complexes, is not an easy task. In monomers, homology modelling can be used to nearly cover all folds to determine a protein structure but, for interactions that is not enough.</p>\n<p>Complex Constructor tries to generate macrocomplex structures. To do so, the superimposing technique is used: it receives a list of pdb files, each of these files contains the structure of an interacting pair and, by superimposing the common elements of different pairs, it builds the final structure. Although there are other methods to generate macrocomplexes, the superimposition is fast and effective. Furthermore, not only protein-protein interacting pairs can be analyzed, but also proteins with DNA, to end up generating a macrocomplex structure of proteins and DNA chains.</p>\n<p>The core of Complex Constructor is the <code>constructor</code> function, which is the responsible of the building process. The pdbs of the interacting pairs are analyzed and classified using the information of the FASTA file. The common chains in different pdb files are identified: they will have more than 99% of identity in their sequences. After this classification, <code>constructor</code> begins to append elements to the macrocomplex: it starts with a pair, then it looks for another pair that has a common chain with the starting one and, if after superimposing the common chain, the structure has not clashed, it appends the new chain. Like this, the macrocomplex has now three chains. In the next step, the process will be repeated by looking for another pair, superimposing the common chain and checking the possible clashes. The program is described <a href=\"#performance\" rel=\"nofollow\">here</a>.</p>\n<p>In addition, as a lot of complexes follow a determined stoichiometry, Complex Constructor can also make the construction following it. If a stoichiometry is defined, the final structure will contain the exact number of elements indicated by it. In other case, the structure will contain each different chain only once.</p>\n<p>Finally, a new pdb file with the resulting structure of the macrocomplex is stored in the output folder called <code>outputFolder_model.pdb</code>.</p>\n \n<h2>Installation</h2>\n<p>Prerequisites:</p>\n<ul>\n<li>Python 3.0 <code>https://www.python.org/download/releases/3.0/</code></li>\n</ul>\n<p>There are two different ways to download the package: using <code>pip3</code> or cloning the repo.</p>\n<h3>Option 1. Install from pip</h3>\n<ul>\n<li>Install Complex Constructor with the Python package installer <code>pip3</code></li>\n</ul>\n<pre>$ pip3 install complexconstructor\n</pre>\n<h3>Option 2. Clone</h3>\n<ul>\n<li>Otherwise, you can clone the repo to your local machine</li>\n</ul>\n<pre>$ git clone https://github.com/Argonvi/SBI-PYT_Project.git\n</pre>\n<ul>\n<li>Install the package</li>\n</ul>\n<pre>$ <span class=\"nb\">cd</span> SBI-PYT_Project\n$ sudo python3 setup.py install\n</pre>\n<h3>Setup</h3>\n<p>Complex Constructor requires the package BioPython <code>https://biopython.org/wiki/Download</code></p>\n<ul>\n<li>The installation is easy using Python package management tool <code>pip3</code></li>\n</ul>\n<pre>$ pip3 install biopython\n$ pip3 install biopython --upgrade\n</pre>\n<h3>Download the data to run the examples</h3>\n<p>To run the different <a href=\"#examples\" rel=\"nofollow\">examples</a> of this tutorial, download the folder <code>examples</code>. Inside it you can find all the required inputs to execute the examples.</p>\n<p>You can download the compressed folder with the following command:</p>\n<pre>$ wget https://github.com/Argonvi/SBI-PYT_Project/raw/master/examples.tar.gz\n</pre>\n<p>Then uncompress with:</p>\n<pre>$ tar xvfz examples.tar.gz\n</pre>\n<h2>Options</h2>\n<p>Complex Constructor can be run using command-line arguments or using the graphical interface.</p>\n<h3>Command-line</h3>\n<p>You can introduce the different arguments via command-line:</p>\n<h4>Mandatory arguments</h4>\n<p>To execute Complex Constructor three arguments are required:</p>\n<ul>\n<li>\n<p><code>-fa</code> <code>--fasta</code>: FASTA file with the sequences of the proteins or DNA that will conform the complex.</p>\n</li>\n<li>\n<p><code>-pdb</code> <code>--pdbDir</code>: directory containing the pdb files with the structure of the pairs that will conform the complex.</p>\n</li>\n<li>\n<p><code>-o</code> <code>--output</code>: name of the directory where the complex results will be stored.</p>\n</li>\n</ul>\n<blockquote>\n<p>Note that, if the output directory already exists, the results will be overwritten.</p>\n</blockquote>\n<h4>Optional arguments</h4>\n<ul>\n<li>\n<p><code>-v</code> <code>--verbose</code>: show the detailed progression of the building process in a file called 'ComplexConstructor.log'. It will be stored in the output directory.</p>\n</li>\n<li>\n<p><code>-st</code> <code>--stoichiometry</code>: name of the file in .txt format containing the stoichiometry of the complex. The information of the stoichiometry must be in the following order: the ID of the sequence chain (concordant with the FASTA file ID) followed by ':' and the number of times it has to be present in the complex.</p>\n<p><code>ID_FASTA_file</code> : <code>stoichiometry</code> One per line.</p>\n<p>In case this option is not used, the program will build the complex using each chain only once.</p>\n<p>Take a look at some examples <a href=\"#examples\" rel=\"nofollow\">here</a>.</p>\n</li>\n</ul>\n<h3>Graphical interface</h3>\n<p>Otherwise, the macrocomplex can also be built using the graphical interface:</p>\n<pre>$  cconstruct -gui\n</pre>\n<blockquote>\n<p>In this case just the <code>-gui</code> tag is needed!</p>\n</blockquote>\n<ul>\n<li>To build the macrocomplex fill in the main window requirements. As for running the program via command-line, a FASTA file with the sequences and a directory with the pdb files of the interacting pairs are required. In addition, a name for the folder where the results will be stored is needed, after typing it you should confirm it.</li>\n</ul>\n<blockquote>\n<p>Note that, to select the PDB directory you have to enter in the desired directory and then select it. You can see how it works in the <a href=\"#examples\" rel=\"nofollow\">examples</a>.</p>\n</blockquote>\n<p>Furthermore, additional options can be set:</p>\n<img alt=\"GUI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/df880b3e50c5e4c33826f255372747ec29ae3e90/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f4755492e676966\">\n<ul>\n<li>\n<p>In the main window you can specify if you want to create a log file where the process of the execution will be displayed. It will be stored in the output directory.</p>\n</li>\n<li>\n<p>In the top menu, in the 'Options' dropdown, there is the 'Add Stoichiometry' option. You can upload a file with a determined stoichiometry to be applied to the macrocomplex. As said before, the format of this file has to be the ID of the sequence, concordant with the one in the FASTA file, followed by ':' and a number. This number will be the number of times the corresponding sequence will be in the final complex.</p>\n</li>\n</ul>\n<p>Finally, in the top menu you can consult the Complex Constructor 'Help' as well.</p>\n<h2>Examples</h2>\n<p>As said before, to generate any macrocomplex structure it is required the FASTA file and a direcory with paired structures in pdb format. All the data needed to execute the following examples is in the folder <code>examples</code>, remember that you have to download it as described in the <a href=\"#installation\" rel=\"nofollow\">installation</a> section.</p>\n<ul>\n<li>The output folder will be created in the 'current' directory, the one from which you execute the Complex Constructor. Our recommendation to follow the following examples is to create a working directory, for example <code>ComplexConstructorModels</code>, and place the <code>examples</code> directory inside it, <code>ComplexConstructorModels/examples</code>. Now navigate using the <code>cd</code> command to reach <code>ComplexConstructorModels</code> directory.</li>\n</ul>\n<pre>$  <span class=\"nb\">cd</span> ComplexConstructorModels\n</pre>\n<p>Like this, the output folders will be stored in this directory.</p>\n<blockquote>\n<p>Inside the folder <code>examples</code> there are all the examples we will describe in this tutorial in the corresponding directories: <code>1gzx</code>, <code>5fj8</code>, etc. Each of them contains the required files to run Complex Constructor and also a pdb file of the reference structure, <code>exampleRef.pdb</code>, in order to check the superimposition between the constructed model and the real structure.</p>\n</blockquote>\n<h3>1GZX</h3>\n<p>Let's begin with the first example, the protein 1GZX. It is a small complex composed by two different amino acid chains and each one of them appears two times (stoichiometry 2A2B), so the final structure has four chains. In order to perform the construction of T state haemoglobin (1GZX), we need a .txt file where the stoichiometry is specified. This file can be found in the folder <code>examples/1gzx</code> and it is called <code>1gzx_st.txt</code>:</p>\n<pre>1GZXa:2\n1GZXb:2\n</pre>\n<ol>\n<li>Command line execution:</li>\n</ol>\n<pre>$ cconstruct -fa examples/1gzx/1gzx.fa -pdb examples/1gzx/1gzxDir -o 1GZX -st examples/1gzx/1gzx_st.txt -v\n</pre>\n<ul>\n<li><code>-fa</code>, mandatory: followed by the location of the FASTA file <code>1gzx.fa</code>.</li>\n</ul>\n<blockquote>\n<p>This file contains two IDs followed by the corresponding sequence, e.g. <code>1GZXa</code>, <code>1GZXb</code>. Note that, the IDs in <code>1gzx_st.txt</code> have to be concordant with them.</p>\n</blockquote>\n<ul>\n<li><code>-pdb</code>, mandatory: followed by the location of the directory with paired structures in pdb, that is <code>1gzxDir</code>.</li>\n</ul>\n<blockquote>\n<p>In this case inside this folder we should have at least three pdb files, e.g. <code>1gzx_AB.pdb</code>, <code>1gzx_AC.pdb</code>, <code>1gzx_AD.pdb</code>. If there are redundant pairs they won't be considered.</p>\n</blockquote>\n<ul>\n<li><code>-o</code>, mandatory: followed by the name of the output directory where the results will be stored, <code>1GZX</code>.</li>\n</ul>\n<blockquote>\n<p>If a directory with the same name already exists in the working folder it will be overwritten.</p>\n</blockquote>\n<ul>\n<li>\n<p><code>-st</code>: followed by the location of the file that contains the stoichiometry information, that is, the file  <code>1gzx_st.txt</code>.</p>\n</li>\n<li>\n<p><code>-v</code>: when it is used it turns ON the verbose option. It is always recommended to create a logfile where the process information will be displayed. In order to deactivate the creation of the logfile, do not add the <code>-v</code> flag.</p>\n</li>\n</ul>\n<ol>\n<li>Graphical interface execution:</li>\n</ol>\n<img alt=\"1gzxGUI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8b9b4f08b9d5189d089f4aa48f09b9e53bf5ca86/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f31677a784578616d706c652f31475a582e676966\">\n<p>The resulting structure is stored in the current directory, <code>ComplexConstructorModels</code>, in the folder <code>1GZX</code>, file <code>1GZX_model.pdb</code>.</p>\n<table>\n<thead>\n<tr>\n<th align=\"center\"><strong>Complex Constructor</strong></th>\n<th align=\"center\"><strong>Reference structure</strong></th>\n<th align=\"center\"><strong>Superimposition</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\"><img alt=\"1gzxCC\" height=\"250\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/d0a190e8f3fc98ad1e72ddaad490377bbcc12fc7/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f31677a784578616d706c652f31677a7843432e706e67\"></td>\n<td align=\"center\"><img alt=\"1gzxREF\" height=\"250\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/ffa4d166c124f403a468786158401e68a30e7ac8/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f31677a784578616d706c652f31677a785245462e706e67\"></td>\n<td align=\"center\"><img alt=\"1gzxREF_CC\" height=\"250\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/495c5d71dc88d89659d733ae61235af5c6fc2fcf/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f31677a784578616d706c652f31677a785245465f43432e706e67\"></td>\n</tr></tbody></table>\n<p>In the superimposition image we can observe the reference structure in red and the structure obtained with Complex Constructor in blue. We observe that the colours are mixed in most of the chains as our model fits the reference downloaded from PDB quite well.<br>\nUsing Chimera we computed the RMSD between 146 pruned atom pairs and obtained a result of 0.000 angstroms.</p>\n<h3>3KUY</h3>\n<p>3KUY is a complex composed by a DNA coil and a core made of protein chains. There are four  different amino acid chains and one nucleotide chain, all of them have stoichiometry two, making a total of 10 chains. The procedure to run this example is the same as the explained before. The data to construct the complex is inside the folder <code>examples/3kuy</code>. Execution with command-line arguments:</p>\n<pre>$ cconstruct -fa examples/3kuy/3kuy.fa -pdb examples/3kuy/3kuyDir -o 3KUY -st examples/3kuy/3kuy_st.txt -v\n</pre>\n<p>The resulting structure is stored in the file <code>3KUY_model.pdb</code>, which is in the directory <code>3KUY</code>.</p>\n<blockquote>\n<p>In order to construct this complex (and all the following examples) using the graphical interface, we should repeat the same process as the one explained in the previous example, but in this case, we will take the inputs from the folder <code>examples/3kuy</code>.</p>\n</blockquote>\n<table>\n<thead>\n<tr>\n<th align=\"center\"><strong>Complex Constructor</strong></th>\n<th align=\"center\"><strong>Reference structure</strong></th>\n<th align=\"center\"><strong>Superimposition</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\"><img alt=\"3kuyCC\" height=\"260\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/c2ecb7090d5e5fb346d5903cd8d285e80f715c43/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f336b75794578616d706c652f336b757943432e706e67\"></td>\n<td align=\"center\"><img alt=\"3kuyRef\" height=\"260\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/6f8e35ad0e73871fd8c2c9c85baf0af183b3ab40/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f336b75794578616d706c652f336b75795265662e706e67\"></td>\n<td align=\"center\"><img alt=\"3kuyRef_CC\" height=\"260\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/94ebf7b37aa6b97296ec6d5e7ea814ea2ed0513e/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f336b75794578616d706c652f336b75795265665f43432e706e67\"></td>\n</tr></tbody></table>\n<p>In the superimposition image we can observe the amino acid chains of the reference structure in red and the DNA chains in yellow. The colours of the structure obtained with Complex Constructor are blue and orange respectively.<br>\nWe observe that the whole complex is correctly constructed and after superimposing the obtained structure with the structure downloaded from PDB, we can see that both protein chains and DNA chains fit quite well with the reference structure.<br>\nThe RMSD computed with Chimera between 106 pruned atom pairs is 0.000 angstroms.</p>\n<h3>4R3O</h3>\n<p>The Human 20S Proteasome (4R3O), is a bigger complex but just made of amino acid chains. It is symmetric and it is composed by 14 different chains, all of them with stoichiometry  two, making a total of 28 chains in the complex. Its input data can be found in <code>examples/4r3o</code>. Execution with command-line arguments:</p>\n<pre>$ cconstruc -fa examples/4r3o/4r3o.fa -pdb examples/4r3o/4r3oDir -o 4R3O -st examples/4r3o/4r3o_st.txt -v\n</pre>\n<p>The resulting structure is stored in the file <code>4R3O_model.pdb</code>, which is in the directory <code>4R3O</code>.</p>\n<table>\n<thead>\n<tr>\n<th align=\"center\"><strong>Complex Constructor</strong></th>\n<th align=\"center\"><strong>Reference structure</strong></th>\n<th align=\"center\"><strong>Superimposition</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\"><img alt=\"4r3oCC\" height=\"240\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/e363a110b612ab71fe374360c5ff24b22499d7fd/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f3472336f4578616d706c652f3472336f43432e706e67\"></td>\n<td align=\"center\"><img alt=\"4r3oRef\" height=\"240\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8ffb253fa8329a3c80f1b5ff4d99ff1845183659/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f3472336f4578616d706c652f3472336f5265662e706e67\"></td>\n<td align=\"center\"><img alt=\"4r3oRef_CC\" height=\"240\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/c653b37e0a21519e213a999b30938bf3e7db8924/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f3472336f4578616d706c652f3472336f5265665f43432e706e67\"></td>\n</tr></tbody></table>\n<p>In this case, as well, the constructed model fits the reference structure.<br>\nThe RMSD between 250 pruned atom pairs is 0.000 angstroms.</p>\n<h3>5FJ8</h3>\n<p>The next complex is composed by amino acid and nucleotide sequences but, in this case, it is not symmetric. It is composed by 20 different chains and all of them are present just once in the structure. The required inputs for the construction are in <code>examples/5fj8</code>.</p>\n<pre>$ ccontruct -fa examples/5fj8/5fj8.fa -pdb examples/5fj8/5fj8Dir -o 5FJ8 -st examples/5fj8/5fj8_st.txt -v\n</pre>\n<p>The resulting structure is stored in the file <code>5FJ8_model.pdb</code>, which is in the directory <code>5FJ8</code>.</p>\n<table>\n<thead>\n<tr>\n<th align=\"center\"><strong>Complex Constructor</strong></th>\n<th align=\"center\"><strong>Reference structure</strong></th>\n<th align=\"center\"><strong>Superimposition</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\"><img alt=\"5fj8CC\" height=\"240\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2783d0e55698c23c40ae18da2cf154da104eca4c/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f35666a384578616d706c652f35666a3843432e706e67\"></td>\n<td align=\"center\"><img alt=\"5fj8Ref\" height=\"240\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/6ed87dbf9c21c88630f3931dd6526735002b504c/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f35666a384578616d706c652f35666a385265662e706e67\"></td>\n<td align=\"center\"><img alt=\"5fj8Ref_CC\" height=\"240\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/dd52e1c5fb3544d3c780fce829747bb3beba7aaa/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f35666a384578616d706c652f35666a385265665f43432e706e67\"></td>\n</tr></tbody></table>\n<p>The created model and the reference structure are superimposed quite well as in previous cases. In this particular case, the amino acid chain Q, had several amino acids labelled as 'unknown' in the pdb files and as 'X' in the FASTA sequence. To deal with this, we had to take out these 35 amino acids from input files (FASTA file and pdb files), and so, the Q chain is partly constructed in the model. Nevertheless, the rest of the structure is correctly reproduced.<br>\nThe RMSD between 1422 pruned atom pairs is 0.000 angstroms.</p>\n<h3>6GMH</h3>\n<p>Another non-symmetric example, but also with DNA sequences, is 6GMH. It has 17 amino acid chains and 3 DNA chains and as in the previous case, all of them appear only once in the structure. The required inputs for the construction are in <code>examples/6gmh</code>.</p>\n<pre>$ cconstruct -fa examples/6gmh/6gmh.fa -pdb examples/6gmh/6gmhDir -o 6GMH -st examples/6gmh/6gmh_st.txt -v\n</pre>\n<p>The resulting structure is stored in the file <code>6GMH_model.pdb</code>, which is in the directory <code>6GMH</code>.</p>\n<table>\n<thead>\n<tr>\n<th align=\"center\"><strong>Complex Constructor</strong></th>\n<th align=\"center\"><strong>Reference structure</strong></th>\n<th align=\"center\"><strong>Superimposition</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\"><img alt=\"6gmhCC\" height=\"240\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/787d43b8a6a257840e0939b5a5d3896717cfc89c/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f36676d684578616d706c652f36676d6843432e706e67\"></td>\n<td align=\"center\"><img alt=\"6gmhRef\" height=\"240\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/6335c47fe898995044aa0f648584cee16b88a827/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f36676d684578616d706c652f36676d685245462e706e67\"></td>\n<td align=\"center\"><img alt=\"6gmhRef_CC\" height=\"240\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/9e27f8e914f54221eec9bf417f675066962679ec/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f36676d684578616d706c652f36676d685245465f43432e706e67\"></td>\n</tr></tbody></table>\n<p>In this case, the pdb structure had bigger regions labelled as 'unknown'. As those regions are not recognized by Complex Constructor, we removed them from the input pdb pairs and from the FASTA sequences, as in the previous example. In the Q chain, from a total of 884 amino acids, 300 of them were labelled as 'unknown', so only 584 remained in order to construct the model, (that is why this chain is not completely constructed in our model). It happened to be the same in chain M, but in this case only 8 amino acids were missing. On the other hand, the chains U, V and X had to be completely deleted in our model, since all their amino acid were labelled as 'unknown' in the pdb file.<br>\nEven though we had to remove several amino acids and some chains, the model is well constructed and it fits the reference structure as in previous examples, (as we can see in the image of the superimposition).<br>\nThe RMSD between 1441 pruned atom pairs is 0.000 angstroms.</p>\n<h3>6M17</h3>\n<p>We have tried to build a newer complex such as 6m17, which is a membrane protein of the SARS coronavirus. It has been released at PDB on march 2020.  Knowing the structure of this membrane protein and how it interacts with other proteins can be very useful in order to find a vaccine or a drug that prevents us from this virus.  It has three different amino acid chains and all of them have stoichiometry two, making a total of 6 chains.  The data to construct the complex is inside the folder <code>examples/6m17</code>. Execution with command-line arguments:</p>\n<pre>$ cconstruct -fa examples/6m17/6m17.fa -pdb examples/6m17/6m17Dir -o 6M17 -st examples/6m17/6m17_st.txt -v\n</pre>\n<p>The resulting structure is stored in the file <code>6M17_model.pdb</code>, which is in the directory <code>6M17</code>.</p>\n<table>\n<thead>\n<tr>\n<th align=\"center\"><strong>Complex Constructor</strong></th>\n<th align=\"center\"><strong>Reference structure</strong></th>\n<th align=\"center\"><strong>Superimposition</strong></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\"><img alt=\"6m17CC\" height=\"230\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/71c5b5fdb58ccaf9f6afa53f104ffce64b7fa03d/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f366d31374578616d706c652f366d313743432e706e67\"></td>\n<td align=\"center\"><img alt=\"6m17REF\" height=\"230\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/a55db0d8b5e09240d6b98ecb45f4c6bec54ed603/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f366d31374578616d706c652f366d31375245462e706e67\"></td>\n<td align=\"center\"><img alt=\"6m17REF_CC\" height=\"230\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/71c962807bb86e25e2a8f86f25f73480a5145984/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f366d31374578616d706c652f366d31375245465f43432e706e67\"></td>\n</tr></tbody></table>\n<p>We observe that the whole complex is correctly constructed and after superimposing the obtained structure with the structure from PDB, we can see that all the chains fit quite well with the reference structure.<br>\nThe RMSD computed with Chimera between 748 pruned atom pairs is 0.000 angstroms.</p>\n<h3>Enterovirus capsid</h3>\n<p>In order to see how the Complex Constructor works with a complex whose structure is unknown, we have run Complex Constructor with an enterovirus capsid, composed by three different amino acid chains. To execute this example, we provide a stoichiometry file with stoichiometry equal to 18 for all three chains. However, with a total of 54 chains the complex is not totally constructed.</p>\n<p>The following image shows the construction of the complex with stoichiometry 32, a total of 96 chains. To perform the construction with so many chains, we had to modify the script: the program was able to generate a total of 54 chains, with letters A-Z and a-z, so the maximum stoichiometry for three chains was 18. In addition to this limitation, ICM and Chimera, allow a maximum of 99999 atoms to be represented, and the complex exceeded this number.</p>\n<p>To solve both issues, we made modifications for this particular case so that we could create two different pdb files, like this, we divided the pdb structure in two files <code>ENTV_model_part1.pdb</code> and <code>ENTV_model_part2.pdb</code>, to be able to repeat the chain letters in the second file and open both files with ICM or Chimera. These two pdb files are included in the directory <code>examples/entv</code>.</p>\n<p>Nevertheless, as the modifications were just performed to build this particular case, the stoichiometry file that we have included to run this example, is the one that will work with the 'default' script, this is, stoichiometry equal to 18 for all the three chains. Like this, the resulting pdb file will be partly constructed. To run the enterovirus capside 'reduced' example use the following commands:</p>\n<pre>$ python3 complexconstructor -fa examples/entv/entv.fa -pdb examples/entv/entvDir -o ENTV -st examples/entv/entv_st.txt -v\n</pre>\n<p>The resulting structure is in directory <code>ENTV</code>, in the file <code>ENTV_model.pdb</code>, with the 'reduced' structure.</p>\n<p>The 'extended' structure, contained in <code>ENTV_model_part1.pdb</code> and <code>ENTV_model_part2.pdb</code>, is as follows:</p>\n<img alt=\"entv\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/cf5bf1c1d50002b48be3e132d493ae37eb11ceaa/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f656e74764578616d706c652f656e74762e676966\">\n<p>We can see that, the structure is not completed yet, but using a third pbd would allow adding more chains and complete the complex. The structure of the capside is correctly visualized.</p>\n<h2>Performance</h2>\n<img align=\"center\" alt=\"ComplexConstructorDiagram\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/93c1abd5cae04c9bd35b61f6dfe5765ea64e9880/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f4172676f6e76692f5342492d5059545f50726f6a6563742f6d61737465722f6173736574732f436f6d706c65784275696c6465724469616772616d5f2e6a7067\">\n<ul>\n<li>Before adding a new chain to the macrocomplex, the number of clashes between the new chain and the previous structure is checked. The function <code>sequence_clashing</code> calculates how many CA, P or N1 atoms from the new chain are closer than 2 angstroms to any other CA, P or N1 atom of the previous macrocomplex, this is, the number of clashes. If the number of clashes is above 35, the new chain won't be added to the macrocomplex.</li>\n</ul>\n<h3>Structure of the package</h3>\n<h4>ComplexConstructor</h4>\n<ul>\n<li>\n<p><code>main.py</code>: main module of Complex Constructor. It connects with all the rest of modules.</p>\n</li>\n<li>\n<p><code>utilities.py</code>: module with all the functions needed to run the construction of macrocomplexes, as the <code>constructor</code> function or <code>superimpositor</code>.</p>\n</li>\n<li>\n<p><code>argparser.py</code>: reads and organizes the command-line arguments.</p>\n</li>\n<li>\n<p><code>interface.py</code>: contains the configuration of the graphical interface and passes the inputs to the main module.</p>\n</li>\n<li>\n<p><code>logProgress.py</code>: this module creates the log file and its contents when the verbose option is selected.</p>\n</li>\n<li>\n<p><code>helpText.py</code>: it is a module with the help text to be added to the graphical interface 'Help' option.</p>\n</li>\n</ul>\n<h2>Limitations</h2>\n<ul>\n<li>\n<p>The main limitation of the program is the preparation of the input files. The FASTA file must have each ID just once and the sequences must be unique, that means, if a structure has a stoichiometry 2A2B, the FASTA file should contain just once the sequence of the chain A and once the sequence of the chain B.</p>\n</li>\n<li>\n<p>Furthermore, as we have set that the sequence identity should be over 99%, the sequences in the pdb files and those in the FASTA file should be almost identical in order to be identified as the same sequence. Nevertheless, it is not a big limitation as it is a parameter that could be changed in the code if needed.</p>\n</li>\n<li>\n<p>The amino acids labelled as 'unknown' in the pdb files and as 'X' in the FASTA sequences, cannot be correctly identified so they should not be present in the input files. As a consequence, those chains containing unknown amino acids are just partly constructed in the final model.</p>\n</li>\n<li>\n<p>We would have also liked to check the Z-score for the macrocomplexes with unknown structure through the energy analysis. We thought about creating a .cmd file to be executed with ProSa 2003 in order to create a file with the z-score table. Like this, we would have been able to check if the structure was energetically valid. However, as the Prosa software is temporarily inaccessible we have left this part of the analysis for the moment.</p>\n</li>\n</ul>\n<h2>Team</h2>\n<table>\n<thead>\n<tr>\n<th align=\"center\"><a href=\"https://github.com/Paulagomis\" rel=\"nofollow\"><strong>Paula Gomis Rosa</strong></a></th>\n<th align=\"center\"><a href=\"https://github.com/Argonvi\" rel=\"nofollow\"><strong>Arturo González Vilanova</strong></a></th>\n<th align=\"center\"><a href=\"https://github.com/MartaLoBalastegui\" rel=\"nofollow\"><strong>Marta López Balastegui</strong></a></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"center\"><a href=\"https://github.com/Paulagomis\" rel=\"nofollow\"><img alt=\"PaulaGomis\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/670477be45a9d9d49f35963d04192cf2d6048d7a/68747470733a2f2f61766174617273322e67697468756275736572636f6e74656e742e636f6d2f752f36303731393233363f733d34303026763d34\"></a></td>\n<td align=\"center\"><a href=\"https://github.com/Argonvi\" rel=\"nofollow\"><img alt=\"ArturoGonzalez\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/ce288f68f1ca68ad973281fdff0dcc31d31fad36/68747470733a2f2f61766174617273312e67697468756275736572636f6e74656e742e636f6d2f752f35393634363135383f733d34303026763d34\"></a></td>\n<td align=\"center\"><a href=\"https://github.com/MartaLoBalastegui\" rel=\"nofollow\"><img alt=\"MartaLopez\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/85029bcbb7422cc677ae8eebb69f172a510aeae0/68747470733a2f2f61766174617273332e67697468756275736572636f6e74656e742e636f6d2f752f34343737313232383f733d34303026763d34\"></a></td>\n</tr></tbody></table>\n\n          </div>"}, "last_serial": 6935431, "releases": {"0.1.3": [{"comment_text": "", "digests": {"md5": "f05e1a02d5eb125299dee278c7d064e0", "sha256": "00b9996171bad29993d8ac1b466b7b04c44e1de6fce08fb7fe451907ad9801de"}, "downloads": -1, "filename": "complexconstructor-0.1.3.tar.gz", "has_sig": false, "md5_digest": "f05e1a02d5eb125299dee278c7d064e0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 25329, "upload_time": "2020-03-25T12:41:41", "upload_time_iso_8601": "2020-03-25T12:41:41.407835Z", "url": "https://files.pythonhosted.org/packages/02/64/ee0a371fe37db45a6e9574d944c7f5759592db671139b2f282f0d23175ed/complexconstructor-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "e868107921c8064f3273f9c1f56a79d3", "sha256": "5d753203e09132f2d01d79d56abc9e8ef888f393964d5720317f82c7e2d4d45b"}, "downloads": -1, "filename": "complexconstructor-0.1.4.tar.gz", "has_sig": false, "md5_digest": "e868107921c8064f3273f9c1f56a79d3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 89364, "upload_time": "2020-03-25T12:49:27", "upload_time_iso_8601": "2020-03-25T12:49:27.143948Z", "url": "https://files.pythonhosted.org/packages/76/2b/788e23b204661fcb787bf5f3bfcf0d049f74a2f19a9944f8d29822066fe1/complexconstructor-0.1.4.tar.gz", "yanked": false}], "0.1.5": [{"comment_text": "", "digests": {"md5": "32a741174bf8f89a0ceb7b400dd3c4b7", "sha256": "a6d75e43d35d630a76f44f4a7aa14a7f323e4584e4b621a8d7f5b32781676a0c"}, "downloads": -1, "filename": "complexconstructor-0.1.5.tar.gz", "has_sig": false, "md5_digest": "32a741174bf8f89a0ceb7b400dd3c4b7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27425, "upload_time": "2020-03-27T17:28:18", "upload_time_iso_8601": "2020-03-27T17:28:18.377991Z", "url": "https://files.pythonhosted.org/packages/7a/d6/66ecf22d2521628974f89656ba60461bb6f190d5b1f544dae7228f688882/complexconstructor-0.1.5.tar.gz", "yanked": false}], "0.1.6": [{"comment_text": "", "digests": {"md5": "821a052cd2e00d6b23826e5cb7cf3787", "sha256": "3e7244717ea4037383354ac33ae7acbed6fb80b97be92300869503e82e61cd33"}, "downloads": -1, "filename": "complexconstructor-0.1.6-py3.6.egg", "has_sig": false, "md5_digest": "821a052cd2e00d6b23826e5cb7cf3787", "packagetype": "bdist_egg", "python_version": "3.6", "requires_python": null, "size": 97809, "upload_time": "2020-04-02T12:55:45", "upload_time_iso_8601": "2020-04-02T12:55:45.724640Z", "url": "https://files.pythonhosted.org/packages/02/2c/91456bf8f2f32ee73d6ccf5d7363f8a7c8669c23006930bd7088fad6bbef/complexconstructor-0.1.6-py3.6.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "6018444101745ecc4ba9ae8088ce76a1", "sha256": "f6db57fa9b29a8921d28cf4bc5d0f1bbf202bbb458a2ddeef71758a6e48695c4"}, "downloads": -1, "filename": "complexconstructor-0.1.6.tar.gz", "has_sig": false, "md5_digest": "6018444101745ecc4ba9ae8088ce76a1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 92053, "upload_time": "2020-04-02T12:55:47", "upload_time_iso_8601": "2020-04-02T12:55:47.618475Z", "url": "https://files.pythonhosted.org/packages/1d/6a/3d98c45cb65c4faca8cfb4791cfa42f05d387ca256bd6ecf537698cd0010/complexconstructor-0.1.6.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "821a052cd2e00d6b23826e5cb7cf3787", "sha256": "3e7244717ea4037383354ac33ae7acbed6fb80b97be92300869503e82e61cd33"}, "downloads": -1, "filename": "complexconstructor-0.1.6-py3.6.egg", "has_sig": false, "md5_digest": "821a052cd2e00d6b23826e5cb7cf3787", "packagetype": "bdist_egg", "python_version": "3.6", "requires_python": null, "size": 97809, "upload_time": "2020-04-02T12:55:45", "upload_time_iso_8601": "2020-04-02T12:55:45.724640Z", "url": "https://files.pythonhosted.org/packages/02/2c/91456bf8f2f32ee73d6ccf5d7363f8a7c8669c23006930bd7088fad6bbef/complexconstructor-0.1.6-py3.6.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "6018444101745ecc4ba9ae8088ce76a1", "sha256": "f6db57fa9b29a8921d28cf4bc5d0f1bbf202bbb458a2ddeef71758a6e48695c4"}, "downloads": -1, "filename": "complexconstructor-0.1.6.tar.gz", "has_sig": false, "md5_digest": "6018444101745ecc4ba9ae8088ce76a1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 92053, "upload_time": "2020-04-02T12:55:47", "upload_time_iso_8601": "2020-04-02T12:55:47.618475Z", "url": "https://files.pythonhosted.org/packages/1d/6a/3d98c45cb65c4faca8cfb4791cfa42f05d387ca256bd6ecf537698cd0010/complexconstructor-0.1.6.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:44:14 2020"}