{"info": {"author": "Nick K", "author_email": "ynkodizzy@gmail.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# Cond - Numeric data type  \n\n**Cond** is a custom numeric data type for Python 3. It supports most operations that are legal on a regular data type, while adding some new properties. It can be installed using `pip3 install cond`.  \n\n***The idea***  \n\nThe basic idea of a Cond object, is that it can hold various options at once, but only represent one of them. That option is called the main option.  \n\n***Importing***  \n\nThe module is called cond, so it can be imported using `import cond`. The only three, public members of the module that are available are `Cond`, which is the class that is used to instantiate objects, `LinkedCond`, which is a modified version of the `Cond` class, and `require`, which is the function used to set \"limitations\" for Cond objects. Some other functions will also be imported, but these are implementation functions (indicated with a trailing underscore). All the following code assumes that the line `from cond import Cond, LinkedCond, require` has been called.  \n\n***Initializing***\n* Arguments  \n\n\tTo initialize a Cond object, simply use the syntax `x = Cond(*args)`. In this case, `args` is a list that contains an arbitrary amount of elements, all of the same numeric, built-in data type (e.g. integer). Of course, the arguments can also be passed as numeric literals, `x = Cond(1, 5, 10)`. Whenever a Cond object is created in this manner, the main option of the object, which essentially represents it, will always be chosen to be the first passed argument, unless otherwise specified. At least one argument must be passed when a Cond object is created, unless the `range` keyword is included (discussed below). Cond objects do not accept duplicate arguments.\n* Keyword arguments  \n\n\tThere are currently two optional keyword arguments that can be used for the initialization of a Cond object. These are `mainpos` and `range`. The former is used to specify the index of the main option of the object. For example, `x = Cond(1, 5, 10, mainpos = 1)` will initialize a Cond object with the options 1, 5 and 10, but the option that initially represents the object will be the second one (5). The latter is used to specify a range, which the Cond object will use to generate options. The `range` keyword argument has to either be a single positive integer (in which case all the numbers from 0 to it will be included), or a tuple, where the first argument specifies the start, the second argument specifies the end, and the (optional) third argument specifies the step. If this keyword argument is included, it is optional to also include arguments.  \n\n***Basic Operations***  \n\nA Cond object will operate just like the numeric type that it represents in basic operations. The value that will be used for any actual operation will be the main value of the object. For instance:\n```Python\nx = Cond(5, 17)\ny = x + 3\nprint(y)\n```\nOUTPUT:\n```\n8\n```\nThe reason the above output is 8 for this, is that the main option of x is 5 (because it was passed first, and no `mainpos` was specified), so that value will be used for any operations. If, in the above code, the line where the Cond object is initialized was replaced with `x = Cond(17, 5)`, or even, `x = Cond(5, 17, mainpos = 1)`, the resulting value of y would be 20, because in both cases the main option of x would be 17. This works similarly for all other operations, including subtraction, multiplication, division, exponentiation, bitwise operations, etc.  \n\n***Basic Evaluation***\nJust like in basic operations, a Cond object will also act in the same way as the numeric type that it represents in evaluation statements. For example:\n```Python\nx = Cond(11.5, 20.3)\ny = 11.5\nz = 20.3\nprint(x == y)\nprint(x == z)\n```\nOUTPUT:\n```\nTrue\nFalse\n```\nAs expected, the above code yields `True` and `False`. This is because, as stated before, x here is represented by the float 11.5, whereas 20.3 is just an option. So when x is evaluated to be equal to y, which is also 11.5, that yields 1, whereas when it is evaluated to be equal to z, which is 20.3, that yields 0.  \n\n***Incrementing & Decrementing***  \n\nA Cond object also has the ability to be incremented, decremented, or have any other syntax of the type `[operation_sign]=` be used on it. For example, dividing a Cond object's main option by 2 can be done using `x /= 2`, or for an integer, `x >>= 1`. Note that the former will only work if the options of x are of type float. If they are not, and in general, whenever an operation attempts  to change the main option of a Cond object to a different type, `TypeChangeError` is thrown. The latter is a right shift by 1 bit and therefore, equivalent to `x //= 2`, for an integer number. Here, it is also important to note that, while for a regular number, `x += 1` is completely equivalent to `x = x + 1`, for a Cond object, these are two completely different statements. In fact, the latter should be used with caution. The reason for this, is that stating `x += 1`, is essentially saying \"increment the main option of x by 1\", whereas stating `x = x + 1` is saying \"take 1, add it to the main value of the Cond object x and store the result in x\". However, since the resulting value (x + 1) will be a numeric type, by default, x will also be set to be a numeric type. Therefore, the Cond object x will be overwritten by an integer, which will use the name, x, after the statement, and will have the final value that the Cond object would have had. This is demonstrated by this example:\n```Python\nx = Cond(5)\nx += 1\nprint(x, type(x))\nx = x + 1\nprint(x, type(x))\n```\nOUTPUT:\n```\n6 <class 'cond.Cond'>\n7 <class 'int'>\n```  \n\n***Iterable Properties***  \n\nA Cond object, even though it is represented by one main option, can hold many options at one time. This allows it to have properties that are usually found in iterables, such as lists and tuples. Firstly, calling `len(x)` will return the amount of options that the Cond object currently holds. Using bracket syntax, it is possible to view the option at a specific index; in addition to that, assigning and deleting options is possible, unless the given index corresponds to the main option. A Cond object can be used just like any other iterable in a for loop, looping through its options. The `in` syntax can also be used to check whether a given value is inside the list of options of the Cond object. Adding a new option to a Cond object can be achieved by using the `x.append(value)` syntax, just like one would use in a list. Similarly, `x.remove(value)` and `x.index(value)` are also valid expressions. Finally, calling `x.all()` will return a list of all the options that x currently holds. The below code snippet demonstrates the usage of all of these properties.\n```Python\nx = Cond(-8, 14, 3)\nprint(\"x length: \", len(x))\nprint(\"Third option: \", x[2])\nx[2] = -x[2]\nprint(\"Third option: \", x[2])\ndel x[2]\n\nprint(\"All x options using for loop:\")\nfor option in x:\n\tprint(option)\n\nprint(5 in x)\n\nx.append(5)\nx.remove(14)\nprint(\"Index of 5 in x: \", x.index(5))\n\nprint(\"All x options: \", x.all())\nprint(\"Main x option: \", x)\n```\nOUTPUT:\n```\nx length: 3\nThird option: 3\nThird option: -3\nAll x options using for loop:\n-8\n14\nFalse\nIndex of 5 in x: 1\nAll x options: [-8, 5]\nMain x option: -8\n```  \n\n***LinkedCond objects***  \n\nLinkedCond objects can be instantiated just like Cond objects. The only difference between them and Cond objects, is that they have a \"history\"; in other words, they \"remember\" the limitations that are applied on them. An implication of this, is that they can be linked to each other; this is why they are called LinkedCond objects. LinkedCond objects, and their differences with Cond objects, are discussed later.  \n\n***The require function***  \n\n* Cond objects\n\n\tAs mentioned above, the require function is the function which applies \"limitations\" to Cond objects and changes their main options, based on those limitations. In reality, the require function does nothing more than brute-forcing solutions until it potentially gets a correct one. More specifically, the syntax is: `require(expression, cond_objects, eval_sign, eval_number)`. Following is the explanation for each of these arguments.\n\t* expression: the expression is actually a string representation of an algebraic expression. In essence, it is the \"left part\" of the equation. Each Cond object that is part of the expression must be represented with a single-digit letter. Just as in regular Python, addition is represented by the \"+\" symbol, subtraction by the \"-\" symbol, multiplication by the \"\\*\" symbol, division by the \"\\\\\" symbol and modulo by the \"%\" symbol. Contrary to how it works in regular Python, exponentiation is represented by the \"^\" symbol (though \"\\*\\*\" can also be used). In addition to this, the multiplication symbol can be skipped in cases where algebra allows it (between single-letter variables, numbers or variables followed by parenthesis, numbers followed by variables, etc).\n\t* cond_objects: this argument can either be a single Cond object, or a tuple containing multiple of them. However, the amount of Cond objects passed through this argument must be exactly equal to the amount of variables that the expression contains. The correspondence between variables and Cond objects is 1-1, meaning the first variable is paired with the first object, the second with the second, and so on. This means that, if the expression was `\"x - y\"` and the tuple was `(y, x)`, the actual operation that the function would attempt to satisfy would be `y - x` and not `x - y`, because the object y was written first, so it corresponds to the first available variable, x. In essence, variable names inside the expression are no more than conventions -they don't represent any actual variable names.\n\t* eval_sign: this argument is a string of the evaluation sign. This can be either one of: \"=\", \">\", \">=\", \"<\", \"<=\", \"!=\".\n\t* eval_number: this argument is a numeric value, representing the \"right side\" of the equation. This can be any built-in numeric value, or it can be of type Cond. However, note that if type Cond is used, it will not be edited in any way. It will simply be used for its value and not take part in the actual expression. An expression cannot be used for this argument, therefore any equation should be solved so that there is only a single numeric value on the right side of it before using the function. This argument can also be a tuple of multiple numeric types, but only if the eval_sign argument is \"!=\".\n\tThe full equation can be recreated by substituting the variable names with the Cond object names, with the correct correlation and then appending the sign and the evaluation number at the end.\n\tThe require function will return `True` if any combination of existing options for each included Cond object is found, which satisfies the given equation and will change the main value of the object to that which was found. If no combination of values that satisfy the equation are found, `False` is returned and no changes are made onto the Cond objects.\n\tFollowing are some examples of the require function's use.\n\t```Python\n\tx = Cond(1, 5, 10, 25)\n\tres = require(\"x\", x, \">\", 5)\n\tprint(res)\n\tprint(x)\n\t```\n\tOUTPUT:\n\t```\n\tTrue\n\t10\n\t```\n\tIn this example, it is essentially requested that x be greater than 5. The function searched through the values, found that the value 10, which is the third option of the object, is greater than 5 and set that option to be the main option of the object. Because it was successful in satisfying the equation, it returned `True`.\n\t```Python\n\tx = Cond(-5, 10, 102, 54)\n\ty = Cond(4, 12, 66)\n\tz = Cond(3, 0, -1)\n\tres = require(r\"xy/(2z) + 15%x - 3y\", (x, y, z), \"=\", 8)\n\tprint(res)\n\tprint(x, y, z)\n\t```\n\tOUTPUT:\n\t```\n\tFalse\n\t-5 4 3\n\t```\n\tIn this example, no combination is found that satisfies the expression. Therefore, the function returned `False` and the Cond objects passed kept their initial main options.\n\t*Note: raw string was used instead of skipping the `%` character.*\n\t```Python\n\tres = require(r\"15a - a^2  - b\", (x, y), \">\", 1)\n\tprint(res)\n\tprint(x, y)\n\t```\n\tOUTPUT:\n\t```\n\tTrue\n\t10 4\n\t```\n\t(`x`, `y` used from Example 2): In this example, notice that x is not passed twice. Even though the variable a appears twice before the variable b, once the object x is mapped to the variable a, whenever a is found again, it is dismissed. Therefore, it is safe to pass y afterwards, so it is mapped to b, without worrying about passing x twice.\n\t*Note: passing x twice would actually cause an error.*  \n\n* LinkedCond objects\n\n\tThe require function can take LinkedCond objects instead of Cond objects as arguments. However, note that both LinkedCond and Cond objects cannot be passed as arguments in a single require call. This is explained further later on. The syntax for the require function, when it is run with LinkedCond objects, is exactly the same as that for when it is run with Cond objects. For example:\n\t```Python\n\ta = LinkedCond(1, 2, 3)\n\tres = require(\"x\", a, \">\", 2)\n\tprint(res)\n\tprint(a)\n\t```\n\tOUTPUT:\n\t```\n\tTrue\n\t3\n\t```\n\tHere, the LinkedCond object will act exactly like a Cond object. However, consider that the following code was run after the above code:\n\t```Python\n\tres = require(\"x\", a, \"<\", 2)\n\tprint(res)\n\tprint(a)\n\t```\n\tOUTPUT:\n\t```\n\tFalse\n\t3\n\t```\n\tIf we had initially made `a` be an instance of the Cond class, the above code would have printed out `True` and `1`. For LinkedCond objects, this is not the case; because a LinkedCond object will remember previous require calls onto it, it is impossible to have `a` be smaller than 2, when `a` must already be greater than `2`. In other words, after the first require call, `a` cannot ever be smaller than or equal to 2. Since that is what we request with the second require call, `False` will be returned.\n\tMultiple LinkedCond objects can also be passed to a single require call. This will, in a way, link them. What this actually means, is that the main option of each of these objects will not only depend on require calls onto them, but also on require calls onto the objects that they are linked with. A big difference between Cond and LinkedCond objects, is that a Cond object can never have its main option altered, unless it is directly passed to require, using the `cond_objects` argument; this is untrue for LinkedCond objects. It is possible for their main option to change *indirectly*. This would have to occur via a require call, to which a LinkedCond object, that is linked to them, is passed. An example of this follows.\n\t```Python\n\ta = LinkedCond(range = 10)\n\tb = LinkedCond(range = 10)\n\tres = require(\"xy\", (a, b), \"=\", 24) #a*b = 24\n\tprint(res)\n\tprint(a, b)\n\tres = require(\"x\", b, \"<\", 6)\n\tprint(res)\n\tprint(a, b)\n\t```\n\tOUTPUT:\n\t```\n\tTrue\n\t3 8\n\tTrue\n\t8 3\n\t```\n\tIn the above example, notice that even though the second require call only contained `b` in the passed objects, `a` was also altered. This is the reason why `b` is considered linked to `a`: it can be indirectly affected. When a require call attempts to change `a`, it will also attempt to change `b` so that the new limitation for `a` is satisfied, whereas the previous limitations, which included `b`, are also satisfied.\n\tConsider a situation where we wanted, just like before, the product of `a` and `b` to be 24, however we also needed `a` to be greater than `b`. As shown, `a` is not greater than `b` when the initial require call, for the product, is made. Even though it *could* be, if we really wanted to ensure that it is, we could do the following:\n\n\t```Python\n\ta = LinkedCond(range = 10)\n\tb = LinkedCond(range = 10)\n\tres = require(\"xy\", (a, b), \"=\", 24) #a*b = 24\n\tprint(res)\n\tprint(a, b)\n\tres = require(\"x - y\", (a, b), \">\", 0) #x-y > 0 => x > y\n\tprint(res)\n\tprint(a, b)\n\t```\n\tOUTPUT:\n\t```\n\tTrue\n\t3 8\n\tTrue\n\t8 3\n\t```\n\tHere, just like before, it is first requested that the product of the two LinkedCond objects be equal to 24. Since the options for both objects are the digits, it is found that, if `a` becomes 3 and `b` becomes 8, the product will be 24. The second require call makes sure that the difference of `a` with `b` is greater than 0. This is the correct way to require that `a` be greater than `b`. If that require call was replaced with `require(\"x\", a, \">\", b)`, it would return `False`. This is because, as stated before, object `b` was passed as a final argument, meaning it is the evaluation number. For this reason, it will only be used for its value and will not take part in the expression. The function will attempt to make `a` greater than the value of `b`, which is 8. In other words, it will attempt to make `a` be 9; this won't work, since it must also be true that the product of `a` with `b` is 24, which is impossible for `a = 9`, no matter what the main option `b` is. Nevertheless, when the require call is written as it was in the code snippet, it makes sure that both the values of `a` and `b` can be re-evaluated, so matching values can be found. The second solution, `a = 8` and `b = 3` satisfies both equations; the function might also, in this case, pick the values `a = 6` and `b = 4`. This would also be correct in this case.  \n\n***Additional LinkedCond properties***  \n\nLinkedCond objects share all their methods with Cond objects, except for two extra ones:\n* The first new method is `getlims()`. This method will return a set, containing all the limitations that currently apply for the object. As for the names that will be used in place of the single-letter variables, it will be attempted to replicate the variable names that have been used. For example:\n\t```Python\n\tobj = LinkedCond(range = 20)\n\trequire(\"x\", obj, \">\", 11)\n\tprint(obj.getlims())\n\t```\n\tOUTPUT:\n\t```\n\t{\"obj > 11\"}\n\t```\n\tIn place of `x`, `obj`, which is the variable name of the object, was used. This is done so that it is easier to see which objects the limitation is really referring to. Nevertheless, above, it was stated that it will be *attempted* to replicate the variable names. This is because, in some cases, it will be impossible to replicate those names. Consider the following:\n\t```Python\n\tdef func():\n\t\tobj = LinkedCond(range = 20)\n\t\trequire(\"x\", obj, \">\", 11)\n\t\treturn [obj]\n\tobj_list = func()\n\tprint(obj_list[0].getlims())\n\tfor v in obj_list:\n\t\tprint(v.getlims())\n\t```\n\tOUTPUT:\n\t```\n\t{\"obj_list[0] > 11\"}\n\t{\"v > 11\"}\n\t```\n\tHere, after the function `func` quits, all the variables declared in its scope are destroyed; it is impossible to get the variable name `obj` after that. However, since the object is saved inside of the list named `obj_list`, when using the `getlims` method on it, the name of the list that contains it followed by brackets and the index will be used instead. When iterating through the list, the name of the temporary variable will be used.\n\tThe only case in which the single-letter variable names will be used, is when it is impossible to find variable names for all the included objects. For example, consider the following:\n\t```Python\n\tdef func():\n\t\tobj = LinkedCond(range = 10)\n\t\tobj2 = LinkedCond(range = 20)\n\t\trequire(\"xy\", (obj, obj2), \">\", 10)\n\t\treturn {obj: \"Hello\", obj2: \"World\"}\n\tthedict = func()\n\tfor key in thedict:\n\t\tprint key.getlims()\n\t```\n\tOUTPUT:\n\t```\n\t{\"x*y > 10\"}\n\t{\"x*y > 10\"}\n\t```\n\tHere, the objects are used as dictionary keys (note: **almost never do this**). This means that *no* variable names, at all, exist for these objects. Because they are the dictionary keys, meaning that they are the ones used to refer to the dictionary values, there is no real way to refer to them. For this reason, the only thing that the `getlims` function can do is use the single-letter variables, passed when require was called, instead.\n\tThe reason using Cond or LinkedCond objects as dictionary keys should be avoided, is because the dictionary will represent the object by its main option. This means that if two objects have the same main option, there cannot be two dictionary entries for both of them; when it is attempted to set a new value for the second object, the first object and its value will be overwritten.\n* The second method is `clearlims()`. As would be expected, this method will clear all the limitations for a LinkedCond object. The only thing that needs to be noted here, is that `clearlims` will not only clear the limitations for the object it is called on, but also for linked objects, that link the object to them. Consider the example where the product of two LinkedCond objects is 24 and one of them is smaller than 6.\n\t```Python\n\ta = LinkedCond(range = 10)\n\tb = LinkedCond(range = 10)\n\trequire(\"ab\", (a, b), \"=\", 24)\n\trequire(\"b\", b, \"<\", 6)\n\tprint(b.getlims())\n\ta.clearlims()\n\tprint(b.getlims())\n\t```\n\tOUTPUT:\n\t```\n\t{'b < 6', 'a*b = 24'}\n\t{'b < 6'}\n\t```\n\tIn this case, when `clearlims` was called on `a`, the limitation `a*b = 24` was also removed from `b`. However, the limitation of `b` that didn't include `a`, `b < 6`, did not change.\n\n***Credit***  \n\nThe inspiration for this project was solely taken from a lightning talk by Jason Orendorff, [on Youtube.](https://www.youtube.com/watch?v=iOJD7nd7cyY)  \n\nHis github profile can be found [here](https://github.com/jorendorff).  \n\n[This description](https://wiki.c2.com/?QuantumBogoSort) on \"Quantum Bogosort\" also helped.\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/notTypecast/cond", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "cond", "package_url": "https://pypi.org/project/cond/", "platform": "", "project_url": "https://pypi.org/project/cond/", "project_urls": {"Homepage": "https://github.com/notTypecast/cond"}, "release_url": "https://pypi.org/project/cond/1.2.0/", "requires_dist": null, "requires_python": ">=3.6", "summary": "Custom numeric data type for Python 3 with some additional properties", "version": "1.2.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Cond - Numeric data type</h1>\n<p><strong>Cond</strong> is a custom numeric data type for Python 3. It supports most operations that are legal on a regular data type, while adding some new properties. It can be installed using <code>pip3 install cond</code>.</p>\n<p><em><strong>The idea</strong></em></p>\n<p>The basic idea of a Cond object, is that it can hold various options at once, but only represent one of them. That option is called the main option.</p>\n<p><em><strong>Importing</strong></em></p>\n<p>The module is called cond, so it can be imported using <code>import cond</code>. The only three, public members of the module that are available are <code>Cond</code>, which is the class that is used to instantiate objects, <code>LinkedCond</code>, which is a modified version of the <code>Cond</code> class, and <code>require</code>, which is the function used to set \"limitations\" for Cond objects. Some other functions will also be imported, but these are implementation functions (indicated with a trailing underscore). All the following code assumes that the line <code>from cond import Cond, LinkedCond, require</code> has been called.</p>\n<p><em><strong>Initializing</strong></em></p>\n<ul>\n<li>\n<p>Arguments</p>\n<p>To initialize a Cond object, simply use the syntax <code>x = Cond(*args)</code>. In this case, <code>args</code> is a list that contains an arbitrary amount of elements, all of the same numeric, built-in data type (e.g. integer). Of course, the arguments can also be passed as numeric literals, <code>x = Cond(1, 5, 10)</code>. Whenever a Cond object is created in this manner, the main option of the object, which essentially represents it, will always be chosen to be the first passed argument, unless otherwise specified. At least one argument must be passed when a Cond object is created, unless the <code>range</code> keyword is included (discussed below). Cond objects do not accept duplicate arguments.</p>\n</li>\n<li>\n<p>Keyword arguments</p>\n<p>There are currently two optional keyword arguments that can be used for the initialization of a Cond object. These are <code>mainpos</code> and <code>range</code>. The former is used to specify the index of the main option of the object. For example, <code>x = Cond(1, 5, 10, mainpos = 1)</code> will initialize a Cond object with the options 1, 5 and 10, but the option that initially represents the object will be the second one (5). The latter is used to specify a range, which the Cond object will use to generate options. The <code>range</code> keyword argument has to either be a single positive integer (in which case all the numbers from 0 to it will be included), or a tuple, where the first argument specifies the start, the second argument specifies the end, and the (optional) third argument specifies the step. If this keyword argument is included, it is optional to also include arguments.</p>\n</li>\n</ul>\n<p><em><strong>Basic Operations</strong></em></p>\n<p>A Cond object will operate just like the numeric type that it represents in basic operations. The value that will be used for any actual operation will be the main value of the object. For instance:</p>\n<pre><span class=\"n\">x</span> <span class=\"o\">=</span> <span class=\"n\">Cond</span><span class=\"p\">(</span><span class=\"mi\">5</span><span class=\"p\">,</span> <span class=\"mi\">17</span><span class=\"p\">)</span>\n<span class=\"n\">y</span> <span class=\"o\">=</span> <span class=\"n\">x</span> <span class=\"o\">+</span> <span class=\"mi\">3</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">y</span><span class=\"p\">)</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code>8\n</code></pre>\n<p>The reason the above output is 8 for this, is that the main option of x is 5 (because it was passed first, and no <code>mainpos</code> was specified), so that value will be used for any operations. If, in the above code, the line where the Cond object is initialized was replaced with <code>x = Cond(17, 5)</code>, or even, <code>x = Cond(5, 17, mainpos = 1)</code>, the resulting value of y would be 20, because in both cases the main option of x would be 17. This works similarly for all other operations, including subtraction, multiplication, division, exponentiation, bitwise operations, etc.</p>\n<p><em><strong>Basic Evaluation</strong></em>\nJust like in basic operations, a Cond object will also act in the same way as the numeric type that it represents in evaluation statements. For example:</p>\n<pre><span class=\"n\">x</span> <span class=\"o\">=</span> <span class=\"n\">Cond</span><span class=\"p\">(</span><span class=\"mf\">11.5</span><span class=\"p\">,</span> <span class=\"mf\">20.3</span><span class=\"p\">)</span>\n<span class=\"n\">y</span> <span class=\"o\">=</span> <span class=\"mf\">11.5</span>\n<span class=\"n\">z</span> <span class=\"o\">=</span> <span class=\"mf\">20.3</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">x</span> <span class=\"o\">==</span> <span class=\"n\">y</span><span class=\"p\">)</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">x</span> <span class=\"o\">==</span> <span class=\"n\">z</span><span class=\"p\">)</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code>True\nFalse\n</code></pre>\n<p>As expected, the above code yields <code>True</code> and <code>False</code>. This is because, as stated before, x here is represented by the float 11.5, whereas 20.3 is just an option. So when x is evaluated to be equal to y, which is also 11.5, that yields 1, whereas when it is evaluated to be equal to z, which is 20.3, that yields 0.</p>\n<p><em><strong>Incrementing &amp; Decrementing</strong></em></p>\n<p>A Cond object also has the ability to be incremented, decremented, or have any other syntax of the type <code>[operation_sign]=</code> be used on it. For example, dividing a Cond object's main option by 2 can be done using <code>x /= 2</code>, or for an integer, <code>x &gt;&gt;= 1</code>. Note that the former will only work if the options of x are of type float. If they are not, and in general, whenever an operation attempts  to change the main option of a Cond object to a different type, <code>TypeChangeError</code> is thrown. The latter is a right shift by 1 bit and therefore, equivalent to <code>x //= 2</code>, for an integer number. Here, it is also important to note that, while for a regular number, <code>x += 1</code> is completely equivalent to <code>x = x + 1</code>, for a Cond object, these are two completely different statements. In fact, the latter should be used with caution. The reason for this, is that stating <code>x += 1</code>, is essentially saying \"increment the main option of x by 1\", whereas stating <code>x = x + 1</code> is saying \"take 1, add it to the main value of the Cond object x and store the result in x\". However, since the resulting value (x + 1) will be a numeric type, by default, x will also be set to be a numeric type. Therefore, the Cond object x will be overwritten by an integer, which will use the name, x, after the statement, and will have the final value that the Cond object would have had. This is demonstrated by this example:</p>\n<pre><span class=\"n\">x</span> <span class=\"o\">=</span> <span class=\"n\">Cond</span><span class=\"p\">(</span><span class=\"mi\">5</span><span class=\"p\">)</span>\n<span class=\"n\">x</span> <span class=\"o\">+=</span> <span class=\"mi\">1</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">,</span> <span class=\"nb\">type</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">))</span>\n<span class=\"n\">x</span> <span class=\"o\">=</span> <span class=\"n\">x</span> <span class=\"o\">+</span> <span class=\"mi\">1</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">,</span> <span class=\"nb\">type</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">))</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code>6 &lt;class 'cond.Cond'&gt;\n7 &lt;class 'int'&gt;\n</code></pre>\n<p><em><strong>Iterable Properties</strong></em></p>\n<p>A Cond object, even though it is represented by one main option, can hold many options at one time. This allows it to have properties that are usually found in iterables, such as lists and tuples. Firstly, calling <code>len(x)</code> will return the amount of options that the Cond object currently holds. Using bracket syntax, it is possible to view the option at a specific index; in addition to that, assigning and deleting options is possible, unless the given index corresponds to the main option. A Cond object can be used just like any other iterable in a for loop, looping through its options. The <code>in</code> syntax can also be used to check whether a given value is inside the list of options of the Cond object. Adding a new option to a Cond object can be achieved by using the <code>x.append(value)</code> syntax, just like one would use in a list. Similarly, <code>x.remove(value)</code> and <code>x.index(value)</code> are also valid expressions. Finally, calling <code>x.all()</code> will return a list of all the options that x currently holds. The below code snippet demonstrates the usage of all of these properties.</p>\n<pre><span class=\"n\">x</span> <span class=\"o\">=</span> <span class=\"n\">Cond</span><span class=\"p\">(</span><span class=\"o\">-</span><span class=\"mi\">8</span><span class=\"p\">,</span> <span class=\"mi\">14</span><span class=\"p\">,</span> <span class=\"mi\">3</span><span class=\"p\">)</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"s2\">\"x length: \"</span><span class=\"p\">,</span> <span class=\"nb\">len</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">))</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"s2\">\"Third option: \"</span><span class=\"p\">,</span> <span class=\"n\">x</span><span class=\"p\">[</span><span class=\"mi\">2</span><span class=\"p\">])</span>\n<span class=\"n\">x</span><span class=\"p\">[</span><span class=\"mi\">2</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"o\">-</span><span class=\"n\">x</span><span class=\"p\">[</span><span class=\"mi\">2</span><span class=\"p\">]</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"s2\">\"Third option: \"</span><span class=\"p\">,</span> <span class=\"n\">x</span><span class=\"p\">[</span><span class=\"mi\">2</span><span class=\"p\">])</span>\n<span class=\"k\">del</span> <span class=\"n\">x</span><span class=\"p\">[</span><span class=\"mi\">2</span><span class=\"p\">]</span>\n\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"s2\">\"All x options using for loop:\"</span><span class=\"p\">)</span>\n<span class=\"k\">for</span> <span class=\"n\">option</span> <span class=\"ow\">in</span> <span class=\"n\">x</span><span class=\"p\">:</span>\n\t<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">option</span><span class=\"p\">)</span>\n\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"mi\">5</span> <span class=\"ow\">in</span> <span class=\"n\">x</span><span class=\"p\">)</span>\n\n<span class=\"n\">x</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"mi\">5</span><span class=\"p\">)</span>\n<span class=\"n\">x</span><span class=\"o\">.</span><span class=\"n\">remove</span><span class=\"p\">(</span><span class=\"mi\">14</span><span class=\"p\">)</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"s2\">\"Index of 5 in x: \"</span><span class=\"p\">,</span> <span class=\"n\">x</span><span class=\"o\">.</span><span class=\"n\">index</span><span class=\"p\">(</span><span class=\"mi\">5</span><span class=\"p\">))</span>\n\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"s2\">\"All x options: \"</span><span class=\"p\">,</span> <span class=\"n\">x</span><span class=\"o\">.</span><span class=\"n\">all</span><span class=\"p\">())</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"s2\">\"Main x option: \"</span><span class=\"p\">,</span> <span class=\"n\">x</span><span class=\"p\">)</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code>x length: 3\nThird option: 3\nThird option: -3\nAll x options using for loop:\n-8\n14\nFalse\nIndex of 5 in x: 1\nAll x options: [-8, 5]\nMain x option: -8\n</code></pre>\n<p><em><strong>LinkedCond objects</strong></em></p>\n<p>LinkedCond objects can be instantiated just like Cond objects. The only difference between them and Cond objects, is that they have a \"history\"; in other words, they \"remember\" the limitations that are applied on them. An implication of this, is that they can be linked to each other; this is why they are called LinkedCond objects. LinkedCond objects, and their differences with Cond objects, are discussed later.</p>\n<p><em><strong>The require function</strong></em></p>\n<ul>\n<li>\n<p>Cond objects</p>\n<p>As mentioned above, the require function is the function which applies \"limitations\" to Cond objects and changes their main options, based on those limitations. In reality, the require function does nothing more than brute-forcing solutions until it potentially gets a correct one. More specifically, the syntax is: <code>require(expression, cond_objects, eval_sign, eval_number)</code>. Following is the explanation for each of these arguments.</p>\n<ul>\n<li>expression: the expression is actually a string representation of an algebraic expression. In essence, it is the \"left part\" of the equation. Each Cond object that is part of the expression must be represented with a single-digit letter. Just as in regular Python, addition is represented by the \"+\" symbol, subtraction by the \"-\" symbol, multiplication by the \"*\" symbol, division by the \"\\\" symbol and modulo by the \"%\" symbol. Contrary to how it works in regular Python, exponentiation is represented by the \"^\" symbol (though \"**\" can also be used). In addition to this, the multiplication symbol can be skipped in cases where algebra allows it (between single-letter variables, numbers or variables followed by parenthesis, numbers followed by variables, etc).</li>\n<li>cond_objects: this argument can either be a single Cond object, or a tuple containing multiple of them. However, the amount of Cond objects passed through this argument must be exactly equal to the amount of variables that the expression contains. The correspondence between variables and Cond objects is 1-1, meaning the first variable is paired with the first object, the second with the second, and so on. This means that, if the expression was <code>\"x - y\"</code> and the tuple was <code>(y, x)</code>, the actual operation that the function would attempt to satisfy would be <code>y - x</code> and not <code>x - y</code>, because the object y was written first, so it corresponds to the first available variable, x. In essence, variable names inside the expression are no more than conventions -they don't represent any actual variable names.</li>\n<li>eval_sign: this argument is a string of the evaluation sign. This can be either one of: \"=\", \"&gt;\", \"&gt;=\", \"&lt;\", \"&lt;=\", \"!=\".</li>\n<li>eval_number: this argument is a numeric value, representing the \"right side\" of the equation. This can be any built-in numeric value, or it can be of type Cond. However, note that if type Cond is used, it will not be edited in any way. It will simply be used for its value and not take part in the actual expression. An expression cannot be used for this argument, therefore any equation should be solved so that there is only a single numeric value on the right side of it before using the function. This argument can also be a tuple of multiple numeric types, but only if the eval_sign argument is \"!=\".\nThe full equation can be recreated by substituting the variable names with the Cond object names, with the correct correlation and then appending the sign and the evaluation number at the end.\nThe require function will return <code>True</code> if any combination of existing options for each included Cond object is found, which satisfies the given equation and will change the main value of the object to that which was found. If no combination of values that satisfy the equation are found, <code>False</code> is returned and no changes are made onto the Cond objects.\nFollowing are some examples of the require function's use.</li>\n</ul>\n<pre> <span class=\"n\">x</span> <span class=\"o\">=</span> <span class=\"n\">Cond</span><span class=\"p\">(</span><span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"mi\">5</span><span class=\"p\">,</span> <span class=\"mi\">10</span><span class=\"p\">,</span> <span class=\"mi\">25</span><span class=\"p\">)</span>\n <span class=\"n\">res</span> <span class=\"o\">=</span> <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"x\"</span><span class=\"p\">,</span> <span class=\"n\">x</span><span class=\"p\">,</span> <span class=\"s2\">\"&gt;\"</span><span class=\"p\">,</span> <span class=\"mi\">5</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">res</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">)</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code> True\n 10\n</code></pre>\n<p>In this example, it is essentially requested that x be greater than 5. The function searched through the values, found that the value 10, which is the third option of the object, is greater than 5 and set that option to be the main option of the object. Because it was successful in satisfying the equation, it returned <code>True</code>.</p>\n<pre> <span class=\"n\">x</span> <span class=\"o\">=</span> <span class=\"n\">Cond</span><span class=\"p\">(</span><span class=\"o\">-</span><span class=\"mi\">5</span><span class=\"p\">,</span> <span class=\"mi\">10</span><span class=\"p\">,</span> <span class=\"mi\">102</span><span class=\"p\">,</span> <span class=\"mi\">54</span><span class=\"p\">)</span>\n <span class=\"n\">y</span> <span class=\"o\">=</span> <span class=\"n\">Cond</span><span class=\"p\">(</span><span class=\"mi\">4</span><span class=\"p\">,</span> <span class=\"mi\">12</span><span class=\"p\">,</span> <span class=\"mi\">66</span><span class=\"p\">)</span>\n <span class=\"n\">z</span> <span class=\"o\">=</span> <span class=\"n\">Cond</span><span class=\"p\">(</span><span class=\"mi\">3</span><span class=\"p\">,</span> <span class=\"mi\">0</span><span class=\"p\">,</span> <span class=\"o\">-</span><span class=\"mi\">1</span><span class=\"p\">)</span>\n <span class=\"n\">res</span> <span class=\"o\">=</span> <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"sa\">r</span><span class=\"s2\">\"xy/(2z) + 15</span><span class=\"si\">%x</span><span class=\"s2\"> - 3y\"</span><span class=\"p\">,</span> <span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">,</span> <span class=\"n\">y</span><span class=\"p\">,</span> <span class=\"n\">z</span><span class=\"p\">),</span> <span class=\"s2\">\"=\"</span><span class=\"p\">,</span> <span class=\"mi\">8</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">res</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">,</span> <span class=\"n\">y</span><span class=\"p\">,</span> <span class=\"n\">z</span><span class=\"p\">)</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code> False\n -5 4 3\n</code></pre>\n<p>In this example, no combination is found that satisfies the expression. Therefore, the function returned <code>False</code> and the Cond objects passed kept their initial main options.\n<em>Note: raw string was used instead of skipping the <code>%</code> character.</em></p>\n<pre> <span class=\"n\">res</span> <span class=\"o\">=</span> <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"sa\">r</span><span class=\"s2\">\"15a - a^2  - b\"</span><span class=\"p\">,</span> <span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">,</span> <span class=\"n\">y</span><span class=\"p\">),</span> <span class=\"s2\">\"&gt;\"</span><span class=\"p\">,</span> <span class=\"mi\">1</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">res</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">x</span><span class=\"p\">,</span> <span class=\"n\">y</span><span class=\"p\">)</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code> True\n 10 4\n</code></pre>\n<p>(<code>x</code>, <code>y</code> used from Example 2): In this example, notice that x is not passed twice. Even though the variable a appears twice before the variable b, once the object x is mapped to the variable a, whenever a is found again, it is dismissed. Therefore, it is safe to pass y afterwards, so it is mapped to b, without worrying about passing x twice.\n<em>Note: passing x twice would actually cause an error.</em></p>\n</li>\n<li>\n<p>LinkedCond objects</p>\n<p>The require function can take LinkedCond objects instead of Cond objects as arguments. However, note that both LinkedCond and Cond objects cannot be passed as arguments in a single require call. This is explained further later on. The syntax for the require function, when it is run with LinkedCond objects, is exactly the same as that for when it is run with Cond objects. For example:</p>\n<pre> <span class=\"n\">a</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"mi\">2</span><span class=\"p\">,</span> <span class=\"mi\">3</span><span class=\"p\">)</span>\n <span class=\"n\">res</span> <span class=\"o\">=</span> <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"x\"</span><span class=\"p\">,</span> <span class=\"n\">a</span><span class=\"p\">,</span> <span class=\"s2\">\"&gt;\"</span><span class=\"p\">,</span> <span class=\"mi\">2</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">res</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">)</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code> True\n 3\n</code></pre>\n<p>Here, the LinkedCond object will act exactly like a Cond object. However, consider that the following code was run after the above code:</p>\n<pre> <span class=\"n\">res</span> <span class=\"o\">=</span> <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"x\"</span><span class=\"p\">,</span> <span class=\"n\">a</span><span class=\"p\">,</span> <span class=\"s2\">\"&lt;\"</span><span class=\"p\">,</span> <span class=\"mi\">2</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">res</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">)</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code> False\n 3\n</code></pre>\n<p>If we had initially made <code>a</code> be an instance of the Cond class, the above code would have printed out <code>True</code> and <code>1</code>. For LinkedCond objects, this is not the case; because a LinkedCond object will remember previous require calls onto it, it is impossible to have <code>a</code> be smaller than 2, when <code>a</code> must already be greater than <code>2</code>. In other words, after the first require call, <code>a</code> cannot ever be smaller than or equal to 2. Since that is what we request with the second require call, <code>False</code> will be returned.\nMultiple LinkedCond objects can also be passed to a single require call. This will, in a way, link them. What this actually means, is that the main option of each of these objects will not only depend on require calls onto them, but also on require calls onto the objects that they are linked with. A big difference between Cond and LinkedCond objects, is that a Cond object can never have its main option altered, unless it is directly passed to require, using the <code>cond_objects</code> argument; this is untrue for LinkedCond objects. It is possible for their main option to change <em>indirectly</em>. This would have to occur via a require call, to which a LinkedCond object, that is linked to them, is passed. An example of this follows.</p>\n<pre> <span class=\"n\">a</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"nb\">range</span> <span class=\"o\">=</span> <span class=\"mi\">10</span><span class=\"p\">)</span>\n <span class=\"n\">b</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"nb\">range</span> <span class=\"o\">=</span> <span class=\"mi\">10</span><span class=\"p\">)</span>\n <span class=\"n\">res</span> <span class=\"o\">=</span> <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"xy\"</span><span class=\"p\">,</span> <span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">),</span> <span class=\"s2\">\"=\"</span><span class=\"p\">,</span> <span class=\"mi\">24</span><span class=\"p\">)</span> <span class=\"c1\">#a*b = 24</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">res</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">)</span>\n <span class=\"n\">res</span> <span class=\"o\">=</span> <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"x\"</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">,</span> <span class=\"s2\">\"&lt;\"</span><span class=\"p\">,</span> <span class=\"mi\">6</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">res</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">)</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code> True\n 3 8\n True\n 8 3\n</code></pre>\n<p>In the above example, notice that even though the second require call only contained <code>b</code> in the passed objects, <code>a</code> was also altered. This is the reason why <code>b</code> is considered linked to <code>a</code>: it can be indirectly affected. When a require call attempts to change <code>a</code>, it will also attempt to change <code>b</code> so that the new limitation for <code>a</code> is satisfied, whereas the previous limitations, which included <code>b</code>, are also satisfied.\nConsider a situation where we wanted, just like before, the product of <code>a</code> and <code>b</code> to be 24, however we also needed <code>a</code> to be greater than <code>b</code>. As shown, <code>a</code> is not greater than <code>b</code> when the initial require call, for the product, is made. Even though it <em>could</em> be, if we really wanted to ensure that it is, we could do the following:</p>\n<pre> <span class=\"n\">a</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"nb\">range</span> <span class=\"o\">=</span> <span class=\"mi\">10</span><span class=\"p\">)</span>\n <span class=\"n\">b</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"nb\">range</span> <span class=\"o\">=</span> <span class=\"mi\">10</span><span class=\"p\">)</span>\n <span class=\"n\">res</span> <span class=\"o\">=</span> <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"xy\"</span><span class=\"p\">,</span> <span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">),</span> <span class=\"s2\">\"=\"</span><span class=\"p\">,</span> <span class=\"mi\">24</span><span class=\"p\">)</span> <span class=\"c1\">#a*b = 24</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">res</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">)</span>\n <span class=\"n\">res</span> <span class=\"o\">=</span> <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"x - y\"</span><span class=\"p\">,</span> <span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">),</span> <span class=\"s2\">\"&gt;\"</span><span class=\"p\">,</span> <span class=\"mi\">0</span><span class=\"p\">)</span> <span class=\"c1\">#x-y &gt; 0 =&gt; x &gt; y</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">res</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">)</span>\n</pre>\n<p>OUTPUT:</p>\n<pre><code> True\n 3 8\n True\n 8 3\n</code></pre>\n<p>Here, just like before, it is first requested that the product of the two LinkedCond objects be equal to 24. Since the options for both objects are the digits, it is found that, if <code>a</code> becomes 3 and <code>b</code> becomes 8, the product will be 24. The second require call makes sure that the difference of <code>a</code> with <code>b</code> is greater than 0. This is the correct way to require that <code>a</code> be greater than <code>b</code>. If that require call was replaced with <code>require(\"x\", a, \"&gt;\", b)</code>, it would return <code>False</code>. This is because, as stated before, object <code>b</code> was passed as a final argument, meaning it is the evaluation number. For this reason, it will only be used for its value and will not take part in the expression. The function will attempt to make <code>a</code> greater than the value of <code>b</code>, which is 8. In other words, it will attempt to make <code>a</code> be 9; this won't work, since it must also be true that the product of <code>a</code> with <code>b</code> is 24, which is impossible for <code>a = 9</code>, no matter what the main option <code>b</code> is. Nevertheless, when the require call is written as it was in the code snippet, it makes sure that both the values of <code>a</code> and <code>b</code> can be re-evaluated, so matching values can be found. The second solution, <code>a = 8</code> and <code>b = 3</code> satisfies both equations; the function might also, in this case, pick the values <code>a = 6</code> and <code>b = 4</code>. This would also be correct in this case.</p>\n</li>\n</ul>\n<p><em><strong>Additional LinkedCond properties</strong></em></p>\n<p>LinkedCond objects share all their methods with Cond objects, except for two extra ones:</p>\n<ul>\n<li>The first new method is <code>getlims()</code>. This method will return a set, containing all the limitations that currently apply for the object. As for the names that will be used in place of the single-letter variables, it will be attempted to replicate the variable names that have been used. For example:\n<pre> <span class=\"n\">obj</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"nb\">range</span> <span class=\"o\">=</span> <span class=\"mi\">20</span><span class=\"p\">)</span>\n <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"x\"</span><span class=\"p\">,</span> <span class=\"n\">obj</span><span class=\"p\">,</span> <span class=\"s2\">\"&gt;\"</span><span class=\"p\">,</span> <span class=\"mi\">11</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">obj</span><span class=\"o\">.</span><span class=\"n\">getlims</span><span class=\"p\">())</span>\n</pre>\nOUTPUT:\n<pre><code> {\"obj &gt; 11\"}\n</code></pre>\nIn place of <code>x</code>, <code>obj</code>, which is the variable name of the object, was used. This is done so that it is easier to see which objects the limitation is really referring to. Nevertheless, above, it was stated that it will be <em>attempted</em> to replicate the variable names. This is because, in some cases, it will be impossible to replicate those names. Consider the following:\n<pre> <span class=\"k\">def</span> <span class=\"nf\">func</span><span class=\"p\">():</span>\n \t<span class=\"n\">obj</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"nb\">range</span> <span class=\"o\">=</span> <span class=\"mi\">20</span><span class=\"p\">)</span>\n \t<span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"x\"</span><span class=\"p\">,</span> <span class=\"n\">obj</span><span class=\"p\">,</span> <span class=\"s2\">\"&gt;\"</span><span class=\"p\">,</span> <span class=\"mi\">11</span><span class=\"p\">)</span>\n \t<span class=\"k\">return</span> <span class=\"p\">[</span><span class=\"n\">obj</span><span class=\"p\">]</span>\n <span class=\"n\">obj_list</span> <span class=\"o\">=</span> <span class=\"n\">func</span><span class=\"p\">()</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">obj_list</span><span class=\"p\">[</span><span class=\"mi\">0</span><span class=\"p\">]</span><span class=\"o\">.</span><span class=\"n\">getlims</span><span class=\"p\">())</span>\n <span class=\"k\">for</span> <span class=\"n\">v</span> <span class=\"ow\">in</span> <span class=\"n\">obj_list</span><span class=\"p\">:</span>\n \t<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">v</span><span class=\"o\">.</span><span class=\"n\">getlims</span><span class=\"p\">())</span>\n</pre>\nOUTPUT:\n<pre><code> {\"obj_list[0] &gt; 11\"}\n {\"v &gt; 11\"}\n</code></pre>\nHere, after the function <code>func</code> quits, all the variables declared in its scope are destroyed; it is impossible to get the variable name <code>obj</code> after that. However, since the object is saved inside of the list named <code>obj_list</code>, when using the <code>getlims</code> method on it, the name of the list that contains it followed by brackets and the index will be used instead. When iterating through the list, the name of the temporary variable will be used.\nThe only case in which the single-letter variable names will be used, is when it is impossible to find variable names for all the included objects. For example, consider the following:\n<pre> <span class=\"k\">def</span> <span class=\"nf\">func</span><span class=\"p\">():</span>\n \t<span class=\"n\">obj</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"nb\">range</span> <span class=\"o\">=</span> <span class=\"mi\">10</span><span class=\"p\">)</span>\n \t<span class=\"n\">obj2</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"nb\">range</span> <span class=\"o\">=</span> <span class=\"mi\">20</span><span class=\"p\">)</span>\n \t<span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"xy\"</span><span class=\"p\">,</span> <span class=\"p\">(</span><span class=\"n\">obj</span><span class=\"p\">,</span> <span class=\"n\">obj2</span><span class=\"p\">),</span> <span class=\"s2\">\"&gt;\"</span><span class=\"p\">,</span> <span class=\"mi\">10</span><span class=\"p\">)</span>\n \t<span class=\"k\">return</span> <span class=\"p\">{</span><span class=\"n\">obj</span><span class=\"p\">:</span> <span class=\"s2\">\"Hello\"</span><span class=\"p\">,</span> <span class=\"n\">obj2</span><span class=\"p\">:</span> <span class=\"s2\">\"World\"</span><span class=\"p\">}</span>\n <span class=\"n\">thedict</span> <span class=\"o\">=</span> <span class=\"n\">func</span><span class=\"p\">()</span>\n <span class=\"k\">for</span> <span class=\"n\">key</span> <span class=\"ow\">in</span> <span class=\"n\">thedict</span><span class=\"p\">:</span>\n \t<span class=\"nb\">print</span> <span class=\"n\">key</span><span class=\"o\">.</span><span class=\"n\">getlims</span><span class=\"p\">()</span>\n</pre>\nOUTPUT:\n<pre><code> {\"x*y &gt; 10\"}\n {\"x*y &gt; 10\"}\n</code></pre>\nHere, the objects are used as dictionary keys (note: <strong>almost never do this</strong>). This means that <em>no</em> variable names, at all, exist for these objects. Because they are the dictionary keys, meaning that they are the ones used to refer to the dictionary values, there is no real way to refer to them. For this reason, the only thing that the <code>getlims</code> function can do is use the single-letter variables, passed when require was called, instead.\nThe reason using Cond or LinkedCond objects as dictionary keys should be avoided, is because the dictionary will represent the object by its main option. This means that if two objects have the same main option, there cannot be two dictionary entries for both of them; when it is attempted to set a new value for the second object, the first object and its value will be overwritten.</li>\n<li>The second method is <code>clearlims()</code>. As would be expected, this method will clear all the limitations for a LinkedCond object. The only thing that needs to be noted here, is that <code>clearlims</code> will not only clear the limitations for the object it is called on, but also for linked objects, that link the object to them. Consider the example where the product of two LinkedCond objects is 24 and one of them is smaller than 6.\n<pre> <span class=\"n\">a</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"nb\">range</span> <span class=\"o\">=</span> <span class=\"mi\">10</span><span class=\"p\">)</span>\n <span class=\"n\">b</span> <span class=\"o\">=</span> <span class=\"n\">LinkedCond</span><span class=\"p\">(</span><span class=\"nb\">range</span> <span class=\"o\">=</span> <span class=\"mi\">10</span><span class=\"p\">)</span>\n <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"ab\"</span><span class=\"p\">,</span> <span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">),</span> <span class=\"s2\">\"=\"</span><span class=\"p\">,</span> <span class=\"mi\">24</span><span class=\"p\">)</span>\n <span class=\"n\">require</span><span class=\"p\">(</span><span class=\"s2\">\"b\"</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">,</span> <span class=\"s2\">\"&lt;\"</span><span class=\"p\">,</span> <span class=\"mi\">6</span><span class=\"p\">)</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">b</span><span class=\"o\">.</span><span class=\"n\">getlims</span><span class=\"p\">())</span>\n <span class=\"n\">a</span><span class=\"o\">.</span><span class=\"n\">clearlims</span><span class=\"p\">()</span>\n <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">b</span><span class=\"o\">.</span><span class=\"n\">getlims</span><span class=\"p\">())</span>\n</pre>\nOUTPUT:\n<pre><code> {'b &lt; 6', 'a*b = 24'}\n {'b &lt; 6'}\n</code></pre>\nIn this case, when <code>clearlims</code> was called on <code>a</code>, the limitation <code>a*b = 24</code> was also removed from <code>b</code>. However, the limitation of <code>b</code> that didn't include <code>a</code>, <code>b &lt; 6</code>, did not change.</li>\n</ul>\n<p><em><strong>Credit</strong></em></p>\n<p>The inspiration for this project was solely taken from a lightning talk by Jason Orendorff, <a href=\"https://www.youtube.com/watch?v=iOJD7nd7cyY\" rel=\"nofollow\">on Youtube.</a></p>\n<p>His github profile can be found <a href=\"https://github.com/jorendorff\" rel=\"nofollow\">here</a>.</p>\n<p><a href=\"https://wiki.c2.com/?QuantumBogoSort\" rel=\"nofollow\">This description</a> on \"Quantum Bogosort\" also helped.</p>\n\n          </div>"}, "last_serial": 6560245, "releases": {"1.0.1": [{"comment_text": "", "digests": {"md5": "dae9022df36242557728a59f7998bcc6", "sha256": "bb3ef97f24e7acf225a1bb44fd4b912a1865f324b5e894875a93e297af258327"}, "downloads": -1, "filename": "cond-1.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "dae9022df36242557728a59f7998bcc6", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 11793, "upload_time": "2020-01-27T20:26:14", "upload_time_iso_8601": "2020-01-27T20:26:14.600962Z", "url": "https://files.pythonhosted.org/packages/72/50/1f150ff227c4a328fb747e173ca87895e73f6ef71de81dc1df0187b48847/cond-1.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e34e4ba3872b0e1c16f0164a590ba109", "sha256": "3f14c54e2bd1e871c8000fdf3896b90e87b9504ce89c7caeba689982b73ce1db"}, "downloads": -1, "filename": "cond-1.0.1.tar.gz", "has_sig": false, "md5_digest": "e34e4ba3872b0e1c16f0164a590ba109", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 10958, "upload_time": "2020-01-27T20:26:17", "upload_time_iso_8601": "2020-01-27T20:26:17.882798Z", "url": "https://files.pythonhosted.org/packages/37/12/084bd2d711689fc9a5ccc02a6a22115b474ed9223aed1b48bc5fef023cab/cond-1.0.1.tar.gz", "yanked": false}], "1.1.0": [{"comment_text": "", "digests": {"md5": "e0a224f7677b3acca061b26d4bb45ff5", "sha256": "db333b8fb97407c59546991893b17d940a45b0090ef371b5f330e8af6a634eaa"}, "downloads": -1, "filename": "cond-1.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "e0a224f7677b3acca061b26d4bb45ff5", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 11903, "upload_time": "2020-01-29T18:19:29", "upload_time_iso_8601": "2020-01-29T18:19:29.854071Z", "url": "https://files.pythonhosted.org/packages/f9/a6/065c1b88515e2cedb1cba7ea2b86428df01d08e00d1a145bdaad5622d92f/cond-1.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b6e2028a850aaa083f094b4b6168f891", "sha256": "40edebe0682a2653228b2602f1c4663df4a2e1798964146a2bc5232662433d44"}, "downloads": -1, "filename": "cond-1.1.0.tar.gz", "has_sig": false, "md5_digest": "b6e2028a850aaa083f094b4b6168f891", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 11050, "upload_time": "2020-01-29T18:19:31", "upload_time_iso_8601": "2020-01-29T18:19:31.759902Z", "url": "https://files.pythonhosted.org/packages/d7/98/c33d4e4f95bfaad8c080511db41811071a6422aff4a34441a8db9febdc10/cond-1.1.0.tar.gz", "yanked": false}], "1.2.0": [{"comment_text": "", "digests": {"md5": "755d560a38ddd74e05018bdd7e166390", "sha256": "14481c15497bca96e79ca79fcbe66171fbc97c8d61dbd7fd9a6a381a557a0274"}, "downloads": -1, "filename": "cond-1.2.0-py3-none-any.whl", "has_sig": false, "md5_digest": "755d560a38ddd74e05018bdd7e166390", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 17989, "upload_time": "2020-02-02T23:35:38", "upload_time_iso_8601": "2020-02-02T23:35:38.964911Z", "url": "https://files.pythonhosted.org/packages/bc/47/1404cea2399d93a32ab8fc95d23264a435f3fdc852df06ffce5b54c098ac/cond-1.2.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1b5a94dc43cd6a666dac0ad303f2e6ec", "sha256": "7bffc8032c5acc0ff19625cfe3310756621e2b65325f77606e7b59102ad34045"}, "downloads": -1, "filename": "cond-1.2.0.tar.gz", "has_sig": false, "md5_digest": "1b5a94dc43cd6a666dac0ad303f2e6ec", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 18056, "upload_time": "2020-02-02T23:35:41", "upload_time_iso_8601": "2020-02-02T23:35:41.008198Z", "url": "https://files.pythonhosted.org/packages/ce/22/3a00bc0e7679d5f69670ec0135a49df7a298d5a600aa15730309972badc5/cond-1.2.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "755d560a38ddd74e05018bdd7e166390", "sha256": "14481c15497bca96e79ca79fcbe66171fbc97c8d61dbd7fd9a6a381a557a0274"}, "downloads": -1, "filename": "cond-1.2.0-py3-none-any.whl", "has_sig": false, "md5_digest": "755d560a38ddd74e05018bdd7e166390", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 17989, "upload_time": "2020-02-02T23:35:38", "upload_time_iso_8601": "2020-02-02T23:35:38.964911Z", "url": "https://files.pythonhosted.org/packages/bc/47/1404cea2399d93a32ab8fc95d23264a435f3fdc852df06ffce5b54c098ac/cond-1.2.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1b5a94dc43cd6a666dac0ad303f2e6ec", "sha256": "7bffc8032c5acc0ff19625cfe3310756621e2b65325f77606e7b59102ad34045"}, "downloads": -1, "filename": "cond-1.2.0.tar.gz", "has_sig": false, "md5_digest": "1b5a94dc43cd6a666dac0ad303f2e6ec", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 18056, "upload_time": "2020-02-02T23:35:41", "upload_time_iso_8601": "2020-02-02T23:35:41.008198Z", "url": "https://files.pythonhosted.org/packages/ce/22/3a00bc0e7679d5f69670ec0135a49df7a298d5a600aa15730309972badc5/cond-1.2.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:44:03 2020"}