{"info": {"author": "Nuxeo and contributors", "author_email": "cps-devel@lists.nuxeo.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: GNU General Public License (GPL)"], "description": "CPS is an extensive collaborative Web content management system (CMS) \nimplemented on top of Zope and the CMF, that enables organizations to easily, \nquickly and efficiently implement collaborative portals (intranet, extranet or \ninternet) and workflow- oriented business applications. \n \nCPS Provides, among other features: \n \n    * Collaborative work and publication spaces (you may need to be \nauthenticated with the right access level to access these URLs) \n    * Document versionning, that allows a document to be published in one \nversion and still worked on in another one \n    * Group-based, directory-backed user and roles management \n    * A configurable Portal interface, with a web- and accessibility-standards \ncompliant default look and feel (you will need to be authenticated with the \nright access level to access this URL) \n    * Notifications on many kinds of events happening on the system \n    * An WYSIWYG editor for portal look and feel  \n    * Many user-level services, like a Webmail, Forums, shared Calendars, \nNewsletters and Mailing Lists, etc. \n    * Many powerful developers- and webmaster-level services, including support \nfor creating your own document types, your own workflows, etc.", "description_content_type": null, "docs_url": null, "download_url": "http://www.cps-project.org/static/src/CPS-3.3.6.tar.gz", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://www.cps-project.org/", "keywords": "CPS, Zope, CMF, ECM, groupware, framework, Nuxeo", "license": "GPL", "maintainer": "Nuxeo and contributors", "maintainer_email": "cps-devel@lists.nuxeo.com", "name": "CPS", "package_url": "https://pypi.org/project/CPS/", "platform": "UNIX, MAC, Windows", "project_url": "https://pypi.org/project/CPS/", "project_urls": {"Download": "http://www.cps-project.org/static/src/CPS-3.3.6.tar.gz", "Homepage": "http://www.cps-project.org/"}, "release_url": "https://pypi.org/project/CPS/3.3.6/", "requires_dist": null, "requires_python": null, "summary": "Advanced and full featured Open Source ECM framework", "version": "3.3.6", "yanked": false, "html_description": "<div class=\"project-description\">\n            CPS is an extensive collaborative Web content management system (CMS) <br>implemented on top of Zope and the CMF, that enables organizations to easily, <br>quickly and efficiently implement collaborative portals (intranet, extranet or <br>internet) and workflow- oriented business applications. <br> <br>CPS Provides, among other features: <br> <br>    * Collaborative work and publication spaces (you may need to be <br>authenticated with the right access level to access these URLs) <br>    * Document versionning, that allows a document to be published in one <br>version and still worked on in another one <br>    * Group-based, directory-backed user and roles management <br>    * A configurable Portal interface, with a web- and accessibility-standards <br>compliant default look and feel (you will need to be authenticated with the <br>right access level to access this URL) <br>    * Notifications on many kinds of events happening on the system <br>    * An WYSIWYG editor for portal look and feel  <br>    * Many user-level services, like a Webmail, Forums, shared Calendars, <br>Newsletters and Mailing Lists, etc. <br>    * Many powerful developers- and webmaster-level services, including support <br>for creating your own document types, your own workflows, etc.\n          </div>"}, "last_serial": 802477, "releases": {"3.3.6": []}, "urls": [], "timestamp": "Fri May  8 00:42:35 2020"}