{"info": {"author": "Stephen Larroque", "author_email": "lrq3000@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Console", "Environment :: MacOS X", "Environment :: Win32 (MS Windows)", "Environment :: X11 Applications", "Intended Audience :: End Users/Desktop", "Intended Audience :: Healthcare Industry", "Intended Audience :: Science/Research", "License :: OSI Approved :: MIT License", "Operating System :: MacOS :: MacOS X", "Operating System :: Microsoft :: Windows", "Operating System :: POSIX", "Operating System :: POSIX :: BSD", "Operating System :: POSIX :: BSD :: FreeBSD", "Operating System :: POSIX :: Linux", "Operating System :: POSIX :: SunOS/Solaris", "Programming Language :: Python", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: Implementation :: PyPy", "Topic :: Scientific/Engineering :: Medical Science Apps.", "Topic :: Software Development :: Libraries", "Topic :: Utilities"], "description": "csg_dicoms_anonymizer\r\n======================\r\n\r\n|PyPI-Status| |PyPI-Versions| |LICENCE|\r\n\r\nThis dicoms anonymizer/pseudonymizer was made to make your life easier as a clinician sharing data.\r\n\r\nThe first goal is to remove the patient's name and replace by a pseudonym in both dicoms and a demographics csv file, but it also takes care of deleting other structures potentially containing identifiable information such as fields (eg, patient's phone number) and files (pdf, txt, csv, etc), via configurable blacklists.\r\n\r\n|Screenshot|\r\n\r\nIt runs under Python 2.7 (it was not tested nor developped with compatibility with Python 3 in mind, although it might work with some slight changes).\r\n\r\nThis is a generic dicoms pseudonymizer with an emphasis on:\r\n\r\n1. **Ease of use** : simply point to the folder containing all your dicoms (folders or zip files) and to the demographics file (just ensure you have a \"name\" column), and click \"Start\"! Note that you can also use it in commandline, allowing batch scripting.\r\n\r\n2. **Easy to anonymize demographics** : a fuzzy matching algorithm will take care of small typos and of firstname/lastname reversal (works also if there are several first names or last names). At the end, several csv files will be generated: the anonymized demographics shortened to only the patients present in the dicoms (so that you can reuse a big demographics spreadsheet of all your subjects even to anonymize only a few subjects, the shortened anonymized demographics will only contain the pertinent subjects), the list of missing subjects that are in dicoms but not in demographics (so that your recipient knows directly what demographics were not available), and a mapping to convert from anonymized ids to original patient name (useful if your collaborator requests additional information about an anonymized patient, or just to check if there is an issue).\r\n\r\n3. **Retaining potentially pertinent information in dicoms** : instead of anonymizing all personal fields, this application anonymizes only the name (and strips out some other personal infos such as phone number, patient address, etc), but not all personal fields. Thus, anonymized dicoms will retain age, gender, date of scan, date of birth, etc. which can be then used as regression covariates or to cluster patients together. Additional fields to remove can easily be added as an argument.\r\n\r\n4. **Reliability** : a name with several typos or even a missing first name will still be anonymized correctly and linked to the correct demographics entry, by using fuzzy matching based on a normalized levenshstein distance for characters mistakes and a modified normalized words jaccard distance on words switching/missing. In any case, if a similar name cannot be found in the demographics, it will be replaced by a pseudonym and added to the mapping.\r\n\r\n5. **Robustness** : all other dicoms anonymizers look for the name only in the PatientName field. However, there are other hidden fields which can contain the patient's name, and this changes for each machine, each center, each parametrization of a scanner. This application will robustly find all fields containing the patient's name, and will try to remove it without touching the rest of the field (which can contain critical technical data), and it always checks that the name is cleared from the whole dicom before continuing. In case the patient name remains for whatever reason, the anonymizer will stop and show an error message so that you can take the appropriate steps.\r\n\r\n6. **Deterministic one-way cryptography** : pseudonyms are generated in a way that prevent any back tracing while still generating always the same pseudonym given the same patient's name. This is made possible by using a cryptographic hashing function with customizable salt: as long as you use a salt string specific to your organization, noone without this salt will be able to trace back the data without the mapping generated by this application, even if in possession of the registry of patients names.\r\n\r\nUSAGE\r\n-----\r\n\r\nTo use this application, you must point to a folder where each subfolder is a patient dicom session. You can put multiple dicom sessions if it is for the same patient. This is because the script assumes one patient per folder (to look for name, else it would be too expensive to look at all dicoms files).\r\n\r\nOptionally, you can provide a demographics file in csv format, to pseudonymize it along with dicoms, with the same pseudonyms. This csv file must include at least one column \"name\" where all the patients names are. Typos and words order do not matter, as there will be a fuzzy matching. However, note that this fuzzy matching might not work correctly if some names are too similar, or if there are too many typos or too many missing middle names. The fuzzy matching can be adjusted via the \"dist_threshold\" argument.\r\n\r\nFinally, there are multiple additional options to refine the efficiency of the pseudonymization, for example there are blacklists for filetypes to remove that could contain identifiable informations (pdf, csv, txt, etc), that could be leftovers from the experimenter, as well as a blacklist for dicom fields to remove altogether (such as PatientPhoneNumber).\r\n\r\nThis app can work with a GUI or from commandline interchangeably, the same features and options will be available.\r\n\r\nAnother interesting feature is that you can build on top of an anonymized dataset, you can add new subjects. Indeed, each subject gets a unique id based on the name (by default) or by the order in the folder (by using the appropriate option), which makes it impossible to translate back to the original name from the id in any case.\r\n\r\nNOTE ON REGULATIONS: ANONYMIZATION VS PSEUDONYMIZATION\r\n------------------------------------------------------\r\n\r\nThe goal of this tool is to pseudonymize the data, not anonymize according to regulations. The difference is important: private fields will be kept (except if you specify a list of fields to delete), but patients names will be replaced by anonymous pseudonyms, rendering identification by name impossible (even when getting a hold of the subjects names, it is impossible without the mapping to trace back the demographics and dicom files to which names, thanks to the cryptographic salt). This is important for studies, where private fields contain important informations (scanner slice timing and parameters, patient's age and gender, etc).\r\n\r\nIf you want full anonymization (ie, removing/modifying all private fields), please have a look at `dicom-anon <https://github.com/chop-dbhi/dicom-anon>`_, a Python dicoms anonymizer, with configurable specifications. See also `pydicom example anonymizer <https://github.com/pydicom/pydicom/blob/master/examples/metadata_processing/plot_anonymize.py>`_ and `MATLAB's dicomanon command <http://mathworks.com/help/images/ref/dicomanon.html>`_. Note however that this is not enough for full anonymization, as you will also need to deface (be warned this might make statistical preprocessing and analysis difficult).\r\n\r\nTODO\r\n---------\r\nThis application is provided as-is with the hopes it can be useful to someone else. It was not cleaned up beforehand more than what was sufficient for running as a standalone GUI application and packaged as a minimal size binary.\r\n\r\nWith that in mind, the following should be done to make this application a proper software:\r\n\r\n* Make demographics file optional. It is already not really necessary in the code to anonymize dicoms, an empty csv with just the 'name' column should be enough. But it would be better if it was really optional and handled correctly.\r\n* Make dicoms optional (enter an empty dicoms folder), so that a demographics file will still be anonymized.\r\n* Allow to reuse an anonymized table (find similar names and assign the same hash).\r\n* Refactor code: put functions above the code, delete the # [] useless comments coming from Jupyter export, move to functions some code snippets.\r\n* Use requirements instead of integrating submodules in csg_fileutil_libs.\r\n* Unit test with randomly generated dicoms.\r\n\r\nLICENSE\r\n-------------\r\nCSG Dicoms Anonymizer was initially made by Stephen Larroque <LRQ3000> for the Coma Science Group - GIGA Consciousness - CHU de Liege, Belgium. The application is licensed under MIT License.\r\n\r\n\r\n.. |LICENCE| image:: https://img.shields.io/pypi/l/csg_dicoms_anonymizer.svg\r\n   :target: https://raw.githubusercontent.com/lrq3000/csg_dicoms_anonymizer/master/LICENCE\r\n.. |PyPI-Status| image:: https://img.shields.io/pypi/v/csg_dicoms_anonymizer.svg\r\n   :target: https://pypi.python.org/pypi/csg_dicoms_anonymizer\r\n.. |PyPI-Versions| image:: https://img.shields.io/pypi/pyversions/csg_dicoms_anonymizer.svg\r\n   :target: https://pypi.python.org/pypi/csg_dicoms_anonymizer\r\n.. |Screenshot| image:: https://raw.githubusercontent.com/lrq3000/csg_dicoms_anonymizer/master/img/dicoms_anonymizer_gui.png\r\n\r\n\r\n", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/LRQ3000/csg_dicoms_anonymizer", "keywords": "dicom neuroimage neuroimagery utility anonymizer fuzzy matching", "license": "MIT Licence", "maintainer": "", "maintainer_email": "", "name": "csg-dicoms-anonymizer", "package_url": "https://pypi.org/project/csg-dicoms-anonymizer/", "platform": "any", "project_url": "https://pypi.org/project/csg-dicoms-anonymizer/", "project_urls": {"Homepage": "https://github.com/LRQ3000/csg_dicoms_anonymizer"}, "release_url": "https://pypi.org/project/csg-dicoms-anonymizer/1.4.2/", "requires_dist": null, "requires_python": "", "summary": "Robust and easy to use generic dicoms anonymizer with demographics csv spreadsheet anonymization by hashed ids", "version": "1.4.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><a href=\"https://pypi.python.org/pypi/csg_dicoms_anonymizer\" rel=\"nofollow\"><img alt=\"PyPI-Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/60e6e34505a2b96e27649fce1163acfaaa893c7c/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f6373675f6469636f6d735f616e6f6e796d697a65722e737667\"></a> <a href=\"https://pypi.python.org/pypi/csg_dicoms_anonymizer\" rel=\"nofollow\"><img alt=\"PyPI-Versions\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/b67129541d53ad6931f724d10747fa217ce0c232/68747470733a2f2f696d672e736869656c64732e696f2f707970692f707976657273696f6e732f6373675f6469636f6d735f616e6f6e796d697a65722e737667\"></a> <a href=\"https://raw.githubusercontent.com/lrq3000/csg_dicoms_anonymizer/master/LICENCE\" rel=\"nofollow\"><img alt=\"LICENCE\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2c778a2c2b02de43e1bb8c04e9cea32a6c47804f/68747470733a2f2f696d672e736869656c64732e696f2f707970692f6c2f6373675f6469636f6d735f616e6f6e796d697a65722e737667\"></a></p>\n<p>This dicoms anonymizer/pseudonymizer was made to make your life easier as a clinician sharing data.</p>\n<p>The first goal is to remove the patient’s name and replace by a pseudonym in both dicoms and a demographics csv file, but it also takes care of deleting other structures potentially containing identifiable information such as fields (eg, patient’s phone number) and files (pdf, txt, csv, etc), via configurable blacklists.</p>\n<p><img alt=\"Screenshot\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/b3263625e9e81d81603110234ca8ccc41c5e9d56/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f6c7271333030302f6373675f6469636f6d735f616e6f6e796d697a65722f6d61737465722f696d672f6469636f6d735f616e6f6e796d697a65725f6775692e706e67\"></p>\n<p>It runs under Python 2.7 (it was not tested nor developped with compatibility with Python 3 in mind, although it might work with some slight changes).</p>\n<p>This is a generic dicoms pseudonymizer with an emphasis on:</p>\n<ol>\n<li><strong>Ease of use</strong> : simply point to the folder containing all your dicoms (folders or zip files) and to the demographics file (just ensure you have a “name” column), and click “Start”! Note that you can also use it in commandline, allowing batch scripting.</li>\n<li><strong>Easy to anonymize demographics</strong> : a fuzzy matching algorithm will take care of small typos and of firstname/lastname reversal (works also if there are several first names or last names). At the end, several csv files will be generated: the anonymized demographics shortened to only the patients present in the dicoms (so that you can reuse a big demographics spreadsheet of all your subjects even to anonymize only a few subjects, the shortened anonymized demographics will only contain the pertinent subjects), the list of missing subjects that are in dicoms but not in demographics (so that your recipient knows directly what demographics were not available), and a mapping to convert from anonymized ids to original patient name (useful if your collaborator requests additional information about an anonymized patient, or just to check if there is an issue).</li>\n<li><strong>Retaining potentially pertinent information in dicoms</strong> : instead of anonymizing all personal fields, this application anonymizes only the name (and strips out some other personal infos such as phone number, patient address, etc), but not all personal fields. Thus, anonymized dicoms will retain age, gender, date of scan, date of birth, etc. which can be then used as regression covariates or to cluster patients together. Additional fields to remove can easily be added as an argument.</li>\n<li><strong>Reliability</strong> : a name with several typos or even a missing first name will still be anonymized correctly and linked to the correct demographics entry, by using fuzzy matching based on a normalized levenshstein distance for characters mistakes and a modified normalized words jaccard distance on words switching/missing. In any case, if a similar name cannot be found in the demographics, it will be replaced by a pseudonym and added to the mapping.</li>\n<li><strong>Robustness</strong> : all other dicoms anonymizers look for the name only in the PatientName field. However, there are other hidden fields which can contain the patient’s name, and this changes for each machine, each center, each parametrization of a scanner. This application will robustly find all fields containing the patient’s name, and will try to remove it without touching the rest of the field (which can contain critical technical data), and it always checks that the name is cleared from the whole dicom before continuing. In case the patient name remains for whatever reason, the anonymizer will stop and show an error message so that you can take the appropriate steps.</li>\n<li><strong>Deterministic one-way cryptography</strong> : pseudonyms are generated in a way that prevent any back tracing while still generating always the same pseudonym given the same patient’s name. This is made possible by using a cryptographic hashing function with customizable salt: as long as you use a salt string specific to your organization, noone without this salt will be able to trace back the data without the mapping generated by this application, even if in possession of the registry of patients names.</li>\n</ol>\n<div id=\"usage\">\n<h2>USAGE</h2>\n<p>To use this application, you must point to a folder where each subfolder is a patient dicom session. You can put multiple dicom sessions if it is for the same patient. This is because the script assumes one patient per folder (to look for name, else it would be too expensive to look at all dicoms files).</p>\n<p>Optionally, you can provide a demographics file in csv format, to pseudonymize it along with dicoms, with the same pseudonyms. This csv file must include at least one column “name” where all the patients names are. Typos and words order do not matter, as there will be a fuzzy matching. However, note that this fuzzy matching might not work correctly if some names are too similar, or if there are too many typos or too many missing middle names. The fuzzy matching can be adjusted via the “dist_threshold” argument.</p>\n<p>Finally, there are multiple additional options to refine the efficiency of the pseudonymization, for example there are blacklists for filetypes to remove that could contain identifiable informations (pdf, csv, txt, etc), that could be leftovers from the experimenter, as well as a blacklist for dicom fields to remove altogether (such as PatientPhoneNumber).</p>\n<p>This app can work with a GUI or from commandline interchangeably, the same features and options will be available.</p>\n<p>Another interesting feature is that you can build on top of an anonymized dataset, you can add new subjects. Indeed, each subject gets a unique id based on the name (by default) or by the order in the folder (by using the appropriate option), which makes it impossible to translate back to the original name from the id in any case.</p>\n</div>\n<div id=\"note-on-regulations-anonymization-vs-pseudonymization\">\n<h2>NOTE ON REGULATIONS: ANONYMIZATION VS PSEUDONYMIZATION</h2>\n<p>The goal of this tool is to pseudonymize the data, not anonymize according to regulations. The difference is important: private fields will be kept (except if you specify a list of fields to delete), but patients names will be replaced by anonymous pseudonyms, rendering identification by name impossible (even when getting a hold of the subjects names, it is impossible without the mapping to trace back the demographics and dicom files to which names, thanks to the cryptographic salt). This is important for studies, where private fields contain important informations (scanner slice timing and parameters, patient’s age and gender, etc).</p>\n<p>If you want full anonymization (ie, removing/modifying all private fields), please have a look at <a href=\"https://github.com/chop-dbhi/dicom-anon\" rel=\"nofollow\">dicom-anon</a>, a Python dicoms anonymizer, with configurable specifications. See also <a href=\"https://github.com/pydicom/pydicom/blob/master/examples/metadata_processing/plot_anonymize.py\" rel=\"nofollow\">pydicom example anonymizer</a> and <a href=\"http://mathworks.com/help/images/ref/dicomanon.html\" rel=\"nofollow\">MATLAB’s dicomanon command</a>. Note however that this is not enough for full anonymization, as you will also need to deface (be warned this might make statistical preprocessing and analysis difficult).</p>\n</div>\n<div id=\"todo\">\n<h2>TODO</h2>\n<p>This application is provided as-is with the hopes it can be useful to someone else. It was not cleaned up beforehand more than what was sufficient for running as a standalone GUI application and packaged as a minimal size binary.</p>\n<p>With that in mind, the following should be done to make this application a proper software:</p>\n<ul>\n<li>Make demographics file optional. It is already not really necessary in the code to anonymize dicoms, an empty csv with just the ‘name’ column should be enough. But it would be better if it was really optional and handled correctly.</li>\n<li>Make dicoms optional (enter an empty dicoms folder), so that a demographics file will still be anonymized.</li>\n<li>Allow to reuse an anonymized table (find similar names and assign the same hash).</li>\n<li>Refactor code: put functions above the code, delete the # [] useless comments coming from Jupyter export, move to functions some code snippets.</li>\n<li>Use requirements instead of integrating submodules in csg_fileutil_libs.</li>\n<li>Unit test with randomly generated dicoms.</li>\n</ul>\n</div>\n<div id=\"license\">\n<h2>LICENSE</h2>\n<p>CSG Dicoms Anonymizer was initially made by Stephen Larroque &lt;LRQ3000&gt; for the Coma Science Group - GIGA Consciousness - CHU de Liege, Belgium. The application is licensed under MIT License.</p>\n</div>\n\n          </div>"}, "last_serial": 3590977, "releases": {"1.4.1": [{"comment_text": "", "digests": {"md5": "00e39634a8158b4989cdedc86391b20b", "sha256": "a15fb6d82e899649815fba77cd03a44ad3eebac253e2872a0f94b47dafbaaca3"}, "downloads": -1, "filename": "csg_dicoms_anonymizer-1.4.1.tar.gz", "has_sig": false, "md5_digest": "00e39634a8158b4989cdedc86391b20b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2353280, "upload_time": "2017-08-07T03:05:31", "upload_time_iso_8601": "2017-08-07T03:05:31.156188Z", "url": "https://files.pythonhosted.org/packages/53/e7/cba784c15eb11a25280a22faf544aadc3eae22933ca53052556cf5664b22/csg_dicoms_anonymizer-1.4.1.tar.gz", "yanked": false}], "1.4.2": [{"comment_text": "", "digests": {"md5": "591e27e942956d73d5a951b41027e03b", "sha256": "e2a7ab3e31fee35b2c1b120a8fb5929899c503415599d74bfffbaefaa020cd7d"}, "downloads": -1, "filename": "csg_dicoms_anonymizer-1.4.2.tar.gz", "has_sig": false, "md5_digest": "591e27e942956d73d5a951b41027e03b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2356734, "upload_time": "2018-02-17T14:44:28", "upload_time_iso_8601": "2018-02-17T14:44:28.859256Z", "url": "https://files.pythonhosted.org/packages/e5/97/77c4d438151113cf2b970e9252588740dc4da5d4eb706b83c2d3026a0626/csg_dicoms_anonymizer-1.4.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "591e27e942956d73d5a951b41027e03b", "sha256": "e2a7ab3e31fee35b2c1b120a8fb5929899c503415599d74bfffbaefaa020cd7d"}, "downloads": -1, "filename": "csg_dicoms_anonymizer-1.4.2.tar.gz", "has_sig": false, "md5_digest": "591e27e942956d73d5a951b41027e03b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2356734, "upload_time": "2018-02-17T14:44:28", "upload_time_iso_8601": "2018-02-17T14:44:28.859256Z", "url": "https://files.pythonhosted.org/packages/e5/97/77c4d438151113cf2b970e9252588740dc4da5d4eb706b83c2d3026a0626/csg_dicoms_anonymizer-1.4.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:41:50 2020"}