{"info": {"author": "Ripple", "author_email": "rome@ripple.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Environment :: Console", "Intended Audience :: End Users/Desktop", "License :: OSI Approved :: MIT License", "Operating System :: POSIX", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.5", "Topic :: Documentation", "Topic :: Utilities"], "description": "# Dactyl\n\nDocumentation tools for enterprise-quality documentation from Markdown source. Dactyl has advanced features to enable [single-sourcing](https://en.wikipedia.org/wiki/Single_source_publishing) and an extensible syntax for building well-organized, visually attractive docs. It generates output in HTML (natively), and can make PDFs if you have [Prince][] installed.\n\n[Prince]: http://www.princexml.com/\n\n## Installation\n\nDactyl requires [Python 3](https://python.org/). Install with [pip](https://pip.pypa.io/en/stable/):\n\n```\nsudo pip3 install dactyl\n```\n\nOr a local install in a virtualenv:\n\n```sh\n# Create an activate a virtualenv so the package and dependencies are localized\nvirtualenv -p `which python3` venv_dactyl\nsource venv_dactyl/bin/activate\n\n# Check out this repo\ngit clone https://github.com/ripple/dactyl\n\n# Install\npip3 install dactyl/\n\n# Where 'dactyl/' is the top level directory of the repo, containing setup.py.\n# And note the trailing '/' which tells pip to use a local directory to install it.\n```\n\n## Usage\n\nSimple (\"Ad-Hoc\") usage:\n\n```sh\n$ dactyl_build --pages input1.md input2.md\n```\n\nBy default, the resulting HTML pages are written to a folder called `out/` in the current working directory. You can specify a different output path in the config file or by using the `-o` parameter.\n\n### Building PDF\n\nDactyl generates PDFs by making temporary HTML files and running [Prince][]. Use the `--pdf` command to generate a PDF. Dactyl tries to come up with a sensible output filename by default, or you can provide one (which must end in `.pdf`):\n\n```sh\n$ dactyl_build --pages input1.md input2.md --pdf MyGuide.pdf\n```\n\n### Advanced Usage\n\nDactyl is intended to be used with a config file containing a list of pages to parse. Pages are grouped into \"targets\" that represent a group of documents to be built together; a page can belong to multiple targets, and can even contain conditional syntax so that it builds slightly different depending on the target in question. Targets and pages can also use different templates from each other, and pages can inherit semi-arbitrary key/value pairs from the targets.\n\nFor more information on configuration, see the `default-config.yml` and the [examples](examples/) folder.\n\nThe input pages in the config file should be specified relative to the `content_path`, which is `content/` by default. You can also specify a URL to pull in a markdown file from a remote source, but if you do, Dactyl won't run any pre-processing on it.\n\nFor a full list of Dactyl options, use the `-h` parameter.\n\n#### Specifying a Config File\n\nBy default, Dactyl looks for a config file named `dactyl-config.yml` in the current working directory. You can specify an alternate config file with the `-c` or `--config` parameter:\n\n```sh\n$ dactyl_build -c path/to/alt-config.yml\n```\n\nFor more information on configuration, see the `default-config.yml` and the [examples](examples/) folder.\n\n#### Specifying a Target\n\nIf your config file contains more than one **target**, Dactyl builds the first one by default. You can specify a different target by passing its `name` value with the `-t` parameter:\n\n```sh\n$ dactyl_build -t non-default-target\n```\n\n#### Static Files\n\nYour templates may require certain static files (such as JavaScript, CSS, and images) to display properly. Your content may have its own static files (such as diagrams and figures). By default, Dactyl assumes that templates have static files in the `assets/` folder. You can configure this path and also specify one or more paths to static files referenced by your content. When you build, Dactyl copies files from these folders to the output folder by default depending on which mode you're building:\n\n| Build Mode         | Files copied to output folder by default                |\n|:-------------------|:--------------------------------------------------------|\n| HTML               | Both template and content static files                  |\n| PDF                | Neither template nor content static files (cannot be overridden) |\n| Markdown           | Content static files only                               |\n| ElasticSearch JSON | Neither template nor content static files               |\n\nYou can use a commandline flag to explicitly specify what gets copied to the output folder, except in the case of PDF. (In PDF mode, Dactyl writes only the final PDF to the output folder.) The flags are as follows:\n\n| Flag (long version) | Short version | Meaning                                |\n|:--------------------|:--------------|:---------------------------------------|\n| `--copy_static`     | `-s`          | Copy all static files to the out dir.  |\n| `--no_static`       | `-S`          | Don't copy any static files to the out dir. |\n| `--template_static` | `-T`          | Copy only templates' static files to the out dir |\n| `--content_static`  | `-C`          | Copy only the content's static files to the out dir |\n\nThe following config file parameters control what paths Dactyl checks for static content:\n\n| Field | Default | Description |\n|---|---|---|\n| `template_static_path` | `assets/` | Static files belonging to the templates. |\n| `content_static_path` | (None) | Static files belonging to content. This can be a single folder path, as a string, or an array of paths to files or folders. Dactyl copies all files and folders (regardless of whether the current target uses them). |\n\n#### Listing Available Targets\n\nIf you have a lot of targets, it can be hard to remember what the short names for each are. If you provide the `-l` flag, Dactyl will list available targets and then quit without doing anything:\n\n```sh\n$ dactyl_build -l\ntests        Dactyl Test Suite\nrc-install        Ripple Connect v2.6.3 Installation Guide\nrc-release-notes        \nkc-rt-faq        Ripple Trade Migration FAQ\n```\n\n#### Building Markdown\n\nThis mode runs the pre-processor only, so you can generate Markdown files that are more likely to display properly in conventional Markdown parsers (like the one built into GitHub). Use the `--md` flag to output Markdown files, skipping the HTML/PDF templates entirely.\n\n```sh\n$ dactyl_build --md\n```\n\n#### Building Only One Page\n\nIf you only want to build a single page, you can use the `--only` flag, followed by the filename you want to build (either the input filename ending in `.md` or the output filename ending in `.html`):\n\n```sh\ndactyl_build --only index.html --pdf\n```\n\nThis command can be combined with the `--pdf` or `--md` flags. You can also use it with the `--target` setting (in case you want the context from the target even though you're only building one page.)\n\n#### Watch Mode\n\nYou can use the `-w` flag to make Dactyl run continuously, watching for changes to its input templates or markdown files. Whenever it detects that a file has changed, Dactyl automatically rebuilds the output in whatever the current mode is, (HTML, PDF, or Markdown).\n\nTo be detected as a change, the file has to match one of the following patterns:\n\n```\n*.md\n*/code_samples/*\ntemplate-*.html\n```\n\nBeware: some configurations can lead to an infinite loop. (For example, if your output directory is a subdirectory of your content directory and you use Dactyl in `--md` mode.)\n\n**Limitations:** Watch mode can be combined with `--only`, but re-builds the page even when it detects changes to unrelated pages. Watch mode doesn't detect changes to the config file, static files, or filters.\n\nTo stop watching, interrupt the Dactyl process (Ctrl-C in most terminals).\n\n#### ElasticSearch Compatibility\n\nDactyl has the ability to build JSON formatted for upload to [ElasticSearch](https://www.elastic.co/products/elasticsearch) and even upload it directly.\n\nTo build JSON files for upload to ElasticSearch, use the `--es` mode:\n\n```\ndactyl_build --es\n```\n\nThis writes files to the usual output directory using an ElasticSearch JSON template. Dactyl skips any files that do not have a `md` source parameter in this mode. The output filenames are the pages' `html` filenames, except ending in `.json` instead of `.html`. You can specify a custom template for these JSON files using the top-level `default_es_template` field in the config file. This template must be a valid JSON file and has several special properties as described in [ElasticSearch JSON Templates](#elasticsearch-json-templates).\n\nDactyl can also upload these files directly to an ElasticSearch instance, even when building for another mode. For example, to build the HTML version of a target named `filterdemos` but also upload that target's JSON-formatted data to an ElasticSearch instance:\n\n```\ndactyl_build -t filterdemos --html --es_upload https://my-es-instance.example.com:9200\n```\n\nThe parameter to `--es_upload` should be the base URL of your ElasticSearch index. You can omit the parameter to use the default base URL of `http://localhost:9200`.\n\n\n#### ElasticSearch JSON Templates\n\nDactyl has a special format for JSON templates meant for creating ElasticSearch data. These templates must be valid JSON and are processed according to the following rules:\n\n- Any strings in the fields' values are \"preprocessed\" in a similar context to the Jinja2-based Markdown preprocessor. For example, the string `{{currentpage.name}}` evaluates to the page's name.\n- Any object containing the key `__dactyl_eval__` is evaluated as a Python expression. The object is replaced with the results of the expression, with lists becoming JSON arrays and dictionaries becoming JSON objects.\n- The above rules apply recursively to values nested in arrays and objects. All other values are preserved literally.\n\nThe context provided to the preprocessing and to the `__dactyl_eval__` expressions is the same and contains the following:\n\n| Field           | Python Type | Description                                  |\n|:----------------|:------------|:---------------------------------------------|\n| `currentpage`   | `dict`      | The current page definition (usually derived from the config file) |\n| `target`        | `dict`      | The current target definition (usually derived from the config file) |\n| `categories`    | `list`      | A list of unique `category` values used by pages in the current target, in order of appearance. |\n| `page_filters`  | `list`      | A list of the names of Dactyl filters applied to the current page. |\n| `mode`          | `str`       | Always equal to `es` in this context         |\n| `current_time`  | `str`       | The current time, in the `time_format` specified in the config. (Defaults to YYYY-MM-DD) |\n| `bypass_errors` | `bool`      | If `true`, this build is running with the option to continue through errors where possible. |\n\n\n### OpenAPI Specification Parsing\n\nDactyl contains experimental support for automatically generating documentation from an [OpenAPI Specification](https://github.com/OAI/OpenAPI-Specification). Dactyl has partial support for **v3.0.x** of the OpenAPI spec.\n\nFrom the commandline, you can generate documentation for a spec using the `--openapi` option, providing a file path or URL to the spec. For example:\n\n```\ndactyl_build --openapi https://raw.githubusercontent.com/OAI/OpenAPI-Specification/master/examples/v3.0/petstore.yaml\n```\n\nYou can also [add an OpenAPI specification to a config file](#openapi-specifications), where the generated documentation can be part of a larger target that includes other files.\n\n\n\n### Link Checking\n\nThe link checker is a separate script. It assumes that you've already built some documentation to an output path. Use it as follows:\n\n```sh\n$ dactyl_link_checker\n```\n\nThis checks all the files in the output directory for links and confirms that any HTTP(S) links, including relative links to other files, are valid. For anchor links, it checks that an element with the correct ID exists in the target file. It also checks that the `src` of all image tags exists.\n\nIf there are links that are always reported as broken but you don't want to remove (for example, URLs that block Python's user-agent) you can add them to the `known_broken_links` array in the config.\n\nIn quiet mode (`-q`), the link checker still reports in every 30 seconds just so that it doesn't get treated as stalled and killed by continuous integration software (e.g. Jenkins).\n\nTo reduce the number of meaningless failure reports (because a particular website happened to be down momentarily while you ran the link checker), if there are any broken remote links, the link checker waits 2 minutes after finishing and then retries those links in case they came back up. (If they did, they're not considered broken for the link checker's final report.)\n\nYou can also run the link checker in offline mode (`-o`) to skip any remote links and just check that the files and anchors referenced exist in the output directory.\n\nIf you have a page that uses JavaScript or something to generate anchors dynamically, the link checker can't find those anchors (since it doesn't run any JS). You can add such pages to the `ignore_anchors_in` array in your config to skip checking for links that go to anchors in such pages.\n\n\n### Style Checking\n\nThe style checker is experimental. It reads lists of discouraged words and phrases from the `word_substitutions_file` and `phrase_substitutions_file` paths (respectively) in the config. For each such word or phrase that appears in the output HTML (excluding `code`, `pre`, and `tt` elements), it counts and prints a violation, suggesting a replacement based on the word/phrase file.\n\nThe style checker re-generates HTML in-memory (never writing it out). It uses the first target in the config file unless you specify another target with `-t`.\n\nExample usage:\n\n```sh\n$ dactyl_style_checker -t rippledevportal\nStyle Checker - checking all pages in target rippledevportal\nFound 6 issues:\nPage: Gateway Guide\n   Discouraged phrase: in order to (1 instances); suggest 'to' instead.\n   Discouraged phrase: and/or (1 instances); suggest '__ or __ or both' instead.\n   Discouraged word: feasible (1 instances); suggest 'can be done, workable' instead.\n   Discouraged phrase: in an effort to (1 instances); suggest 'to' instead.\n   Discouraged phrase: comply with (1 instances); suggest 'follow' instead.\nPage: Amendments\n   Discouraged phrase: limited number (1 instances); suggest 'limits' instead.\n```\n\nYou can add an exemption to a specific style rule with an HTML comment. The exemption applies to the whole output (HTML) file in which it appears.\n\n```html\nMaybe the word \"will\" is a discouraged word, but you really want to use it here without flagging it as a violation? Adding a comment like this <!-- STYLE_OVERRIDE: will --> makes it so.\n```\n\n## Configuration\n\nMany parts of Dactyl are configurable. An advanced setup would probably have the following folders in your directory structure:\n\n```\n./                      # Top-level dir; this is where you run dactyl_*\n./dactyl-config.yml     # Default config file name\n./content               # Dir containing your .md source files\n---------/*/*.md        # You can sort .md files into subdirs if you like\n---------/static/*      # Static images referencd in your .md files\n./templates/template-*.html # Custom HTML Templates\n./assets                # Directory for static files referenced by templates\n./out                   # Directory where output gets generated. Can be deleted\n```\n\n(All of these paths can be configured.)\n\n### Targets\n\nA target represents a group of pages, which can be built together or concatenated into a single PDF. You should have at least one target defined in the `targets` array of your Dactyl config file. A target definition should consist of a short `name` (used to specify the target in the commandline and elsewhere in the config file) and a human-readable `display_name` (used mostly by templates but also when listing targets on the commandline).\n\nA simple target definition:\n\n```\ntargets:\n    -   name: kc-rt-faq\n        display_name: Ripple Trade Migration FAQ\n```\n\nIn addition to `name` and `display_name`, a target definition can contain arbitrary key-values to be inherited by all pages in this target. Dictionary values are inherited such that keys that aren't set in the page are carried over from the target, recursively. The rest of the time, fields that appear in a page definition take precedence over fields that appear in a target definition.\n\nSome things you may want to set at the target level include `filters` (an array of filters to apply to pages in this target), `template` (template to use when building HTML), and `pdf_template` (template to use when building PDF). You can also use the custom values in templates and preprocessing. Some filters define additional fields that affect the filter's behavior.\n\nThe following field names cannot be inherited: `name`, `display_name`, and `pages`.\n\n### Pages\n\nEach page represents one HTML file in your output. A page can belong to one or more targets. When building a target, all the pages belonging to that target are built in the order they appear in the `pages` array of your Dactyl config file.\n\nExample of a pages definition with two files:\n\n```\npages:\n    -   name: RippleAPI\n        category: References\n        html: reference-rippleapi.html\n        md: https://raw.githubusercontent.com/ripple/ripple-lib/0.17.2/docs/index.md\n        filters:\n            - remove_doctoc\n            - add_version\n        targets:\n            - local\n            - ripple.com\n\n    -   name: rippled\n        category: References\n        html: reference-rippled.html\n        md: reference-rippled.md\n        targets:\n            - local\n            - ripple.com\n```\n\nEach individual page definition can have the following fields:\n\n| Field                    | Type      | Description                           |\n|:-------------------------|:----------|:--------------------------------------|\n| `targets`                | Array     | The short names of the targets that should include this page. |\n| `html`                   | String    | _(Optional)_ The filename where this file should be written in the output directory. If omitted, Dactyl chooses a filename based on the `md` field (if provided), the `name` field (if provided), or the current time (as a last resort). By default, generated filenames flatten the folder structure of the md files. To instead replicate the folder structure of the source documents in auto-generated filenames, add `flatten_default_html_paths: true` to the top level of your Dactyl config file. |\n| `name`                   | String    | _(Optional)_ Human-readable display name for this page. If omitted but `md` is provided, Dactyl tries to guess the right file name by looking at the first two lines of the `md` source file. |\n| `md`                     | String    | _(Optional)_ The markdown filename to parse to generate this page, relative to the **content_path** in your config. If this is not provided, the source file is assumed to be empty. (You might do that if you use a nonstandard `template` for this page.) |\n| `openapi_specification`  | String    | _(Optional)_ The file path or http(s) URL to an OpenAPI v3.0 specification to be parsed into generated documentation. If provided, this entry becomes expanded into a set of several pages that describe the methods and data types defined for the given API. The generated pages inherit the other fields of this page object. **Experimental.** If the path is a relative path, it is evaluated based on the directory Dactyl is called from, not the content directory. |\n| `api_slug`               | String    | _(Optional)_ If this is an `openapi_specification` entry,\n| `category` | String | _(Optional)_ The name of a category to group this page into. This is used by Dactyl's built-in templates to organize the table of contents. |\n| `template`               | String    | _(Optional)_ The filename of a custom [Jinja][] HTML template to use when building this page for HTML, relative to the **template_path** in your config. |\n| `pdf_template`           | String    | _(Optional)_ The filename of a custom [Jinja][] HTML template to use when building this page for PDF, relative to the **template_path** in your config. |\n| `openapi_md_template_path` | String | _(Optional)_ Path to a folder containing [templates to be used for OpenAPI spec parsing](#openapi-spec-templates). If omitted, use the [built-in templates](dactyl/templates/). |\n| `parent`                 | String    | _(Optional)_ The HTML filename of the page to treat as a parent of this one for purposes of hierarchy. If omitted, treat the page as a \"top-level\" page. |\n| ...                      | (Various) | Additional arbitrary key-value pairs as desired. These values can be used by templates or pre-processing. |\n\nIf the file specified by `md` begins with YAML frontmatter, separated by a line of exactly `---`, the frontmatter is used as a basis for these fields. Certain frontmatter fields are adapted from Jekyll format to Dactyl format: for example, `title` gets copied to `name` if the page does not have a `name`.\n\nThe following fields are automatically added after a page has been parsed to HTML. (They're not available when preprocessing or rendering Markdown to HTML, but _are_ available when rendering HTML templates.)\n\n| Field                    | Type      | Description                           |\n|:-------------------------|:----------|:--------------------------------------|\n| `plaintext` | String     | A plaintext-only version of the page's markdown content, with all Markdown and HTML syntax removed. |\n| `headermap` | Dictionary | A mapping of the page's headers to the unique IDs of those headers in the generated HTML version. |\n| `blurb`     | String     | An introductory blurb generated from the page's first paragraph of text. |\n| `children`  | List       | A list of pages, in order of appearance, that refer to this page as their `parent`. Each of these \"child\" pages is a reference to the page definition (dictionary) for that child. |\n| `is_ancestor_of` | Function | A function that takes one argument, the string identifying a potential child page by that child's `html` field. This function returns `True` if this page is a direct or indirect parent of the child page. |\n\n[Jinja]: http://jinja.pocoo.org/\n\n#### OpenAPI Specifications\n\nYou can add a special entry to the `pages` array to represent an OpenAPI v3.0 specification, which will be expanded into several pages representing the methods and data types specified in the file. For example:\n\n```\n-   openapi_specification: https://raw.githubusercontent.com/OAI/OpenAPI-Specification/master/examples/v3.0/petstore.yaml\n    api_slug: petstore\n    foo: bar\n    targets:\n        - baz\n```\n\nThe `api_slug` field is optional, and provides a prefix that gets used for a bunch of file names and stuff. Other fields are inherited by all of the pages the specification builds, which are:\n\n- An \"All Methods\" table of contents, listing every path operation in the `paths` of the OpenAPI specification.\n- \"Tag Methods\" table of contents pages for each `tag` used in the OpenAPI specification.\n- Pages for all \"API Methods\" (path operations) in `paths` of the OpenAPI specification.\n- A \"Data Types\" table of contents, listing every data type defined in the `schema` section of the OpenAPI specification.\n- Individual pages for each data type in the OpenAPI specification's `schema` section.\n\nYou can override the [templates used for generated OpenAPI pages](#openapi-spec-templates) to adjust how the Markdown is generated by providing the path to a different set of templates in the `openapi_md_template_path` field.\n\n\n## Editing\n\nDactyl supports extended Markdown syntax with the [Python-Markdown Extra](https://pythonhosted.org/Markdown/extensions/extra.html) module. This correctly parses most GitHub-Flavored Markdown syntax (such as tables and fenced code blocks) as well as a few other features.\n\n### Pre-processing\n\nDactyl pre-processes Markdown files by treating them as [Jinja][] Templates, so you can use [Jinja's templating syntax](http://jinja.pocoo.org/docs/dev/templates/) to do advanced stuff like include other files or pull in variables from the config or commandline. Dactyl passes the following fields to Markdown files when it pre-processes them:\n\n| Field             | Value                                                    |\n|:------------------|:---------------------------------------------------------|\n| `target`          | The [target](#targets) definition of the current target. |\n| `pages`           | The [array of page definitions](#pages) in the current target. Use this to generate navigation across pages. (The default templates don't do this, but you should.) |\n| `currentpage`     | The definition of the page currently being rendered.     |\n| `categories`      | A de-duplicated array of categories that are used by at least one page in this target, sorted in the order they first appear. |\n| `config`          | The global Dactyl config object. |\n| `content`         | The parsed HTML content of the page currently being rendered. |\n| `current_time`    | The current date as of rendering. The format is YYYY-MM-DD by default; you can also set the `time_format` field to a custom [stftime format string](http://strftime.org/). |\n| `mode`            | The output format: either `html` (default), `pdf`, or `md`. |\n\n\n### Adding Variables from the Commandline\n\nYou can pass in a JSON or YAML-formatted list of variables using `--vars` commandline switch. Any such variables get added as fields of `target` and inherited by `currentpage` in any case where `currentpage` does not already have the same variable name set. For example:\n\n```sh\n$ cat md/vartest.md\nMyvar is: '{{ target.myvar }}'\n\n$ dactyl_build --vars '{\"myvar\":\"foo\"}'\nrendering pages...\nwriting to file: out/index.html...\nPreparing page vartest.md\nreading markdown from file: vartest.md\n... parsing markdown...\n... modifying links for target: default\n... re-rendering HTML from soup...\nwriting to file: out/test_vars.html...\ndone rendering\ncopying static pages...\n\n$ cat out/test_vars.html | grep Myvar\n<p>Myvar is: 'foo'</p></main>\n```\n\nIf argument to `--vars` ends in `.yaml` or `.json`, Dactyl treats the argument as a filename and opens it as a YAML file. (YAML is a superset of JSON, so this works for JSON files.) Otherwise, Dactyl treats the argument as a YAML/JSON object directly. Be sure that the argument is quoted and escaped as necessary based on the commandline shell you use.\n\nYou cannot set the following reserved keys:\n\n- `name`\n- `display_name` (Instead, use the `--title` argument to set the display name of the target on the commandline.)\n- `pages`\n\n\n### Filters\n\nFurthermore, Dactyl supports additional custom post-processing through the use of filters. Filters can operate on the markdown (after it's been pre-processed), on the raw HTML (after it's been parsed), or on a BeautifulSoup object representing the output HTML. Filters can also export functions and values that are available to the preprocessor.\n\nDactyl comes with several filters, which you can enable in your config file. You can also write your own filters. If you do, you must specify the paths to the folder(s) containing your filter files in the `filter_paths` array of the config file.\n\nTo enable a filter for a target or page, set the `filters` field of the config to be an array of filter names, where the filter names are derived from the Python source files in the format `filter_<filtername>.py`. Filter names must be valid Python variable names, so they can't start with a numeral and must contain only alphanumeric and underscore characters.\n\nDactyl automatically runs the following functions from filter files (skipping any that aren't defined):\n\n1. Before running the preprocessor on a page, Dactyl adds all items from each filter's `export` global dictionary to the preprocessor environment.\n2. Dactyl runs the `filter_markdown(md, **kwargs)` function of each filter after the preprocessor. This function receives the preprocessed markdown as a string in the `md` argument and must return a string with the markdown as filtered.\n3. Dactyl runs the `filter_html(html, **kwargs)` function after the markdown processor. This function receives the parsed markdown content as an HTML string in the `html` argument and must return a string with the HTML as filtered.\n4. Dactyl runs the `filter_soup(soup, **kwargs)` function after the HTML filters. This function is expected to directly modify the `soup` argument, which contains a [BeautifulSoup 4 object](https://www.crummy.com/software/BeautifulSoup/bs4/doc/) representing the HTML contents.\n\nThe keyword arguments (`**kwargs`) for the functions may change in future versions. As of Dactyl 0.5.0, the arguments are as follows:\n\n| Field          | Type       | Description                                    |\n|:---------------|:-----------|:-----------------------------------------------|\n| `currentpage`  | Dict       | The current page, as defined in the config file plus values inherited from the current target and any processing or calculations. (For example, Dactyl automatically adds a `name` field if one isn't present.) |\n| `categories`   | List       | A de-duplicated, ordered list of `category` fields present among pages in this target. |\n| `pages`        | List       | A list of page objects for all pages in the current target, in the same order they appear in the config file. |\n| `target`       | Dict       | The current target definition, as derived from the config file. |\n| `current_time` | String     | The time this build was started. The format is defined by your config's global `time_format` field (in [stftime format](http://strftime.org/)), defaulting to YYYY-MM-DD. |\n| `mode`         | String     | Either `html`, `pdf`, or `md` depending on what output Dactyl is building. |\n| `config`       | Dict       | The global config object, based on the config file plus any commandline switches. |\n| `logger`       | [Logger][] | The logging object Dactyl uses, with the verbosity set to match user input. |\n\n[Logger]: https://docs.python.org/3/library/logging.html#logger-objects\n\n\nSee the [examples](examples/) for examples of how to do many of these things.\n\n## Templates\n\nDactyl provides the following information to templates, which you can access with Jinja's templating syntax (e.g. `{{ target.display_name }}`):\n\n| Field             | Value                                                    |\n|:------------------|:---------------------------------------------------------|\n| `target`          | The [target](#targets) definition of the current target. |\n| `pages`           | The [array of page definitions](#pages) in the current target. Use this to generate navigation across pages. (The default templates don't do this, but you should.) |\n| `currentpage`     | The definition of the page currently being rendered.     |\n| `categories`      | A de-duplicated array of categories that are used by at least one page in this target, sorted in the order they first appear. |\n| `config`          | The global Dactyl config object. |\n| `content`         | The parsed HTML content of the page currently being rendered. |\n| `current_time`    | The current date as of rendering. The format is YYYY-MM-DD by default; you can also set the `time_format` field to a custom [stftime format string](http://strftime.org/). |\n| `mode`            | The output format: either `html` (default), `pdf`, or `md`. |\n| `page_toc`        | A table of contents generated from the current page's headers. Wrap this in a `<ul>` element. |\n| `sidebar_content` | (Deprecated alias for `page_toc`.) |\n\n### OpenAPI Spec Templates\n\nWhen generating docs from an API specification, Dactyl generates a Markdown version for each of these pages first, then uses that as the content for the HTML version as it does when parsing normal Markdown pages. You can use your own templates instead. The templates must use the same filenames as the [built-in OpenAPI templates](dactyl/templates/), which match the pattern `template-openapi_*.md`.\n\n<!-- TODO: Additional documentation on what fields are available to each template. -->\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/ripple/dactyl", "keywords": "documentation", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "dactyl", "package_url": "https://pypi.org/project/dactyl/", "platform": "", "project_url": "https://pypi.org/project/dactyl/", "project_urls": {"Homepage": "https://github.com/ripple/dactyl"}, "release_url": "https://pypi.org/project/dactyl/0.10.2/", "requires_dist": ["argparse", "beautifulsoup4", "jinja2", "Markdown", "ruamel.yaml", "requests", "watchdog"], "requires_python": "", "summary": "Tools to generate documentation.", "version": "0.10.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Dactyl</h1>\n<p>Documentation tools for enterprise-quality documentation from Markdown source. Dactyl has advanced features to enable <a href=\"https://en.wikipedia.org/wiki/Single_source_publishing\" rel=\"nofollow\">single-sourcing</a> and an extensible syntax for building well-organized, visually attractive docs. It generates output in HTML (natively), and can make PDFs if you have <a href=\"http://www.princexml.com/\" rel=\"nofollow\">Prince</a> installed.</p>\n<h2>Installation</h2>\n<p>Dactyl requires <a href=\"https://python.org/\" rel=\"nofollow\">Python 3</a>. Install with <a href=\"https://pip.pypa.io/en/stable/\" rel=\"nofollow\">pip</a>:</p>\n<pre><code>sudo pip3 install dactyl\n</code></pre>\n<p>Or a local install in a virtualenv:</p>\n<pre><span class=\"c1\"># Create an activate a virtualenv so the package and dependencies are localized</span>\nvirtualenv -p <span class=\"sb\">`</span>which python3<span class=\"sb\">`</span> venv_dactyl\n<span class=\"nb\">source</span> venv_dactyl/bin/activate\n\n<span class=\"c1\"># Check out this repo</span>\ngit clone https://github.com/ripple/dactyl\n\n<span class=\"c1\"># Install</span>\npip3 install dactyl/\n\n<span class=\"c1\"># Where 'dactyl/' is the top level directory of the repo, containing setup.py.</span>\n<span class=\"c1\"># And note the trailing '/' which tells pip to use a local directory to install it.</span>\n</pre>\n<h2>Usage</h2>\n<p>Simple (\"Ad-Hoc\") usage:</p>\n<pre>$ dactyl_build --pages input1.md input2.md\n</pre>\n<p>By default, the resulting HTML pages are written to a folder called <code>out/</code> in the current working directory. You can specify a different output path in the config file or by using the <code>-o</code> parameter.</p>\n<h3>Building PDF</h3>\n<p>Dactyl generates PDFs by making temporary HTML files and running <a href=\"http://www.princexml.com/\" rel=\"nofollow\">Prince</a>. Use the <code>--pdf</code> command to generate a PDF. Dactyl tries to come up with a sensible output filename by default, or you can provide one (which must end in <code>.pdf</code>):</p>\n<pre>$ dactyl_build --pages input1.md input2.md --pdf MyGuide.pdf\n</pre>\n<h3>Advanced Usage</h3>\n<p>Dactyl is intended to be used with a config file containing a list of pages to parse. Pages are grouped into \"targets\" that represent a group of documents to be built together; a page can belong to multiple targets, and can even contain conditional syntax so that it builds slightly different depending on the target in question. Targets and pages can also use different templates from each other, and pages can inherit semi-arbitrary key/value pairs from the targets.</p>\n<p>For more information on configuration, see the <code>default-config.yml</code> and the <a href=\"examples/\" rel=\"nofollow\">examples</a> folder.</p>\n<p>The input pages in the config file should be specified relative to the <code>content_path</code>, which is <code>content/</code> by default. You can also specify a URL to pull in a markdown file from a remote source, but if you do, Dactyl won't run any pre-processing on it.</p>\n<p>For a full list of Dactyl options, use the <code>-h</code> parameter.</p>\n<h4>Specifying a Config File</h4>\n<p>By default, Dactyl looks for a config file named <code>dactyl-config.yml</code> in the current working directory. You can specify an alternate config file with the <code>-c</code> or <code>--config</code> parameter:</p>\n<pre>$ dactyl_build -c path/to/alt-config.yml\n</pre>\n<p>For more information on configuration, see the <code>default-config.yml</code> and the <a href=\"examples/\" rel=\"nofollow\">examples</a> folder.</p>\n<h4>Specifying a Target</h4>\n<p>If your config file contains more than one <strong>target</strong>, Dactyl builds the first one by default. You can specify a different target by passing its <code>name</code> value with the <code>-t</code> parameter:</p>\n<pre>$ dactyl_build -t non-default-target\n</pre>\n<h4>Static Files</h4>\n<p>Your templates may require certain static files (such as JavaScript, CSS, and images) to display properly. Your content may have its own static files (such as diagrams and figures). By default, Dactyl assumes that templates have static files in the <code>assets/</code> folder. You can configure this path and also specify one or more paths to static files referenced by your content. When you build, Dactyl copies files from these folders to the output folder by default depending on which mode you're building:</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Build Mode</th>\n<th align=\"left\">Files copied to output folder by default</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\">HTML</td>\n<td align=\"left\">Both template and content static files</td>\n</tr>\n<tr>\n<td align=\"left\">PDF</td>\n<td align=\"left\">Neither template nor content static files (cannot be overridden)</td>\n</tr>\n<tr>\n<td align=\"left\">Markdown</td>\n<td align=\"left\">Content static files only</td>\n</tr>\n<tr>\n<td align=\"left\">ElasticSearch JSON</td>\n<td align=\"left\">Neither template nor content static files</td>\n</tr></tbody></table>\n<p>You can use a commandline flag to explicitly specify what gets copied to the output folder, except in the case of PDF. (In PDF mode, Dactyl writes only the final PDF to the output folder.) The flags are as follows:</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Flag (long version)</th>\n<th align=\"left\">Short version</th>\n<th align=\"left\">Meaning</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\"><code>--copy_static</code></td>\n<td align=\"left\"><code>-s</code></td>\n<td align=\"left\">Copy all static files to the out dir.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>--no_static</code></td>\n<td align=\"left\"><code>-S</code></td>\n<td align=\"left\">Don't copy any static files to the out dir.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>--template_static</code></td>\n<td align=\"left\"><code>-T</code></td>\n<td align=\"left\">Copy only templates' static files to the out dir</td>\n</tr>\n<tr>\n<td align=\"left\"><code>--content_static</code></td>\n<td align=\"left\"><code>-C</code></td>\n<td align=\"left\">Copy only the content's static files to the out dir</td>\n</tr></tbody></table>\n<p>The following config file parameters control what paths Dactyl checks for static content:</p>\n<table>\n<thead>\n<tr>\n<th>Field</th>\n<th>Default</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>template_static_path</code></td>\n<td><code>assets/</code></td>\n<td>Static files belonging to the templates.</td>\n</tr>\n<tr>\n<td><code>content_static_path</code></td>\n<td>(None)</td>\n<td>Static files belonging to content. This can be a single folder path, as a string, or an array of paths to files or folders. Dactyl copies all files and folders (regardless of whether the current target uses them).</td>\n</tr></tbody></table>\n<h4>Listing Available Targets</h4>\n<p>If you have a lot of targets, it can be hard to remember what the short names for each are. If you provide the <code>-l</code> flag, Dactyl will list available targets and then quit without doing anything:</p>\n<pre>$ dactyl_build -l\ntests        Dactyl Test Suite\nrc-install        Ripple Connect v2.6.3 Installation Guide\nrc-release-notes        \nkc-rt-faq        Ripple Trade Migration FAQ\n</pre>\n<h4>Building Markdown</h4>\n<p>This mode runs the pre-processor only, so you can generate Markdown files that are more likely to display properly in conventional Markdown parsers (like the one built into GitHub). Use the <code>--md</code> flag to output Markdown files, skipping the HTML/PDF templates entirely.</p>\n<pre>$ dactyl_build --md\n</pre>\n<h4>Building Only One Page</h4>\n<p>If you only want to build a single page, you can use the <code>--only</code> flag, followed by the filename you want to build (either the input filename ending in <code>.md</code> or the output filename ending in <code>.html</code>):</p>\n<pre>dactyl_build --only index.html --pdf\n</pre>\n<p>This command can be combined with the <code>--pdf</code> or <code>--md</code> flags. You can also use it with the <code>--target</code> setting (in case you want the context from the target even though you're only building one page.)</p>\n<h4>Watch Mode</h4>\n<p>You can use the <code>-w</code> flag to make Dactyl run continuously, watching for changes to its input templates or markdown files. Whenever it detects that a file has changed, Dactyl automatically rebuilds the output in whatever the current mode is, (HTML, PDF, or Markdown).</p>\n<p>To be detected as a change, the file has to match one of the following patterns:</p>\n<pre><code>*.md\n*/code_samples/*\ntemplate-*.html\n</code></pre>\n<p>Beware: some configurations can lead to an infinite loop. (For example, if your output directory is a subdirectory of your content directory and you use Dactyl in <code>--md</code> mode.)</p>\n<p><strong>Limitations:</strong> Watch mode can be combined with <code>--only</code>, but re-builds the page even when it detects changes to unrelated pages. Watch mode doesn't detect changes to the config file, static files, or filters.</p>\n<p>To stop watching, interrupt the Dactyl process (Ctrl-C in most terminals).</p>\n<h4>ElasticSearch Compatibility</h4>\n<p>Dactyl has the ability to build JSON formatted for upload to <a href=\"https://www.elastic.co/products/elasticsearch\" rel=\"nofollow\">ElasticSearch</a> and even upload it directly.</p>\n<p>To build JSON files for upload to ElasticSearch, use the <code>--es</code> mode:</p>\n<pre><code>dactyl_build --es\n</code></pre>\n<p>This writes files to the usual output directory using an ElasticSearch JSON template. Dactyl skips any files that do not have a <code>md</code> source parameter in this mode. The output filenames are the pages' <code>html</code> filenames, except ending in <code>.json</code> instead of <code>.html</code>. You can specify a custom template for these JSON files using the top-level <code>default_es_template</code> field in the config file. This template must be a valid JSON file and has several special properties as described in <a href=\"#elasticsearch-json-templates\" rel=\"nofollow\">ElasticSearch JSON Templates</a>.</p>\n<p>Dactyl can also upload these files directly to an ElasticSearch instance, even when building for another mode. For example, to build the HTML version of a target named <code>filterdemos</code> but also upload that target's JSON-formatted data to an ElasticSearch instance:</p>\n<pre><code>dactyl_build -t filterdemos --html --es_upload https://my-es-instance.example.com:9200\n</code></pre>\n<p>The parameter to <code>--es_upload</code> should be the base URL of your ElasticSearch index. You can omit the parameter to use the default base URL of <code>http://localhost:9200</code>.</p>\n<h4>ElasticSearch JSON Templates</h4>\n<p>Dactyl has a special format for JSON templates meant for creating ElasticSearch data. These templates must be valid JSON and are processed according to the following rules:</p>\n<ul>\n<li>Any strings in the fields' values are \"preprocessed\" in a similar context to the Jinja2-based Markdown preprocessor. For example, the string <code>{{currentpage.name}}</code> evaluates to the page's name.</li>\n<li>Any object containing the key <code>__dactyl_eval__</code> is evaluated as a Python expression. The object is replaced with the results of the expression, with lists becoming JSON arrays and dictionaries becoming JSON objects.</li>\n<li>The above rules apply recursively to values nested in arrays and objects. All other values are preserved literally.</li>\n</ul>\n<p>The context provided to the preprocessing and to the <code>__dactyl_eval__</code> expressions is the same and contains the following:</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Field</th>\n<th align=\"left\">Python Type</th>\n<th align=\"left\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\"><code>currentpage</code></td>\n<td align=\"left\"><code>dict</code></td>\n<td align=\"left\">The current page definition (usually derived from the config file)</td>\n</tr>\n<tr>\n<td align=\"left\"><code>target</code></td>\n<td align=\"left\"><code>dict</code></td>\n<td align=\"left\">The current target definition (usually derived from the config file)</td>\n</tr>\n<tr>\n<td align=\"left\"><code>categories</code></td>\n<td align=\"left\"><code>list</code></td>\n<td align=\"left\">A list of unique <code>category</code> values used by pages in the current target, in order of appearance.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>page_filters</code></td>\n<td align=\"left\"><code>list</code></td>\n<td align=\"left\">A list of the names of Dactyl filters applied to the current page.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>mode</code></td>\n<td align=\"left\"><code>str</code></td>\n<td align=\"left\">Always equal to <code>es</code> in this context</td>\n</tr>\n<tr>\n<td align=\"left\"><code>current_time</code></td>\n<td align=\"left\"><code>str</code></td>\n<td align=\"left\">The current time, in the <code>time_format</code> specified in the config. (Defaults to YYYY-MM-DD)</td>\n</tr>\n<tr>\n<td align=\"left\"><code>bypass_errors</code></td>\n<td align=\"left\"><code>bool</code></td>\n<td align=\"left\">If <code>true</code>, this build is running with the option to continue through errors where possible.</td>\n</tr></tbody></table>\n<h3>OpenAPI Specification Parsing</h3>\n<p>Dactyl contains experimental support for automatically generating documentation from an <a href=\"https://github.com/OAI/OpenAPI-Specification\" rel=\"nofollow\">OpenAPI Specification</a>. Dactyl has partial support for <strong>v3.0.x</strong> of the OpenAPI spec.</p>\n<p>From the commandline, you can generate documentation for a spec using the <code>--openapi</code> option, providing a file path or URL to the spec. For example:</p>\n<pre><code>dactyl_build --openapi https://raw.githubusercontent.com/OAI/OpenAPI-Specification/master/examples/v3.0/petstore.yaml\n</code></pre>\n<p>You can also <a href=\"#openapi-specifications\" rel=\"nofollow\">add an OpenAPI specification to a config file</a>, where the generated documentation can be part of a larger target that includes other files.</p>\n<h3>Link Checking</h3>\n<p>The link checker is a separate script. It assumes that you've already built some documentation to an output path. Use it as follows:</p>\n<pre>$ dactyl_link_checker\n</pre>\n<p>This checks all the files in the output directory for links and confirms that any HTTP(S) links, including relative links to other files, are valid. For anchor links, it checks that an element with the correct ID exists in the target file. It also checks that the <code>src</code> of all image tags exists.</p>\n<p>If there are links that are always reported as broken but you don't want to remove (for example, URLs that block Python's user-agent) you can add them to the <code>known_broken_links</code> array in the config.</p>\n<p>In quiet mode (<code>-q</code>), the link checker still reports in every 30 seconds just so that it doesn't get treated as stalled and killed by continuous integration software (e.g. Jenkins).</p>\n<p>To reduce the number of meaningless failure reports (because a particular website happened to be down momentarily while you ran the link checker), if there are any broken remote links, the link checker waits 2 minutes after finishing and then retries those links in case they came back up. (If they did, they're not considered broken for the link checker's final report.)</p>\n<p>You can also run the link checker in offline mode (<code>-o</code>) to skip any remote links and just check that the files and anchors referenced exist in the output directory.</p>\n<p>If you have a page that uses JavaScript or something to generate anchors dynamically, the link checker can't find those anchors (since it doesn't run any JS). You can add such pages to the <code>ignore_anchors_in</code> array in your config to skip checking for links that go to anchors in such pages.</p>\n<h3>Style Checking</h3>\n<p>The style checker is experimental. It reads lists of discouraged words and phrases from the <code>word_substitutions_file</code> and <code>phrase_substitutions_file</code> paths (respectively) in the config. For each such word or phrase that appears in the output HTML (excluding <code>code</code>, <code>pre</code>, and <code>tt</code> elements), it counts and prints a violation, suggesting a replacement based on the word/phrase file.</p>\n<p>The style checker re-generates HTML in-memory (never writing it out). It uses the first target in the config file unless you specify another target with <code>-t</code>.</p>\n<p>Example usage:</p>\n<pre>$ dactyl_style_checker -t rippledevportal\nStyle Checker - checking all pages in target rippledevportal\nFound <span class=\"m\">6</span> issues:\nPage: Gateway Guide\n   Discouraged phrase: in order to <span class=\"o\">(</span><span class=\"m\">1</span> instances<span class=\"o\">)</span><span class=\"p\">;</span> suggest <span class=\"s1\">'to'</span> instead.\n   Discouraged phrase: and/or <span class=\"o\">(</span><span class=\"m\">1</span> instances<span class=\"o\">)</span><span class=\"p\">;</span> suggest <span class=\"s1\">'__ or __ or both'</span> instead.\n   Discouraged word: feasible <span class=\"o\">(</span><span class=\"m\">1</span> instances<span class=\"o\">)</span><span class=\"p\">;</span> suggest <span class=\"s1\">'can be done, workable'</span> instead.\n   Discouraged phrase: in an effort to <span class=\"o\">(</span><span class=\"m\">1</span> instances<span class=\"o\">)</span><span class=\"p\">;</span> suggest <span class=\"s1\">'to'</span> instead.\n   Discouraged phrase: comply with <span class=\"o\">(</span><span class=\"m\">1</span> instances<span class=\"o\">)</span><span class=\"p\">;</span> suggest <span class=\"s1\">'follow'</span> instead.\nPage: Amendments\n   Discouraged phrase: limited number <span class=\"o\">(</span><span class=\"m\">1</span> instances<span class=\"o\">)</span><span class=\"p\">;</span> suggest <span class=\"s1\">'limits'</span> instead.\n</pre>\n<p>You can add an exemption to a specific style rule with an HTML comment. The exemption applies to the whole output (HTML) file in which it appears.</p>\n<pre>Maybe the word \"will\" is a discouraged word, but you really want to use it here without flagging it as a violation? Adding a comment like this <span class=\"c\">&lt;!-- STYLE_OVERRIDE: will --&gt;</span> makes it so.\n</pre>\n<h2>Configuration</h2>\n<p>Many parts of Dactyl are configurable. An advanced setup would probably have the following folders in your directory structure:</p>\n<pre><code>./                      # Top-level dir; this is where you run dactyl_*\n./dactyl-config.yml     # Default config file name\n./content               # Dir containing your .md source files\n---------/*/*.md        # You can sort .md files into subdirs if you like\n---------/static/*      # Static images referencd in your .md files\n./templates/template-*.html # Custom HTML Templates\n./assets                # Directory for static files referenced by templates\n./out                   # Directory where output gets generated. Can be deleted\n</code></pre>\n<p>(All of these paths can be configured.)</p>\n<h3>Targets</h3>\n<p>A target represents a group of pages, which can be built together or concatenated into a single PDF. You should have at least one target defined in the <code>targets</code> array of your Dactyl config file. A target definition should consist of a short <code>name</code> (used to specify the target in the commandline and elsewhere in the config file) and a human-readable <code>display_name</code> (used mostly by templates but also when listing targets on the commandline).</p>\n<p>A simple target definition:</p>\n<pre><code>targets:\n    -   name: kc-rt-faq\n        display_name: Ripple Trade Migration FAQ\n</code></pre>\n<p>In addition to <code>name</code> and <code>display_name</code>, a target definition can contain arbitrary key-values to be inherited by all pages in this target. Dictionary values are inherited such that keys that aren't set in the page are carried over from the target, recursively. The rest of the time, fields that appear in a page definition take precedence over fields that appear in a target definition.</p>\n<p>Some things you may want to set at the target level include <code>filters</code> (an array of filters to apply to pages in this target), <code>template</code> (template to use when building HTML), and <code>pdf_template</code> (template to use when building PDF). You can also use the custom values in templates and preprocessing. Some filters define additional fields that affect the filter's behavior.</p>\n<p>The following field names cannot be inherited: <code>name</code>, <code>display_name</code>, and <code>pages</code>.</p>\n<h3>Pages</h3>\n<p>Each page represents one HTML file in your output. A page can belong to one or more targets. When building a target, all the pages belonging to that target are built in the order they appear in the <code>pages</code> array of your Dactyl config file.</p>\n<p>Example of a pages definition with two files:</p>\n<pre><code>pages:\n    -   name: RippleAPI\n        category: References\n        html: reference-rippleapi.html\n        md: https://raw.githubusercontent.com/ripple/ripple-lib/0.17.2/docs/index.md\n        filters:\n            - remove_doctoc\n            - add_version\n        targets:\n            - local\n            - ripple.com\n\n    -   name: rippled\n        category: References\n        html: reference-rippled.html\n        md: reference-rippled.md\n        targets:\n            - local\n            - ripple.com\n</code></pre>\n<p>Each individual page definition can have the following fields:</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Field</th>\n<th align=\"left\">Type</th>\n<th align=\"left\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\"><code>targets</code></td>\n<td align=\"left\">Array</td>\n<td align=\"left\">The short names of the targets that should include this page.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>html</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\"><em>(Optional)</em> The filename where this file should be written in the output directory. If omitted, Dactyl chooses a filename based on the <code>md</code> field (if provided), the <code>name</code> field (if provided), or the current time (as a last resort). By default, generated filenames flatten the folder structure of the md files. To instead replicate the folder structure of the source documents in auto-generated filenames, add <code>flatten_default_html_paths: true</code> to the top level of your Dactyl config file.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>name</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\"><em>(Optional)</em> Human-readable display name for this page. If omitted but <code>md</code> is provided, Dactyl tries to guess the right file name by looking at the first two lines of the <code>md</code> source file.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>md</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\"><em>(Optional)</em> The markdown filename to parse to generate this page, relative to the <strong>content_path</strong> in your config. If this is not provided, the source file is assumed to be empty. (You might do that if you use a nonstandard <code>template</code> for this page.)</td>\n</tr>\n<tr>\n<td align=\"left\"><code>openapi_specification</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\"><em>(Optional)</em> The file path or http(s) URL to an OpenAPI v3.0 specification to be parsed into generated documentation. If provided, this entry becomes expanded into a set of several pages that describe the methods and data types defined for the given API. The generated pages inherit the other fields of this page object. <strong>Experimental.</strong> If the path is a relative path, it is evaluated based on the directory Dactyl is called from, not the content directory.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>api_slug</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\"><em>(Optional)</em> If this is an <code>openapi_specification</code> entry,</td>\n</tr>\n<tr>\n<td align=\"left\"><code>category</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\"><em>(Optional)</em> The name of a category to group this page into. This is used by Dactyl's built-in templates to organize the table of contents.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>template</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\"><em>(Optional)</em> The filename of a custom <a href=\"http://jinja.pocoo.org/\" rel=\"nofollow\">Jinja</a> HTML template to use when building this page for HTML, relative to the <strong>template_path</strong> in your config.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>pdf_template</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\"><em>(Optional)</em> The filename of a custom <a href=\"http://jinja.pocoo.org/\" rel=\"nofollow\">Jinja</a> HTML template to use when building this page for PDF, relative to the <strong>template_path</strong> in your config.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>openapi_md_template_path</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\"><em>(Optional)</em> Path to a folder containing <a href=\"#openapi-spec-templates\" rel=\"nofollow\">templates to be used for OpenAPI spec parsing</a>. If omitted, use the <a href=\"dactyl/templates/\" rel=\"nofollow\">built-in templates</a>.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>parent</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\"><em>(Optional)</em> The HTML filename of the page to treat as a parent of this one for purposes of hierarchy. If omitted, treat the page as a \"top-level\" page.</td>\n</tr>\n<tr>\n<td align=\"left\">...</td>\n<td align=\"left\">(Various)</td>\n<td align=\"left\">Additional arbitrary key-value pairs as desired. These values can be used by templates or pre-processing.</td>\n</tr></tbody></table>\n<p>If the file specified by <code>md</code> begins with YAML frontmatter, separated by a line of exactly <code>---</code>, the frontmatter is used as a basis for these fields. Certain frontmatter fields are adapted from Jekyll format to Dactyl format: for example, <code>title</code> gets copied to <code>name</code> if the page does not have a <code>name</code>.</p>\n<p>The following fields are automatically added after a page has been parsed to HTML. (They're not available when preprocessing or rendering Markdown to HTML, but <em>are</em> available when rendering HTML templates.)</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Field</th>\n<th align=\"left\">Type</th>\n<th align=\"left\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\"><code>plaintext</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\">A plaintext-only version of the page's markdown content, with all Markdown and HTML syntax removed.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>headermap</code></td>\n<td align=\"left\">Dictionary</td>\n<td align=\"left\">A mapping of the page's headers to the unique IDs of those headers in the generated HTML version.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>blurb</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\">An introductory blurb generated from the page's first paragraph of text.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>children</code></td>\n<td align=\"left\">List</td>\n<td align=\"left\">A list of pages, in order of appearance, that refer to this page as their <code>parent</code>. Each of these \"child\" pages is a reference to the page definition (dictionary) for that child.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>is_ancestor_of</code></td>\n<td align=\"left\">Function</td>\n<td align=\"left\">A function that takes one argument, the string identifying a potential child page by that child's <code>html</code> field. This function returns <code>True</code> if this page is a direct or indirect parent of the child page.</td>\n</tr></tbody></table>\n<h4>OpenAPI Specifications</h4>\n<p>You can add a special entry to the <code>pages</code> array to represent an OpenAPI v3.0 specification, which will be expanded into several pages representing the methods and data types specified in the file. For example:</p>\n<pre><code>-   openapi_specification: https://raw.githubusercontent.com/OAI/OpenAPI-Specification/master/examples/v3.0/petstore.yaml\n    api_slug: petstore\n    foo: bar\n    targets:\n        - baz\n</code></pre>\n<p>The <code>api_slug</code> field is optional, and provides a prefix that gets used for a bunch of file names and stuff. Other fields are inherited by all of the pages the specification builds, which are:</p>\n<ul>\n<li>An \"All Methods\" table of contents, listing every path operation in the <code>paths</code> of the OpenAPI specification.</li>\n<li>\"Tag Methods\" table of contents pages for each <code>tag</code> used in the OpenAPI specification.</li>\n<li>Pages for all \"API Methods\" (path operations) in <code>paths</code> of the OpenAPI specification.</li>\n<li>A \"Data Types\" table of contents, listing every data type defined in the <code>schema</code> section of the OpenAPI specification.</li>\n<li>Individual pages for each data type in the OpenAPI specification's <code>schema</code> section.</li>\n</ul>\n<p>You can override the <a href=\"#openapi-spec-templates\" rel=\"nofollow\">templates used for generated OpenAPI pages</a> to adjust how the Markdown is generated by providing the path to a different set of templates in the <code>openapi_md_template_path</code> field.</p>\n<h2>Editing</h2>\n<p>Dactyl supports extended Markdown syntax with the <a href=\"https://pythonhosted.org/Markdown/extensions/extra.html\" rel=\"nofollow\">Python-Markdown Extra</a> module. This correctly parses most GitHub-Flavored Markdown syntax (such as tables and fenced code blocks) as well as a few other features.</p>\n<h3>Pre-processing</h3>\n<p>Dactyl pre-processes Markdown files by treating them as <a href=\"http://jinja.pocoo.org/\" rel=\"nofollow\">Jinja</a> Templates, so you can use <a href=\"http://jinja.pocoo.org/docs/dev/templates/\" rel=\"nofollow\">Jinja's templating syntax</a> to do advanced stuff like include other files or pull in variables from the config or commandline. Dactyl passes the following fields to Markdown files when it pre-processes them:</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Field</th>\n<th align=\"left\">Value</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\"><code>target</code></td>\n<td align=\"left\">The <a href=\"#targets\" rel=\"nofollow\">target</a> definition of the current target.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>pages</code></td>\n<td align=\"left\">The <a href=\"#pages\" rel=\"nofollow\">array of page definitions</a> in the current target. Use this to generate navigation across pages. (The default templates don't do this, but you should.)</td>\n</tr>\n<tr>\n<td align=\"left\"><code>currentpage</code></td>\n<td align=\"left\">The definition of the page currently being rendered.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>categories</code></td>\n<td align=\"left\">A de-duplicated array of categories that are used by at least one page in this target, sorted in the order they first appear.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>config</code></td>\n<td align=\"left\">The global Dactyl config object.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>content</code></td>\n<td align=\"left\">The parsed HTML content of the page currently being rendered.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>current_time</code></td>\n<td align=\"left\">The current date as of rendering. The format is YYYY-MM-DD by default; you can also set the <code>time_format</code> field to a custom <a href=\"http://strftime.org/\" rel=\"nofollow\">stftime format string</a>.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>mode</code></td>\n<td align=\"left\">The output format: either <code>html</code> (default), <code>pdf</code>, or <code>md</code>.</td>\n</tr></tbody></table>\n<h3>Adding Variables from the Commandline</h3>\n<p>You can pass in a JSON or YAML-formatted list of variables using <code>--vars</code> commandline switch. Any such variables get added as fields of <code>target</code> and inherited by <code>currentpage</code> in any case where <code>currentpage</code> does not already have the same variable name set. For example:</p>\n<pre>$ cat md/vartest.md\nMyvar is: <span class=\"s1\">'{{ target.myvar }}'</span>\n\n$ dactyl_build --vars <span class=\"s1\">'{\"myvar\":\"foo\"}'</span>\nrendering pages...\nwriting to file: out/index.html...\nPreparing page vartest.md\nreading markdown from file: vartest.md\n... parsing markdown...\n... modifying links <span class=\"k\">for</span> target: default\n... re-rendering HTML from soup...\nwriting to file: out/test_vars.html...\n<span class=\"k\">done</span> rendering\ncopying static pages...\n\n$ cat out/test_vars.html <span class=\"p\">|</span> grep Myvar\n&lt;p&gt;Myvar is: <span class=\"s1\">'foo'</span>&lt;/p&gt;&lt;/main&gt;\n</pre>\n<p>If argument to <code>--vars</code> ends in <code>.yaml</code> or <code>.json</code>, Dactyl treats the argument as a filename and opens it as a YAML file. (YAML is a superset of JSON, so this works for JSON files.) Otherwise, Dactyl treats the argument as a YAML/JSON object directly. Be sure that the argument is quoted and escaped as necessary based on the commandline shell you use.</p>\n<p>You cannot set the following reserved keys:</p>\n<ul>\n<li><code>name</code></li>\n<li><code>display_name</code> (Instead, use the <code>--title</code> argument to set the display name of the target on the commandline.)</li>\n<li><code>pages</code></li>\n</ul>\n<h3>Filters</h3>\n<p>Furthermore, Dactyl supports additional custom post-processing through the use of filters. Filters can operate on the markdown (after it's been pre-processed), on the raw HTML (after it's been parsed), or on a BeautifulSoup object representing the output HTML. Filters can also export functions and values that are available to the preprocessor.</p>\n<p>Dactyl comes with several filters, which you can enable in your config file. You can also write your own filters. If you do, you must specify the paths to the folder(s) containing your filter files in the <code>filter_paths</code> array of the config file.</p>\n<p>To enable a filter for a target or page, set the <code>filters</code> field of the config to be an array of filter names, where the filter names are derived from the Python source files in the format <code>filter_&lt;filtername&gt;.py</code>. Filter names must be valid Python variable names, so they can't start with a numeral and must contain only alphanumeric and underscore characters.</p>\n<p>Dactyl automatically runs the following functions from filter files (skipping any that aren't defined):</p>\n<ol>\n<li>Before running the preprocessor on a page, Dactyl adds all items from each filter's <code>export</code> global dictionary to the preprocessor environment.</li>\n<li>Dactyl runs the <code>filter_markdown(md, **kwargs)</code> function of each filter after the preprocessor. This function receives the preprocessed markdown as a string in the <code>md</code> argument and must return a string with the markdown as filtered.</li>\n<li>Dactyl runs the <code>filter_html(html, **kwargs)</code> function after the markdown processor. This function receives the parsed markdown content as an HTML string in the <code>html</code> argument and must return a string with the HTML as filtered.</li>\n<li>Dactyl runs the <code>filter_soup(soup, **kwargs)</code> function after the HTML filters. This function is expected to directly modify the <code>soup</code> argument, which contains a <a href=\"https://www.crummy.com/software/BeautifulSoup/bs4/doc/\" rel=\"nofollow\">BeautifulSoup 4 object</a> representing the HTML contents.</li>\n</ol>\n<p>The keyword arguments (<code>**kwargs</code>) for the functions may change in future versions. As of Dactyl 0.5.0, the arguments are as follows:</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Field</th>\n<th align=\"left\">Type</th>\n<th align=\"left\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\"><code>currentpage</code></td>\n<td align=\"left\">Dict</td>\n<td align=\"left\">The current page, as defined in the config file plus values inherited from the current target and any processing or calculations. (For example, Dactyl automatically adds a <code>name</code> field if one isn't present.)</td>\n</tr>\n<tr>\n<td align=\"left\"><code>categories</code></td>\n<td align=\"left\">List</td>\n<td align=\"left\">A de-duplicated, ordered list of <code>category</code> fields present among pages in this target.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>pages</code></td>\n<td align=\"left\">List</td>\n<td align=\"left\">A list of page objects for all pages in the current target, in the same order they appear in the config file.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>target</code></td>\n<td align=\"left\">Dict</td>\n<td align=\"left\">The current target definition, as derived from the config file.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>current_time</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\">The time this build was started. The format is defined by your config's global <code>time_format</code> field (in <a href=\"http://strftime.org/\" rel=\"nofollow\">stftime format</a>), defaulting to YYYY-MM-DD.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>mode</code></td>\n<td align=\"left\">String</td>\n<td align=\"left\">Either <code>html</code>, <code>pdf</code>, or <code>md</code> depending on what output Dactyl is building.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>config</code></td>\n<td align=\"left\">Dict</td>\n<td align=\"left\">The global config object, based on the config file plus any commandline switches.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>logger</code></td>\n<td align=\"left\"><a href=\"https://docs.python.org/3/library/logging.html#logger-objects\" rel=\"nofollow\">Logger</a></td>\n<td align=\"left\">The logging object Dactyl uses, with the verbosity set to match user input.</td>\n</tr></tbody></table>\n<p>See the <a href=\"examples/\" rel=\"nofollow\">examples</a> for examples of how to do many of these things.</p>\n<h2>Templates</h2>\n<p>Dactyl provides the following information to templates, which you can access with Jinja's templating syntax (e.g. <code>{{ target.display_name }}</code>):</p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Field</th>\n<th align=\"left\">Value</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\"><code>target</code></td>\n<td align=\"left\">The <a href=\"#targets\" rel=\"nofollow\">target</a> definition of the current target.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>pages</code></td>\n<td align=\"left\">The <a href=\"#pages\" rel=\"nofollow\">array of page definitions</a> in the current target. Use this to generate navigation across pages. (The default templates don't do this, but you should.)</td>\n</tr>\n<tr>\n<td align=\"left\"><code>currentpage</code></td>\n<td align=\"left\">The definition of the page currently being rendered.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>categories</code></td>\n<td align=\"left\">A de-duplicated array of categories that are used by at least one page in this target, sorted in the order they first appear.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>config</code></td>\n<td align=\"left\">The global Dactyl config object.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>content</code></td>\n<td align=\"left\">The parsed HTML content of the page currently being rendered.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>current_time</code></td>\n<td align=\"left\">The current date as of rendering. The format is YYYY-MM-DD by default; you can also set the <code>time_format</code> field to a custom <a href=\"http://strftime.org/\" rel=\"nofollow\">stftime format string</a>.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>mode</code></td>\n<td align=\"left\">The output format: either <code>html</code> (default), <code>pdf</code>, or <code>md</code>.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>page_toc</code></td>\n<td align=\"left\">A table of contents generated from the current page's headers. Wrap this in a <code>&lt;ul&gt;</code> element.</td>\n</tr>\n<tr>\n<td align=\"left\"><code>sidebar_content</code></td>\n<td align=\"left\">(Deprecated alias for <code>page_toc</code>.)</td>\n</tr></tbody></table>\n<h3>OpenAPI Spec Templates</h3>\n<p>When generating docs from an API specification, Dactyl generates a Markdown version for each of these pages first, then uses that as the content for the HTML version as it does when parsing normal Markdown pages. You can use your own templates instead. The templates must use the same filenames as the <a href=\"dactyl/templates/\" rel=\"nofollow\">built-in OpenAPI templates</a>, which match the pattern <code>template-openapi_*.md</code>.</p>\n\n\n          </div>"}, "last_serial": 7184157, "releases": {"0.10.0": [{"comment_text": "", "digests": {"md5": "3ad2b4d9c3ec7e1378e1bf04fc85522c", "sha256": "8bcc73df9f49adbbb6c233bb3947542606bd3e359fbacb425b156a0a36246f00"}, "downloads": -1, "filename": "dactyl-0.10.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "3ad2b4d9c3ec7e1378e1bf04fc85522c", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 67086, "upload_time": "2020-04-28T00:19:01", "upload_time_iso_8601": "2020-04-28T00:19:01.924669Z", "url": "https://files.pythonhosted.org/packages/6e/17/929e28ecc75382b48a1d7413fc9dbfa84b0973a21333450625bf80ac02a5/dactyl-0.10.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "bf578a4a21a41e94d43f8f2666422be5", "sha256": "2aacdceb7e849a89f571e0423ab68fdd2e6e1862cf1074ad93bfe425776beb82"}, "downloads": -1, "filename": "dactyl-0.10.0.tar.gz", "has_sig": false, "md5_digest": "bf578a4a21a41e94d43f8f2666422be5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 74081, "upload_time": "2020-04-28T00:19:03", "upload_time_iso_8601": "2020-04-28T00:19:03.621169Z", "url": "https://files.pythonhosted.org/packages/06/31/cf1451f2f342b9b3885161660b8340bb95a6a49f861fc4ff6bd12707a213/dactyl-0.10.0.tar.gz", "yanked": false}], "0.10.1": [{"comment_text": "", "digests": {"md5": "ab886ab9fd64c74ab0f965a60a6451a5", "sha256": "e50f0d1947d5891bea7a52a038305b49cc5a88fd08a2e8a9a9abbedafe767499"}, "downloads": -1, "filename": "dactyl-0.10.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "ab886ab9fd64c74ab0f965a60a6451a5", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 67120, "upload_time": "2020-04-28T15:40:12", "upload_time_iso_8601": "2020-04-28T15:40:12.204967Z", "url": "https://files.pythonhosted.org/packages/f9/bd/961ec06cd67666575d4bed925929b961b40fb0fdcb95adba6293b87f888a/dactyl-0.10.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "87a2dc947a1a54f9fa2956231b32daf6", "sha256": "efbf00f2776f511699529495b5475de5a83fc9e2333919103d8a41dcefdf6a46"}, "downloads": -1, "filename": "dactyl-0.10.1.tar.gz", "has_sig": false, "md5_digest": "87a2dc947a1a54f9fa2956231b32daf6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 74128, "upload_time": "2020-04-28T15:40:13", "upload_time_iso_8601": "2020-04-28T15:40:13.728294Z", "url": "https://files.pythonhosted.org/packages/b4/19/4480247d37f1f47be5c0ac51fc6df19129902b17c114d8d3f632178ac6a0/dactyl-0.10.1.tar.gz", "yanked": false}], "0.10.2": [{"comment_text": "", "digests": {"md5": "c599f1f569bb9fbcbb053e5ec7fac9b7", "sha256": "af0f99ae69ca8ab0acc912083038f369227ac40dc936b293301fe10e1543ad90"}, "downloads": -1, "filename": "dactyl-0.10.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "c599f1f569bb9fbcbb053e5ec7fac9b7", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 67120, "upload_time": "2020-05-06T23:15:27", "upload_time_iso_8601": "2020-05-06T23:15:27.166387Z", "url": "https://files.pythonhosted.org/packages/19/04/98efb5c133c5cdbea8f61c461d38f69acb67cceefdb64bced3a9a9345a8e/dactyl-0.10.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9c299c1e3de13e98c0422a6bdacc01f0", "sha256": "670093730d0a705cb519bdadcb08ee0baa45c00a7fe4a5e022a8506aba7e12bf"}, "downloads": -1, "filename": "dactyl-0.10.2.tar.gz", "has_sig": false, "md5_digest": "9c299c1e3de13e98c0422a6bdacc01f0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 74127, "upload_time": "2020-05-06T23:15:30", "upload_time_iso_8601": "2020-05-06T23:15:30.472895Z", "url": "https://files.pythonhosted.org/packages/a6/98/b08b3ebc975e1ddd253ce781f283ceab6d057a3c25138b2de1bc93e79cac/dactyl-0.10.2.tar.gz", "yanked": false}], "0.2.0": [{"comment_text": "", "digests": {"md5": "84d8f39255b8537eeee11b3d11f81d96", "sha256": "79190accd6ac34485c16b4b28dbbaf747fcda3fafc6bd2961958220c3e794aae"}, "downloads": -1, "filename": "dactyl-0.2.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "84d8f39255b8537eeee11b3d11f81d96", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 28622, "upload_time": "2017-02-18T06:59:39", "upload_time_iso_8601": "2017-02-18T06:59:39.028038Z", "url": "https://files.pythonhosted.org/packages/1e/ed/0a572925ea3be051ce5e149ed262da7b17ff9bcf4d0d995bfbc1790b9fe3/dactyl-0.2.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6fe0e4c827eaa3f96e6bee3169848964", "sha256": "1a7a81c74c774ee54e6c95638202efc7074d2bd5a70b08ad1dd9bb5e874159e2"}, "downloads": -1, "filename": "dactyl-0.2.0.tar.gz", "has_sig": false, "md5_digest": "6fe0e4c827eaa3f96e6bee3169848964", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26814, "upload_time": "2017-02-18T06:59:41", "upload_time_iso_8601": "2017-02-18T06:59:41.137221Z", "url": "https://files.pythonhosted.org/packages/18/83/ecc86b082eecd7474ddd12634859bbbd5cbe1de5369102408af43e534080/dactyl-0.2.0.tar.gz", "yanked": false}], "0.2.1": [{"comment_text": "", "digests": {"md5": "85dc4c65ed59e781bb8d3e0bbb3b085c", "sha256": "63a85b419e219048b38f44945f70d79450e1f00b692227bbeec02347b293b4ed"}, "downloads": -1, "filename": "dactyl-0.2.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "85dc4c65ed59e781bb8d3e0bbb3b085c", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 40237, "upload_time": "2017-02-18T07:00:48", "upload_time_iso_8601": "2017-02-18T07:00:48.151162Z", "url": "https://files.pythonhosted.org/packages/b9/55/03710e0cff233243742e2ef0b4c33984bc98888c9ad7fdebf8de5d0a3c58/dactyl-0.2.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "abb6edff3aaf3f88624e4ca5ab8ca90d", "sha256": "1eb0731cfd7682468dc4820f4b597d13ea49a41d11fb33347b80565b05ad1154"}, "downloads": -1, "filename": "dactyl-0.2.1.tar.gz", "has_sig": false, "md5_digest": "abb6edff3aaf3f88624e4ca5ab8ca90d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 33650, "upload_time": "2017-02-18T07:00:50", "upload_time_iso_8601": "2017-02-18T07:00:50.295761Z", "url": "https://files.pythonhosted.org/packages/3d/b8/b7d13433c2c0d5b54e8da0afb8e38dde6a5cf5ed04617881bddb929f1a79/dactyl-0.2.1.tar.gz", "yanked": false}], "0.2.2": [{"comment_text": "", "digests": {"md5": "03bd564bdc1461faedd3cb440ac4c521", "sha256": "020729392e3106a5ffc89056ca7281915ac5b11cf60542c2062452d819a6c6cb"}, "downloads": -1, "filename": "dactyl-0.2.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "03bd564bdc1461faedd3cb440ac4c521", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 40385, "upload_time": "2017-03-02T22:09:55", "upload_time_iso_8601": "2017-03-02T22:09:55.169247Z", "url": "https://files.pythonhosted.org/packages/75/58/9d006addd5d0004beda0e3dbba7ffa7c3c76bb08125880aeea4ed9e40b54/dactyl-0.2.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "c6622f7b07e12a0d90f295dbf7a6085e", "sha256": "bd752acf492c2601fd4a0a8ec09410f911fea95a4979a755099d914f9a8d6421"}, "downloads": -1, "filename": "dactyl-0.2.2.tar.gz", "has_sig": false, "md5_digest": "c6622f7b07e12a0d90f295dbf7a6085e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 32715, "upload_time": "2017-03-02T22:09:53", "upload_time_iso_8601": "2017-03-02T22:09:53.645690Z", "url": "https://files.pythonhosted.org/packages/b3/e6/3944721176f3b82d02829c7a24cc6fe930a855988ba4a983a476e5124bff/dactyl-0.2.2.tar.gz", "yanked": false}], "0.2.3": [{"comment_text": "", "digests": {"md5": "9a24f0df60f28e93d314c8f0d4c06e1e", "sha256": "e54b6870ca3ae599cdfa03547ff7b79c2b4321a8cee2f2b48150b63839274a40"}, "downloads": -1, "filename": "dactyl-0.2.3-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "9a24f0df60f28e93d314c8f0d4c06e1e", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 40610, "upload_time": "2017-03-18T02:18:48", "upload_time_iso_8601": "2017-03-18T02:18:48.665059Z", "url": "https://files.pythonhosted.org/packages/b9/76/ca138467e2afb2861884c8188a6ab9958b801ced845541de5f6633ae51c4/dactyl-0.2.3-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0f89649eac856dff6ce1f1b5297bba90", "sha256": "43cce052db76233da29e4c327894ffa999e579b0875e6522c6760e5d044db7dc"}, "downloads": -1, "filename": "dactyl-0.2.3.tar.gz", "has_sig": false, "md5_digest": "0f89649eac856dff6ce1f1b5297bba90", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 32886, "upload_time": "2017-03-18T02:18:46", "upload_time_iso_8601": "2017-03-18T02:18:46.562416Z", "url": "https://files.pythonhosted.org/packages/d0/f7/32fe50e5c6a940d7341b39abf475be0306e3baeb50a62e5506cf4ff8703f/dactyl-0.2.3.tar.gz", "yanked": false}], "0.3.0": [{"comment_text": "", "digests": {"md5": "6457620e6522eb23011716e698cca9ff", "sha256": "67a1de7cd51c2681680d4f0399d4da008fe36c8a4020f6ccbc3d423229de4d60"}, "downloads": -1, "filename": "dactyl-0.3.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "6457620e6522eb23011716e698cca9ff", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 42775, "upload_time": "2017-03-21T02:13:33", "upload_time_iso_8601": "2017-03-21T02:13:33.994640Z", "url": "https://files.pythonhosted.org/packages/15/81/eb574e64605f38d492964a6f146e734389552e6a460b4ab4aeb6d7928808/dactyl-0.3.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7aea243a004c5ab34c29226c9fe738cc", "sha256": "43ee982ced4ee9fdb65a960fb48e564537b051a50a7159c0bb8ea0456cca1b9e"}, "downloads": -1, "filename": "dactyl-0.3.0.tar.gz", "has_sig": false, "md5_digest": "7aea243a004c5ab34c29226c9fe738cc", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 35136, "upload_time": "2017-03-21T02:13:32", "upload_time_iso_8601": "2017-03-21T02:13:32.088476Z", "url": "https://files.pythonhosted.org/packages/df/0f/6ae24d54ef2b5ed14d28ed1a3a189a4bba9fda0dd41ef05bd89fb1aab8e8/dactyl-0.3.0.tar.gz", "yanked": false}], "0.4.0": [{"comment_text": "", "digests": {"md5": "f97db2fcdaefb26b5fb91f7c09f8782e", "sha256": "37a756b0a39f8daa3347e2901180fcf837165b9c62b108485f3ba312b246185f"}, "downloads": -1, "filename": "dactyl-0.4.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "f97db2fcdaefb26b5fb91f7c09f8782e", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 47261, "upload_time": "2017-04-06T00:55:42", "upload_time_iso_8601": "2017-04-06T00:55:42.635676Z", "url": "https://files.pythonhosted.org/packages/68/8b/2ace65cd49476f167f6e96d89066b9cf57175f959661d452037626b58c1d/dactyl-0.4.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a058aa71004ffb8a17e627f016212373", "sha256": "407a1b8546de88e8845812b43c291a3c9373af36b288b597a76290fdc54af02e"}, "downloads": -1, "filename": "dactyl-0.4.0.tar.gz", "has_sig": false, "md5_digest": "a058aa71004ffb8a17e627f016212373", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 39118, "upload_time": "2017-04-06T00:55:40", "upload_time_iso_8601": "2017-04-06T00:55:40.978464Z", "url": "https://files.pythonhosted.org/packages/d4/ac/e3b14fb236dda0275f250b2b5402e181064d674b9ff73e49849d67eb3fd4/dactyl-0.4.0.tar.gz", "yanked": false}], "0.4.1": [{"comment_text": "", "digests": {"md5": "d58287322492c079bb70a6af6cd419ff", "sha256": "e56ee2818731ca28902b1a64d553b090f10b50e493f146ca94c15b51253223a2"}, "downloads": -1, "filename": "dactyl-0.4.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "d58287322492c079bb70a6af6cd419ff", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 47268, "upload_time": "2017-04-07T19:59:13", "upload_time_iso_8601": "2017-04-07T19:59:13.414857Z", "url": "https://files.pythonhosted.org/packages/3c/0b/ec9174672694a9039ebebb95faa50099dd212aa1e03396c6b9707ede4244/dactyl-0.4.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "822cd3ac3588412d10dbfc13a7b96501", "sha256": "d1bc322ce1e513a6f5b215021c4e9e61138fb9221efb7e58718fefe986cde430"}, "downloads": -1, "filename": "dactyl-0.4.1.tar.gz", "has_sig": false, "md5_digest": "822cd3ac3588412d10dbfc13a7b96501", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 39136, "upload_time": "2017-04-07T19:59:11", "upload_time_iso_8601": "2017-04-07T19:59:11.913203Z", "url": "https://files.pythonhosted.org/packages/bd/b3/56a2e786cb5678d989d80fd389cca63937a2ab4f24914a6334494c28020e/dactyl-0.4.1.tar.gz", "yanked": false}], "0.5.0": [{"comment_text": "", "digests": {"md5": "a09a0c86a659820ff8ceeb307aff5ef0", "sha256": "ca0bae9d86b168480fc06574cc63e4db0b3555592110621fa18cb35d4d29096a"}, "downloads": -1, "filename": "dactyl-0.5.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "a09a0c86a659820ff8ceeb307aff5ef0", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 49475, "upload_time": "2017-04-17T09:10:07", "upload_time_iso_8601": "2017-04-17T09:10:07.559005Z", "url": "https://files.pythonhosted.org/packages/ea/d0/1f953238a5f3c9c6821f32f5d176672ef82ac6d7104e18006b0cdd7c1574/dactyl-0.5.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1a2082a8b461b771563fbc4fddaabbc3", "sha256": "e516aa72042107088a937a784c70bfed6291e7c86f3e13a6e973bc503ca9fc68"}, "downloads": -1, "filename": "dactyl-0.5.0.tar.gz", "has_sig": false, "md5_digest": "1a2082a8b461b771563fbc4fddaabbc3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 41455, "upload_time": "2017-04-17T09:10:05", "upload_time_iso_8601": "2017-04-17T09:10:05.354035Z", "url": "https://files.pythonhosted.org/packages/c8/86/f83c9672b840bcad446813beff63088216a73aba0e55bda016b4a758d7bc/dactyl-0.5.0.tar.gz", "yanked": false}], "0.6.0": [{"comment_text": "", "digests": {"md5": "811b56df94e5998533ed19232c6f98a0", "sha256": "6052153c9236af095d363d2667e201d6a3904bb3a19d719b46cb68899f344a65"}, "downloads": -1, "filename": "dactyl-0.6.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "811b56df94e5998533ed19232c6f98a0", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 50091, "upload_time": "2017-06-07T02:21:09", "upload_time_iso_8601": "2017-06-07T02:21:09.655099Z", "url": "https://files.pythonhosted.org/packages/85/cd/068722b28c51cf6763ceb501fc94ca812596563064d40a1f31c4794d8ab7/dactyl-0.6.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5f8023341ed8070894b5531665daf7bc", "sha256": "9edfd335b9e9db2ed30838aefda28b599a7faff4ff9159b4bde4bfcad75d2291"}, "downloads": -1, "filename": "dactyl-0.6.0.tar.gz", "has_sig": false, "md5_digest": "5f8023341ed8070894b5531665daf7bc", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42099, "upload_time": "2017-06-07T02:21:07", "upload_time_iso_8601": "2017-06-07T02:21:07.445785Z", "url": "https://files.pythonhosted.org/packages/68/d6/722d842b93932f9ee1506c86924b60e470c48297ffce76edfdec8ad64ff8/dactyl-0.6.0.tar.gz", "yanked": false}], "0.6.0b2": [{"comment_text": "", "digests": {"md5": "e64b6a4c881b145eabfe4564a6316cd7", "sha256": "77cbecf0b1dcc19fcf14330ddf827b90f7b712eb3e7c6102b40c01933299690c"}, "downloads": -1, "filename": "dactyl-0.6.0b2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "e64b6a4c881b145eabfe4564a6316cd7", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 50130, "upload_time": "2017-06-07T02:20:57", "upload_time_iso_8601": "2017-06-07T02:20:57.709007Z", "url": "https://files.pythonhosted.org/packages/80/be/9938dba17795756611f50d483e90095aa98dd5a55aeb81612e6730c85e94/dactyl-0.6.0b2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "482dee63ffa47c2a3cbb934da1e888fd", "sha256": "e47b88c849ef83c527b83a131b67687e18f3690f79c64df5b2feb7ffeb621022"}, "downloads": -1, "filename": "dactyl-0.6.0b2.tar.gz", "has_sig": false, "md5_digest": "482dee63ffa47c2a3cbb934da1e888fd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42096, "upload_time": "2017-06-07T02:20:55", "upload_time_iso_8601": "2017-06-07T02:20:55.384501Z", "url": "https://files.pythonhosted.org/packages/26/27/32aa6460d4785a51dbea502f2436d78ad4ad581f2c8e175ec55edb2a9ed1/dactyl-0.6.0b2.tar.gz", "yanked": false}], "0.6.1": [{"comment_text": "", "digests": {"md5": "042dfea2a7d73cfee067067b5861231d", "sha256": "f1d0fcd1da6e03ba0b39632061aabf91f26493c8b66f0a93d7f2eaefb46d4760"}, "downloads": -1, "filename": "dactyl-0.6.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "042dfea2a7d73cfee067067b5861231d", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 50190, "upload_time": "2017-06-07T03:20:11", "upload_time_iso_8601": "2017-06-07T03:20:11.118459Z", "url": "https://files.pythonhosted.org/packages/92/2c/e434f7e56f3f9cdb8a121404c79341d7902f254db949a8f0c310276c4c2c/dactyl-0.6.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "55d9ed60f0b0fdf10b8d80f53eea7cd4", "sha256": "b82a86a0f6c6a6105d457aeaa03661ea5d029ee99818c11f657b4ce404ab9884"}, "downloads": -1, "filename": "dactyl-0.6.1.tar.gz", "has_sig": false, "md5_digest": "55d9ed60f0b0fdf10b8d80f53eea7cd4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42197, "upload_time": "2017-06-07T03:20:09", "upload_time_iso_8601": "2017-06-07T03:20:09.391659Z", "url": "https://files.pythonhosted.org/packages/7b/40/4b2b66f089f89bcb2b5ed4deae6d53af19cd7d37a0f3dee1f9e78ebdb018/dactyl-0.6.1.tar.gz", "yanked": false}], "0.6.1a6": [{"comment_text": "", "digests": {"md5": "e106ffdb62657c36f5c719de7b08b7bf", "sha256": "bdbb242561dcd409813472f271b247c90f2cf783173d1193c8418e64815fe45e"}, "downloads": -1, "filename": "dactyl-0.6.1a6-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "e106ffdb62657c36f5c719de7b08b7bf", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 50225, "upload_time": "2017-06-07T03:18:51", "upload_time_iso_8601": "2017-06-07T03:18:51.066705Z", "url": "https://files.pythonhosted.org/packages/81/48/5eaafda7e56c01a8d9e1ef765c6191c9f186408b7bcc6e992ce28aff64e0/dactyl-0.6.1a6-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "03d574cfe4373c107e896b24894a3d70", "sha256": "4d514c9535c8ec50d37ace003810ee5c4093575e55bb62e0a2dd8c29c390dab4"}, "downloads": -1, "filename": "dactyl-0.6.1a6.tar.gz", "has_sig": false, "md5_digest": "03d574cfe4373c107e896b24894a3d70", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42211, "upload_time": "2017-06-07T03:18:49", "upload_time_iso_8601": "2017-06-07T03:18:49.266074Z", "url": "https://files.pythonhosted.org/packages/fc/33/bc1df3b17334f298bd92a8552bb63a02496a33363c43d9c6386ef5f5f5e6/dactyl-0.6.1a6.tar.gz", "yanked": false}], "0.6.2": [{"comment_text": "", "digests": {"md5": "19b7a02863361d944addf67d37fb2a91", "sha256": "8bdeaba5c45f4b489e2423bff7da30f6110f6b3cb2cb202318131ed841da8c4f"}, "downloads": -1, "filename": "dactyl-0.6.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "19b7a02863361d944addf67d37fb2a91", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 50221, "upload_time": "2017-06-09T01:01:58", "upload_time_iso_8601": "2017-06-09T01:01:58.745779Z", "url": "https://files.pythonhosted.org/packages/c9/0b/d4ca395240a161124b28b83d36f1e04ac81c71c10010d76004e0ddb30dae/dactyl-0.6.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "eb444e8e35ebb226b01b9fba904d2b73", "sha256": "9804302427601a7d5e4d77be9754015b4d6197022ed08eadc10757b8d457d3b6"}, "downloads": -1, "filename": "dactyl-0.6.2.tar.gz", "has_sig": false, "md5_digest": "eb444e8e35ebb226b01b9fba904d2b73", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42243, "upload_time": "2017-06-09T01:01:56", "upload_time_iso_8601": "2017-06-09T01:01:56.336272Z", "url": "https://files.pythonhosted.org/packages/7f/dc/56f7ddc9363f72d7f7ef9f8dbe2fa4153141a6cf2b709d97cced8025f00d/dactyl-0.6.2.tar.gz", "yanked": false}], "0.7.0": [{"comment_text": "", "digests": {"md5": "72c6846d75cb310d2f266297e023c723", "sha256": "f4f1a86c2c6124fba6ff922f6258234441b7f636882470f85d9faf27509d3684"}, "downloads": -1, "filename": "dactyl-0.7.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "72c6846d75cb310d2f266297e023c723", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 58837, "upload_time": "2017-12-20T17:43:31", "upload_time_iso_8601": "2017-12-20T17:43:31.631100Z", "url": "https://files.pythonhosted.org/packages/39/27/6a448f007b79b0a1b5c8d457d22d1a3855fdd31cdce341d241fff255decb/dactyl-0.7.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "813783abd7ca1f8c14d5ec9d9607f519", "sha256": "81ed6c1cb58550cae1f5daaad8fc1b5552a124d586e533f24e59fbe1b8ddc611"}, "downloads": -1, "filename": "dactyl-0.7.0.tar.gz", "has_sig": false, "md5_digest": "813783abd7ca1f8c14d5ec9d9607f519", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58514, "upload_time": "2017-12-20T17:43:29", "upload_time_iso_8601": "2017-12-20T17:43:29.372966Z", "url": "https://files.pythonhosted.org/packages/ec/3e/ff2e1f3476560d92c05b18500a84cb0a9359b6f617c05664c4445f5a309f/dactyl-0.7.0.tar.gz", "yanked": false}], "0.7.1": [{"comment_text": "", "digests": {"md5": "b7f3a65e37cf461c279f6cedb94c0774", "sha256": "0e063aa39e76685faa87b9ba72e26fcbdcb8f9afccfdaa35d294b3392155c327"}, "downloads": -1, "filename": "dactyl-0.7.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "b7f3a65e37cf461c279f6cedb94c0774", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 58873, "upload_time": "2018-02-17T01:27:21", "upload_time_iso_8601": "2018-02-17T01:27:21.726380Z", "url": "https://files.pythonhosted.org/packages/2a/fc/c74b8d1474f85f1dcefa165b48c80d0976ea933785c2ab001d664b25b6f7/dactyl-0.7.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "27d8a725854676cf7638166c005aacdf", "sha256": "93fc529e0d54bf7c6e504dc27b604798b08d7bc300207fa1445b2eb6f7fa5000"}, "downloads": -1, "filename": "dactyl-0.7.1.tar.gz", "has_sig": false, "md5_digest": "27d8a725854676cf7638166c005aacdf", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58573, "upload_time": "2018-02-17T01:27:18", "upload_time_iso_8601": "2018-02-17T01:27:18.827362Z", "url": "https://files.pythonhosted.org/packages/f2/51/6b9ae2ccb1dc1f69184c4b46545bbcd772bb6fbd19efc61b43dbbab400b4/dactyl-0.7.1.tar.gz", "yanked": false}], "0.7.2": [{"comment_text": "", "digests": {"md5": "244f1b51266d42d50bef7ed656a67cf7", "sha256": "9a6f6f38573fe0d1971041ef45a1f2b208c4532899edbdae44bf59de50aa6c18"}, "downloads": -1, "filename": "dactyl-0.7.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "244f1b51266d42d50bef7ed656a67cf7", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 58853, "upload_time": "2018-04-04T16:24:12", "upload_time_iso_8601": "2018-04-04T16:24:12.760721Z", "url": "https://files.pythonhosted.org/packages/17/27/84f4d90a82a03c7f0d62a63bbcd75140f7f2f8cde02c276f65ce8622f39c/dactyl-0.7.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b415a1f5531d1ef617b4b81ebda1c5aa", "sha256": "4b8eb66b05c2a02bb3d6f9bc129a2fedb01970df4e8391db66c86b1c6f611817"}, "downloads": -1, "filename": "dactyl-0.7.2.tar.gz", "has_sig": false, "md5_digest": "b415a1f5531d1ef617b4b81ebda1c5aa", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58558, "upload_time": "2018-04-04T16:24:11", "upload_time_iso_8601": "2018-04-04T16:24:11.190723Z", "url": "https://files.pythonhosted.org/packages/3b/99/ff799e4275ce845a3f82f038a75d194867376dc1a6db24ebf92e5c04295a/dactyl-0.7.2.tar.gz", "yanked": false}], "0.7.3": [{"comment_text": "", "digests": {"md5": "6acb3c3e6f07ba8a7234d31c4748f568", "sha256": "7efe08d469838efd39f4e26deb5e10e641ad99e398e1110e7ed50519cceb7403"}, "downloads": -1, "filename": "dactyl-0.7.3-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "6acb3c3e6f07ba8a7234d31c4748f568", "packagetype": "bdist_wheel", "python_version": "3.6", "requires_python": null, "size": 59016, "upload_time": "2018-08-07T21:56:44", "upload_time_iso_8601": "2018-08-07T21:56:44.677166Z", "url": "https://files.pythonhosted.org/packages/3d/47/c5824a27438687f08a583c2c4e96e1b5da286e7030d69c8d39a1226a08ec/dactyl-0.7.3-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6e538c65df779ddc473891c6705eb119", "sha256": "4f4b191cae1b007ee58da94b734d44f7bbe0917cad6c8a1c94de5e9292c0d096"}, "downloads": -1, "filename": "dactyl-0.7.3.tar.gz", "has_sig": false, "md5_digest": "6e538c65df779ddc473891c6705eb119", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58764, "upload_time": "2018-08-07T21:56:42", "upload_time_iso_8601": "2018-08-07T21:56:42.182562Z", "url": "https://files.pythonhosted.org/packages/5f/1c/de131cdf7e693b69334e3682682c3f4b6deed5b3cf82d01bb5202823e157/dactyl-0.7.3.tar.gz", "yanked": false}], "0.8.0": [{"comment_text": "", "digests": {"md5": "fe1b575089c55e728c164f83059eeeb6", "sha256": "367dc3a8c89e3d61b6f709770f2393e3c4ef63151115176812754f53274bf4a7"}, "downloads": -1, "filename": "dactyl-0.8.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "fe1b575089c55e728c164f83059eeeb6", "packagetype": "bdist_wheel", "python_version": "3.7", "requires_python": null, "size": 48159, "upload_time": "2019-02-23T01:20:17", "upload_time_iso_8601": "2019-02-23T01:20:17.373917Z", "url": "https://files.pythonhosted.org/packages/0d/69/1c348bfe0f192489111ddc8afce827175f62475e7d0bb51475681e595431/dactyl-0.8.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "c39e6e523f498065932b2c3efa41ff1d", "sha256": "4719f9d81401fbc37e1085e66f8807100edba50e0d941a2033f0a92e9e1b8ee6"}, "downloads": -1, "filename": "dactyl-0.8.0.tar.gz", "has_sig": false, "md5_digest": "c39e6e523f498065932b2c3efa41ff1d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 48882, "upload_time": "2019-02-23T01:20:14", "upload_time_iso_8601": "2019-02-23T01:20:14.855674Z", "url": "https://files.pythonhosted.org/packages/29/6d/994d9ff021710d1bd5cf32e4ba4eae1d8ae5f33d14b12d19f298b812ac31/dactyl-0.8.0.tar.gz", "yanked": false}], "0.8.2": [{"comment_text": "", "digests": {"md5": "84cd1103794386fc34b843da2c012c5b", "sha256": "07ebae74addcc5e6f89dda7e92cf8f1224b438ddfb31256704dd414b5af8ee88"}, "downloads": -1, "filename": "dactyl-0.8.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "84cd1103794386fc34b843da2c012c5b", "packagetype": "bdist_wheel", "python_version": "3.7", "requires_python": null, "size": 49308, "upload_time": "2019-08-02T01:14:57", "upload_time_iso_8601": "2019-08-02T01:14:57.032041Z", "url": "https://files.pythonhosted.org/packages/75/f3/2ccc87974e680a7adace84f435ceed95269ba78ff2e8c3b1ddd880932964/dactyl-0.8.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "bc83f8660ed4aec5fda9ecdf63aa296d", "sha256": "55145628656903d589837b018a295a51092c53bfd065b671781d0c8c74033219"}, "downloads": -1, "filename": "dactyl-0.8.2.tar.gz", "has_sig": false, "md5_digest": "bc83f8660ed4aec5fda9ecdf63aa296d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58475, "upload_time": "2019-08-02T01:14:54", "upload_time_iso_8601": "2019-08-02T01:14:54.310781Z", "url": "https://files.pythonhosted.org/packages/65/77/1ed4158dd2f8c8c5929eac81fc9aa95953a4be4ad5ab98ed38c6a1a2087a/dactyl-0.8.2.tar.gz", "yanked": false}], "0.8.3": [{"comment_text": "", "digests": {"md5": "c415b83d7cebb7e0c3e3d0baa9d58ef9", "sha256": "0050e29039fd61532cfdab06e82f567c9c0dfad723d64932680b0d13ceca9b5c"}, "downloads": -1, "filename": "dactyl-0.8.3-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "c415b83d7cebb7e0c3e3d0baa9d58ef9", "packagetype": "bdist_wheel", "python_version": "3.7", "requires_python": null, "size": 49448, "upload_time": "2019-08-02T21:19:04", "upload_time_iso_8601": "2019-08-02T21:19:04.630303Z", "url": "https://files.pythonhosted.org/packages/94/4a/29974f63ec73b0c4d11cd45d62e163dcf6fd4153f8bf2abacce91882818d/dactyl-0.8.3-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7afa5308b4c63c82586ccf6dd5a09838", "sha256": "01b77290157bc20ec6c57b64e1fd712c7015e1c40ed801d3ee370a2d89cfa581"}, "downloads": -1, "filename": "dactyl-0.8.3.tar.gz", "has_sig": false, "md5_digest": "7afa5308b4c63c82586ccf6dd5a09838", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58583, "upload_time": "2019-08-02T21:19:01", "upload_time_iso_8601": "2019-08-02T21:19:01.632678Z", "url": "https://files.pythonhosted.org/packages/cb/a6/f7c4dae518fe26fc60c3b807bd51366cb81cce5e91c0e8f1d830dbb8b48c/dactyl-0.8.3.tar.gz", "yanked": false}], "0.8.4": [{"comment_text": "", "digests": {"md5": "cb794e0b7316174cfde7c7db648b0d11", "sha256": "5e6ddd283d8ada92a511d0cdc66ff45d6361921927acc5092e9267da010b993d"}, "downloads": -1, "filename": "dactyl-0.8.4-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "cb794e0b7316174cfde7c7db648b0d11", "packagetype": "bdist_wheel", "python_version": "3.7", "requires_python": null, "size": 49465, "upload_time": "2019-08-06T22:00:38", "upload_time_iso_8601": "2019-08-06T22:00:38.013724Z", "url": "https://files.pythonhosted.org/packages/0b/90/59e4f6094e9c64f90a9d2567e03ce18d0237284746aae6cef5224592149e/dactyl-0.8.4-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "42c535189cc87595acd4aaf0dea284e4", "sha256": "c32723f1a0d2c4169e84e24c52be4a526f0cbaa5537dc9193340b49986920cdc"}, "downloads": -1, "filename": "dactyl-0.8.4.tar.gz", "has_sig": false, "md5_digest": "42c535189cc87595acd4aaf0dea284e4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58597, "upload_time": "2019-08-06T22:00:35", "upload_time_iso_8601": "2019-08-06T22:00:35.654790Z", "url": "https://files.pythonhosted.org/packages/a6/55/dd9dd5f43f72e54974bf3c6f38ff3d95d2a1250f5a607368efbe06e10727/dactyl-0.8.4.tar.gz", "yanked": false}], "0.9.0": [{"comment_text": "", "digests": {"md5": "6ef33ba3fd1ac95307a1699aec000296", "sha256": "a223bd105dad224282a87376d770a8f7510cd9fe1a14cdeb365637ce45f59b49"}, "downloads": -1, "filename": "dactyl-0.9.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "6ef33ba3fd1ac95307a1699aec000296", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 60330, "upload_time": "2019-10-02T00:54:21", "upload_time_iso_8601": "2019-10-02T00:54:21.563239Z", "url": "https://files.pythonhosted.org/packages/07/26/a9941a6d88fdaa5e871de3dfff82cc50fe8487e8ed898c738e7433c28f56/dactyl-0.9.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "71a300cda21096bcfbe672f0ee6a7c0b", "sha256": "a448ead66289a94d978be4cf844dc3fe5edc98d0c82bf59755f711342b0b102a"}, "downloads": -1, "filename": "dactyl-0.9.0.tar.gz", "has_sig": false, "md5_digest": "71a300cda21096bcfbe672f0ee6a7c0b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 66503, "upload_time": "2019-10-02T00:54:23", "upload_time_iso_8601": "2019-10-02T00:54:23.551128Z", "url": "https://files.pythonhosted.org/packages/e1/2a/dc33c42a433a42432da86945212e1e4bafdbb86d7b71c655d2e08fa5f0a7/dactyl-0.9.0.tar.gz", "yanked": false}], "0.9.2": [{"comment_text": "", "digests": {"md5": "880a4b5420396fd4ba67732eb1385084", "sha256": "712d0ca37771af18d8a871241e11d2d39f333c860aa8192dac77b06609148aa2"}, "downloads": -1, "filename": "dactyl-0.9.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "880a4b5420396fd4ba67732eb1385084", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 60393, "upload_time": "2019-10-18T04:53:07", "upload_time_iso_8601": "2019-10-18T04:53:07.147747Z", "url": "https://files.pythonhosted.org/packages/c1/bb/93c863e3f7aa6f544b7a5999c4ebe5e6b93a10dfaa16eff1cf1a7984bdad/dactyl-0.9.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7d1356301dbd51ccc2e42e1d7daa5640", "sha256": "647ed41413aea209ba44bdca248f56417790a2dc73e7d5aad1263565e8f308ba"}, "downloads": -1, "filename": "dactyl-0.9.2.tar.gz", "has_sig": false, "md5_digest": "7d1356301dbd51ccc2e42e1d7daa5640", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 66603, "upload_time": "2019-10-18T04:53:09", "upload_time_iso_8601": "2019-10-18T04:53:09.526783Z", "url": "https://files.pythonhosted.org/packages/8d/d4/b673c048f166aa48d4bc5dc58ce84a6d08cf08cea99637d268e03e1d6371/dactyl-0.9.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "c599f1f569bb9fbcbb053e5ec7fac9b7", "sha256": "af0f99ae69ca8ab0acc912083038f369227ac40dc936b293301fe10e1543ad90"}, "downloads": -1, "filename": "dactyl-0.10.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "c599f1f569bb9fbcbb053e5ec7fac9b7", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 67120, "upload_time": "2020-05-06T23:15:27", "upload_time_iso_8601": "2020-05-06T23:15:27.166387Z", "url": "https://files.pythonhosted.org/packages/19/04/98efb5c133c5cdbea8f61c461d38f69acb67cceefdb64bced3a9a9345a8e/dactyl-0.10.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9c299c1e3de13e98c0422a6bdacc01f0", "sha256": "670093730d0a705cb519bdadcb08ee0baa45c00a7fe4a5e022a8506aba7e12bf"}, "downloads": -1, "filename": "dactyl-0.10.2.tar.gz", "has_sig": false, "md5_digest": "9c299c1e3de13e98c0422a6bdacc01f0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 74127, "upload_time": "2020-05-06T23:15:30", "upload_time_iso_8601": "2020-05-06T23:15:30.472895Z", "url": "https://files.pythonhosted.org/packages/a6/98/b08b3ebc975e1ddd253ce781f283ceab6d057a3c25138b2de1bc93e79cac/dactyl-0.10.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:40:57 2020"}