{"info": {"author": "DrivenData", "author_email": "info@drivendata.org", "bugtrack_url": null, "classifiers": ["Intended Audience :: Developers", "Intended Audience :: Science/Research", "License :: OSI Approved :: MIT License", "Programming Language :: Python", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.6", "Topic :: Scientific/Engineering", "Topic :: Scientific/Engineering :: Artificial Intelligence"], "description": "<a href=\"http://deon.drivendata.org/\"><img src=\"https://s3.amazonaws.com/drivendata-public-assets/deon.png\" width=200/></a>\n\n[![Build Status](https://travis-ci.org/drivendataorg/deon.svg?branch=master)](https://travis-ci.org/drivendataorg/deon) [![PyPI](https://img.shields.io/pypi/v/deon.svg)](https://pypi.org/project/deon/)\n\n > [Read more about `deon` on the project homepage](http://deon.drivendata.org/)\n\n------\n\n\n<h1><b>An ethics checklist for data scientists</b></h1>\n\n\n`deon` is a command line tool that allows you to easily add an ethics checklist to your data science projects. We support creating a new, standalone checklist file or appending a checklist to an existing analysis in [many common formats](#supported-file-types).\n\n---\n\n**δέον** • (déon) [n.] (_Ancient Greek_) <small><a href=\"https://en.wiktionary.org/wiki/%CE%B4%CE%AD%CE%BF%CE%BD#Ancient_Greek\" target=\"_blank\" style=\"text-decoration: none; color: #6d6d6d\">wikitionary</a></small>\n > Duty; that which is binding, needful, right, proper.\n\n--------\n\nThe conversation about ethics in data science, machine learning, and AI is increasingly important. The goal of `deon` is to push that conversation forward and provide concrete, actionable reminders to the developers that have influence over how data science gets done.\n\n# Background and perspective\n\nWe have a particular perspective with this package that we will use to make decisions about contributions, issues, PRs, and other maintenance and support activities.\n\nFirst and foremost, our goal is not to be arbitrators of what ethical concerns merit inclusion. We have a [process for changing the default checklist](#changing-the-checklist), but we believe that many domain-specific concerns are not included and teams will benefit from developing [custom checklists](#custom-checklists). Not every checklist item will be relevant. We encourage teams to remove items, sections, or mark items as `N/A` as the concerns of their projects dictate.\n\nSecond, we built our initial list from a set of proposed items on [multiple checklists that we referenced](#checklist-citations). This checklist was heavily inspired by an article written by Mike Loukides, Hilary Mason, and DJ Patil and published by O'Reilly: [\"Of Oaths and Checklists\"](https://www.oreilly.com/ideas/of-oaths-and-checklists). We owe a great debt to the thinking that proceeded this, and we look forward to thoughtful engagement with the ongoing discussion about checklists for data science ethics.\n\nThird, we believe in the power of examples to bring the principles of data ethics to bear on human experience. This repository includes a [list of real-world examples](http://deon.drivendata.org/examples/) connected with each item in the default checklist. We encourage you to contribute relevant use cases that you believe can benefit the community by their example. In addition, if you have a topic, idea, or comment that doesn't seem right for the documentation, please add it to the [wiki page](https://github.com/drivendataorg/deon/wiki) for this project!\n\nFourth, it's not up to data scientists alone to decide what the ethical course of action is. This has always been a responsibility of organizations that are part of civil society. This checklist is designed to provoke conversations around issues where data scientists have particular responsibility and perspective. This conversation should be part of a larger organizational commitment to doing what is right.\n\nFifth, we believe the primary benefit of a checklist is ensuring that we don't overlook important work. Sometimes it is difficult with pressing deadlines and a demand to multitask to make sure we do the hard work to think about the big picture. This package is meant to help ensure that those discussions happen, even in fast-moving environments. Ethics is hard, and we expect some of the conversations that arise from this checklist may also be hard.\n\nSixth, we are working at a level of abstraction that cannot concretely recommend a specific action (e.g., \"remove variable X from your model\"). Nearly all of the items on the checklist are meant to provoke discussion among good-faith actors who take their ethical responsibilities seriously. Because of this, most of the items are framed as prompts to discuss or consider. Teams will want to document these discussions and decisions for posterity.\n\nSeventh, we can't define exhaustively every term that appears in the checklist. Some of these terms are open to interpretation or mean different things in different contexts. We recommend that when relevant, users create their own glossary for reference.\n\nEighth, we want to avoid any items that strictly fall into the realm of statistical best practices. Instead, we want to highlight the areas where we need to pay particular attention above and beyond best practices.\n\nNinth, we want all the checklist items to be as simple as possible (but no simpler), and to be actionable.\n\n# Using this tool\n\n<img src=\"https://s3.amazonaws.com/drivendata-public-assets/deon_demo.svg\">\n\n## Prerequisites\n\n - Python >3.6: Your project need not be Python 3, but you need Python 3 to execute this tool.\n\n## Installation\n\n```\n$ pip install deon\n```\n\n## Simple usage\n\nWe recommend adding a checklist as the first step in your data science project. After creating your project folder, you could run:\n\n```\n$ deon -o ETHICS.md\n```\n\nThis will create a markdown file called `ETHICS.md` that you can add directly to your project.\n\nFor simple one-off analyses, you can append the checklist to a Jupyter notebook or RMarkdown file using the `-o` flag to indicate the output file. `deon` will automatically append if that file already exists.\n\n```\n$ jupyter notebook my-analysis.ipynb\n\n...\n\n$ deon -o my-analysis.ipynb  # append cells to existing output file\n```\n\nThis checklist can be used by individuals or teams to ensure that reviewing the ethical implications of their work is part of every project. The checklist is meant as a jumping-off point, and it should spark deeper and more thourough discussions rather than replace those discussions.\n\n## Proudly display your Deon badge\nYou can add a Deon badge to your project documentation, such as the README, to encourage wider adoption of these ethical practices in the data science community.\n\n### HTML badge\n```html\n<a href=\"http://deon.drivendata.org/\">\n    <img src=\"https://img.shields.io/badge/ethics%20checklist-deon-brightgreen.svg?style=popout-square\" alt=\"Deon badge\" />\n</a>\n```\n\n### Markdown badge\n\n```\n[![Deon badge](https://img.shields.io/badge/ethics%20checklist-deon-brightgreen.svg?style=popout-square)](http://deon.drivendata.org/)\n```\n\n# Supported file types\n\nHere are the currently supported file types. We will accept pull requests with new file types if there is a strong case for widespread use of that filetype.\n\n\n- `.txt`: ascii\n- `.html`: html\n- `.ipynb`: jupyter\n- `.md`: markdown\n- `.rmd`: rmarkdown\n- `.rst`: rst\n\n# Command line options\n\n```\nUsage: deon [OPTIONS]\n\n  Easily create an ethics checklist for your data science project.\n\n  The checklist will be printed to standard output by default. Use the\n  --output option to write to a file instead.\n\nOptions:\n  -l, --checklist PATH  Override default checklist file with a path to a custom\n                        checklist.yml file.\n  -f, --format TEXT     Output format. Default is \"markdown\". Can be one of\n                        [ascii, html, jupyter, markdown, rmarkdown, rst].\n                        Ignored and file extension used if --output is passed.\n  -o, --output PATH     Output file path. Extension can be one of [.txt, .html,\n                        .ipynb, .md, .rmd, .rst]. The checklist is appended if\n                        the file exists.\n  -w, --overwrite       Overwrite output file if it exists. Default is False,\n                        which will append to existing file.\n  -m, --multicell       For use with Jupyter format only. Write checklist with\n                        multiple cells, one item per cell. Default is False,\n                        which will write the checklist in a single cell.\n  --help                Show this message and exit.\n\n```\n\n# Default checklist\n\n<hr class=\"checklist-buffer\"/>\n\n# Data Science Ethics Checklist\n\n[![Deon badge](https://img.shields.io/badge/ethics%20checklist-deon-brightgreen.svg?style=popout-square)](http://deon.drivendata.org/)\n\n## A. Data Collection\n - [ ] **A.1 Informed consent**: If there are human subjects, have they given informed consent, where subjects affirmatively opt-in and have a clear understanding of the data uses to which they consent?\n - [ ] **A.2 Collection bias**: Have we considered sources of bias that could be introduced during data collection and survey design and taken steps to mitigate those?\n - [ ] **A.3 Limit PII exposure**: Have we considered ways to minimize exposure of personally identifiable information (PII) for example through anonymization or not collecting information that isn't relevant for analysis?\n\n## B. Data Storage\n - [ ] **B.1 Data security**: Do we have a plan to protect and secure data (e.g., encryption at rest and in transit, access controls on internal users and third parties, access logs, and up-to-date software)?\n - [ ] **B.2 Right to be forgotten**: Do we have a mechanism through which an individual can request their personal information be removed?\n - [ ] **B.3 Data retention plan**: Is there a schedule or plan to delete the data after it is no longer needed?\n\n## C. Analysis\n - [ ] **C.1 Missing perspectives**: Have we sought to address blindspots in the analysis through engagement with relevant stakeholders (e.g., checking assumptions and discussing implications with affected communities and subject matter experts)?\n - [ ] **C.2 Dataset bias**: Have we examined the data for possible sources of bias and taken steps to mitigate or address these biases (e.g., stereotype perpetuation, confirmation bias, imbalanced classes, or omitted confounding variables)?\n - [ ] **C.3 Honest representation**: Are our visualizations, summary statistics, and reports designed to honestly represent the underlying data?\n - [ ] **C.4 Privacy in analysis**: Have we ensured that data with PII are not used or displayed unless necessary for the analysis?\n - [ ] **C.5 Auditability**: Is the process of generating the analysis well documented and reproducible if we discover issues in the future?\n\n## D. Modeling\n - [ ] **D.1 Proxy discrimination**: Have we ensured that the model does not rely on variables or proxies for variables that are unfairly discriminatory?\n - [ ] **D.2 Fairness across groups**: Have we tested model results for fairness with respect to different affected groups (e.g., tested for disparate error rates)?\n - [ ] **D.3 Metric selection**: Have we considered the effects of optimizing for our defined metrics and considered additional metrics?\n - [ ] **D.4 Explainability**: Can we explain in understandable terms a decision the model made in cases where a justification is needed?\n - [ ] **D.5 Communicate bias**: Have we communicated the shortcomings, limitations, and biases of the model to relevant stakeholders in ways that can be generally understood?\n\n## E. Deployment\n - [ ] **E.1 Redress**: Have we discussed with our organization a plan for response if users are harmed by the results (e.g., how does the data science team evaluate these cases and update analysis and models to prevent future harm)?\n - [ ] **E.2 Roll back**: Is there a way to turn off or roll back the model in production if necessary?\n - [ ] **E.3 Concept drift**: Do we test and monitor for concept drift to ensure the model remains fair over time?\n - [ ] **E.4 Unintended use**: Have we taken steps to identify and prevent unintended uses and abuse of the model and do we have a plan to monitor these once the model is deployed?\n\n*Data Science Ethics Checklist generated with [deon](http://deon.drivendata.org).*\n\n<hr class=\"checklist-buffer\"/>\n\n# Custom checklists\n\nThis is not meant to be the only ethical checklist, but instead we try to capture reasonable defaults that are general enough to be widely useful. For your own projects with particular concerns, we recommend your own `checklist.yml` file that is maintained by your team and passed to this tool with the `-l` flag.\n\nCustom checklists must follow the same schema as `checklist.yml`. There must be a top-level `title` which is a string, and `sections` which is a list. Each section in the list `sections` must have a `title`, a `section_id`, and then a list of `lines`. Each line must have a `line_id`, a `line_summary` which is a 1-3 word shorthand, and a `line` string which is the content. The format is as follows:\n\n```\ntitle: TITLE\nsections:\n  - title: SECTION TITLE\n    section_id: SECTION NUMBER\n    lines:\n        - line_id: LINE NUMBER\n          line_summary: LINE SUMMARY\n          line: LINE CONTENT\n```\n\n# Changing the checklist\n\nPlease see [the framing](#background-and-perspective) for an understanding of our perspective. Given this perspective, we will consider changes to the default checklist that fit with that perspective and follow this process.\n\nOur goal is to have checklist items that are actionable as part of a review of data science work or as part of a plan. Please avoid suggesting items that are too vague (e.g., \"do no harm\") or too specific (e.g., \"remove social security numbers from data\").\n\n**Note: This process is an experiment and is subject to change based on how well it works. Our goal is to avoid flame wars in the issue threads while still making a tool that will make adding an ethics checklist to a project easy.**\n\nTo request a change, please file an issue with a title that starts with one of: \"CREATE, UPDATE, DELETE\". There are FOUR requirements for an issue requesting a change to the checklist:\n\n - A justification for the change\n - At least 10 thumbs up from the community for the issue\n - A published example (academic or press article) of where neglecting the principle has lead to concrete harm (articles that discuss potential or hypothetical harm will not be considered sufficient)\n - A consideration of related items that already exist, and why this change is different from what exists\n\n A pull request to add an item should change:\n\n  - [`deon/assets/checklist.yml`](https://github.com/drivendataorg/deon/blob/master/deon/assets/checklist.yml): contains the default checklist items\n  - [`deon/assets/examples_of_ethical_issues.yml`](https://github.com/drivendataorg/deon/blob/master/deon/assets/examples_of_ethical_issues.yml): contains example of harms caused when the item was not considered\n\n# Discussion and commentary\n\nIn addition to this documentation, the [wiki pages for the GitHub repository](https://github.com/drivendataorg/deon/wiki) are enabled. This is a good place for sharing of links and discussion of how the checklsits are used in practice.\n\nIf you have a topic, idea, or comment that doesn't seem right for the documentation, please add it to the wiki!\n\n# References, reading, and more\n\n A robust discussion of data ethics is important for the profession. The goal of this tool is to make it easier to implement ethics review within technical projects. There are lots of great resources if you want to think about data ethics, and we encourage you to do so!\n\n## Checklist citations\n\nWe're excited to see so many articles popping up on data ethics! The short list below includes articles that directly informed the checklist content as well as a few case studies and thought-provoking pieces on the big picture.\n\n- [Of oaths and checklists](https://www.oreilly.com/ideas/of-oaths-and-checklists)\n- How to build ethics into AI ([Part I](https://medium.com/salesforce-ux/how-to-build-ethics-into-ai-part-i-bf35494cce9) and [Part II](https://medium.com/salesforce-ux/how-to-build-ethics-into-ai-part-ii-a563f3372447))\n- [An ethical checklist for data science](https://dssg.uchicago.edu/2015/09/18/an-ethical-checklist-for-data-science/)\n- [How to recognize exclusion in AI](https://medium.com/microsoft-design/how-to-recognize-exclusion-in-ai-ec2d6d89f850)\n- [Case studies in data ethics](https://www.oreilly.com/ideas/case-studies-in-data-ethics)\n- [Technology is biased too. How do we fix it?](https://fivethirtyeight.com/features/technology-is-biased-too-how-do-we-fix-it/)\n- [The dark secret at the heart of AI](https://www.technologyreview.com/s/604087/the-dark-secret-at-the-heart-of-ai/)\n\n## Where things have gone wrong\n\nTo make the ideas contained in the checklist more concrete, we've compiled [examples](http://deon.drivendata.org/examples/) of times when things have gone wrong. They're paired these with the checklist questions to help illuminate where in process ethics discussions may have helped provide a course correction.\n\n## Related tools\n\nThere are other groups working on data ethics and thinking about how tools can help in this space. Here are a few we've seen so far:\n\n- [Aequitas](https://dsapp.uchicago.edu/aequitas/) ([github](https://github.com/dssg/aequitas))\n- [Ethical OS Toolkit](https://ethicalos.org/)\n- [Ethics & Algorithms Toolkit: A risk management framework for governments](http://ethicstoolkit.ai/)\n- Ethics and Data Science ([free ebook](https://www.amazon.com/dp/B07GTC8ZN7/ref=cm_sw_r_cp_ep_dp_klAOBb4Z72B4G)) and ([write-up](https://medium.com/@sjgadler/care-about-ai-ethics-what-you-can-do-starting-today-882a0e63d828))\n\n\n-------\n\n`deon` was created and is maintained by the team at [DrivenData](https://www.drivendata.org/). Our mission is to bring the power of data science to social impact organizations.", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://deon.drivendata.org", "keywords": "data science,ethics,checklist", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "deon", "package_url": "https://pypi.org/project/deon/", "platform": "", "project_url": "https://pypi.org/project/deon/", "project_urls": {"DrivenData": "http://drivendata.co", "Homepage": "http://deon.drivendata.org", "Source Code": "https://github.com/drivendataorg/deon"}, "release_url": "https://pypi.org/project/deon/0.2.1/", "requires_dist": null, "requires_python": ">=3.6", "summary": "Deon adds an ethics checklist to your data science projects.", "version": "0.2.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><a href=\"http://deon.drivendata.org/\" rel=\"nofollow\"><img src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2b25d35863b31143d5b3a5b376f355d950085946/68747470733a2f2f73332e616d617a6f6e6177732e636f6d2f64726976656e646174612d7075626c69632d6173736574732f64656f6e2e706e67\" width=\"200/\"></a></p>\n<p><a href=\"https://travis-ci.org/drivendataorg/deon\" rel=\"nofollow\"><img alt=\"Build Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/fc76a47014695c343a9cc23cba865ea79d760a83/68747470733a2f2f7472617669732d63692e6f72672f64726976656e646174616f72672f64656f6e2e7376673f6272616e63683d6d6173746572\"></a> <a href=\"https://pypi.org/project/deon/\" rel=\"nofollow\"><img alt=\"PyPI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/3d838061a4dbaefa7007ca95be118d9701f4452e/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f64656f6e2e737667\"></a></p>\n<blockquote>\n<p><a href=\"http://deon.drivendata.org/\" rel=\"nofollow\">Read more about <code>deon</code> on the project homepage</a></p>\n</blockquote>\n<hr>\n<h1><b>An ethics checklist for data scientists</b></h1>\n<p><code>deon</code> is a command line tool that allows you to easily add an ethics checklist to your data science projects. We support creating a new, standalone checklist file or appending a checklist to an existing analysis in <a href=\"#supported-file-types\" rel=\"nofollow\">many common formats</a>.</p>\n<hr>\n<p><strong>δέον</strong> • (déon) [n.] (<em>Ancient Greek</em>) &lt;small&gt;<a href=\"https://en.wiktionary.org/wiki/%CE%B4%CE%AD%CE%BF%CE%BD#Ancient_Greek\" rel=\"nofollow\">wikitionary</a>&lt;/small&gt;</p>\n<blockquote>\n<p>Duty; that which is binding, needful, right, proper.</p>\n</blockquote>\n<hr>\n<p>The conversation about ethics in data science, machine learning, and AI is increasingly important. The goal of <code>deon</code> is to push that conversation forward and provide concrete, actionable reminders to the developers that have influence over how data science gets done.</p>\n<h1>Background and perspective</h1>\n<p>We have a particular perspective with this package that we will use to make decisions about contributions, issues, PRs, and other maintenance and support activities.</p>\n<p>First and foremost, our goal is not to be arbitrators of what ethical concerns merit inclusion. We have a <a href=\"#changing-the-checklist\" rel=\"nofollow\">process for changing the default checklist</a>, but we believe that many domain-specific concerns are not included and teams will benefit from developing <a href=\"#custom-checklists\" rel=\"nofollow\">custom checklists</a>. Not every checklist item will be relevant. We encourage teams to remove items, sections, or mark items as <code>N/A</code> as the concerns of their projects dictate.</p>\n<p>Second, we built our initial list from a set of proposed items on <a href=\"#checklist-citations\" rel=\"nofollow\">multiple checklists that we referenced</a>. This checklist was heavily inspired by an article written by Mike Loukides, Hilary Mason, and DJ Patil and published by O'Reilly: <a href=\"https://www.oreilly.com/ideas/of-oaths-and-checklists\" rel=\"nofollow\">\"Of Oaths and Checklists\"</a>. We owe a great debt to the thinking that proceeded this, and we look forward to thoughtful engagement with the ongoing discussion about checklists for data science ethics.</p>\n<p>Third, we believe in the power of examples to bring the principles of data ethics to bear on human experience. This repository includes a <a href=\"http://deon.drivendata.org/examples/\" rel=\"nofollow\">list of real-world examples</a> connected with each item in the default checklist. We encourage you to contribute relevant use cases that you believe can benefit the community by their example. In addition, if you have a topic, idea, or comment that doesn't seem right for the documentation, please add it to the <a href=\"https://github.com/drivendataorg/deon/wiki\" rel=\"nofollow\">wiki page</a> for this project!</p>\n<p>Fourth, it's not up to data scientists alone to decide what the ethical course of action is. This has always been a responsibility of organizations that are part of civil society. This checklist is designed to provoke conversations around issues where data scientists have particular responsibility and perspective. This conversation should be part of a larger organizational commitment to doing what is right.</p>\n<p>Fifth, we believe the primary benefit of a checklist is ensuring that we don't overlook important work. Sometimes it is difficult with pressing deadlines and a demand to multitask to make sure we do the hard work to think about the big picture. This package is meant to help ensure that those discussions happen, even in fast-moving environments. Ethics is hard, and we expect some of the conversations that arise from this checklist may also be hard.</p>\n<p>Sixth, we are working at a level of abstraction that cannot concretely recommend a specific action (e.g., \"remove variable X from your model\"). Nearly all of the items on the checklist are meant to provoke discussion among good-faith actors who take their ethical responsibilities seriously. Because of this, most of the items are framed as prompts to discuss or consider. Teams will want to document these discussions and decisions for posterity.</p>\n<p>Seventh, we can't define exhaustively every term that appears in the checklist. Some of these terms are open to interpretation or mean different things in different contexts. We recommend that when relevant, users create their own glossary for reference.</p>\n<p>Eighth, we want to avoid any items that strictly fall into the realm of statistical best practices. Instead, we want to highlight the areas where we need to pay particular attention above and beyond best practices.</p>\n<p>Ninth, we want all the checklist items to be as simple as possible (but no simpler), and to be actionable.</p>\n<h1>Using this tool</h1>\n<img src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2c82223e9cd3279fa7ff216c9dea780f13ff9499/68747470733a2f2f73332e616d617a6f6e6177732e636f6d2f64726976656e646174612d7075626c69632d6173736574732f64656f6e5f64656d6f2e737667\">\n<h2>Prerequisites</h2>\n<ul>\n<li>Python &gt;3.6: Your project need not be Python 3, but you need Python 3 to execute this tool.</li>\n</ul>\n<h2>Installation</h2>\n<pre><code>$ pip install deon\n</code></pre>\n<h2>Simple usage</h2>\n<p>We recommend adding a checklist as the first step in your data science project. After creating your project folder, you could run:</p>\n<pre><code>$ deon -o ETHICS.md\n</code></pre>\n<p>This will create a markdown file called <code>ETHICS.md</code> that you can add directly to your project.</p>\n<p>For simple one-off analyses, you can append the checklist to a Jupyter notebook or RMarkdown file using the <code>-o</code> flag to indicate the output file. <code>deon</code> will automatically append if that file already exists.</p>\n<pre><code>$ jupyter notebook my-analysis.ipynb\n\n...\n\n$ deon -o my-analysis.ipynb  # append cells to existing output file\n</code></pre>\n<p>This checklist can be used by individuals or teams to ensure that reviewing the ethical implications of their work is part of every project. The checklist is meant as a jumping-off point, and it should spark deeper and more thourough discussions rather than replace those discussions.</p>\n<h2>Proudly display your Deon badge</h2>\n<p>You can add a Deon badge to your project documentation, such as the README, to encourage wider adoption of these ethical practices in the data science community.</p>\n<h3>HTML badge</h3>\n<pre><span class=\"p\">&lt;</span><span class=\"nt\">a</span> <span class=\"na\">href</span><span class=\"o\">=</span><span class=\"s\">\"http://deon.drivendata.org/\"</span><span class=\"p\">&gt;</span>\n    <span class=\"p\">&lt;</span><span class=\"nt\">img</span> <span class=\"na\">src</span><span class=\"o\">=</span><span class=\"s\">\"https://img.shields.io/badge/ethics%20checklist-deon-brightgreen.svg?style=popout-square\"</span> <span class=\"na\">alt</span><span class=\"o\">=</span><span class=\"s\">\"Deon badge\"</span> <span class=\"p\">/&gt;</span>\n<span class=\"p\">&lt;/</span><span class=\"nt\">a</span><span class=\"p\">&gt;</span>\n</pre>\n<h3>Markdown badge</h3>\n<pre><code>[![Deon badge](https://img.shields.io/badge/ethics%20checklist-deon-brightgreen.svg?style=popout-square)](http://deon.drivendata.org/)\n</code></pre>\n<h1>Supported file types</h1>\n<p>Here are the currently supported file types. We will accept pull requests with new file types if there is a strong case for widespread use of that filetype.</p>\n<ul>\n<li><code>.txt</code>: ascii</li>\n<li><code>.html</code>: html</li>\n<li><code>.ipynb</code>: jupyter</li>\n<li><code>.md</code>: markdown</li>\n<li><code>.rmd</code>: rmarkdown</li>\n<li><code>.rst</code>: rst</li>\n</ul>\n<h1>Command line options</h1>\n<pre><code>Usage: deon [OPTIONS]\n\n  Easily create an ethics checklist for your data science project.\n\n  The checklist will be printed to standard output by default. Use the\n  --output option to write to a file instead.\n\nOptions:\n  -l, --checklist PATH  Override default checklist file with a path to a custom\n                        checklist.yml file.\n  -f, --format TEXT     Output format. Default is \"markdown\". Can be one of\n                        [ascii, html, jupyter, markdown, rmarkdown, rst].\n                        Ignored and file extension used if --output is passed.\n  -o, --output PATH     Output file path. Extension can be one of [.txt, .html,\n                        .ipynb, .md, .rmd, .rst]. The checklist is appended if\n                        the file exists.\n  -w, --overwrite       Overwrite output file if it exists. Default is False,\n                        which will append to existing file.\n  -m, --multicell       For use with Jupyter format only. Write checklist with\n                        multiple cells, one item per cell. Default is False,\n                        which will write the checklist in a single cell.\n  --help                Show this message and exit.\n\n</code></pre>\n<h1>Default checklist</h1>\n<hr class=\"checklist-buffer\">\n<h1>Data Science Ethics Checklist</h1>\n<p><a href=\"http://deon.drivendata.org/\" rel=\"nofollow\"><img alt=\"Deon badge\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/cb47e56f79b4303da941ce0f3b2b00f7b50c519e/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f657468696373253230636865636b6c6973742d64656f6e2d627269676874677265656e2e7376673f7374796c653d706f706f75742d737175617265\"></a></p>\n<h2>A. Data Collection</h2>\n<ul>\n<li>[ ] <strong>A.1 Informed consent</strong>: If there are human subjects, have they given informed consent, where subjects affirmatively opt-in and have a clear understanding of the data uses to which they consent?</li>\n<li>[ ] <strong>A.2 Collection bias</strong>: Have we considered sources of bias that could be introduced during data collection and survey design and taken steps to mitigate those?</li>\n<li>[ ] <strong>A.3 Limit PII exposure</strong>: Have we considered ways to minimize exposure of personally identifiable information (PII) for example through anonymization or not collecting information that isn't relevant for analysis?</li>\n</ul>\n<h2>B. Data Storage</h2>\n<ul>\n<li>[ ] <strong>B.1 Data security</strong>: Do we have a plan to protect and secure data (e.g., encryption at rest and in transit, access controls on internal users and third parties, access logs, and up-to-date software)?</li>\n<li>[ ] <strong>B.2 Right to be forgotten</strong>: Do we have a mechanism through which an individual can request their personal information be removed?</li>\n<li>[ ] <strong>B.3 Data retention plan</strong>: Is there a schedule or plan to delete the data after it is no longer needed?</li>\n</ul>\n<h2>C. Analysis</h2>\n<ul>\n<li>[ ] <strong>C.1 Missing perspectives</strong>: Have we sought to address blindspots in the analysis through engagement with relevant stakeholders (e.g., checking assumptions and discussing implications with affected communities and subject matter experts)?</li>\n<li>[ ] <strong>C.2 Dataset bias</strong>: Have we examined the data for possible sources of bias and taken steps to mitigate or address these biases (e.g., stereotype perpetuation, confirmation bias, imbalanced classes, or omitted confounding variables)?</li>\n<li>[ ] <strong>C.3 Honest representation</strong>: Are our visualizations, summary statistics, and reports designed to honestly represent the underlying data?</li>\n<li>[ ] <strong>C.4 Privacy in analysis</strong>: Have we ensured that data with PII are not used or displayed unless necessary for the analysis?</li>\n<li>[ ] <strong>C.5 Auditability</strong>: Is the process of generating the analysis well documented and reproducible if we discover issues in the future?</li>\n</ul>\n<h2>D. Modeling</h2>\n<ul>\n<li>[ ] <strong>D.1 Proxy discrimination</strong>: Have we ensured that the model does not rely on variables or proxies for variables that are unfairly discriminatory?</li>\n<li>[ ] <strong>D.2 Fairness across groups</strong>: Have we tested model results for fairness with respect to different affected groups (e.g., tested for disparate error rates)?</li>\n<li>[ ] <strong>D.3 Metric selection</strong>: Have we considered the effects of optimizing for our defined metrics and considered additional metrics?</li>\n<li>[ ] <strong>D.4 Explainability</strong>: Can we explain in understandable terms a decision the model made in cases where a justification is needed?</li>\n<li>[ ] <strong>D.5 Communicate bias</strong>: Have we communicated the shortcomings, limitations, and biases of the model to relevant stakeholders in ways that can be generally understood?</li>\n</ul>\n<h2>E. Deployment</h2>\n<ul>\n<li>[ ] <strong>E.1 Redress</strong>: Have we discussed with our organization a plan for response if users are harmed by the results (e.g., how does the data science team evaluate these cases and update analysis and models to prevent future harm)?</li>\n<li>[ ] <strong>E.2 Roll back</strong>: Is there a way to turn off or roll back the model in production if necessary?</li>\n<li>[ ] <strong>E.3 Concept drift</strong>: Do we test and monitor for concept drift to ensure the model remains fair over time?</li>\n<li>[ ] <strong>E.4 Unintended use</strong>: Have we taken steps to identify and prevent unintended uses and abuse of the model and do we have a plan to monitor these once the model is deployed?</li>\n</ul>\n<p><em>Data Science Ethics Checklist generated with <a href=\"http://deon.drivendata.org\" rel=\"nofollow\">deon</a>.</em></p>\n<hr class=\"checklist-buffer\">\n<h1>Custom checklists</h1>\n<p>This is not meant to be the only ethical checklist, but instead we try to capture reasonable defaults that are general enough to be widely useful. For your own projects with particular concerns, we recommend your own <code>checklist.yml</code> file that is maintained by your team and passed to this tool with the <code>-l</code> flag.</p>\n<p>Custom checklists must follow the same schema as <code>checklist.yml</code>. There must be a top-level <code>title</code> which is a string, and <code>sections</code> which is a list. Each section in the list <code>sections</code> must have a <code>title</code>, a <code>section_id</code>, and then a list of <code>lines</code>. Each line must have a <code>line_id</code>, a <code>line_summary</code> which is a 1-3 word shorthand, and a <code>line</code> string which is the content. The format is as follows:</p>\n<pre><code>title: TITLE\nsections:\n  - title: SECTION TITLE\n    section_id: SECTION NUMBER\n    lines:\n        - line_id: LINE NUMBER\n          line_summary: LINE SUMMARY\n          line: LINE CONTENT\n</code></pre>\n<h1>Changing the checklist</h1>\n<p>Please see <a href=\"#background-and-perspective\" rel=\"nofollow\">the framing</a> for an understanding of our perspective. Given this perspective, we will consider changes to the default checklist that fit with that perspective and follow this process.</p>\n<p>Our goal is to have checklist items that are actionable as part of a review of data science work or as part of a plan. Please avoid suggesting items that are too vague (e.g., \"do no harm\") or too specific (e.g., \"remove social security numbers from data\").</p>\n<p><strong>Note: This process is an experiment and is subject to change based on how well it works. Our goal is to avoid flame wars in the issue threads while still making a tool that will make adding an ethics checklist to a project easy.</strong></p>\n<p>To request a change, please file an issue with a title that starts with one of: \"CREATE, UPDATE, DELETE\". There are FOUR requirements for an issue requesting a change to the checklist:</p>\n<ul>\n<li>A justification for the change</li>\n<li>At least 10 thumbs up from the community for the issue</li>\n<li>A published example (academic or press article) of where neglecting the principle has lead to concrete harm (articles that discuss potential or hypothetical harm will not be considered sufficient)</li>\n<li>A consideration of related items that already exist, and why this change is different from what exists</li>\n</ul>\n<p>A pull request to add an item should change:</p>\n<ul>\n<li><a href=\"https://github.com/drivendataorg/deon/blob/master/deon/assets/checklist.yml\" rel=\"nofollow\"><code>deon/assets/checklist.yml</code></a>: contains the default checklist items</li>\n<li><a href=\"https://github.com/drivendataorg/deon/blob/master/deon/assets/examples_of_ethical_issues.yml\" rel=\"nofollow\"><code>deon/assets/examples_of_ethical_issues.yml</code></a>: contains example of harms caused when the item was not considered</li>\n</ul>\n<h1>Discussion and commentary</h1>\n<p>In addition to this documentation, the <a href=\"https://github.com/drivendataorg/deon/wiki\" rel=\"nofollow\">wiki pages for the GitHub repository</a> are enabled. This is a good place for sharing of links and discussion of how the checklsits are used in practice.</p>\n<p>If you have a topic, idea, or comment that doesn't seem right for the documentation, please add it to the wiki!</p>\n<h1>References, reading, and more</h1>\n<p>A robust discussion of data ethics is important for the profession. The goal of this tool is to make it easier to implement ethics review within technical projects. There are lots of great resources if you want to think about data ethics, and we encourage you to do so!</p>\n<h2>Checklist citations</h2>\n<p>We're excited to see so many articles popping up on data ethics! The short list below includes articles that directly informed the checklist content as well as a few case studies and thought-provoking pieces on the big picture.</p>\n<ul>\n<li><a href=\"https://www.oreilly.com/ideas/of-oaths-and-checklists\" rel=\"nofollow\">Of oaths and checklists</a></li>\n<li>How to build ethics into AI (<a href=\"https://medium.com/salesforce-ux/how-to-build-ethics-into-ai-part-i-bf35494cce9\" rel=\"nofollow\">Part I</a> and <a href=\"https://medium.com/salesforce-ux/how-to-build-ethics-into-ai-part-ii-a563f3372447\" rel=\"nofollow\">Part II</a>)</li>\n<li><a href=\"https://dssg.uchicago.edu/2015/09/18/an-ethical-checklist-for-data-science/\" rel=\"nofollow\">An ethical checklist for data science</a></li>\n<li><a href=\"https://medium.com/microsoft-design/how-to-recognize-exclusion-in-ai-ec2d6d89f850\" rel=\"nofollow\">How to recognize exclusion in AI</a></li>\n<li><a href=\"https://www.oreilly.com/ideas/case-studies-in-data-ethics\" rel=\"nofollow\">Case studies in data ethics</a></li>\n<li><a href=\"https://fivethirtyeight.com/features/technology-is-biased-too-how-do-we-fix-it/\" rel=\"nofollow\">Technology is biased too. How do we fix it?</a></li>\n<li><a href=\"https://www.technologyreview.com/s/604087/the-dark-secret-at-the-heart-of-ai/\" rel=\"nofollow\">The dark secret at the heart of AI</a></li>\n</ul>\n<h2>Where things have gone wrong</h2>\n<p>To make the ideas contained in the checklist more concrete, we've compiled <a href=\"http://deon.drivendata.org/examples/\" rel=\"nofollow\">examples</a> of times when things have gone wrong. They're paired these with the checklist questions to help illuminate where in process ethics discussions may have helped provide a course correction.</p>\n<h2>Related tools</h2>\n<p>There are other groups working on data ethics and thinking about how tools can help in this space. Here are a few we've seen so far:</p>\n<ul>\n<li><a href=\"https://dsapp.uchicago.edu/aequitas/\" rel=\"nofollow\">Aequitas</a> (<a href=\"https://github.com/dssg/aequitas\" rel=\"nofollow\">github</a>)</li>\n<li><a href=\"https://ethicalos.org/\" rel=\"nofollow\">Ethical OS Toolkit</a></li>\n<li><a href=\"http://ethicstoolkit.ai/\" rel=\"nofollow\">Ethics &amp; Algorithms Toolkit: A risk management framework for governments</a></li>\n<li>Ethics and Data Science (<a href=\"https://www.amazon.com/dp/B07GTC8ZN7/ref=cm_sw_r_cp_ep_dp_klAOBb4Z72B4G\" rel=\"nofollow\">free ebook</a>) and (<a href=\"https://medium.com/@sjgadler/care-about-ai-ethics-what-you-can-do-starting-today-882a0e63d828\" rel=\"nofollow\">write-up</a>)</li>\n</ul>\n<hr>\n<p><code>deon</code> was created and is maintained by the team at <a href=\"https://www.drivendata.org/\" rel=\"nofollow\">DrivenData</a>. Our mission is to bring the power of data science to social impact organizations.</p>\n\n          </div>"}, "last_serial": 6591842, "releases": {"0.1.2": [{"comment_text": "", "digests": {"md5": "b1ee4509eae01dd671c2c6d712b8b499", "sha256": "d8753e985d44442baf46bfd6236cd3e52fb1b29e4cf417c728a7bd187d66bb5d"}, "downloads": -1, "filename": "deon-0.1.2.tar.gz", "has_sig": false, "md5_digest": "b1ee4509eae01dd671c2c6d712b8b499", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 16051, "upload_time": "2018-08-28T22:50:05", "upload_time_iso_8601": "2018-08-28T22:50:05.829107Z", "url": "https://files.pythonhosted.org/packages/7c/8c/e29a986c8cebccf13d2713dda7715973c42ca3d3d1c9263a9172147b777e/deon-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "28ddcc3a516e066d8760ff3d47c7ac94", "sha256": "e4a0d03568053822f03310c16062531ee38dac5bf5ac551371e70b074ea25f12"}, "downloads": -1, "filename": "deon-0.1.3.tar.gz", "has_sig": false, "md5_digest": "28ddcc3a516e066d8760ff3d47c7ac94", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 23569, "upload_time": "2018-10-30T22:11:55", "upload_time_iso_8601": "2018-10-30T22:11:55.742003Z", "url": "https://files.pythonhosted.org/packages/a4/a9/e1eb7bc4c6ec08f76c89df8133f32ee0dd4b1c9171fcc0612763e858a415/deon-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "bd034047a660eb753c60660332aa8e7a", "sha256": "d8bf2332ff179bb99a08e9c9a1a1a9473ba9263eb9d56ea99fee95a388cd9f78"}, "downloads": -1, "filename": "deon-0.1.4.tar.gz", "has_sig": false, "md5_digest": "bd034047a660eb753c60660332aa8e7a", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 17242, "upload_time": "2019-10-22T04:41:26", "upload_time_iso_8601": "2019-10-22T04:41:26.382993Z", "url": "https://files.pythonhosted.org/packages/e1/77/8310c5ec998c01fa0ffe53e84de35961cf8bf1cbb77d1e546a9a39e8a149/deon-0.1.4.tar.gz", "yanked": false}], "0.2.0": [{"comment_text": "", "digests": {"md5": "7792063b5007c2352dd372d74f561b95", "sha256": "32947e96683465cb0a14dfda3fcb8ea906a8ed95a729eaa2a0d07f1f7446ad93"}, "downloads": -1, "filename": "deon-0.2.0.tar.gz", "has_sig": false, "md5_digest": "7792063b5007c2352dd372d74f561b95", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 17367, "upload_time": "2020-01-07T04:16:13", "upload_time_iso_8601": "2020-01-07T04:16:13.556727Z", "url": "https://files.pythonhosted.org/packages/02/5b/ae2ef777a17a31366fcbaa61cbca3dc2e73742826c21b8c1754a974e629a/deon-0.2.0.tar.gz", "yanked": false}], "0.2.1": [{"comment_text": "", "digests": {"md5": "b24ba6310b59f1edaa3fa02fb980ef6d", "sha256": "509adbf731c91881e517b5b56dd9a54112997baf00e2dd340644ae37c5f3c453"}, "downloads": -1, "filename": "deon-0.2.1.tar.gz", "has_sig": false, "md5_digest": "b24ba6310b59f1edaa3fa02fb980ef6d", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 19018, "upload_time": "2020-02-08T00:21:40", "upload_time_iso_8601": "2020-02-08T00:21:40.804555Z", "url": "https://files.pythonhosted.org/packages/28/b1/a297fd01c9a8d645c0bed19422c29be01daff8425f4e0820d66974da5eef/deon-0.2.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "b24ba6310b59f1edaa3fa02fb980ef6d", "sha256": "509adbf731c91881e517b5b56dd9a54112997baf00e2dd340644ae37c5f3c453"}, "downloads": -1, "filename": "deon-0.2.1.tar.gz", "has_sig": false, "md5_digest": "b24ba6310b59f1edaa3fa02fb980ef6d", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 19018, "upload_time": "2020-02-08T00:21:40", "upload_time_iso_8601": "2020-02-08T00:21:40.804555Z", "url": "https://files.pythonhosted.org/packages/28/b1/a297fd01c9a8d645c0bed19422c29be01daff8425f4e0820d66974da5eef/deon-0.2.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:39:05 2020"}