{"info": {"author": "Kris Fields", "author_email": "avalaunchit@gmail.com", "bugtrack_url": null, "classifiers": ["Environment :: Web Environment", "Framework :: Django", "Intended Audience :: Developers", "License :: OSI Approved :: BSD License", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3.6", "Topic :: Internet :: WWW/HTTP", "Topic :: Internet :: WWW/HTTP :: Dynamic Content"], "description": "============\nDjango Baker\n============\n\nDjango Baker wants to help you get your projects up and running quickly.  Given one or more app names, s/he will automatically generate views, forms, urls, admin, and templates for all of the models in the models.py file.  All files are pep-8 compliant (with exception to the maximum line length rule, which I don't agree with).\n\nOnce you add a single urlpattern to your project's URLconf, you'll have a working list view, detail view, create view, update view, and delete view for each model in your app.\n\nOptionally you may specify which models in an app to bake if you'd rather not generate files for all of them.\n\nYou can override any of the template files that are used in the 'baking' process in the same way that you would override any third party template.  Just create a django_baker folder inside your project's main templates directory and create a file with the same name as any of the 9 files you wish to override, which are: detail.html, create.html, update.html, list.html, delete.html, views, urls, forms, admin, base, __init__urls, __init__views.  Hopefully their names are self explanatory.\n\n**********\nInstalling\n**********\n\n.. code-block:: python\n\n    pip install django-baker\n\nAdd 'django_baker' to INSTALLED_APPS\n\n*****\nUsage\n*****\n\nLet's assume your project is called TastyTreats, and has two apps, one called bread and another called pastries.\n\n.. code-block:: python\n\n    python manage.py bake bread pastries\n\nThis will generate files for all of the models in both of the apps.  You can override this by passing in models for each app.  Let's assume your pastries app has the following models: Tart, Strudel, and Danish but you only want to bake tarts and danishes.\n\n.. code-block:: python\n\n    python manage.py bake bread pastries:Tart,Danish\n\nFinally you simply need to add one or more urlpattern to your project's URLconf.\n\n.. code-block:: python\n\n    (r'^pastries/', include('pastries.urls')),\n\nwill result in the following url schema:\n\n.. code-block:: html\n\n    www.tastytreats.com/pastries/tarts\n    www.tastytreats.com/pastries/danishes\n\nalternatively you can create multiple urlpatterns to create shorter urls.\n\n.. code-block:: python\n\n    (r'^tarts/', include('pastries.urls.tart_urls')),\n    (r'^danishes/', include('pastries.urls.danish_urls')),\n\nwill result in the following url schema:\n\n.. code-block:: html\n\n    www.tastytreats.com/tarts\n    www.tastytreats.com/danishes\n\n\nViews\n=====\n\nTo keep things tidy, a views directory is created, and each model is given it's own views file (ie. tart_views.py).  An __init__ file is created that imports from each of the views files.  With the __init__ file in place, you can import from any of the individual views files the same way you would have before (ie. from bread.views import CornBreadCreateView).\n\nFor convenience, almost all of the CBV methods that can be overridden are stubbed out, ready to be altered as needed.  The methods are presented in the order in which they are called. I chose to leave a couple of methods out as I couldn't imagine any scenario in which I would want to override them.\n\nAlso for convenience and easy alteration, almost all of the attributes that you can set are listed.\n\nSome other niceties:\n--------------------\n- *form_class* is set to a ModelForm that was added to your forms.py file\n- *context_object_name* is set to the slugified model_name (ie. tarts for DetailView, UpdateView, and DeleteView, or tarts_list for the ListView)\n- if your model has exactly one unique slug field, it's used as the *slug_field* and *slug_url_kwarg* attribute.\n- *get_success_url* returns the url for the object's DetailView (for DeleteView, the ListView url is returned).\n\nTemplates\n=========\n\nThe generated templates files are kept very minimal as there aren't usually a lot of commonalities in templates between projects.  Each extends a model base file (ie. tart_base.html) which in turn extends \"base.html\", which your project is assumed to have.  The model level base file is empty but nice to have if you wish to add any html specific to that model.\n\nThe ListView template lists each object, with links to view, update, or delete. There is also a link to create a new object.\n\nThe DetailView template lists the object with a link to update or delete, as well as a link back to the list view.\n\nBoth the CreateView and UpdateView templates display the model form with a link back to the ListView.\n\nThe DeleteView template has a simple confirm required button and a link back to the ListView.\n\nForms\n=====\n\nA ModelForm is created for each model, with many of the commonly set attributes listed for easy alteration. The *fields* attribute is set to each field in the model other than the id.\n\nIn addition, a few commonly changed methods are stubbed out, including a *clean_field_name* method for each field in the form.\n\nUrls\n====\n\nA new urls directory is created, with each model getting it's own file (ie. tart_urls.py).  An __init__ file is created which adds urlpatterns that include each of the newly created urls files.  This allows you to choose whether to add routing to the app as a whole, or individually to each model (see usage above).\n\nFor DetailView, UpdateView, and DeleteView, if a model has exactly one unique slug field, that slug field will be used in the url.  Otherwise pk will be used.\n\nFor CreateView, UpdateView, and DeleteView, the login_required decorator has been added as the vast majority of the time these actions tend to require the user to be logged in.  In the future, I intend to make this optional.\n\nAdmin\n=====\n\nThis is where I really had some fun.  For each model, a ModelAdmin is created that makes use of a model admin mixin that I wrote.  The goal of ExtendedModelAdminMixin is to make setting up a fully functional admin for each model (with intelligently chosen list_display, list_filter, and search_fields) a one liner.\n\nThe actual contents of the admin.py files generated are fairly small, since most of the magic is happening in the ExtendedModelAdminMixin.  Many of the attributes that you can set are listed so that you may easily alter them as needed.  I didn't include any of the methods you can override as there are too many and it would get way too cluttered.  There are a lot of useful ones though, which you can view here: https://docs.djangoproject.com/en/1.10/ref/contrib/admin/#modeladmin-methods\n\nExtendedModelAdminMixin sets defaults for the following:\n\nlist_select_related\n-------------------\n\nDefaults to all of the model's ForeignKey and OneToOneFields, including those where null=True.  This will usually decrease database queries and improve page load time.\n\nYou can override this by setting **list_all_select_related** to False.\n\nlist_display\n------------\n\nDefaults to all of the model's fields, in the order that they are listed in your models.py file, with the exception of the id field and any ManyToManyField.\n\nYou can override this by setting the *list_display* attribute or you may extend it by setting **extra_list_display** (defaults to an empty list), the contents of which will be appended to *list_display*, with any fields in both being displayed only once.\n\nIn addition, each URLField, ForeignKey, and OneToOneField will display as a link.  URLFields will link to their respective urls, while ForeignKey and OneToOneFields will link to their respective object's admin change pages.\n\nYou can ovverride this functionality by setting **link_url_fields** and/or **link_foreign_key_fields** to False.\n\nlist_filter\n-----------\n\nDefaults to any field where the choices attribute has been set, as well as any field with a field type matching a field type in the **list_by_fields** attribute (defaults to ['BooleanField', 'NullBooleanField', 'USStateField']), as well as any ForeignKey field where the number of related objects is less than the **max_related_objects** attribute (defaults to 100).\n\nYou can override this by setting the *list_filter* attribute or you may extend it by setting **extra_list_filter** (defaults to an empty list), the contents of which will be appended to *list_filter*.\n\nsearch_fields\n-------------\n\nDefaults to any field with a field type matching a field type in **search_by_fields** (defaults to [\"CharField\", \"TextField\"]),\n\nYou can override this by setting the *search_fields* attribute or you may extend it by setting **extra_search_fields** (defaults to an empty list), the contents of which will be appended to search_fields.\n\n****\nNote\n****\n\nDjango Baker will remove 2 files (views.py, urls.py) from each app baked so long as the files are 4 lines or less (the initial size of the files when you run startapp).  This is necessary so they don't conflict with the newly generated views and urls folders.  If the files are greater than 4 lines you will need to remove them yourself.\n\n**************************\nThe future of Django Baker\n**************************\n\nMy top 3 todo items are:\n\n1. Allow apps to be baked more than once to account for newly added models.  Right now the default behavior is to only create new files and skip any steps where the file about to be baked already exists.\n2. Automatically generate tests for each app and model\n3. Add tests to Django Baker itself\n   \nPull requests are awesome.\n\n", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/krisfields/django-baker", "keywords": "generator generates", "license": "BSD License", "maintainer": "", "maintainer_email": "", "name": "django-baker", "package_url": "https://pypi.org/project/django-baker/", "platform": "", "project_url": "https://pypi.org/project/django-baker/", "project_urls": {"Homepage": "https://github.com/krisfields/django-baker"}, "release_url": "https://pypi.org/project/django-baker/0.22/", "requires_dist": null, "requires_python": "", "summary": "Management command that generates views, forms, urls, admin, and templates for models", "version": "0.22", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>Django Baker wants to help you get your projects up and running quickly.  Given one or more app names, s/he will automatically generate views, forms, urls, admin, and templates for all of the models in the models.py file.  All files are pep-8 compliant (with exception to the maximum line length rule, which I don’t agree with).</p>\n<p>Once you add a single urlpattern to your project’s URLconf, you’ll have a working list view, detail view, create view, update view, and delete view for each model in your app.</p>\n<p>Optionally you may specify which models in an app to bake if you’d rather not generate files for all of them.</p>\n<p>You can override any of the template files that are used in the ‘baking’ process in the same way that you would override any third party template.  Just create a django_baker folder inside your project’s main templates directory and create a file with the same name as any of the 9 files you wish to override, which are: detail.html, create.html, update.html, list.html, delete.html, views, urls, forms, admin, base, __init__urls, __init__views.  Hopefully their names are self explanatory.</p>\n<div id=\"installing\">\n<h2>Installing</h2>\n<pre><span class=\"n\">pip</span> <span class=\"n\">install</span> <span class=\"n\">django</span><span class=\"o\">-</span><span class=\"n\">baker</span>\n</pre>\n<p>Add ‘django_baker’ to INSTALLED_APPS</p>\n</div>\n<div id=\"usage\">\n<h2>Usage</h2>\n<p>Let’s assume your project is called TastyTreats, and has two apps, one called bread and another called pastries.</p>\n<pre><span class=\"n\">python</span> <span class=\"n\">manage</span><span class=\"o\">.</span><span class=\"n\">py</span> <span class=\"n\">bake</span> <span class=\"n\">bread</span> <span class=\"n\">pastries</span>\n</pre>\n<p>This will generate files for all of the models in both of the apps.  You can override this by passing in models for each app.  Let’s assume your pastries app has the following models: Tart, Strudel, and Danish but you only want to bake tarts and danishes.</p>\n<pre><span class=\"n\">python</span> <span class=\"n\">manage</span><span class=\"o\">.</span><span class=\"n\">py</span> <span class=\"n\">bake</span> <span class=\"n\">bread</span> <span class=\"n\">pastries</span><span class=\"p\">:</span><span class=\"n\">Tart</span><span class=\"p\">,</span><span class=\"n\">Danish</span>\n</pre>\n<p>Finally you simply need to add one or more urlpattern to your project’s URLconf.</p>\n<pre><span class=\"p\">(</span><span class=\"sa\">r</span><span class=\"s1\">'^pastries/'</span><span class=\"p\">,</span> <span class=\"n\">include</span><span class=\"p\">(</span><span class=\"s1\">'pastries.urls'</span><span class=\"p\">)),</span>\n</pre>\n<p>will result in the following url schema:</p>\n<pre>www.tastytreats.com/pastries/tarts\nwww.tastytreats.com/pastries/danishes\n</pre>\n<p>alternatively you can create multiple urlpatterns to create shorter urls.</p>\n<pre><span class=\"p\">(</span><span class=\"sa\">r</span><span class=\"s1\">'^tarts/'</span><span class=\"p\">,</span> <span class=\"n\">include</span><span class=\"p\">(</span><span class=\"s1\">'pastries.urls.tart_urls'</span><span class=\"p\">)),</span>\n<span class=\"p\">(</span><span class=\"sa\">r</span><span class=\"s1\">'^danishes/'</span><span class=\"p\">,</span> <span class=\"n\">include</span><span class=\"p\">(</span><span class=\"s1\">'pastries.urls.danish_urls'</span><span class=\"p\">)),</span>\n</pre>\n<p>will result in the following url schema:</p>\n<pre>www.tastytreats.com/tarts\nwww.tastytreats.com/danishes\n</pre>\n<div id=\"views\">\n<h3>Views</h3>\n<p>To keep things tidy, a views directory is created, and each model is given it’s own views file (ie. tart_views.py).  An __init__ file is created that imports from each of the views files.  With the __init__ file in place, you can import from any of the individual views files the same way you would have before (ie. from bread.views import CornBreadCreateView).</p>\n<p>For convenience, almost all of the CBV methods that can be overridden are stubbed out, ready to be altered as needed.  The methods are presented in the order in which they are called. I chose to leave a couple of methods out as I couldn’t imagine any scenario in which I would want to override them.</p>\n<p>Also for convenience and easy alteration, almost all of the attributes that you can set are listed.</p>\n<div id=\"some-other-niceties\">\n<h4>Some other niceties:</h4>\n<ul>\n<li><em>form_class</em> is set to a ModelForm that was added to your forms.py file</li>\n<li><em>context_object_name</em> is set to the slugified model_name (ie. tarts for DetailView, UpdateView, and DeleteView, or tarts_list for the ListView)</li>\n<li>if your model has exactly one unique slug field, it’s used as the <em>slug_field</em> and <em>slug_url_kwarg</em> attribute.</li>\n<li><em>get_success_url</em> returns the url for the object’s DetailView (for DeleteView, the ListView url is returned).</li>\n</ul>\n</div>\n</div>\n<div id=\"templates\">\n<h3>Templates</h3>\n<p>The generated templates files are kept very minimal as there aren’t usually a lot of commonalities in templates between projects.  Each extends a model base file (ie. tart_base.html) which in turn extends “base.html”, which your project is assumed to have.  The model level base file is empty but nice to have if you wish to add any html specific to that model.</p>\n<p>The ListView template lists each object, with links to view, update, or delete. There is also a link to create a new object.</p>\n<p>The DetailView template lists the object with a link to update or delete, as well as a link back to the list view.</p>\n<p>Both the CreateView and UpdateView templates display the model form with a link back to the ListView.</p>\n<p>The DeleteView template has a simple confirm required button and a link back to the ListView.</p>\n</div>\n<div id=\"forms\">\n<h3>Forms</h3>\n<p>A ModelForm is created for each model, with many of the commonly set attributes listed for easy alteration. The <em>fields</em> attribute is set to each field in the model other than the id.</p>\n<p>In addition, a few commonly changed methods are stubbed out, including a <em>clean_field_name</em> method for each field in the form.</p>\n</div>\n<div id=\"urls\">\n<h3>Urls</h3>\n<p>A new urls directory is created, with each model getting it’s own file (ie. tart_urls.py).  An __init__ file is created which adds urlpatterns that include each of the newly created urls files.  This allows you to choose whether to add routing to the app as a whole, or individually to each model (see usage above).</p>\n<p>For DetailView, UpdateView, and DeleteView, if a model has exactly one unique slug field, that slug field will be used in the url.  Otherwise pk will be used.</p>\n<p>For CreateView, UpdateView, and DeleteView, the login_required decorator has been added as the vast majority of the time these actions tend to require the user to be logged in.  In the future, I intend to make this optional.</p>\n</div>\n<div id=\"admin\">\n<h3>Admin</h3>\n<p>This is where I really had some fun.  For each model, a ModelAdmin is created that makes use of a model admin mixin that I wrote.  The goal of ExtendedModelAdminMixin is to make setting up a fully functional admin for each model (with intelligently chosen list_display, list_filter, and search_fields) a one liner.</p>\n<p>The actual contents of the admin.py files generated are fairly small, since most of the magic is happening in the ExtendedModelAdminMixin.  Many of the attributes that you can set are listed so that you may easily alter them as needed.  I didn’t include any of the methods you can override as there are too many and it would get way too cluttered.  There are a lot of useful ones though, which you can view here: <a href=\"https://docs.djangoproject.com/en/1.10/ref/contrib/admin/#modeladmin-methods\" rel=\"nofollow\">https://docs.djangoproject.com/en/1.10/ref/contrib/admin/#modeladmin-methods</a></p>\n<p>ExtendedModelAdminMixin sets defaults for the following:</p>\n<div id=\"list-select-related\">\n<h4>list_select_related</h4>\n<p>Defaults to all of the model’s ForeignKey and OneToOneFields, including those where null=True.  This will usually decrease database queries and improve page load time.</p>\n<p>You can override this by setting <strong>list_all_select_related</strong> to False.</p>\n</div>\n<div id=\"list-display\">\n<h4>list_display</h4>\n<p>Defaults to all of the model’s fields, in the order that they are listed in your models.py file, with the exception of the id field and any ManyToManyField.</p>\n<p>You can override this by setting the <em>list_display</em> attribute or you may extend it by setting <strong>extra_list_display</strong> (defaults to an empty list), the contents of which will be appended to <em>list_display</em>, with any fields in both being displayed only once.</p>\n<p>In addition, each URLField, ForeignKey, and OneToOneField will display as a link.  URLFields will link to their respective urls, while ForeignKey and OneToOneFields will link to their respective object’s admin change pages.</p>\n<p>You can ovverride this functionality by setting <strong>link_url_fields</strong> and/or <strong>link_foreign_key_fields</strong> to False.</p>\n</div>\n<div id=\"list-filter\">\n<h4>list_filter</h4>\n<p>Defaults to any field where the choices attribute has been set, as well as any field with a field type matching a field type in the <strong>list_by_fields</strong> attribute (defaults to [‘BooleanField’, ‘NullBooleanField’, ‘USStateField’]), as well as any ForeignKey field where the number of related objects is less than the <strong>max_related_objects</strong> attribute (defaults to 100).</p>\n<p>You can override this by setting the <em>list_filter</em> attribute or you may extend it by setting <strong>extra_list_filter</strong> (defaults to an empty list), the contents of which will be appended to <em>list_filter</em>.</p>\n</div>\n<div id=\"search-fields\">\n<h4>search_fields</h4>\n<p>Defaults to any field with a field type matching a field type in <strong>search_by_fields</strong> (defaults to [“CharField”, “TextField”]),</p>\n<p>You can override this by setting the <em>search_fields</em> attribute or you may extend it by setting <strong>extra_search_fields</strong> (defaults to an empty list), the contents of which will be appended to search_fields.</p>\n</div>\n</div>\n</div>\n<div id=\"note\">\n<h2>Note</h2>\n<p>Django Baker will remove 2 files (views.py, urls.py) from each app baked so long as the files are 4 lines or less (the initial size of the files when you run startapp).  This is necessary so they don’t conflict with the newly generated views and urls folders.  If the files are greater than 4 lines you will need to remove them yourself.</p>\n</div>\n<div id=\"the-future-of-django-baker\">\n<h2>The future of Django Baker</h2>\n<p>My top 3 todo items are:</p>\n<ol>\n<li>Allow apps to be baked more than once to account for newly added models.  Right now the default behavior is to only create new files and skip any steps where the file about to be baked already exists.</li>\n<li>Automatically generate tests for each app and model</li>\n<li>Add tests to Django Baker itself</li>\n</ol>\n<p>Pull requests are awesome.</p>\n</div>\n\n          </div>"}, "last_serial": 4064489, "releases": {"0.11": [{"comment_text": "", "digests": {"md5": "8afc81e3a14328c9386e220adabc93f3", "sha256": "b656577f8234529374251ccf760a0e3e4cda613ea4a19ee17ae87647aeefc364"}, "downloads": -1, "filename": "django-baker-0.11.tar.gz", "has_sig": false, "md5_digest": "8afc81e3a14328c9386e220adabc93f3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 14920, "upload_time": "2015-02-16T19:47:04", "upload_time_iso_8601": "2015-02-16T19:47:04.139125Z", "url": "https://files.pythonhosted.org/packages/e3/7c/ae28a02b458829d440e6a93df1ff792551e48de8bbaa4ed744cfa59bd0de/django-baker-0.11.tar.gz", "yanked": false}], "0.2": [{"comment_text": "", "digests": {"md5": "39087d7a58aa5ed7e43652240b352b50", "sha256": "a983fe1637aa91c0f1edbfdae2ea1fc647918774ff0bd6cf78cbd0a6d76808e3"}, "downloads": -1, "filename": "django-baker-0.2.tar.gz", "has_sig": false, "md5_digest": "39087d7a58aa5ed7e43652240b352b50", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 15319, "upload_time": "2017-01-05T04:24:51", "upload_time_iso_8601": "2017-01-05T04:24:51.936859Z", "url": "https://files.pythonhosted.org/packages/ae/8a/3149d98589f8f31806b08debd343bdb3d4220eb39205e19d655cc98d41dd/django-baker-0.2.tar.gz", "yanked": false}], "0.21": [{"comment_text": "", "digests": {"md5": "26c86ac6711a9e79c51cdd9418e9e654", "sha256": "90859765dc689c9f818db54767b9919e12520ec4d52649f5ec4fb64aac9f2011"}, "downloads": -1, "filename": "django-baker-0.21.tar.gz", "has_sig": false, "md5_digest": "26c86ac6711a9e79c51cdd9418e9e654", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 15265, "upload_time": "2017-01-05T04:42:51", "upload_time_iso_8601": "2017-01-05T04:42:51.693516Z", "url": "https://files.pythonhosted.org/packages/8f/76/8a7f36a7c0abf6a1d7dd18d1392065be67414e966f97db1c5968dfd73d66/django-baker-0.21.tar.gz", "yanked": false}], "0.22": [{"comment_text": "", "digests": {"md5": "d1e68f4ae041584f40db8278f4d3f16b", "sha256": "80d467f9b98bd5d97b2b458b79294117f92f3e7a0316f8f56cf3a7b1f9ef4560"}, "downloads": -1, "filename": "django-baker-0.22.tar.gz", "has_sig": false, "md5_digest": "d1e68f4ae041584f40db8278f4d3f16b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 18085, "upload_time": "2018-07-16T05:28:43", "upload_time_iso_8601": "2018-07-16T05:28:43.319785Z", "url": "https://files.pythonhosted.org/packages/6c/d2/a2f1dcbefd8a4860b75a1531045f1ce563b391c561d8508e93fa5b92f416/django-baker-0.22.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "d1e68f4ae041584f40db8278f4d3f16b", "sha256": "80d467f9b98bd5d97b2b458b79294117f92f3e7a0316f8f56cf3a7b1f9ef4560"}, "downloads": -1, "filename": "django-baker-0.22.tar.gz", "has_sig": false, "md5_digest": "d1e68f4ae041584f40db8278f4d3f16b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 18085, "upload_time": "2018-07-16T05:28:43", "upload_time_iso_8601": "2018-07-16T05:28:43.319785Z", "url": "https://files.pythonhosted.org/packages/6c/d2/a2f1dcbefd8a4860b75a1531045f1ce563b391c561d8508e93fa5b92f416/django-baker-0.22.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:37:29 2020"}