{"info": {"author": "Gabriele Giaccari, Gabriele Lucci, Guglielmo Celata, Paolo Melchiorre", "author_email": "lab@openpolis.it", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Web Environment", "Framework :: Django", "Framework :: Django :: 1.11", "Framework :: Django :: 2.0", "Framework :: Django :: 2.1", "Framework :: Django :: 2.2", "Framework :: Django :: 3.0", "Intended Audience :: Developers", "License :: OSI Approved :: GNU Affero General Public License v3", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3 :: Only", "Topic :: Internet :: WWW/HTTP", "Topic :: Internet :: WWW/HTTP :: Dynamic Content"], "description": "# Django uWSGI Taskmanager\n\n[![Code style: black](https://img.shields.io/badge/code%20style-black-000000.svg)](https://github.com/python/black)\n\nDjango application to manage async tasks via admin interface, using uWSGI spooler.\n\nSee documentation at http://django-uwsgi-taskmanager.rtfd.io/\n\n## Features\n\n- Start and stop your tasks via admin\n- Schedule tasks\n- Plan tasks as cron items\n- Check or download the generated reports/logs\n- Simply write a standard Django `Command` class (your app doesn't need to interact with Django uWSGI Taskmanager)\n- Get notifications via Slack or email when a task fails\n\n## Installation\n\n0.  Install the app with `pip`:\n\n    -  via PyPI:\n\n       `pip install django-uwsgi-taskmanager`\n\n    -  or via GitHub:\n\n       `pip install git+https://github.com/openpolis/django-uwsgi-taskmanager.git`\n\n1.  Add \"taskmanager\" to your `INSTALLED_APPS` setting like this:\n\n    ```python\n    INSTALLED_APPS = [\n        \"django.contrib.admin\",\n        # ...\n        \"taskmanager\",\n    ]\n    ```\n\n2. Run `python manage.py migrate` to create the taskmanager tables.\n\n3. Run `python manage.py collectcommands` to create taskmanager commands.\n\n4. Include the taskmanager URLConf in your project `urls.py` like this _(optional)_:\n\n    ```python\n    from django.contrib import admin\n    from django.urls import include, path\n\n    urlpatterns = [\n        path(\"admin/\", admin.site.urls),\n        path(\"taskmanager/\", include(\"taskmanager.urls\")),\n    ]\n    ```\n\n5. Set parameters in your settings file as below _(optional)_:\n\n    ```pythonstub\n    UWSGI_TASKMANAGER_N_LINES_IN_REPORT_INLINE = 10\n    UWSGI_TASKMANAGER_N_REPORTS_INLINE = 3\n    UWSGI_TASKMANAGER_SHOW_LOGVIEWER_LINK = True\n    UWSGI_TASKMANAGER_USE_FILTER_COLLAPSE = True\n    UWSGI_TASKMANAGER_SAVE_LOGFILE = False\n    ```\n\n## Usage\n\nYou just need to install `django-uwsgi-taskmanager` in your Django Project and run `collectcommands` as described.\nDjango uWSGI Taskmanager will collect all the commands and make them available for asynchronous scheduling in the admin.\n\nIf you need a new asynchronous task, just write a standard custom Django command, and synchronize the app. Then go to the admin page and schedule it.\n\nYou can disable some commands from the admin, and let users (with limited permissions) schedule only the available ones.\n\nuWSGI ini file (vassal) has to include the [spooler](https://uwsgi-docs.readthedocs.io/en/latest/Spooler.html) and [pythonpath](https://uwsgi-docs.readthedocs.io/en/latest/PythonDecorators.html) option.\n\n> **NOTE**: remember to manually create the `spooler` directory with right permissions before start uWSGI\n\n## Enabling notifications\n\nTo enable Slack notifications support for failing tasks, you have to first install the\nrequired packages, which are not included by default. To do that, just:\n\n    pip install django-uwsgi-taskmanager[notifications]\n\nThis will install the `django-uwsgi-taskmanager` package from PyPI, including the optional dependencies\nrequired to make Slack notifications work. \n\nEmail notifications are instead handled using Django [`django.core.mail`](https://docs.djangoproject.com/en/2.2/topics/email/) \nmodule, so no further dependencies are needed and they should work out of the box, given you have at\nleast one [email backend](https://docs.djangoproject.com/en/2.2/topics/email/#email-backends) properly\nconfigured.\n\nThen, you have to configure the following settings:\n\n- `UWSGI_TASKMANAGER_NOTIFICATIONS_SLACK_TOKEN`, which must be set with you own Slack token as string.\n- `UWSGI_TASKMANAGER_NOTIFICATIONS_SLACK_CHANNELS`, a list of strings representing the names or ids of the channels which will receive the notifications.\n- `UWSGI_TASKMANAGER_NOTIFICATIONS_EMAIL_FROM`, the \"from address\" you want your outgoing notification emails to use.\n- `UWSGI_TASKMANAGER_NOTIFICATIONS_EMAIL_RECIPIENTS`, a list of strings representing the recipients of the notifications.\n\n### Demo\n\nThis a basic Django demo project with a `uwsgi.ini` file and four directories (`media`, `spooler`, `static`, `venv`).\n\n```\ndemo/\n├── demo/\n│   ├── __init__.py\n│   ├── settings.py\n│   ├── urls.py\n│   └── wsgi.py\n├── manage.py\n├── media/\n├── spooler/\n├── static/\n├── uwsgi.ini\n└── venv/\n```\n\nThis is the content of `uwsgi.ini` file required to execute the project with Django:\n\n```ini\n[uwsgi]\nchdir = %d\nenv = DJANGO_SETTINGS_MODULE=demo.settings\nhttp-socket = :8000\nmaster = true\nmodule = demo.wsgi\nplugin = python3\npythonpath = %d\nspooler = %dspooler\nstatic-map = /static/=%dstatic\nvirtualenv = %dvenv\n```\n\n#### Try the demo project\n\nEnter the demo directory, then create and activate the demo virtual environments:\n\n```bash\n$ cd demo\n$ mkdir -p venv\n$ python3 -m venv ./venv\n$ source ./venv/bin/activate\n```\n\nInstall Django uWSGI taskmanager:\n\n```bash\n(venv) $ pip install django-uwsgi-taskmanager\n```\n\nInstall uWSGI (if you use uWSGI of your OS you can skip this step):\n\n```bash\n(venv) $ pip install uwsgi\n```\n\nCollect all static files:\n\n```bash\n(venv) $ python manage.py collectstatic\n```\n\nCreate all the tables:\n\n```bash\n(venv) $ python manage.py migrate\n```\n\nCollect all commands:\n\n```bash\n(venv) $ python manage.py collectcommands\n```\n\nCreate a super user to login to the admin interface:\n\n```bash\n(venv) $ python manage.py createsuperuser\n```\n\nStart the project with uWSGI:\n\n```bash\n(venv) $ uwsgi --ini uwsgi.ini\n```\n\nVisit http://127.0.0.1:8000/admin/\n\n## Copyright\n\n**Django uWSGI taskmanager** is an application to manage async tasks via admin interface, using uWSGI spooler.\n\nCopyright (C) 2019-2020 Gabriele Giaccari, Gabriele Lucci, Guglielmo Celata, Paolo Melchiorre\n\nThis program is free software: you can redistribute it and/or modify\nit under the terms of the GNU Affero General Public License as\npublished by the Free Software Foundation, either version 3 of the\nLicense, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU Affero General Public License for more details.\n\nYou should have received a copy of the GNU Affero General Public License\nalong with this program.  If not, see <https://www.gnu.org/licenses/>.\n\n# Changelog\n\nAll notable changes to this project will be documented in this file.\n\nThe format is based on [Keep a Changelog](https://keepachangelog.com/en/1.0.0/),\nand this project adheres to [Semantic Versioning](https://semver.org/spec/v2.0.0.html).\n\n## [unpublished]\n\n\n## [2.0.4] - 2020-01-21\n\n### Changed\n\n- `execute` method of the `LoggingBaseCommand` class returns the output (as in BaseCommand)\n- documentation link added to README\n\n\n## [2.0.3] - 2020-01-11\n\n### Changed\n\n- test, build and publish workflows refactored and corrected\n\n## [2.0.2] - 2020-01-11\n\n### Changed\n\n- publishing to pypi test and production environment splitted into two actions\n\n## [2.0.1] - 2020-01-11\n\n### Added\n\n- CI github added, pushed commits are published to pypi test,\n  pushed tags are published to pypi.\n\n## [2.0.0] - 2020-01-11\n\n### Added\n\n- Add sphinx documentation under `docs/`, with ReadTheDocs configuration.\n- Compatibility with django 3.0 added\n- Settings to see log reports added to the demo project\n- Implement Slack and/or email notifications for failing tasks\n- Add an `extras_require` section (`notifications`) in `setup.py`\n- Add an `extras_require` section (`dev`) in `setup.py`\n- Add `Makefile` with development command\n\n### Changed\n- **Important**: All app settings are now prefixed \"with UWSGI_TASKMANAGER_\"\n- Sections added to Task edit form in admin site.\n- Logviewer template is now compatible with django 3 (and django 2)\n- methods `has_add_permission()` signature in `admin.py`  adjusted to django 3\n- Update `black` settings in the `pyproject.toml` file\n- Update `flake8` and `isort` settings in `setup.cfg`\n- Remove hardcoded URLs and use url reverse method\n- Update and move coverage settings to `setup.cfg`\n\n## [1.0.2] - 2019-07-23\n\n### Added\n\n- Add **Copyright** section in `README.md` file\n\n### Changed\n\n- Add the full **GNU AGPL v3** in the `LICENSE.md` file\n\n### Fixed\n\n- Fix broken 1.0.1 URL in `CHANGELOG.md`\n- Fix TypeError in taskcategory admin\n\n### Removed\n\n- Remove unused code from models\n\n## [1.0.1] - 2019-07-13\n\n### Changed\n\n- Rename `collect_commands` to `collectcommands`\n- Add missings setps in `README.md`\n\n### Fixed\n\n- Fix version 1.0.0 release date in `CHANGELOG.md`\n- Add missing `__init__.py` in migrations directory\n- Add missing `STATIC_ROOT` in demo settings\n- Add missing media directory and settings\n- Fix convert to local datetime function\n- Update and complete `setup.py`\n\n## [1.0.0] - 2019-07-12\n\n### Added\n\n- First release\n\n\n[unreleased]: https://github.com/openpolis/django-uwsgi-taskmanager/compare/v2.0.4...master\n[2.0.4]: https://github.com/openpolis/django-uwsgi-taskmanager/compare/v2.0.3...v2.0.4\n[2.0.3]: https://github.com/openpolis/django-uwsgi-taskmanager/compare/v2.0.2...v2.0.3\n[2.0.2]: https://github.com/openpolis/django-uwsgi-taskmanager/compare/v2.0.1...v2.0.2\n[2.0.1]: https://github.com/openpolis/django-uwsgi-taskmanager/compare/v2.0.0...v2.0.1\n[2.0.0]: https://github.com/openpolis/django-uwsgi-taskmanager/compare/v1.0.2...v2.0.0\n[1.0.2]: https://github.com/openpolis/django-uwsgi-taskmanager/compare/v1.0.1...v1.0.2\n[1.0.1]: https://github.com/openpolis/django-uwsgi-taskmanager/compare/v1.0.0...v1.0.1\n[1.0.0]: https://github.com/openpolis/django-uwsgi-taskmanager/releases/tag/v1.0.0\n\n# Authors\n\n* Gabriele Giaccari ([@gabbork](https://github.com/gabbork))\n* Gabriele Lucci ([@gabrielelucci](https://github.com/gabrielelucci))\n* Guglielmo Celata ([@guglielmo](https://github.com/guglielmo))\n* Paolo Melchiorre ([@pauloxnet](https://github.com/pauloxnet))\n\n### GNU AFFERO GENERAL PUBLIC LICENSE\n\nVersion 3, 19 November 2007\n\nCopyright (C) 2007 Free Software Foundation, Inc.\n<https://fsf.org/>\n\nEveryone is permitted to copy and distribute verbatim copies of this\nlicense document, but changing it is not allowed.\n\n### Preamble\n\nThe GNU Affero General Public License is a free, copyleft license for\nsoftware and other kinds of works, specifically designed to ensure\ncooperation with the community in the case of network server software.\n\nThe licenses for most software and other practical works are designed\nto take away your freedom to share and change the works. By contrast,\nour General Public Licenses are intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains\nfree software for all its users.\n\nWhen we speak of free software, we are referring to freedom, not\nprice. Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.\n\nDevelopers that use our General Public Licenses protect your rights\nwith two steps: (1) assert copyright on the software, and (2) offer\nyou this License which gives you legal permission to copy, distribute\nand/or modify the software.\n\nA secondary benefit of defending all users' freedom is that\nimprovements made in alternate versions of the program, if they\nreceive widespread use, become available for other developers to\nincorporate. Many developers of free software are heartened and\nencouraged by the resulting cooperation. However, in the case of\nsoftware used on network servers, this result may fail to come about.\nThe GNU General Public License permits making a modified version and\nletting the public access it on a server without ever releasing its\nsource code to the public.\n\nThe GNU Affero General Public License is designed specifically to\nensure that, in such cases, the modified source code becomes available\nto the community. It requires the operator of a network server to\nprovide the source code of the modified version running there to the\nusers of that server. Therefore, public use of a modified version, on\na publicly accessible server, gives the public access to the source\ncode of the modified version.\n\nAn older license, called the Affero General Public License and\npublished by Affero, was designed to accomplish similar goals. This is\na different license, not a version of the Affero GPL, but Affero has\nreleased a new version of the Affero GPL which permits relicensing\nunder this license.\n\nThe precise terms and conditions for copying, distribution and\nmodification follow.\n\n### TERMS AND CONDITIONS\n\n#### 0. Definitions.\n\n\"This License\" refers to version 3 of the GNU Affero General Public\nLicense.\n\n\"Copyright\" also means copyright-like laws that apply to other kinds\nof works, such as semiconductor masks.\n\n\"The Program\" refers to any copyrightable work licensed under this\nLicense. Each licensee is addressed as \"you\". \"Licensees\" and\n\"recipients\" may be individuals or organizations.\n\nTo \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of\nan exact copy. The resulting work is called a \"modified version\" of\nthe earlier work or a work \"based on\" the earlier work.\n\nA \"covered work\" means either the unmodified Program or a work based\non the Program.\n\nTo \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy. Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.\n\nTo \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies. Mere interaction with a user\nthrough a computer network, with no transfer of a copy, is not\nconveying.\n\nAn interactive user interface displays \"Appropriate Legal Notices\" to\nthe extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License. If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.\n\n#### 1. Source Code.\n\nThe \"source code\" for a work means the preferred form of the work for\nmaking modifications to it. \"Object code\" means any non-source form of\na work.\n\nA \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.\n\nThe \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form. A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.\n\nThe \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities. However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work. For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.\n\nThe Corresponding Source need not include anything that users can\nregenerate automatically from other parts of the Corresponding Source.\n\nThe Corresponding Source for a work in source code form is that same\nwork.\n\n#### 2. Basic Permissions.\n\nAll rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met. This License explicitly affirms your unlimited\npermission to run the unmodified Program. The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work. This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.\n\nYou may make, run and propagate covered works that you do not convey,\nwithout conditions so long as your license otherwise remains in force.\nYou may convey covered works to others for the sole purpose of having\nthem make modifications exclusively for you, or provide you with\nfacilities for running those works, provided that you comply with the\nterms of this License in conveying all material for which you do not\ncontrol copyright. Those thus making or running the covered works for\nyou must do so exclusively on your behalf, under your direction and\ncontrol, on terms that prohibit them from making any copies of your\ncopyrighted material outside their relationship with you.\n\nConveying under any other circumstances is permitted solely under the\nconditions stated below. Sublicensing is not allowed; section 10 makes\nit unnecessary.\n\n#### 3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\nNo covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.\n\nWhen you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such\ncircumvention is effected by exercising rights under this License with\nrespect to the covered work, and you disclaim any intention to limit\noperation or modification of the work as a means of enforcing, against\nthe work's users, your or third parties' legal rights to forbid\ncircumvention of technological measures.\n\n#### 4. Conveying Verbatim Copies.\n\nYou may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.\n\nYou may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.\n\n#### 5. Conveying Modified Source Versions.\n\nYou may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these\nconditions:\n\n-   a) The work must carry prominent notices stating that you modified\n    it, and giving a relevant date.\n-   b) The work must carry prominent notices stating that it is\n    released under this License and any conditions added under\n    section 7. This requirement modifies the requirement in section 4\n    to \"keep intact all notices\".\n-   c) You must license the entire work, as a whole, under this\n    License to anyone who comes into possession of a copy. This\n    License will therefore apply, along with any applicable section 7\n    additional terms, to the whole of the work, and all its parts,\n    regardless of how they are packaged. This License gives no\n    permission to license the work in any other way, but it does not\n    invalidate such permission if you have separately received it.\n-   d) If the work has interactive user interfaces, each must display\n    Appropriate Legal Notices; however, if the Program has interactive\n    interfaces that do not display Appropriate Legal Notices, your\n    work need not make them do so.\n\nA compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit. Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.\n\n#### 6. Conveying Non-Source Forms.\n\nYou may convey a covered work in object code form under the terms of\nsections 4 and 5, provided that you also convey the machine-readable\nCorresponding Source under the terms of this License, in one of these\nways:\n\n-   a) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by the\n    Corresponding Source fixed on a durable physical medium\n    customarily used for software interchange.\n-   b) Convey the object code in, or embodied in, a physical product\n    (including a physical distribution medium), accompanied by a\n    written offer, valid for at least three years and valid for as\n    long as you offer spare parts or customer support for that product\n    model, to give anyone who possesses the object code either (1) a\n    copy of the Corresponding Source for all the software in the\n    product that is covered by this License, on a durable physical\n    medium customarily used for software interchange, for a price no\n    more than your reasonable cost of physically performing this\n    conveying of source, or (2) access to copy the Corresponding\n    Source from a network server at no charge.\n-   c) Convey individual copies of the object code with a copy of the\n    written offer to provide the Corresponding Source. This\n    alternative is allowed only occasionally and noncommercially, and\n    only if you received the object code with such an offer, in accord\n    with subsection 6b.\n-   d) Convey the object code by offering access from a designated\n    place (gratis or for a charge), and offer equivalent access to the\n    Corresponding Source in the same way through the same place at no\n    further charge. You need not require recipients to copy the\n    Corresponding Source along with the object code. If the place to\n    copy the object code is a network server, the Corresponding Source\n    may be on a different server (operated by you or a third party)\n    that supports equivalent copying facilities, provided you maintain\n    clear directions next to the object code saying where to find the\n    Corresponding Source. Regardless of what server hosts the\n    Corresponding Source, you remain obligated to ensure that it is\n    available for as long as needed to satisfy these requirements.\n-   e) Convey the object code using peer-to-peer transmission,\n    provided you inform other peers where the object code and\n    Corresponding Source of the work are being offered to the general\n    public at no charge under subsection 6d.\n\nA separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.\n\nA \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal,\nfamily, or household purposes, or (2) anything designed or sold for\nincorporation into a dwelling. In determining whether a product is a\nconsumer product, doubtful cases shall be resolved in favor of\ncoverage. For a particular product received by a particular user,\n\"normally used\" refers to a typical or common use of that class of\nproduct, regardless of the status of the particular user or of the way\nin which the particular user actually uses, or expects or is expected\nto use, the product. A product is a consumer product regardless of\nwhether the product has substantial commercial, industrial or\nnon-consumer uses, unless such uses represent the only significant\nmode of use of the product.\n\n\"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to\ninstall and execute modified versions of a covered work in that User\nProduct from a modified version of its Corresponding Source. The\ninformation must suffice to ensure that the continued functioning of\nthe modified object code is in no case prevented or interfered with\nsolely because modification has been made.\n\nIf you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information. But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).\n\nThe requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or\nupdates for a work that has been modified or installed by the\nrecipient, or for the User Product in which it has been modified or\ninstalled. Access to a network may be denied when the modification\nitself materially and adversely affects the operation of the network\nor violates the rules and protocols for communication across the\nnetwork.\n\nCorresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.\n\n#### 7. Additional Terms.\n\n\"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law. If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.\n\nWhen you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit. (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.) You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.\n\nNotwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders\nof that material) supplement the terms of this License with terms:\n\n-   a) Disclaiming warranty or limiting liability differently from the\n    terms of sections 15 and 16 of this License; or\n-   b) Requiring preservation of specified reasonable legal notices or\n    author attributions in that material or in the Appropriate Legal\n    Notices displayed by works containing it; or\n-   c) Prohibiting misrepresentation of the origin of that material,\n    or requiring that modified versions of such material be marked in\n    reasonable ways as different from the original version; or\n-   d) Limiting the use for publicity purposes of names of licensors\n    or authors of the material; or\n-   e) Declining to grant rights under trademark law for use of some\n    trade names, trademarks, or service marks; or\n-   f) Requiring indemnification of licensors and authors of that\n    material by anyone who conveys the material (or modified versions\n    of it) with contractual assumptions of liability to the recipient,\n    for any liability that these contractual assumptions directly\n    impose on those licensors and authors.\n\nAll other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10. If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term. If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.\n\nIf you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.\n\nAdditional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions; the\nabove requirements apply either way.\n\n#### 8. Termination.\n\nYou may not propagate or modify a covered work except as expressly\nprovided under this License. Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).\n\nHowever, if you cease all violation of this License, then your license\nfrom a particular copyright holder is reinstated (a) provisionally,\nunless and until the copyright holder explicitly and finally\nterminates your license, and (b) permanently, if the copyright holder\nfails to notify you of the violation by some reasonable means prior to\n60 days after the cessation.\n\nMoreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.\n\nTermination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License. If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.\n\n#### 9. Acceptance Not Required for Having Copies.\n\nYou are not required to accept this License in order to receive or run\na copy of the Program. Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance. However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work. These actions infringe copyright if you do\nnot accept this License. Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.\n\n#### 10. Automatic Licensing of Downstream Recipients.\n\nEach time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License. You are not responsible\nfor enforcing compliance by third parties with this License.\n\nAn \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations. If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.\n\nYou may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License. For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.\n\n#### 11. Patents.\n\nA \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based. The\nwork thus licensed is called the contributor's \"contributor version\".\n\nA contributor's \"essential patent claims\" are all patent claims owned\nor controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version. For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.\n\nEach contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.\n\nIn the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement). To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.\n\nIf you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients. \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.\n\nIf, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.\n\nA patent license is \"discriminatory\" if it does not include within the\nscope of its coverage, prohibits the exercise of, or is conditioned on\nthe non-exercise of one or more of the rights that are specifically\ngranted under this License. You may not convey a covered work if you\nare a party to an arrangement with a third party that is in the\nbusiness of distributing software, under which you make payment to the\nthird party based on the extent of your activity of conveying the\nwork, and under which the third party grants, to any of the parties\nwho would receive the covered work from you, a discriminatory patent\nlicense (a) in connection with copies of the covered work conveyed by\nyou (or copies made from those copies), or (b) primarily for and in\nconnection with specific products or compilations that contain the\ncovered work, unless you entered into that arrangement, or that patent\nlicense was granted, prior to 28 March 2007.\n\nNothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.\n\n#### 12. No Surrender of Others' Freedom.\n\nIf conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License. If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under\nthis License and any other pertinent obligations, then as a\nconsequence you may not convey it at all. For example, if you agree to\nterms that obligate you to collect a royalty for further conveying\nfrom those to whom you convey the Program, the only way you could\nsatisfy both those terms and this License would be to refrain entirely\nfrom conveying the Program.\n\n#### 13. Remote Network Interaction; Use with the GNU General Public License.\n\nNotwithstanding any other provision of this License, if you modify the\nProgram, your modified version must prominently offer all users\ninteracting with it remotely through a computer network (if your\nversion supports such interaction) an opportunity to receive the\nCorresponding Source of your version by providing access to the\nCorresponding Source from a network server at no charge, through some\nstandard or customary means of facilitating copying of software. This\nCorresponding Source shall include the Corresponding Source for any\nwork covered by version 3 of the GNU General Public License that is\nincorporated pursuant to the following paragraph.\n\nNotwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU General Public License into a single\ncombined work, and to convey the resulting work. The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the work with which it is combined will remain governed by version\n3 of the GNU General Public License.\n\n#### 14. Revised Versions of this License.\n\nThe Free Software Foundation may publish revised and/or new versions\nof the GNU Affero General Public License from time to time. Such new\nversions will be similar in spirit to the present version, but may\ndiffer in detail to address new problems or concerns.\n\nEach version is given a distinguishing version number. If the Program\nspecifies that a certain numbered version of the GNU Affero General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation. If the Program does not specify a version number of the\nGNU Affero General Public License, you may choose any version ever\npublished by the Free Software Foundation.\n\nIf the Program specifies that a proxy can decide which future versions\nof the GNU Affero General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.\n\nLater license versions may give you additional or different\npermissions. However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.\n\n#### 15. Disclaimer of Warranty.\n\nTHERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT\nWARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND\nPERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE\nDEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR\nCORRECTION.\n\n#### 16. Limitation of Liability.\n\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR\nCONVEYS THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES\nARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT\nNOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR\nLOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM\nTO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER\nPARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n#### 17. Interpretation of Sections 15 and 16.\n\nIf the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.\n\nEND OF TERMS AND CONDITIONS\n\n### How to Apply These Terms to Your New Programs\n\nIf you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these\nterms.\n\nTo do so, attach the following notices to the program. It is safest to\nattach them to the start of each source file to most effectively state\nthe exclusion of warranty; and each file should have at least the\n\"copyright\" line and a pointer to where the full notice is found.\n\n        <one line to give the program's name and a brief idea of what it does.>\n        Copyright (C) <year>  <name of author>\n\n        This program is free software: you can redistribute it and/or modify\n        it under the terms of the GNU Affero General Public License as\n        published by the Free Software Foundation, either version 3 of the\n        License, or (at your option) any later version.\n\n        This program is distributed in the hope that it will be useful,\n        but WITHOUT ANY WARRANTY; without even the implied warranty of\n        MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n        GNU Affero General Public License for more details.\n\n        You should have received a copy of the GNU Affero General Public License\n        along with this program.  If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper\nmail.\n\nIf your software can interact with users remotely through a computer\nnetwork, you should also make sure that it provides a way for users to\nget its source. For example, if your program is a web application, its\ninterface could display a \"Source\" link that leads users to an archive\nof the code. There are many ways you could offer source, and different\nsolutions will be better for different programs; see section 13 for\nthe specific requirements.\n\nYou should also get your employer (if you work as a programmer) or\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary. For more information on this, and how to apply and follow\nthe GNU AGPL, see <https://www.gnu.org/licenses/>.\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/openpolis/django-uwsgi-taskmanager.git", "keywords": "async,cron,django,manager,spooler,task,timer,uwsgi", "license": "AGPLv3 License", "maintainer": "", "maintainer_email": "", "name": "django-uwsgi-taskmanager", "package_url": "https://pypi.org/project/django-uwsgi-taskmanager/", "platform": "", "project_url": "https://pypi.org/project/django-uwsgi-taskmanager/", "project_urls": {"Bug Reports": "https://github.com/openpolis/django-uwsgi-taskmanager/issues", "Homepage": "https://github.com/openpolis/django-uwsgi-taskmanager.git", "Source Code": "https://github.com/openpolis/django-uwsgi-taskmanager"}, "release_url": "https://pypi.org/project/django-uwsgi-taskmanager/2.0.4/", "requires_dist": ["django (>=1.11)", "file-read-backwards (>=2.0.0)", "uwsgidecorators-fallback (>=0.0.3)", "uwsgidecorators (>=1.1.0)", "black (>=19.3b0) ; extra == 'dev'", "bump2version ; extra == 'dev'", "flake8-bugbear (>=19.3.0) ; extra == 'dev'", "flake8-docstrings (>=1.3.1) ; extra == 'dev'", "flake8-isort (>=2.7.0) ; extra == 'dev'", "flake8 (>=3.7.8) ; extra == 'dev'", "isort (>=4.3.21) ; extra == 'dev'", "pre-commit (>=1.18.3) ; extra == 'dev'", "sphinx ; extra == 'docs'", "sphinx-django-command ; extra == 'docs'", "sphinx-rtd-theme ; extra == 'docs'", "sphinx-autobuild ; extra == 'docs'", "pyembed-rst ; extra == 'docs'", "slackclient ; extra == 'notifications'", "uwsgi ; extra == 'optional'"], "requires_python": "~=3.6", "summary": "Django application to manage async tasks via admin interface, using uWSGI spooler.", "version": "2.0.4", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Django uWSGI Taskmanager</h1>\n<p><a href=\"https://github.com/python/black\" rel=\"nofollow\"><img alt=\"Code style: black\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/fbfdc7754183ecf079bc71ddeabaf88f6cbc5c00/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f636f64652532307374796c652d626c61636b2d3030303030302e737667\"></a></p>\n<p>Django application to manage async tasks via admin interface, using uWSGI spooler.</p>\n<p>See documentation at <a href=\"http://django-uwsgi-taskmanager.rtfd.io/\" rel=\"nofollow\">http://django-uwsgi-taskmanager.rtfd.io/</a></p>\n<h2>Features</h2>\n<ul>\n<li>Start and stop your tasks via admin</li>\n<li>Schedule tasks</li>\n<li>Plan tasks as cron items</li>\n<li>Check or download the generated reports/logs</li>\n<li>Simply write a standard Django <code>Command</code> class (your app doesn't need to interact with Django uWSGI Taskmanager)</li>\n<li>Get notifications via Slack or email when a task fails</li>\n</ul>\n<h2>Installation</h2>\n<ol>\n<li>\n<p>Install the app with <code>pip</code>:</p>\n<ul>\n<li>\n<p>via PyPI:</p>\n<p><code>pip install django-uwsgi-taskmanager</code></p>\n</li>\n<li>\n<p>or via GitHub:</p>\n<p><code>pip install git+https://github.com/openpolis/django-uwsgi-taskmanager.git</code></p>\n</li>\n</ul>\n</li>\n<li>\n<p>Add \"taskmanager\" to your <code>INSTALLED_APPS</code> setting like this:</p>\n<pre><span class=\"n\">INSTALLED_APPS</span> <span class=\"o\">=</span> <span class=\"p\">[</span>\n    <span class=\"s2\">\"django.contrib.admin\"</span><span class=\"p\">,</span>\n    <span class=\"c1\"># ...</span>\n    <span class=\"s2\">\"taskmanager\"</span><span class=\"p\">,</span>\n<span class=\"p\">]</span>\n</pre>\n</li>\n<li>\n<p>Run <code>python manage.py migrate</code> to create the taskmanager tables.</p>\n</li>\n<li>\n<p>Run <code>python manage.py collectcommands</code> to create taskmanager commands.</p>\n</li>\n<li>\n<p>Include the taskmanager URLConf in your project <code>urls.py</code> like this <em>(optional)</em>:</p>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">django.contrib</span> <span class=\"kn\">import</span> <span class=\"n\">admin</span>\n<span class=\"kn\">from</span> <span class=\"nn\">django.urls</span> <span class=\"kn\">import</span> <span class=\"n\">include</span><span class=\"p\">,</span> <span class=\"n\">path</span>\n\n<span class=\"n\">urlpatterns</span> <span class=\"o\">=</span> <span class=\"p\">[</span>\n    <span class=\"n\">path</span><span class=\"p\">(</span><span class=\"s2\">\"admin/\"</span><span class=\"p\">,</span> <span class=\"n\">admin</span><span class=\"o\">.</span><span class=\"n\">site</span><span class=\"o\">.</span><span class=\"n\">urls</span><span class=\"p\">),</span>\n    <span class=\"n\">path</span><span class=\"p\">(</span><span class=\"s2\">\"taskmanager/\"</span><span class=\"p\">,</span> <span class=\"n\">include</span><span class=\"p\">(</span><span class=\"s2\">\"taskmanager.urls\"</span><span class=\"p\">)),</span>\n<span class=\"p\">]</span>\n</pre>\n</li>\n<li>\n<p>Set parameters in your settings file as below <em>(optional)</em>:</p>\n<pre>UWSGI_TASKMANAGER_N_LINES_IN_REPORT_INLINE = 10\nUWSGI_TASKMANAGER_N_REPORTS_INLINE = 3\nUWSGI_TASKMANAGER_SHOW_LOGVIEWER_LINK = True\nUWSGI_TASKMANAGER_USE_FILTER_COLLAPSE = True\nUWSGI_TASKMANAGER_SAVE_LOGFILE = False\n</pre>\n</li>\n</ol>\n<h2>Usage</h2>\n<p>You just need to install <code>django-uwsgi-taskmanager</code> in your Django Project and run <code>collectcommands</code> as described.\nDjango uWSGI Taskmanager will collect all the commands and make them available for asynchronous scheduling in the admin.</p>\n<p>If you need a new asynchronous task, just write a standard custom Django command, and synchronize the app. Then go to the admin page and schedule it.</p>\n<p>You can disable some commands from the admin, and let users (with limited permissions) schedule only the available ones.</p>\n<p>uWSGI ini file (vassal) has to include the <a href=\"https://uwsgi-docs.readthedocs.io/en/latest/Spooler.html\" rel=\"nofollow\">spooler</a> and <a href=\"https://uwsgi-docs.readthedocs.io/en/latest/PythonDecorators.html\" rel=\"nofollow\">pythonpath</a> option.</p>\n<blockquote>\n<p><strong>NOTE</strong>: remember to manually create the <code>spooler</code> directory with right permissions before start uWSGI</p>\n</blockquote>\n<h2>Enabling notifications</h2>\n<p>To enable Slack notifications support for failing tasks, you have to first install the\nrequired packages, which are not included by default. To do that, just:</p>\n<pre><code>pip install django-uwsgi-taskmanager[notifications]\n</code></pre>\n<p>This will install the <code>django-uwsgi-taskmanager</code> package from PyPI, including the optional dependencies\nrequired to make Slack notifications work.</p>\n<p>Email notifications are instead handled using Django <a href=\"https://docs.djangoproject.com/en/2.2/topics/email/\" rel=\"nofollow\"><code>django.core.mail</code></a>\nmodule, so no further dependencies are needed and they should work out of the box, given you have at\nleast one <a href=\"https://docs.djangoproject.com/en/2.2/topics/email/#email-backends\" rel=\"nofollow\">email backend</a> properly\nconfigured.</p>\n<p>Then, you have to configure the following settings:</p>\n<ul>\n<li><code>UWSGI_TASKMANAGER_NOTIFICATIONS_SLACK_TOKEN</code>, which must be set with you own Slack token as string.</li>\n<li><code>UWSGI_TASKMANAGER_NOTIFICATIONS_SLACK_CHANNELS</code>, a list of strings representing the names or ids of the channels which will receive the notifications.</li>\n<li><code>UWSGI_TASKMANAGER_NOTIFICATIONS_EMAIL_FROM</code>, the \"from address\" you want your outgoing notification emails to use.</li>\n<li><code>UWSGI_TASKMANAGER_NOTIFICATIONS_EMAIL_RECIPIENTS</code>, a list of strings representing the recipients of the notifications.</li>\n</ul>\n<h3>Demo</h3>\n<p>This a basic Django demo project with a <code>uwsgi.ini</code> file and four directories (<code>media</code>, <code>spooler</code>, <code>static</code>, <code>venv</code>).</p>\n<pre><code>demo/\n├── demo/\n│   ├── __init__.py\n│   ├── settings.py\n│   ├── urls.py\n│   └── wsgi.py\n├── manage.py\n├── media/\n├── spooler/\n├── static/\n├── uwsgi.ini\n└── venv/\n</code></pre>\n<p>This is the content of <code>uwsgi.ini</code> file required to execute the project with Django:</p>\n<pre><span class=\"k\">[uwsgi]</span>\n<span class=\"na\">chdir</span> <span class=\"o\">=</span> <span class=\"s\">%d</span>\n<span class=\"na\">env</span> <span class=\"o\">=</span> <span class=\"s\">DJANGO_SETTINGS_MODULE=demo.settings</span>\n<span class=\"na\">http-socket</span> <span class=\"o\">=</span> <span class=\"s\">:8000</span>\n<span class=\"na\">master</span> <span class=\"o\">=</span> <span class=\"s\">true</span>\n<span class=\"na\">module</span> <span class=\"o\">=</span> <span class=\"s\">demo.wsgi</span>\n<span class=\"na\">plugin</span> <span class=\"o\">=</span> <span class=\"s\">python3</span>\n<span class=\"na\">pythonpath</span> <span class=\"o\">=</span> <span class=\"s\">%d</span>\n<span class=\"na\">spooler</span> <span class=\"o\">=</span> <span class=\"s\">%dspooler</span>\n<span class=\"na\">static-map</span> <span class=\"o\">=</span> <span class=\"s\">/static/=%dstatic</span>\n<span class=\"na\">virtualenv</span> <span class=\"o\">=</span> <span class=\"s\">%dvenv</span>\n</pre>\n<h4>Try the demo project</h4>\n<p>Enter the demo directory, then create and activate the demo virtual environments:</p>\n<pre>$ <span class=\"nb\">cd</span> demo\n$ mkdir -p venv\n$ python3 -m venv ./venv\n$ <span class=\"nb\">source</span> ./venv/bin/activate\n</pre>\n<p>Install Django uWSGI taskmanager:</p>\n<pre><span class=\"o\">(</span>venv<span class=\"o\">)</span> $ pip install django-uwsgi-taskmanager\n</pre>\n<p>Install uWSGI (if you use uWSGI of your OS you can skip this step):</p>\n<pre><span class=\"o\">(</span>venv<span class=\"o\">)</span> $ pip install uwsgi\n</pre>\n<p>Collect all static files:</p>\n<pre><span class=\"o\">(</span>venv<span class=\"o\">)</span> $ python manage.py collectstatic\n</pre>\n<p>Create all the tables:</p>\n<pre><span class=\"o\">(</span>venv<span class=\"o\">)</span> $ python manage.py migrate\n</pre>\n<p>Collect all commands:</p>\n<pre><span class=\"o\">(</span>venv<span class=\"o\">)</span> $ python manage.py collectcommands\n</pre>\n<p>Create a super user to login to the admin interface:</p>\n<pre><span class=\"o\">(</span>venv<span class=\"o\">)</span> $ python manage.py createsuperuser\n</pre>\n<p>Start the project with uWSGI:</p>\n<pre><span class=\"o\">(</span>venv<span class=\"o\">)</span> $ uwsgi --ini uwsgi.ini\n</pre>\n<p>Visit <a href=\"http://127.0.0.1:8000/admin/\" rel=\"nofollow\">http://127.0.0.1:8000/admin/</a></p>\n<h2>Copyright</h2>\n<p><strong>Django uWSGI taskmanager</strong> is an application to manage async tasks via admin interface, using uWSGI spooler.</p>\n<p>Copyright (C) 2019-2020 Gabriele Giaccari, Gabriele Lucci, Guglielmo Celata, Paolo Melchiorre</p>\n<p>This program is free software: you can redistribute it and/or modify\nit under the terms of the GNU Affero General Public License as\npublished by the Free Software Foundation, either version 3 of the\nLicense, or (at your option) any later version.</p>\n<p>This program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\nGNU Affero General Public License for more details.</p>\n<p>You should have received a copy of the GNU Affero General Public License\nalong with this program.  If not, see <a href=\"https://www.gnu.org/licenses/\" rel=\"nofollow\">https://www.gnu.org/licenses/</a>.</p>\n<h1>Changelog</h1>\n<p>All notable changes to this project will be documented in this file.</p>\n<p>The format is based on <a href=\"https://keepachangelog.com/en/1.0.0/\" rel=\"nofollow\">Keep a Changelog</a>,\nand this project adheres to <a href=\"https://semver.org/spec/v2.0.0.html\" rel=\"nofollow\">Semantic Versioning</a>.</p>\n<h2>[unpublished]</h2>\n<h2><a href=\"https://github.com/openpolis/django-uwsgi-taskmanager/compare/v2.0.3...v2.0.4\" rel=\"nofollow\">2.0.4</a> - 2020-01-21</h2>\n<h3>Changed</h3>\n<ul>\n<li><code>execute</code> method of the <code>LoggingBaseCommand</code> class returns the output (as in BaseCommand)</li>\n<li>documentation link added to README</li>\n</ul>\n<h2><a href=\"https://github.com/openpolis/django-uwsgi-taskmanager/compare/v2.0.2...v2.0.3\" rel=\"nofollow\">2.0.3</a> - 2020-01-11</h2>\n<h3>Changed</h3>\n<ul>\n<li>test, build and publish workflows refactored and corrected</li>\n</ul>\n<h2><a href=\"https://github.com/openpolis/django-uwsgi-taskmanager/compare/v2.0.1...v2.0.2\" rel=\"nofollow\">2.0.2</a> - 2020-01-11</h2>\n<h3>Changed</h3>\n<ul>\n<li>publishing to pypi test and production environment splitted into two actions</li>\n</ul>\n<h2><a href=\"https://github.com/openpolis/django-uwsgi-taskmanager/compare/v2.0.0...v2.0.1\" rel=\"nofollow\">2.0.1</a> - 2020-01-11</h2>\n<h3>Added</h3>\n<ul>\n<li>CI github added, pushed commits are published to pypi test,\npushed tags are published to pypi.</li>\n</ul>\n<h2><a href=\"https://github.com/openpolis/django-uwsgi-taskmanager/compare/v1.0.2...v2.0.0\" rel=\"nofollow\">2.0.0</a> - 2020-01-11</h2>\n<h3>Added</h3>\n<ul>\n<li>Add sphinx documentation under <code>docs/</code>, with ReadTheDocs configuration.</li>\n<li>Compatibility with django 3.0 added</li>\n<li>Settings to see log reports added to the demo project</li>\n<li>Implement Slack and/or email notifications for failing tasks</li>\n<li>Add an <code>extras_require</code> section (<code>notifications</code>) in <code>setup.py</code></li>\n<li>Add an <code>extras_require</code> section (<code>dev</code>) in <code>setup.py</code></li>\n<li>Add <code>Makefile</code> with development command</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li><strong>Important</strong>: All app settings are now prefixed \"with UWSGI_TASKMANAGER_\"</li>\n<li>Sections added to Task edit form in admin site.</li>\n<li>Logviewer template is now compatible with django 3 (and django 2)</li>\n<li>methods <code>has_add_permission()</code> signature in <code>admin.py</code>  adjusted to django 3</li>\n<li>Update <code>black</code> settings in the <code>pyproject.toml</code> file</li>\n<li>Update <code>flake8</code> and <code>isort</code> settings in <code>setup.cfg</code></li>\n<li>Remove hardcoded URLs and use url reverse method</li>\n<li>Update and move coverage settings to <code>setup.cfg</code></li>\n</ul>\n<h2><a href=\"https://github.com/openpolis/django-uwsgi-taskmanager/compare/v1.0.1...v1.0.2\" rel=\"nofollow\">1.0.2</a> - 2019-07-23</h2>\n<h3>Added</h3>\n<ul>\n<li>Add <strong>Copyright</strong> section in <code>README.md</code> file</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>Add the full <strong>GNU AGPL v3</strong> in the <code>LICENSE.md</code> file</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>Fix broken 1.0.1 URL in <code>CHANGELOG.md</code></li>\n<li>Fix TypeError in taskcategory admin</li>\n</ul>\n<h3>Removed</h3>\n<ul>\n<li>Remove unused code from models</li>\n</ul>\n<h2><a href=\"https://github.com/openpolis/django-uwsgi-taskmanager/compare/v1.0.0...v1.0.1\" rel=\"nofollow\">1.0.1</a> - 2019-07-13</h2>\n<h3>Changed</h3>\n<ul>\n<li>Rename <code>collect_commands</code> to <code>collectcommands</code></li>\n<li>Add missings setps in <code>README.md</code></li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>Fix version 1.0.0 release date in <code>CHANGELOG.md</code></li>\n<li>Add missing <code>__init__.py</code> in migrations directory</li>\n<li>Add missing <code>STATIC_ROOT</code> in demo settings</li>\n<li>Add missing media directory and settings</li>\n<li>Fix convert to local datetime function</li>\n<li>Update and complete <code>setup.py</code></li>\n</ul>\n<h2><a href=\"https://github.com/openpolis/django-uwsgi-taskmanager/releases/tag/v1.0.0\" rel=\"nofollow\">1.0.0</a> - 2019-07-12</h2>\n<h3>Added</h3>\n<ul>\n<li>First release</li>\n</ul>\n<h1>Authors</h1>\n<ul>\n<li>Gabriele Giaccari (<a href=\"https://github.com/gabbork\" rel=\"nofollow\">@gabbork</a>)</li>\n<li>Gabriele Lucci (<a href=\"https://github.com/gabrielelucci\" rel=\"nofollow\">@gabrielelucci</a>)</li>\n<li>Guglielmo Celata (<a href=\"https://github.com/guglielmo\" rel=\"nofollow\">@guglielmo</a>)</li>\n<li>Paolo Melchiorre (<a href=\"https://github.com/pauloxnet\" rel=\"nofollow\">@pauloxnet</a>)</li>\n</ul>\n<h3>GNU AFFERO GENERAL PUBLIC LICENSE</h3>\n<p>Version 3, 19 November 2007</p>\n<p>Copyright (C) 2007 Free Software Foundation, Inc.\n<a href=\"https://fsf.org/\" rel=\"nofollow\">https://fsf.org/</a></p>\n<p>Everyone is permitted to copy and distribute verbatim copies of this\nlicense document, but changing it is not allowed.</p>\n<h3>Preamble</h3>\n<p>The GNU Affero General Public License is a free, copyleft license for\nsoftware and other kinds of works, specifically designed to ensure\ncooperation with the community in the case of network server software.</p>\n<p>The licenses for most software and other practical works are designed\nto take away your freedom to share and change the works. By contrast,\nour General Public Licenses are intended to guarantee your freedom to\nshare and change all versions of a program--to make sure it remains\nfree software for all its users.</p>\n<p>When we speak of free software, we are referring to freedom, not\nprice. Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthem if you wish), that you receive source code or can get it if you\nwant it, that you can change the software or use pieces of it in new\nfree programs, and that you know you can do these things.</p>\n<p>Developers that use our General Public Licenses protect your rights\nwith two steps: (1) assert copyright on the software, and (2) offer\nyou this License which gives you legal permission to copy, distribute\nand/or modify the software.</p>\n<p>A secondary benefit of defending all users' freedom is that\nimprovements made in alternate versions of the program, if they\nreceive widespread use, become available for other developers to\nincorporate. Many developers of free software are heartened and\nencouraged by the resulting cooperation. However, in the case of\nsoftware used on network servers, this result may fail to come about.\nThe GNU General Public License permits making a modified version and\nletting the public access it on a server without ever releasing its\nsource code to the public.</p>\n<p>The GNU Affero General Public License is designed specifically to\nensure that, in such cases, the modified source code becomes available\nto the community. It requires the operator of a network server to\nprovide the source code of the modified version running there to the\nusers of that server. Therefore, public use of a modified version, on\na publicly accessible server, gives the public access to the source\ncode of the modified version.</p>\n<p>An older license, called the Affero General Public License and\npublished by Affero, was designed to accomplish similar goals. This is\na different license, not a version of the Affero GPL, but Affero has\nreleased a new version of the Affero GPL which permits relicensing\nunder this license.</p>\n<p>The precise terms and conditions for copying, distribution and\nmodification follow.</p>\n<h3>TERMS AND CONDITIONS</h3>\n<h4>0. Definitions.</h4>\n<p>\"This License\" refers to version 3 of the GNU Affero General Public\nLicense.</p>\n<p>\"Copyright\" also means copyright-like laws that apply to other kinds\nof works, such as semiconductor masks.</p>\n<p>\"The Program\" refers to any copyrightable work licensed under this\nLicense. Each licensee is addressed as \"you\". \"Licensees\" and\n\"recipients\" may be individuals or organizations.</p>\n<p>To \"modify\" a work means to copy from or adapt all or part of the work\nin a fashion requiring copyright permission, other than the making of\nan exact copy. The resulting work is called a \"modified version\" of\nthe earlier work or a work \"based on\" the earlier work.</p>\n<p>A \"covered work\" means either the unmodified Program or a work based\non the Program.</p>\n<p>To \"propagate\" a work means to do anything with it that, without\npermission, would make you directly or secondarily liable for\ninfringement under applicable copyright law, except executing it on a\ncomputer or modifying a private copy. Propagation includes copying,\ndistribution (with or without modification), making available to the\npublic, and in some countries other activities as well.</p>\n<p>To \"convey\" a work means any kind of propagation that enables other\nparties to make or receive copies. Mere interaction with a user\nthrough a computer network, with no transfer of a copy, is not\nconveying.</p>\n<p>An interactive user interface displays \"Appropriate Legal Notices\" to\nthe extent that it includes a convenient and prominently visible\nfeature that (1) displays an appropriate copyright notice, and (2)\ntells the user that there is no warranty for the work (except to the\nextent that warranties are provided), that licensees may convey the\nwork under this License, and how to view a copy of this License. If\nthe interface presents a list of user commands or options, such as a\nmenu, a prominent item in the list meets this criterion.</p>\n<h4>1. Source Code.</h4>\n<p>The \"source code\" for a work means the preferred form of the work for\nmaking modifications to it. \"Object code\" means any non-source form of\na work.</p>\n<p>A \"Standard Interface\" means an interface that either is an official\nstandard defined by a recognized standards body, or, in the case of\ninterfaces specified for a particular programming language, one that\nis widely used among developers working in that language.</p>\n<p>The \"System Libraries\" of an executable work include anything, other\nthan the work as a whole, that (a) is included in the normal form of\npackaging a Major Component, but which is not part of that Major\nComponent, and (b) serves only to enable use of the work with that\nMajor Component, or to implement a Standard Interface for which an\nimplementation is available to the public in source code form. A\n\"Major Component\", in this context, means a major essential component\n(kernel, window system, and so on) of the specific operating system\n(if any) on which the executable work runs, or a compiler used to\nproduce the work, or an object code interpreter used to run it.</p>\n<p>The \"Corresponding Source\" for a work in object code form means all\nthe source code needed to generate, install, and (for an executable\nwork) run the object code and to modify the work, including scripts to\ncontrol those activities. However, it does not include the work's\nSystem Libraries, or general-purpose tools or generally available free\nprograms which are used unmodified in performing those activities but\nwhich are not part of the work. For example, Corresponding Source\nincludes interface definition files associated with source files for\nthe work, and the source code for shared libraries and dynamically\nlinked subprograms that the work is specifically designed to require,\nsuch as by intimate data communication or control flow between those\nsubprograms and other parts of the work.</p>\n<p>The Corresponding Source need not include anything that users can\nregenerate automatically from other parts of the Corresponding Source.</p>\n<p>The Corresponding Source for a work in source code form is that same\nwork.</p>\n<h4>2. Basic Permissions.</h4>\n<p>All rights granted under this License are granted for the term of\ncopyright on the Program, and are irrevocable provided the stated\nconditions are met. This License explicitly affirms your unlimited\npermission to run the unmodified Program. The output from running a\ncovered work is covered by this License only if the output, given its\ncontent, constitutes a covered work. This License acknowledges your\nrights of fair use or other equivalent, as provided by copyright law.</p>\n<p>You may make, run and propagate covered works that you do not convey,\nwithout conditions so long as your license otherwise remains in force.\nYou may convey covered works to others for the sole purpose of having\nthem make modifications exclusively for you, or provide you with\nfacilities for running those works, provided that you comply with the\nterms of this License in conveying all material for which you do not\ncontrol copyright. Those thus making or running the covered works for\nyou must do so exclusively on your behalf, under your direction and\ncontrol, on terms that prohibit them from making any copies of your\ncopyrighted material outside their relationship with you.</p>\n<p>Conveying under any other circumstances is permitted solely under the\nconditions stated below. Sublicensing is not allowed; section 10 makes\nit unnecessary.</p>\n<h4>3. Protecting Users' Legal Rights From Anti-Circumvention Law.</h4>\n<p>No covered work shall be deemed part of an effective technological\nmeasure under any applicable law fulfilling obligations under article\n11 of the WIPO copyright treaty adopted on 20 December 1996, or\nsimilar laws prohibiting or restricting circumvention of such\nmeasures.</p>\n<p>When you convey a covered work, you waive any legal power to forbid\ncircumvention of technological measures to the extent such\ncircumvention is effected by exercising rights under this License with\nrespect to the covered work, and you disclaim any intention to limit\noperation or modification of the work as a means of enforcing, against\nthe work's users, your or third parties' legal rights to forbid\ncircumvention of technological measures.</p>\n<h4>4. Conveying Verbatim Copies.</h4>\n<p>You may convey verbatim copies of the Program's source code as you\nreceive it, in any medium, provided that you conspicuously and\nappropriately publish on each copy an appropriate copyright notice;\nkeep intact all notices stating that this License and any\nnon-permissive terms added in accord with section 7 apply to the code;\nkeep intact all notices of the absence of any warranty; and give all\nrecipients a copy of this License along with the Program.</p>\n<p>You may charge any price or no price for each copy that you convey,\nand you may offer support or warranty protection for a fee.</p>\n<h4>5. Conveying Modified Source Versions.</h4>\n<p>You may convey a work based on the Program, or the modifications to\nproduce it from the Program, in the form of source code under the\nterms of section 4, provided that you also meet all of these\nconditions:</p>\n<ul>\n<li>a) The work must carry prominent notices stating that you modified\nit, and giving a relevant date.</li>\n<li>b) The work must carry prominent notices stating that it is\nreleased under this License and any conditions added under\nsection 7. This requirement modifies the requirement in section 4\nto \"keep intact all notices\".</li>\n<li>c) You must license the entire work, as a whole, under this\nLicense to anyone who comes into possession of a copy. This\nLicense will therefore apply, along with any applicable section 7\nadditional terms, to the whole of the work, and all its parts,\nregardless of how they are packaged. This License gives no\npermission to license the work in any other way, but it does not\ninvalidate such permission if you have separately received it.</li>\n<li>d) If the work has interactive user interfaces, each must display\nAppropriate Legal Notices; however, if the Program has interactive\ninterfaces that do not display Appropriate Legal Notices, your\nwork need not make them do so.</li>\n</ul>\n<p>A compilation of a covered work with other separate and independent\nworks, which are not by their nature extensions of the covered work,\nand which are not combined with it such as to form a larger program,\nin or on a volume of a storage or distribution medium, is called an\n\"aggregate\" if the compilation and its resulting copyright are not\nused to limit the access or legal rights of the compilation's users\nbeyond what the individual works permit. Inclusion of a covered work\nin an aggregate does not cause this License to apply to the other\nparts of the aggregate.</p>\n<h4>6. Conveying Non-Source Forms.</h4>\n<p>You may convey a covered work in object code form under the terms of\nsections 4 and 5, provided that you also convey the machine-readable\nCorresponding Source under the terms of this License, in one of these\nways:</p>\n<ul>\n<li>a) Convey the object code in, or embodied in, a physical product\n(including a physical distribution medium), accompanied by the\nCorresponding Source fixed on a durable physical medium\ncustomarily used for software interchange.</li>\n<li>b) Convey the object code in, or embodied in, a physical product\n(including a physical distribution medium), accompanied by a\nwritten offer, valid for at least three years and valid for as\nlong as you offer spare parts or customer support for that product\nmodel, to give anyone who possesses the object code either (1) a\ncopy of the Corresponding Source for all the software in the\nproduct that is covered by this License, on a durable physical\nmedium customarily used for software interchange, for a price no\nmore than your reasonable cost of physically performing this\nconveying of source, or (2) access to copy the Corresponding\nSource from a network server at no charge.</li>\n<li>c) Convey individual copies of the object code with a copy of the\nwritten offer to provide the Corresponding Source. This\nalternative is allowed only occasionally and noncommercially, and\nonly if you received the object code with such an offer, in accord\nwith subsection 6b.</li>\n<li>d) Convey the object code by offering access from a designated\nplace (gratis or for a charge), and offer equivalent access to the\nCorresponding Source in the same way through the same place at no\nfurther charge. You need not require recipients to copy the\nCorresponding Source along with the object code. If the place to\ncopy the object code is a network server, the Corresponding Source\nmay be on a different server (operated by you or a third party)\nthat supports equivalent copying facilities, provided you maintain\nclear directions next to the object code saying where to find the\nCorresponding Source. Regardless of what server hosts the\nCorresponding Source, you remain obligated to ensure that it is\navailable for as long as needed to satisfy these requirements.</li>\n<li>e) Convey the object code using peer-to-peer transmission,\nprovided you inform other peers where the object code and\nCorresponding Source of the work are being offered to the general\npublic at no charge under subsection 6d.</li>\n</ul>\n<p>A separable portion of the object code, whose source code is excluded\nfrom the Corresponding Source as a System Library, need not be\nincluded in conveying the object code work.</p>\n<p>A \"User Product\" is either (1) a \"consumer product\", which means any\ntangible personal property which is normally used for personal,\nfamily, or household purposes, or (2) anything designed or sold for\nincorporation into a dwelling. In determining whether a product is a\nconsumer product, doubtful cases shall be resolved in favor of\ncoverage. For a particular product received by a particular user,\n\"normally used\" refers to a typical or common use of that class of\nproduct, regardless of the status of the particular user or of the way\nin which the particular user actually uses, or expects or is expected\nto use, the product. A product is a consumer product regardless of\nwhether the product has substantial commercial, industrial or\nnon-consumer uses, unless such uses represent the only significant\nmode of use of the product.</p>\n<p>\"Installation Information\" for a User Product means any methods,\nprocedures, authorization keys, or other information required to\ninstall and execute modified versions of a covered work in that User\nProduct from a modified version of its Corresponding Source. The\ninformation must suffice to ensure that the continued functioning of\nthe modified object code is in no case prevented or interfered with\nsolely because modification has been made.</p>\n<p>If you convey an object code work under this section in, or with, or\nspecifically for use in, a User Product, and the conveying occurs as\npart of a transaction in which the right of possession and use of the\nUser Product is transferred to the recipient in perpetuity or for a\nfixed term (regardless of how the transaction is characterized), the\nCorresponding Source conveyed under this section must be accompanied\nby the Installation Information. But this requirement does not apply\nif neither you nor any third party retains the ability to install\nmodified object code on the User Product (for example, the work has\nbeen installed in ROM).</p>\n<p>The requirement to provide Installation Information does not include a\nrequirement to continue to provide support service, warranty, or\nupdates for a work that has been modified or installed by the\nrecipient, or for the User Product in which it has been modified or\ninstalled. Access to a network may be denied when the modification\nitself materially and adversely affects the operation of the network\nor violates the rules and protocols for communication across the\nnetwork.</p>\n<p>Corresponding Source conveyed, and Installation Information provided,\nin accord with this section must be in a format that is publicly\ndocumented (and with an implementation available to the public in\nsource code form), and must require no special password or key for\nunpacking, reading or copying.</p>\n<h4>7. Additional Terms.</h4>\n<p>\"Additional permissions\" are terms that supplement the terms of this\nLicense by making exceptions from one or more of its conditions.\nAdditional permissions that are applicable to the entire Program shall\nbe treated as though they were included in this License, to the extent\nthat they are valid under applicable law. If additional permissions\napply only to part of the Program, that part may be used separately\nunder those permissions, but the entire Program remains governed by\nthis License without regard to the additional permissions.</p>\n<p>When you convey a copy of a covered work, you may at your option\nremove any additional permissions from that copy, or from any part of\nit. (Additional permissions may be written to require their own\nremoval in certain cases when you modify the work.) You may place\nadditional permissions on material, added by you to a covered work,\nfor which you have or can give appropriate copyright permission.</p>\n<p>Notwithstanding any other provision of this License, for material you\nadd to a covered work, you may (if authorized by the copyright holders\nof that material) supplement the terms of this License with terms:</p>\n<ul>\n<li>a) Disclaiming warranty or limiting liability differently from the\nterms of sections 15 and 16 of this License; or</li>\n<li>b) Requiring preservation of specified reasonable legal notices or\nauthor attributions in that material or in the Appropriate Legal\nNotices displayed by works containing it; or</li>\n<li>c) Prohibiting misrepresentation of the origin of that material,\nor requiring that modified versions of such material be marked in\nreasonable ways as different from the original version; or</li>\n<li>d) Limiting the use for publicity purposes of names of licensors\nor authors of the material; or</li>\n<li>e) Declining to grant rights under trademark law for use of some\ntrade names, trademarks, or service marks; or</li>\n<li>f) Requiring indemnification of licensors and authors of that\nmaterial by anyone who conveys the material (or modified versions\nof it) with contractual assumptions of liability to the recipient,\nfor any liability that these contractual assumptions directly\nimpose on those licensors and authors.</li>\n</ul>\n<p>All other non-permissive additional terms are considered \"further\nrestrictions\" within the meaning of section 10. If the Program as you\nreceived it, or any part of it, contains a notice stating that it is\ngoverned by this License along with a term that is a further\nrestriction, you may remove that term. If a license document contains\na further restriction but permits relicensing or conveying under this\nLicense, you may add to a covered work material governed by the terms\nof that license document, provided that the further restriction does\nnot survive such relicensing or conveying.</p>\n<p>If you add terms to a covered work in accord with this section, you\nmust place, in the relevant source files, a statement of the\nadditional terms that apply to those files, or a notice indicating\nwhere to find the applicable terms.</p>\n<p>Additional terms, permissive or non-permissive, may be stated in the\nform of a separately written license, or stated as exceptions; the\nabove requirements apply either way.</p>\n<h4>8. Termination.</h4>\n<p>You may not propagate or modify a covered work except as expressly\nprovided under this License. Any attempt otherwise to propagate or\nmodify it is void, and will automatically terminate your rights under\nthis License (including any patent licenses granted under the third\nparagraph of section 11).</p>\n<p>However, if you cease all violation of this License, then your license\nfrom a particular copyright holder is reinstated (a) provisionally,\nunless and until the copyright holder explicitly and finally\nterminates your license, and (b) permanently, if the copyright holder\nfails to notify you of the violation by some reasonable means prior to\n60 days after the cessation.</p>\n<p>Moreover, your license from a particular copyright holder is\nreinstated permanently if the copyright holder notifies you of the\nviolation by some reasonable means, this is the first time you have\nreceived notice of violation of this License (for any work) from that\ncopyright holder, and you cure the violation prior to 30 days after\nyour receipt of the notice.</p>\n<p>Termination of your rights under this section does not terminate the\nlicenses of parties who have received copies or rights from you under\nthis License. If your rights have been terminated and not permanently\nreinstated, you do not qualify to receive new licenses for the same\nmaterial under section 10.</p>\n<h4>9. Acceptance Not Required for Having Copies.</h4>\n<p>You are not required to accept this License in order to receive or run\na copy of the Program. Ancillary propagation of a covered work\noccurring solely as a consequence of using peer-to-peer transmission\nto receive a copy likewise does not require acceptance. However,\nnothing other than this License grants you permission to propagate or\nmodify any covered work. These actions infringe copyright if you do\nnot accept this License. Therefore, by modifying or propagating a\ncovered work, you indicate your acceptance of this License to do so.</p>\n<h4>10. Automatic Licensing of Downstream Recipients.</h4>\n<p>Each time you convey a covered work, the recipient automatically\nreceives a license from the original licensors, to run, modify and\npropagate that work, subject to this License. You are not responsible\nfor enforcing compliance by third parties with this License.</p>\n<p>An \"entity transaction\" is a transaction transferring control of an\norganization, or substantially all assets of one, or subdividing an\norganization, or merging organizations. If propagation of a covered\nwork results from an entity transaction, each party to that\ntransaction who receives a copy of the work also receives whatever\nlicenses to the work the party's predecessor in interest had or could\ngive under the previous paragraph, plus a right to possession of the\nCorresponding Source of the work from the predecessor in interest, if\nthe predecessor has it or can get it with reasonable efforts.</p>\n<p>You may not impose any further restrictions on the exercise of the\nrights granted or affirmed under this License. For example, you may\nnot impose a license fee, royalty, or other charge for exercise of\nrights granted under this License, and you may not initiate litigation\n(including a cross-claim or counterclaim in a lawsuit) alleging that\nany patent claim is infringed by making, using, selling, offering for\nsale, or importing the Program or any portion of it.</p>\n<h4>11. Patents.</h4>\n<p>A \"contributor\" is a copyright holder who authorizes use under this\nLicense of the Program or a work on which the Program is based. The\nwork thus licensed is called the contributor's \"contributor version\".</p>\n<p>A contributor's \"essential patent claims\" are all patent claims owned\nor controlled by the contributor, whether already acquired or\nhereafter acquired, that would be infringed by some manner, permitted\nby this License, of making, using, or selling its contributor version,\nbut do not include claims that would be infringed only as a\nconsequence of further modification of the contributor version. For\npurposes of this definition, \"control\" includes the right to grant\npatent sublicenses in a manner consistent with the requirements of\nthis License.</p>\n<p>Each contributor grants you a non-exclusive, worldwide, royalty-free\npatent license under the contributor's essential patent claims, to\nmake, use, sell, offer for sale, import and otherwise run, modify and\npropagate the contents of its contributor version.</p>\n<p>In the following three paragraphs, a \"patent license\" is any express\nagreement or commitment, however denominated, not to enforce a patent\n(such as an express permission to practice a patent or covenant not to\nsue for patent infringement). To \"grant\" such a patent license to a\nparty means to make such an agreement or commitment not to enforce a\npatent against the party.</p>\n<p>If you convey a covered work, knowingly relying on a patent license,\nand the Corresponding Source of the work is not available for anyone\nto copy, free of charge and under the terms of this License, through a\npublicly available network server or other readily accessible means,\nthen you must either (1) cause the Corresponding Source to be so\navailable, or (2) arrange to deprive yourself of the benefit of the\npatent license for this particular work, or (3) arrange, in a manner\nconsistent with the requirements of this License, to extend the patent\nlicense to downstream recipients. \"Knowingly relying\" means you have\nactual knowledge that, but for the patent license, your conveying the\ncovered work in a country, or your recipient's use of the covered work\nin a country, would infringe one or more identifiable patents in that\ncountry that you have reason to believe are valid.</p>\n<p>If, pursuant to or in connection with a single transaction or\narrangement, you convey, or propagate by procuring conveyance of, a\ncovered work, and grant a patent license to some of the parties\nreceiving the covered work authorizing them to use, propagate, modify\nor convey a specific copy of the covered work, then the patent license\nyou grant is automatically extended to all recipients of the covered\nwork and works based on it.</p>\n<p>A patent license is \"discriminatory\" if it does not include within the\nscope of its coverage, prohibits the exercise of, or is conditioned on\nthe non-exercise of one or more of the rights that are specifically\ngranted under this License. You may not convey a covered work if you\nare a party to an arrangement with a third party that is in the\nbusiness of distributing software, under which you make payment to the\nthird party based on the extent of your activity of conveying the\nwork, and under which the third party grants, to any of the parties\nwho would receive the covered work from you, a discriminatory patent\nlicense (a) in connection with copies of the covered work conveyed by\nyou (or copies made from those copies), or (b) primarily for and in\nconnection with specific products or compilations that contain the\ncovered work, unless you entered into that arrangement, or that patent\nlicense was granted, prior to 28 March 2007.</p>\n<p>Nothing in this License shall be construed as excluding or limiting\nany implied license or other defenses to infringement that may\notherwise be available to you under applicable patent law.</p>\n<h4>12. No Surrender of Others' Freedom.</h4>\n<p>If conditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License. If you cannot convey a\ncovered work so as to satisfy simultaneously your obligations under\nthis License and any other pertinent obligations, then as a\nconsequence you may not convey it at all. For example, if you agree to\nterms that obligate you to collect a royalty for further conveying\nfrom those to whom you convey the Program, the only way you could\nsatisfy both those terms and this License would be to refrain entirely\nfrom conveying the Program.</p>\n<h4>13. Remote Network Interaction; Use with the GNU General Public License.</h4>\n<p>Notwithstanding any other provision of this License, if you modify the\nProgram, your modified version must prominently offer all users\ninteracting with it remotely through a computer network (if your\nversion supports such interaction) an opportunity to receive the\nCorresponding Source of your version by providing access to the\nCorresponding Source from a network server at no charge, through some\nstandard or customary means of facilitating copying of software. This\nCorresponding Source shall include the Corresponding Source for any\nwork covered by version 3 of the GNU General Public License that is\nincorporated pursuant to the following paragraph.</p>\n<p>Notwithstanding any other provision of this License, you have\npermission to link or combine any covered work with a work licensed\nunder version 3 of the GNU General Public License into a single\ncombined work, and to convey the resulting work. The terms of this\nLicense will continue to apply to the part which is the covered work,\nbut the work with which it is combined will remain governed by version\n3 of the GNU General Public License.</p>\n<h4>14. Revised Versions of this License.</h4>\n<p>The Free Software Foundation may publish revised and/or new versions\nof the GNU Affero General Public License from time to time. Such new\nversions will be similar in spirit to the present version, but may\ndiffer in detail to address new problems or concerns.</p>\n<p>Each version is given a distinguishing version number. If the Program\nspecifies that a certain numbered version of the GNU Affero General\nPublic License \"or any later version\" applies to it, you have the\noption of following the terms and conditions either of that numbered\nversion or of any later version published by the Free Software\nFoundation. If the Program does not specify a version number of the\nGNU Affero General Public License, you may choose any version ever\npublished by the Free Software Foundation.</p>\n<p>If the Program specifies that a proxy can decide which future versions\nof the GNU Affero General Public License can be used, that proxy's\npublic statement of acceptance of a version permanently authorizes you\nto choose that version for the Program.</p>\n<p>Later license versions may give you additional or different\npermissions. However, no additional obligations are imposed on any\nauthor or copyright holder as a result of your choosing to follow a\nlater version.</p>\n<h4>15. Disclaimer of Warranty.</h4>\n<p>THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY\nAPPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT\nHOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT\nWARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND\nPERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE\nDEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR\nCORRECTION.</p>\n<h4>16. Limitation of Liability.</h4>\n<p>IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR\nCONVEYS THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES\nARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT\nNOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR\nLOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM\nTO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER\nPARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.</p>\n<h4>17. Interpretation of Sections 15 and 16.</h4>\n<p>If the disclaimer of warranty and limitation of liability provided\nabove cannot be given local legal effect according to their terms,\nreviewing courts shall apply local law that most closely approximates\nan absolute waiver of all civil liability in connection with the\nProgram, unless a warranty or assumption of liability accompanies a\ncopy of the Program in return for a fee.</p>\n<p>END OF TERMS AND CONDITIONS</p>\n<h3>How to Apply These Terms to Your New Programs</h3>\n<p>If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these\nterms.</p>\n<p>To do so, attach the following notices to the program. It is safest to\nattach them to the start of each source file to most effectively state\nthe exclusion of warranty; and each file should have at least the\n\"copyright\" line and a pointer to where the full notice is found.</p>\n<pre><code>    &lt;one line to give the program's name and a brief idea of what it does.&gt;\n    Copyright (C) &lt;year&gt;  &lt;name of author&gt;\n\n    This program is free software: you can redistribute it and/or modify\n    it under the terms of the GNU Affero General Public License as\n    published by the Free Software Foundation, either version 3 of the\n    License, or (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU Affero General Public License for more details.\n\n    You should have received a copy of the GNU Affero General Public License\n    along with this program.  If not, see &lt;https://www.gnu.org/licenses/&gt;.\n</code></pre>\n<p>Also add information on how to contact you by electronic and paper\nmail.</p>\n<p>If your software can interact with users remotely through a computer\nnetwork, you should also make sure that it provides a way for users to\nget its source. For example, if your program is a web application, its\ninterface could display a \"Source\" link that leads users to an archive\nof the code. There are many ways you could offer source, and different\nsolutions will be better for different programs; see section 13 for\nthe specific requirements.</p>\n<p>You should also get your employer (if you work as a programmer) or\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary. For more information on this, and how to apply and follow\nthe GNU AGPL, see <a href=\"https://www.gnu.org/licenses/\" rel=\"nofollow\">https://www.gnu.org/licenses/</a>.</p>\n\n          </div>"}, "last_serial": 6495875, "releases": {"1.0.1": [{"comment_text": "", "digests": {"md5": "b5fa0bacb49a2134b219c75ac0756e5b", "sha256": "599bf484e6bba8e0e4011a2697502cb01b5bedf5b922e61bd067cda39671aae5"}, "downloads": -1, "filename": "django_uwsgi_taskmanager-1.0.1-py3.7.egg", "has_sig": false, "md5_digest": "b5fa0bacb49a2134b219c75ac0756e5b", "packagetype": "bdist_egg", "python_version": "3.7", "requires_python": "~=3.6", "size": 72031, "upload_time": "2019-07-23T16:22:14", "upload_time_iso_8601": "2019-07-23T16:22:14.186200Z", "url": "https://files.pythonhosted.org/packages/8d/6e/eaf545a009d19a14d73d45b26d151275a715069493d4664a4d368e1e3f36/django_uwsgi_taskmanager-1.0.1-py3.7.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "093bd790cdd99cb78eb6e157e65d42b0", "sha256": "c8989165f68f25beaa346a853be61149d482cd755510d70879ed603c2f4d0a98"}, "downloads": -1, "filename": "django_uwsgi_taskmanager-1.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "093bd790cdd99cb78eb6e157e65d42b0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": "~=3.6", "size": 35015, "upload_time": "2019-07-13T15:00:32", "upload_time_iso_8601": "2019-07-13T15:00:32.165221Z", "url": "https://files.pythonhosted.org/packages/31/46/6be7d0817275ca372b9f6deb7c618dc6385fa942c7c5797c8f7801176d10/django_uwsgi_taskmanager-1.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f1af9cc266c690c0b966d210d87bb31a", "sha256": "43c37fba8ae61e5989aa2e665ccdd854d8c84c93556651b4afd50c047de79dc1"}, "downloads": -1, "filename": "django-uwsgi-taskmanager-1.0.1.tar.gz", "has_sig": false, "md5_digest": "f1af9cc266c690c0b966d210d87bb31a", "packagetype": "sdist", "python_version": "source", "requires_python": "~=3.6", "size": 29622, "upload_time": "2019-07-13T15:00:35", "upload_time_iso_8601": "2019-07-13T15:00:35.625597Z", "url": "https://files.pythonhosted.org/packages/35/8b/eb461d38a5c5575f3c1af0557a87c3aff534f71cc22f703268c16dd5d039/django-uwsgi-taskmanager-1.0.1.tar.gz", "yanked": false}], "1.0.2": [{"comment_text": "", "digests": {"md5": "f630e72e41d2217fec3f982d338954d2", "sha256": "0016cb7e8c42405addaef8008aaa1ca9f7e1c7fa6fc32469c2a527da67547490"}, "downloads": -1, "filename": "django_uwsgi_taskmanager-1.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "f630e72e41d2217fec3f982d338954d2", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": "~=3.6", "size": 57733, "upload_time": "2019-07-23T16:22:09", "upload_time_iso_8601": "2019-07-23T16:22:09.785777Z", "url": "https://files.pythonhosted.org/packages/b4/39/58f45789ceda059ed2caff1eb1c840e32e0fe9379c40257bc2132d944009/django_uwsgi_taskmanager-1.0.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b5d43494a57439471d33dd263769fa82", "sha256": "4561ec9042821508c38da9de6e52648e076a4226f29c11182faa44a39cdfe93f"}, "downloads": -1, "filename": "django-uwsgi-taskmanager-1.0.2.tar.gz", "has_sig": false, "md5_digest": "b5d43494a57439471d33dd263769fa82", "packagetype": "sdist", "python_version": "source", "requires_python": "~=3.6", "size": 67494, "upload_time": "2019-07-23T16:22:20", "upload_time_iso_8601": "2019-07-23T16:22:20.876924Z", "url": "https://files.pythonhosted.org/packages/bc/62/6ba441a30a5acd875811b086aa81abbd32548137f87a125d47643a96801a/django-uwsgi-taskmanager-1.0.2.tar.gz", "yanked": false}], "2.0.2": [{"comment_text": "", "digests": {"md5": "59d72e3757ea2cec512067ef5edfb9ec", "sha256": "4cbab96fc5520b113d313cf570f276e2fda82f7b923ac64ca3c03b8921560c14"}, "downloads": -1, "filename": "django_uwsgi_taskmanager-2.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "59d72e3757ea2cec512067ef5edfb9ec", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": "~=3.6", "size": 61216, "upload_time": "2020-01-10T13:50:17", "upload_time_iso_8601": "2020-01-10T13:50:17.296648Z", "url": "https://files.pythonhosted.org/packages/49/0b/5daf852485f65085ab608cef5c9e94f7d2f7b0d6a03b7197363e56c63e0f/django_uwsgi_taskmanager-2.0.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "2ce432feb531edab895dcd07b244272d", "sha256": "f5c067318635482fc6b00f00a4f66c31876961fe611be67f8b31010592823a8a"}, "downloads": -1, "filename": "django-uwsgi-taskmanager-2.0.2.tar.gz", "has_sig": false, "md5_digest": "2ce432feb531edab895dcd07b244272d", "packagetype": "sdist", "python_version": "source", "requires_python": "~=3.6", "size": 72360, "upload_time": "2020-01-10T13:50:19", "upload_time_iso_8601": "2020-01-10T13:50:19.361903Z", "url": "https://files.pythonhosted.org/packages/63/8c/b355dafe88c4a0cb88ad0327f3e560f434ecd83bc4f0e22a9e9faf776b82/django-uwsgi-taskmanager-2.0.2.tar.gz", "yanked": false}], "2.0.4": [{"comment_text": "", "digests": {"md5": "0c2f79b3de60a7990120adea3bad4f0d", "sha256": "23a39a5ac0bee2d0b14f46a6674fa296626efa1698bd0d3f2b66c754566f90af"}, "downloads": -1, "filename": "django_uwsgi_taskmanager-2.0.4-py3-none-any.whl", "has_sig": false, "md5_digest": "0c2f79b3de60a7990120adea3bad4f0d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": "~=3.6", "size": 61353, "upload_time": "2020-01-21T19:26:50", "upload_time_iso_8601": "2020-01-21T19:26:50.198020Z", "url": "https://files.pythonhosted.org/packages/41/89/09e63406ebe0addb2e48721895ca4b0ca72a981eba62b5d67fc5ae04db5d/django_uwsgi_taskmanager-2.0.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5f5249ec4f5f2f37ab2e738d7856f15d", "sha256": "9ee0b1f0c6566ae379ce423f873ba59cc5e057341be4ae1b60c660a3ebba794a"}, "downloads": -1, "filename": "django-uwsgi-taskmanager-2.0.4.tar.gz", "has_sig": false, "md5_digest": "5f5249ec4f5f2f37ab2e738d7856f15d", "packagetype": "sdist", "python_version": "source", "requires_python": "~=3.6", "size": 74608, "upload_time": "2020-01-21T19:26:51", "upload_time_iso_8601": "2020-01-21T19:26:51.885328Z", "url": "https://files.pythonhosted.org/packages/d2/d1/f9fc1aa95be307426d9baa868643f226cd61b0c93038037a6292369faee5/django-uwsgi-taskmanager-2.0.4.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "0c2f79b3de60a7990120adea3bad4f0d", "sha256": "23a39a5ac0bee2d0b14f46a6674fa296626efa1698bd0d3f2b66c754566f90af"}, "downloads": -1, "filename": "django_uwsgi_taskmanager-2.0.4-py3-none-any.whl", "has_sig": false, "md5_digest": "0c2f79b3de60a7990120adea3bad4f0d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": "~=3.6", "size": 61353, "upload_time": "2020-01-21T19:26:50", "upload_time_iso_8601": "2020-01-21T19:26:50.198020Z", "url": "https://files.pythonhosted.org/packages/41/89/09e63406ebe0addb2e48721895ca4b0ca72a981eba62b5d67fc5ae04db5d/django_uwsgi_taskmanager-2.0.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5f5249ec4f5f2f37ab2e738d7856f15d", "sha256": "9ee0b1f0c6566ae379ce423f873ba59cc5e057341be4ae1b60c660a3ebba794a"}, "downloads": -1, "filename": "django-uwsgi-taskmanager-2.0.4.tar.gz", "has_sig": false, "md5_digest": "5f5249ec4f5f2f37ab2e738d7856f15d", "packagetype": "sdist", "python_version": "source", "requires_python": "~=3.6", "size": 74608, "upload_time": "2020-01-21T19:26:51", "upload_time_iso_8601": "2020-01-21T19:26:51.885328Z", "url": "https://files.pythonhosted.org/packages/d2/d1/f9fc1aa95be307426d9baa868643f226cd61b0c93038037a6292369faee5/django-uwsgi-taskmanager-2.0.4.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:52:05 2020"}