{"info": {"author": "Javier Buzzi", "author_email": "buzzi.javier@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Environment :: Console", "Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Programming Language :: Python", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3.8", "Programming Language :: Python :: Implementation :: CPython", "Programming Language :: Python :: Implementation :: PyPy", "Topic :: Software Development :: Libraries :: Python Modules", "Topic :: Software Development :: Testing", "Topic :: Utilities"], "description": "django-squash\n========================\n\n|Travis CI| |codecov|\n\n\"django-squash\" is an enhancement built on top of the migration classes that come standard with Django. The vision and architecture of Django migrations are unchanged. We replace one command to eliminate the bloat and slowness that grows in proportion to the changes you introduce to your models over time.\n\nBefore you use this package you need to understand what the normal Django makemigrations and squashmigrations commands do. Every migration file consists of one or more operations. Some of these operations created by makemigrations make changes to Django models that do not affect the DB table for that model (such as changes to validators, help text, etc). Some of these operations created by makemigrations make changes to the DB table for that model (such as column names, data types, foreign keys, etc). Migrations that you create by hand can run any SQL statement or python code you want.\n\nYou specify for each migration operation you create by hand whether it is elidable or not. \"Elidable\" means the operation can be eliminated when you squash migrations. For example, if you split an existing table into two or more tables, you must populate the new tables from the old. Once that is done, you never need to do it again, even if you are creating a brand new DB. This is because the source table is empty when creating a new DB so it's pointless to populate those two new tables from the empty old one.\n\n\"Non-elidable\" means the operation cannot be eliminated when you squash migrations. Perhaps you are creating a very special index on a table that cannot be configured when describing the model. You have to write raw SQL that your flavor of DB understands. If you are creating a new DB, that operation must be run sometime after that table has been created.\n\nWhen you run the normal Django squashmigrations command, typically 1 to 3 migration files per app are created for you. They \"squash\" migrations for that app by consolidating all the operations in the existing migration files. The new squashed migration files replace all those prior files because they now contain all the non-elidable operations contained in those prior files. If you had 50 non-elidable operations across 20 files, you now might have 2 new squashed migration files containing all those 50 operations. You have reduced the number of files, but you have not reduced the number of operations.\n\nIf you have changed the help_text attribute of a model's field three times, you only need to preserve the last one, but the squashmigrations command preserves all of them. If you have created a model, changed it a bit, and then deleted it, you don't need to preserve any of those operations if you're creating a new DB. Why create a model and its DB table just to delete it? Over time you carry this ever-growing burden with you. The step in your testing pipeline that creates the DB runs slower and slower. Every time you deploy your app and DB to a new environment, the step that creates the DB slows down to a crawl as it runs almost every operation created since the beginning of time.\n\nThis package offers an alternate command named squash_migrations. Its name differs from the normal Django squashmigrations by just that underscore in the middle of the name. Instead of preserving all historical non-elidable operations, internally it uses the makemigrations logic in a way that assumes no prior operations exist, and that one or more \"initial\" migrations must be created to create the DB tables from the current model definitions. This results in the fewest possible operations to build your DB. Testing pipelines and deployments of new databases run much, much faster. This is especially important if you use a schema-per-tenant strategy to support hundreds or thousands of tenants. Every time you create a new schema for a new tenant you must run all migrations to create that schema. Even if you don't use a schema-per-tenant strategy, you should never tolerate long-running testing pipelines as you are forced to choose between wasting valuable developer time and cutting corners by not testing everything all the time.\n\nSo what's the catch? Two things: 1) the proper use of elidable vs. non-elidable operations, and 2) this tool REQUIRES that all databases you are maintaining never fall behind to the point where they need a migration operation you just eliminated.\n\nOur operation-eliminating squash_migrations command removes all elidable operations. That's what \"elidable\" means. We keep all non-elidable operations and call them last. But you really need to ask yourself why you are using non-elidable operations at all. What are you doing that cannot be done by simply using django.db.models.signals.post_migrate?\n\nOur squash_migration command deletes all migrations before the prior time you ran it. Run it once per release AFTER cutting the release. It must be the first thing you do before adding migrations to the new release you're working on. All databases must be on the current release, the prior release, or somewhere in between. Any DB that is BEFORE that prior release cannot go directly to the current release. It must first apply the prior release with the migrations in effect for that release and only then apply the current release, which now contains only the operations needed to go from the prior release to the current release. This is the price you must pay for keeping migration operations to the absolute minimum.\n\nThis is NOT a tutorial on migration strategy and techniques. You need to know how to design multi-app systems that avoid circular dependencies and other problems that often remain hidden until you attempt to squash migrations.\n\nWe developed this approach at the Education Advisory Board after years of frustration and experience. At first we tried to eliminate unneeded operations by tediously searching for redundant or self-eliminating operations against the same field or model. We then tried to hide existing migrations in order to get Django's makemigrations command to create the perfect, minimal operations that an initial migration would create, followed by hand-stitching the replacement and dependency statements a squashing migration needs. Then add to that all those non-elidable operations.\n\nWe found ourselves following the same tedious steps every time we squashed migrations for a new release. When you do that every 2 - 4 weeks, you get highly motivated to automate that process. We hope you take the time to improve your migration strategy and find our tool useful.\n\nSetup\n~~~~~~~~~~~~~~~~~~~~~~~~\n\n1. ``pip install django-squash``\n\n2. Add ``django_squash`` to your ``INSTALLED_APPS``.\n\n3. Profit!\n\n\nWhat this does\n~~~~~~~~~~~~~~~~~~~~~~~~\n\nLet's say you're working on an app for a couple of years with lots of changes to models and their fields. You use this tool and eliminate all unnecessary migration operations after every release. That app's ``migrations`` directory will evolve something like this.\n\n.. code-block::\n\n    app/migrations/__init__.py\n    app/migrations/0001_initial.py\n    app/migrations/0002_changes_for_release1.py\n    ...\n    app/migrations/0019_changes_for_release1.py\n\nYou cut release 1. The migration directory for that release looks exactly as above. Then you run our ``python manage.py squash_migrations`` command. It will look something like below. You might have fewer or more migration files, depending on foreign keys and other things that determine how many migration files are needed.\n\n.. code-block::\n\n    app/migrations/__init__.py\n    app/migrations/0001_initial.py\n    app/migrations/0002_changes_for_release1.py\n    ...\n    app/migrations/0019_changes_for_release1.py\n    app/migrations/0020_squashed.py\n    app/migrations/0021_squashed.py\n\nInside the ``0020_squashed.py`` and ``0021_squashed.py`` files you will find the minimum operations needed to create your current models from scratch. The ``0021_squashed.py`` file will contain all your non-elidable ``RunPython`` and ``RunSQL`` operations that you wrote by hand. The variable and function names will be different to avoid duplicate names, but they will run in the exact order you put them.\n\nNote that no migration files were deleted above. This is the only time this will happen.\n\nNow you work on release 2, adding migrations as you go. The app's ``migrations`` directory will look something like below.\n\n.. code-block::\n\n    app/migrations/__init__.py\n    app/migrations/0001_initial.py\n    app/migrations/0002_changes_for_release1.py\n    ...\n    app/migrations/0019_changes_for_release1.py\n    app/migrations/0020_squashed.py\n    app/migrations/0021_squashed.py\n    app/migrations/0022_changes_for_release2.py\n    ...\n    app/migrations/0037_changes_for_release2.py\n\nYou cut release 2. The migration directory for that release looks exactly as above. All databases at the level of release 1 will have applied all migrations up to ``0019_changes_for_release1.py``. When this release 2 is applied to them, migrations ``0020_squashed.py`` and ``0021_squashed.py`` will be faked and migrations ``0022_changes_for_release2.py`` to ``0037_changes_for_release2.py`` will be applied.\n\nThen you run our ``python manage.py squash_migrations`` command. It will look something like below.\n\n.. code-block::\n\n    app/migrations/__init__.py\n    app/migrations/0020_squashed.py\n    app/migrations/0021_squashed.py\n    app/migrations/0022_changes_for_release2.py\n    ...\n    app/migrations/0037_changes_for_release2.py\n    app/migrations/0038_squashed.py\n    app/migrations/0039_squashed.py\n\nInside the ``0038_squashed.py`` and ``0039_squashed.py`` files you will find the minimum operations needed to create your current models from scratch. Note that the migration files before the ``0020_squashed.py`` file were deleted above. When you run your tests or when you deploy this branch to a new environment and build your DB from scratch, only the ``0038_squashed.py`` and ``0039_squashed.py`` files will be used. This should run much faster than running all the operations contained in ``0020_squashed.py`` through ``0037_changes_for_release2.py``. Now you're ready to work on release 3.\n\nBut wait!! This is not realistic. You probably had to patch release 1, which required three migration files. What impact will that have on these releases?\n\nRelease 1 should now look like this:\n\n.. code-block::\n\n    app/migrations/__init__.py\n    app/migrations/0001_initial.py\n    app/migrations/0002_changes_for_release1.py\n    ...\n    app/migrations/0019_changes_for_release1.py\n    app/migrations/0020_changes_for_release1.py\n    app/migrations/0021_changes_for_release1.py\n    app/migrations/0022_changes_for_release1.py\n\nYou must insert those same migrations logically AFTER what release 1 looked like IMMEDIATELY after squashing and BEFORE any migrations were introduced for release 2.\n\nDone correctly release 2 should now look like the following except it will be ordered perfectly alphabetically:\n\n.. code-block::\n\n    app/migrations/__init__.py\n    app/migrations/0001_initial.py\n    app/migrations/0002_changes_for_release1.py\n    ...\n    app/migrations/0019_changes_for_release1.py\n    app/migrations/0020_squashed.py\n    app/migrations/0021_squashed.py\n    \n    app/migrations/0020_changes_for_release1.py\n    app/migrations/0021_changes_for_release1.py\n    app/migrations/0022_changes_for_release1.py\n    \n    app/migrations/0022_changes_for_release2.py\n    ...\n    app/migrations/0037_changes_for_release2.py\n\nYou have to manually change ``0020_changes_for_release1.py`` to depend on ``0021_squashed.py`` instead of ``0019_changes_for_release1.py``. This is how you insert it logically between release 1 and release 2.\n\nRun tests\n~~~~~~~~~~~~~~~~~~~~~~~~\n\n.. code-block:: shell\n\n    pip install -e '.[test]'\n    coverage run setup.py test\n    coverage report -m\n\n\n.. |Travis CI| image:: https://travis-ci.com/kingbuzzman/django-squash.svg?branch=develop\n   :target: https://travis-ci.com/kingbuzzman/django-squash\n\n.. |codecov| image:: https://codecov.io/gh/kingbuzzman/django-squash/branch/develop/graph/badge.svg\n  :target: https://codecov.io/gh/kingbuzzman/django-squash", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/kingbuzzman/django-squash", "keywords": "django migration squashing squash", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "django-squash", "package_url": "https://pypi.org/project/django-squash/", "platform": "any", "project_url": "https://pypi.org/project/django-squash/", "project_urls": {"Homepage": "https://github.com/kingbuzzman/django-squash"}, "release_url": "https://pypi.org/project/django-squash/0.0.4/", "requires_dist": null, "requires_python": "!=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*", "summary": "A migration squasher that doesn't care how Humpty Dumpty was put together.", "version": "0.0.4", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><a href=\"https://travis-ci.com/kingbuzzman/django-squash\" rel=\"nofollow\"><img alt=\"Travis CI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/99ad9b10461365ca9acd3f137fe8e3a505b9d4ad/68747470733a2f2f7472617669732d63692e636f6d2f6b696e6762757a7a6d616e2f646a616e676f2d7371756173682e7376673f6272616e63683d646576656c6f70\"></a> <a href=\"https://codecov.io/gh/kingbuzzman/django-squash\" rel=\"nofollow\"><img alt=\"codecov\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/f39b6f03dfdccfd871c2cb123783cbae82cb1d2e/68747470733a2f2f636f6465636f762e696f2f67682f6b696e6762757a7a6d616e2f646a616e676f2d7371756173682f6272616e63682f646576656c6f702f67726170682f62616467652e737667\"></a></p>\n<p>“django-squash” is an enhancement built on top of the migration classes that come standard with Django. The vision and architecture of Django migrations are unchanged. We replace one command to eliminate the bloat and slowness that grows in proportion to the changes you introduce to your models over time.</p>\n<p>Before you use this package you need to understand what the normal Django makemigrations and squashmigrations commands do. Every migration file consists of one or more operations. Some of these operations created by makemigrations make changes to Django models that do not affect the DB table for that model (such as changes to validators, help text, etc). Some of these operations created by makemigrations make changes to the DB table for that model (such as column names, data types, foreign keys, etc). Migrations that you create by hand can run any SQL statement or python code you want.</p>\n<p>You specify for each migration operation you create by hand whether it is elidable or not. “Elidable” means the operation can be eliminated when you squash migrations. For example, if you split an existing table into two or more tables, you must populate the new tables from the old. Once that is done, you never need to do it again, even if you are creating a brand new DB. This is because the source table is empty when creating a new DB so it’s pointless to populate those two new tables from the empty old one.</p>\n<p>“Non-elidable” means the operation cannot be eliminated when you squash migrations. Perhaps you are creating a very special index on a table that cannot be configured when describing the model. You have to write raw SQL that your flavor of DB understands. If you are creating a new DB, that operation must be run sometime after that table has been created.</p>\n<p>When you run the normal Django squashmigrations command, typically 1 to 3 migration files per app are created for you. They “squash” migrations for that app by consolidating all the operations in the existing migration files. The new squashed migration files replace all those prior files because they now contain all the non-elidable operations contained in those prior files. If you had 50 non-elidable operations across 20 files, you now might have 2 new squashed migration files containing all those 50 operations. You have reduced the number of files, but you have not reduced the number of operations.</p>\n<p>If you have changed the help_text attribute of a model’s field three times, you only need to preserve the last one, but the squashmigrations command preserves all of them. If you have created a model, changed it a bit, and then deleted it, you don’t need to preserve any of those operations if you’re creating a new DB. Why create a model and its DB table just to delete it? Over time you carry this ever-growing burden with you. The step in your testing pipeline that creates the DB runs slower and slower. Every time you deploy your app and DB to a new environment, the step that creates the DB slows down to a crawl as it runs almost every operation created since the beginning of time.</p>\n<p>This package offers an alternate command named squash_migrations. Its name differs from the normal Django squashmigrations by just that underscore in the middle of the name. Instead of preserving all historical non-elidable operations, internally it uses the makemigrations logic in a way that assumes no prior operations exist, and that one or more “initial” migrations must be created to create the DB tables from the current model definitions. This results in the fewest possible operations to build your DB. Testing pipelines and deployments of new databases run much, much faster. This is especially important if you use a schema-per-tenant strategy to support hundreds or thousands of tenants. Every time you create a new schema for a new tenant you must run all migrations to create that schema. Even if you don’t use a schema-per-tenant strategy, you should never tolerate long-running testing pipelines as you are forced to choose between wasting valuable developer time and cutting corners by not testing everything all the time.</p>\n<p>So what’s the catch? Two things: 1) the proper use of elidable vs. non-elidable operations, and 2) this tool REQUIRES that all databases you are maintaining never fall behind to the point where they need a migration operation you just eliminated.</p>\n<p>Our operation-eliminating squash_migrations command removes all elidable operations. That’s what “elidable” means. We keep all non-elidable operations and call them last. But you really need to ask yourself why you are using non-elidable operations at all. What are you doing that cannot be done by simply using django.db.models.signals.post_migrate?</p>\n<p>Our squash_migration command deletes all migrations before the prior time you ran it. Run it once per release AFTER cutting the release. It must be the first thing you do before adding migrations to the new release you’re working on. All databases must be on the current release, the prior release, or somewhere in between. Any DB that is BEFORE that prior release cannot go directly to the current release. It must first apply the prior release with the migrations in effect for that release and only then apply the current release, which now contains only the operations needed to go from the prior release to the current release. This is the price you must pay for keeping migration operations to the absolute minimum.</p>\n<p>This is NOT a tutorial on migration strategy and techniques. You need to know how to design multi-app systems that avoid circular dependencies and other problems that often remain hidden until you attempt to squash migrations.</p>\n<p>We developed this approach at the Education Advisory Board after years of frustration and experience. At first we tried to eliminate unneeded operations by tediously searching for redundant or self-eliminating operations against the same field or model. We then tried to hide existing migrations in order to get Django’s makemigrations command to create the perfect, minimal operations that an initial migration would create, followed by hand-stitching the replacement and dependency statements a squashing migration needs. Then add to that all those non-elidable operations.</p>\n<p>We found ourselves following the same tedious steps every time we squashed migrations for a new release. When you do that every 2 - 4 weeks, you get highly motivated to automate that process. We hope you take the time to improve your migration strategy and find our tool useful.</p>\n<div id=\"setup\">\n<h2>Setup</h2>\n<ol>\n<li><tt>pip install <span class=\"pre\">django-squash</span></tt></li>\n<li>Add <tt>django_squash</tt> to your <tt>INSTALLED_APPS</tt>.</li>\n<li>Profit!</li>\n</ol>\n</div>\n<div id=\"what-this-does\">\n<h2>What this does</h2>\n<p>Let’s say you’re working on an app for a couple of years with lots of changes to models and their fields. You use this tool and eliminate all unnecessary migration operations after every release. That app’s <tt>migrations</tt> directory will evolve something like this.</p>\n<pre>app/migrations/__init__.py\napp/migrations/0001_initial.py\napp/migrations/0002_changes_for_release1.py\n...\napp/migrations/0019_changes_for_release1.py\n</pre>\n<p>You cut release 1. The migration directory for that release looks exactly as above. Then you run our <tt>python manage.py squash_migrations</tt> command. It will look something like below. You might have fewer or more migration files, depending on foreign keys and other things that determine how many migration files are needed.</p>\n<pre>app/migrations/__init__.py\napp/migrations/0001_initial.py\napp/migrations/0002_changes_for_release1.py\n...\napp/migrations/0019_changes_for_release1.py\napp/migrations/0020_squashed.py\napp/migrations/0021_squashed.py\n</pre>\n<p>Inside the <tt>0020_squashed.py</tt> and <tt>0021_squashed.py</tt> files you will find the minimum operations needed to create your current models from scratch. The <tt>0021_squashed.py</tt> file will contain all your non-elidable <tt>RunPython</tt> and <tt>RunSQL</tt> operations that you wrote by hand. The variable and function names will be different to avoid duplicate names, but they will run in the exact order you put them.</p>\n<p>Note that no migration files were deleted above. This is the only time this will happen.</p>\n<p>Now you work on release 2, adding migrations as you go. The app’s <tt>migrations</tt> directory will look something like below.</p>\n<pre>app/migrations/__init__.py\napp/migrations/0001_initial.py\napp/migrations/0002_changes_for_release1.py\n...\napp/migrations/0019_changes_for_release1.py\napp/migrations/0020_squashed.py\napp/migrations/0021_squashed.py\napp/migrations/0022_changes_for_release2.py\n...\napp/migrations/0037_changes_for_release2.py\n</pre>\n<p>You cut release 2. The migration directory for that release looks exactly as above. All databases at the level of release 1 will have applied all migrations up to <tt>0019_changes_for_release1.py</tt>. When this release 2 is applied to them, migrations <tt>0020_squashed.py</tt> and <tt>0021_squashed.py</tt> will be faked and migrations <tt>0022_changes_for_release2.py</tt> to <tt>0037_changes_for_release2.py</tt> will be applied.</p>\n<p>Then you run our <tt>python manage.py squash_migrations</tt> command. It will look something like below.</p>\n<pre>app/migrations/__init__.py\napp/migrations/0020_squashed.py\napp/migrations/0021_squashed.py\napp/migrations/0022_changes_for_release2.py\n...\napp/migrations/0037_changes_for_release2.py\napp/migrations/0038_squashed.py\napp/migrations/0039_squashed.py\n</pre>\n<p>Inside the <tt>0038_squashed.py</tt> and <tt>0039_squashed.py</tt> files you will find the minimum operations needed to create your current models from scratch. Note that the migration files before the <tt>0020_squashed.py</tt> file were deleted above. When you run your tests or when you deploy this branch to a new environment and build your DB from scratch, only the <tt>0038_squashed.py</tt> and <tt>0039_squashed.py</tt> files will be used. This should run much faster than running all the operations contained in <tt>0020_squashed.py</tt> through <tt>0037_changes_for_release2.py</tt>. Now you’re ready to work on release 3.</p>\n<p>But wait!! This is not realistic. You probably had to patch release 1, which required three migration files. What impact will that have on these releases?</p>\n<p>Release 1 should now look like this:</p>\n<pre>app/migrations/__init__.py\napp/migrations/0001_initial.py\napp/migrations/0002_changes_for_release1.py\n...\napp/migrations/0019_changes_for_release1.py\napp/migrations/0020_changes_for_release1.py\napp/migrations/0021_changes_for_release1.py\napp/migrations/0022_changes_for_release1.py\n</pre>\n<p>You must insert those same migrations logically AFTER what release 1 looked like IMMEDIATELY after squashing and BEFORE any migrations were introduced for release 2.</p>\n<p>Done correctly release 2 should now look like the following except it will be ordered perfectly alphabetically:</p>\n<pre>app/migrations/__init__.py\napp/migrations/0001_initial.py\napp/migrations/0002_changes_for_release1.py\n...\napp/migrations/0019_changes_for_release1.py\napp/migrations/0020_squashed.py\napp/migrations/0021_squashed.py\n\napp/migrations/0020_changes_for_release1.py\napp/migrations/0021_changes_for_release1.py\napp/migrations/0022_changes_for_release1.py\n\napp/migrations/0022_changes_for_release2.py\n...\napp/migrations/0037_changes_for_release2.py\n</pre>\n<p>You have to manually change <tt>0020_changes_for_release1.py</tt> to depend on <tt>0021_squashed.py</tt> instead of <tt>0019_changes_for_release1.py</tt>. This is how you insert it logically between release 1 and release 2.</p>\n</div>\n<div id=\"run-tests\">\n<h2>Run tests</h2>\n<pre>pip install -e <span class=\"s1\">'.[test]'</span>\ncoverage run setup.py <span class=\"nb\">test</span>\ncoverage report -m\n</pre>\n</div>\n\n          </div>"}, "last_serial": 6861806, "releases": {"0.0.1": [{"comment_text": "", "digests": {"md5": "6d0c83ba79341242c67625aabe025e82", "sha256": "5b77daf53b767cc5e538a091b95ff4d4c0a431f221eaa6b199f7cceddcaaa773"}, "downloads": -1, "filename": "django_squash-0.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "6d0c83ba79341242c67625aabe025e82", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": "!=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*", "size": 14397, "upload_time": "2019-05-26T17:41:42", "upload_time_iso_8601": "2019-05-26T17:41:42.392384Z", "url": "https://files.pythonhosted.org/packages/ce/66/4095e778649c8ff92222cdda74232a16f0af369a4aa98646e97b755483cb/django_squash-0.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ce754d455de9170f214cf59afa582746", "sha256": "7670bde0505a1aa59ffe7fcf95c9984f8c240035f9228459c40ab0d86847445d"}, "downloads": -1, "filename": "django_squash-0.0.1.tar.gz", "has_sig": false, "md5_digest": "ce754d455de9170f214cf59afa582746", "packagetype": "sdist", "python_version": "source", "requires_python": "!=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*", "size": 11060, "upload_time": "2019-05-26T17:41:44", "upload_time_iso_8601": "2019-05-26T17:41:44.971887Z", "url": "https://files.pythonhosted.org/packages/b3/74/cea0617c108ae339145d16f5b9cc9a5c1e7e018ebf1b75f940843cfbee6e/django_squash-0.0.1.tar.gz", "yanked": false}], "0.0.2": [{"comment_text": "", "digests": {"md5": "0efc9bd655d8e744bbdd0042ee04262e", "sha256": "3cbdf16362eb29036c702b2631a5cbd8d1d9345ef4bbd6cd3cf9de708b294d84"}, "downloads": -1, "filename": "django_squash-0.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "0efc9bd655d8e744bbdd0042ee04262e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": "!=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*", "size": 22180, "upload_time": "2020-03-17T17:08:38", "upload_time_iso_8601": "2020-03-17T17:08:38.626488Z", "url": "https://files.pythonhosted.org/packages/0a/86/0cbf0c50a4a59b8ec578f915a67f59406075751b1c414b6908265ee04000/django_squash-0.0.2-py3-none-any.whl", "yanked": false}], "0.0.3": [{"comment_text": "", "digests": {"md5": "69dbb9e94a58f779eb718f89798fbbea", "sha256": "f77d500b1b7dc7c792f8c3197ca98cec6e94fce06f4dbff2d5a44c85f9aeb373"}, "downloads": -1, "filename": "django_squash-0.0.3-py3-none-any.whl", "has_sig": false, "md5_digest": "69dbb9e94a58f779eb718f89798fbbea", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": "!=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*", "size": 18356, "upload_time": "2020-03-19T21:32:02", "upload_time_iso_8601": "2020-03-19T21:32:02.177625Z", "url": "https://files.pythonhosted.org/packages/b1/50/d32a1d8fed061f98cc7231fb5e38ae8143aa33b611614303a0c15570fbe8/django_squash-0.0.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7e93b33cb30bddc434365aa8071a6738", "sha256": "e680517ff792cab011f6219b52991524cd663de2ef3a26c5d6a4a95d4ab35a5b"}, "downloads": -1, "filename": "django_squash-0.0.3.tar.gz", "has_sig": false, "md5_digest": "7e93b33cb30bddc434365aa8071a6738", "packagetype": "sdist", "python_version": "source", "requires_python": "!=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*", "size": 18667, "upload_time": "2020-03-19T21:32:03", "upload_time_iso_8601": "2020-03-19T21:32:03.722701Z", "url": "https://files.pythonhosted.org/packages/8a/b6/db2a6ec40565300bff9a4be6ea24738f472865133977bb931fa833abf6af/django_squash-0.0.3.tar.gz", "yanked": false}], "0.0.4": [{"comment_text": "", "digests": {"md5": "0334794cf9ef0c89434ac745d007c714", "sha256": "bd9d2b283c8d030268402b17fc4b54fed67ab9c55d8b0056e43fd98ded6b147f"}, "downloads": -1, "filename": "django_squash-0.0.4-py3-none-any.whl", "has_sig": false, "md5_digest": "0334794cf9ef0c89434ac745d007c714", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": "!=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*", "size": 18692, "upload_time": "2020-03-22T21:13:13", "upload_time_iso_8601": "2020-03-22T21:13:13.978815Z", "url": "https://files.pythonhosted.org/packages/a2/2b/f4e936aa7cbfdecb08def009784b1cd07d36dba29e1647ea4f280028ff01/django_squash-0.0.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "768c68751f54e1910668587a965a2d42", "sha256": "b1c7c24eea4345ad426ec137c9759e8e36050f0d2a1fccb0b5617823fa2101eb"}, "downloads": -1, "filename": "django_squash-0.0.4.tar.gz", "has_sig": false, "md5_digest": "768c68751f54e1910668587a965a2d42", "packagetype": "sdist", "python_version": "source", "requires_python": "!=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*", "size": 18817, "upload_time": "2020-03-22T21:11:30", "upload_time_iso_8601": "2020-03-22T21:11:30.897477Z", "url": "https://files.pythonhosted.org/packages/56/aa/8cb7dbd27f080dbd1950441d99b57fb91e2706aa2e4421aad3b5a435cb02/django_squash-0.0.4.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "0334794cf9ef0c89434ac745d007c714", "sha256": "bd9d2b283c8d030268402b17fc4b54fed67ab9c55d8b0056e43fd98ded6b147f"}, "downloads": -1, "filename": "django_squash-0.0.4-py3-none-any.whl", "has_sig": false, "md5_digest": "0334794cf9ef0c89434ac745d007c714", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": "!=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*", "size": 18692, "upload_time": "2020-03-22T21:13:13", "upload_time_iso_8601": "2020-03-22T21:13:13.978815Z", "url": "https://files.pythonhosted.org/packages/a2/2b/f4e936aa7cbfdecb08def009784b1cd07d36dba29e1647ea4f280028ff01/django_squash-0.0.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "768c68751f54e1910668587a965a2d42", "sha256": "b1c7c24eea4345ad426ec137c9759e8e36050f0d2a1fccb0b5617823fa2101eb"}, "downloads": -1, "filename": "django_squash-0.0.4.tar.gz", "has_sig": false, "md5_digest": "768c68751f54e1910668587a965a2d42", "packagetype": "sdist", "python_version": "source", "requires_python": "!=3.0.*, !=3.1.*, !=3.2.*, !=3.3.*", "size": 18817, "upload_time": "2020-03-22T21:11:30", "upload_time_iso_8601": "2020-03-22T21:11:30.897477Z", "url": "https://files.pythonhosted.org/packages/56/aa/8cb7dbd27f080dbd1950441d99b57fb91e2706aa2e4421aad3b5a435cb02/django_squash-0.0.4.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:53:00 2020"}