{"info": {"author": "Rob Atkinson", "author_email": "rob@metalinkage.com", "bugtrack_url": null, "classifiers": [], "description": "# rdf-io\n\nUtilities to link Django to RDF stores and inferencers.\n\nWhy: Allows semantic data models and rules to be used to generate rich views of content, and expose standardised access and query interfaces - such as SPARQL and the Linked Data Platform.  Conversely, allow use of Django to manage content in RDF stores :-)\n\n## Features\n* RDF serializer driven by editable mapping rules\n* Configureable ServiceBindings to RDF store APIs for different CRUD and inferencing tasks\n* RDF source load and push to designated RDF store\n* chainable inferencing support and persistence handling\n* Extensible to support specific information models - such as SKOS\n* Configurable metadata properties for arbitrary Django objects.\nRDF_IO has initial data that loads up common W3C namespaces and prefixes ready for use (OWL, RDF, DCAT) \n\n## installation\n\nget a working copy with\n```\ngit clone https://github.com/rob-metalinkage/django-rdf-io\npip install -e (where you put it)\n```\nin your master django project:\n* add 'rdf_io' to the INSTALLED_APPS  in settings.py\n* add    ` url(r\"^rdf_io/\", include('rdf_io.urls'))`  to urls.py\n* optionally define setting for RDFSERVER and RDFSERVER_API\n* run manage.py makemigrations\n* run manage.py migrate\n\n## Automated publishing of updated to RDF\nThis is really only guaranteed for pushing additions and updates - deletions are not handled, although updates will tend to replace statements.\n\n### on startup to enable (necessary after django-reload)\nNB - TODO a way to force this to happen automatically - needs to happen after both RDF_IO and the target models are installed, so cant go in initialisation for either model.\n\n`{SERVER_URL}/rdf_io/ctl_signals/sync`\n\n### to turn on publishing for a model class\n1) check Auto-push flag is checked in an ObjectMapping for that model class\n2) save - should register a post_save signal for the model class\n\n### to turn on/off  publishing for all model classes \n`{SERVER_URL}/rdf_io/ctl_signals/(on/off)`\n\n### \n\n\n## Usage\n\n### Optional RDF store configuration\n0) Set up any target RDF stores (currently supported are the LDP API and RDF4J/Apache Sesame API) - note RDF_IO can be used to import and serialise django objects as RDF without any RDF stores, and different RDF stores can be used for different objects\n1) Configure variables for use in setting up ServiceBindings to RDF stores and inferencing engines\n2) Set up ServiceBindings for your target stores (via the admin interface or migrations)\n3) Pre-load any static data and rules required by your reasoner (e.g. SHACL) - or set up migrations to load these using ImportedResource bound to appropriate ServiceBindings\n\n### Basic RDF serialisation\n1) Define mappings for your target models using the admin interface $SERVER/admin/rdf_io\n2) To create an online resource use \n\t\t`{SERVER_URL}/rdf_io/to_rdf/{model_name}/id/{model_id}`\n\t\t`{SERVER_URL}/rdf_io/to_rdf/{model_name}/key/{model_natural_key}`\n\t\t\n### RDF publishing\t\t\n1) Configure one or more ServiceBindings and attach to the relevant ObjectMapping (if updates to that Object are to be published to RDF store - otherwise ServiceBindings can be directly bound to individual ImportedResource objects)\n  NOTE: A service binding of type VALIDATION will cause checks to be performed - and on failure will abort the service chain and invoke on_fail bindings (not yet implemented) \n  NOTE: An service binding of type INFERENCING will augment the data to be stored, but not save it. It should be chained to PERSIST binding(s).\n2) To publish a specific object to the configured RDF store:\n\t\t`{SERVER_URL}/rdf_io/pub_rdf/{model_name}/{model_id}`\n\t\t(note that this will happen automatically on object save if an object mapping is defined)\n3) To republish all objects for a set of django models:\n\t\t`{SERVER_URL}/rdf_io/sync_remote/{model_name}[,{model_name}]*`\n\n\t\t\t\t\nNOTE: for the \t/rdf_io/to_rdf/{model_name}/key/{model_natural_key} to work the target model must define a manage with a get_by_natural_key method that takes a unique single term - such as a uri - note this will allow use of CURIES such as myns:myterm where the prefix is registered as a namespace in the RDF_IO space. If a CURIE is detected, then RDF_IO will try to match first as a string, then expand to a full URI and match.\n\n\n### Inferencing\nInferencing allows RDF based reasoning to generate richer views of inter-related data, and potentially derive a range of additional knowledge. This can all be done inside custom logic, but RDF_IO allows standards such as SHACL etc to be used to capture this and avoids hard-coding and hiding all these rules.\n\nwhen an object is saved, any enabled inferencing ServiceBindings will be applied before saving (stores may invoke loaded rules post-save)\n\n1) Set up a RDF Inferencer - note this may be a matter of enabling inferencing on the default store, or setting up a new store. If rules cannot safely co-exist, then multiple inferencing stores may be configured.\n2) Load inferencing rules to the Inferencer (optionally using ImportedResource objects and PERSIST_REPLACE service bindings) \n3) Create service bindings for inferencing - these may be chained using Next_service \n4) Make sure that the inferencing store is cleared of temporary data - using an appropriate PERSISTENCE_DELETE ServiceBinding as a final step in the chain \n\nNOTE: Inferencing rules may need to be more complex if a separate inferencing store is set up, but some of the data needed for inferencing resides in the main target repository. Using SPIN, this leads to constructs like:\n\n'''\n\t\t\t WHERE {\n\t\t\t\t?mainrepo a service:Repo  .\n\n\t\t\t\t?A a skos:Concept .\n\t\t\t\tOPTIONAL { ?A skos:broader ?B . }\n\t\t\t\tOPTIONAL { ?B skos:narrower ?A }\n\t\t\t\tOPTIONAL { SERVICE ?mainrepo\n\t\t\t\t\t\t{\n\t\t\t\t\t\t\tOPTIONAL { ?A skos:broader ?B . }\n\t\t\t\t\t\t\tOPTIONAL { ?B skos:narrower ?A . }\n\n\t\t\t\t\t\t}\n\t\t\t\t\t}\n\t\t\t\t\t\nwhere ?mainrepo is an object loaded to the inferencer to define the target data store, allowing such a rule to be reusable.\n \n'''\n\n### Object Mappings\nMappings to RDF are done for Django models. Each mapping consists of:\n1) an identifier mapping to generate the URI for the object\n2) a set of AttributeMapping elements that map a list of values to a RDF predicate\n3) a set of EmbeddedMapping that map a list of values to complex object property (optionally wrapped in a blank node)\n4) a filter to limit the set of objects the mapping applies to\n\nMore than one object mapping may exist for a Django model. The RDF graph is the union of all the configured Object Mapping outputs.\n(Note that a ServiceBinding may be bound to a specific mapping, but the default behaviour is for this to be used to find all ServiceBindings for a gioven django modeltype - and they all get the composite graph (this may be changed to supported publishing different graphs to different RDf stores in future.)\n\n### Mapping syntax\nMapping is non trivial - because the elements of your model may need to extracted from related models \n\nMapping is from elements in a Django model to a RDF value (a URI or a literal)\n\nsource model elements may be defined using XPath-like syntax, with nesting using django filter style __, a__b .(dot) or / notation, where each element of the path may support an optional filter. \n```\npath = (literal|element([./]element)*)\n\nliteral = \"a quoted string\" | 'a quoted string' | <a URI>  \n\nelement = (property|related_model_expr)([filter])?\n\nproperty = a valid name of a property of a django model \n\nrelated_model_expr = model_name(\\({property}\\))? \n\n\nfilter = (field(!)?=literal)((,| AND )field(!)?=literal)* | literal((,| OR )literal)*\n```\n\nNotes:\n* filters on related models will be evaluated within the database using django filters, filters on property values will be performed during serialisation.\n\n* literal values of None or NULL are treated as None or empty strings, as per Django practice.\n\n* filters on properties are a simple list of possible matches (, is the same as \" OR \" ) and apply to the element of the path \n  person.title['MRS','MISS','MS']  would match any title with value \"MRS\", \"MISS\", \"MS\"\n\n* filters on related objects are property=value syntax. Properties use django-stlye paths - i.e. notation.namespace.prefix=skos\n\n* if a ManyToMany field is used through an intermediary, then use the related_model_expr - and if this is a self-relation then specify the property : eg.\nsemrelation(origin_concept)[rel_type='1'].target_concept\n \n## Status: \nbeta, functionally complete initial capability:\n* TTL serialisation of a given model (for which a mapping has been registered) \n* Publishing to remote LDP service using per-model templates to define LDP resources\n* Autoconfiguring of signals so that objects with mappings are published on post_ save\n* syc_remote method to push all objects of list of model types (push is idempotent - safe to repeat)\n* sophisticated property-chains with per-level filter options in attribute marmotta\n* tested in context of geonode project under django 1.6\n* tested against django 1.8.6 and 1.11\n\ntodo:\n* implement global filters for object mappings (to limit mappings to a subset)\n* set up signals and methods to delete objects from remote store\n\n## API\n\n### Serialising within python\n```\nfrom rdf_io.views import build_rdf\nfrom django.contrib.contenttypes.models import ContentType\nfrom rdf_io.models import ObjectMapping\n\nct = ContentType.objects.get(model=model)\nobj_mapping_list=ObjectMapping.objects.filter(content_type=ct)\nbuild_rdf(gr,obj, obj_mapping_list)  returns a rdflib.Graph()\ngr.serialize(format=\"turtle\")\n```\n### Serialising using django views:\n\n`{SERVER_URL}/rdf_io/to_rdf/{model_name}/{model_id}`\n\n\n\n\n## Deprecated \n## Marmotta LDP\n* deploy marmotta.war and configure as per Marmotta instructions\n* define resource container patterns for different models\n\ne.g.\n\n```\n# RDF triplestore settings\nRDFSTORE = { \n    'default' : {\n        'server' : \"\".join((SITEURL,\":8080/marmotta\" )),\n        # model and slug are special - slug will revert to id if not present\n        'target' : \"/ldp/{model}/{slug}\",\n        # this could be pulled from settings\n        'auth' : ('admin', 'pass123')\n        },\n    # define special patterns for nested models\n    'scheme' : {\n        'target' : \"/ldp/voc/{slug}\",\n        },\n    'concept' : {\n        'target' : \"/ldp/voc/{scheme__slug}/{term}\",\n        }\n}        \n```   \n\n* create containers necessary for patterns (eg /ldp/voc) in the example above\n* deploy reasoning rules for target models (to generate additional statements that can be inferred from the published data - this is where the power comes in)\n - see http://eagle-dev.salzburgresearch.at/reasoner/admin/about.html\n e.g.\n```\n curl -i -H \"Content-Type: text/plain\" -X POST --data-binary @fixtures/skos.kwrl http://localhost:8080/marmotta/reasoner/program/skos.kwrl\n curl -i -X GET http://localhost:8080/marmotta/reasoner/program/skos.kwrl\n curl -i -X GET \n curl -i -H \"Content-Type: text/plain\" -X POST --data-binary @skos.skwrl http://localhost:8080/marmotta/reasoner/program/skos.skwrl\n ```\n### Operations\n\nIf auto_publish is set in an Object Mapping then the RDF-IO mapping is triggered automatically when saving an object once an ObjectMapping is defined for that object type.\n\nA bulk load to the RDF store can be achieved with /rdf_io/sync_remote/{model}(,{model})*\n\nNote that containers need to be create in the right order - so for the SKOS example  this must be /rdf_io/sync_remote/scheme,concept\n\n\n# Design Goals\n\n* Apps could define default settings (the mappings to RDF) - and these will just be ignored if the serializer is not present. \n* When bringing in the serializer, if you wanted to be able to serialize a Class in an app for which there are no default mappings, it should be possible to define these (create a rdf_mappings.py file in the top project)\n* The top project will allow either the default mappings for an app to be overridden, either as a whole or on a per-mapping basis (i.e. change or add mappings for individual attributes)\n* the serialiser would be available as a stand-alone serialiser for dumpdata (and extended to be a deserialiser for loaddata) - but also able to be hooked up to post the serialized data to an external service - so my serialiser app might have a model to capture connection parameters for such services - and other app settings would be able to define connections in this model and bind different model's rdf mappings to different target services.\n\nWe have four types of apps then:\n1 the master project\n1 the RDF serializer utility\n1 imported apps that have default RDF serializations\n1 imported apps that may or may not have RDF serialisations defined in the project settings.\n\nI suspect that this may all be a fairly common pattern - but I've only seen far more heavyweight approaches to RDF trying to fully model RDF and implement SPARQL - all I want to do is spit some stuff out into an external triple-store.\n\ndefault RDF serialisations are handled by loading initial_data fixtures. RDF_IO objects are defined using natural keys to allow default mappings for modules to be loaded in any order. It may be more elegant to use settings so these defaults can be customised more easily.\n\nSignals are registered when an ObjectMapping is defined for a model.", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "", "keywords": "", "license": "BSD", "maintainer": "", "maintainer_email": "", "name": "django-rdf-io", "package_url": "https://pypi.org/project/django-rdf-io/", "platform": "", "project_url": "https://pypi.org/project/django-rdf-io/", "project_urls": null, "release_url": "https://pypi.org/project/django-rdf-io/0.1/", "requires_dist": null, "requires_python": "", "summary": "Pluggable application for mapping elements of django models to an external RDF store", "version": "0.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            # rdf-io<br><br>Utilities to link Django to RDF stores and inferencers.<br><br>Why: Allows semantic data models and rules to be used to generate rich views of content, and expose standardised access and query interfaces - such as SPARQL and the Linked Data Platform.  Conversely, allow use of Django to manage content in RDF stores :-)<br><br>## Features<br>* RDF serializer driven by editable mapping rules<br>* Configureable ServiceBindings to RDF store APIs for different CRUD and inferencing tasks<br>* RDF source load and push to designated RDF store<br>* chainable inferencing support and persistence handling<br>* Extensible to support specific information models - such as SKOS<br>* Configurable metadata properties for arbitrary Django objects.<br>RDF_IO has initial data that loads up common W3C namespaces and prefixes ready for use (OWL, RDF, DCAT) <br><br>## installation<br><br>get a working copy with<br>```<br>git clone https://github.com/rob-metalinkage/django-rdf-io<br>pip install -e (where you put it)<br>```<br>in your master django project:<br>* add 'rdf_io' to the INSTALLED_APPS  in settings.py<br>* add    ` url(r\"^rdf_io/\", include('rdf_io.urls'))`  to urls.py<br>* optionally define setting for RDFSERVER and RDFSERVER_API<br>* run manage.py makemigrations<br>* run manage.py migrate<br><br>## Automated publishing of updated to RDF<br>This is really only guaranteed for pushing additions and updates - deletions are not handled, although updates will tend to replace statements.<br><br>### on startup to enable (necessary after django-reload)<br>NB - TODO a way to force this to happen automatically - needs to happen after both RDF_IO and the target models are installed, so cant go in initialisation for either model.<br><br>`{SERVER_URL}/rdf_io/ctl_signals/sync`<br><br>### to turn on publishing for a model class<br>1) check Auto-push flag is checked in an ObjectMapping for that model class<br>2) save - should register a post_save signal for the model class<br><br>### to turn on/off  publishing for all model classes <br>`{SERVER_URL}/rdf_io/ctl_signals/(on/off)`<br><br>### <br><br><br>## Usage<br><br>### Optional RDF store configuration<br>0) Set up any target RDF stores (currently supported are the LDP API and RDF4J/Apache Sesame API) - note RDF_IO can be used to import and serialise django objects as RDF without any RDF stores, and different RDF stores can be used for different objects<br>1) Configure variables for use in setting up ServiceBindings to RDF stores and inferencing engines<br>2) Set up ServiceBindings for your target stores (via the admin interface or migrations)<br>3) Pre-load any static data and rules required by your reasoner (e.g. SHACL) - or set up migrations to load these using ImportedResource bound to appropriate ServiceBindings<br><br>### Basic RDF serialisation<br>1) Define mappings for your target models using the admin interface $SERVER/admin/rdf_io<br>2) To create an online resource use <br>\t\t`{SERVER_URL}/rdf_io/to_rdf/{model_name}/id/{model_id}`<br>\t\t`{SERVER_URL}/rdf_io/to_rdf/{model_name}/key/{model_natural_key}`<br>\t\t<br>### RDF publishing\t\t<br>1) Configure one or more ServiceBindings and attach to the relevant ObjectMapping (if updates to that Object are to be published to RDF store - otherwise ServiceBindings can be directly bound to individual ImportedResource objects)<br>  NOTE: A service binding of type VALIDATION will cause checks to be performed - and on failure will abort the service chain and invoke on_fail bindings (not yet implemented) <br>  NOTE: An service binding of type INFERENCING will augment the data to be stored, but not save it. It should be chained to PERSIST binding(s).<br>2) To publish a specific object to the configured RDF store:<br>\t\t`{SERVER_URL}/rdf_io/pub_rdf/{model_name}/{model_id}`<br>\t\t(note that this will happen automatically on object save if an object mapping is defined)<br>3) To republish all objects for a set of django models:<br>\t\t`{SERVER_URL}/rdf_io/sync_remote/{model_name}[,{model_name}]*`<br><br>\t\t\t\t<br>NOTE: for the \t/rdf_io/to_rdf/{model_name}/key/{model_natural_key} to work the target model must define a manage with a get_by_natural_key method that takes a unique single term - such as a uri - note this will allow use of CURIES such as myns:myterm where the prefix is registered as a namespace in the RDF_IO space. If a CURIE is detected, then RDF_IO will try to match first as a string, then expand to a full URI and match.<br><br><br>### Inferencing<br>Inferencing allows RDF based reasoning to generate richer views of inter-related data, and potentially derive a range of additional knowledge. This can all be done inside custom logic, but RDF_IO allows standards such as SHACL etc to be used to capture this and avoids hard-coding and hiding all these rules.<br><br>when an object is saved, any enabled inferencing ServiceBindings will be applied before saving (stores may invoke loaded rules post-save)<br><br>1) Set up a RDF Inferencer - note this may be a matter of enabling inferencing on the default store, or setting up a new store. If rules cannot safely co-exist, then multiple inferencing stores may be configured.<br>2) Load inferencing rules to the Inferencer (optionally using ImportedResource objects and PERSIST_REPLACE service bindings) <br>3) Create service bindings for inferencing - these may be chained using Next_service <br>4) Make sure that the inferencing store is cleared of temporary data - using an appropriate PERSISTENCE_DELETE ServiceBinding as a final step in the chain <br><br>NOTE: Inferencing rules may need to be more complex if a separate inferencing store is set up, but some of the data needed for inferencing resides in the main target repository. Using SPIN, this leads to constructs like:<br><br>'''<br>\t\t\t WHERE {<br>\t\t\t\t?mainrepo a service:Repo  .<br><br>\t\t\t\t?A a skos:Concept .<br>\t\t\t\tOPTIONAL { ?A skos:broader ?B . }<br>\t\t\t\tOPTIONAL { ?B skos:narrower ?A }<br>\t\t\t\tOPTIONAL { SERVICE ?mainrepo<br>\t\t\t\t\t\t{<br>\t\t\t\t\t\t\tOPTIONAL { ?A skos:broader ?B . }<br>\t\t\t\t\t\t\tOPTIONAL { ?B skos:narrower ?A . }<br><br>\t\t\t\t\t\t}<br>\t\t\t\t\t}<br>\t\t\t\t\t<br>where ?mainrepo is an object loaded to the inferencer to define the target data store, allowing such a rule to be reusable.<br> <br>'''<br><br>### Object Mappings<br>Mappings to RDF are done for Django models. Each mapping consists of:<br>1) an identifier mapping to generate the URI for the object<br>2) a set of AttributeMapping elements that map a list of values to a RDF predicate<br>3) a set of EmbeddedMapping that map a list of values to complex object property (optionally wrapped in a blank node)<br>4) a filter to limit the set of objects the mapping applies to<br><br>More than one object mapping may exist for a Django model. The RDF graph is the union of all the configured Object Mapping outputs.<br>(Note that a ServiceBinding may be bound to a specific mapping, but the default behaviour is for this to be used to find all ServiceBindings for a gioven django modeltype - and they all get the composite graph (this may be changed to supported publishing different graphs to different RDf stores in future.)<br><br>### Mapping syntax<br>Mapping is non trivial - because the elements of your model may need to extracted from related models <br><br>Mapping is from elements in a Django model to a RDF value (a URI or a literal)<br><br>source model elements may be defined using XPath-like syntax, with nesting using django filter style __, a__b .(dot) or / notation, where each element of the path may support an optional filter. <br>```<br>path = (literal|element([./]element)*)<br><br>literal = \"a quoted string\" | 'a quoted string' | &lt;a URI&gt;  <br><br>element = (property|related_model_expr)([filter])?<br><br>property = a valid name of a property of a django model <br><br>related_model_expr = model_name(\\({property}\\))? <br><br><br>filter = (field(!)?=literal)((,| AND )field(!)?=literal)* | literal((,| OR )literal)*<br>```<br><br>Notes:<br>* filters on related models will be evaluated within the database using django filters, filters on property values will be performed during serialisation.<br><br>* literal values of None or NULL are treated as None or empty strings, as per Django practice.<br><br>* filters on properties are a simple list of possible matches (, is the same as \" OR \" ) and apply to the element of the path <br>  person.title['MRS','MISS','MS']  would match any title with value \"MRS\", \"MISS\", \"MS\"<br><br>* filters on related objects are property=value syntax. Properties use django-stlye paths - i.e. notation.namespace.prefix=skos<br><br>* if a ManyToMany field is used through an intermediary, then use the related_model_expr - and if this is a self-relation then specify the property : eg.<br>semrelation(origin_concept)[rel_type='1'].target_concept<br> <br>## Status: <br>beta, functionally complete initial capability:<br>* TTL serialisation of a given model (for which a mapping has been registered) <br>* Publishing to remote LDP service using per-model templates to define LDP resources<br>* Autoconfiguring of signals so that objects with mappings are published on post_ save<br>* syc_remote method to push all objects of list of model types (push is idempotent - safe to repeat)<br>* sophisticated property-chains with per-level filter options in attribute marmotta<br>* tested in context of geonode project under django 1.6<br>* tested against django 1.8.6 and 1.11<br><br>todo:<br>* implement global filters for object mappings (to limit mappings to a subset)<br>* set up signals and methods to delete objects from remote store<br><br>## API<br><br>### Serialising within python<br>```<br>from rdf_io.views import build_rdf<br>from django.contrib.contenttypes.models import ContentType<br>from rdf_io.models import ObjectMapping<br><br>ct = ContentType.objects.get(model=model)<br>obj_mapping_list=ObjectMapping.objects.filter(content_type=ct)<br>build_rdf(gr,obj, obj_mapping_list)  returns a rdflib.Graph()<br>gr.serialize(format=\"turtle\")<br>```<br>### Serialising using django views:<br><br>`{SERVER_URL}/rdf_io/to_rdf/{model_name}/{model_id}`<br><br><br><br><br>## Deprecated <br>## Marmotta LDP<br>* deploy marmotta.war and configure as per Marmotta instructions<br>* define resource container patterns for different models<br><br>e.g.<br><br>```<br># RDF triplestore settings<br>RDFSTORE = { <br>    'default' : {<br>        'server' : \"\".join((SITEURL,\":8080/marmotta\" )),<br>        # model and slug are special - slug will revert to id if not present<br>        'target' : \"/ldp/{model}/{slug}\",<br>        # this could be pulled from settings<br>        'auth' : ('admin', 'pass123')<br>        },<br>    # define special patterns for nested models<br>    'scheme' : {<br>        'target' : \"/ldp/voc/{slug}\",<br>        },<br>    'concept' : {<br>        'target' : \"/ldp/voc/{scheme__slug}/{term}\",<br>        }<br>}        <br>```   <br><br>* create containers necessary for patterns (eg /ldp/voc) in the example above<br>* deploy reasoning rules for target models (to generate additional statements that can be inferred from the published data - this is where the power comes in)<br> - see http://eagle-dev.salzburgresearch.at/reasoner/admin/about.html<br> e.g.<br>```<br> curl -i -H \"Content-Type: text/plain\" -X POST --data-binary @fixtures/skos.kwrl http://localhost:8080/marmotta/reasoner/program/skos.kwrl<br> curl -i -X GET http://localhost:8080/marmotta/reasoner/program/skos.kwrl<br> curl -i -X GET <br> curl -i -H \"Content-Type: text/plain\" -X POST --data-binary @skos.skwrl http://localhost:8080/marmotta/reasoner/program/skos.skwrl<br> ```<br>### Operations<br><br>If auto_publish is set in an Object Mapping then the RDF-IO mapping is triggered automatically when saving an object once an ObjectMapping is defined for that object type.<br><br>A bulk load to the RDF store can be achieved with /rdf_io/sync_remote/{model}(,{model})*<br><br>Note that containers need to be create in the right order - so for the SKOS example  this must be /rdf_io/sync_remote/scheme,concept<br><br><br># Design Goals<br><br>* Apps could define default settings (the mappings to RDF) - and these will just be ignored if the serializer is not present. <br>* When bringing in the serializer, if you wanted to be able to serialize a Class in an app for which there are no default mappings, it should be possible to define these (create a rdf_mappings.py file in the top project)<br>* The top project will allow either the default mappings for an app to be overridden, either as a whole or on a per-mapping basis (i.e. change or add mappings for individual attributes)<br>* the serialiser would be available as a stand-alone serialiser for dumpdata (and extended to be a deserialiser for loaddata) - but also able to be hooked up to post the serialized data to an external service - so my serialiser app might have a model to capture connection parameters for such services - and other app settings would be able to define connections in this model and bind different model's rdf mappings to different target services.<br><br>We have four types of apps then:<br>1 the master project<br>1 the RDF serializer utility<br>1 imported apps that have default RDF serializations<br>1 imported apps that may or may not have RDF serialisations defined in the project settings.<br><br>I suspect that this may all be a fairly common pattern - but I've only seen far more heavyweight approaches to RDF trying to fully model RDF and implement SPARQL - all I want to do is spit some stuff out into an external triple-store.<br><br>default RDF serialisations are handled by loading initial_data fixtures. RDF_IO objects are defined using natural keys to allow default mappings for modules to be loaded in any order. It may be more elegant to use settings so these defaults can be customised more easily.<br><br>Signals are registered when an ObjectMapping is defined for a model.\n          </div>"}, "last_serial": 4556263, "releases": {"0.1": [{"comment_text": "", "digests": {"md5": "50c0f775190a976f04b745aa198af6e6", "sha256": "083a94a5bb73fc3ea976656dac21ecd97245ea52a34cea541ad589c97644b2f6"}, "downloads": -1, "filename": "django-rdf-io-0.1.tar.gz", "has_sig": false, "md5_digest": "50c0f775190a976f04b745aa198af6e6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 35227, "upload_time": "2018-12-03T15:57:34", "upload_time_iso_8601": "2018-12-03T15:57:34.021162Z", "url": "https://files.pythonhosted.org/packages/0b/9a/d651b556736c3b2eec3be0403cfd39b48092c1aeb2e5b74bd3b4fd9739fe/django-rdf-io-0.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "50c0f775190a976f04b745aa198af6e6", "sha256": "083a94a5bb73fc3ea976656dac21ecd97245ea52a34cea541ad589c97644b2f6"}, "downloads": -1, "filename": "django-rdf-io-0.1.tar.gz", "has_sig": false, "md5_digest": "50c0f775190a976f04b745aa198af6e6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 35227, "upload_time": "2018-12-03T15:57:34", "upload_time_iso_8601": "2018-12-03T15:57:34.021162Z", "url": "https://files.pythonhosted.org/packages/0b/9a/d651b556736c3b2eec3be0403cfd39b48092c1aeb2e5b74bd3b4fd9739fe/django-rdf-io-0.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:54:25 2020"}