{"info": {"author": "Artem Vlasov", "author_email": "root@proscript.ru", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Intended Audience :: Developers", "Intended Audience :: Science/Research", "License :: OSI Approved :: MIT License", "Natural Language :: Russian", "Programming Language :: Python", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "Приложение для работы с базой данных ФИАС в Django\n\nОсновные возможности\n====================\n\n* Импорт базы ФИАС из:\n    * архива XML или DBF\n    * каталога с XML или DBF\n    * напрямую с сайта http://fias.nalog.ru в формате XML или DBF\n* Импорт всех существующих справочников и классификаторов ФИАС (с возможностью выборочного импорта)\n* Возможность хранить данные в отдельной БД\n* Все справочники и классификаторы доступны для просмотра в админке Django\n* Поле модели AddressField, предоставляющее в админке Django ajax-поиск адреса\n* Поддержка полнотекстового поиска для поля AddressField (`демо <http://youtu.be/ZVVrxg9-o_4>`_) с помощью:\n    * `Sphinx Search Engine <http://sphinxsearch.com>`_ Для Debian, Ubuntu, RHEL, Windows есть `пакеты <http://sphinxsearch.com/downloads/release/>`_\n\n* Связанное поле модели для выбора района внутри выбранного в AddressField города (районы никак не привязаны к улицам, соответственно, их нужно выбирать отдельно, если это требуется)\n* Несколько абстрактных моделей, немного упрощающих жизнь\n\nСовместимость\n=============\n\n* Django 1.7+ (*Для работы с django 1.7 необходимо доустановить django_extensions*)\n* django_select2 5.3.0+\n\nВнешние зависимости\n===================\n\n* `django_select2<https://github.com/applegrew/django-select2>`_ модуль интеграции Select2 с Django.\n* `dbfread <https://github.com/olemb/dbfread>`_ Маленькая библиотека для работы с DBF. Для python3.3+ пока что нужно использовать мой `форк<https://github.com/Yuego/dbfread>`_\n\n\nНекоторые особенности\n=====================\n\n* Часть справочников импортируется независимо от настроек: вся статусная информация, типы нормативных документов, типы адресных объектов, таблица AddrObj\n* Все справочники и классификаторы связаны между собой посредством ForeignKey, что требует консистентного состояния БД ФИАС. В реальной жизни такого не бывает, поэтому:\n* В случае отсутствия родительского поля для ForeignKey включается механизм регрессивного импорта:\n    * При возникновении любой ошибки пачка объектов делится на части и каждая часть импортируется отдельно\n    * При повторном возникновении ошибки часть с ошибкой снова делится и импортируется.\n    * Так повторяется, пока в пачке не останется один объект, который просто отбрасывается.\n    Таким образом достигается минимальная просадка производительности импорта при возникновении ошибок.\n\n\nОписание ключей командной строки (python manage.py fias)\n========================================================\n\n--src <path|filename|url|AUTO>\n    Путь до архива с БД ФИАС, каталога, в который предварительно был распакован архив или URL-адрес, с которого требуется скачать импортируемый архив\n    Отсутствующее значение или значение AUTO означает автоматическое получение данных с сайта http://fias.nalog.ru\n\n--truncate\n    Указывает полностью удалять все данные из таблицы перед импортом в неё\n\n--i-know-what-i-do\n    В случае если в БД уже есть какие-то данные, приложение не даст ничего импортировать, пока не будет указан этот ключ.\n    На возможность обновления никак не влияет.\n\n--update\n    Обновляет БД ФИАС до актуальной версии (после или вместо импорта).\n    Если в БД ничего ещё не импортировалось, будет выдано сообщение об ошибке.\n\n--skip\n    Используется только вместе с --update. Указывает пропускать повреждённые архивы с обновлениями.\n\n--format <xml|dbf>\n    Указывает, в каком формате скачивать архивы с данными ФИАС. Допустимоые значения: xml или dbf.\n\n--limit\n    Устанавливает размер пачки записей, единовременно загружаемой в БД. Чем больше размер, тем быстрее импорт (в теории), но дольше обработка ошибок, если таковые возникнут.\n    По-умолчанию: 10000.\n\n--tables\n    Задаёт список таблиц для импорта через запятую.\n\n--update-version-info <yes|no>\n    Указывает, обновлять ли список версий БД ФИАС.\n    По-умолчанию: yes\n\n--fill-weights\n    Обновляет веса типов адресных объектов из FIAS_SB_WEIGHTS. Смотри **Настройка весов** ниже.\n\n--keep-indexes\n    При первоначальном импорте удаляются все индексы из таблиц (кроме первичного ключа) перед импортом и пересоздаются заново после.\n    Ключ отключает такое поведение. На процесс обновления никак не влияет.\n\n--tempdir <path>\n    Путь к каталогу, где будут размещены временные файлы в процессе импорта.\n    Каталог должен существовать и быть доступен для записи.\n\nОбновление 1.1.x до 1.2.0\n=========================\n\nПосле установки данного обновления лучше выполнить полный импорт БД, т. к. из-за ошибки в предыдущих версиях\nчасть данных (коды ИФНС, ОКАТО, ОКТМО) была импортирована некорректно.\n\nВыполните::\n\n    python manage.py migrate fias\n\nОбновление 1.0.0 до 1.1.0\n=========================\n\nВполне возможна ситуация, когда миграция прервётся из-за неконсистентности БД.\nВ этом случае придётся выполнить полный импорт, т. к. искать проблемные записи слишком трудозатратно.\n\n* Перед обновлением **сделайте резервную копию БД ФИАС**!!!\n* Перед обновлением убедитесь в наличии доступа в Интернет, т. к. в процессе будет скачана последняя версия ахрива БД ФИАС (полный архив).\n* Если БД пуста, ничего качаться не будет.\n\nВыполните::\n\n    python manage.py migrate fias\n\n\nОбновление 0.6.1 до 1.0.0\n=========================\n\nОбновите django-fias до версии 0.6.2, а django до версии 1.7 или выше.\nСмигрируйте базу данных::\n\n    python manage.py migrate fias 0001 --fake\n    python manage.py migrate fias\n\nОбновите django-fias до версии 1.0.0\nОбновите все зависимости до актуальных версий (в частности django-select2 до версии не ниже 5.3.0).\nОбновите статические файлы::\n\n    python manage.py collectstatic\n\n\nОбновите настройки django-fias (см. fias/config.py).\n\nУстановка\n=========\n\n1. Установите `django-fias`::\n\n        pip install django-fias\n\n2. Добавьте `fias` и `django_select2` в ваш список `INSTALLED_APPS`.\n3. Добавьте `url(r'^fias/', include('fias.urls', namespace='fias')),` в ваш urlpatterns\n4. Любым доступным способом подключите к админке приложения, в котором будете использовать поле FiasAddress свежую версию jQuery::\n\n    # например так:\n    class ItemAdmin(admin.ModelAdmin):\n        class Media:\n            js = ['//ajax.googleapis.com/ajax/libs/jquery/1.10.1/jquery.js']\n    admin.site.register(Item, ItemAdmin)\n\n5. Если вы желаете использовать отдельную БД под данные ФИАС, выполните следующее\n\n* Создайте БД и подключите её к Джанго обычным способом\n* Добавьте в ваш `settings.py` параметр::\n\n        FIAS_DATABASE_ALIAS = 'fias'\n\nгде `fias` - имя БД\n\n* Добавьте в список `DATABASE_ROUTERS`::\n\n        fias.routers.FIASRouter\n\n* Выполните::\n\n\n        python manage.py migrate --database=fias\n\nгде `fias` - имя БД ФИАС\n\n5. Выполните::\n\n        python manage.py migrate\n\n6. Выполните::\n\n        python manage.py collectstatic\n\nНастройка полнотекстового поиска\n================================\n\n**NOTE**: поддерживаются только 2 СУБД: PostgreSQL и MySQL.\n**NOTE2**: для индексации базы в MySQL может потребоваться до 2-2.5ГБ свободного места во временном каталоге MySQL.\n**NOTE3**: нет необходимости слишком часто пересоздавать поисковый индекс базы ФИАС. Это требуется делать только после обновления базы.\n\n1. Установите:\n\n* `Sphinx Search Engine <http://sphinxsearch.com>`_ Для Debian, Ubuntu, RHEL, Windows есть `пакеты <http://sphinxsearch.com/downloads/release/>`_\n\n\n3. Сгенерируйте конфигурацию `sphinx`:\n\nЕсли у вы уже используете `sphinx` в проекте, то вам нужен только конфиг индекса. Выполните::\n\n    python manage.py fias_suggest --path=PATH > sphinx.conf\n\nгде `PATH` - путь до каталога с индексами sphinx.\n\nИначе выполните::\n\n    python manage.py fias_suggest --path=PATH --full > sphinx.conf\n\nчтобы получить полный конфиг sphinx.\n\nЗамените конфиг sphinx полученными настройками (для **Gentoo** это файл `/etc/sphinx/sphinx.conf`, для **Ubuntu**: `/etc/sphinxsearch/sphinx.conf`)\n\n4. Псоле того, как данные **импортированы** и обновлены выполните::\n\n    indexer -c /etc/sphinx/sphinx.conf --all\n\n*NOTE*: для повторной переиндексации при запущенном Sphinx следует выполнять::\n\n    indexer -c /etc/sphinx/sphinx.conf --all --rotate\n\n5. Запустите sphinx::\n\n    # для Gentoo\n    /etc/init.d/searchd start\n    # для Ubuntu\n    /etc/init.d/sphinxsearch start\n\n**NOTE** Если Sphinx работает на другом хосте или на другом порту, добавьте в `settings.py` словарь соответствующими параметрами::\n\n    FIAS_SEARCHD_CONNECTION = {\n        'host': '127.0.0.1',\n        'port': 9306,\n    }\n\nНастройка весов\n===============\nИз-за особенностей организации БД ФИАС, сортировка результатов поиска происходит не так, как хотелось бы.\nПоэтому, начиная с версии 0.4 добавлена возможность настроить веса типов адресных объектов по своему усмотрению.\nДля этого в `settings.py` добавьте словарь `FIAS_SB_WEIGHTS` вида::\n\n        FIAS_SB_WEIGHTS = {\n            # СОКРАЩЕНИЕ: ВЕС\n            'г': 128,\n            'с': 100,\n        }\n        \nгде \n * СОКРАЩЕНИЕ - сокращённое наименование вида объекта из таблицы SocrBase\n * ВЕС - число от 0 до 128\n \n*NOTE*: по-умолчанию вес всех типов равен 64\n*NOTE*: пример заполнения можно посмотреть в weights.py - там перечислены предустановленные веса.\n\nЧтобы применить свои изменения, выполните::\n\n        python manage.py fias --fill-weights\n        \nКроме того изменить веса можно в панели администрирования Django.\nНо помните, что эти изменения будут **перезаписаны** при следующем вызове упомянутой команды!\nПосле внесения изменений обязательно нужно переиндексировать базу.\n\nВыбор импортируемых таблиц\n==========================\n\nТаблицы SOCRBASE и ADDROBJ импортируются всегда. Таблицы NORMDOC, LANDMARK, HOUSEINT и HOUSE по-умолчанию не импортируются.\n\nДобавьте в ваш `settings.py` список названий таблиц, которые вы хотели бы импортировать::\n\n    FIAS_TABLES = ('normdoc', 'landmark', 'houseint', 'house')\n\n\nИмпорт данных\n=============\n\nРасшифровка сокращений\n----------------------\nT: Table (Таблица) - импортируемая в данный момент таблица\nL: Loaded (Загружено) - количество уже загруженных в таблицу строк\nU: Updated (Обновлено) - количество обновлённых записей\nS: Skipped (Пропущено) - количество пропущенных записей, не удовлетворивших условиям фильтров и валидаторов, из них:\nE: Errors (Ошибки) - количество записей, пропущенных из-за ошибок\nR: Regression (Регрессия) - статус режима регрессивного импорта.\n    Первое число - уровень рекурсии. Чем глубже рекурсия, тем на более мелкие части разбита пачка записей.\n    Числа в скобках обозначают <номер части>:<количество записей в части>. Количество чисел и их позиция соответствуют глубине рекурсии.\nFN: Filename (Имя файла) - имя файла импортируемой таблицы\n\nПервоначальная загрузка данных\n------------------------------\nСуществует несколько способов импортировать данные в БД ФИАС\n\nПолностью автоматический импорт с сайта ФИАС::\n\n        python manage.py fias --src auto [--format <xml|dbf>]\n\nЗдесь ключ `--format` указывает, в каком формате предпочтительно скачивать данные. Доступны значения `xml` или `dbf`.\nТакой способ не всегда целесообразен по разным причинам, поэтому лучше самостоятельно скачать полный архив и импортировать уже его::\n\n        # Архив с XML-файлами\n        python manage.py fias --src /path/to/fias_xml.rar\n        # Архив с DBF-файлами\n        python manage.py fias --src /path/to/fias_dbf.rar\n        # Каталог с распакованным содержимым архива\n        python manage.py fias --src /path/to/fias_data/\n\n**Но!**\nВ случае, если в БД уже есть какие-то данные, скрипт выдаст соответствующее сообщение и прекратит работу.\nТакое поведение связано с тем, что при импорте из файла, если версия файла не совпадает с версией данных в какой-то таблице в БД ФИАС,\nданные в этой таблице могут быть удалены полностью и заменены новыми, при этом\nORM Django при наличии связанных таблиц удалит данные так же и оттуда.\nЕсли вы уверены в том, что делаете, добавьте к предыдущей команде флаг *--i-know-what-i-do*::\n\n        python manage.py fias --src /path/to/fias_xml.rar --i-know-what-i-do\n        # or\n        python manage.py fias --src auto --i-know-what-i-do\n\nЕсли по какой-то причине нужно импортировать всю БД ФИАС заново, добавьте флаг *--truncate*::\n\n        python manage.py fias --src /path/to/fias_xml.rar --truncate --i-know-what-i-do\n        # or\n        python manage.py fias --src auto --i-know-what-i-do\n\nЕсли скачанный файл не актуален, можно добавить к указанной выше команде флаг *--update* - скрипт сразу после импорта обновит БД до актуальной версии.::\n\n        python manage.py fias --src /path/to/fias_xml.rar --update\n        \n**NOTE**\nИмпортируются только актуальные записи. Если данные об объекте менялись, будет загружена самая последняя версия записи об этом объекте.\nЗаписи из будущего не импортируются.\n\nОбновление существующей БД\n--------------------------\nДля обновления БД выполните::\n\n        python manage.py fias --update\n\nОбновление выполняется только с сайта ФИАС. Обновить базу из файла нельзя.\n\n**NOTE**\nКак это ни печально, но мы живём в России. Тут всякое бывает. Вот и сервис ФИАС время от времени подсовывает битые дельта-архивы.\nЧтобы оные пропускать автоматически и обновляться следующими по порядку, используйте флаг *--skip* совместно с *--update*\n\nДля вывода всех возможных параметров импорта выполните::\n\n    python manage.py fias --help\n\n\nПросмотр информации о состоянии БД ФИАС\n---------------------------------------\n\nЧтобы узнать, насколько актуальна локальная копия БД ФИАС, выполните::\n\n    python manage.py fiasinfo --db-version\n\n\nИспользование\n=============\n\nВы можете самостоятельно ссылаться на таблицы БД фиас.\n\nВы так же можете добавить в свои модели поле `fias.fields.address.AddressField`, которое предоставит вам удобный\nпоиск адреса по базе и прявязку Один-ко-Многим вашей модели к таблице `AddrObj` базы ФИАС. (см. модель `Item` в тестовом приложении)\n\nЛибо вы можете унаследоваться от любой модели из `fias.models.address`, которые добавят несколько дополнительных\nполей к вашим моделям и выполнят за вас кое-какую рутину:\n\n**FIASAddress** (см. модель `CachedAddress` в тестовом приложении)\n\nПомимо поля `address` добавляет еще два: `full_address` и `short_address`. В первом хранится полная запись адреса (но без индекса), во втором - укороченная.\n\n**FIASAddressWithArea** (см. модель `CachedAddressWithArea` в тестовом приложении)\n\nНаследуется от предыдущей модели и добавляет еще поле `area` - позволяет указывать район города, выбранного в поле `address` (если, конечно, таковые имеются в БД ФИАС для данного города)\n\n**FIASHouse** (см. модель `CachedAddressWithHouse` в тестовом приложении)\n\nМиксин, добавляющий 3 поля `house`, `corps` и `apartment` - соответственно номер дома, корпус и квартира.\n\n**FIASFullAddress**\n\nКомбинация моделей  `FIASAddress` и `FIASHouse`.\n\n**FIASFullAddressWithArea**\n\nКомбинация моделей `FIASAddressWithArea` и `FIASHouse`\n\n*NOTE*: в моделях `FIASFullAddress` и `FIASFullAddressWithArea` реализованы методы `_get_full_address` и `_get_short_address`, возвращающие соответственно полную и сокращённую строку адреса, включая номер дома/корпуса/квартиры.\n\n\nНастройка settings.py\n====\n\nFIAS_UNRAR_TOOL - путь до библиотеки UnRAR (по умолчанию unrar - поиск в глобальных переменных)\n\n\nTODO\n====\n\n* Проверять списки удалённых объектов и все связанные с AddrObj модели мигрировать на правильные записи\n\nИзвестные проблемы\n==================\n* Если используется отдельная БД под данные ФИАС, в админке в список `list_display` нельзя добавлять поля типа `ForeignKey`\n\nБлагодарности\n=============\n\n`Коммит от EagerBeager <https://github.com/EagerBeager/django-fias/commit/ed375c2e1cafdc04f0c9612091eb040ef8f9f4fe>`_\nБлагодаря этому коммиту до меня наконец дошло, почему импорт отжирал память.", "description_content_type": "", "docs_url": null, "download_url": "https://github.com/Yuego/django-fias/archive/1.2.5.tar.gz", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/Yuego/django-fias", "keywords": "", "license": "MIT license", "maintainer": "", "maintainer_email": "", "name": "django-fias", "package_url": "https://pypi.org/project/django-fias/", "platform": "", "project_url": "https://pypi.org/project/django-fias/", "project_urls": {"Download": "https://github.com/Yuego/django-fias/archive/1.2.5.tar.gz", "Homepage": "https://github.com/Yuego/django-fias"}, "release_url": "https://pypi.org/project/django-fias/1.2.5/", "requires_dist": null, "requires_python": "", "summary": "FIAS Django integration", "version": "1.2.5", "yanked": false, "html_description": "<div class=\"project-description\">\n            Приложение для работы с базой данных ФИАС в Django<br><br>Основные возможности<br>====================<br><br>* Импорт базы ФИАС из:<br>    * архива XML или DBF<br>    * каталога с XML или DBF<br>    * напрямую с сайта http://fias.nalog.ru в формате XML или DBF<br>* Импорт всех существующих справочников и классификаторов ФИАС (с возможностью выборочного импорта)<br>* Возможность хранить данные в отдельной БД<br>* Все справочники и классификаторы доступны для просмотра в админке Django<br>* Поле модели AddressField, предоставляющее в админке Django ajax-поиск адреса<br>* Поддержка полнотекстового поиска для поля AddressField (`демо &lt;http://youtu.be/ZVVrxg9-o_4&gt;`_) с помощью:<br>    * `Sphinx Search Engine &lt;http://sphinxsearch.com&gt;`_ Для Debian, Ubuntu, RHEL, Windows есть `пакеты &lt;http://sphinxsearch.com/downloads/release/&gt;`_<br><br>* Связанное поле модели для выбора района внутри выбранного в AddressField города (районы никак не привязаны к улицам, соответственно, их нужно выбирать отдельно, если это требуется)<br>* Несколько абстрактных моделей, немного упрощающих жизнь<br><br>Совместимость<br>=============<br><br>* Django 1.7+ (*Для работы с django 1.7 необходимо доустановить django_extensions*)<br>* django_select2 5.3.0+<br><br>Внешние зависимости<br>===================<br><br>* `django_select2&lt;https://github.com/applegrew/django-select2&gt;`_ модуль интеграции Select2 с Django.<br>* `dbfread &lt;https://github.com/olemb/dbfread&gt;`_ Маленькая библиотека для работы с DBF. Для python3.3+ пока что нужно использовать мой `форк&lt;https://github.com/Yuego/dbfread&gt;`_<br><br><br>Некоторые особенности<br>=====================<br><br>* Часть справочников импортируется независимо от настроек: вся статусная информация, типы нормативных документов, типы адресных объектов, таблица AddrObj<br>* Все справочники и классификаторы связаны между собой посредством ForeignKey, что требует консистентного состояния БД ФИАС. В реальной жизни такого не бывает, поэтому:<br>* В случае отсутствия родительского поля для ForeignKey включается механизм регрессивного импорта:<br>    * При возникновении любой ошибки пачка объектов делится на части и каждая часть импортируется отдельно<br>    * При повторном возникновении ошибки часть с ошибкой снова делится и импортируется.<br>    * Так повторяется, пока в пачке не останется один объект, который просто отбрасывается.<br>    Таким образом достигается минимальная просадка производительности импорта при возникновении ошибок.<br><br><br>Описание ключей командной строки (python manage.py fias)<br>========================================================<br><br>--src &lt;path|filename|url|AUTO&gt;<br>    Путь до архива с БД ФИАС, каталога, в который предварительно был распакован архив или URL-адрес, с которого требуется скачать импортируемый архив<br>    Отсутствующее значение или значение AUTO означает автоматическое получение данных с сайта http://fias.nalog.ru<br><br>--truncate<br>    Указывает полностью удалять все данные из таблицы перед импортом в неё<br><br>--i-know-what-i-do<br>    В случае если в БД уже есть какие-то данные, приложение не даст ничего импортировать, пока не будет указан этот ключ.<br>    На возможность обновления никак не влияет.<br><br>--update<br>    Обновляет БД ФИАС до актуальной версии (после или вместо импорта).<br>    Если в БД ничего ещё не импортировалось, будет выдано сообщение об ошибке.<br><br>--skip<br>    Используется только вместе с --update. Указывает пропускать повреждённые архивы с обновлениями.<br><br>--format &lt;xml|dbf&gt;<br>    Указывает, в каком формате скачивать архивы с данными ФИАС. Допустимоые значения: xml или dbf.<br><br>--limit<br>    Устанавливает размер пачки записей, единовременно загружаемой в БД. Чем больше размер, тем быстрее импорт (в теории), но дольше обработка ошибок, если таковые возникнут.<br>    По-умолчанию: 10000.<br><br>--tables<br>    Задаёт список таблиц для импорта через запятую.<br><br>--update-version-info &lt;yes|no&gt;<br>    Указывает, обновлять ли список версий БД ФИАС.<br>    По-умолчанию: yes<br><br>--fill-weights<br>    Обновляет веса типов адресных объектов из FIAS_SB_WEIGHTS. Смотри **Настройка весов** ниже.<br><br>--keep-indexes<br>    При первоначальном импорте удаляются все индексы из таблиц (кроме первичного ключа) перед импортом и пересоздаются заново после.<br>    Ключ отключает такое поведение. На процесс обновления никак не влияет.<br><br>--tempdir &lt;path&gt;<br>    Путь к каталогу, где будут размещены временные файлы в процессе импорта.<br>    Каталог должен существовать и быть доступен для записи.<br><br>Обновление 1.1.x до 1.2.0<br>=========================<br><br>После установки данного обновления лучше выполнить полный импорт БД, т. к. из-за ошибки в предыдущих версиях<br>часть данных (коды ИФНС, ОКАТО, ОКТМО) была импортирована некорректно.<br><br>Выполните::<br><br>    python manage.py migrate fias<br><br>Обновление 1.0.0 до 1.1.0<br>=========================<br><br>Вполне возможна ситуация, когда миграция прервётся из-за неконсистентности БД.<br>В этом случае придётся выполнить полный импорт, т. к. искать проблемные записи слишком трудозатратно.<br><br>* Перед обновлением **сделайте резервную копию БД ФИАС**!!!<br>* Перед обновлением убедитесь в наличии доступа в Интернет, т. к. в процессе будет скачана последняя версия ахрива БД ФИАС (полный архив).<br>* Если БД пуста, ничего качаться не будет.<br><br>Выполните::<br><br>    python manage.py migrate fias<br><br><br>Обновление 0.6.1 до 1.0.0<br>=========================<br><br>Обновите django-fias до версии 0.6.2, а django до версии 1.7 или выше.<br>Смигрируйте базу данных::<br><br>    python manage.py migrate fias 0001 --fake<br>    python manage.py migrate fias<br><br>Обновите django-fias до версии 1.0.0<br>Обновите все зависимости до актуальных версий (в частности django-select2 до версии не ниже 5.3.0).<br>Обновите статические файлы::<br><br>    python manage.py collectstatic<br><br><br>Обновите настройки django-fias (см. fias/config.py).<br><br>Установка<br>=========<br><br>1. Установите `django-fias`::<br><br>        pip install django-fias<br><br>2. Добавьте `fias` и `django_select2` в ваш список `INSTALLED_APPS`.<br>3. Добавьте `url(r'^fias/', include('fias.urls', namespace='fias')),` в ваш urlpatterns<br>4. Любым доступным способом подключите к админке приложения, в котором будете использовать поле FiasAddress свежую версию jQuery::<br><br>    # например так:<br>    class ItemAdmin(admin.ModelAdmin):<br>        class Media:<br>            js = ['//ajax.googleapis.com/ajax/libs/jquery/1.10.1/jquery.js']<br>    admin.site.register(Item, ItemAdmin)<br><br>5. Если вы желаете использовать отдельную БД под данные ФИАС, выполните следующее<br><br>* Создайте БД и подключите её к Джанго обычным способом<br>* Добавьте в ваш `settings.py` параметр::<br><br>        FIAS_DATABASE_ALIAS = 'fias'<br><br>где `fias` - имя БД<br><br>* Добавьте в список `DATABASE_ROUTERS`::<br><br>        fias.routers.FIASRouter<br><br>* Выполните::<br><br><br>        python manage.py migrate --database=fias<br><br>где `fias` - имя БД ФИАС<br><br>5. Выполните::<br><br>        python manage.py migrate<br><br>6. Выполните::<br><br>        python manage.py collectstatic<br><br>Настройка полнотекстового поиска<br>================================<br><br>**NOTE**: поддерживаются только 2 СУБД: PostgreSQL и MySQL.<br>**NOTE2**: для индексации базы в MySQL может потребоваться до 2-2.5ГБ свободного места во временном каталоге MySQL.<br>**NOTE3**: нет необходимости слишком часто пересоздавать поисковый индекс базы ФИАС. Это требуется делать только после обновления базы.<br><br>1. Установите:<br><br>* `Sphinx Search Engine &lt;http://sphinxsearch.com&gt;`_ Для Debian, Ubuntu, RHEL, Windows есть `пакеты &lt;http://sphinxsearch.com/downloads/release/&gt;`_<br><br><br>3. Сгенерируйте конфигурацию `sphinx`:<br><br>Если у вы уже используете `sphinx` в проекте, то вам нужен только конфиг индекса. Выполните::<br><br>    python manage.py fias_suggest --path=PATH &gt; sphinx.conf<br><br>где `PATH` - путь до каталога с индексами sphinx.<br><br>Иначе выполните::<br><br>    python manage.py fias_suggest --path=PATH --full &gt; sphinx.conf<br><br>чтобы получить полный конфиг sphinx.<br><br>Замените конфиг sphinx полученными настройками (для **Gentoo** это файл `/etc/sphinx/sphinx.conf`, для **Ubuntu**: `/etc/sphinxsearch/sphinx.conf`)<br><br>4. Псоле того, как данные **импортированы** и обновлены выполните::<br><br>    indexer -c /etc/sphinx/sphinx.conf --all<br><br>*NOTE*: для повторной переиндексации при запущенном Sphinx следует выполнять::<br><br>    indexer -c /etc/sphinx/sphinx.conf --all --rotate<br><br>5. Запустите sphinx::<br><br>    # для Gentoo<br>    /etc/init.d/searchd start<br>    # для Ubuntu<br>    /etc/init.d/sphinxsearch start<br><br>**NOTE** Если Sphinx работает на другом хосте или на другом порту, добавьте в `settings.py` словарь соответствующими параметрами::<br><br>    FIAS_SEARCHD_CONNECTION = {<br>        'host': '127.0.0.1',<br>        'port': 9306,<br>    }<br><br>Настройка весов<br>===============<br>Из-за особенностей организации БД ФИАС, сортировка результатов поиска происходит не так, как хотелось бы.<br>Поэтому, начиная с версии 0.4 добавлена возможность настроить веса типов адресных объектов по своему усмотрению.<br>Для этого в `settings.py` добавьте словарь `FIAS_SB_WEIGHTS` вида::<br><br>        FIAS_SB_WEIGHTS = {<br>            # СОКРАЩЕНИЕ: ВЕС<br>            'г': 128,<br>            'с': 100,<br>        }<br>        <br>где <br> * СОКРАЩЕНИЕ - сокращённое наименование вида объекта из таблицы SocrBase<br> * ВЕС - число от 0 до 128<br> <br>*NOTE*: по-умолчанию вес всех типов равен 64<br>*NOTE*: пример заполнения можно посмотреть в weights.py - там перечислены предустановленные веса.<br><br>Чтобы применить свои изменения, выполните::<br><br>        python manage.py fias --fill-weights<br>        <br>Кроме того изменить веса можно в панели администрирования Django.<br>Но помните, что эти изменения будут **перезаписаны** при следующем вызове упомянутой команды!<br>После внесения изменений обязательно нужно переиндексировать базу.<br><br>Выбор импортируемых таблиц<br>==========================<br><br>Таблицы SOCRBASE и ADDROBJ импортируются всегда. Таблицы NORMDOC, LANDMARK, HOUSEINT и HOUSE по-умолчанию не импортируются.<br><br>Добавьте в ваш `settings.py` список названий таблиц, которые вы хотели бы импортировать::<br><br>    FIAS_TABLES = ('normdoc', 'landmark', 'houseint', 'house')<br><br><br>Импорт данных<br>=============<br><br>Расшифровка сокращений<br>----------------------<br>T: Table (Таблица) - импортируемая в данный момент таблица<br>L: Loaded (Загружено) - количество уже загруженных в таблицу строк<br>U: Updated (Обновлено) - количество обновлённых записей<br>S: Skipped (Пропущено) - количество пропущенных записей, не удовлетворивших условиям фильтров и валидаторов, из них:<br>E: Errors (Ошибки) - количество записей, пропущенных из-за ошибок<br>R: Regression (Регрессия) - статус режима регрессивного импорта.<br>    Первое число - уровень рекурсии. Чем глубже рекурсия, тем на более мелкие части разбита пачка записей.<br>    Числа в скобках обозначают &lt;номер части&gt;:&lt;количество записей в части&gt;. Количество чисел и их позиция соответствуют глубине рекурсии.<br>FN: Filename (Имя файла) - имя файла импортируемой таблицы<br><br>Первоначальная загрузка данных<br>------------------------------<br>Существует несколько способов импортировать данные в БД ФИАС<br><br>Полностью автоматический импорт с сайта ФИАС::<br><br>        python manage.py fias --src auto [--format &lt;xml|dbf&gt;]<br><br>Здесь ключ `--format` указывает, в каком формате предпочтительно скачивать данные. Доступны значения `xml` или `dbf`.<br>Такой способ не всегда целесообразен по разным причинам, поэтому лучше самостоятельно скачать полный архив и импортировать уже его::<br><br>        # Архив с XML-файлами<br>        python manage.py fias --src /path/to/fias_xml.rar<br>        # Архив с DBF-файлами<br>        python manage.py fias --src /path/to/fias_dbf.rar<br>        # Каталог с распакованным содержимым архива<br>        python manage.py fias --src /path/to/fias_data/<br><br>**Но!**<br>В случае, если в БД уже есть какие-то данные, скрипт выдаст соответствующее сообщение и прекратит работу.<br>Такое поведение связано с тем, что при импорте из файла, если версия файла не совпадает с версией данных в какой-то таблице в БД ФИАС,<br>данные в этой таблице могут быть удалены полностью и заменены новыми, при этом<br>ORM Django при наличии связанных таблиц удалит данные так же и оттуда.<br>Если вы уверены в том, что делаете, добавьте к предыдущей команде флаг *--i-know-what-i-do*::<br><br>        python manage.py fias --src /path/to/fias_xml.rar --i-know-what-i-do<br>        # or<br>        python manage.py fias --src auto --i-know-what-i-do<br><br>Если по какой-то причине нужно импортировать всю БД ФИАС заново, добавьте флаг *--truncate*::<br><br>        python manage.py fias --src /path/to/fias_xml.rar --truncate --i-know-what-i-do<br>        # or<br>        python manage.py fias --src auto --i-know-what-i-do<br><br>Если скачанный файл не актуален, можно добавить к указанной выше команде флаг *--update* - скрипт сразу после импорта обновит БД до актуальной версии.::<br><br>        python manage.py fias --src /path/to/fias_xml.rar --update<br>        <br>**NOTE**<br>Импортируются только актуальные записи. Если данные об объекте менялись, будет загружена самая последняя версия записи об этом объекте.<br>Записи из будущего не импортируются.<br><br>Обновление существующей БД<br>--------------------------<br>Для обновления БД выполните::<br><br>        python manage.py fias --update<br><br>Обновление выполняется только с сайта ФИАС. Обновить базу из файла нельзя.<br><br>**NOTE**<br>Как это ни печально, но мы живём в России. Тут всякое бывает. Вот и сервис ФИАС время от времени подсовывает битые дельта-архивы.<br>Чтобы оные пропускать автоматически и обновляться следующими по порядку, используйте флаг *--skip* совместно с *--update*<br><br>Для вывода всех возможных параметров импорта выполните::<br><br>    python manage.py fias --help<br><br><br>Просмотр информации о состоянии БД ФИАС<br>---------------------------------------<br><br>Чтобы узнать, насколько актуальна локальная копия БД ФИАС, выполните::<br><br>    python manage.py fiasinfo --db-version<br><br><br>Использование<br>=============<br><br>Вы можете самостоятельно ссылаться на таблицы БД фиас.<br><br>Вы так же можете добавить в свои модели поле `fias.fields.address.AddressField`, которое предоставит вам удобный<br>поиск адреса по базе и прявязку Один-ко-Многим вашей модели к таблице `AddrObj` базы ФИАС. (см. модель `Item` в тестовом приложении)<br><br>Либо вы можете унаследоваться от любой модели из `fias.models.address`, которые добавят несколько дополнительных<br>полей к вашим моделям и выполнят за вас кое-какую рутину:<br><br>**FIASAddress** (см. модель `CachedAddress` в тестовом приложении)<br><br>Помимо поля `address` добавляет еще два: `full_address` и `short_address`. В первом хранится полная запись адреса (но без индекса), во втором - укороченная.<br><br>**FIASAddressWithArea** (см. модель `CachedAddressWithArea` в тестовом приложении)<br><br>Наследуется от предыдущей модели и добавляет еще поле `area` - позволяет указывать район города, выбранного в поле `address` (если, конечно, таковые имеются в БД ФИАС для данного города)<br><br>**FIASHouse** (см. модель `CachedAddressWithHouse` в тестовом приложении)<br><br>Миксин, добавляющий 3 поля `house`, `corps` и `apartment` - соответственно номер дома, корпус и квартира.<br><br>**FIASFullAddress**<br><br>Комбинация моделей  `FIASAddress` и `FIASHouse`.<br><br>**FIASFullAddressWithArea**<br><br>Комбинация моделей `FIASAddressWithArea` и `FIASHouse`<br><br>*NOTE*: в моделях `FIASFullAddress` и `FIASFullAddressWithArea` реализованы методы `_get_full_address` и `_get_short_address`, возвращающие соответственно полную и сокращённую строку адреса, включая номер дома/корпуса/квартиры.<br><br><br>Настройка settings.py<br>====<br><br>FIAS_UNRAR_TOOL - путь до библиотеки UnRAR (по умолчанию unrar - поиск в глобальных переменных)<br><br><br>TODO<br>====<br><br>* Проверять списки удалённых объектов и все связанные с AddrObj модели мигрировать на правильные записи<br><br>Известные проблемы<br>==================<br>* Если используется отдельная БД под данные ФИАС, в админке в список `list_display` нельзя добавлять поля типа `ForeignKey`<br><br>Благодарности<br>=============<br><br>`Коммит от EagerBeager &lt;https://github.com/EagerBeager/django-fias/commit/ed375c2e1cafdc04f0c9612091eb040ef8f9f4fe&gt;`_<br>Благодаря этому коммиту до меня наконец дошло, почему импорт отжирал память.\n          </div>"}, "last_serial": 5181882, "releases": {"0.3": [{"comment_text": "", "digests": {"md5": "c625ccf2f11352f8e210ef9c929dd915", "sha256": "1888fb12fd2d9ec05039a19fe55377943b9a1fde5420ec85e3249b933c38feae"}, "downloads": -1, "filename": "django-fias-0.3.tar.gz", "has_sig": false, "md5_digest": "c625ccf2f11352f8e210ef9c929dd915", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 35201, "upload_time": "2014-03-02T13:29:56", "upload_time_iso_8601": "2014-03-02T13:29:56.141362Z", "url": "https://files.pythonhosted.org/packages/28/5c/5c66d93354571d81041ab0d2dfc6d87d3062884e4125b5785f93cfc223dd/django-fias-0.3.tar.gz", "yanked": false}], "0.3.1": [{"comment_text": "", "digests": {"md5": "6718ee0140da451c62f504a694ac40f4", "sha256": "5ac90bf20af0b8ccebcb9e4befca8904313e2f910e5ebb81cf97d6ecbeee41c7"}, "downloads": -1, "filename": "django-fias-0.3.1.tar.gz", "has_sig": false, "md5_digest": "6718ee0140da451c62f504a694ac40f4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 35620, "upload_time": "2014-03-02T19:02:35", "upload_time_iso_8601": "2014-03-02T19:02:35.307399Z", "url": "https://files.pythonhosted.org/packages/f5/2c/5a8369c6b1e1bf3cd1fa82fd94e36c16caf0a57bbf92f221cbb3c8cac015/django-fias-0.3.1.tar.gz", "yanked": false}], "0.3.2": [{"comment_text": "", "digests": {"md5": "357d4ae7a8179a98b085cbf3ea2ad8ce", "sha256": "c7f263515bac709e014e1dd9a8d7602ea1a22b49e0f56770430dcdf1331b7d1b"}, "downloads": -1, "filename": "django-fias-0.3.2.tar.gz", "has_sig": false, "md5_digest": "357d4ae7a8179a98b085cbf3ea2ad8ce", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 31428, "upload_time": "2014-04-01T16:47:35", "upload_time_iso_8601": "2014-04-01T16:47:35.014047Z", "url": "https://files.pythonhosted.org/packages/13/e0/71c6058d949ff22919cd907d642bfba8a4e66a4643e2cec6950dfb8ce12b/django-fias-0.3.2.tar.gz", "yanked": false}], "0.4.0": [{"comment_text": "", "digests": {"md5": "ef9f91214e90fb3fccdaad6e207c608e", "sha256": "16425caea82dffbecc111780c6ac386f380a845c5a69675b3d76f95b31377881"}, "downloads": -1, "filename": "django-fias-0.4.0.tar.gz", "has_sig": false, "md5_digest": "ef9f91214e90fb3fccdaad6e207c608e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 38939, "upload_time": "2014-05-11T13:55:30", "upload_time_iso_8601": "2014-05-11T13:55:30.883931Z", "url": "https://files.pythonhosted.org/packages/5e/65/091fd63167c045d5085703ce13618904519056059c1065fa54612a1c9b48/django-fias-0.4.0.tar.gz", "yanked": false}], "0.5.0": [{"comment_text": "", "digests": {"md5": "cf1eff9a735829cd42cc001c8a1fbbeb", "sha256": "5754cd991551e221e236b6d3e81ba5bf5df384c336d4fef0f4999285da87a73f"}, "downloads": -1, "filename": "django-fias-0.5.0.tar.gz", "has_sig": false, "md5_digest": "cf1eff9a735829cd42cc001c8a1fbbeb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 34559, "upload_time": "2014-10-14T06:24:31", "upload_time_iso_8601": "2014-10-14T06:24:31.192073Z", "url": "https://files.pythonhosted.org/packages/5c/0f/a6c90c2cf94cd0116e2f10de6f148aa367bc4a69b333746e1bd8ad3ce162/django-fias-0.5.0.tar.gz", "yanked": false}], "0.5.1": [{"comment_text": "", "digests": {"md5": "e1282fa15222e4b9631ace919716cdd7", "sha256": "428cd8552a3d3522ad2525b2a225cdf47b63613d86995c0115991af003551e71"}, "downloads": -1, "filename": "django-fias-0.5.1.tar.gz", "has_sig": false, "md5_digest": "e1282fa15222e4b9631ace919716cdd7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 40004, "upload_time": "2015-03-08T18:58:31", "upload_time_iso_8601": "2015-03-08T18:58:31.399127Z", "url": "https://files.pythonhosted.org/packages/ca/23/9b40eeeafb44c3dcf64c2cb10d428a701c950995978ce3aa834c0df0da5c/django-fias-0.5.1.tar.gz", "yanked": false}], "0.5.9": [{"comment_text": "", "digests": {"md5": "621bf8912e2cea6bcbeccbe588a3705e", "sha256": "4530f8eabe1a8c11fe56232a59eb306aa0ab044e2563e4e7a80c1fd3243bb006"}, "downloads": -1, "filename": "django-fias-0.5.9.tar.gz", "has_sig": false, "md5_digest": "621bf8912e2cea6bcbeccbe588a3705e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 53610, "upload_time": "2016-08-21T19:17:31", "upload_time_iso_8601": "2016-08-21T19:17:31.357240Z", "url": "https://files.pythonhosted.org/packages/40/df/f2350a540dcbc10f70154ac8fa61e59dd683c068aca33c740437d0466cff/django-fias-0.5.9.tar.gz", "yanked": false}], "0.6.2": [{"comment_text": "", "digests": {"md5": "1c3697d4ce4df3b486dda046cf528b8d", "sha256": "fc7cbe0ca35398c7469e0d9add48ac060ee3152289da960d00bd8d8daa7c0c1c"}, "downloads": -1, "filename": "django-fias-0.6.2.tar.gz", "has_sig": false, "md5_digest": "1c3697d4ce4df3b486dda046cf528b8d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 49070, "upload_time": "2016-08-17T12:39:25", "upload_time_iso_8601": "2016-08-17T12:39:25.800380Z", "url": "https://files.pythonhosted.org/packages/37/be/d7dec7416f0f320e9bea3ef0529022418e22818316a3c49baa07007f3cf4/django-fias-0.6.2.tar.gz", "yanked": false}], "1.0.2": [{"comment_text": "", "digests": {"md5": "485498ba608add91ac1f5485de4e5f36", "sha256": "0d288355c15915dc26f9151a14effe40d0d3243b492046caf43df6b46ad42b98"}, "downloads": -1, "filename": "django-fias-1.0.2.tar.gz", "has_sig": false, "md5_digest": "485498ba608add91ac1f5485de4e5f36", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 44023, "upload_time": "2016-08-20T10:30:11", "upload_time_iso_8601": "2016-08-20T10:30:11.869646Z", "url": "https://files.pythonhosted.org/packages/d1/ad/f5d7ccaa575fbfe577c7a79c3081d616465648d960c77477b4d77808397a/django-fias-1.0.2.tar.gz", "yanked": false}], "1.1.6": [{"comment_text": "", "digests": {"md5": "5aa62717cd5e2714732ceba61609ebee", "sha256": "7c1e3065e19bb4aff9dca6458670406360ebaad4741fd6faeb69d40fb00b044e"}, "downloads": -1, "filename": "django-fias-1.1.6.tar.gz", "has_sig": false, "md5_digest": "5aa62717cd5e2714732ceba61609ebee", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 62085, "upload_time": "2016-09-20T14:23:48", "upload_time_iso_8601": "2016-09-20T14:23:48.061980Z", "url": "https://files.pythonhosted.org/packages/79/a7/23e605961492d57092eb1cc9125ef7dff6505e640fded15399b8d92819c5/django-fias-1.1.6.tar.gz", "yanked": false}], "1.1.8": [{"comment_text": "", "digests": {"md5": "48c3b1495097c63daffcc688245bd1c6", "sha256": "2c7fa702894d26d2830e4063151f12fe2b806db68c93856ee7c79e99ec4e1581"}, "downloads": -1, "filename": "django-fias-1.1.8.tar.gz", "has_sig": false, "md5_digest": "48c3b1495097c63daffcc688245bd1c6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 59672, "upload_time": "2016-10-02T06:17:10", "upload_time_iso_8601": "2016-10-02T06:17:10.637463Z", "url": "https://files.pythonhosted.org/packages/e2/6a/220fbcd5c22988ffc4bb3b72704e859c2aa161a633e6fb98180c40b1ca47/django-fias-1.1.8.tar.gz", "yanked": false}], "1.1.9": [{"comment_text": "", "digests": {"md5": "2024e7b8fbeff4732872fc65de055986", "sha256": "6e8df73eaf26d6517534cc1345df53cf932a741a71f757f6e25bbcffb73771fc"}, "downloads": -1, "filename": "django-fias-1.1.9.tar.gz", "has_sig": false, "md5_digest": "2024e7b8fbeff4732872fc65de055986", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 67483, "upload_time": "2016-12-24T06:40:32", "upload_time_iso_8601": "2016-12-24T06:40:32.022885Z", "url": "https://files.pythonhosted.org/packages/44/92/72c0af134c451f6345d00e8874267268a32651e671dd12a6108bb524030b/django-fias-1.1.9.tar.gz", "yanked": false}], "1.2.0": [{"comment_text": "", "digests": {"md5": "e7eae704354f8b7dde89fdce5752140c", "sha256": "b97c7c3a201ddf6f6608a1cf8a709fc0d62fe6bb31ef7c93bdd39c5ec3b12077"}, "downloads": -1, "filename": "django-fias-1.2.0.tar.gz", "has_sig": false, "md5_digest": "e7eae704354f8b7dde89fdce5752140c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 68157, "upload_time": "2016-12-24T07:40:46", "upload_time_iso_8601": "2016-12-24T07:40:46.984142Z", "url": "https://files.pythonhosted.org/packages/f3/c3/9a91e78fe003a84e9cbfeb17bc27b628d3c47bd08414c419c234e488eab9/django-fias-1.2.0.tar.gz", "yanked": false}], "1.2.1": [{"comment_text": "", "digests": {"md5": "355daa721e914f8d7725efbb7a278e85", "sha256": "3350510e33993086f587fb1b7998a7613c413e2f185b0aab6f69f8bb88875247"}, "downloads": -1, "filename": "django-fias-1.2.1.tar.gz", "has_sig": false, "md5_digest": "355daa721e914f8d7725efbb7a278e85", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 68645, "upload_time": "2017-01-10T04:39:15", "upload_time_iso_8601": "2017-01-10T04:39:15.633304Z", "url": "https://files.pythonhosted.org/packages/d7/7c/eebd12fd9be4dc563daa81188a2243a5eba0c31db00946b296b58908949c/django-fias-1.2.1.tar.gz", "yanked": false}], "1.2.2": [{"comment_text": "", "digests": {"md5": "4298305cab862647924ea2951cec4d7a", "sha256": "52ccc88d76b7917786cca65af6cc1b2b2a62b2f3c5d0ef34c4e257098540a3be"}, "downloads": -1, "filename": "django_fias-1.2.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "4298305cab862647924ea2951cec4d7a", "packagetype": "bdist_wheel", "python_version": "3.4", "requires_python": null, "size": 88849, "upload_time": "2017-01-10T10:56:45", "upload_time_iso_8601": "2017-01-10T10:56:45.158996Z", "url": "https://files.pythonhosted.org/packages/85/57/595344b8933c86c73f97393901d00c321d133e02fd21236ceb03145f667f/django_fias-1.2.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4243575b3e392aa0572f679a8d6b1414", "sha256": "26df428ea7b141374881dd8ed5d31a21ffb9f72efa14fa596d6c4ee3aba2b534"}, "downloads": -1, "filename": "django-fias-1.2.2.tar.gz", "has_sig": false, "md5_digest": "4243575b3e392aa0572f679a8d6b1414", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 68865, "upload_time": "2017-01-10T10:56:41", "upload_time_iso_8601": "2017-01-10T10:56:41.219221Z", "url": "https://files.pythonhosted.org/packages/55/2f/6a0fd165f834caa2401040743f9b6538eaf9fb39c94bfb396b8fd9d5b868/django-fias-1.2.2.tar.gz", "yanked": false}], "1.2.5": [{"comment_text": "", "digests": {"md5": "7a5f58b00cbd3cc94fcb555d6fa4c774", "sha256": "90c8f561b243ba141559c7b026edc7298ce0169cd46a4f995809fc0f973e4b7d"}, "downloads": -1, "filename": "django-fias-1.2.5.tar.gz", "has_sig": false, "md5_digest": "7a5f58b00cbd3cc94fcb555d6fa4c774", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 63221, "upload_time": "2019-04-24T11:54:16", "upload_time_iso_8601": "2019-04-24T11:54:16.634151Z", "url": "https://files.pythonhosted.org/packages/52/32/67f532be1d3157a0316d3b04648a206de8bfd8c09cd43c4b4ab820d5775d/django-fias-1.2.5.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "7a5f58b00cbd3cc94fcb555d6fa4c774", "sha256": "90c8f561b243ba141559c7b026edc7298ce0169cd46a4f995809fc0f973e4b7d"}, "downloads": -1, "filename": "django-fias-1.2.5.tar.gz", "has_sig": false, "md5_digest": "7a5f58b00cbd3cc94fcb555d6fa4c774", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 63221, "upload_time": "2019-04-24T11:54:16", "upload_time_iso_8601": "2019-04-24T11:54:16.634151Z", "url": "https://files.pythonhosted.org/packages/52/32/67f532be1d3157a0316d3b04648a206de8bfd8c09cd43c4b4ab820d5775d/django-fias-1.2.5.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:36:11 2020"}