{"info": {"author": "Miguel Araujo", "author_email": "miguel.araujo.perez@gmail.com", "bugtrack_url": null, "classifiers": ["Environment :: Web Environment", "Framework :: Django", "Intended Audience :: Developers", "License :: OSI Approved :: BSD License", "Operating System :: OS Independent", "Programming Language :: Python", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "h1(#abstract). django-rules\n\ndjango-rules is a Django authorization backend that offers a unified, per-object authorization management. It is quite different from other authorization backends in the way it lets you flexibly manage per-object permissions.\n\nIn django-rules every rule adds an authorization constraint to a given model. The authorization constraint will check if the given user complies with the constraint (e.g. if the user has the right permissions to execute a certain action over an object, etc.). The authorization constraint can be a boolean attribute, property or method of the model, whichever you prefer for each rule :)\n\n\nh2(#philosophy). Philosophy \n\ndjango-rules strives to build a flexible and scalable authorization backend. Why is it better than other authorization backends out there?\n* The backend is simple, concise and compact. Less lines of code mean less complexity, faster execution and (hopefully :) less errors and bugs.\n* You can implement each authorization constraint as a boolean attribute, property or method of the model, whichever you prefer for each rule :) This way you will be able to re-implement how authorizations work at any time. It is dynamic and you know dynamic sounds way better than static :)\n* You don't have to add extra permissions or groups to your users. You simply program the constraints however you like them to be and then you assign them to the rules. Done!\n* You have fine granularity control over how the rules handle the authentication: one rule can be using an authorization constraint that uses LDAP while other rules call a web service (or anything you wish to hook in the authorization constraint).\n* Other per-object authorization backends create a row in a table for every object, every user and every permission combination. Even with an average-size site, you will have scalability nightmares, no matter how much you can cache.\n* Other authorization backends have to SELECT all permissions that a user has even if you only need to check one specific permission, making the memory footprint bigger.\n* Other authorization backends don't have a way to set centralized permissions, which are a real necessity in most projects out there.\n\n\nh2(#requirements). Requirements\n\ndjango-rules requires a proper installation of Django 1.2 (at least).\n\n\nh2(#installation). Installation\n\nh3(#pypi). From Pypi\n\nAs simple as doing:\n\n<pre>\npip install django-rules\n</pre>\n\nh3(#source). From source\n\nTo install django-rules from source:\n\n<pre>\ngit clone https://github.com/maraujop/django-rules/\ncd django-rules\npython setup.py install\n</pre>\n\n\nh2(#configuration). Configuration\n\nFor django-rules to work, you have to hook it into your project:\n\n* Add it to the list of <code>INSTALLED_APPS</code> in <code>settings.py</code>:\n\n<pre>\nINSTALLED_APPS = (\n    ...\n    'django_rules',\n)\n</pre>\n\n* Add the django-rules authorization backend to the list of <code>AUTHENTICATION_BACKENDS</code> in <code>settings.py</code>:\n\n<pre>\nAUTHENTICATION_BACKENDS = (\n    'django.contrib.auth.backends.ModelBackend', # Django's default auth backend\n    'django_rules.backends.ObjectPermissionBackend',\n)\n</pre>\n\n* Run syncdb to update the database with the new django-rules models:\n\n<pre>\npython manage.py syncdb\n</pre>\n\nh2(#rules). Rules\n\nA rule represents a functional authorization constraint that restricts the actions that a certain user can carry out on a certain object (an instance of a Model).\n\nEvery rule definition is composed of 6 parameters (3 compulsory and 3 optional):\n* <code>app_name</code>: The name of the app to which the rule applies.\n* <code>codename</code>: The name of the rule, _unique across all applications_. It should be a brief but distinctive name.\n* <code>model</code>: The name of the model associated with the rule.\n\n* <code>field_name</code> _(optional)_: The name of the boolean attribute, property or method of the model that implements the authorization constraint. If not set, it defaults to the value of the compulsory field <code>codename</code>.\n* <code>view_param_pk</code> _(optional)_: The view parameter's name to use for getting the primary key of the model. It is used in the decorated views for getting the actual instance of the model, the object where authorizations will be checked on. If not set, it defaults to the name of the primary key field in the model. Note that if the name of the parameter of the view that holds the value of the object's primary key doesn't match the name of the primary key of the model, the new name must be specified in this parameter (we will talk about this special case in \"the section on Decorators\":#decorators).\n* <code>description</code> _(optional)_: A brief (140 characters maximum) description explaining the expected behaviour of the authorization constraint. Although optional, it is considered a Good Practice ^TM^ and should always be used.\n\nThe rules should be created per-Django application. That is, under the root directory of the Django-application in which you want to create rules, you should have a <code>rules.py</code> containing only the declarations of those rules specific to that Django-application.\n\nOnce you have defined the rules in <code>rules.py</code>, you will want to activate them. For every rule that you want to activate you *must* add a registration point for it by calling <code>django_rules.utils.register</code> in <code>rules.py</code>.\n\nFinally, once you have <code>rules.py</code> properly set up, you will want to sync the rules to the database. In your Django project you will have to run <code>sync_rules</code> command:\n\n<pre>\npython manage.py sync_rules\n</pre>\n\nThis command will look for all your <code>rules.py</code> files under your <code>INSTALLED_APPS</code> and will sync the latest changes to the database, so you don't have to run <code>syncdb</code> or rebuild the full database at all.\n\n\nh2(#examples). Examples:\n\n\nh3(#ex1). Example 1: Creating a simple, compact rule for the Item model in the 'shipping' Django-application\n\nLet's image that, within the <code>shipping</code> Django-application, I have the following <code>models.py</code>:\n\n<pre>\nclass Item(models.Model):\n    supplier = models.ForeignKey(User)\n    description = models.CharField(max_length = 50)\n</pre>\n\nThen, imagine that the business logic in our application has a functional authorization constraint for every item such as \"An item can only be shipped by its supplier\". Now, to comply with the functional authorization constraint we only have to create a simple rule.\n\nFirst, let's start by adding an authorization constraint to the Item model. Remember that we can use a method, a boolean attribute or a boolean-returning property. This time we will be using a method:\n\n<pre>\nclass Item(models.Model):\n    supplier = models.ForeignKey(User)\n    description = models.CharField(max_length = 50)\n\n    def can_ship(self, user_obj):\n        \"\"\"\n        Checks if the given user_obj is the supplier of the item\n        \"\"\"\n        return self.supplier == user_obj\n</pre>\n\nThen, to associate the authorization constraint with a rule, we have to set up the rule in the application's <code>rules.py</code> file:\n\n<pre>\nfrom django_rules import utils\n\nrules_list = [\n    {'codename':'can_ship', 'model':'Item'},\n]\n# NOTE:\n# Although the above rule definition follows the minimal style, it is\n# Good Practice ^TM^ to always add the optional 'description' field \n# to give a brief explanation about the expected behaviour of the rule.\n\n\n# For the rules to be active, we *must* register them:\nfor rule in rules_list:\n    utils.register(app_name='shipping', **rule)\n</pre>\n\nFinally, do not forget to sync the rules to make sure that all the new definitions, changes, etc. are synced to the database.\n\n<pre>\npython manage.py sync_rules\n</pre>\n\n\nh3(#ex2). Example 2: Creating a rule that doesn't follow the naming conventions\n\nImagine that we would like to name our authorization constraints however we want. For example, let's change the previous Item model:\n\n<pre>\nclass Item(models.Model):\n    supplier = models.ForeignKey(User)\n    description = models.CharField(max_length = 50)\n\n    def isSameSupplier(self, user_obj):    #--> change in the name convention of the authorization constraint\n        \"\"\"\n        Checks if the given user_obj is the supplier of the item\n        \"\"\"\n        return self.supplier == user_obj\n</pre>\n\nThen, we would have to set up a more verbose rule in the application's <code>rules.py</code> file by using its additional optional fields. This time, only <code>field_name</code> would be needed but it is also Good Practice ^TM^ to give a brief <code>description</code>:\n\n<pre>\nfrom django_rules import utils\n\nrules_list = [\n    {'codename':'can_ship', 'model':'Item', 'field_name':'isSameSupplier',\n     'description':'Checks if the given user is the supplier of the item'},\n]\n\n# For the rules to be active, we *must* register them:\nfor rule in rules_list:\n    utils.register(app_name='shipping', **rule)\n</pre>\n\nAgain, do not forget to sync the rules to make sure that all the new definitions, changes, etc. are applied to the database.\n\n<pre>\npython manage.py sync_rules\n</pre>\n\n\nh3. Using your rules\n\nOnce you have set up a rule that implements a functional authorization constraint, you can (and should :) use it in your application. It is really simple! In every place you want to enforce an authorization constraint on a user, you will simply make the following call:\n\n<pre>\nuser_obj.has_perm(codename, model_obj)\n</pre>\n\nFollowing the previous \"Example 1\":#ex1, let's imagine that the application is already running with data in the database (at least one supplier and one item, both with ids equal to 1). Remember that we have already implemented, defined, registered and synced the following rule:\n\n<pre>\n{'codename':'can_ship', 'model':'Item'}\n</pre>\n\nThen, if we wanted to check whether a supplier can ship an item, we would only have to enforce the rule by doing:\n\n<pre>\nsupplier = Supplier.objects.get(pk = 1)\nitem = Item.objects.get(pk = 1)\n\nif supplier.has_perm('can_ship', item):\n    print 'Yay! The supplier can ship the item! :)'\n</pre>\n\nEasy, right? :)\n\n\nh4. Details about the internal magic of django-rules\n\nPlease note that what follows is a detailed explanation of how all the inner magic in django-rules flows. If you don't really care, please move along. You really don't need these details to be able to write rules and use django-rules effectively. However, if you are curious and want to know more, please pay great attention to the details below.\n\nHere is how all the pieces of the puzzle come together:\n* When you call <code>user_obj.has_perm(codename, model_obj)</code> (in the previous example, <code>supplier.has_perm('can_ship', item)</code>), Django handles the control over to the django-rules backend.\n* The django-rules backend will then try to match the <code>codename</code> with a rule. Note that we are requesting a rule with a <code>codename</code> of <code>'can_ship'</code> and a <code>model_obj</code> like the Model of the item object. Because in \"Example 1\":#ex1 we have defined the rule <code>{'codename':'can_ship', 'model':'Item'}</code>, there will be a match.\n* Then, django-rules will check whether <code>field_name</code> is an attribute, a property or a method, and will act accordingly. If <code>field_name</code> is a method, the django-rules backend will check if it requires just one user parameter or no parameter at all. Depending on the parameter requirements, it will execute <code>model_obj.field_name()</code> or <code>model_obj.field_name(user_obj)</code>. In our \"Example 1\":#ex1 we require a user parameter so it will execute <code>item.can_ship(supplier)</code>.\n* Finally, if the authorization constraint implemented in <code>field_name</code> is True or returns True, the constraint is considered fulfilled. Otherwise, you will not be authorized.\n\n\nh3. Details of using model methods in rules\n\nAs we have seen, django-rules will check whether <code>field_name</code> is an attribute, a property or a method, and will act accordingly. You can create rules based on model's attributes and properties, which are more than fine for very simple cases but most of the time you will be setting <code>field_name</code> to a method in the model.\n\nIt is important to note that this method is limited to having just one parameter (a user object) or no parameters at all. It cannot receive multiple arguments or an argument that is not an instance of User. Although this might seem like a limitation, we could not think of a use case where the rest of the information needed coudn't be retrieved from the user or the model object. If you get into a situation where this is limiting you, please get in touch and explain your problem so that we can think of how to get around it! :)\n\nFinally, you need to be aware of something very important: a method assigned to a rule (let's call them _rule methods_ from now on) *should never call any other method*. That is, they should be self-contained. This is to avoid a potential infinite recursion. Imagine a situation where the rule method calls another method that has _the same_ authorization constraint of the previous rule method. Boom! You just created an infinite loop. Run for your life! :)\n\nYou may be thinking that you can control this but, trust me, it will get very difficult to maintain and scale. Things will not always be that simple, maybe you will end up calling a method that is later modified and ends up calling a helper function that triggers the same authorization loop. Yeah, I know. Indirection is a bitch :) Or, in other words \"Great power comes with great responsibility\". So beware of the infinite loop ;)\n\n\nh2(#decorators). Decorators\n\nIf you like Python as much as I do, you will love decorators. Django has a <code>permission_required</code> decorator, so it felt natural that django-rules implemented an <code>object_permission_required</code> decorator.\n\nImagine that for our \"Example 1\":#ex1 we have the following code in <code>views.py</code>:\n\n<pre>\ndef ship_item(request, id):\n    item = Item.objects.get(pk = id)\n    \n    if request.user.has_perms('can_ship', item):\n        return HttpResponse('success')\n\n    return HttpResponse('error')\n</pre>\n\nWe could easily decorate the view to make the method much more compact and easy to read:\n\n<pre>\nfrom django_rules import object_permission_required\n\n@object_permission_required('can_ship')\ndef ship_item(request, id):\n    return HttpResponse('Item successfully shipper! :)')\n</pre>\n\nThe magic of the decorator is very cool indeed. First, it matches the rule and gets the type of model from it. Then, it gets the <code>id</code> parameter from the view's kwargs and instantiates a Model object with <code>item = model.objects.get(pk = id)</code>. Finally, it can call the <code>request.user.has_perm('can_ship', item)</code> for you and redirect to a fail page if the constraint is not fulfilled.\n\nNote how we have maintained the name of the model's primary key in the parameters of the view. If the parameter has a name that doesn't match the name of the primary key in the model, remember that we will have to add another optional parameter to the rule. From \"the section on Rules:\":#rules\n* <code>view_param_pk</code> _(optional)_: The view parameter's name to use for getting the primary key of the model. It is used in the decorated views for getting the actual instance of the model. If not set, it defaults to the name of the primary key field in the model. Note that if the name of the parameter of the view that holds the value of the object's primary key doesn't match the name of the primary key of the model, the new name must be specified in this parameter.\n\nFor example, if we modify the parameter of the view:\n\n<pre>\nfrom django_rules import object_permission_required\n\n@object_permission_required('can_ship')\ndef ship_item(request, my_item_code):  #--> change in the naming of the parameter in the view\n    return HttpResponse('success')\n</pre>\n\nWe would have to specify the <code>view_param_pk</code> in the rule definition:\n\n<pre>\nrules_list = [\n    {'codename': 'can_ship', 'model': 'Item', 'view_param_pk': 'my_item_code',\n     'description': 'Checks if the given user is the supplier of the item'},\n]\n</pre>\n\n\nThe <code>object_permission_required</code> decorator can receive 4 arguments:\n\n<pre>\n@object_permission_required('can_ship', return_403=True)\n@object_permission_required('can_ship', redirect_url='/more/foo/bar/')\n@object_permission_required('can_ship', redirect_field_name='myFooField')\n@object_permission_required('can_ship', login_url='/foo/bar/')\n</pre>\n\nBy default:\n* <code>return_403</code> is set to False.\n* <code>redirect_url</code> is set to an empty string.\n* <code>redirect_field_name</code> is set to django.contrib.auth's REDIRECT_FIELD_NAME.\n* <code>login_url</code> is set to <code>settings.LOGIN_URL</code>.\n\nThus, if the authorization constraint is not fulfilled, the decorator will default to a redirect to the login page in Django-style :)\n\nAlso, note that a couple of the parameters have a specificity. Namely:\n* if <code>return_403</code> is set to True it will override the rest of the parameters and the decorator will return a HttpResponseForbidden.\n* if <code>redirect_url</code> is set to a URL, it will override that of <code>login_url</code>.\n\nFinally, it is important to note a tricky detail regarding the use of the decorator to guard the access of those methods that are not directly exposed as views mapped to external URLs. When a view method is an entry point through URLs (that is, if your view method is mapped directly to one of the <code>urls.py</code> entries), Django parses the URL and passes the parameters to the view as <code>kwargs</code>. Thus, if you want to use the <code>object_permission_required</code> decorator over an internal method (a method that is called inside one of those external views or somewhere else in your code) you must use <code>kwargs</code> when passing the parameters.\n\nLet's see an example:\n\n<pre>\ndef item_shipper(request, id):\n    internal_code = 'XXX-' + my_item_code\n    return _ship_item(request, id=internal_code)    # instead of doing return _ship_item(request, internal_code)\n\n@object_permission_required('can_ship')\ndef _ship_item(request, id)\n    return HttpResponse('success')\n</pre>\n\nh2(#centralizedpermissions). Centralized Permissions\n\ndjango-rules has a central authorization dispatcher that is aimed towards a very common need in real life projects: the special, privileged groups such as administrators, user-support staff, etc., that have permissions to override certain aspects of the authorization constraints in the application. For such cases, django-rules has a way to let you bypass its authorization system for whatever reasons you have.\n\nTo set up centralized permissions, you will need to set in your project settings the variable <code>CENTRAL_AUTHORIZATIONS</code> pointing to a module. Within that module, you will have to define a a boolean-returning function named <code>central_authorizations</code> accepting exactly two parameters:\n* <code>user_obj</code>: the user object.\n* <code>codename</code>: the codename of the rule we will be overriden. It is very useful to refine the permissions of a special user \"a la ACL\".\nNote that, although the naming of the parameters doesn't really matter, the order does. The first parameter will receive a user object, and the second parameter, the codename of the rule.\n\nThis <code>central_authorizations()</code> function will be called *before* any other rule, so you can override all of them here.\n\nFor example, in <code>settings.py</code> you will add:\n\n<pre>\nCENTRAL_AUTHORIZATIONS = 'myProjectFoo.utils'\n</pre>\n\nAnd then, within myProjectFoo, in <code>utils.py</code>, you will implement the <code>central_authorizations()</code> function with the overrides for the special users.\n\nImagine you want to give some special access to user support staff that will be able to access some private fields in the profile (for example, email and age) that generally are hidden to regular users of the application. They are user support, so they should not be able to override certain things in the application. Yet, you also want your über-admins (generally the developers) to be able to access anything within the application so that they can code and test quickly while developing.\n\nIn such case, you can write the following <code>central_authorizations()</code> function:\n\n<pre>\ndef central_authorizations(user_obj, codename):\n    \"\"\"\n    This function will be called *before* any other rule,\n    so you can override all of the permissions here.\n    \"\"\"\n    isAuthorized = False\n\n    if user_obj.get_profile().isUberAdmin():\n        isAuthorized = True\n    elif user_obj.get_profile().isUserSupport() and codename in ['can_see_full_profile', 'can_delete_item']:\n        isAuthorized = True\n\n    return isAuthorized\n</pre>\n\nAs you can imagine, everything that is checked in <code>central_authorizations</code> is global to the *whole* project.\n\n\nh2. Status and testing\n\ndjango-rules is meant to be a security application. Thus, it has been thoroughly tested. It comes with a battery of tests that tries to cover all of the available funcionality. However, if you come across a bug or an irregular situation, feel free to report it through the \"Github bug tracker\":https://github.com/maraujop/django-rules/issues.\n\nFinally, the application comes geared with many different exceptions that will make sure rules are created properly. They are also aimed to keep the security of your application away from negligence. Manage the exceptions wisely and you will be a happy and secure coder, as security is kept away from possible neglicence. You should manage them carefuly.\n\n\nh3. Testing django-rules\n\nTo run tests, get into tests directory and execute:\n\n<pre>\n./runtests.py\n</pre> \n\nIt should always say OK. If not, there is a broken test that I hope you will be reporting soon :)\n\n\nh2. Need more examples?\n\nI have done my best trying to explain the concept behind django-rules but, if you would rather look at more code examples, I am sure you will find the \"code in the tests\":https://github.com/maraujop/django-rules/blob/master/django_rules/tests/test_core.py quite useful :)\n\n\nh2. More Documentation\n\nIn case you want to know where all this \"per-object authentication backend in Django\" came to exist, you should at least read the following links:\n* A great article about \"per-object permission backends in Django\":http://djangoadvent.com/1.2/object-permissions/ by Florian Apolloner\n* Also, check the explanation of the changes introduced when fixing the \"django ticket #11010\":http://code.djangoproject.com/ticket/11010\n\nFinally, my most sincere appreciation goes to everybody that contributes to the wonderful Django development framework and also to the rest of developers and committers that build django-rules with their help. Respect! :)", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://github.com/maraujop/django-rules", "keywords": "authorization,backends,django,rules,permissions", "license": "BSD", "maintainer": null, "maintainer_email": null, "name": "django-rules", "package_url": "https://pypi.org/project/django-rules/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/django-rules/", "project_urls": {"Download": "UNKNOWN", "Homepage": "http://github.com/maraujop/django-rules"}, "release_url": "https://pypi.org/project/django-rules/0.2/", "requires_dist": null, "requires_python": null, "summary": "Flexible per-object authorization backend for Django", "version": "0.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            h1(#abstract). django-rules<br><br>django-rules is a Django authorization backend that offers a unified, per-object authorization management. It is quite different from other authorization backends in the way it lets you flexibly manage per-object permissions.<br><br>In django-rules every rule adds an authorization constraint to a given model. The authorization constraint will check if the given user complies with the constraint (e.g. if the user has the right permissions to execute a certain action over an object, etc.). The authorization constraint can be a boolean attribute, property or method of the model, whichever you prefer for each rule :)<br><br><br>h2(#philosophy). Philosophy <br><br>django-rules strives to build a flexible and scalable authorization backend. Why is it better than other authorization backends out there?<br>* The backend is simple, concise and compact. Less lines of code mean less complexity, faster execution and (hopefully :) less errors and bugs.<br>* You can implement each authorization constraint as a boolean attribute, property or method of the model, whichever you prefer for each rule :) This way you will be able to re-implement how authorizations work at any time. It is dynamic and you know dynamic sounds way better than static :)<br>* You don't have to add extra permissions or groups to your users. You simply program the constraints however you like them to be and then you assign them to the rules. Done!<br>* You have fine granularity control over how the rules handle the authentication: one rule can be using an authorization constraint that uses LDAP while other rules call a web service (or anything you wish to hook in the authorization constraint).<br>* Other per-object authorization backends create a row in a table for every object, every user and every permission combination. Even with an average-size site, you will have scalability nightmares, no matter how much you can cache.<br>* Other authorization backends have to SELECT all permissions that a user has even if you only need to check one specific permission, making the memory footprint bigger.<br>* Other authorization backends don't have a way to set centralized permissions, which are a real necessity in most projects out there.<br><br><br>h2(#requirements). Requirements<br><br>django-rules requires a proper installation of Django 1.2 (at least).<br><br><br>h2(#installation). Installation<br><br>h3(#pypi). From Pypi<br><br>As simple as doing:<br><br>&lt;pre&gt;<br>pip install django-rules<br>&lt;/pre&gt;<br><br>h3(#source). From source<br><br>To install django-rules from source:<br><br>&lt;pre&gt;<br>git clone https://github.com/maraujop/django-rules/<br>cd django-rules<br>python setup.py install<br>&lt;/pre&gt;<br><br><br>h2(#configuration). Configuration<br><br>For django-rules to work, you have to hook it into your project:<br><br>* Add it to the list of &lt;code&gt;INSTALLED_APPS&lt;/code&gt; in &lt;code&gt;settings.py&lt;/code&gt;:<br><br>&lt;pre&gt;<br>INSTALLED_APPS = (<br>    ...<br>    'django_rules',<br>)<br>&lt;/pre&gt;<br><br>* Add the django-rules authorization backend to the list of &lt;code&gt;AUTHENTICATION_BACKENDS&lt;/code&gt; in &lt;code&gt;settings.py&lt;/code&gt;:<br><br>&lt;pre&gt;<br>AUTHENTICATION_BACKENDS = (<br>    'django.contrib.auth.backends.ModelBackend', # Django's default auth backend<br>    'django_rules.backends.ObjectPermissionBackend',<br>)<br>&lt;/pre&gt;<br><br>* Run syncdb to update the database with the new django-rules models:<br><br>&lt;pre&gt;<br>python manage.py syncdb<br>&lt;/pre&gt;<br><br>h2(#rules). Rules<br><br>A rule represents a functional authorization constraint that restricts the actions that a certain user can carry out on a certain object (an instance of a Model).<br><br>Every rule definition is composed of 6 parameters (3 compulsory and 3 optional):<br>* &lt;code&gt;app_name&lt;/code&gt;: The name of the app to which the rule applies.<br>* &lt;code&gt;codename&lt;/code&gt;: The name of the rule, _unique across all applications_. It should be a brief but distinctive name.<br>* &lt;code&gt;model&lt;/code&gt;: The name of the model associated with the rule.<br><br>* &lt;code&gt;field_name&lt;/code&gt; _(optional)_: The name of the boolean attribute, property or method of the model that implements the authorization constraint. If not set, it defaults to the value of the compulsory field &lt;code&gt;codename&lt;/code&gt;.<br>* &lt;code&gt;view_param_pk&lt;/code&gt; _(optional)_: The view parameter's name to use for getting the primary key of the model. It is used in the decorated views for getting the actual instance of the model, the object where authorizations will be checked on. If not set, it defaults to the name of the primary key field in the model. Note that if the name of the parameter of the view that holds the value of the object's primary key doesn't match the name of the primary key of the model, the new name must be specified in this parameter (we will talk about this special case in \"the section on Decorators\":#decorators).<br>* &lt;code&gt;description&lt;/code&gt; _(optional)_: A brief (140 characters maximum) description explaining the expected behaviour of the authorization constraint. Although optional, it is considered a Good Practice ^TM^ and should always be used.<br><br>The rules should be created per-Django application. That is, under the root directory of the Django-application in which you want to create rules, you should have a &lt;code&gt;rules.py&lt;/code&gt; containing only the declarations of those rules specific to that Django-application.<br><br>Once you have defined the rules in &lt;code&gt;rules.py&lt;/code&gt;, you will want to activate them. For every rule that you want to activate you *must* add a registration point for it by calling &lt;code&gt;django_rules.utils.register&lt;/code&gt; in &lt;code&gt;rules.py&lt;/code&gt;.<br><br>Finally, once you have &lt;code&gt;rules.py&lt;/code&gt; properly set up, you will want to sync the rules to the database. In your Django project you will have to run &lt;code&gt;sync_rules&lt;/code&gt; command:<br><br>&lt;pre&gt;<br>python manage.py sync_rules<br>&lt;/pre&gt;<br><br>This command will look for all your &lt;code&gt;rules.py&lt;/code&gt; files under your &lt;code&gt;INSTALLED_APPS&lt;/code&gt; and will sync the latest changes to the database, so you don't have to run &lt;code&gt;syncdb&lt;/code&gt; or rebuild the full database at all.<br><br><br>h2(#examples). Examples:<br><br><br>h3(#ex1). Example 1: Creating a simple, compact rule for the Item model in the 'shipping' Django-application<br><br>Let's image that, within the &lt;code&gt;shipping&lt;/code&gt; Django-application, I have the following &lt;code&gt;models.py&lt;/code&gt;:<br><br>&lt;pre&gt;<br>class Item(models.Model):<br>    supplier = models.ForeignKey(User)<br>    description = models.CharField(max_length = 50)<br>&lt;/pre&gt;<br><br>Then, imagine that the business logic in our application has a functional authorization constraint for every item such as \"An item can only be shipped by its supplier\". Now, to comply with the functional authorization constraint we only have to create a simple rule.<br><br>First, let's start by adding an authorization constraint to the Item model. Remember that we can use a method, a boolean attribute or a boolean-returning property. This time we will be using a method:<br><br>&lt;pre&gt;<br>class Item(models.Model):<br>    supplier = models.ForeignKey(User)<br>    description = models.CharField(max_length = 50)<br><br>    def can_ship(self, user_obj):<br>        \"\"\"<br>        Checks if the given user_obj is the supplier of the item<br>        \"\"\"<br>        return self.supplier == user_obj<br>&lt;/pre&gt;<br><br>Then, to associate the authorization constraint with a rule, we have to set up the rule in the application's &lt;code&gt;rules.py&lt;/code&gt; file:<br><br>&lt;pre&gt;<br>from django_rules import utils<br><br>rules_list = [<br>    {'codename':'can_ship', 'model':'Item'},<br>]<br># NOTE:<br># Although the above rule definition follows the minimal style, it is<br># Good Practice ^TM^ to always add the optional 'description' field <br># to give a brief explanation about the expected behaviour of the rule.<br><br><br># For the rules to be active, we *must* register them:<br>for rule in rules_list:<br>    utils.register(app_name='shipping', **rule)<br>&lt;/pre&gt;<br><br>Finally, do not forget to sync the rules to make sure that all the new definitions, changes, etc. are synced to the database.<br><br>&lt;pre&gt;<br>python manage.py sync_rules<br>&lt;/pre&gt;<br><br><br>h3(#ex2). Example 2: Creating a rule that doesn't follow the naming conventions<br><br>Imagine that we would like to name our authorization constraints however we want. For example, let's change the previous Item model:<br><br>&lt;pre&gt;<br>class Item(models.Model):<br>    supplier = models.ForeignKey(User)<br>    description = models.CharField(max_length = 50)<br><br>    def isSameSupplier(self, user_obj):    #--&gt; change in the name convention of the authorization constraint<br>        \"\"\"<br>        Checks if the given user_obj is the supplier of the item<br>        \"\"\"<br>        return self.supplier == user_obj<br>&lt;/pre&gt;<br><br>Then, we would have to set up a more verbose rule in the application's &lt;code&gt;rules.py&lt;/code&gt; file by using its additional optional fields. This time, only &lt;code&gt;field_name&lt;/code&gt; would be needed but it is also Good Practice ^TM^ to give a brief &lt;code&gt;description&lt;/code&gt;:<br><br>&lt;pre&gt;<br>from django_rules import utils<br><br>rules_list = [<br>    {'codename':'can_ship', 'model':'Item', 'field_name':'isSameSupplier',<br>     'description':'Checks if the given user is the supplier of the item'},<br>]<br><br># For the rules to be active, we *must* register them:<br>for rule in rules_list:<br>    utils.register(app_name='shipping', **rule)<br>&lt;/pre&gt;<br><br>Again, do not forget to sync the rules to make sure that all the new definitions, changes, etc. are applied to the database.<br><br>&lt;pre&gt;<br>python manage.py sync_rules<br>&lt;/pre&gt;<br><br><br>h3. Using your rules<br><br>Once you have set up a rule that implements a functional authorization constraint, you can (and should :) use it in your application. It is really simple! In every place you want to enforce an authorization constraint on a user, you will simply make the following call:<br><br>&lt;pre&gt;<br>user_obj.has_perm(codename, model_obj)<br>&lt;/pre&gt;<br><br>Following the previous \"Example 1\":#ex1, let's imagine that the application is already running with data in the database (at least one supplier and one item, both with ids equal to 1). Remember that we have already implemented, defined, registered and synced the following rule:<br><br>&lt;pre&gt;<br>{'codename':'can_ship', 'model':'Item'}<br>&lt;/pre&gt;<br><br>Then, if we wanted to check whether a supplier can ship an item, we would only have to enforce the rule by doing:<br><br>&lt;pre&gt;<br>supplier = Supplier.objects.get(pk = 1)<br>item = Item.objects.get(pk = 1)<br><br>if supplier.has_perm('can_ship', item):<br>    print 'Yay! The supplier can ship the item! :)'<br>&lt;/pre&gt;<br><br>Easy, right? :)<br><br><br>h4. Details about the internal magic of django-rules<br><br>Please note that what follows is a detailed explanation of how all the inner magic in django-rules flows. If you don't really care, please move along. You really don't need these details to be able to write rules and use django-rules effectively. However, if you are curious and want to know more, please pay great attention to the details below.<br><br>Here is how all the pieces of the puzzle come together:<br>* When you call &lt;code&gt;user_obj.has_perm(codename, model_obj)&lt;/code&gt; (in the previous example, &lt;code&gt;supplier.has_perm('can_ship', item)&lt;/code&gt;), Django handles the control over to the django-rules backend.<br>* The django-rules backend will then try to match the &lt;code&gt;codename&lt;/code&gt; with a rule. Note that we are requesting a rule with a &lt;code&gt;codename&lt;/code&gt; of &lt;code&gt;'can_ship'&lt;/code&gt; and a &lt;code&gt;model_obj&lt;/code&gt; like the Model of the item object. Because in \"Example 1\":#ex1 we have defined the rule &lt;code&gt;{'codename':'can_ship', 'model':'Item'}&lt;/code&gt;, there will be a match.<br>* Then, django-rules will check whether &lt;code&gt;field_name&lt;/code&gt; is an attribute, a property or a method, and will act accordingly. If &lt;code&gt;field_name&lt;/code&gt; is a method, the django-rules backend will check if it requires just one user parameter or no parameter at all. Depending on the parameter requirements, it will execute &lt;code&gt;model_obj.field_name()&lt;/code&gt; or &lt;code&gt;model_obj.field_name(user_obj)&lt;/code&gt;. In our \"Example 1\":#ex1 we require a user parameter so it will execute &lt;code&gt;item.can_ship(supplier)&lt;/code&gt;.<br>* Finally, if the authorization constraint implemented in &lt;code&gt;field_name&lt;/code&gt; is True or returns True, the constraint is considered fulfilled. Otherwise, you will not be authorized.<br><br><br>h3. Details of using model methods in rules<br><br>As we have seen, django-rules will check whether &lt;code&gt;field_name&lt;/code&gt; is an attribute, a property or a method, and will act accordingly. You can create rules based on model's attributes and properties, which are more than fine for very simple cases but most of the time you will be setting &lt;code&gt;field_name&lt;/code&gt; to a method in the model.<br><br>It is important to note that this method is limited to having just one parameter (a user object) or no parameters at all. It cannot receive multiple arguments or an argument that is not an instance of User. Although this might seem like a limitation, we could not think of a use case where the rest of the information needed coudn't be retrieved from the user or the model object. If you get into a situation where this is limiting you, please get in touch and explain your problem so that we can think of how to get around it! :)<br><br>Finally, you need to be aware of something very important: a method assigned to a rule (let's call them _rule methods_ from now on) *should never call any other method*. That is, they should be self-contained. This is to avoid a potential infinite recursion. Imagine a situation where the rule method calls another method that has _the same_ authorization constraint of the previous rule method. Boom! You just created an infinite loop. Run for your life! :)<br><br>You may be thinking that you can control this but, trust me, it will get very difficult to maintain and scale. Things will not always be that simple, maybe you will end up calling a method that is later modified and ends up calling a helper function that triggers the same authorization loop. Yeah, I know. Indirection is a bitch :) Or, in other words \"Great power comes with great responsibility\". So beware of the infinite loop ;)<br><br><br>h2(#decorators). Decorators<br><br>If you like Python as much as I do, you will love decorators. Django has a &lt;code&gt;permission_required&lt;/code&gt; decorator, so it felt natural that django-rules implemented an &lt;code&gt;object_permission_required&lt;/code&gt; decorator.<br><br>Imagine that for our \"Example 1\":#ex1 we have the following code in &lt;code&gt;views.py&lt;/code&gt;:<br><br>&lt;pre&gt;<br>def ship_item(request, id):<br>    item = Item.objects.get(pk = id)<br>    <br>    if request.user.has_perms('can_ship', item):<br>        return HttpResponse('success')<br><br>    return HttpResponse('error')<br>&lt;/pre&gt;<br><br>We could easily decorate the view to make the method much more compact and easy to read:<br><br>&lt;pre&gt;<br>from django_rules import object_permission_required<br><br>@object_permission_required('can_ship')<br>def ship_item(request, id):<br>    return HttpResponse('Item successfully shipper! :)')<br>&lt;/pre&gt;<br><br>The magic of the decorator is very cool indeed. First, it matches the rule and gets the type of model from it. Then, it gets the &lt;code&gt;id&lt;/code&gt; parameter from the view's kwargs and instantiates a Model object with &lt;code&gt;item = model.objects.get(pk = id)&lt;/code&gt;. Finally, it can call the &lt;code&gt;request.user.has_perm('can_ship', item)&lt;/code&gt; for you and redirect to a fail page if the constraint is not fulfilled.<br><br>Note how we have maintained the name of the model's primary key in the parameters of the view. If the parameter has a name that doesn't match the name of the primary key in the model, remember that we will have to add another optional parameter to the rule. From \"the section on Rules:\":#rules<br>* &lt;code&gt;view_param_pk&lt;/code&gt; _(optional)_: The view parameter's name to use for getting the primary key of the model. It is used in the decorated views for getting the actual instance of the model. If not set, it defaults to the name of the primary key field in the model. Note that if the name of the parameter of the view that holds the value of the object's primary key doesn't match the name of the primary key of the model, the new name must be specified in this parameter.<br><br>For example, if we modify the parameter of the view:<br><br>&lt;pre&gt;<br>from django_rules import object_permission_required<br><br>@object_permission_required('can_ship')<br>def ship_item(request, my_item_code):  #--&gt; change in the naming of the parameter in the view<br>    return HttpResponse('success')<br>&lt;/pre&gt;<br><br>We would have to specify the &lt;code&gt;view_param_pk&lt;/code&gt; in the rule definition:<br><br>&lt;pre&gt;<br>rules_list = [<br>    {'codename': 'can_ship', 'model': 'Item', 'view_param_pk': 'my_item_code',<br>     'description': 'Checks if the given user is the supplier of the item'},<br>]<br>&lt;/pre&gt;<br><br><br>The &lt;code&gt;object_permission_required&lt;/code&gt; decorator can receive 4 arguments:<br><br>&lt;pre&gt;<br>@object_permission_required('can_ship', return_403=True)<br>@object_permission_required('can_ship', redirect_url='/more/foo/bar/')<br>@object_permission_required('can_ship', redirect_field_name='myFooField')<br>@object_permission_required('can_ship', login_url='/foo/bar/')<br>&lt;/pre&gt;<br><br>By default:<br>* &lt;code&gt;return_403&lt;/code&gt; is set to False.<br>* &lt;code&gt;redirect_url&lt;/code&gt; is set to an empty string.<br>* &lt;code&gt;redirect_field_name&lt;/code&gt; is set to django.contrib.auth's REDIRECT_FIELD_NAME.<br>* &lt;code&gt;login_url&lt;/code&gt; is set to &lt;code&gt;settings.LOGIN_URL&lt;/code&gt;.<br><br>Thus, if the authorization constraint is not fulfilled, the decorator will default to a redirect to the login page in Django-style :)<br><br>Also, note that a couple of the parameters have a specificity. Namely:<br>* if &lt;code&gt;return_403&lt;/code&gt; is set to True it will override the rest of the parameters and the decorator will return a HttpResponseForbidden.<br>* if &lt;code&gt;redirect_url&lt;/code&gt; is set to a URL, it will override that of &lt;code&gt;login_url&lt;/code&gt;.<br><br>Finally, it is important to note a tricky detail regarding the use of the decorator to guard the access of those methods that are not directly exposed as views mapped to external URLs. When a view method is an entry point through URLs (that is, if your view method is mapped directly to one of the &lt;code&gt;urls.py&lt;/code&gt; entries), Django parses the URL and passes the parameters to the view as &lt;code&gt;kwargs&lt;/code&gt;. Thus, if you want to use the &lt;code&gt;object_permission_required&lt;/code&gt; decorator over an internal method (a method that is called inside one of those external views or somewhere else in your code) you must use &lt;code&gt;kwargs&lt;/code&gt; when passing the parameters.<br><br>Let's see an example:<br><br>&lt;pre&gt;<br>def item_shipper(request, id):<br>    internal_code = 'XXX-' + my_item_code<br>    return _ship_item(request, id=internal_code)    # instead of doing return _ship_item(request, internal_code)<br><br>@object_permission_required('can_ship')<br>def _ship_item(request, id)<br>    return HttpResponse('success')<br>&lt;/pre&gt;<br><br>h2(#centralizedpermissions). Centralized Permissions<br><br>django-rules has a central authorization dispatcher that is aimed towards a very common need in real life projects: the special, privileged groups such as administrators, user-support staff, etc., that have permissions to override certain aspects of the authorization constraints in the application. For such cases, django-rules has a way to let you bypass its authorization system for whatever reasons you have.<br><br>To set up centralized permissions, you will need to set in your project settings the variable &lt;code&gt;CENTRAL_AUTHORIZATIONS&lt;/code&gt; pointing to a module. Within that module, you will have to define a a boolean-returning function named &lt;code&gt;central_authorizations&lt;/code&gt; accepting exactly two parameters:<br>* &lt;code&gt;user_obj&lt;/code&gt;: the user object.<br>* &lt;code&gt;codename&lt;/code&gt;: the codename of the rule we will be overriden. It is very useful to refine the permissions of a special user \"a la ACL\".<br>Note that, although the naming of the parameters doesn't really matter, the order does. The first parameter will receive a user object, and the second parameter, the codename of the rule.<br><br>This &lt;code&gt;central_authorizations()&lt;/code&gt; function will be called *before* any other rule, so you can override all of them here.<br><br>For example, in &lt;code&gt;settings.py&lt;/code&gt; you will add:<br><br>&lt;pre&gt;<br>CENTRAL_AUTHORIZATIONS = 'myProjectFoo.utils'<br>&lt;/pre&gt;<br><br>And then, within myProjectFoo, in &lt;code&gt;utils.py&lt;/code&gt;, you will implement the &lt;code&gt;central_authorizations()&lt;/code&gt; function with the overrides for the special users.<br><br>Imagine you want to give some special access to user support staff that will be able to access some private fields in the profile (for example, email and age) that generally are hidden to regular users of the application. They are user support, so they should not be able to override certain things in the application. Yet, you also want your über-admins (generally the developers) to be able to access anything within the application so that they can code and test quickly while developing.<br><br>In such case, you can write the following &lt;code&gt;central_authorizations()&lt;/code&gt; function:<br><br>&lt;pre&gt;<br>def central_authorizations(user_obj, codename):<br>    \"\"\"<br>    This function will be called *before* any other rule,<br>    so you can override all of the permissions here.<br>    \"\"\"<br>    isAuthorized = False<br><br>    if user_obj.get_profile().isUberAdmin():<br>        isAuthorized = True<br>    elif user_obj.get_profile().isUserSupport() and codename in ['can_see_full_profile', 'can_delete_item']:<br>        isAuthorized = True<br><br>    return isAuthorized<br>&lt;/pre&gt;<br><br>As you can imagine, everything that is checked in &lt;code&gt;central_authorizations&lt;/code&gt; is global to the *whole* project.<br><br><br>h2. Status and testing<br><br>django-rules is meant to be a security application. Thus, it has been thoroughly tested. It comes with a battery of tests that tries to cover all of the available funcionality. However, if you come across a bug or an irregular situation, feel free to report it through the \"Github bug tracker\":https://github.com/maraujop/django-rules/issues.<br><br>Finally, the application comes geared with many different exceptions that will make sure rules are created properly. They are also aimed to keep the security of your application away from negligence. Manage the exceptions wisely and you will be a happy and secure coder, as security is kept away from possible neglicence. You should manage them carefuly.<br><br><br>h3. Testing django-rules<br><br>To run tests, get into tests directory and execute:<br><br>&lt;pre&gt;<br>./runtests.py<br>&lt;/pre&gt; <br><br>It should always say OK. If not, there is a broken test that I hope you will be reporting soon :)<br><br><br>h2. Need more examples?<br><br>I have done my best trying to explain the concept behind django-rules but, if you would rather look at more code examples, I am sure you will find the \"code in the tests\":https://github.com/maraujop/django-rules/blob/master/django_rules/tests/test_core.py quite useful :)<br><br><br>h2. More Documentation<br><br>In case you want to know where all this \"per-object authentication backend in Django\" came to exist, you should at least read the following links:<br>* A great article about \"per-object permission backends in Django\":http://djangoadvent.com/1.2/object-permissions/ by Florian Apolloner<br>* Also, check the explanation of the changes introduced when fixing the \"django ticket #11010\":http://code.djangoproject.com/ticket/11010<br><br>Finally, my most sincere appreciation goes to everybody that contributes to the wonderful Django development framework and also to the rest of developers and committers that build django-rules with their help. Respect! :)\n          </div>"}, "last_serial": 790523, "releases": {"0.1": [{"comment_text": "", "digests": {"md5": "167462ca23d12ba5889d0170770ee830", "sha256": "a7d695f2f30b895845a288d974ca99ecf68296c57353885e26bc0c01a02f318b"}, "downloads": -1, "filename": "django-rules-0.1.tar.gz", "has_sig": false, "md5_digest": "167462ca23d12ba5889d0170770ee830", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 25124, "upload_time": "2011-02-23T15:02:59", "upload_time_iso_8601": "2011-02-23T15:02:59.325091Z", "url": "https://files.pythonhosted.org/packages/fe/91/0e4015f36365766fa294077ebcae2888885dc3df9c06b27de6e30826ac0f/django-rules-0.1.tar.gz", "yanked": false}], "0.2": [{"comment_text": "", "digests": {"md5": "11ff5214f631abe2c8f5e7e3d2ce6ff3", "sha256": "e06bd6eaed7e9dd1840937f0cdf13e69ff6a0be954e54f904ab15a1b271b72da"}, "downloads": -1, "filename": "django-rules-0.2.tar.gz", "has_sig": false, "md5_digest": "11ff5214f631abe2c8f5e7e3d2ce6ff3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 25256, "upload_time": "2011-06-07T13:01:24", "upload_time_iso_8601": "2011-06-07T13:01:24.958456Z", "url": "https://files.pythonhosted.org/packages/78/f3/0a77aafe3dfdff29ec67ae445ab7fd9184eeeba6e34fe50488bbd5afac8c/django-rules-0.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "11ff5214f631abe2c8f5e7e3d2ce6ff3", "sha256": "e06bd6eaed7e9dd1840937f0cdf13e69ff6a0be954e54f904ab15a1b271b72da"}, "downloads": -1, "filename": "django-rules-0.2.tar.gz", "has_sig": false, "md5_digest": "11ff5214f631abe2c8f5e7e3d2ce6ff3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 25256, "upload_time": "2011-06-07T13:01:24", "upload_time_iso_8601": "2011-06-07T13:01:24.958456Z", "url": "https://files.pythonhosted.org/packages/78/f3/0a77aafe3dfdff29ec67ae445ab7fd9184eeeba6e34fe50488bbd5afac8c/django-rules-0.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:53:52 2020"}