{"info": {"author": "Jiao Lin", "author_email": "linjiao@caltech.edu", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta"], "description": "DrChops is an open-source software to reduce data from direct-geometry time-of-flight neutron chopper \r\nspectrometers.", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://drchops.caltech.edu", "keywords": "neutron, chopper spectrometer, reduction, event mode", "license": "DANSE/DrChops Software 1.3pre1\r\n\r\nCOPYRIGHT AND PERMISSION NOTICE:\r\nCopyright (c) 2009 California Institute of Technology. All rights reserved. \r\nPermission is hereby granted, free of charge, to any person obtaining a copy \r\nof this software and associated documentation files (the â\u0080\u009cSoftwareâ\u0080\u009d), to deal in \r\nthe Software without restriction, including without limitation the rights to use, \r\ncopy, modify, merge, publish, distribute, and/or sell copies of the Software, and to \r\npermit persons to whom the Software is furnished to do so, provided that the above \r\ncopyright notice(s) and this permission notice appear in all copies of the Software \r\nand that both the above copyright notice(s) and this permission notice appear in \r\nsupporting documentation. \r\n\r\nTHE SOFTWARE IS PROVIDED â\u0080\u009cAS ISâ\u0080\u009d, WITHOUT WARRANTY OF ANY \r\nKIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE \r\nWARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PUR- \r\nPOSE AND NONINFRINGEMENT OF THIRD PARTY RIGHTS. IN NO EVENT \r\nSHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NO- \r\nTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CON- \r\nSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING \r\nFROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF \r\nCONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT \r\nOF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS \r\nSOFTWARE. \r\n\r\nExcept as contained in this notice, the name of a copyright holder shall not be \r\nused in advertising or otherwise to promote the sale, use or other dealings in this \r\nSoftware without prior written authorization of the copyright holder. \r\nAll source code included in this distribution is covered by this notice, unless \r\nspecifically stated otherwise within each file. See each file within each release for \r\nspecific copyright holders. \r\n\r\nDANSE is the name of a software system under construction with U.S. National \r\nScience Foundation funding.  All work derived from DANSE software should\r\nacknowledge DANSE with the following statement:\r\n\r\n  \"This work benefitted from DANSE software developed\r\n   under NSF award DMR-0520547.\"", "maintainer": "Jiao Lin", "maintainer_email": "linjiao@caltech.edu", "name": "DrChops", "package_url": "https://pypi.org/project/DrChops/", "platform": "Mac OS X, linux", "project_url": "https://pypi.org/project/DrChops/", "project_urls": {"Homepage": "http://drchops.caltech.edu"}, "release_url": "https://pypi.org/project/DrChops/1.3pre1/", "requires_dist": null, "requires_python": null, "summary": "Data Reduction for Chopper Spectrometers", "version": "1.3pre1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>DrChops is an open-source software to reduce data from direct-geometry time-of-flight neutron chopper\nspectrometers.</p>\n\n          </div>"}, "last_serial": 95090, "releases": {"1.3pre1": []}, "urls": [], "timestamp": "Fri May  8 00:49:50 2020"}