{"info": {"author": "Ray Brown", "author_email": "code@liquibits.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Intended Audience :: Developers", "License :: OSI Approved :: Apache Software License", "Operating System :: Microsoft :: Windows", "Operating System :: POSIX :: Linux", "Programming Language :: Python :: 2.7", "Topic :: Security :: Cryptography", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "Datagram Transport Layer Security for Python\n============================================\n\nPyDTLS brings Datagram Transport Layer Security (DTLS - RFC 6347:\nhttp://tools.ietf.org/html/rfc6347) to the Python environment. In a\nnutshell, DTLS brings security (encryption, server authentication, user\nauthentication, and message authentication) to UDP datagram payloads in\na manner equivalent to what SSL/TLS does for TCP stream content.\n\nDTLS is now very easy to use in Python. If you're familiar with the ssl\nmodule in Python's standard library, you already know how. All it takes\nis passing a datagram/UDP socket to the *wrap\\_socket* function instead\nof a stream/TCP socket. Here's how one sets up the client side of a\nconnection:\n\n::\n\n    import ssl\n    from socket import socket, AF_INET, SOCK_DGRAM\n    from dtls import do_patch\n    do_patch()\n    sock = ssl.wrap_socket(socket(AF_INET, SOCK_DGRAM))\n    sock.connect(('foo.bar.com', 1234))\n    sock.send('Hi there')\n\nAs of version 1.2.0, PyDTLS supports DTLS version 1.2 in addition to\nversion 1.0. This version also introduces forward secrecy using elliptic\ncurve cryptography and more fine-grained configuration options.\n\nInstallation\n------------\n\nTo install from PyPI, on any supported platform enter:\n\n::\n\n    pip install Dtls\n\nDesign Goals\n------------\n\nThe primary design goal of PyDTLS is broad availability. It has\ntherefore been built to be widely compatible with the following:\n\n-  Operating systems: apart from the Python standard library, PyDTLS\n   relies on the OpenSSL library only. OpenSSL is widely ported, and in\n   fact the Python standard library's *ssl* module also uses it.\n-  Python runtime environments: PyDTLS is a package consisting of pure\n   Python modules only. It should therefore be portable to many\n   interpreters and runtime environments. It interfaces with OpenSSL\n   strictly through the standard library's *ctypes* foreign function\n   library.\n-  The Python standard library: the standard library's *ssl* module is\n   Python's de facto interface to SSL/TLS. PyDTLS aims to be compatible\n   with the full public interface presented by this module. The ssl\n   module ought to behave identically with respect to all of its\n   functions and options when used in conjunction with PyDTLS and\n   datagram sockets as when used without PyDTLS and stream sockets.\n-  Connection-based protocols: as outlined below, layering security on\n   top of datagram sockets requires introducing certain connection\n   constructs normally absent from datagram sockets. These constructs\n   have been added in such a way as to be compatible with code that\n   expects to interoperate with connection-oriented stream sockets. For\n   example, code that expects to go through server-side\n   bind/listen/accept connection establishment should be reusable with\n   PyDTLS sockets.\n\nDistributions\n-------------\n\nPyDTLS requires version 1.0.0 or higher of the OpenSSL library. Earlier\nversions are reported not to offer stable DTLS support. Since packaged\ndistributions of this version of OpenSSL are available for many popular\noperating systems, OpenSSL-1.0.0 is an installation requirement before\nPyDTLS functionality can be called. On Ubuntu 12.04 LTS, for example,\nthe Python interpreter links with libcrypto.so.1.0.0 and\nlibssl.so.1.0.0, and so use of PyDTLS requires no further installation\nsteps.\n\nIn comparison, installation of OpenSSL on Microsoft Windows operating\nsystems is inconvenient. For this reason, source distributions of PyDTLS\nare available that include OpenSSL dll's for 32-bit and 64-bit Windows.\nAll dll's have been linked with the Visual Studio 2008 version of the\nMicrosoft C runtime library, msvcr90.dll, the version used by CPython\n2.7. Installation of Microsoft redistributable runtime packages should\ntherefore not be required on machines with CPython 2.7. The version of\nOpenSSL distributed with PyDTLS 0.1.0 is 1.0.1c. The version distributed\nwith PyDTLS 1.2.0 is commit 248cf959672041f38f4d80a4a09ee01d8ab04fe8\n(branch OpenSSL\\_1\\_0\\_2-stable, 1.0.2l-dev, containing a desirable fix\nto DTLSv1\\_listen not present in 1.0.2k, the stable version at the time\nof PyDTLS 1.2.0 release).\n\nThe OpenSSL version used by PyDTLS can be determined from the values of\n*sslconnection's* DTLS\\_OPENSSL\\_VERSION\\_NUMBER,\nDTLS\\_OPENSSL\\_VERSION, and DTLS\\_OPENSSL\\_VERSION\\_INFO. These\nvariables are available through the *ssl* module also if *do\\_patch* has\nbeen called (see below). Note that the OpenSSL version used by PyDTLS\nmay differ from the one used by the *ssl* module.\n\nInterfaces\n----------\n\nPyDTLS' top-level package, *dtls*, provides DTLS support through the\n**SSLConnection** class of its *sslconnection* module. **SSLConnection**\nis in-line documented, and dtls/test/echo\\_seq.py demonstrates how to\ntake a simple echo server through a listen/accept/echo/shutdown sequence\nusing this class. The corresponding client side can look like the\nsnippet at the top of this document, followed by a call to the *unwrap*\nmethod for shutdown (or a call to the **SSLConnection** *shutdown*\nmethod, if an instance of this class is used for the client side also).\nNote that the *dtls* package does not depend on the standard library's\n*ssl* module, and **SSLConnection** can therefore be used in\nenvironments where *ssl* is unavailable or incompatible.\n\nIt is expected that with the *ssl* module being an established, familiar\ninterface to TLS, it will be the preferred module through which to\naccess DTLS. To do so, one must call the *dtls* package's *do\\_patch*\nfunction before passing sockets of type SOCK\\_DGRAM to either *ssl's*\n*wrap\\_socket* function, or *ssl's* **SSLSocket** constructor.\n\nIt should be noted that once *do\\_patch* is called, *dtls* will raise\nexceptions of type **ssl.SSLError** instead of its default\n**dtls.err.SSLError**. This allows users' error handling code paths to\nremain identical when interfacing with *ssl* across stream and datagram\nsockets.\n\nConnection Handling\n-------------------\n\nThe DTLS protocol implies a connection as an association between two\nnetwork peers where the overall association state is characterized by\nthe handshake status of each peer endpoint (see RFC 6347). The OpenSSL\nlibrary records this handshake status in \"SSL\" type instances (a.k.a.\nstruct ssl\\_st). Datagrams can be securely sent and received by\nreferring to a unique \"SSL\" instance after handshaking has been\ncompleted with this instance and its network peer. A connection is\nimplied in that traffic may be directed to or received from only that\nnetwork peer with whose \"SSL\" instance the handshake has been completed.\nThe fact that the underlying network protocol, UDP in most cases, is\nitself connectionless is immaterial.\n\nFurther, in order to prevent denial-of-service attacks on UDP DTLS\nservers, clients must undergo a cookie exchange phase early in the\nhandshaking protocol, and before server-side resources are committed to\na particular client (see section 4.2.1 of RFC 6347). The cookie exchange\nproves to the server that a client can indeed receive IP traffic at the\nsource IP address with which its handshake-initiating ClientHello\ndatagram is marked.\n\nPyDTLS implements this connection establishment through the *connect*\nmethod on the client side, and the *accept* method on the server side.\nThe latter returns a new **dtls.SSLConnection** or **ssl.SSLSocket**\nobject (depending on which interface is used, see above), which is\n\"connected\" to its peer. In addition to the *read* and *write* methods\n(at both interface levels), **SSLSocket's** *send* and *recv* methods\ncan be used; use of *sendto* and *recvfrom* on connected sockets is\nprohibited by *ssl*. *accept* returns peer address information, as\nexpected. Note that when using the *ssl* interface to *dtls*, *listen*\nmust be called before calling *accept*.\n\nDemultiplexing\n--------------\n\nAt the network io layer, only datagrams from its connected peer must be\npassed to a **SSLConnection** or **SSLSocket** object (unless the object\nis unconnected on the server-side, in which case it can be in listening\nmode, the initial server-side socket whose role it is to listen for\nincoming client connection requests).\n\nThe initial server-side listening socket is not useful for performing\nthis datagram routing function. This is because it must remain\nunconnected and ready to receive additional connection requests from\nnew, unknown clients.\n\nThe function of passing incoming datagrams to the proper connection is\nperformed by the *dtls.demux* package. **SSLConnection** requests a new\nconnection from the demux when a handshake has cleared the cookie\nexchange phase. An efficient implementation of this request is provided\nby the *osnet* module of the demux package: it creates a new socket that\nis bound to the same network interface and port as the listening socket,\nbut connected to the peer. UDP stacks such as the one included with\nLinux route incoming datagrams to such a connected socket in preference\nto an unconnected socket bound to the same port.\n\nUnfortunately such is not the behavior on Microsoft Windows. Windows UDP\nroutes datagrams to whichever currently existing socket bound to the\nparticular port the earliest (and whether or not that socket is\nunconnected, or connected to the datagram's peer, or a different peer).\nOther sockets bound to the same port will not receive traffic, if and\nuntil they become the earliest bound socket because another socket is\nclosed.\n\nThe demux package therefore provides and automatically selects the\nmodule *router* on Windows platforms. This module also creates a new\nsocket when receiving a new connection request; but instead of binding\nthis socket to the same port as the listening socket, it binds to a new\nephemeral port. *router* then forwards datagrams originating from the\npeer for which a connection was requested to the corresponding socket.\n\nFor efficiency's sake, no forwarding is performed on outgoing traffic.\nInstead, **SSLConnection** directs outgoing traffic from the original\nlistening socket, using *sendto*. At the OpenSSL level this requires\nseparate read and write datagram BIO's for an \"SSL\" instance, one in\n\"connected\" state and one in \"peer set\" state, respectively, and\nassociated with two separate network sockets.\n\n>From the perspective of a PyDTLS user, this selection of and difference\nbetween demux implementations should be transparent, with the possible\nexception of performance deviation. This transparency does however have\nsome limits: for example, when *router* is in use, the *accept* methods\ncan return *None*. This happens when **SSLConnection** detects that the\ndemux has forwarded a datagram to a known connection instead of\ninitiating a connection to a new peer through *accept*. Returning *None*\nin this case is important whenever non-blocking sockets or sockets with\ntimeouts are used, since another socket might now be readable as a\nresult of the forwarded datagram. *accept* must return so that the\napplication can iterate on its asynchronous *select* loop.\n\nShutdown and Unwrapping\n-----------------------\n\nPyDTLS implements the SSL/TLS shutdown protocol as it has been adapted\nfor DTLS. **SSLConnection's** *shutdown* and **SSLSocket's** *unwrap*\ninvoke this protocol. As is the case with DTLS handshaking in general,\napplications must be prepared to use the *get\\_timeout* and\n*handle\\_timeout* methods in addition to re-invoking *shutdown* or\n*unwrap* when sockets become readable and an exception carried\nSSL\\_ERROR\\_WANT\\_READ. (See more on asynchronous IO in the Testing\nsection.)\n\n**SSLConnection's** *shutdown* and **SSLSocket's** *unwrap* return a\n(possibly new) socket that can be used for unsecured communication with\nthe peer, as set forth by the *ssl* module. The demux infrastructure\nremains in use for this communication until the returned socket is\ncleaned up. Note that when the *router* demux is in use, the object\nreturned will be one derived from *socket.socket*. This is because the\nsend and recv paths must still be directed to two different OS sockets.\nIn addition, the right thing happens if secured communication is resumed\nover such a socket by passing it to *ssl.wrap\\_socket* or the\n**SSLConnection** constructor. If *osnet* is used, an actual\n*socket.socket* instance is returned.\n\nFramework Compatibility\n-----------------------\n\nPyDTLS sockets have been tested under the following usage modes:\n\n-  Using blocking sockets and sockets with timeouts in multi-threaded\n   UDP servers\n-  Using non-blocking sockets, and in conjunction with the asynchronous\n   socket handler, asyncore\n-  Using blocking sockets, and in conjunction with the network server\n   framework SocketServer - ThreadingTCPServer (this works because of\n   PyDTLS's emulation of connection-related calls)\n\nMulti-thread Support\n--------------------\n\nUsing multiple threads with OpenSSL requires implementing a locking\ncallback. PyDTLS does implement this, and therefore multi-threaded\nprogramming with PyDTLS is safe in any environment. However, being a\npure Python library, these callbacks do carry some overhead. The *ssl*\nmodule implements an equivalent locking callback in its C extension\nmodule. Not requiring interpreter re-entry, this approach can be\nexpected to perform better. PyDTLS therefore queries OpenSSL as to\nwhether a locking callback is already in place, and does not overwrite\nit if there is. Loading *ssl* can therefore improve performance, even\nwhen only the *sslconnection* interface is used.\n\nNote that loading order does not matter: to obtain the performance\nbenefit, *ssl* can be loaded before or after the dtls package. This is\nbecause *ssl* does not do an equivalent existing locking callback check,\nand will simply overwrite the PyDTLS callback if it has already been\ninstalled. But *ssl* should not be loaded while *dtls* operation is\nalready in progress, when some locks may be in their acquired state.\n\nAlso note that this performance enhancement is available only on\nplatforms where PyDTLS loads the same OpenSSL shared object as *ssl*. On\nUbuntu 12.04, for example, this is the case, but on Microsoft Windows it\nis not.\n\nTesting\n-------\n\nA simple echo server is available to be executed from the project root\ndirectory with ``python -m dtls.test.echo_seq``. The echo server is\nreachable using the code snippet at the top of this document, using port\n28000 at \"localhost\".\n\nUnit test suites can be executed from the project root directory with\n``python -m dtls.test.unit [-v]`` and\n``python -m dtls.test.unit_wrapper`` (for the client and server\nwrappers)\n\nAlmost all of the Python standard library's *ssl* unit tests from the\nmodule *test\\_ssl.py* have been ported to *dtls.test.unit.py*. All tests\nhave been adjusted to operate with datagram sockets. On Linux, each test\nis executed four times, varying the address family among IPv4 and IPv6\nand the demux among *osnet* and *router*. On Windows, where *osnet* is\nunavailable, each test is run twice, once with IPv4 and once with IPv6.\n\nThe unit test suite includes tests for each of the above-mentioned\ncompatible frameworks. The class **AsyncoreEchoServer** serves as an\nexample of how to use non-blocking datagram sockets and implement the\nresulting timeout detection requirements. DTLS in general and OpenSSL in\nparticular require being called back when used with non-blocking sockets\n(or sockets with timeout option) after DTLS timeouts expire to handle\npacket loss using re-transmission during a handshake. Handshaking may\noccur during any read or write operation, even after an initial\nhandshake completes successfully, in case renegotiation is requested by\na peer.\n\nRunning with the -v switch executes all unit tests in verbose mode.\n\ndtls/test/test\\_perf.py implements an interactive performance test suite\nthat compares the raw throughput of TCP, UDP, SSL, and DTLS. It can be\nexecuted locally through the loopback interface, or between remote\nclients and servers. In the latter case, test jobs are sent to remote\nconnected clients whenever a suite run is initiated through the\ninteractive interface. Run test\\_perf.py -h for more information.\n\nIt should be noted that comparing the performance of protocols that\ndon't offer congestion control (UDP and DTLS) with those that do (TCP\nand SSL) is a difficult undertaking. Raw throughput even across gigabit\nnetwork links can be expected to suffer without congestion control and\npeers that generate data as fast as possible without throttling (as this\ntest does): the link's throughput will drop significantly as it enters\ncongestion collapse. Similarly, loopback is an imperfect test interface\nsince it rarely drops packets, and never duplicates or reorders them\n(thus negating the relative performance benefits of DTLS over SSL).\nNevertheless, some useful insights can be gained by observing the\noperation of test\\_perf.py, including software stack behavior in the\npresence of some amount of packet loss.\n\nLogging\n-------\n\nThe *dtls* package and its sub-packages log various occurrences,\nprimarily events that can aid debugging. Especially *router* emits many\nmessages when the logging level is set to at least *logging.DEBUG*.\ndtls/test/echo\\_seq.py activates this logging level during its\noperation.\n\nCurrently Supported Platforms\n-----------------------------\n\nAt the time of initial release, PyDTLS 0.1.0 has been tested on Ubuntu\n12.04.1 LTS 32-bit and 64-bit, as well as Microsoft Windows 7 32-bit and\n64-bit, using CPython 2.7.3. Patches with additional platform ports are\nwelcome.\n\nAs of release 1.2.0, PyDTLS is tested on Ubuntu 16.04 LTS as well as\nMicrosoft Windows 10, using CPython 2.7.13.", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/rbit/pydtls", "keywords": "", "license": "Apache-2.0", "maintainer": "", "maintainer_email": "", "name": "Dtls", "package_url": "https://pypi.org/project/Dtls/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/Dtls/", "project_urls": {"Homepage": "https://github.com/rbit/pydtls"}, "release_url": "https://pypi.org/project/Dtls/1.2.3/", "requires_dist": null, "requires_python": "", "summary": "Python Datagram Transport Layer Security", "version": "1.2.3", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>PyDTLS brings Datagram Transport Layer Security (DTLS - RFC 6347:\n<a href=\"http://tools.ietf.org/html/rfc6347\" rel=\"nofollow\">http://tools.ietf.org/html/rfc6347</a>) to the Python environment. In a\nnutshell, DTLS brings security (encryption, server authentication, user\nauthentication, and message authentication) to UDP datagram payloads in\na manner equivalent to what SSL/TLS does for TCP stream content.</p>\n<p>DTLS is now very easy to use in Python. If you’re familiar with the ssl\nmodule in Python’s standard library, you already know how. All it takes\nis passing a datagram/UDP socket to the <em>wrap_socket</em> function instead\nof a stream/TCP socket. Here’s how one sets up the client side of a\nconnection:</p>\n<pre>import ssl\nfrom socket import socket, AF_INET, SOCK_DGRAM\nfrom dtls import do_patch\ndo_patch()\nsock = ssl.wrap_socket(socket(AF_INET, SOCK_DGRAM))\nsock.connect(('foo.bar.com', 1234))\nsock.send('Hi there')\n</pre>\n<p>As of version 1.2.0, PyDTLS supports DTLS version 1.2 in addition to\nversion 1.0. This version also introduces forward secrecy using elliptic\ncurve cryptography and more fine-grained configuration options.</p>\n<div id=\"installation\">\n<h2>Installation</h2>\n<p>To install from PyPI, on any supported platform enter:</p>\n<pre>pip install Dtls\n</pre>\n</div>\n<div id=\"design-goals\">\n<h2>Design Goals</h2>\n<p>The primary design goal of PyDTLS is broad availability. It has\ntherefore been built to be widely compatible with the following:</p>\n<ul>\n<li>Operating systems: apart from the Python standard library, PyDTLS\nrelies on the OpenSSL library only. OpenSSL is widely ported, and in\nfact the Python standard library’s <em>ssl</em> module also uses it.</li>\n<li>Python runtime environments: PyDTLS is a package consisting of pure\nPython modules only. It should therefore be portable to many\ninterpreters and runtime environments. It interfaces with OpenSSL\nstrictly through the standard library’s <em>ctypes</em> foreign function\nlibrary.</li>\n<li>The Python standard library: the standard library’s <em>ssl</em> module is\nPython’s de facto interface to SSL/TLS. PyDTLS aims to be compatible\nwith the full public interface presented by this module. The ssl\nmodule ought to behave identically with respect to all of its\nfunctions and options when used in conjunction with PyDTLS and\ndatagram sockets as when used without PyDTLS and stream sockets.</li>\n<li>Connection-based protocols: as outlined below, layering security on\ntop of datagram sockets requires introducing certain connection\nconstructs normally absent from datagram sockets. These constructs\nhave been added in such a way as to be compatible with code that\nexpects to interoperate with connection-oriented stream sockets. For\nexample, code that expects to go through server-side\nbind/listen/accept connection establishment should be reusable with\nPyDTLS sockets.</li>\n</ul>\n</div>\n<div id=\"distributions\">\n<h2>Distributions</h2>\n<p>PyDTLS requires version 1.0.0 or higher of the OpenSSL library. Earlier\nversions are reported not to offer stable DTLS support. Since packaged\ndistributions of this version of OpenSSL are available for many popular\noperating systems, OpenSSL-1.0.0 is an installation requirement before\nPyDTLS functionality can be called. On Ubuntu 12.04 LTS, for example,\nthe Python interpreter links with libcrypto.so.1.0.0 and\nlibssl.so.1.0.0, and so use of PyDTLS requires no further installation\nsteps.</p>\n<p>In comparison, installation of OpenSSL on Microsoft Windows operating\nsystems is inconvenient. For this reason, source distributions of PyDTLS\nare available that include OpenSSL dll’s for 32-bit and 64-bit Windows.\nAll dll’s have been linked with the Visual Studio 2008 version of the\nMicrosoft C runtime library, msvcr90.dll, the version used by CPython\n2.7. Installation of Microsoft redistributable runtime packages should\ntherefore not be required on machines with CPython 2.7. The version of\nOpenSSL distributed with PyDTLS 0.1.0 is 1.0.1c. The version distributed\nwith PyDTLS 1.2.0 is commit 248cf959672041f38f4d80a4a09ee01d8ab04fe8\n(branch OpenSSL_1_0_2-stable, 1.0.2l-dev, containing a desirable fix\nto DTLSv1_listen not present in 1.0.2k, the stable version at the time\nof PyDTLS 1.2.0 release).</p>\n<p>The OpenSSL version used by PyDTLS can be determined from the values of\n<em>sslconnection’s</em> DTLS_OPENSSL_VERSION_NUMBER,\nDTLS_OPENSSL_VERSION, and DTLS_OPENSSL_VERSION_INFO. These\nvariables are available through the <em>ssl</em> module also if <em>do_patch</em> has\nbeen called (see below). Note that the OpenSSL version used by PyDTLS\nmay differ from the one used by the <em>ssl</em> module.</p>\n</div>\n<div id=\"interfaces\">\n<h2>Interfaces</h2>\n<p>PyDTLS’ top-level package, <em>dtls</em>, provides DTLS support through the\n<strong>SSLConnection</strong> class of its <em>sslconnection</em> module. <strong>SSLConnection</strong>\nis in-line documented, and dtls/test/echo_seq.py demonstrates how to\ntake a simple echo server through a listen/accept/echo/shutdown sequence\nusing this class. The corresponding client side can look like the\nsnippet at the top of this document, followed by a call to the <em>unwrap</em>\nmethod for shutdown (or a call to the <strong>SSLConnection</strong> <em>shutdown</em>\nmethod, if an instance of this class is used for the client side also).\nNote that the <em>dtls</em> package does not depend on the standard library’s\n<em>ssl</em> module, and <strong>SSLConnection</strong> can therefore be used in\nenvironments where <em>ssl</em> is unavailable or incompatible.</p>\n<p>It is expected that with the <em>ssl</em> module being an established, familiar\ninterface to TLS, it will be the preferred module through which to\naccess DTLS. To do so, one must call the <em>dtls</em> package’s <em>do_patch</em>\nfunction before passing sockets of type SOCK_DGRAM to either <em>ssl’s</em>\n<em>wrap_socket</em> function, or <em>ssl’s</em> <strong>SSLSocket</strong> constructor.</p>\n<p>It should be noted that once <em>do_patch</em> is called, <em>dtls</em> will raise\nexceptions of type <strong>ssl.SSLError</strong> instead of its default\n<strong>dtls.err.SSLError</strong>. This allows users’ error handling code paths to\nremain identical when interfacing with <em>ssl</em> across stream and datagram\nsockets.</p>\n</div>\n<div id=\"connection-handling\">\n<h2>Connection Handling</h2>\n<p>The DTLS protocol implies a connection as an association between two\nnetwork peers where the overall association state is characterized by\nthe handshake status of each peer endpoint (see RFC 6347). The OpenSSL\nlibrary records this handshake status in “SSL” type instances (a.k.a.\nstruct ssl_st). Datagrams can be securely sent and received by\nreferring to a unique “SSL” instance after handshaking has been\ncompleted with this instance and its network peer. A connection is\nimplied in that traffic may be directed to or received from only that\nnetwork peer with whose “SSL” instance the handshake has been completed.\nThe fact that the underlying network protocol, UDP in most cases, is\nitself connectionless is immaterial.</p>\n<p>Further, in order to prevent denial-of-service attacks on UDP DTLS\nservers, clients must undergo a cookie exchange phase early in the\nhandshaking protocol, and before server-side resources are committed to\na particular client (see section 4.2.1 of RFC 6347). The cookie exchange\nproves to the server that a client can indeed receive IP traffic at the\nsource IP address with which its handshake-initiating ClientHello\ndatagram is marked.</p>\n<p>PyDTLS implements this connection establishment through the <em>connect</em>\nmethod on the client side, and the <em>accept</em> method on the server side.\nThe latter returns a new <strong>dtls.SSLConnection</strong> or <strong>ssl.SSLSocket</strong>\nobject (depending on which interface is used, see above), which is\n“connected” to its peer. In addition to the <em>read</em> and <em>write</em> methods\n(at both interface levels), <strong>SSLSocket’s</strong> <em>send</em> and <em>recv</em> methods\ncan be used; use of <em>sendto</em> and <em>recvfrom</em> on connected sockets is\nprohibited by <em>ssl</em>. <em>accept</em> returns peer address information, as\nexpected. Note that when using the <em>ssl</em> interface to <em>dtls</em>, <em>listen</em>\nmust be called before calling <em>accept</em>.</p>\n</div>\n<div id=\"demultiplexing\">\n<h2>Demultiplexing</h2>\n<p>At the network io layer, only datagrams from its connected peer must be\npassed to a <strong>SSLConnection</strong> or <strong>SSLSocket</strong> object (unless the object\nis unconnected on the server-side, in which case it can be in listening\nmode, the initial server-side socket whose role it is to listen for\nincoming client connection requests).</p>\n<p>The initial server-side listening socket is not useful for performing\nthis datagram routing function. This is because it must remain\nunconnected and ready to receive additional connection requests from\nnew, unknown clients.</p>\n<p>The function of passing incoming datagrams to the proper connection is\nperformed by the <em>dtls.demux</em> package. <strong>SSLConnection</strong> requests a new\nconnection from the demux when a handshake has cleared the cookie\nexchange phase. An efficient implementation of this request is provided\nby the <em>osnet</em> module of the demux package: it creates a new socket that\nis bound to the same network interface and port as the listening socket,\nbut connected to the peer. UDP stacks such as the one included with\nLinux route incoming datagrams to such a connected socket in preference\nto an unconnected socket bound to the same port.</p>\n<p>Unfortunately such is not the behavior on Microsoft Windows. Windows UDP\nroutes datagrams to whichever currently existing socket bound to the\nparticular port the earliest (and whether or not that socket is\nunconnected, or connected to the datagram’s peer, or a different peer).\nOther sockets bound to the same port will not receive traffic, if and\nuntil they become the earliest bound socket because another socket is\nclosed.</p>\n<p>The demux package therefore provides and automatically selects the\nmodule <em>router</em> on Windows platforms. This module also creates a new\nsocket when receiving a new connection request; but instead of binding\nthis socket to the same port as the listening socket, it binds to a new\nephemeral port. <em>router</em> then forwards datagrams originating from the\npeer for which a connection was requested to the corresponding socket.</p>\n<p>For efficiency’s sake, no forwarding is performed on outgoing traffic.\nInstead, <strong>SSLConnection</strong> directs outgoing traffic from the original\nlistening socket, using <em>sendto</em>. At the OpenSSL level this requires\nseparate read and write datagram BIO’s for an “SSL” instance, one in\n“connected” state and one in “peer set” state, respectively, and\nassociated with two separate network sockets.</p>\n<p>&gt;From the perspective of a PyDTLS user, this selection of and difference\nbetween demux implementations should be transparent, with the possible\nexception of performance deviation. This transparency does however have\nsome limits: for example, when <em>router</em> is in use, the <em>accept</em> methods\ncan return <em>None</em>. This happens when <strong>SSLConnection</strong> detects that the\ndemux has forwarded a datagram to a known connection instead of\ninitiating a connection to a new peer through <em>accept</em>. Returning <em>None</em>\nin this case is important whenever non-blocking sockets or sockets with\ntimeouts are used, since another socket might now be readable as a\nresult of the forwarded datagram. <em>accept</em> must return so that the\napplication can iterate on its asynchronous <em>select</em> loop.</p>\n</div>\n<div id=\"shutdown-and-unwrapping\">\n<h2>Shutdown and Unwrapping</h2>\n<p>PyDTLS implements the SSL/TLS shutdown protocol as it has been adapted\nfor DTLS. <strong>SSLConnection’s</strong> <em>shutdown</em> and <strong>SSLSocket’s</strong> <em>unwrap</em>\ninvoke this protocol. As is the case with DTLS handshaking in general,\napplications must be prepared to use the <em>get_timeout</em> and\n<em>handle_timeout</em> methods in addition to re-invoking <em>shutdown</em> or\n<em>unwrap</em> when sockets become readable and an exception carried\nSSL_ERROR_WANT_READ. (See more on asynchronous IO in the Testing\nsection.)</p>\n<p><strong>SSLConnection’s</strong> <em>shutdown</em> and <strong>SSLSocket’s</strong> <em>unwrap</em> return a\n(possibly new) socket that can be used for unsecured communication with\nthe peer, as set forth by the <em>ssl</em> module. The demux infrastructure\nremains in use for this communication until the returned socket is\ncleaned up. Note that when the <em>router</em> demux is in use, the object\nreturned will be one derived from <em>socket.socket</em>. This is because the\nsend and recv paths must still be directed to two different OS sockets.\nIn addition, the right thing happens if secured communication is resumed\nover such a socket by passing it to <em>ssl.wrap_socket</em> or the\n<strong>SSLConnection</strong> constructor. If <em>osnet</em> is used, an actual\n<em>socket.socket</em> instance is returned.</p>\n</div>\n<div id=\"framework-compatibility\">\n<h2>Framework Compatibility</h2>\n<p>PyDTLS sockets have been tested under the following usage modes:</p>\n<ul>\n<li>Using blocking sockets and sockets with timeouts in multi-threaded\nUDP servers</li>\n<li>Using non-blocking sockets, and in conjunction with the asynchronous\nsocket handler, asyncore</li>\n<li>Using blocking sockets, and in conjunction with the network server\nframework SocketServer - ThreadingTCPServer (this works because of\nPyDTLS’s emulation of connection-related calls)</li>\n</ul>\n</div>\n<div id=\"multi-thread-support\">\n<h2>Multi-thread Support</h2>\n<p>Using multiple threads with OpenSSL requires implementing a locking\ncallback. PyDTLS does implement this, and therefore multi-threaded\nprogramming with PyDTLS is safe in any environment. However, being a\npure Python library, these callbacks do carry some overhead. The <em>ssl</em>\nmodule implements an equivalent locking callback in its C extension\nmodule. Not requiring interpreter re-entry, this approach can be\nexpected to perform better. PyDTLS therefore queries OpenSSL as to\nwhether a locking callback is already in place, and does not overwrite\nit if there is. Loading <em>ssl</em> can therefore improve performance, even\nwhen only the <em>sslconnection</em> interface is used.</p>\n<p>Note that loading order does not matter: to obtain the performance\nbenefit, <em>ssl</em> can be loaded before or after the dtls package. This is\nbecause <em>ssl</em> does not do an equivalent existing locking callback check,\nand will simply overwrite the PyDTLS callback if it has already been\ninstalled. But <em>ssl</em> should not be loaded while <em>dtls</em> operation is\nalready in progress, when some locks may be in their acquired state.</p>\n<p>Also note that this performance enhancement is available only on\nplatforms where PyDTLS loads the same OpenSSL shared object as <em>ssl</em>. On\nUbuntu 12.04, for example, this is the case, but on Microsoft Windows it\nis not.</p>\n</div>\n<div id=\"testing\">\n<h2>Testing</h2>\n<p>A simple echo server is available to be executed from the project root\ndirectory with <tt>python <span class=\"pre\">-m</span> dtls.test.echo_seq</tt>. The echo server is\nreachable using the code snippet at the top of this document, using port\n28000 at “localhost”.</p>\n<p>Unit test suites can be executed from the project root directory with\n<tt>python <span class=\"pre\">-m</span> dtls.test.unit <span class=\"pre\">[-v]</span></tt> and\n<tt>python <span class=\"pre\">-m</span> dtls.test.unit_wrapper</tt> (for the client and server\nwrappers)</p>\n<p>Almost all of the Python standard library’s <em>ssl</em> unit tests from the\nmodule <em>test_ssl.py</em> have been ported to <em>dtls.test.unit.py</em>. All tests\nhave been adjusted to operate with datagram sockets. On Linux, each test\nis executed four times, varying the address family among IPv4 and IPv6\nand the demux among <em>osnet</em> and <em>router</em>. On Windows, where <em>osnet</em> is\nunavailable, each test is run twice, once with IPv4 and once with IPv6.</p>\n<p>The unit test suite includes tests for each of the above-mentioned\ncompatible frameworks. The class <strong>AsyncoreEchoServer</strong> serves as an\nexample of how to use non-blocking datagram sockets and implement the\nresulting timeout detection requirements. DTLS in general and OpenSSL in\nparticular require being called back when used with non-blocking sockets\n(or sockets with timeout option) after DTLS timeouts expire to handle\npacket loss using re-transmission during a handshake. Handshaking may\noccur during any read or write operation, even after an initial\nhandshake completes successfully, in case renegotiation is requested by\na peer.</p>\n<p>Running with the -v switch executes all unit tests in verbose mode.</p>\n<p>dtls/test/test_perf.py implements an interactive performance test suite\nthat compares the raw throughput of TCP, UDP, SSL, and DTLS. It can be\nexecuted locally through the loopback interface, or between remote\nclients and servers. In the latter case, test jobs are sent to remote\nconnected clients whenever a suite run is initiated through the\ninteractive interface. Run test_perf.py -h for more information.</p>\n<p>It should be noted that comparing the performance of protocols that\ndon’t offer congestion control (UDP and DTLS) with those that do (TCP\nand SSL) is a difficult undertaking. Raw throughput even across gigabit\nnetwork links can be expected to suffer without congestion control and\npeers that generate data as fast as possible without throttling (as this\ntest does): the link’s throughput will drop significantly as it enters\ncongestion collapse. Similarly, loopback is an imperfect test interface\nsince it rarely drops packets, and never duplicates or reorders them\n(thus negating the relative performance benefits of DTLS over SSL).\nNevertheless, some useful insights can be gained by observing the\noperation of test_perf.py, including software stack behavior in the\npresence of some amount of packet loss.</p>\n</div>\n<div id=\"logging\">\n<h2>Logging</h2>\n<p>The <em>dtls</em> package and its sub-packages log various occurrences,\nprimarily events that can aid debugging. Especially <em>router</em> emits many\nmessages when the logging level is set to at least <em>logging.DEBUG</em>.\ndtls/test/echo_seq.py activates this logging level during its\noperation.</p>\n</div>\n<div id=\"currently-supported-platforms\">\n<h2>Currently Supported Platforms</h2>\n<p>At the time of initial release, PyDTLS 0.1.0 has been tested on Ubuntu\n12.04.1 LTS 32-bit and 64-bit, as well as Microsoft Windows 7 32-bit and\n64-bit, using CPython 2.7.3. Patches with additional platform ports are\nwelcome.</p>\n<p>As of release 1.2.0, PyDTLS is tested on Ubuntu 16.04 LTS as well as\nMicrosoft Windows 10, using CPython 2.7.13.</p>\n</div>\n\n          </div>"}, "last_serial": 2835569, "releases": {"0.1.0": [{"comment_text": "Includes MinGW OpenSSL dll's for 32-bit Windows", "digests": {"md5": "828841f8505defd0921a325f3dd0ad25", "sha256": "d8e40681e03d1d082ee26a78bc4eaa692d3083b56606d1dd873a986350181bf6"}, "downloads": -1, "filename": "Dtls-0.1.0.sdist_with_openssl.mingw-win32.tar.gz", "has_sig": false, "md5_digest": "828841f8505defd0921a325f3dd0ad25", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3292805, "upload_time": "2012-12-31T19:11:39", "upload_time_iso_8601": "2012-12-31T19:11:39.488483Z", "url": "https://files.pythonhosted.org/packages/bc/1d/b43e396cdadbc5d47166f86bdb6e4b32d17218eeba44d5e7c1ef7ece40a4/Dtls-0.1.0.sdist_with_openssl.mingw-win32.tar.gz", "yanked": false}, {"comment_text": "Includes OpenSSL dll's for 32-bit Windows", "digests": {"md5": "03d3ce4f2d2d570eff8ea8ebd7555300", "sha256": "888c0dcb62cec72ff12e1f55acbb7b16f3c26d4cc9fbc3e7a2f4e7048d112b3f"}, "downloads": -1, "filename": "Dtls-0.1.0.sdist_with_openssl.win32.zip", "has_sig": false, "md5_digest": "03d3ce4f2d2d570eff8ea8ebd7555300", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 767878, "upload_time": "2012-12-31T19:10:07", "upload_time_iso_8601": "2012-12-31T19:10:07.482574Z", "url": "https://files.pythonhosted.org/packages/58/ee/1a04b3618d65b12336df82e882d8c328f549dca4b4a56cac6f8c27ddb77a/Dtls-0.1.0.sdist_with_openssl.win32.zip", "yanked": false}, {"comment_text": "Includes OpenSSL dll's for 64-bit Windows", "digests": {"md5": "7a0c0deed2a7f5ec8bf0c68a7a8ae0ab", "sha256": "37e4d8789aacf7cbdf0d16b285287c06fdabcd4dac5665906669973d6010003f"}, "downloads": -1, "filename": "Dtls-0.1.0.sdist_with_openssl.win-amd64.zip", "has_sig": false, "md5_digest": "7a0c0deed2a7f5ec8bf0c68a7a8ae0ab", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 907558, "upload_time": "2012-12-31T19:10:41", "upload_time_iso_8601": "2012-12-31T19:10:41.676211Z", "url": "https://files.pythonhosted.org/packages/f6/85/69e9bdf5b530aa8bac63a2f206a23e4579e305eb0c28d4ac2a5f46a6329c/Dtls-0.1.0.sdist_with_openssl.win-amd64.zip", "yanked": false}, {"comment_text": "", "digests": {"md5": "e35ba7609ff0163072d627ec4c713dce", "sha256": "c9428e7a36c778824d2929fa826008d776b242e72ad5775eb37c1b104e16fc06"}, "downloads": -1, "filename": "Dtls-0.1.0.tar.gz", "has_sig": false, "md5_digest": "e35ba7609ff0163072d627ec4c713dce", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 60788, "upload_time": "2012-12-31T18:52:19", "upload_time_iso_8601": "2012-12-31T18:52:19.190460Z", "url": "https://files.pythonhosted.org/packages/94/b3/55e3e976495f5aa68ea5025fa42d28a6931e44ef3865c84c767702f34e41/Dtls-0.1.0.tar.gz", "yanked": false}, {"comment_text": "", "digests": {"md5": "99b97efeff1fbec8170c43475365f8a3", "sha256": "00075c147a2bdf35bcefd6c07880b84203d2d1c6d6b2a73e97480fc13489c900"}, "downloads": -1, "filename": "Dtls-0.1.0.zip", "has_sig": false, "md5_digest": "99b97efeff1fbec8170c43475365f8a3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 74887, "upload_time": "2012-12-31T19:01:46", "upload_time_iso_8601": "2012-12-31T19:01:46.135020Z", "url": "https://files.pythonhosted.org/packages/b3/e1/828667fbd8607d45b5b19cab97cc87af5333bb6bc1bcb43dca4644fc6dd0/Dtls-0.1.0.zip", "yanked": false}], "1.0.1": [{"comment_text": "Includes MinGW OpenSSL dll's for 32-bit Windows", "digests": {"md5": "7f6f04d8330f93e38d8f26acb9ee3b07", "sha256": "e1defc1232cf5672adb7d2ebe5e1f5db4b7b466d2349d45a889fc04c324f05a3"}, "downloads": -1, "filename": "Dtls-1.0.1.sdist_with_openssl.mingw-win32.tar.gz", "has_sig": false, "md5_digest": "7f6f04d8330f93e38d8f26acb9ee3b07", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3288669, "upload_time": "2014-01-19T05:12:07", "upload_time_iso_8601": "2014-01-19T05:12:07.767331Z", "url": "https://files.pythonhosted.org/packages/56/e0/a5bb68e8a04f5246147b8c906ee25041f3d3e70f86d8a3937f307a604cee/Dtls-1.0.1.sdist_with_openssl.mingw-win32.tar.gz", "yanked": false}, {"comment_text": "Includes OpenSSL dll's for 32-bit Windows", "digests": {"md5": "ac4fe7c17cf5d2c0ba0657bae271d383", "sha256": "c9383ece65bf715b5f90e2673e407308048a01dcf3260803edf057fc7180a048"}, "downloads": -1, "filename": "Dtls-1.0.1.sdist_with_openssl.win32.zip", "has_sig": false, "md5_digest": "ac4fe7c17cf5d2c0ba0657bae271d383", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 769371, "upload_time": "2014-01-19T05:14:14", "upload_time_iso_8601": "2014-01-19T05:14:14.354055Z", "url": "https://files.pythonhosted.org/packages/89/b6/1a51aa06526212050e72e437c57af107125b21bb1153767f3ac481b950a0/Dtls-1.0.1.sdist_with_openssl.win32.zip", "yanked": false}, {"comment_text": "Includes OpenSSL dll's for 64-bit Windows", "digests": {"md5": "e73406bec8129ff3434c1748b62455f5", "sha256": "c074e8f5355036178f113d9cfa09891d90ddb65076c651b7e96805c842afa229"}, "downloads": -1, "filename": "Dtls-1.0.1.sdist_with_openssl.win-amd64.zip", "has_sig": false, "md5_digest": "e73406bec8129ff3434c1748b62455f5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 909051, "upload_time": "2014-01-19T05:12:58", "upload_time_iso_8601": "2014-01-19T05:12:58.003781Z", "url": "https://files.pythonhosted.org/packages/21/43/14a54deb4339eeb4f85a93df5f288a06978c1dea231b96c092ab31862fa9/Dtls-1.0.1.sdist_with_openssl.win-amd64.zip", "yanked": false}, {"comment_text": "", "digests": {"md5": "90836167421e9ff761afbebceb4fb539", "sha256": "7d22ab871716fecfce6f09e2777a79b9c7ac4dbafc95a2d65b25b210cd99163b"}, "downloads": -1, "filename": "Dtls-1.0.1.tar.gz", "has_sig": false, "md5_digest": "90836167421e9ff761afbebceb4fb539", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 61634, "upload_time": "2014-01-19T05:05:22", "upload_time_iso_8601": "2014-01-19T05:05:22.161712Z", "url": "https://files.pythonhosted.org/packages/f2/b0/44317b34dd4b0261acd2d49f62d981183697065c36335daf07b01ff4c99b/Dtls-1.0.1.tar.gz", "yanked": false}, {"comment_text": "", "digests": {"md5": "c5d19c5b6fad95d610c73a8388468341", "sha256": "f3f3bc5150f0222fffead2eefcfd38f6f661f74befb846e8a38d793086c137fc"}, "downloads": -1, "filename": "Dtls-1.0.1.zip", "has_sig": false, "md5_digest": "c5d19c5b6fad95d610c73a8388468341", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 76380, "upload_time": "2014-01-19T05:05:19", "upload_time_iso_8601": "2014-01-19T05:05:19.516761Z", "url": "https://files.pythonhosted.org/packages/ce/2a/07947407a17d8a2076bed78811c854550944b054ba9a53da140b5bb279de/Dtls-1.0.1.zip", "yanked": false}], "1.2.0": [{"comment_text": "", "digests": {"md5": "9c28e198e58936090cc073ff56139170", "sha256": "0f2d6e4a352b6bf9c51d71b1192d896e5f565558463f58c8b3a6057022de46ee"}, "downloads": -1, "filename": "Dtls-1.2.0-py2-none-win32.whl", "has_sig": false, "md5_digest": "9c28e198e58936090cc073ff56139170", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 844399, "upload_time": "2017-04-07T21:17:03", "upload_time_iso_8601": "2017-04-07T21:17:03.055978Z", "url": "https://files.pythonhosted.org/packages/00/d9/cc4ac0a9104df35dbb3a68887c442eb0c2e36dc759224535f768cf268a99/Dtls-1.2.0-py2-none-win32.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d2516ab5d5fadf8ae795380e923928d9", "sha256": "d46eeed2970dca73cdf979770fbd33abef56f75e759b7c10e3019e76e4c6acb4"}, "downloads": -1, "filename": "Dtls-1.2.0-py2-none-win_amd64.whl", "has_sig": false, "md5_digest": "d2516ab5d5fadf8ae795380e923928d9", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 1196939, "upload_time": "2017-04-07T21:17:06", "upload_time_iso_8601": "2017-04-07T21:17:06.802683Z", "url": "https://files.pythonhosted.org/packages/d3/34/2654777327caae00a3ee6b05c9666ef2a48fddeb96c309eb4b35fe452478/Dtls-1.2.0-py2-none-win_amd64.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "82332362a4f57ccd8ed506f32e733fc5", "sha256": "93f26c629b78a77d997f258e3449669eb70d543298b564b6b0b76a03e5a1f6e4"}, "downloads": -1, "filename": "Dtls-1.2.0.tar.gz", "has_sig": false, "md5_digest": "82332362a4f57ccd8ed506f32e733fc5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 79648, "upload_time": "2017-04-07T21:17:10", "upload_time_iso_8601": "2017-04-07T21:17:10.356584Z", "url": "https://files.pythonhosted.org/packages/06/bb/dcd7fd37b109b7b63d9fec5c5a25f5842e699e864a0c10ca8448c6bb1f04/Dtls-1.2.0.tar.gz", "yanked": false}], "1.2.2": [{"comment_text": "", "digests": {"md5": "a545d1d450ca8d4a5a4c247580e65fef", "sha256": "5100238c974bae555ed52d313bf801d2916e3f79ec4a0437cb827bbfabe055bd"}, "downloads": -1, "filename": "Dtls-1.2.2-py2-none-any.whl", "has_sig": false, "md5_digest": "a545d1d450ca8d4a5a4c247580e65fef", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 103136, "upload_time": "2017-04-11T00:56:45", "upload_time_iso_8601": "2017-04-11T00:56:45.611722Z", "url": "https://files.pythonhosted.org/packages/ba/a2/f0b0be42507b5258279807d7801bdd010d1e6c5a161913289af5ab2a7ad1/Dtls-1.2.2-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "596effb9cee747cfd51889345d062697", "sha256": "10324ac0ecf2d9cbd73df6d8853e4e7be73335399067948c0f9b8e5afd952765"}, "downloads": -1, "filename": "Dtls-1.2.2-py2-none-win32.whl", "has_sig": false, "md5_digest": "596effb9cee747cfd51889345d062697", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 844418, "upload_time": "2017-04-11T00:56:48", "upload_time_iso_8601": "2017-04-11T00:56:48.025894Z", "url": "https://files.pythonhosted.org/packages/82/63/bc8807a4cbb004f27aeaf64dfa9e4b224c96e0d0a46f6778f45a82d71435/Dtls-1.2.2-py2-none-win32.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a3496de3f6cc6c5b41e2fde357135d93", "sha256": "bac73a72129a766b5d2b1e4dcc3039f55f15b5ad5f1e4cf5cdacaccc2442e3e5"}, "downloads": -1, "filename": "Dtls-1.2.2-py2-none-win_amd64.whl", "has_sig": false, "md5_digest": "a3496de3f6cc6c5b41e2fde357135d93", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 1196957, "upload_time": "2017-04-11T00:56:51", "upload_time_iso_8601": "2017-04-11T00:56:51.419272Z", "url": "https://files.pythonhosted.org/packages/1b/9d/80bda3b6d116a5f7f5c75bf8cc72ec09aa21fb69d1389f4a30d808d6e44b/Dtls-1.2.2-py2-none-win_amd64.whl", "yanked": false}], "1.2.3": [{"comment_text": "", "digests": {"md5": "1ea42c17859fa01c2587cafc93556501", "sha256": "66960da6aadc8f218cfea5bd3b083ffcbb79950878f78e7c70ecf70bc0648d30"}, "downloads": -1, "filename": "Dtls-1.2.3-py2-none-any.whl", "has_sig": false, "md5_digest": "1ea42c17859fa01c2587cafc93556501", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 103387, "upload_time": "2017-04-27T21:36:27", "upload_time_iso_8601": "2017-04-27T21:36:27.184377Z", "url": "https://files.pythonhosted.org/packages/96/4f/854a1f48b0a57d755342a33e27329ebdd6b2eb603a57f342611b834252db/Dtls-1.2.3-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "179769ae7dde78aeb0411d8a82c8ff86", "sha256": "6455683440fed26df58eb1aab23cd5c1173e2cf0567c993c1c2fc8b0a317b828"}, "downloads": -1, "filename": "Dtls-1.2.3-py2-none-win32.whl", "has_sig": false, "md5_digest": "179769ae7dde78aeb0411d8a82c8ff86", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 844667, "upload_time": "2017-04-27T21:36:30", "upload_time_iso_8601": "2017-04-27T21:36:30.136855Z", "url": "https://files.pythonhosted.org/packages/b8/2b/3ae93f22883c4413d471e7962966fd51fa41e23db5ccfdebc1b6aac9c93f/Dtls-1.2.3-py2-none-win32.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "08de371c1a27766336377b13da5bc308", "sha256": "20253f290e741034d50c9a5d49b641fee48f9f9b0e1860df4ba0d817f4566df6"}, "downloads": -1, "filename": "Dtls-1.2.3-py2-none-win_amd64.whl", "has_sig": false, "md5_digest": "08de371c1a27766336377b13da5bc308", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 1197207, "upload_time": "2017-04-27T21:36:33", "upload_time_iso_8601": "2017-04-27T21:36:33.252947Z", "url": "https://files.pythonhosted.org/packages/68/49/1d57d1899c4f613b3296573dcf756e6c8ed8e75985b0d09287166353f410/Dtls-1.2.3-py2-none-win_amd64.whl", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "1ea42c17859fa01c2587cafc93556501", "sha256": "66960da6aadc8f218cfea5bd3b083ffcbb79950878f78e7c70ecf70bc0648d30"}, "downloads": -1, "filename": "Dtls-1.2.3-py2-none-any.whl", "has_sig": false, "md5_digest": "1ea42c17859fa01c2587cafc93556501", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 103387, "upload_time": "2017-04-27T21:36:27", "upload_time_iso_8601": "2017-04-27T21:36:27.184377Z", "url": "https://files.pythonhosted.org/packages/96/4f/854a1f48b0a57d755342a33e27329ebdd6b2eb603a57f342611b834252db/Dtls-1.2.3-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "179769ae7dde78aeb0411d8a82c8ff86", "sha256": "6455683440fed26df58eb1aab23cd5c1173e2cf0567c993c1c2fc8b0a317b828"}, "downloads": -1, "filename": "Dtls-1.2.3-py2-none-win32.whl", "has_sig": false, "md5_digest": "179769ae7dde78aeb0411d8a82c8ff86", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 844667, "upload_time": "2017-04-27T21:36:30", "upload_time_iso_8601": "2017-04-27T21:36:30.136855Z", "url": "https://files.pythonhosted.org/packages/b8/2b/3ae93f22883c4413d471e7962966fd51fa41e23db5ccfdebc1b6aac9c93f/Dtls-1.2.3-py2-none-win32.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "08de371c1a27766336377b13da5bc308", "sha256": "20253f290e741034d50c9a5d49b641fee48f9f9b0e1860df4ba0d817f4566df6"}, "downloads": -1, "filename": "Dtls-1.2.3-py2-none-win_amd64.whl", "has_sig": false, "md5_digest": "08de371c1a27766336377b13da5bc308", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 1197207, "upload_time": "2017-04-27T21:36:33", "upload_time_iso_8601": "2017-04-27T21:36:33.252947Z", "url": "https://files.pythonhosted.org/packages/68/49/1d57d1899c4f613b3296573dcf756e6c8ed8e75985b0d09287166353f410/Dtls-1.2.3-py2-none-win_amd64.whl", "yanked": false}], "timestamp": "Fri May  8 00:49:14 2020"}