{"info": {"author": "Shannon McPherron", "author_email": "shannon.mcpherron@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Intended Audience :: Developers", "Intended Audience :: End Users/Desktop", "License :: OSI Approved :: GNU General Public License v3 (GPLv3)", "Programming Language :: Python :: 3.6", "Topic :: Software Development :: Build Tools"], "description": "# E5 (Beta Version)\n\nE5 is a generalized data entry program intended for archaeologists but likely useful for others as well.  It works with a configuration file where the data entry fields are defined.  Importantly, E5 makes it simple to make entry in one field conditional on values previously entered for other fields.  The goal is to make data entry fast, efficient and error free.  \n\nE5 is a complete, from scratch re-write of E4.  It is backwards compatible with E4 configuration files, but it supports several new features (with more to come).  For one, it is now built on Python to be cross-platform compatible, and the source code is available at GitHub.  E5 will run on Windows, Mac OS, Linux and Android tablets and phones.  For this reason and others, E5 now uses an open database format.  All data are stored in human readable, ASCII formatted JSON files.  Data can also be exported to CSV files for easy import into any database, statistics or spreadsheet software.\n\n#### What's New\n\n- Cross-platform support for Windows, Mac OS, Linux and Android\n- JSON data format (CSV export)\n- Open source\n- DateTime field for automated recording of when the record was entered\n- Boolean field for easy True/False recording\n- Notes field for easier text entry\n- Automated back-ups\n\n#### What's Coming\n\n- Support for device cameras to link images with data records\n- Support for device GPS to link locations to data records\n- Support for related tables with one to many relationships \n\n#### What is Missing\n\n- Support for iPhones.  Unfortunately the technology used for this version of E5 cannot be easily ported to iPhones.  However, once this version is stable, I will begin work on a custom re-write for Android and Apple phones.\n- Support for older, serial port (COM) calipers and scales.  If there is a demand for this, I can consider adding it. I am interested in finding solutions for connecting calipers to Android phones as well.\n\n#### A Word about the Technology\n\nE5 is written with Python 3.6.5 using as few dependencies as possible for portability and maintainability.  The graphical user interface is built on Kivy 1.11.0.  Kivy is specifically designed for touch screens and cross-platform support; however, I made every effort to retain the efficiency of keyboard data entry for Windows and Mac OS.  The database is built on TinyDB, which is written in pure Python.  E3 (the DOS version) lasted a good 15 years (and still works actually).  E4 lasted 10-15 years as well.  My hope is that E5 will have at least this same use life, and I am cautiously optimistic that the switch to Python will give it a longer use life (though I expect that I will have to change the graphical user interface technology more frequently).  \n\n#### Data Security and Bugs\n\nE5 is a complete re-write of E4 in a language that I am still learning.  It also tries to do some things I have never done before (like cross-platform compatibility).  At the same time, E5 is responsible for your scientific data.  I can assure you that I take this responsibility, like the collection of my own data, very seriously, and I am making every effort to have a bug free program.  If you encounter bugs, please report them by emailing me at mcpherron@eva.mpg.de.  To effectively replicate the problem and fix the bug, I will need your configuration file, a description of how to replicate the bug, and the name of the platform (Windows, Android etc.).  If you want to add features, again, please write me.  And if you are a programmer and want to contribute features, that's great.  Please use GitHub so that I can incorporate your improvements into the general release versions (and I would prefer it if you contact me beforehand about working on the project).\n\n#### Configuration Files\n\nThe key element of E5 is the configuration file where the data entry fields are defined.  Configuration files (ending with a CFG file extension) may seem a bit complicated at first, and they must be written in a separate program (an ASCII text editor like NotePad or NotePad++ on Windows).  The effort of thinking through a configuration file, however, means thinking through the structure of your data before you start collecting it (unlike, for instance, if you use a spreadsheet), and this effort typically pays off later when you go to analyze the data.\n\nSeveral example CFG files are included here in the CFGs folder, and here is a sample configuration file to illustrate some features:\n\n```\n[E5]\ntable=lithics\n\n[ID]\ninput=text\nprompt=Enter the artifact ID\nunique=True\n\n[ArtifactType]\ninput=menu\nprompt=Select the artifact type\nmenu=Tool,Flake,Core\n\n[ToolType]\ninput=menu\nprompt=Select the tool type\nmenu=Scraper,Notch,Point,Other\ncondition1=ArtifactType Tool\n\n[PlatformType]\ninput=menu\nprompt=What is the platform\nmenu=Plain,Cortical,Missing,Other\ncondition1=ArtifactType Tool Flake\n\n[PlatformWidth]\ninput=numeric\nprompt=Measure the platform width\ncondition1=ArtifactType Tool Flake\ncondition2=PlatformType not Missing\n\n[Weight]\ninput=numeric\n\n```\n\nThe file is organized into blocks defined by the [].  Each file will have an [E5] block (usually at the start) that contains settings that apply to the whole configuration file.  In this example, there is one option (table=) which tells E5 what to call the database table.  If no table is specified, E5 uses '_default'.  Because it is not specified here, the database file itself (a JSON file) will have the same name as the configuration file.\n\nNext is a series of data entry fields (again, each defined with []).  Here the first field is an artifact ID.  The 'type' option tells E5 what kind of data to accept.  Valid options include text, note, numeric, menus, boolean (True/False), and the date and time.  The *prompt* is specified with an option, and then the *unique* option tells E5 that each data record must have a unique value for this field.  Attempts to duplicate a value for this field will generate a warning, and if data entry continues it will edit (or overwrite) the previous record with this ID.\n\nThe *ArtifactType* field demonstrates the use of menus.  The actual menu items are specified in the *menu* option and are comma separated.  There is no limit to the number of menu items, and they are displayed in the order specified here (unless the *sorted* option is set to *True*).  The *ToolType* field that follows is also a menu, but it demonstrates the use of conditionals.  During data entry, the *ToolType* menu will only be displayed when *ArtifactType* is a tool, otherwise E5 will skip to the next field and insert an empty string (\"\") for the *ToolType* field.  \n\nLikewise *PlatformType* is conditioned on the *ArtifactType* being a tool or a flake.  The field that follows, *PlatformWidth*, has two conditionals which must both be true otherwise the field will be skipped and an empty value will be inserted into the database table.  Notice that the second condition illustrates the use of the not keyword on conditions.  When the *PlatformType* is a value other than missing, this condition is true.\n\nBoth the *PlatformWidth* field and the last field, *Weight*, are numeric fields meaning that only valid numbers are accepted as input.  All other entries will generate an error and data entry cannot continue.\n\n#### Installation  \n\n##### Windows\nA Windows installation can be found in the folder installs/windows as a zip (compressed) file.  Copy the zip file to where you want to install the program (for instance, in C:\\Program Files (x84) or in your data collection folder).  Then uncompress the file (normally a double-click).  Go into the folder created and launch the program e5.exe.  Normally you can make short-cuts to this program in our data collection directory.  \n\nI have tested E5 on several Windows 10 machines, and it worked well (though in some instance some of the time it was slow to load and then this problem went away).  It may work on some Windows 7 installations, and it does not work on Windows XP.  If you have to use Windows XP (and you shouldn't) or Windows 7 (and you soon shouldn't) then I recommend using my previous softare (E4 or Entrer Trois).\n\n##### Mac OS\nNot available yet. Working on it (and could use some help).\n\n##### Android\nWorks but I haven't pushed it to Git yet.\n\n##### Linux\nIf you use Linux, you probably know how to download and install the code on your machine.  I haven't yet posted this code in a Python repository for pip.  I could also use some help here as well.\n\n#### Details (still a draft)\n\n##### [E5]\n\n###### database =\n\nName of the JSON file where the data will be stored. If a database is not specified, E5 will use the name of the CFG file and will create the database in the same folder as the CFG.  If the path is invalid or does not contain a database file, E5 will look for it first in the same folder as the CFG.\n\n###### table =\n\nThe name of the data table within the database.  If a table is not specified, E5 will use the name '_default'.\n\n##### [fieldname]\n\n###### type = \t\n\nValid values are *text*, *note*, *numeric*, *instrument*, *menu*, *boolean*, *datetime*, *camera* (experimental) and *gps* (not yet implemented).  *Text* provides a one line entry box and accepts any alphanumeric characters.  *Note* is like *text* accept that provides a multiline entry box.  *Numeric* constrains input to valid numbers and an Android the keyboard defaults to numeric.  *Instrument* is retained for backwards compatibility but is now equivalent to *numeric*.  *Menu* works with the menu option (below) to provide a menu list.  *Boolean* is a menu with only two options (*True* and *False*).  *Datetime* automatically inserts the current date and time.  *Camera* is in testing mode but is intended to allow photos to be linked to data records.  A *GPS* feature is planned to also attach coordinates to data records.  If missing, type defaults to *text*.\n\n###### prompt =\t\n\nThe prompt associated with each field.  If missing a default will be provided.\n\n###### menu =\n\nA comma separated menu list.  Unless the sorted option is specified (below), the menu list is shown in the order provided.  Pressing the first letters of the menu items filters to the list to matching values.\n\n###### sorted =\n\nIf *True*, the menu list is sorted alphabetically.\n\n###### length =\n\nThe maximum length of an entry.  Only valid for *text* and *note* fields.  The default is no limit.\n\n###### info =\n\nA message to be displayed for this field.\n\n###### info file =\n\nThe name of a text file containing help text to be displayed for this field.  Unless a full path name is given, files are assumed to be in the same folder as the CFG.  If a full path is given, but this path is not valid or does not contain the file, E5 will search for the file in the same folder as the CFG.\n\n###### increment = \n\nIf *True*, the numeric value in this field will be incremented by one each new record.  The default is *False*.\n\n###### required =\n\nValid values are *True* and *False*.  Default is *false*.\n\n###### unique =\n\nIf *True*, all entries in this field must be unique within the data table.  Entering a repeat value will generate a warning but data entry can continue.  However, when the record is saved, it will replace the previous record with this unique value.  If multiple unique fields are specified, they are all taken together to form a unique value.  For example, if there is one field called Square and another field called ID, E5 will generate a warning only when the combination of Square and ID are repeated within the data table.  The default is *False*.\n\n###### carry =\n\nIf *True*, the previously entered value is retained as the default for the next data record. The default is *False*.\n\n###### condition1 = conditional_field [not] conditional_matches [or]\n\nConditionals are a powerful feature of E5.  They are evaluated for each field as they are encountered, and if the result is *false*, the field is skipped.  There can be up to five conditions (each numbered condition1, condition2, etc.).  The first value of the condition is the conditional field.  This should be the name of a field previously encountered in the CFG.  Next, optionally, a *not* can be specified.  Next come the conditional matches.  These should be a comma separated list of values that could have been entered for the conditional field.  When the conditional field matches one of these, the condition is *true* unless *not* was specified in which case it is *false*.  If there are multiple conditions (e.g. condition1, condition2) then all conditions must be *true* unless *or* is specified.  In evaluating conditions with mixed *or*s and *and*s, *or*s are evaluated first and then the *and*s.  So, for instance, \"*true* and *false* or *true*\" results in *true* because \"*false* or *true*\" is *true* and then \"*true* and *true*\" is *true* (programmers note that the Python eval() function is used to evaluate conditions).  To test for an empty entry, use \"\" or '' in the conditional matches (e.g. compflake, proxflake, '' will match either a compflake, a proxflake or no entered value for the conditional field).\n\n###### menu file =\n\nThe name of a file containing a list of values for a menu field.  These values should be one to a line. Unless a full path name is given, files are assumed to be in the same folder as the CFG.  If a full path is given, but this path is not valid or does not contain the file, E5 will search for the file in the same folder as the CFG.\n\n#### Credits\n\n*E5* is by Shannon P. McPherron.  It is based on *E4* also written by Shannon McPherron in collaboration with Harold L. Dibble.  *E4* was based on *Entrer Trois* which had the help also of Simon Holdaway.  All of these programs were written in the context of my own personal research but also excavation and analyses conducted by the *OldStoneAge* team.  Thus over the years the program has greatly benefit from their feedback.", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/surf3s/E5", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "e5", "package_url": "https://pypi.org/project/e5/", "platform": "", "project_url": "https://pypi.org/project/e5/", "project_urls": {"Homepage": "https://github.com/surf3s/E5"}, "release_url": "https://pypi.org/project/e5/1.0.903/", "requires_dist": null, "requires_python": ">=3.6", "summary": "Configurable data entry program for archaeology", "version": "1.0.903", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>E5 (Beta Version)</h1>\n<p>E5 is a generalized data entry program intended for archaeologists but likely useful for others as well.  It works with a configuration file where the data entry fields are defined.  Importantly, E5 makes it simple to make entry in one field conditional on values previously entered for other fields.  The goal is to make data entry fast, efficient and error free.</p>\n<p>E5 is a complete, from scratch re-write of E4.  It is backwards compatible with E4 configuration files, but it supports several new features (with more to come).  For one, it is now built on Python to be cross-platform compatible, and the source code is available at GitHub.  E5 will run on Windows, Mac OS, Linux and Android tablets and phones.  For this reason and others, E5 now uses an open database format.  All data are stored in human readable, ASCII formatted JSON files.  Data can also be exported to CSV files for easy import into any database, statistics or spreadsheet software.</p>\n<h4>What's New</h4>\n<ul>\n<li>Cross-platform support for Windows, Mac OS, Linux and Android</li>\n<li>JSON data format (CSV export)</li>\n<li>Open source</li>\n<li>DateTime field for automated recording of when the record was entered</li>\n<li>Boolean field for easy True/False recording</li>\n<li>Notes field for easier text entry</li>\n<li>Automated back-ups</li>\n</ul>\n<h4>What's Coming</h4>\n<ul>\n<li>Support for device cameras to link images with data records</li>\n<li>Support for device GPS to link locations to data records</li>\n<li>Support for related tables with one to many relationships</li>\n</ul>\n<h4>What is Missing</h4>\n<ul>\n<li>Support for iPhones.  Unfortunately the technology used for this version of E5 cannot be easily ported to iPhones.  However, once this version is stable, I will begin work on a custom re-write for Android and Apple phones.</li>\n<li>Support for older, serial port (COM) calipers and scales.  If there is a demand for this, I can consider adding it. I am interested in finding solutions for connecting calipers to Android phones as well.</li>\n</ul>\n<h4>A Word about the Technology</h4>\n<p>E5 is written with Python 3.6.5 using as few dependencies as possible for portability and maintainability.  The graphical user interface is built on Kivy 1.11.0.  Kivy is specifically designed for touch screens and cross-platform support; however, I made every effort to retain the efficiency of keyboard data entry for Windows and Mac OS.  The database is built on TinyDB, which is written in pure Python.  E3 (the DOS version) lasted a good 15 years (and still works actually).  E4 lasted 10-15 years as well.  My hope is that E5 will have at least this same use life, and I am cautiously optimistic that the switch to Python will give it a longer use life (though I expect that I will have to change the graphical user interface technology more frequently).</p>\n<h4>Data Security and Bugs</h4>\n<p>E5 is a complete re-write of E4 in a language that I am still learning.  It also tries to do some things I have never done before (like cross-platform compatibility).  At the same time, E5 is responsible for your scientific data.  I can assure you that I take this responsibility, like the collection of my own data, very seriously, and I am making every effort to have a bug free program.  If you encounter bugs, please report them by emailing me at <a href=\"mailto:mcpherron@eva.mpg.de\">mcpherron@eva.mpg.de</a>.  To effectively replicate the problem and fix the bug, I will need your configuration file, a description of how to replicate the bug, and the name of the platform (Windows, Android etc.).  If you want to add features, again, please write me.  And if you are a programmer and want to contribute features, that's great.  Please use GitHub so that I can incorporate your improvements into the general release versions (and I would prefer it if you contact me beforehand about working on the project).</p>\n<h4>Configuration Files</h4>\n<p>The key element of E5 is the configuration file where the data entry fields are defined.  Configuration files (ending with a CFG file extension) may seem a bit complicated at first, and they must be written in a separate program (an ASCII text editor like NotePad or NotePad++ on Windows).  The effort of thinking through a configuration file, however, means thinking through the structure of your data before you start collecting it (unlike, for instance, if you use a spreadsheet), and this effort typically pays off later when you go to analyze the data.</p>\n<p>Several example CFG files are included here in the CFGs folder, and here is a sample configuration file to illustrate some features:</p>\n<pre><code>[E5]\ntable=lithics\n\n[ID]\ninput=text\nprompt=Enter the artifact ID\nunique=True\n\n[ArtifactType]\ninput=menu\nprompt=Select the artifact type\nmenu=Tool,Flake,Core\n\n[ToolType]\ninput=menu\nprompt=Select the tool type\nmenu=Scraper,Notch,Point,Other\ncondition1=ArtifactType Tool\n\n[PlatformType]\ninput=menu\nprompt=What is the platform\nmenu=Plain,Cortical,Missing,Other\ncondition1=ArtifactType Tool Flake\n\n[PlatformWidth]\ninput=numeric\nprompt=Measure the platform width\ncondition1=ArtifactType Tool Flake\ncondition2=PlatformType not Missing\n\n[Weight]\ninput=numeric\n\n</code></pre>\n<p>The file is organized into blocks defined by the [].  Each file will have an [E5] block (usually at the start) that contains settings that apply to the whole configuration file.  In this example, there is one option (table=) which tells E5 what to call the database table.  If no table is specified, E5 uses '_default'.  Because it is not specified here, the database file itself (a JSON file) will have the same name as the configuration file.</p>\n<p>Next is a series of data entry fields (again, each defined with []).  Here the first field is an artifact ID.  The 'type' option tells E5 what kind of data to accept.  Valid options include text, note, numeric, menus, boolean (True/False), and the date and time.  The <em>prompt</em> is specified with an option, and then the <em>unique</em> option tells E5 that each data record must have a unique value for this field.  Attempts to duplicate a value for this field will generate a warning, and if data entry continues it will edit (or overwrite) the previous record with this ID.</p>\n<p>The <em>ArtifactType</em> field demonstrates the use of menus.  The actual menu items are specified in the <em>menu</em> option and are comma separated.  There is no limit to the number of menu items, and they are displayed in the order specified here (unless the <em>sorted</em> option is set to <em>True</em>).  The <em>ToolType</em> field that follows is also a menu, but it demonstrates the use of conditionals.  During data entry, the <em>ToolType</em> menu will only be displayed when <em>ArtifactType</em> is a tool, otherwise E5 will skip to the next field and insert an empty string (\"\") for the <em>ToolType</em> field.</p>\n<p>Likewise <em>PlatformType</em> is conditioned on the <em>ArtifactType</em> being a tool or a flake.  The field that follows, <em>PlatformWidth</em>, has two conditionals which must both be true otherwise the field will be skipped and an empty value will be inserted into the database table.  Notice that the second condition illustrates the use of the not keyword on conditions.  When the <em>PlatformType</em> is a value other than missing, this condition is true.</p>\n<p>Both the <em>PlatformWidth</em> field and the last field, <em>Weight</em>, are numeric fields meaning that only valid numbers are accepted as input.  All other entries will generate an error and data entry cannot continue.</p>\n<h4>Installation</h4>\n<h5>Windows</h5>\n<p>A Windows installation can be found in the folder installs/windows as a zip (compressed) file.  Copy the zip file to where you want to install the program (for instance, in C:\\Program Files (x84) or in your data collection folder).  Then uncompress the file (normally a double-click).  Go into the folder created and launch the program e5.exe.  Normally you can make short-cuts to this program in our data collection directory.</p>\n<p>I have tested E5 on several Windows 10 machines, and it worked well (though in some instance some of the time it was slow to load and then this problem went away).  It may work on some Windows 7 installations, and it does not work on Windows XP.  If you have to use Windows XP (and you shouldn't) or Windows 7 (and you soon shouldn't) then I recommend using my previous softare (E4 or Entrer Trois).</p>\n<h5>Mac OS</h5>\n<p>Not available yet. Working on it (and could use some help).</p>\n<h5>Android</h5>\n<p>Works but I haven't pushed it to Git yet.</p>\n<h5>Linux</h5>\n<p>If you use Linux, you probably know how to download and install the code on your machine.  I haven't yet posted this code in a Python repository for pip.  I could also use some help here as well.</p>\n<h4>Details (still a draft)</h4>\n<h5>[E5]</h5>\n<h6>database =</h6>\n<p>Name of the JSON file where the data will be stored. If a database is not specified, E5 will use the name of the CFG file and will create the database in the same folder as the CFG.  If the path is invalid or does not contain a database file, E5 will look for it first in the same folder as the CFG.</p>\n<h6>table =</h6>\n<p>The name of the data table within the database.  If a table is not specified, E5 will use the name '_default'.</p>\n<h5>[fieldname]</h5>\n<h6>type =</h6>\n<p>Valid values are <em>text</em>, <em>note</em>, <em>numeric</em>, <em>instrument</em>, <em>menu</em>, <em>boolean</em>, <em>datetime</em>, <em>camera</em> (experimental) and <em>gps</em> (not yet implemented).  <em>Text</em> provides a one line entry box and accepts any alphanumeric characters.  <em>Note</em> is like <em>text</em> accept that provides a multiline entry box.  <em>Numeric</em> constrains input to valid numbers and an Android the keyboard defaults to numeric.  <em>Instrument</em> is retained for backwards compatibility but is now equivalent to <em>numeric</em>.  <em>Menu</em> works with the menu option (below) to provide a menu list.  <em>Boolean</em> is a menu with only two options (<em>True</em> and <em>False</em>).  <em>Datetime</em> automatically inserts the current date and time.  <em>Camera</em> is in testing mode but is intended to allow photos to be linked to data records.  A <em>GPS</em> feature is planned to also attach coordinates to data records.  If missing, type defaults to <em>text</em>.</p>\n<h6>prompt =</h6>\n<p>The prompt associated with each field.  If missing a default will be provided.</p>\n<h6>menu =</h6>\n<p>A comma separated menu list.  Unless the sorted option is specified (below), the menu list is shown in the order provided.  Pressing the first letters of the menu items filters to the list to matching values.</p>\n<h6>sorted =</h6>\n<p>If <em>True</em>, the menu list is sorted alphabetically.</p>\n<h6>length =</h6>\n<p>The maximum length of an entry.  Only valid for <em>text</em> and <em>note</em> fields.  The default is no limit.</p>\n<h6>info =</h6>\n<p>A message to be displayed for this field.</p>\n<h6>info file =</h6>\n<p>The name of a text file containing help text to be displayed for this field.  Unless a full path name is given, files are assumed to be in the same folder as the CFG.  If a full path is given, but this path is not valid or does not contain the file, E5 will search for the file in the same folder as the CFG.</p>\n<h6>increment =</h6>\n<p>If <em>True</em>, the numeric value in this field will be incremented by one each new record.  The default is <em>False</em>.</p>\n<h6>required =</h6>\n<p>Valid values are <em>True</em> and <em>False</em>.  Default is <em>false</em>.</p>\n<h6>unique =</h6>\n<p>If <em>True</em>, all entries in this field must be unique within the data table.  Entering a repeat value will generate a warning but data entry can continue.  However, when the record is saved, it will replace the previous record with this unique value.  If multiple unique fields are specified, they are all taken together to form a unique value.  For example, if there is one field called Square and another field called ID, E5 will generate a warning only when the combination of Square and ID are repeated within the data table.  The default is <em>False</em>.</p>\n<h6>carry =</h6>\n<p>If <em>True</em>, the previously entered value is retained as the default for the next data record. The default is <em>False</em>.</p>\n<h6>condition1 = conditional_field [not] conditional_matches [or]</h6>\n<p>Conditionals are a powerful feature of E5.  They are evaluated for each field as they are encountered, and if the result is <em>false</em>, the field is skipped.  There can be up to five conditions (each numbered condition1, condition2, etc.).  The first value of the condition is the conditional field.  This should be the name of a field previously encountered in the CFG.  Next, optionally, a <em>not</em> can be specified.  Next come the conditional matches.  These should be a comma separated list of values that could have been entered for the conditional field.  When the conditional field matches one of these, the condition is <em>true</em> unless <em>not</em> was specified in which case it is <em>false</em>.  If there are multiple conditions (e.g. condition1, condition2) then all conditions must be <em>true</em> unless <em>or</em> is specified.  In evaluating conditions with mixed <em>or</em>s and <em>and</em>s, <em>or</em>s are evaluated first and then the <em>and</em>s.  So, for instance, \"<em>true</em> and <em>false</em> or <em>true</em>\" results in <em>true</em> because \"<em>false</em> or <em>true</em>\" is <em>true</em> and then \"<em>true</em> and <em>true</em>\" is <em>true</em> (programmers note that the Python eval() function is used to evaluate conditions).  To test for an empty entry, use \"\" or '' in the conditional matches (e.g. compflake, proxflake, '' will match either a compflake, a proxflake or no entered value for the conditional field).</p>\n<h6>menu file =</h6>\n<p>The name of a file containing a list of values for a menu field.  These values should be one to a line. Unless a full path name is given, files are assumed to be in the same folder as the CFG.  If a full path is given, but this path is not valid or does not contain the file, E5 will search for the file in the same folder as the CFG.</p>\n<h4>Credits</h4>\n<p><em>E5</em> is by Shannon P. McPherron.  It is based on <em>E4</em> also written by Shannon McPherron in collaboration with Harold L. Dibble.  <em>E4</em> was based on <em>Entrer Trois</em> which had the help also of Simon Holdaway.  All of these programs were written in the context of my own personal research but also excavation and analyses conducted by the <em>OldStoneAge</em> team.  Thus over the years the program has greatly benefit from their feedback.</p>\n\n          </div>"}, "last_serial": 6128648, "releases": {"1.0.903": [{"comment_text": "", "digests": {"md5": "61415b78589ebb44fc4b9a55acc64921", "sha256": "08f7ceaebdcf955ff30d820ccfd4d4f66894b032dbfd284d3c66e5f786b7cf63"}, "downloads": -1, "filename": "e5-1.0.903.tar.gz", "has_sig": false, "md5_digest": "61415b78589ebb44fc4b9a55acc64921", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 45509, "upload_time": "2019-11-13T08:11:12", "upload_time_iso_8601": "2019-11-13T08:11:12.555565Z", "url": "https://files.pythonhosted.org/packages/a2/a4/95c8cacdfd3cba29db996cee52982e8aed59acfe14052221620974d32b99/e5-1.0.903.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "61415b78589ebb44fc4b9a55acc64921", "sha256": "08f7ceaebdcf955ff30d820ccfd4d4f66894b032dbfd284d3c66e5f786b7cf63"}, "downloads": -1, "filename": "e5-1.0.903.tar.gz", "has_sig": false, "md5_digest": "61415b78589ebb44fc4b9a55acc64921", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 45509, "upload_time": "2019-11-13T08:11:12", "upload_time_iso_8601": "2019-11-13T08:11:12.555565Z", "url": "https://files.pythonhosted.org/packages/a2/a4/95c8cacdfd3cba29db996cee52982e8aed59acfe14052221620974d32b99/e5-1.0.903.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:48:34 2020"}