{"info": {"author": "Jaisen Mathai", "author_email": "jaisen@jmathai.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: Apache Software License"], "description": "# Hello, I'm Elodie\n~~ *Your Personal EXIF-based Photo, Video and Audio Assistant* ~~\n\n[![Build Status](https://travis-ci.org/jmathai/elodie.svg?branch=master)](https://travis-ci.org/jmathai/elodie) [![Coverage Status](https://coveralls.io/repos/github/jmathai/elodie/badge.svg?branch=master)](https://coveralls.io/github/jmathai/elodie?branch=master) [![Scrutinizer Code Quality](https://scrutinizer-ci.com/g/jmathai/elodie/badges/quality-score.png?b=master)](https://scrutinizer-ci.com/g/jmathai/elodie/?branch=master)\n\nI made an app from this open source project. [Download Elodie, the EXIF-based photo organizer app](https://getelodie.com).\n\n## Quickstart guide\n\nGetting started takes just a few minutes.\n\n### Install ExifTool\n\nElodie relies on the great [ExifTool library by Phil Harvey](http://www.sno.phy.queensu.ca/~phil/exiftool/). You'll need to install it for your platform.\n\nSome features for video files will only work with newer versions of ExifTool and have been tested on version 10.20 or higher. Support for HEIC files requires version 11.50 or higher. Check your version by typing `exiftool -ver` and see the [manual installation instructions for ExifTool](http://www.sno.phy.queensu.ca/~phil/exiftool/install.html#Unix) if needed.\n\n```\n# OSX (uses homebrew, http://brew.sh/)\nbrew install exiftool\n\n# Debian / Ubuntu\napt-get install libimage-exiftool-perl\n\n# Fedora / Redhat\ndnf install perl-Image-ExifTool\n\n# Windows users can install the binary\n# http://www.sno.phy.queensu.ca/~phil/exiftool/install.html\n```\n\n### Clone the Elodie repository\n\nYou can clone Elodie from GitHub. You'll need `git` installed ([instructions](https://git-scm.com/book/en/v2/Getting-Started-Installing-Git)).\n\n```\ngit clone https://github.com/jmathai/elodie.git\ncd elodie\npip install -r requirements.txt\n```\n\n### Give Elodie a test drive\n\nNow that you've got the minimum dependencies installed you can start using Elodie. You'll need a photo, video or audio file and a folder you'd like Elodie to organize them into.\n\n```\n# Run these commands from the root of the repository you just cloned.\n./elodie.py import --debug --destination=\"/where/i/want/my/photos/to/go\" /where/my/photo/is.jpg\n```\n\nYou'll notice that the photo was organized into an *Unknown Location* folder. That's because you haven't set up your MapQuest API ([instructions](#using-openstreetmap-data-from-mapquest)).\n\nNow you're ready to learn more about Elodie.\n\n<p align=\"center\"><img src =\"creative/logo@300x.png\" /></p>\n\n## Slowstart guide\n\n[Read a 3 part blog post on why I was created](https://medium.com/vantage/understanding-my-need-for-an-automated-photo-workflow-a2ff95b46f8f#.dmwyjlc57) and how [I can be used with Google Photos](https://medium.com/@jmathai/my-automated-photo-workflow-using-google-photos-and-elodie-afb753b8c724).\n\nI work tirelessly to make sure your photos are always sorted and organized so you can focus on more important things. By photos I mean JPEG, DNG, NEF and common video and audio files.\n\nYou don't love me yet but you will.\n\nI only do 3 things.\n\n* Firstly I organize your existing collection of photos into a customizable folder structure.\n* Second I help make it easy for all the photos you haven't taken yet to flow into the exact location they belong.\n* Third but not least I promise to do all this without a yucky propietary database that some friends of mine use.\n\n*NOTE: make sure you've installed everything I need before running the commands below. [Instructions](#quickstart-guide) at the top of this page.*\n\n## Let's organize your existing photos\n\nMy guess is you've got quite a few photos scattered around. The first thing I'll help you do is to get those photos organized. It doesn't matter if you have hundreds, thousands or tens of thousands of photos; the more the merrier.\n\nFire up your terminal and run this command which *__copies__* your photos into something a bit more structured.\n\n```\n./elodie.py import --destination=\"/where/i/want/my/photos/to/go\" /where/my/photos/are\n```\n\nI'm pretty fast but depending on how many photos you have you might want to grab a snack. When you run this command I'll `print` out my work as I go along. If you're bored you can open `/where/i/want/my/photos/to/go` in *Finder* and watch as I effortlessly copy your photos there.\n\nYou'll notice that your photos are now organized by date and location. Some photos do not have proper dates or location information in them. I do my best and in the worst case scenario I'll use the earlier of the files access or modified time. Ideally your photos have dates and location in the EXIF so my work is more accurate.\n\nDon't fret if your photos don't have much EXIF information. I'll show you how you can fix them up later on but let's walk before we run.\n\nBack to your photos. When I'm done you should see something like this. Notice that I've renamed your files by adding the date and time they were taken. This helps keep them in chronological order when using most viewing applications. You'll thank me later.\n\n```\n├── 2015-06-Jun\n│   ├── California\n│   │   ├── 2015-06-29_16-34-14-img_3900.jpg\n│   │   └── 2015-06-29_17-07-06-img_3901.jpg\n│   └── Paris\n│       └── 2015-06-30_02-40-43-img_3903.jpg\n├── 2015-07-Jul\n│   ├── Mountain View\n│   │   ├── 2015-07-19_17-16-37-img_9426.jpg\n│   │   └── 2015-07-24_19-06-33-img_9432.jpg\n└── 2015-09-Sep\n│   ├── Unknown Location\n    │   ├── 2015-09-27_01-41-38-_dsc8705.dng\n    │   └── 2015-09-27_01-41-38-_dsc8705.nef\n```\n\nNot too bad, eh? Wait a second, what's *Unknown Location*? If I'm not able to figure out where a photo was taken I'll place it into a folder named *Unknown Location*. This typically happens when photos do not have GPS information in their EXIF. You shouldn't see this for photos taken on a smartphone but it's often the case with digital cameras and SLRs. I can help you add GPS information to those photos and get them organized better. Let me show you how.\n\n### Usage Instructions\n\nYou can view these instructions on the command line by typing `./elodie.py import --help`, `./elodie.py update --help` or `./elodie.py generate-db --help`.\n\n#### Import photos\n\n```\nUsage: elodie.py import [OPTIONS] [PATHS]...\n\n  Import files or directories by reading their EXIF and organizing them\n  accordingly.\n\nOptions:\n  --destination DIRECTORY  Copy imported files into this directory.\n                           [required]\n  --source DIRECTORY       Import files from this directory, if specified.\n  --file PATH              Import this file, if specified.\n  --album-from-folder      Use images' folders as their album names.\n  --trash                  After copying files, move the old files to the\n                           trash.\n  --allow-duplicates       Import the file even if it's already been imported.\n  --debug                  Override the value in constants.py with True.\n  --exclude-regex TEXT     Regular expression for directories or files to\n                           exclude.\n  --help                   Show this message and exit.\n```\n\n#### Update photos\n\n```\nUsage: elodie.py update [OPTIONS] FILES...\n\n  Update a file's EXIF. Automatically modifies the file's location and file\n  name accordingly.\n\nOptions:\n  --album TEXT     Update the image album.\n  --location TEXT  Update the image location. Location should be the name of a\n                   place, like \"Las Vegas, NV\".\n  --time TEXT      Update the image time. Time should be in YYYY-mm-dd\n                   hh:ii:ss or YYYY-mm-dd format.\n  --title TEXT     Update the image title.\n  --help           Show this message and exit.\n```\n\n#### (Re)Generate checksum database\n\n```\nUsage: elodie.py generate-db [OPTIONS]\n\n  Regenerate the hash.json database which contains all of the sha256\n  signatures of media files. The hash.json file is located at ~/.elodie/.\n\nOptions:\n  --source DIRECTORY  Source of your photo library.  [required]\n  --help              Show this message and exit.\n```\n\n#### Verify library against bit rot / data rot\n\n```\nUsage: elodie.py verify\n```\n\n### Excluding folders and files from being imported\n\nIf you have specific folders or files which you would like to prevent from being imported you can provide regular expressions which will be used to match and skip files from being imported.\n\nYou can specify an exclusion at run time by using the `--exclude-regex` argument of the `import` command. You can pass multiple `--exclude-regex` arguments and all folder/file paths which match will be (silently) skipped.\n\nIf there are certain file or folder paths you *never* want to import then you can also add an `[Exclusions]` section to your `config.ini` file. Similar to the command line argument you can provide multiple exclusions. Here is an example.\n\n```\n[Exclusions]\nsynology_folders=@eaDir\nthumbnails=.thumbnails\n```\n\n### Create your own folder structure\n\nOK, so what if you don't like the folders being named `2015-07-Jul/Mountain View`? No problem!\n\nYou can add a custom folder structure by editing your `config.ini` file (which should be placed under `~/.elodie/config.ini`). If you'd like to use a different folder for your configuration file then set an environment variable named `ELODIE_APPLICATION_DIRECTORY` with the fully qualified directory path.\n\n#### Custom folder examples\n\nSometimes examples are easier to understand than explainations so I'll start there. If you'd like to understand my magic I explain it in more detail below these examples. You customize your folder structure in the `Directory` section of your `config.ini`. For details of the supported formats see [strftime.org](http://strftime.org/)\n\n```\n[Directory]\nlocation=%city, %state\nyear=%Y\nfull_path=%year/%location\n# -> 2015/Sunnyvale, California\n\nlocation=%city, %state\nmonth=%B\nyear=%Y\nfull_path=%year/%month/%location\n# -> 2015/December/Sunnyvale, California\n\nlocation=%city, %state\nmonth=%m\nyear=%Y\nfull_path=%year-%month/%location\n# -> 2015-12/Sunnyvale, California\n\ndate=%Y\nlocation=%city, %state\ncustom=%date %album\nfull_path=%location/%custom\n# -> Sunnyvale, California/2015 Birthday Party\n```\n\n#### Using fallback folders\n\nThere are times when the EXIF needed to correctly name a folder doesn't exist on a photo. I came up with fallback folders to help you deal with situations such as this. Here's how it works.\n\nYou can specify a series of folder names by separating them with a `|`. That's a pipe, not an L. Let's look at an example.\n\n```\n[Directory]\nmonth=%m\nyear=%Y\nlocation=%city\nfull_path=%month/%year/%album|%location|%\"Beats me\"\n```\n\nWhat this asks me to do is to name the last folder the same as the album I find in EXIF. If I don't find an album in EXIF then I should use the location. If there's no GPS in the EXIf then I should name the last folder `Beats me`.\n\n#### How folder customization works\n\nYou can construct your folder structure using a combination of the location, dates and camera make/model. Under the `Directory` section of your `config.ini` file you can define placeholder names and assign each a value. For example, `date=%Y-%m` would create a date placeholder with a value of YYYY-MM which would be filled in with the date from the EXIF on the photo.\n\nThe placeholders can be used to define the folder structure you'd like to create. The default structure would look like `2015-07-Jul/Mountain View`.\n\nI have some date placeholders you can customize. You can use any of [the standard Python time directives](https://docs.python.org/2/library/datetime.html#strftime-and-strptime-behavior) to customize the date format to your liking.\n\n* `%day` the day the photo was taken.\n* `%month` the month the photo was taken.\n* `%year` the year the photo was taken.\n\nI have camera make and model placeholders which can be used to include the camera make and model into the folder path.\n\n* `%camera_make` the make of the camera which took the photo.\n* `%camera_model` the model of the camera which took the photo.\n\nI also have a few built-in location placeholders you can use. Use this to construct the `%location` you use in `full_path`.\n\n* `%city` the name of the city the photo was taken. Requires geolocation data in EXIF.\n* `%state` the name of the state the photo was taken. Requires geolocation data in EXIF.\n* `%country` the name of the country the photo was taken. Requires geolocation data in EXIF.\n\nIn addition to my built-in and date placeholders you can combine them into a single folder name using my complex placeholders.\n\n* `%location` can be used to combine multiple values of `%city`, `%state` and `%country`. For example, `location=%city, %state` would result in folder names like `Sunnyvale, California`.\n* `%date` can be used to combine multiple values from [the standard Python time directives](https://docs.python.org/2/library/datetime.html#strftime-and-strptime-behavior). For example, `date=%Y-%m` would result in folder names like `2015-12`.\n* `%custom` can be used to combine multiple values from anything else. Think of it as a catch-all when `%location` and `%date` don't meet your needs.\n\n#### How file customization works\n\nYou can configure how Elodie names your files using placeholders. This works similarly to how folder customization works. The default naming format is what's referred to elsewhere in this document and has many thought through benefits. Using the default will gives you files named like `2015-09-27_01-41-38-_dsc8705.jpg`.\n\n\n* Minimizes the likelihood of naming conflicts.\n* Encodes important EXIF information into the file name.\n* Optimizes for sort order when listing in most file and photo viewers.\n\nIf you'd like to specify your own naming convention it's recommended you include something that's mostly unique like the time including seconds. You'll need to include a `[File]` section in your `config.ini` file with a name attribute. If a placeholder doesn't have a value then it plus any preceding characters which are not alphabetic are removed.\n\nBy default the resulting filename is all lowercased. To change this behavior to uppercasing add capitalization=upper.\n\n```\n[File]\ndate=%Y-%m-%b-%H-%M-%S\nname=%date-%original_name-%title.jpg\n# -> 2012-05-mar-12-59-30-dsc_1234-my-title.jpg\n\ndate=%Y-%m-%b-%H-%M-%S\nname=%date-%original_name-%album.jpg\ncapitalization=upper\n# -> 2012-05-MAR-12-59-30-DSC_1234-MY-ALBUM.JPG\n```\n\n### Reorganize by changing location and dates\n\nIf you notice some photos were incorrectly organized you should definitely let me know. In the example above I put two photos into an *Unknown Location* folder because I didn't find GPS information in their EXIF. To fix this I'll help you add GPS information into the photos' EXIF and then I'll reorganize them.\n\n#### Tell me where your photos were taken\nRun the command below if you want to tell me the photos were taken in Las Vegas. You don't have to type all that in though. It's easier to just type `./elodie.py update --location=\"Las Vegas, NV\" ` and select and drag the files from *OS X Finder* into the terminal.\n\n```\n./elodie.py update --location=\"Las Vegas, NV\" /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.dng /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.nef\n```\n\nYou should see this after running that command.\n\n```\n└── 2015-09-Sep\n│   ├── Las Vegas\n    │   ├── 2015-09-27_01-41-38-_dsc8705.dng\n    │   └── 2015-09-27_01-41-38-_dsc8705.nef\n```\n\n#### Tell me when you took your photos\nRun the command below if I got the date wrong when organizing your photos. Similarly to the above command you can drag files from *Finder* into your terminal.\n\n```\n./elodie.py update --time=\"2015-04-15\" /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.dng /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.nef\n```\n\nThat will change the date folder like so.\n\n```\n└── 2015-04-Apr\n│   ├── Las Vegas\n    │   ├── 2015-09-27_01-41-38-_dsc8705.dng\n    │   └── 2015-09-27_01-41-38-_dsc8705.nef\n```\n\nYou can, of course, ask me to change the location and time. I'll happily update the photos and move them around accordingly.\n\n```\n./elodie.py update --location=\"Las Vegas, NV\" --time=\"2015-04-15\" /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.dng /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.nef\n```\n\n## What about photos I take in the future?\n\nOrganizing your existing photos is great. But I'd be lying if I said I was the only one who could help you with that. Unlike other programs I put the same effort into keeping your library organized into the future as I have in getting it organized in the first place.\n\n### Letting me know when you've got more photos to organize\n\nIn order to sort new photos that I haven't already organized I need someone to tell me about them. There's no single way to do this. You could use inotify, cron, Automator or my favorite app - Hazel; it doesn't matter.\n\nIf you'd like to let me know of a specific photo or group of photos to add to your library you would run one of the following commands. Use fully qualified paths for everything since you won't be running this manually.\n\n```\n# I can import a single file into your library.\n./elodie.py import --destination=\"/where/i/want/my/photo/to/go\" /full/path/to/file.jpg\n\n# I can also import all the photos from a directory into your library.\n./elodie.py import --destination=\"/where/i/want/my/photo/to/go\" /where/my/photos/are\n```\n\n## Why not use a database?\n\nLook, it's not that I think databases are evil. One of my friends is a database. It's just that I've been doing this for a long time and I've always used a database for it. In the end they're more trouble than they're worth. I should have listened to my mother when she told me to not date a database.\n\nIt's a lot more work to organize photos without a database. No wonder everyone else uses them. But your happiness is my happiness. If a little elbow grease on my part makes you happy then I'm glad to do it.\n\n### A bit on how I do all this without a database\n\nEvery photo is essentially a database. So it's more accurate to say I use the thousands of tiny databases you already have and use them to organize your photos.\n\nI'm simple. I put a photo into its proper location. I can update a photo to have the right date or location. The latter triggers the first; creating a nice tidy loop of organizational goodness.\n\nI don't do anything else so don't bother asking.\n\n## EXIF and XMP tags\n\nWhen I organize photos I look at the embedded metadata. Here are the details of how I determine what information to use in order of precedence.\n\n| Dimension | Fields | Notes |\n|---|---|---|\n| Date Taken (photo) | EXIF:DateTimeOriginal, EXIF:CreateDate, EXIF:ModifyDate, file created, file modified |   |\n| Date Taken (video, audio) | QuickTime:CreationDate, QuickTime:CreationDate-und-US, QuickTime:MediaCreateDate, file created, file modified |   |\n| Location (photo) | EXIF:GPSLatitude/EXIF:GPSLatitudeRef, EXIF:GPSLongitude/EXIF:GPSLongitudeRef  |   |\n| Location (video, audio) | XMP:GPSLatitude, Composite:GPSLatitude, XMP:GPSLongitude, Composite:GPSLongitude | Composite tags are read-only |\n| Title (photo) | XMP:Title |   |\n| Title (video, audio) | XMP:DisplayName |   |\n| Album | XMP-xmpDM:Album, XMP:Album | XMP:Album is user defined in `configs/ExifTool_config` for backwards compatability |\n| Camera Make (photo, video) | EXIF:Make, QuickTime:Make |   |\n| Camera Model (photo, video) | EXIF:Model, QuickTime:Model |   |\n\n## Using OpenStreetMap data from MapQuest\n\nI use MapQuest to help me organize your photos by location. You'll need to sign up for a [free developer account](https://developer.mapquest.com/plan_purchase/steps/business_edition/business_edition_free) and get an API key. They give you 15,000 calls per month so I can't do any more than that unless you shell out some big bucks to them. Once I hit my limit the best I'll be able to do is *Unknown Location* until the following month.\n\nOnce you sign up you'll have to get an API key and copy it into a file named `~/.elodie/config.ini`. I've included a `config.ini-sample` file which you can copy to `config.ini`.\n\n```\nmkdir ~/.elodie\ncp config.ini-sample ~/.elodie/config.ini\n# now you're ready to add your MapQuest key\n```\n\nIf you're an english speaker then you will probably want to add `prefer_english_names=True` to the `[MapQuest]` section else you'll have cities named using the local language.\n\n## Questions, comments or concerns?\n\nThe best ways to provide feedback is by opening a [GitHub issue](https://github.com/jmathai/elodie/issues) or emailing me at [jaisen@jmathai.com](mailto:jaisen@jmathai.com).\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/jmathai/elodie", "keywords": "photo organization photography", "license": "Apache 2.0", "maintainer": "", "maintainer_email": "", "name": "elodie", "package_url": "https://pypi.org/project/elodie/", "platform": "", "project_url": "https://pypi.org/project/elodie/", "project_urls": {"Homepage": "https://github.com/jmathai/elodie"}, "release_url": "https://pypi.org/project/elodie/0.0.1b0/", "requires_dist": ["click (==6.6)", "requests (==2.20.0)", "Send2Trash (==1.3.0)", "future (==0.16.0)", "configparser (==3.5.0)", "tabulate (==0.7.7)", "Pillow (==5.3.0)"], "requires_python": "", "summary": "Your Personal EXIF-based Photo, Video and Audio Assistant", "version": "0.0.1b0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Hello, I'm Elodie</h1>\n<p>~~ <em>Your Personal EXIF-based Photo, Video and Audio Assistant</em> ~~</p>\n<p><a href=\"https://travis-ci.org/jmathai/elodie\" rel=\"nofollow\"><img alt=\"Build Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/759434f384a8a9d7c191a0539b0dd25d4d5f4096/68747470733a2f2f7472617669732d63692e6f72672f6a6d61746861692f656c6f6469652e7376673f6272616e63683d6d6173746572\"></a> <a href=\"https://coveralls.io/github/jmathai/elodie?branch=master\" rel=\"nofollow\"><img alt=\"Coverage Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/5016b14dbf27d2bac854bc07ae0bf6cf1955775c/68747470733a2f2f636f766572616c6c732e696f2f7265706f732f6769746875622f6a6d61746861692f656c6f6469652f62616467652e7376673f6272616e63683d6d6173746572\"></a> <a href=\"https://scrutinizer-ci.com/g/jmathai/elodie/?branch=master\" rel=\"nofollow\"><img alt=\"Scrutinizer Code Quality\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/a70f38a9461cd4f2f245ffa22de63443470d383f/68747470733a2f2f7363727574696e697a65722d63692e636f6d2f672f6a6d61746861692f656c6f6469652f6261646765732f7175616c6974792d73636f72652e706e673f623d6d6173746572\"></a></p>\n<p>I made an app from this open source project. <a href=\"https://getelodie.com\" rel=\"nofollow\">Download Elodie, the EXIF-based photo organizer app</a>.</p>\n<h2>Quickstart guide</h2>\n<p>Getting started takes just a few minutes.</p>\n<h3>Install ExifTool</h3>\n<p>Elodie relies on the great <a href=\"http://www.sno.phy.queensu.ca/%7Ephil/exiftool/\" rel=\"nofollow\">ExifTool library by Phil Harvey</a>. You'll need to install it for your platform.</p>\n<p>Some features for video files will only work with newer versions of ExifTool and have been tested on version 10.20 or higher. Support for HEIC files requires version 11.50 or higher. Check your version by typing <code>exiftool -ver</code> and see the <a href=\"http://www.sno.phy.queensu.ca/%7Ephil/exiftool/install.html#Unix\" rel=\"nofollow\">manual installation instructions for ExifTool</a> if needed.</p>\n<pre><code># OSX (uses homebrew, http://brew.sh/)\nbrew install exiftool\n\n# Debian / Ubuntu\napt-get install libimage-exiftool-perl\n\n# Fedora / Redhat\ndnf install perl-Image-ExifTool\n\n# Windows users can install the binary\n# http://www.sno.phy.queensu.ca/~phil/exiftool/install.html\n</code></pre>\n<h3>Clone the Elodie repository</h3>\n<p>You can clone Elodie from GitHub. You'll need <code>git</code> installed (<a href=\"https://git-scm.com/book/en/v2/Getting-Started-Installing-Git\" rel=\"nofollow\">instructions</a>).</p>\n<pre><code>git clone https://github.com/jmathai/elodie.git\ncd elodie\npip install -r requirements.txt\n</code></pre>\n<h3>Give Elodie a test drive</h3>\n<p>Now that you've got the minimum dependencies installed you can start using Elodie. You'll need a photo, video or audio file and a folder you'd like Elodie to organize them into.</p>\n<pre><code># Run these commands from the root of the repository you just cloned.\n./elodie.py import --debug --destination=\"/where/i/want/my/photos/to/go\" /where/my/photo/is.jpg\n</code></pre>\n<p>You'll notice that the photo was organized into an <em>Unknown Location</em> folder. That's because you haven't set up your MapQuest API (<a href=\"#using-openstreetmap-data-from-mapquest\" rel=\"nofollow\">instructions</a>).</p>\n<p>Now you're ready to learn more about Elodie.</p>\n<p align=\"center\"><img src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/f2b48b7561ae19085a1fb69bed6c5cf74e4f06d6/63726561746976652f6c6f676f40333030782e706e67\"></p>\n<h2>Slowstart guide</h2>\n<p><a href=\"https://medium.com/vantage/understanding-my-need-for-an-automated-photo-workflow-a2ff95b46f8f#.dmwyjlc57\" rel=\"nofollow\">Read a 3 part blog post on why I was created</a> and how <a href=\"https://medium.com/@jmathai/my-automated-photo-workflow-using-google-photos-and-elodie-afb753b8c724\" rel=\"nofollow\">I can be used with Google Photos</a>.</p>\n<p>I work tirelessly to make sure your photos are always sorted and organized so you can focus on more important things. By photos I mean JPEG, DNG, NEF and common video and audio files.</p>\n<p>You don't love me yet but you will.</p>\n<p>I only do 3 things.</p>\n<ul>\n<li>Firstly I organize your existing collection of photos into a customizable folder structure.</li>\n<li>Second I help make it easy for all the photos you haven't taken yet to flow into the exact location they belong.</li>\n<li>Third but not least I promise to do all this without a yucky propietary database that some friends of mine use.</li>\n</ul>\n<p><em>NOTE: make sure you've installed everything I need before running the commands below. <a href=\"#quickstart-guide\" rel=\"nofollow\">Instructions</a> at the top of this page.</em></p>\n<h2>Let's organize your existing photos</h2>\n<p>My guess is you've got quite a few photos scattered around. The first thing I'll help you do is to get those photos organized. It doesn't matter if you have hundreds, thousands or tens of thousands of photos; the more the merrier.</p>\n<p>Fire up your terminal and run this command which <em><strong>copies</strong></em> your photos into something a bit more structured.</p>\n<pre><code>./elodie.py import --destination=\"/where/i/want/my/photos/to/go\" /where/my/photos/are\n</code></pre>\n<p>I'm pretty fast but depending on how many photos you have you might want to grab a snack. When you run this command I'll <code>print</code> out my work as I go along. If you're bored you can open <code>/where/i/want/my/photos/to/go</code> in <em>Finder</em> and watch as I effortlessly copy your photos there.</p>\n<p>You'll notice that your photos are now organized by date and location. Some photos do not have proper dates or location information in them. I do my best and in the worst case scenario I'll use the earlier of the files access or modified time. Ideally your photos have dates and location in the EXIF so my work is more accurate.</p>\n<p>Don't fret if your photos don't have much EXIF information. I'll show you how you can fix them up later on but let's walk before we run.</p>\n<p>Back to your photos. When I'm done you should see something like this. Notice that I've renamed your files by adding the date and time they were taken. This helps keep them in chronological order when using most viewing applications. You'll thank me later.</p>\n<pre><code>├── 2015-06-Jun\n│   ├── California\n│   │   ├── 2015-06-29_16-34-14-img_3900.jpg\n│   │   └── 2015-06-29_17-07-06-img_3901.jpg\n│   └── Paris\n│       └── 2015-06-30_02-40-43-img_3903.jpg\n├── 2015-07-Jul\n│   ├── Mountain View\n│   │   ├── 2015-07-19_17-16-37-img_9426.jpg\n│   │   └── 2015-07-24_19-06-33-img_9432.jpg\n└── 2015-09-Sep\n│   ├── Unknown Location\n    │   ├── 2015-09-27_01-41-38-_dsc8705.dng\n    │   └── 2015-09-27_01-41-38-_dsc8705.nef\n</code></pre>\n<p>Not too bad, eh? Wait a second, what's <em>Unknown Location</em>? If I'm not able to figure out where a photo was taken I'll place it into a folder named <em>Unknown Location</em>. This typically happens when photos do not have GPS information in their EXIF. You shouldn't see this for photos taken on a smartphone but it's often the case with digital cameras and SLRs. I can help you add GPS information to those photos and get them organized better. Let me show you how.</p>\n<h3>Usage Instructions</h3>\n<p>You can view these instructions on the command line by typing <code>./elodie.py import --help</code>, <code>./elodie.py update --help</code> or <code>./elodie.py generate-db --help</code>.</p>\n<h4>Import photos</h4>\n<pre><code>Usage: elodie.py import [OPTIONS] [PATHS]...\n\n  Import files or directories by reading their EXIF and organizing them\n  accordingly.\n\nOptions:\n  --destination DIRECTORY  Copy imported files into this directory.\n                           [required]\n  --source DIRECTORY       Import files from this directory, if specified.\n  --file PATH              Import this file, if specified.\n  --album-from-folder      Use images' folders as their album names.\n  --trash                  After copying files, move the old files to the\n                           trash.\n  --allow-duplicates       Import the file even if it's already been imported.\n  --debug                  Override the value in constants.py with True.\n  --exclude-regex TEXT     Regular expression for directories or files to\n                           exclude.\n  --help                   Show this message and exit.\n</code></pre>\n<h4>Update photos</h4>\n<pre><code>Usage: elodie.py update [OPTIONS] FILES...\n\n  Update a file's EXIF. Automatically modifies the file's location and file\n  name accordingly.\n\nOptions:\n  --album TEXT     Update the image album.\n  --location TEXT  Update the image location. Location should be the name of a\n                   place, like \"Las Vegas, NV\".\n  --time TEXT      Update the image time. Time should be in YYYY-mm-dd\n                   hh:ii:ss or YYYY-mm-dd format.\n  --title TEXT     Update the image title.\n  --help           Show this message and exit.\n</code></pre>\n<h4>(Re)Generate checksum database</h4>\n<pre><code>Usage: elodie.py generate-db [OPTIONS]\n\n  Regenerate the hash.json database which contains all of the sha256\n  signatures of media files. The hash.json file is located at ~/.elodie/.\n\nOptions:\n  --source DIRECTORY  Source of your photo library.  [required]\n  --help              Show this message and exit.\n</code></pre>\n<h4>Verify library against bit rot / data rot</h4>\n<pre><code>Usage: elodie.py verify\n</code></pre>\n<h3>Excluding folders and files from being imported</h3>\n<p>If you have specific folders or files which you would like to prevent from being imported you can provide regular expressions which will be used to match and skip files from being imported.</p>\n<p>You can specify an exclusion at run time by using the <code>--exclude-regex</code> argument of the <code>import</code> command. You can pass multiple <code>--exclude-regex</code> arguments and all folder/file paths which match will be (silently) skipped.</p>\n<p>If there are certain file or folder paths you <em>never</em> want to import then you can also add an <code>[Exclusions]</code> section to your <code>config.ini</code> file. Similar to the command line argument you can provide multiple exclusions. Here is an example.</p>\n<pre><code>[Exclusions]\nsynology_folders=@eaDir\nthumbnails=.thumbnails\n</code></pre>\n<h3>Create your own folder structure</h3>\n<p>OK, so what if you don't like the folders being named <code>2015-07-Jul/Mountain View</code>? No problem!</p>\n<p>You can add a custom folder structure by editing your <code>config.ini</code> file (which should be placed under <code>~/.elodie/config.ini</code>). If you'd like to use a different folder for your configuration file then set an environment variable named <code>ELODIE_APPLICATION_DIRECTORY</code> with the fully qualified directory path.</p>\n<h4>Custom folder examples</h4>\n<p>Sometimes examples are easier to understand than explainations so I'll start there. If you'd like to understand my magic I explain it in more detail below these examples. You customize your folder structure in the <code>Directory</code> section of your <code>config.ini</code>. For details of the supported formats see <a href=\"http://strftime.org/\" rel=\"nofollow\">strftime.org</a></p>\n<pre><code>[Directory]\nlocation=%city, %state\nyear=%Y\nfull_path=%year/%location\n# -&gt; 2015/Sunnyvale, California\n\nlocation=%city, %state\nmonth=%B\nyear=%Y\nfull_path=%year/%month/%location\n# -&gt; 2015/December/Sunnyvale, California\n\nlocation=%city, %state\nmonth=%m\nyear=%Y\nfull_path=%year-%month/%location\n# -&gt; 2015-12/Sunnyvale, California\n\ndate=%Y\nlocation=%city, %state\ncustom=%date %album\nfull_path=%location/%custom\n# -&gt; Sunnyvale, California/2015 Birthday Party\n</code></pre>\n<h4>Using fallback folders</h4>\n<p>There are times when the EXIF needed to correctly name a folder doesn't exist on a photo. I came up with fallback folders to help you deal with situations such as this. Here's how it works.</p>\n<p>You can specify a series of folder names by separating them with a <code>|</code>. That's a pipe, not an L. Let's look at an example.</p>\n<pre><code>[Directory]\nmonth=%m\nyear=%Y\nlocation=%city\nfull_path=%month/%year/%album|%location|%\"Beats me\"\n</code></pre>\n<p>What this asks me to do is to name the last folder the same as the album I find in EXIF. If I don't find an album in EXIF then I should use the location. If there's no GPS in the EXIf then I should name the last folder <code>Beats me</code>.</p>\n<h4>How folder customization works</h4>\n<p>You can construct your folder structure using a combination of the location, dates and camera make/model. Under the <code>Directory</code> section of your <code>config.ini</code> file you can define placeholder names and assign each a value. For example, <code>date=%Y-%m</code> would create a date placeholder with a value of YYYY-MM which would be filled in with the date from the EXIF on the photo.</p>\n<p>The placeholders can be used to define the folder structure you'd like to create. The default structure would look like <code>2015-07-Jul/Mountain View</code>.</p>\n<p>I have some date placeholders you can customize. You can use any of <a href=\"https://docs.python.org/2/library/datetime.html#strftime-and-strptime-behavior\" rel=\"nofollow\">the standard Python time directives</a> to customize the date format to your liking.</p>\n<ul>\n<li><code>%day</code> the day the photo was taken.</li>\n<li><code>%month</code> the month the photo was taken.</li>\n<li><code>%year</code> the year the photo was taken.</li>\n</ul>\n<p>I have camera make and model placeholders which can be used to include the camera make and model into the folder path.</p>\n<ul>\n<li><code>%camera_make</code> the make of the camera which took the photo.</li>\n<li><code>%camera_model</code> the model of the camera which took the photo.</li>\n</ul>\n<p>I also have a few built-in location placeholders you can use. Use this to construct the <code>%location</code> you use in <code>full_path</code>.</p>\n<ul>\n<li><code>%city</code> the name of the city the photo was taken. Requires geolocation data in EXIF.</li>\n<li><code>%state</code> the name of the state the photo was taken. Requires geolocation data in EXIF.</li>\n<li><code>%country</code> the name of the country the photo was taken. Requires geolocation data in EXIF.</li>\n</ul>\n<p>In addition to my built-in and date placeholders you can combine them into a single folder name using my complex placeholders.</p>\n<ul>\n<li><code>%location</code> can be used to combine multiple values of <code>%city</code>, <code>%state</code> and <code>%country</code>. For example, <code>location=%city, %state</code> would result in folder names like <code>Sunnyvale, California</code>.</li>\n<li><code>%date</code> can be used to combine multiple values from <a href=\"https://docs.python.org/2/library/datetime.html#strftime-and-strptime-behavior\" rel=\"nofollow\">the standard Python time directives</a>. For example, <code>date=%Y-%m</code> would result in folder names like <code>2015-12</code>.</li>\n<li><code>%custom</code> can be used to combine multiple values from anything else. Think of it as a catch-all when <code>%location</code> and <code>%date</code> don't meet your needs.</li>\n</ul>\n<h4>How file customization works</h4>\n<p>You can configure how Elodie names your files using placeholders. This works similarly to how folder customization works. The default naming format is what's referred to elsewhere in this document and has many thought through benefits. Using the default will gives you files named like <code>2015-09-27_01-41-38-_dsc8705.jpg</code>.</p>\n<ul>\n<li>Minimizes the likelihood of naming conflicts.</li>\n<li>Encodes important EXIF information into the file name.</li>\n<li>Optimizes for sort order when listing in most file and photo viewers.</li>\n</ul>\n<p>If you'd like to specify your own naming convention it's recommended you include something that's mostly unique like the time including seconds. You'll need to include a <code>[File]</code> section in your <code>config.ini</code> file with a name attribute. If a placeholder doesn't have a value then it plus any preceding characters which are not alphabetic are removed.</p>\n<p>By default the resulting filename is all lowercased. To change this behavior to uppercasing add capitalization=upper.</p>\n<pre><code>[File]\ndate=%Y-%m-%b-%H-%M-%S\nname=%date-%original_name-%title.jpg\n# -&gt; 2012-05-mar-12-59-30-dsc_1234-my-title.jpg\n\ndate=%Y-%m-%b-%H-%M-%S\nname=%date-%original_name-%album.jpg\ncapitalization=upper\n# -&gt; 2012-05-MAR-12-59-30-DSC_1234-MY-ALBUM.JPG\n</code></pre>\n<h3>Reorganize by changing location and dates</h3>\n<p>If you notice some photos were incorrectly organized you should definitely let me know. In the example above I put two photos into an <em>Unknown Location</em> folder because I didn't find GPS information in their EXIF. To fix this I'll help you add GPS information into the photos' EXIF and then I'll reorganize them.</p>\n<h4>Tell me where your photos were taken</h4>\n<p>Run the command below if you want to tell me the photos were taken in Las Vegas. You don't have to type all that in though. It's easier to just type <code>./elodie.py update --location=\"Las Vegas, NV\"</code> and select and drag the files from <em>OS X Finder</em> into the terminal.</p>\n<pre><code>./elodie.py update --location=\"Las Vegas, NV\" /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.dng /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.nef\n</code></pre>\n<p>You should see this after running that command.</p>\n<pre><code>└── 2015-09-Sep\n│   ├── Las Vegas\n    │   ├── 2015-09-27_01-41-38-_dsc8705.dng\n    │   └── 2015-09-27_01-41-38-_dsc8705.nef\n</code></pre>\n<h4>Tell me when you took your photos</h4>\n<p>Run the command below if I got the date wrong when organizing your photos. Similarly to the above command you can drag files from <em>Finder</em> into your terminal.</p>\n<pre><code>./elodie.py update --time=\"2015-04-15\" /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.dng /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.nef\n</code></pre>\n<p>That will change the date folder like so.</p>\n<pre><code>└── 2015-04-Apr\n│   ├── Las Vegas\n    │   ├── 2015-09-27_01-41-38-_dsc8705.dng\n    │   └── 2015-09-27_01-41-38-_dsc8705.nef\n</code></pre>\n<p>You can, of course, ask me to change the location and time. I'll happily update the photos and move them around accordingly.</p>\n<pre><code>./elodie.py update --location=\"Las Vegas, NV\" --time=\"2015-04-15\" /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.dng /where/i/want/my/photos/to/go/2015-09-Sep/Unknown\\ Location/2015-09-27_01-41-38-_dsc8705.nef\n</code></pre>\n<h2>What about photos I take in the future?</h2>\n<p>Organizing your existing photos is great. But I'd be lying if I said I was the only one who could help you with that. Unlike other programs I put the same effort into keeping your library organized into the future as I have in getting it organized in the first place.</p>\n<h3>Letting me know when you've got more photos to organize</h3>\n<p>In order to sort new photos that I haven't already organized I need someone to tell me about them. There's no single way to do this. You could use inotify, cron, Automator or my favorite app - Hazel; it doesn't matter.</p>\n<p>If you'd like to let me know of a specific photo or group of photos to add to your library you would run one of the following commands. Use fully qualified paths for everything since you won't be running this manually.</p>\n<pre><code># I can import a single file into your library.\n./elodie.py import --destination=\"/where/i/want/my/photo/to/go\" /full/path/to/file.jpg\n\n# I can also import all the photos from a directory into your library.\n./elodie.py import --destination=\"/where/i/want/my/photo/to/go\" /where/my/photos/are\n</code></pre>\n<h2>Why not use a database?</h2>\n<p>Look, it's not that I think databases are evil. One of my friends is a database. It's just that I've been doing this for a long time and I've always used a database for it. In the end they're more trouble than they're worth. I should have listened to my mother when she told me to not date a database.</p>\n<p>It's a lot more work to organize photos without a database. No wonder everyone else uses them. But your happiness is my happiness. If a little elbow grease on my part makes you happy then I'm glad to do it.</p>\n<h3>A bit on how I do all this without a database</h3>\n<p>Every photo is essentially a database. So it's more accurate to say I use the thousands of tiny databases you already have and use them to organize your photos.</p>\n<p>I'm simple. I put a photo into its proper location. I can update a photo to have the right date or location. The latter triggers the first; creating a nice tidy loop of organizational goodness.</p>\n<p>I don't do anything else so don't bother asking.</p>\n<h2>EXIF and XMP tags</h2>\n<p>When I organize photos I look at the embedded metadata. Here are the details of how I determine what information to use in order of precedence.</p>\n<table>\n<thead>\n<tr>\n<th>Dimension</th>\n<th>Fields</th>\n<th>Notes</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Date Taken (photo)</td>\n<td>EXIF:DateTimeOriginal, EXIF:CreateDate, EXIF:ModifyDate, file created, file modified</td>\n<td></td>\n</tr>\n<tr>\n<td>Date Taken (video, audio)</td>\n<td>QuickTime:CreationDate, QuickTime:CreationDate-und-US, QuickTime:MediaCreateDate, file created, file modified</td>\n<td></td>\n</tr>\n<tr>\n<td>Location (photo)</td>\n<td>EXIF:GPSLatitude/EXIF:GPSLatitudeRef, EXIF:GPSLongitude/EXIF:GPSLongitudeRef</td>\n<td></td>\n</tr>\n<tr>\n<td>Location (video, audio)</td>\n<td>XMP:GPSLatitude, Composite:GPSLatitude, XMP:GPSLongitude, Composite:GPSLongitude</td>\n<td>Composite tags are read-only</td>\n</tr>\n<tr>\n<td>Title (photo)</td>\n<td>XMP:Title</td>\n<td></td>\n</tr>\n<tr>\n<td>Title (video, audio)</td>\n<td>XMP:DisplayName</td>\n<td></td>\n</tr>\n<tr>\n<td>Album</td>\n<td>XMP-xmpDM:Album, XMP:Album</td>\n<td>XMP:Album is user defined in <code>configs/ExifTool_config</code> for backwards compatability</td>\n</tr>\n<tr>\n<td>Camera Make (photo, video)</td>\n<td>EXIF:Make, QuickTime:Make</td>\n<td></td>\n</tr>\n<tr>\n<td>Camera Model (photo, video)</td>\n<td>EXIF:Model, QuickTime:Model</td>\n<td></td>\n</tr></tbody></table>\n<h2>Using OpenStreetMap data from MapQuest</h2>\n<p>I use MapQuest to help me organize your photos by location. You'll need to sign up for a <a href=\"https://developer.mapquest.com/plan_purchase/steps/business_edition/business_edition_free\" rel=\"nofollow\">free developer account</a> and get an API key. They give you 15,000 calls per month so I can't do any more than that unless you shell out some big bucks to them. Once I hit my limit the best I'll be able to do is <em>Unknown Location</em> until the following month.</p>\n<p>Once you sign up you'll have to get an API key and copy it into a file named <code>~/.elodie/config.ini</code>. I've included a <code>config.ini-sample</code> file which you can copy to <code>config.ini</code>.</p>\n<pre><code>mkdir ~/.elodie\ncp config.ini-sample ~/.elodie/config.ini\n# now you're ready to add your MapQuest key\n</code></pre>\n<p>If you're an english speaker then you will probably want to add <code>prefer_english_names=True</code> to the <code>[MapQuest]</code> section else you'll have cities named using the local language.</p>\n<h2>Questions, comments or concerns?</h2>\n<p>The best ways to provide feedback is by opening a <a href=\"https://github.com/jmathai/elodie/issues\" rel=\"nofollow\">GitHub issue</a> or emailing me at <a href=\"mailto:jaisen@jmathai.com\">jaisen@jmathai.com</a>.</p>\n\n          </div>"}, "last_serial": 6236349, "releases": {"0.0.1b0": [{"comment_text": "", "digests": {"md5": "d39a441bcd8de96dbb304282b90d43a5", "sha256": "322fc3bf46e7a487c6f5d6153aca50de472f652d90a53322dea03ddb77aceb63"}, "downloads": -1, "filename": "elodie-0.0.1b0-py3-none-any.whl", "has_sig": false, "md5_digest": "d39a441bcd8de96dbb304282b90d43a5", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 33013, "upload_time": "2019-12-03T17:51:46", "upload_time_iso_8601": "2019-12-03T17:51:46.240309Z", "url": "https://files.pythonhosted.org/packages/23/98/5ce3b907717a5cd68528cf6ee790bf54d2a936f0b7b99d945e4b01037755/elodie-0.0.1b0-py3-none-any.whl", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "d39a441bcd8de96dbb304282b90d43a5", "sha256": "322fc3bf46e7a487c6f5d6153aca50de472f652d90a53322dea03ddb77aceb63"}, "downloads": -1, "filename": "elodie-0.0.1b0-py3-none-any.whl", "has_sig": false, "md5_digest": "d39a441bcd8de96dbb304282b90d43a5", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 33013, "upload_time": "2019-12-03T17:51:46", "upload_time_iso_8601": "2019-12-03T17:51:46.240309Z", "url": "https://files.pythonhosted.org/packages/23/98/5ce3b907717a5cd68528cf6ee790bf54d2a936f0b7b99d945e4b01037755/elodie-0.0.1b0-py3-none-any.whl", "yanked": false}], "timestamp": "Fri May  8 00:46:47 2020"}