{"info": {"author": "Distributed Masonry", "author_email": "support@onyxplatform.org", "bugtrack_url": null, "classifiers": [], "description": "# Engraver\n\nEngraver is command-line tool for managing and deploying Onyx clusters.\n\n### What does it offer?\n\n- A full application template, preloaded with best practices and design idioms\n- Automatic cluster provisioning to a cloud environment\n- Network security locked down by default\n- High availability configured by default\n- Containerized, preconfigured images of common services\n- Automatic security group adjustment when services are added\n- Log streaming to the developer machine\n- Multi-tenancy as a first class concept\n- Seamless scale up/down\n\n### Installation\n\nAvailable via Pip:\n\n```\n$ pip install engraver\n```\n\n#### Dependencies\n\nTo run Engraver, you will need:\n\n- Python >= 2.7.8\n- Java 8\n- [Leiningen](http://leiningen.org/)\n- [Ansible](http://docs.ansible.com/ansible/intro_installation.html#latest-releases-via-pip)\n- [Docker](https://docs.docker.com/engine/installation/)\n- [An AWS account](http://aws.amazon.com/)\n- [A DockerHub account](https://hub.docker.com/)\n\n### Summary\n\nEngraver is a tool for managing Onyx cluster infrastructure. Unlike other platforms such as Spark and Hadoop, Onyx does not embed a feature for application deployment. The design decision to omit deployment is intentional since it lets application authors choose how and when to deploy application code instead of being forced to opt into a predetermined strategy.\n\nThere is a fair amount of overlap, however, between the deployment techniques for many teams that run Onyx in clustered, production environments. Engraver is a tool that unifies deployment code and makes a handful of opinionated decisions for the sake of making it easier to run Onyx in the cloud. Engraver itself is a Python based tool that wraps Ansible. We designed Engraver to make it friendly for getting started on using Onyx without knowing Ansible, but you're encouraged to learn Ansible along the way to make your Onyx deployment customized to your needs.\n\nIf you disagree with our set up of Ansible out of the box, that's fine. If you know enough about configuration management to take issue with the set up, you're in the category of developers that's advanced enough to not need Engraver. For everyone else, we've built Engraver to be a springboard into production, and as something that can be used for serious deployments.\n\nEngraver has a small set of commands that are built to guide your engineering from initial design all the way into production:\n\n<p align=\"center\">\n  <img width=\"60%\" src=\"https://rawgit.com/onyx-platform/engraver/master/doc/images/lifecycle.svg\">\n</p>\n\n### Concepts\n\nThis is a glossary for all the concepts that we use in Engraver. Each term is briefly explained. See other sections of the documentation for more in-depth discussion.\n\nHere's a quick visual:\n\n<p align=\"center\">\n  <img width=\"70%\" src=\"https://rawgit.com/onyx-platform/engraver/master/doc/images/concepts.svg\">\n</p>\n\n#### Clusters\n\nA cluster is a set of virtual machines that run inside an isolated network. Machines are constructed from machine profiles, and run services when they are active. A cluster is the highest level of deployment isolation in Engraver.\n\n#### Machine Profiles\n\nA machine profile is a specification of what services should run on a virtual machine, what the specifications of the virtual machine are, and how many virtual machines should be created. For example, a machine profile would specify what image its operating system will run, which data center it will run in, and what flavor of machine is desired. It would also declare that it needs some number of those machines - perhaps 3.\n\n#### Services\n\nServices are programs that run on virtual machines. Examples of services are ZooKeeper and Kafka. Services are *typically* expected to run inside containers, but this isn't a strict requirement.\n\n#### Provisioning\n\nProvisioning is the act of creating the infrastructure for the cluster (Virtual Private Cloud, virtual machines, and so far), installing services, and starting the services. Provisioning is idempotent. If you provision more than once, Engraver will attempt to bring the cluster to the desired state determined by what the machine profiles specify.\n\n#### Deployment\n\nDeployment is the process by which Engraver deploys Onyx applications to virtual machines. Running the deployment command through Engraver will clean and uberjar your application, create a Docker image, upload the image to DockHub, and pull it down on all machines running the \"Onyx\" service. A container will be started on each machine, and Onyx will begin running.\n\n#### Jobs\n\nEngraver jobs refer to Onyx jobs. When we *submit* or *kill* a job, we are specifically talking about Onyx jobs. Since Onyx divorces the notion of deployment from job submision, we have the flexibility of doing rolling deployment updates to the Onyx application while the job continues to run on the cluster.\n\n#### Ansible\n\nEngraver wraps the Python configuration management tool Ansible. Engraver is primarily responsible for generating Ansible files in the background while commands are executed. Engraver interprets user commands and maps them to Ansible YAML files. When a change is ready to be made to a cluster, Engraver turns around and invokes Ansible under the hood. Engraver allows full access to Ansible for users who know what they're doing and want a little more power. You can even pass arguments directly to Ansible for commands that support it with the `--ansible` switch.\n\n### How it Works\n\nEngraver is a wrapper around Ansible. Ansible is a terrific tool for deploying virtual machines into the cloud and provisioning them to run user applications. There is, however, a fair amount of work that remains for development teams that cannot be quickly solved by Ansible alone - such as locking down security, attaching persistent volumes, and configuring clustered services for high availability. Engraver aims to solve common dev-ops tasks, and Ansible's YAML-based protocol is a hand-in-glove fit.\n\nWe aim to automatically generate *as few files as possible*, thus minimizing the number of collisions that can happen as a result of checking files into version control across teams.\n\n#### Generated Files\n\nThe following files are automatically generated, and should not be manually edited:\n\n- `ansible/<cluster_id>.yml`\n- `ansible/deployment.yml`\n- `ansible/cluster_remove.yml`\n- `ansible/machine_remove.yml`\n- `ansible/job_submit.yml`\n- `ansible/job_kill.yml`\n- `.engraver/clusters/*`\n\nThe following files are automatically generated, and *may* be edited by hand:\n\n- `ansible/<cluster_id>_post.yml`\n- `ansible/group_vars/<cluster_id>.yml`\n- `ansible/vars/cluster_vars/test/machine_profiles/<profile_id>.yml`\n\nWhen commands are invoked, Engraver scans the generated files and builds up an in-memory representation for the specification of your cluster. The files are, in turn, passed to Ansible to create the desired cluster.\n\n### Machine Profiles In-Depth\n\nIt's helpful to think of machine profiles as \"cookie-cutters\". Profiles are specifications for what a particular machine should look like when we provision it in the cloud, and how many we want. In the image below, the right side represents 3 different profiles (the \"specification\" portion). The left side represents the manifestation of those profiles when they are provisioned.\n\n<p align=\"center\">\n  <img width=\"70%\" src=\"https://rawgit.com/onyx-platform/engraver/master/doc/images/profiles.svg\">\n</p>\n\nThis example shows a total of *10* machines actively running:\n- 6 of them belong to the Onyx Profile\n- 1 of them belongs to the Monitoring Profile\n- 3 of them belong to the Ingestion Profile\n\n#### Preconfigured High Availability\n\nAll 6 of the Onyx Profile machines in the example are running ZooKeeper, BookKeeper, and Onyx. By default, Engraver is preconfigured for highly available. That is, there would be 6 nodes running as a single ZooKeeper cluster.\n\nIf the same service runs in two different profiles, *all* instances of that service will run as a single unit. If this isn't desired, the services can be deployed in two different Engraver clusters for full isolation.\n\n#### Service Dependencies\n\nSome services require that other services be provisioned beforehand. A service can express dependencies by adding a `service_dependencies` key to its `defaults/main.yml` Ansible role. The value of this key should be a sequence of services. For example, the Onyx service declares the following dependencies:\n\n```\nservice_dependencies:\n  - zookeeper\n  - bookkeeper\n```\n\nThis forces the ZooKeeper and BookKeeper services to be provisioned before Onyx is provisioned on a machine.\n\n### FAQ\n\n- Q: How do I run my own provisioning playbook?\n- A: Edit the `ansible/<cluster_id>_post.yml` file and create an Ansible playbook. This playbook will be invoked after running `ansible/<cluster_id>.yml` during the `engraver cluster provision` command.\n\n-----------------\n\n- Q: How do I force services to be brought up in a particular order?\n- A: Edit the `ansible/roles/<service>/defaults/main.yml` file and add a `service_dependencies` key, with value of an array of service names. The services for a profile will be brought up in a topologically sorted order.\n\n-----------------\n\n- Q: How do I change a machine profile after I've provisioned it?\n- A: Create a new profile (`engraver machines new`), and remove the old one (`engraver machines remove`). Machine profiles are like cattle.\n\n### Tutorial\n\nThis a short guide that explains each major piece of Engraver by walking through an example.\n\n#### Initialization\n\nTo make a new Engraver project named `hello-world`, run:\n\n```\n$ engraver init hello-world --example-app beginner\n```\n\nThe `init` command will invoke Leiningen and create a new Onyx application template. It will clone some other repositories from the OnyxPlatform GitHub account. The extra clones are used for standing up your cluster in a cloud environment. We ran this command with the `--example-app` switch. We currently have one preconfigured project that we'll use for demonstration purposes.\n\nThe example application that we're going to deploy has one input and one output stream - both through Kafka. The workflow that we built for this app accepts messages and applies a few basic string transformations before routing them to an output stream. Study the source folder and run the tests for a local, in-memory execution of the Onyx job.\n\n#### Account Configuration\n\nBefore we *really* get rolling, you'll need to tell Engraver about yourself. In this guide, we'll use AWS:\n\n```\n$ engraver configure aws\n```\n\nFill out the prompts to authenticate yourself with AWS. For the \"ssh remote user\" prompt, use \"ubuntu\". This is the user that we'll use for SSH connectivity on our cluster. By default, the machines in an Engraver cluster run an Ubuntu Linux Distro.\n\n#### Cluster Management\n\nOnce you `cd` into the `hello-world` directory and get comfortable with the Onyx project, you can create a specification for a new cluster. Engraver lets you have as many clusters as you want. Let's make a cluster called `dev` in AWS:\n\n```\n$ engraver cluster new --provider aws --cluster-id dev\n```\n\nRunning this command will generate some files, but it won't actually stand up anything in AWS yet. We can inspect our specification with:\n\n```\n$ engraver cluster describe\n+--------------+----------------+-----------+-------------------+\n| Cluster Name | Cloud Provider | Region    | Availability Zone |\n+--------------+----------------+-----------+-------------------+\n| dev          | AWS            | us-east-1 | us-east-1a        |\n+--------------+----------------+-----------+-------------------+\n```\n\nClusters are automatically provisioned into a default region and availability zone. You can configure both of these on the command line with switches to the `cluster new` command.\n\n#### Machine Profiles and Services\n\nWhen you create a new cluster, Engraver will automatically generate a default *machine profile*. A machine profile is the set of services that will run *each machine provisioned with that profile*, and how many machines are desired. Machine profiles are higher level than simple services since it lets you express multiple services being colocated on a single machine.\n\nEngraver gives us a default profile when we create a new profile. What's in it?\n\n```\n$ engraver machines describe --cluster-id dev\n+------------+----------+-----------------------------+---------------+\n| Profile ID | Size     | Services                    | Desired Count |\n+------------+----------+-----------------------------+---------------+\n| default    | c4.large | zookeeper, bookkeeper, onyx |       3       |\n+------------+----------+-----------------------------+---------------+\n```\n\nThe default profile gives us 3 services. Our example uses Kafka for its input and output streams, so we'll need to either modify the default profile or create a new one. In this tutorial, we'll simply edit modify the default profile.\n\nEdit the `ansible/vars/cluster_vars/dev/machine_profiles/default_profile.yml` file, relative to the root of your project. You should see the following content:\n\n```\nprofile_id: default\nec2_image_id: ami-d05e75b8\nec2_instance_type: c4.large\nn_machine_instances: 3\nmachine_services:\n  - zookeeper\n  - bookkeeper\n  - onyx\n```\n\nAdd \"`- kafka`\" at the bottom of the file, and save it. Then run the command to describe the cluster again. You'll see your changes reflected:\n\n```\n$ engraver machines describe --cluster-id dev\n+------------+----------+------------------------------------+---------------+\n| Profile ID | Size     | Services                           | Desired Count |\n+------------+----------+------------------------------------+---------------+\n| default    | c4.large | zookeeper, bookkeeper, kafka, onyx |       3       |\n+------------+----------+------------------------------------+---------------+\n```\n\nBy default, Engraver is ready to provision the `dev` cluster with `3` machines of the default profile. Each of those machines will run Onyx, ZooKeeper, Kafka, and BookKeeper. Since these services are provided by Engraver itself, we've already preconfigured them to be highly available out of the box. These machines will be EC2 instances of type `c4.large`.\n\nIs anything running yet? No, but we can verify that:\n\n```\n$ engraver machines list --cluster-id dev\n> Hint: Displaying cached contents. Refresh status with: engraver machines cache\n\n> No cached contents found.\n```\n\nOops! What's happened? Engraver caches knowledge about provisioned clusters locally in the `.engraver` folder (the cache shouldn't be checked into version control to avoid merge conflicts, and it is put into the `.gitignore` by default). Certain commands automatically update the local cache for you. Since we haven't run such a command yet, we'll need to update the cache ourselves:\n\n```\n$ engraver machines cache --cluster-id dev\n\n... Some Ansible output ...\n\n> Finished updating local cache. Displaying cluster:\n+--+----+---------+-----------------+------------+\n|  | ID | Profile | Public DNS Name | Private IP |\n+--+----+---------+-----------------+------------+\n+--+----+---------+-----------------+------------+\n```\n\nSure enough, we don't have any machines yet because we haven't provisioned. We can try listing again:\n\n```\n$ engraver machines list --cluster-id dev\n> Hint: Displaying cached contents. Refresh status with: engraver machines cache\n\n+--+----+---------+-----------------+------------+\n|  | ID | Profile | Public DNS Name | Private IP |\n+--+----+---------+-----------------+------------+\n+--+----+---------+-----------------+------------+\n```\n\nAfter we provision, the `.engraver/clusters/dev.json` file will have lots of details about the machines that were brought up.\n\n#### Provisioning\n\nTime to stand up our cluster in the cloud. Run the following command to spin up our 3-node cluster:\n\n```\n$ engraver cluster provision --cluster-id dev\n```\n\nYou'll see a fair amount of Ansible output. If you run into any unexpected problems, you can add `--ansible='-vvvv'` to the end of that line - which will put Ansible into verbose mode. When you provision in AWS, Ansible will:\n\n- Create a Virtual Private Cloud (VPC)\n- Create EC2 instances as describe by each of your machine profiles\n- Install the requested services\n\nRunning provision is *idempontent*. You can run it again safely and it will update your existing cluster to your specification, not make a brand new one.\n\nOnce provisioning finishes, we can check our local cache, which has been automatically refreshed:\n\n```\n$ engraver machines list --cluster-id dev\n> Hint: Displaying cached contents. Refresh status with: engraver machines cache\n\n+---+------------+---------+-------------------------------------------+-------------+\n|   | ID         | Profile | Public DNS Name                           | Private IP  |\n+---+------------+---------+-------------------------------------------+-------------+\n| 1 | i-171be88c | default | ec2-52-90-230-216.compute-1.amazonaws.com | 172.0.1.196 |\n| 2 | i-161be88d | default | ec2-52-201-249-47.compute-1.amazonaws.com | 172.0.1.195 |\n| 3 | i-141be88f | default | ec2-54-175-197-45.compute-1.amazonaws.com | 172.0.1.197 |\n+---+------------+---------+-------------------------------------------+-------------+\n```\n\nIf you log into each machine, you'll notice that there's no `onyx` container running on the machine. The Onyx Ansible role did run as a part of provisioning, but didn't start it's container yet. Onyx is a *library*, and is therefore bundled as part of the user level application. The Onyx container will be started during the Application Deployment phase.\n\n#### Log Streaming\n\nMost of our cluster up and running, but it'd be nice to know what the heck is going on! Engraver can automatically stream logs from Docker containers onto your nachine. Our machine profile asked for 3 machines to all run ZooKeeper, so let's take a look:\n\n```\n$ engraver logs ec2-52-90-230-216.compute-1.amazonaws.com --cluster-id dev --service zookeeper\n```\n\nLog contents will be streamed into your local terminal. You can abort out of it using your OS-specific key combination. Note that log streaming will only work for services that declare a `<service-name>_container_name` var in the default values file of their Ansible playbook.\n\n#### Application Deployment\n\nEverything is in place to deploy our Onyx application. We're going to deploy our app as a container using Docker and DockerHub. Make sure you're authenticated to DockerHub with:\n\n```\n$ docker login\n```\n\nThen deploy with:\n\n```\n$ engraver deploy --via dockerhub --cluster-id dev --tenancy-id message-processor --dockerhub-username <your username> --n-peers 4\n```\n\nThis command uberjars your application, creates a container image, pushes it to DockerHub, then pulls it down onto any machines in your cluster that run the `onyx` service. It will starts `4` peers on each machine under the tenancy `message-processor`. This is going to take a while for the first time, so you might want to grab a cup of coffee. The Docker image for your application is uploading its base image, which includes Java, plus its own uberjar. After your first push and pull to/from DockerHub, the base image will be cached on both DockerHub and the machines on your cluster - drastically cutting down on upload/download time thereafter.\n\nVerify that Onyx is running by inspecting the logs:\n\n```\n$ engraver logs ec2-52-90-230-216.compute-1.amazonaws.com --cluster-id dev --service onyx\n```\n\n#### Job Submission\n\nThe Onyx peers are running inside containers on each of the 3 machines our cluster, but they don't have any work to do yet. Now we're going to submit the job to fire them up:\n\n```\n$ engraver job submit --cluster-id dev --tenancy-id message-processor --job-name sample\n```\n\nThis will submit the `sample` job to any Onyx peers in the cluster running under the `message-processor` tenancy id. You should see some activity in your logs that your job has begun.\n\nThe job is running, but there's nothing writing data to the input stream. We'll do that by hand for this tutorial for ease of use by leveraging the Kafka console producer and consumer scripts:\n\nFor the producer:\n\n```\n# SSH into a machine running Kafka\n$ ssh -i ~/.ssh/your-key.pem ubuntu@ec2-52-90-230-216.compute-1.amazonaws.com\n\n# Get a shell in the Kafka container\n$ docker exec -it kafka /bin/bash\n\n# Export JMX_PORT to avoid port collisions.\n# Sigh, I know. :/\n$ export JMX_PORT=10400\n\n$ bin/kafka-console-producer.sh --broker-list 127.0.0.1:9092 --topic input-stream\n```\n\nFor the consumer:\n\n```\n$ ssh -i ~/.ssh/your-key.pem ubuntu@ec2-52-90-230-216.compute-1.amazonaws.com\n\n# Get a shell in the Kafka container\n$ docker exec -it kafka /bin/bash\n\n# Export JMX_PORT to avoid port collisions.\n# Sigh, I know. :/\n$ export JMX_PORT=10400\n\n# ZOOKEEPER_IP is available as an environment variable on this container\n$ bin/kafka-console-consumer.sh --zookeeper $ZOOKEEPER_IP --topic input-stream\n```\n\nIn the console producer, fire off a few EDN messages:\n\n```\n{:message \"Hello world\"}\n{:message \"Onyx is running!\"}\n{:message \"Here's a really long message to trigger a different code path\"}\n```\n\nYou should see messages stream into the console consumer as writing data through the console producer.\n\n#### Autoscaling\n\nIs 3 machines not enough? Maybe it's too many? Let's scale down 1 node:\n\n```\n$ engraver machines scale --cluster-id dev --profile-id default 1\n> Updated local Ansible playbook. Now run: engraver cluster provision\n```\n\nWe've updated our profile. Let's verify:\n\n```\n$ engraver machines describe --cluster-id dev\n+------------+----------+------------------------------------+---------------+\n| Profile ID | Size     | Services                           | Desired Count |\n+------------+----------+------------------------------------+---------------+\n| default    | c4.large | zookeeper, bookkeeper, kafka, onyx |       1       |\n+------------+----------+------------------------------------+---------------+\n```\n\nThe desired count is `1`, which updated our location specification. Let's make it real by running provisioning:\n\n```\n$ engraver cluster provision --cluster-id dev\n```\n\nWe can see that provisioning has spun our cluster down to 1 machine:\n\n```\n$ engraver machines list --cluster-id dev\n> Hint: Displaying cached contents. Refresh status with: engraver machines cache\n\n+---+------------+---------+-------------------------------------------+-------------+\n|   | ID         | Profile | Public DNS Name                           | Private IP  |\n+---+------------+---------+-------------------------------------------+-------------+\n| 1 | i-171be88c | default | ec2-52-90-230-216.compute-1.amazonaws.com | 172.0.1.196 |\n+---+------------+---------+-------------------------------------------+-------------+\n```\n\n#### Teardown\n\nWhen you're down with this tutorial, you can tear everything down with:\n\n```\n$ engraver cluster teardown --cluster-id dev\n```\n\nThis will delete all EC2 instances in your VPC, then delete the VPC entirely. Thanks for playing!\n\n### License\n\nCopyright © 2016 Distributed Masonry\n\nDistributed under the Eclipse Public License", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/onyx-platform/engraver", "keywords": "", "license": "Eclipse", "maintainer": "", "maintainer_email": "", "name": "engraver", "package_url": "https://pypi.org/project/engraver/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/engraver/", "project_urls": {"Homepage": "https://github.com/onyx-platform/engraver"}, "release_url": "https://pypi.org/project/engraver/0.1.6/", "requires_dist": null, "requires_python": "", "summary": "A tool for cutting Onyx", "version": "0.1.6", "yanked": false, "html_description": "<div class=\"project-description\">\n            # Engraver<br><br>Engraver is command-line tool for managing and deploying Onyx clusters.<br><br>### What does it offer?<br><br>- A full application template, preloaded with best practices and design idioms<br>- Automatic cluster provisioning to a cloud environment<br>- Network security locked down by default<br>- High availability configured by default<br>- Containerized, preconfigured images of common services<br>- Automatic security group adjustment when services are added<br>- Log streaming to the developer machine<br>- Multi-tenancy as a first class concept<br>- Seamless scale up/down<br><br>### Installation<br><br>Available via Pip:<br><br>```<br>$ pip install engraver<br>```<br><br>#### Dependencies<br><br>To run Engraver, you will need:<br><br>- Python &gt;= 2.7.8<br>- Java 8<br>- [Leiningen](http://leiningen.org/)<br>- [Ansible](http://docs.ansible.com/ansible/intro_installation.html#latest-releases-via-pip)<br>- [Docker](https://docs.docker.com/engine/installation/)<br>- [An AWS account](http://aws.amazon.com/)<br>- [A DockerHub account](https://hub.docker.com/)<br><br>### Summary<br><br>Engraver is a tool for managing Onyx cluster infrastructure. Unlike other platforms such as Spark and Hadoop, Onyx does not embed a feature for application deployment. The design decision to omit deployment is intentional since it lets application authors choose how and when to deploy application code instead of being forced to opt into a predetermined strategy.<br><br>There is a fair amount of overlap, however, between the deployment techniques for many teams that run Onyx in clustered, production environments. Engraver is a tool that unifies deployment code and makes a handful of opinionated decisions for the sake of making it easier to run Onyx in the cloud. Engraver itself is a Python based tool that wraps Ansible. We designed Engraver to make it friendly for getting started on using Onyx without knowing Ansible, but you're encouraged to learn Ansible along the way to make your Onyx deployment customized to your needs.<br><br>If you disagree with our set up of Ansible out of the box, that's fine. If you know enough about configuration management to take issue with the set up, you're in the category of developers that's advanced enough to not need Engraver. For everyone else, we've built Engraver to be a springboard into production, and as something that can be used for serious deployments.<br><br>Engraver has a small set of commands that are built to guide your engineering from initial design all the way into production:<br><br>&lt;p align=\"center\"&gt;<br>  &lt;img width=\"60%\" src=\"https://rawgit.com/onyx-platform/engraver/master/doc/images/lifecycle.svg\"&gt;<br>&lt;/p&gt;<br><br>### Concepts<br><br>This is a glossary for all the concepts that we use in Engraver. Each term is briefly explained. See other sections of the documentation for more in-depth discussion.<br><br>Here's a quick visual:<br><br>&lt;p align=\"center\"&gt;<br>  &lt;img width=\"70%\" src=\"https://rawgit.com/onyx-platform/engraver/master/doc/images/concepts.svg\"&gt;<br>&lt;/p&gt;<br><br>#### Clusters<br><br>A cluster is a set of virtual machines that run inside an isolated network. Machines are constructed from machine profiles, and run services when they are active. A cluster is the highest level of deployment isolation in Engraver.<br><br>#### Machine Profiles<br><br>A machine profile is a specification of what services should run on a virtual machine, what the specifications of the virtual machine are, and how many virtual machines should be created. For example, a machine profile would specify what image its operating system will run, which data center it will run in, and what flavor of machine is desired. It would also declare that it needs some number of those machines - perhaps 3.<br><br>#### Services<br><br>Services are programs that run on virtual machines. Examples of services are ZooKeeper and Kafka. Services are *typically* expected to run inside containers, but this isn't a strict requirement.<br><br>#### Provisioning<br><br>Provisioning is the act of creating the infrastructure for the cluster (Virtual Private Cloud, virtual machines, and so far), installing services, and starting the services. Provisioning is idempotent. If you provision more than once, Engraver will attempt to bring the cluster to the desired state determined by what the machine profiles specify.<br><br>#### Deployment<br><br>Deployment is the process by which Engraver deploys Onyx applications to virtual machines. Running the deployment command through Engraver will clean and uberjar your application, create a Docker image, upload the image to DockHub, and pull it down on all machines running the \"Onyx\" service. A container will be started on each machine, and Onyx will begin running.<br><br>#### Jobs<br><br>Engraver jobs refer to Onyx jobs. When we *submit* or *kill* a job, we are specifically talking about Onyx jobs. Since Onyx divorces the notion of deployment from job submision, we have the flexibility of doing rolling deployment updates to the Onyx application while the job continues to run on the cluster.<br><br>#### Ansible<br><br>Engraver wraps the Python configuration management tool Ansible. Engraver is primarily responsible for generating Ansible files in the background while commands are executed. Engraver interprets user commands and maps them to Ansible YAML files. When a change is ready to be made to a cluster, Engraver turns around and invokes Ansible under the hood. Engraver allows full access to Ansible for users who know what they're doing and want a little more power. You can even pass arguments directly to Ansible for commands that support it with the `--ansible` switch.<br><br>### How it Works<br><br>Engraver is a wrapper around Ansible. Ansible is a terrific tool for deploying virtual machines into the cloud and provisioning them to run user applications. There is, however, a fair amount of work that remains for development teams that cannot be quickly solved by Ansible alone - such as locking down security, attaching persistent volumes, and configuring clustered services for high availability. Engraver aims to solve common dev-ops tasks, and Ansible's YAML-based protocol is a hand-in-glove fit.<br><br>We aim to automatically generate *as few files as possible*, thus minimizing the number of collisions that can happen as a result of checking files into version control across teams.<br><br>#### Generated Files<br><br>The following files are automatically generated, and should not be manually edited:<br><br>- `ansible/&lt;cluster_id&gt;.yml`<br>- `ansible/deployment.yml`<br>- `ansible/cluster_remove.yml`<br>- `ansible/machine_remove.yml`<br>- `ansible/job_submit.yml`<br>- `ansible/job_kill.yml`<br>- `.engraver/clusters/*`<br><br>The following files are automatically generated, and *may* be edited by hand:<br><br>- `ansible/&lt;cluster_id&gt;_post.yml`<br>- `ansible/group_vars/&lt;cluster_id&gt;.yml`<br>- `ansible/vars/cluster_vars/test/machine_profiles/&lt;profile_id&gt;.yml`<br><br>When commands are invoked, Engraver scans the generated files and builds up an in-memory representation for the specification of your cluster. The files are, in turn, passed to Ansible to create the desired cluster.<br><br>### Machine Profiles In-Depth<br><br>It's helpful to think of machine profiles as \"cookie-cutters\". Profiles are specifications for what a particular machine should look like when we provision it in the cloud, and how many we want. In the image below, the right side represents 3 different profiles (the \"specification\" portion). The left side represents the manifestation of those profiles when they are provisioned.<br><br>&lt;p align=\"center\"&gt;<br>  &lt;img width=\"70%\" src=\"https://rawgit.com/onyx-platform/engraver/master/doc/images/profiles.svg\"&gt;<br>&lt;/p&gt;<br><br>This example shows a total of *10* machines actively running:<br>- 6 of them belong to the Onyx Profile<br>- 1 of them belongs to the Monitoring Profile<br>- 3 of them belong to the Ingestion Profile<br><br>#### Preconfigured High Availability<br><br>All 6 of the Onyx Profile machines in the example are running ZooKeeper, BookKeeper, and Onyx. By default, Engraver is preconfigured for highly available. That is, there would be 6 nodes running as a single ZooKeeper cluster.<br><br>If the same service runs in two different profiles, *all* instances of that service will run as a single unit. If this isn't desired, the services can be deployed in two different Engraver clusters for full isolation.<br><br>#### Service Dependencies<br><br>Some services require that other services be provisioned beforehand. A service can express dependencies by adding a `service_dependencies` key to its `defaults/main.yml` Ansible role. The value of this key should be a sequence of services. For example, the Onyx service declares the following dependencies:<br><br>```<br>service_dependencies:<br>  - zookeeper<br>  - bookkeeper<br>```<br><br>This forces the ZooKeeper and BookKeeper services to be provisioned before Onyx is provisioned on a machine.<br><br>### FAQ<br><br>- Q: How do I run my own provisioning playbook?<br>- A: Edit the `ansible/&lt;cluster_id&gt;_post.yml` file and create an Ansible playbook. This playbook will be invoked after running `ansible/&lt;cluster_id&gt;.yml` during the `engraver cluster provision` command.<br><br>-----------------<br><br>- Q: How do I force services to be brought up in a particular order?<br>- A: Edit the `ansible/roles/&lt;service&gt;/defaults/main.yml` file and add a `service_dependencies` key, with value of an array of service names. The services for a profile will be brought up in a topologically sorted order.<br><br>-----------------<br><br>- Q: How do I change a machine profile after I've provisioned it?<br>- A: Create a new profile (`engraver machines new`), and remove the old one (`engraver machines remove`). Machine profiles are like cattle.<br><br>### Tutorial<br><br>This a short guide that explains each major piece of Engraver by walking through an example.<br><br>#### Initialization<br><br>To make a new Engraver project named `hello-world`, run:<br><br>```<br>$ engraver init hello-world --example-app beginner<br>```<br><br>The `init` command will invoke Leiningen and create a new Onyx application template. It will clone some other repositories from the OnyxPlatform GitHub account. The extra clones are used for standing up your cluster in a cloud environment. We ran this command with the `--example-app` switch. We currently have one preconfigured project that we'll use for demonstration purposes.<br><br>The example application that we're going to deploy has one input and one output stream - both through Kafka. The workflow that we built for this app accepts messages and applies a few basic string transformations before routing them to an output stream. Study the source folder and run the tests for a local, in-memory execution of the Onyx job.<br><br>#### Account Configuration<br><br>Before we *really* get rolling, you'll need to tell Engraver about yourself. In this guide, we'll use AWS:<br><br>```<br>$ engraver configure aws<br>```<br><br>Fill out the prompts to authenticate yourself with AWS. For the \"ssh remote user\" prompt, use \"ubuntu\". This is the user that we'll use for SSH connectivity on our cluster. By default, the machines in an Engraver cluster run an Ubuntu Linux Distro.<br><br>#### Cluster Management<br><br>Once you `cd` into the `hello-world` directory and get comfortable with the Onyx project, you can create a specification for a new cluster. Engraver lets you have as many clusters as you want. Let's make a cluster called `dev` in AWS:<br><br>```<br>$ engraver cluster new --provider aws --cluster-id dev<br>```<br><br>Running this command will generate some files, but it won't actually stand up anything in AWS yet. We can inspect our specification with:<br><br>```<br>$ engraver cluster describe<br>+--------------+----------------+-----------+-------------------+<br>| Cluster Name | Cloud Provider | Region    | Availability Zone |<br>+--------------+----------------+-----------+-------------------+<br>| dev          | AWS            | us-east-1 | us-east-1a        |<br>+--------------+----------------+-----------+-------------------+<br>```<br><br>Clusters are automatically provisioned into a default region and availability zone. You can configure both of these on the command line with switches to the `cluster new` command.<br><br>#### Machine Profiles and Services<br><br>When you create a new cluster, Engraver will automatically generate a default *machine profile*. A machine profile is the set of services that will run *each machine provisioned with that profile*, and how many machines are desired. Machine profiles are higher level than simple services since it lets you express multiple services being colocated on a single machine.<br><br>Engraver gives us a default profile when we create a new profile. What's in it?<br><br>```<br>$ engraver machines describe --cluster-id dev<br>+------------+----------+-----------------------------+---------------+<br>| Profile ID | Size     | Services                    | Desired Count |<br>+------------+----------+-----------------------------+---------------+<br>| default    | c4.large | zookeeper, bookkeeper, onyx |       3       |<br>+------------+----------+-----------------------------+---------------+<br>```<br><br>The default profile gives us 3 services. Our example uses Kafka for its input and output streams, so we'll need to either modify the default profile or create a new one. In this tutorial, we'll simply edit modify the default profile.<br><br>Edit the `ansible/vars/cluster_vars/dev/machine_profiles/default_profile.yml` file, relative to the root of your project. You should see the following content:<br><br>```<br>profile_id: default<br>ec2_image_id: ami-d05e75b8<br>ec2_instance_type: c4.large<br>n_machine_instances: 3<br>machine_services:<br>  - zookeeper<br>  - bookkeeper<br>  - onyx<br>```<br><br>Add \"`- kafka`\" at the bottom of the file, and save it. Then run the command to describe the cluster again. You'll see your changes reflected:<br><br>```<br>$ engraver machines describe --cluster-id dev<br>+------------+----------+------------------------------------+---------------+<br>| Profile ID | Size     | Services                           | Desired Count |<br>+------------+----------+------------------------------------+---------------+<br>| default    | c4.large | zookeeper, bookkeeper, kafka, onyx |       3       |<br>+------------+----------+------------------------------------+---------------+<br>```<br><br>By default, Engraver is ready to provision the `dev` cluster with `3` machines of the default profile. Each of those machines will run Onyx, ZooKeeper, Kafka, and BookKeeper. Since these services are provided by Engraver itself, we've already preconfigured them to be highly available out of the box. These machines will be EC2 instances of type `c4.large`.<br><br>Is anything running yet? No, but we can verify that:<br><br>```<br>$ engraver machines list --cluster-id dev<br>&gt; Hint: Displaying cached contents. Refresh status with: engraver machines cache<br><br>&gt; No cached contents found.<br>```<br><br>Oops! What's happened? Engraver caches knowledge about provisioned clusters locally in the `.engraver` folder (the cache shouldn't be checked into version control to avoid merge conflicts, and it is put into the `.gitignore` by default). Certain commands automatically update the local cache for you. Since we haven't run such a command yet, we'll need to update the cache ourselves:<br><br>```<br>$ engraver machines cache --cluster-id dev<br><br>... Some Ansible output ...<br><br>&gt; Finished updating local cache. Displaying cluster:<br>+--+----+---------+-----------------+------------+<br>|  | ID | Profile | Public DNS Name | Private IP |<br>+--+----+---------+-----------------+------------+<br>+--+----+---------+-----------------+------------+<br>```<br><br>Sure enough, we don't have any machines yet because we haven't provisioned. We can try listing again:<br><br>```<br>$ engraver machines list --cluster-id dev<br>&gt; Hint: Displaying cached contents. Refresh status with: engraver machines cache<br><br>+--+----+---------+-----------------+------------+<br>|  | ID | Profile | Public DNS Name | Private IP |<br>+--+----+---------+-----------------+------------+<br>+--+----+---------+-----------------+------------+<br>```<br><br>After we provision, the `.engraver/clusters/dev.json` file will have lots of details about the machines that were brought up.<br><br>#### Provisioning<br><br>Time to stand up our cluster in the cloud. Run the following command to spin up our 3-node cluster:<br><br>```<br>$ engraver cluster provision --cluster-id dev<br>```<br><br>You'll see a fair amount of Ansible output. If you run into any unexpected problems, you can add `--ansible='-vvvv'` to the end of that line - which will put Ansible into verbose mode. When you provision in AWS, Ansible will:<br><br>- Create a Virtual Private Cloud (VPC)<br>- Create EC2 instances as describe by each of your machine profiles<br>- Install the requested services<br><br>Running provision is *idempontent*. You can run it again safely and it will update your existing cluster to your specification, not make a brand new one.<br><br>Once provisioning finishes, we can check our local cache, which has been automatically refreshed:<br><br>```<br>$ engraver machines list --cluster-id dev<br>&gt; Hint: Displaying cached contents. Refresh status with: engraver machines cache<br><br>+---+------------+---------+-------------------------------------------+-------------+<br>|   | ID         | Profile | Public DNS Name                           | Private IP  |<br>+---+------------+---------+-------------------------------------------+-------------+<br>| 1 | i-171be88c | default | ec2-52-90-230-216.compute-1.amazonaws.com | 172.0.1.196 |<br>| 2 | i-161be88d | default | ec2-52-201-249-47.compute-1.amazonaws.com | 172.0.1.195 |<br>| 3 | i-141be88f | default | ec2-54-175-197-45.compute-1.amazonaws.com | 172.0.1.197 |<br>+---+------------+---------+-------------------------------------------+-------------+<br>```<br><br>If you log into each machine, you'll notice that there's no `onyx` container running on the machine. The Onyx Ansible role did run as a part of provisioning, but didn't start it's container yet. Onyx is a *library*, and is therefore bundled as part of the user level application. The Onyx container will be started during the Application Deployment phase.<br><br>#### Log Streaming<br><br>Most of our cluster up and running, but it'd be nice to know what the heck is going on! Engraver can automatically stream logs from Docker containers onto your nachine. Our machine profile asked for 3 machines to all run ZooKeeper, so let's take a look:<br><br>```<br>$ engraver logs ec2-52-90-230-216.compute-1.amazonaws.com --cluster-id dev --service zookeeper<br>```<br><br>Log contents will be streamed into your local terminal. You can abort out of it using your OS-specific key combination. Note that log streaming will only work for services that declare a `&lt;service-name&gt;_container_name` var in the default values file of their Ansible playbook.<br><br>#### Application Deployment<br><br>Everything is in place to deploy our Onyx application. We're going to deploy our app as a container using Docker and DockerHub. Make sure you're authenticated to DockerHub with:<br><br>```<br>$ docker login<br>```<br><br>Then deploy with:<br><br>```<br>$ engraver deploy --via dockerhub --cluster-id dev --tenancy-id message-processor --dockerhub-username &lt;your username&gt; --n-peers 4<br>```<br><br>This command uberjars your application, creates a container image, pushes it to DockerHub, then pulls it down onto any machines in your cluster that run the `onyx` service. It will starts `4` peers on each machine under the tenancy `message-processor`. This is going to take a while for the first time, so you might want to grab a cup of coffee. The Docker image for your application is uploading its base image, which includes Java, plus its own uberjar. After your first push and pull to/from DockerHub, the base image will be cached on both DockerHub and the machines on your cluster - drastically cutting down on upload/download time thereafter.<br><br>Verify that Onyx is running by inspecting the logs:<br><br>```<br>$ engraver logs ec2-52-90-230-216.compute-1.amazonaws.com --cluster-id dev --service onyx<br>```<br><br>#### Job Submission<br><br>The Onyx peers are running inside containers on each of the 3 machines our cluster, but they don't have any work to do yet. Now we're going to submit the job to fire them up:<br><br>```<br>$ engraver job submit --cluster-id dev --tenancy-id message-processor --job-name sample<br>```<br><br>This will submit the `sample` job to any Onyx peers in the cluster running under the `message-processor` tenancy id. You should see some activity in your logs that your job has begun.<br><br>The job is running, but there's nothing writing data to the input stream. We'll do that by hand for this tutorial for ease of use by leveraging the Kafka console producer and consumer scripts:<br><br>For the producer:<br><br>```<br># SSH into a machine running Kafka<br>$ ssh -i ~/.ssh/your-key.pem ubuntu@ec2-52-90-230-216.compute-1.amazonaws.com<br><br># Get a shell in the Kafka container<br>$ docker exec -it kafka /bin/bash<br><br># Export JMX_PORT to avoid port collisions.<br># Sigh, I know. :/<br>$ export JMX_PORT=10400<br><br>$ bin/kafka-console-producer.sh --broker-list 127.0.0.1:9092 --topic input-stream<br>```<br><br>For the consumer:<br><br>```<br>$ ssh -i ~/.ssh/your-key.pem ubuntu@ec2-52-90-230-216.compute-1.amazonaws.com<br><br># Get a shell in the Kafka container<br>$ docker exec -it kafka /bin/bash<br><br># Export JMX_PORT to avoid port collisions.<br># Sigh, I know. :/<br>$ export JMX_PORT=10400<br><br># ZOOKEEPER_IP is available as an environment variable on this container<br>$ bin/kafka-console-consumer.sh --zookeeper $ZOOKEEPER_IP --topic input-stream<br>```<br><br>In the console producer, fire off a few EDN messages:<br><br>```<br>{:message \"Hello world\"}<br>{:message \"Onyx is running!\"}<br>{:message \"Here's a really long message to trigger a different code path\"}<br>```<br><br>You should see messages stream into the console consumer as writing data through the console producer.<br><br>#### Autoscaling<br><br>Is 3 machines not enough? Maybe it's too many? Let's scale down 1 node:<br><br>```<br>$ engraver machines scale --cluster-id dev --profile-id default 1<br>&gt; Updated local Ansible playbook. Now run: engraver cluster provision<br>```<br><br>We've updated our profile. Let's verify:<br><br>```<br>$ engraver machines describe --cluster-id dev<br>+------------+----------+------------------------------------+---------------+<br>| Profile ID | Size     | Services                           | Desired Count |<br>+------------+----------+------------------------------------+---------------+<br>| default    | c4.large | zookeeper, bookkeeper, kafka, onyx |       1       |<br>+------------+----------+------------------------------------+---------------+<br>```<br><br>The desired count is `1`, which updated our location specification. Let's make it real by running provisioning:<br><br>```<br>$ engraver cluster provision --cluster-id dev<br>```<br><br>We can see that provisioning has spun our cluster down to 1 machine:<br><br>```<br>$ engraver machines list --cluster-id dev<br>&gt; Hint: Displaying cached contents. Refresh status with: engraver machines cache<br><br>+---+------------+---------+-------------------------------------------+-------------+<br>|   | ID         | Profile | Public DNS Name                           | Private IP  |<br>+---+------------+---------+-------------------------------------------+-------------+<br>| 1 | i-171be88c | default | ec2-52-90-230-216.compute-1.amazonaws.com | 172.0.1.196 |<br>+---+------------+---------+-------------------------------------------+-------------+<br>```<br><br>#### Teardown<br><br>When you're down with this tutorial, you can tear everything down with:<br><br>```<br>$ engraver cluster teardown --cluster-id dev<br>```<br><br>This will delete all EC2 instances in your VPC, then delete the VPC entirely. Thanks for playing!<br><br>### License<br><br>Copyright © 2016 Distributed Masonry<br><br>Distributed under the Eclipse Public License\n          </div>"}, "last_serial": 2038564, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "54cd79311c543805d28acb62acf7338b", "sha256": "e47a829d3f3df8003767f0fe6db9753ac4144314f0bfca97f9f7af969f4cee5d"}, "downloads": -1, "filename": "engraver-0.1.0.tar.gz", "has_sig": false, "md5_digest": "54cd79311c543805d28acb62acf7338b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1209, "upload_time": "2016-03-15T00:53:51", "upload_time_iso_8601": "2016-03-15T00:53:51.235838Z", "url": "https://files.pythonhosted.org/packages/fd/df/1e97b17af7c4a4286d5cc10e59c0e50e9f8d4f03c1d24932c24ff2c3a12d/engraver-0.1.0.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "fdb6b70e1d5f0b13dde55ad99e0be7a9", "sha256": "f5f059dfe013d446de46f0b396dda61c6222473f6c12d5a882de35fe85080183"}, "downloads": -1, "filename": "engraver-0.1.1.tar.gz", "has_sig": false, "md5_digest": "fdb6b70e1d5f0b13dde55ad99e0be7a9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9230, "upload_time": "2016-03-15T00:59:31", "upload_time_iso_8601": "2016-03-15T00:59:31.408046Z", "url": "https://files.pythonhosted.org/packages/ca/81/8d29c10dee06abf1afbef2ad550a3ff3d2d8d7a5f351eaebe078db95bfe1/engraver-0.1.1.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "fd1ec5a6a2d6bd6c605b96527f650f28", "sha256": "113a80e060908e9753b6cde6680848dc4e97b90b71fb574c9f6aa5a9b2efc17b"}, "downloads": -1, "filename": "engraver-0.1.2.tar.gz", "has_sig": false, "md5_digest": "fd1ec5a6a2d6bd6c605b96527f650f28", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10329, "upload_time": "2016-03-15T01:00:51", "upload_time_iso_8601": "2016-03-15T01:00:51.543422Z", "url": "https://files.pythonhosted.org/packages/a9/41/4638e282bd4ecfd9f901cef075ac3179f322434737a9bff7bfe51760b73b/engraver-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "7dbae91c792c2d125bba636aa3029797", "sha256": "cfccc94532f9eb11dbe471a05a470691b0735789258fe4c4661b6733d4ce458b"}, "downloads": -1, "filename": "engraver-0.1.3.tar.gz", "has_sig": false, "md5_digest": "7dbae91c792c2d125bba636aa3029797", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 19585, "upload_time": "2016-03-15T01:18:21", "upload_time_iso_8601": "2016-03-15T01:18:21.172541Z", "url": "https://files.pythonhosted.org/packages/f5/5d/b98b0840b7e35fcb24ce86a3c5d303e113158270266f1432db688c773be2/engraver-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "b990652f1b86a3caa6e33956502863bd", "sha256": "56456c3c8e1b3f1659b3cac86221a116edc0367923a29f5c858ba838070451b2"}, "downloads": -1, "filename": "engraver-0.1.4.tar.gz", "has_sig": false, "md5_digest": "b990652f1b86a3caa6e33956502863bd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26351, "upload_time": "2016-03-16T17:49:46", "upload_time_iso_8601": "2016-03-16T17:49:46.571421Z", "url": "https://files.pythonhosted.org/packages/19/77/cc109a66df2a6c88f15e32471817030c4282e57350f455290be406c31ea9/engraver-0.1.4.tar.gz", "yanked": false}], "0.1.5": [{"comment_text": "", "digests": {"md5": "f1f3b7c9076d67fd8bd368cd152b8db6", "sha256": "42f5543cb07ace099bca4113183db42018c22c50cdd09075572cde37d2077a86"}, "downloads": -1, "filename": "engraver-0.1.5.tar.gz", "has_sig": false, "md5_digest": "f1f3b7c9076d67fd8bd368cd152b8db6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26972, "upload_time": "2016-03-17T19:35:28", "upload_time_iso_8601": "2016-03-17T19:35:28.094031Z", "url": "https://files.pythonhosted.org/packages/5a/bd/b81563168d0f0818b3a24f2ac0586b28d3cdb3bb7a3841413b0f8bc23106/engraver-0.1.5.tar.gz", "yanked": false}], "0.1.6": [{"comment_text": "", "digests": {"md5": "a4992d86338d3b3a071dc714d0cb5b7f", "sha256": "d79f5bd20e17a86901c2e8ff3c9bd1e9ef01e6ac1862c32eacd7ed79df37bccc"}, "downloads": -1, "filename": "engraver-0.1.6.tar.gz", "has_sig": false, "md5_digest": "a4992d86338d3b3a071dc714d0cb5b7f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26973, "upload_time": "2016-03-31T17:13:57", "upload_time_iso_8601": "2016-03-31T17:13:57.758226Z", "url": "https://files.pythonhosted.org/packages/87/c9/7beb588170647620be18064dfb2c1f7f0f298b455659fab9b5c8df1fb285/engraver-0.1.6.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "a4992d86338d3b3a071dc714d0cb5b7f", "sha256": "d79f5bd20e17a86901c2e8ff3c9bd1e9ef01e6ac1862c32eacd7ed79df37bccc"}, "downloads": -1, "filename": "engraver-0.1.6.tar.gz", "has_sig": false, "md5_digest": "a4992d86338d3b3a071dc714d0cb5b7f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26973, "upload_time": "2016-03-31T17:13:57", "upload_time_iso_8601": "2016-03-31T17:13:57.758226Z", "url": "https://files.pythonhosted.org/packages/87/c9/7beb588170647620be18064dfb2c1f7f0f298b455659fab9b5c8df1fb285/engraver-0.1.6.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:46:20 2020"}