{"info": {"author": "Michael Hucka", "author_email": "mhucka@caltech.edu", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Environment :: Console", "Intended Audience :: Information Technology", "Intended Audience :: Science/Research", "Intended Audience :: System Administrators", "License :: OSI Approved :: BSD License", "Operating System :: MacOS :: MacOS X", "Operating System :: Microsoft :: Windows", "Operating System :: POSIX", "Operating System :: POSIX :: Linux", "Operating System :: Unix", "Programming Language :: Python", "Programming Language :: Python :: 3.5", "Topic :: System :: Archiving", "Topic :: System :: Archiving :: Packaging", "Topic :: Utilities"], "description": "eprints2bags<img width=\"100px\" align=\"right\" src=\"https://raw.githubusercontent.com/caltechlibrary/eprints2bags/master/.graphics/eprints2bags.png\">\n=========\n\nA program for downloading records from an EPrints server and creating [BagIt](https://en.wikipedia.org/wiki/BagIt) packages out of them.\n\n*Authors*:      [Michael Hucka](http://github.com/mhucka), [Betsy Coles](https://github.com/betsycoles)<br>\n*Repository*:   [https://github.com/caltechlibrary/eprints2bags](https://github.com/caltechlibrary/eprints2bags)<br>\n*License*:      BSD/MIT derivative &ndash; see the [LICENSE](LICENSE) file for more information\n\n[![License](https://img.shields.io/badge/License-BSD%203--Clause-blue.svg?style=flat-square)](https://choosealicense.com/licenses/bsd-3-clause)\n[![Python](https://img.shields.io/badge/Python-3.5+-brightgreen.svg?style=flat-square)](http://shields.io)\n[![Latest release](https://img.shields.io/github/v/release/caltechlibrary/eprints2bags.svg?style=flat-square&color=b44e88)](https://github.com/caltechlibrary/eprints2bags/releases)\n[![DOI](http://img.shields.io/badge/DOI-10.22002%20%2f%20D1.1310-blue.svg?style=flat-square)](https://data.caltech.edu/records/1310)\n[![PyPI](https://img.shields.io/pypi/v/eprints2bags.svg?style=flat-square&color=red)](https://pypi.org/project/eprints2bags/)\n\n🏁 Log of recent changes\n-----------------------\n\n_Version 1.9.1_: This release updates the README file to explain how to install from PyPI, and fixes some internal files related to producing releases on PyPI.\n\n_Version 1.9.0_: This release fixes a couple of minor bugs.  It also changes the debug flag letter to be `-@` and changes the behavior of the flag; these changes are not backward-compatible.  Internally, it changes the setup process to use `setup.cfg` and uses a new way to get package metadata.  Finally, this version is being made available from [PyPI](https://pypi.org/project/eprints2bags).\n\nThe file [CHANGES](CHANGES.md) contains a more complete change log that includes information about previous releases.\n\n\nTable of Contents\n-----------------\n\n* [Introduction](#-introduction)\n* [Installation instructions](#-installation-instructions)\n* [Using eprints2bags](#︎-using-eprints2bags)\n* [Getting help and support](#-getting-help-and-support)\n* [Do you like it?](#-do-you-like-it)\n* [Contributing — info for developers](#-contributing--info-for-developers)\n* [History](#-history)\n* [Acknowledgments](#︎-acknowledgments)\n* [Copyright and license](#︎-copyright-and-license)\n\n\n☀ Introduction\n-----------------------------\n\nMaterials in EPrints must be extracted before they can be moved to a long-term preservation system or dark archive.  _Eprints2bags_ is a self-contained program that encapsulates the processes needed to download records and documents from EPrints, bundle up individual records in [BagIt](https://en.wikipedia.org/wiki/BagIt) packages, and create single-file archives (e.g., in [ZIP](https://en.wikipedia.org/wiki/Zip_(file_format)) format) of each bag.  The program is written in Python 3 and works over a network using an EPrints server's REST API.\n\n\n✺ Installation instructions\n---------------------------\n\nThe instructions below assume you have a Python interpreter installed on your computer; if that's not the case, please first install Python and familiarize yourself with running Python programs on your system.\n\nOn **Linux**, **macOS**, and **Windows** operating systems, you should be able to install `eprints2bags` with [pip](https://pip.pypa.io/en/stable/installing/).  If you don't have the `pip` package or are uncertain if you do, first run the following command in a terminal command line interpreter: \n```\nsudo python3 -m ensurepip\n```\n\nThen, to install `eprints2bags` from the Python package repository, run the following command:\n```\npython3 -m pip install eprints2bags --user --upgrade\n```\n\nAs an alternative to getting it from PyPI, you can instruct `pip` to install `eprints2bags` directly from the GitHub repository:\n```sh\npython3 -m pip install git+https@github.com:caltechlibrary/eprints2bags.git --user --upgrade\n```\n\nOn Linux and macOS systems, assuming that the installation proceeds normally, you should end up with a program called `eprints2bags` in a location normally searched by your terminal shell for commands.\n\n\n▶︎ Using Eprints2bags\n---------------------\n\nFor help with usage at any time, run `eprints2bags` with the option `-h` (or `/h` on Windows).\n\n`eprints2bags` contacts an EPrints REST server whose network API is accessible at the URL given by the command-line option `-a` (or `/a` on Windows).  A typical EPrints server URL has the form `https://somename.yourinstitution.edu/rest`.  **This program will automatically add `/eprint` to the URL path given**, so omit that part of the URL in the value given to `-a`.  The `-a` (or `/a`) option is required; the program cannot infer the server address on its own.\n\n\n### _Specifying which records to get_\n\nThe EPrints records to be written will be limited to the list of EPrints numbers found in the file given by the option `-i` (or `/i` on Windows).  If no `-i` option is given, this program will download all the contents available at the given EPrints server.  The value of `-i` can also be one or more integers separated by commas (e.g., `-i 54602,54604`), or a range of numbers separated by a dash (e.g., `-i 1-100`, which is interpreted as the list of numbers 1, 2, ..., 100 inclusive), or some combination thereof.  In those cases, the records written will be limited to those numbered.\n\nIf the `-l` option (or `/l` on Windows) is given, the records will be additionally filtered to return only those whose last-modified date/time stamp is no older than the given date/time description.  Valid descriptors are those accepted by the Python [dateparser](https://pypi.org/project/dateparser/) library.  Make sure to enclose descriptions within single or double quotes.  Examples:\n\n```\neprints2bags -l \"2 weeks ago\" -a ....\neprints2bags -l \"2014-08-29\"  -a ....\neprints2bags -l \"12 Dec 2014\" -a ....\neprints2bags -l \"July 4, 2013\" -a ....\n```\n\nIf the `-s` option (or `/s` on Windows) is given, the records will also be filtered to include only those whose `<eprint_status>` element value is one of the listed status codes.  Comparisons are done in a case-insensitive manner.  Putting a caret character (`^`) in front of the status (or status list) negates the sense, so that `eprints2bags` will only keep those records whose `<eprint_status>` value is _not_ among those given.  Examples:\n\n```\neprints2bags -s archive -a ...\neprints2bags -s ^inbox,buffer,deletion -a ...\n```\n\nBoth lastmod and status filering are done after the `-i` argument is processed.\n\nBy default, if an error occurs when requesting a record from the EPrints server, it stops execution of `eprints2bags`.  Common causes of errors include missing records implied by the arguments to `-i`, missing files associated with a given record, and files inaccessible due to permissions errors.  If the option `-k` (or `/k` on Windows) is given, `eprints2bags` will attempt to keep going upon encountering missing records, or missing files within records, or similar errors.  Option `-k` is particularly useful when giving a range of numbers with the `-i` option, as it is common for EPrints records to be updated or deleted and gaps to be left in the numbering.  (Running without `-i` will skip over gaps in the numbering because the available record numbers will be obtained directly from the server, which is unlike the user providing a list of record numbers that may or may not exist on the server.  However, even without `-i`, errors may still result from permissions errors or other causes.)\n\n\n### _Specifying what to do with the records_\n\nThis program writes its output in subdirectories under the directory given by the command-line option `-o` (or `/o` on Windows).  If the directory does not exist, this program will create it.  If no `-o` is given, the current directory where `eprints2bags` is running is used.  Whatever the destination is, `eprints2bags` will create subdirectories in the destination, with each subdirectory named according to the EPrints record number (e.g., `/path/to/output/43`, `/path/to/output/44`, `/path/to/output/45`, ...).  If the `-n` option (`/n` on Windows) is given, the subdirectory names are changed to have the form _NAME-NUMBER__ where _NAME_ is the text string provided to the `-n` option and the _NUMBER_ is the EPrints number for a given entry (meaning, `/path/to/output/NAME-43`, `/path/to/output/NAME-44`, `/path/to/output/NAME-45`, ...).\n\nEach directory will contain an [EPrints XML](https://wiki.eprints.org/w/XML_Export_Format) file and additional document file(s) associated with the EPrints record in question.  Documents associated with each record will be fetched over the network.  The list of documents for each record is determined from XML file, in the `<documents>` element.  Certain EPrints internal documents such as `indexcodes.txt` and preview images are ignored.\n\nBy default, each record and associated files downloaded from EPrints will be placed in a directory structure that follows the [BagIt](https://en.wikipedia.org/wiki/BagIt) specification, and then this bag will then be put into its own single-file archive.  The default archive file format is [ZIP](https://en.wikipedia.org/wiki/Zip_(file_format)) with compression turned off (see next paragraph).  Option `-b` (`/b` on Windows) can be used to change this behavior.  This option takes a keyword value; possible values are `none`, `bag` and `bag-and-archive`, with the last being the default.  Value `none` will cause `eprints2bags` to leave the downloaded record content in individual directories without bagging or archiving, and value `bag` will cause `eprints2bags` to create BagIt bags but not single-file archives from the results.  Everything will be left in the output directory (the location given by the `-o` or `/o` option).  Note that creating bags is a destructive operation: it replaces the individual directories of each record with a restructured directory corresponding to the BagIt format.\n\nThe type of archive made when `bag-and-archive` mode is used for the `-b` option can be changed using the option `-t` (or `/t` on Windows).  The possible values are: `compressed-zip`, `uncompressed-zip`, `compressed-tar`, and `uncompressed-tar`.  As mentioned above, the default is `uncompressed-zip` (used if no `-t` option is given).  [ZIP](https://en.wikipedia.org/wiki/Zip_(file_format)) is the default because it is more widely recognized and supported than [tar](https://en.wikipedia.org/wiki/Tar_(computing)) format, and _uncompressed_ ZIP is used because file corruption is generally more damaging to a compressed archive than an uncompressed one.  Since the main use case for `eprints2bags` is to archive contents for long-term storage, avoiding compression seems safer.\n\nThe ZIP archive file will be written with a text comment describing the contents of the archive.  This comment can be viewed by ZIP utilities (e.g., using `zipinfo -z` on Unix/Linux and macOS).  The following is an example of a comment and the information it contains:\n\n```\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\nAbout this archive file:\n\nThis is an archive of a file directory organized in BagIt v1.0 format.\nThe bag contains the content from the EPrints record located at\nhttp://resolver.caltech.edu/CaltechAUTHORS:SHIjfm98\n\nThe software used to create this archive file was:\neprints2bags version 1.3.1 <https://github.com/caltechlibrary/eprints2bags>\n\nThe following is the metadata contained in bag-info.txt:\nBag-Software-Agent: bagit.py v1.7.0 <https://github.com/LibraryOfCongress/bagit-python>\nBagging-Date: 2018-12-13\nExternal-Description: Archive of EPrints record and document files\nExternal-Identifier: http://resolver.caltech.edu/CaltechAUTHORS:SHIjfm98\nInternal-Sender-Identifier: https://authors.library.caltech.edu/id/eprint/355\nPayload-Oxum: 4646541.2\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\n```\n\nArchive comments are a feature of the [ZIP](https://en.wikipedia.org/wiki/Zip_(file_format)) file format and not available with [tar](https://en.wikipedia.org/wiki/Tar_(computing)).\n\nFinally, the overall collection of EPrints records (whether the records are bagged and archived, or just bagged, or left as-is) can optionally be itself put into a bag and/or put in a ZIP archive.  This behavior can be changed with the option `-e` (`/e` on Windows).  Like `-b`, this option takes the possible values `none`, `bag`, and `bag-and-archive`.  The default is `none`.  If the value `bag` is used, a top-level bag containing the individual EPrints bags is created out of the output directory (the location given by the `-o` option); if the value `bag-and-archive` is used, the bag is also put into a single-file archive.  (In other words, the result will be a ZIP archive of a bag whose data directory contains other ZIP archives of bags.)  For safety, `eprints2bags` will refuse to do `bag` or `bag-and-archive` unless a separate output directory is given via the `-o` option; otherwise, this would restructure the current directory where `eprints2bags` is running &ndash; with potentially unexpected or even catastrophic results.  (Imagine if the current directory were the user's home directory!)\n\nGenerating checksum values can be a time-consuming operation for large bags.  By default, during the bagging step, `eprints2bags` will use a number of processes equal to one-half of the available CPUs on the computer.  The number of processes can be changed using the option `-c` (or `/c` on Windows).\n\nThe use of separate options for the different stages provides some flexibility in choosing the final output.  For example,\n\n```\neprints2bags --bag-action none --end-action bag-and-archive\n```\n\nwill create a ZIP archive containing a single bag directory whose `data/` subdirectory contains the set of (unbagged) EPrints records retrieved by `eprints2bags` from the server.\n\n### _Server credentials_\n\nDownloading documents usually requires supplying a user login and password to the EPrints server.  By default, this program uses the operating system's keyring/keychain functionality to get a user name and password.  If the information does not exist from a previous run of `eprints2bags`, it will query the user interactively for the user name and password, and unless the `-K` argument (`/K` on Windows) is given, store them in the user's keyring/keychain so that it does not have to ask again in the future.  It is also possible to supply the information directly on the command line using the `-u` and `-p` options (or `/u` and `/p` on Windows), but this is discouraged because it is insecure on multiuser computer systems.\n\nIf a given EPrints server does not require a user name and password, do not use `-u` or `-p` and leave the name and password blank when prompted for them by `eprints2bags`.  Empty user name and password are allowed values.\n\nTo reset the user name and password (e.g., if a mistake was made the last time and the wrong credentials were stored in the keyring/keychain system), add the `-R` (or `/R` on Windows) command-line argument to a command.  When `eprints2bags` is run with this option, it will query for the user name and password again even if an entry already exists in the keyring or keychain.\n\n\n### _Other options_\n\n`eprints2bags` produces color-coded diagnostic output as it runs, by default.  However, some terminals or terminal configurations may make it hard to read the text with colors, so `eprints2bags` offers the `-C` option (`/C` on Windows) to turn off colored output.\n\nIf given the `-@` argument (`/@` on Windows), this program will output a detailed trace of what it is doing, and will also drop into a debugger upon the occurrence of any errors.  The debug trace will be written to the given destination, which can be a dash character (`-`) to indicate console output, or a file path.\n\nIf given the `-V` option (`/V` on Windows), this program will print the version and other information, and exit without doing anything else.\n\n\n### _Basic usage examples_\n\nRunning `eprints2bags` then consists of invoking the program like any other program on your system.  The following is a simple example showing how to get a single record (#85447) from Caltech's [CODA](https://libguides.caltech.edu/CODA) EPrints server (with user name and password blanked out here for security reasons):\n\n```\n# eprints2bags -o /tmp/eprints -i 85447 -a https://authors.library.caltech.edu/rest -u XXXXX -p XXXXX\n\nBeginning to process 1 EPrints entry.\nOutput will be written under directory \"/tmp/eprints\"\n======================================================================\nGetting record with id 85447\nCreating /tmp/eprints/85447\nDownloading https://authors.library.caltech.edu/85447/1/1-s2.0-S0164121218300517-main.pdf\nMaking bag out of /tmp/eprints/85447\nCreating tarball /tmp/eprints/85447.tgz\n======================================================================\nDone. Wrote 1 EPrints record to /tmp/eprints/.\n```\n\nThe following is a screen cast to give a sense for what it's like to run `eprints2bags`. Click on the following image:\n\n<p align=\"center\">\n  <a href=\"https://asciinema.org/a/kUg8werG8YPobFKgPhsJnHwBi\"><img width=\"80%\" src=\"https://raw.githubusercontent.com/caltechlibrary/eprints2bags/master/.graphics/eprints2bags-asciinema.png\" alt=\"Screencast of simple eprints2bags demo\"></a>\n</p>\n\n\n### _Summary of command-line options_\n\nThe following table summarizes all the command line options available. (Note: on Windows computers, `/` must be used as the prefix character instead of `-`):\n\n| Short&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;   | Long&nbsp;form&nbsp;opt&nbsp;&nbsp; | Meaning | Default |  |\n|---------|-------------------|----------------------|---------|---|\n| `-a`_A_ | `--api-url`_A_    | Use _A_ as the server's REST API URL | | ⚑ |\n| `-b`_B_ | `--bag-action`_B_ | Do _B_ with each record directory | Bag and archive  | ✦ |\n| `-c`_C_ | `--processes`_C_  | No. of processes during bag creation | &frac12; the number of CPUs | |\n| `-e`_E_ | `--end-action`_E_ | Do _E_ with the entire set of records | Nothing | ✦ |\n| `-i`_I_ | `--id-list`_I_    | Records to get (can be a file name) | Fetch all records from the server | |\n| `-k`    | `--keep-going`    | Don't count missing records as an error | Stop if encounter missing record | |\n| `-l`_L_ | `--lastmod`_L_    | Filter by last-modified date/time | Don't filter by date/time | |\n| `-n`_N_ | `--name-base`_N_  | Prefix directory names with _N_ | Use record number only | |\n| `-o`_O_ | `--output-dir`_O_ | Write outputs in the directory _O_ | Write in the current directory |  |\n| `-q`    | `--quiet`         | Don't print info messages while working | Be chatty while working | |\n| `-s`_S_ | `--status`_S_     | Filter by status(s) in _S_ | Don't filter by status | |\n| `-u`_U_ | `--user`_U_       | User name for EPrints server login | |\n| `-p`_P_ | `--password`_U_   | Password for EPrints proxy login | |\n| `-t`_T_ | `--arch-type`_T_  | Use archive type _T_ | Uncompressed ZIP | ♢ |\n| `-y`_Y_ | `--delay`_Y_      | Pause _Y_ ms between getting records | 100 milliseconds | |\n| `-C`    | `--no-color`      | Don't color-code the output | Use colors in the terminal output | |\n| `-K`    | `--no-keyring`    | Don't use a keyring/keychain | Store login info in keyring | |\n| `-R`    | `--reset`         | Reset user login & password used | Reuse previous credentials |\n| `-V`    | `--version`       | Print program version info and exit | Do other actions instead | |\n| `-@`_OUT_ | `--debug`_OUT_    | Debugging mode; write trace to _OUT_ | Normal mode | ♣ |\n\n ⚑ &nbsp; Required argument.<br>\n✦ &nbsp; Possible values: `none`, `bag`, `bag-and-archive`.<br>\n♢ &nbsp; Possible values: `uncompressed-zip`, `compressed-zip`, `uncompressed-tar`, `compressed-tar`.<br>\n♣ &nbsp; To write to the console, use the character `-` as the value of _OUT_; otherwise, _OUT_ must be the name of a file where the output should be written.\n\n### Additional notes and considerations\n\nBeware that some file systems have limitations on the number of subdirectories that can be created, which directly impacts how many record subdirectories can be created by this program.  `eprints2bags` attempts to guess the type of file system where the output is being written and warn the user if the number of records exceeds known maximums (e.g., 31,998 subdirectories for the [ext2](https://en.wikipedia.org/wiki/Ext2) and [ext3](https://en.wikipedia.org/wiki/Ext3) file systems in Linux), but its internal table does not include all possible file systems and it may not be able to warn users in all cases.  If you encounter file system limitations on the number of subdirectories that can be created, a simple solution is to manually create an intermediate level of subdirectories under the destination given to `-o`, then run `eprints2bags` multiple times, each time indicating a different subrange of records to the `-i` option and a different subdirectory to `-o`, such that the number of records written to each destination is below the file system's limit on total number of directories.\n\nIt is also noteworthy that hitting a server for tens of thousands of records and documents in rapid succession is likely to draw suspicion from server administrators.  By default, this program inserts a small delay between record fetches (adjustable using the `-y` command-line option), which may be too short in some cases.  Setting the value to 0 is also possible, but might get you blocked or banned from an institution's servers.\n\n\n⁇ Getting help and support\n--------------------------\n\nIf you find an issue, please submit it in [the GitHub issue tracker](https://github.com/caltechlibrary/eprints2bags/issues) for this repository.\n\n\n★ Do you like it?\n------------------\n\nIf you like this software, don't forget to give this repo a star on GitHub to show your support!\n\n\n♬ Contributing &mdash; info for developers\n------------------------------------------\n\nWe would be happy to receive your help and participation with enhancing `eprints2bags`!  Please visit the [guidelines for contributing](CONTRIBUTING.md) for some tips on getting started.\n\n\n❡ History\n--------\n\nIn 2018, [Betsy Coles](https://github.com/betsycoles) wrote a [set of Perl scripts](https://github.com/caltechlibrary/eprints2dpn) and described a workflow for bagging contents from Caltech's EPrints-based [Caltech Collection of Open Digital Archives (CODA)](https://libguides.caltech.edu/CODA) server.  The original code is still available in this repository in the [historical](historical) subdirectory.  In late 2018, Mike Hucka sought to expand the functionality of the original tools and generalize them in anticipation of having to stop using DPN because on 2018-12-04, DPN announced they were shutting down. Thus was born _Eprints2bags_.\n\n\n☺︎ Acknowledgments\n-----------------------\n\nThe [vector artwork](https://thenounproject.com/search/?q=bag&i=1002779) of a bag used as a logo for this repository was created by [StoneHub](https://thenounproject.com/stonehub/) from the Noun Project.  It is licensed under the Creative Commons [CC-BY 3.0](https://creativecommons.org/licenses/by/3.0/) license.\n\nWe thank the following people for suggestions and ideas that led to improvements in `eprints2bags`: Robert Doiel, Tom Morrell, Tommy Keswick.\n\n`eprints2bags` makes use of numerous open-source packages, without which it would have been effectively impossible to develop `eprints2bags` with the resources we had.  We want to acknowledge this debt.  In alphabetical order, the packages are:\n\n* [bagit](https://github.com/LibraryOfCongress/bagit-python) &ndash; Python library for working with [BagIt](https://tools.ietf.org/html/draft-kunze-bagit-17) style packages\n* [colorama](https://github.com/tartley/colorama) &ndash; makes ANSI escape character sequences work under MS Windows terminals\n* [dateparser](https://pypi.org/project/dateparser/) &ndash; parse dates in almost any string format\n* [humanize](https://github.com/jmoiron/humanize) &ndash; helps write large numbers in a more human-readable form\n* [ipdb](https://github.com/gotcha/ipdb) &ndash; the IPython debugger\n* [keyring](https://github.com/jaraco/keyring) &ndash; access the system keyring service from Python\n* [lxml](https://lxml.de) &ndash; an XML parsing library for Python\n* [plac](http://micheles.github.io/plac/) &ndash; a command line argument parser\n* [psutil](https://github.com/giampaolo/psutil) &ndash; process and system utilities\n* [requests](http://docs.python-requests.org) &ndash; an HTTP library for Python\n* [setuptools](https://github.com/pypa/setuptools) &ndash; library for `setup.py`\n* [termcolor](https://pypi.org/project/termcolor/) &ndash; ANSI color formatting for output in terminal\n* [twine](https://github.com/pypa/twine/) &ndash; Twine is a utility for publishing Python packages on PyPI\n* [urllib3](https://urllib3.readthedocs.io/en/latest/) &ndash; HTTP client library for Python\n* [validators](https://github.com/kvesteri/validators) &ndash; data validation package for Python\n\n☮︎ Copyright and license\n---------------------\n\nCopyright (C) 2019, Caltech.  This software is freely distributed under a BSD/MIT type license.  Please see the [LICENSE](LICENSE) file for more information.\n\n<div align=\"center\">\n  <a href=\"https://www.caltech.edu\">\n    <img width=\"100\" height=\"100\" src=\"https://raw.githubusercontent.com/caltechlibrary/eprints2bags/master/.graphics/caltech-round.png\">\n  </a>\n</div>\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/caltechlibrary/eprints2bags", "keywords": "EPrints,archives,preservation,BagIt", "license": "BSD 3-clause", "maintainer": "", "maintainer_email": "", "name": "eprints2bags", "package_url": "https://pypi.org/project/eprints2bags/", "platform": "", "project_url": "https://pypi.org/project/eprints2bags/", "project_urls": {"Bug Tracker": "https://github.com/caltechlibrary/eprints2bags/issues", "Homepage": "https://github.com/caltechlibrary/eprints2bags", "Source Code": "https://github.com/caltechlibrary/eprints2bags"}, "release_url": "https://pypi.org/project/eprints2bags/1.9.1/", "requires_dist": ["bagit (>=1.7.0)", "colorama (>=0.3.0)", "dateparser (>=0.7.0)", "humanize (>=0.5.1)", "keyring (>=12.2.0)", "keyrings.alt (>=3.1)", "lxml (>=4.2.5)", "plac (>=1.0.0)", "psutil (>=5.4)", "requests (>=2.19.1)", "termcolor (>=1.1.0)", "urllib3 (>=1.23)", "validators (>=0.12.3)"], "requires_python": ">=3.5", "summary": "Download EPrints content and save it in BagIt-format bags.", "version": "1.9.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>eprints2bags<img align=\"right\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/b13f249b71dc10cafc7eabc0a35860088a3dfeaf/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f63616c746563686c6962726172792f657072696e747332626167732f6d61737465722f2e67726170686963732f657072696e747332626167732e706e67\" width=\"100px\"></h1>\n<p>A program for downloading records from an EPrints server and creating <a href=\"https://en.wikipedia.org/wiki/BagIt\" rel=\"nofollow\">BagIt</a> packages out of them.</p>\n<p><em>Authors</em>:      <a href=\"http://github.com/mhucka\" rel=\"nofollow\">Michael Hucka</a>, <a href=\"https://github.com/betsycoles\" rel=\"nofollow\">Betsy Coles</a><br>\n<em>Repository</em>:   <a href=\"https://github.com/caltechlibrary/eprints2bags\" rel=\"nofollow\">https://github.com/caltechlibrary/eprints2bags</a><br>\n<em>License</em>:      BSD/MIT derivative – see the <a href=\"LICENSE\" rel=\"nofollow\">LICENSE</a> file for more information</p>\n<p><a href=\"https://choosealicense.com/licenses/bsd-3-clause\" rel=\"nofollow\"><img alt=\"License\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/67035b11180e878dcdd60de3f21f469ef7a9d59c/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f4c6963656e73652d425344253230332d2d436c617573652d626c75652e7376673f7374796c653d666c61742d737175617265\"></a>\n<a href=\"http://shields.io\" rel=\"nofollow\"><img alt=\"Python\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/57bc80bc664752ae1b636dd9d077246aeffd04c5/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f507974686f6e2d332e352b2d627269676874677265656e2e7376673f7374796c653d666c61742d737175617265\"></a>\n<a href=\"https://github.com/caltechlibrary/eprints2bags/releases\" rel=\"nofollow\"><img alt=\"Latest release\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/5cc22afc1b3612f471c9101e738741812fe99f99/68747470733a2f2f696d672e736869656c64732e696f2f6769746875622f762f72656c656173652f63616c746563686c6962726172792f657072696e747332626167732e7376673f7374796c653d666c61742d73717561726526636f6c6f723d623434653838\"></a>\n<a href=\"https://data.caltech.edu/records/1310\" rel=\"nofollow\"><img alt=\"DOI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2117f9b197213583deb9a620f59b3c1c8d04e840/687474703a2f2f696d672e736869656c64732e696f2f62616467652f444f492d31302e323230303225323025326625323044312e313331302d626c75652e7376673f7374796c653d666c61742d737175617265\"></a>\n<a href=\"https://pypi.org/project/eprints2bags/\" rel=\"nofollow\"><img alt=\"PyPI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/0fea6dec80d938afbe984901408b61a94dffe0cb/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f657072696e747332626167732e7376673f7374796c653d666c61742d73717561726526636f6c6f723d726564\"></a></p>\n<h2>🏁 Log of recent changes</h2>\n<p><em>Version 1.9.1</em>: This release updates the README file to explain how to install from PyPI, and fixes some internal files related to producing releases on PyPI.</p>\n<p><em>Version 1.9.0</em>: This release fixes a couple of minor bugs.  It also changes the debug flag letter to be <code>-@</code> and changes the behavior of the flag; these changes are not backward-compatible.  Internally, it changes the setup process to use <code>setup.cfg</code> and uses a new way to get package metadata.  Finally, this version is being made available from <a href=\"https://pypi.org/project/eprints2bags\" rel=\"nofollow\">PyPI</a>.</p>\n<p>The file <a href=\"CHANGES.md\" rel=\"nofollow\">CHANGES</a> contains a more complete change log that includes information about previous releases.</p>\n<h2>Table of Contents</h2>\n<ul>\n<li><a href=\"#-introduction\" rel=\"nofollow\">Introduction</a></li>\n<li><a href=\"#-installation-instructions\" rel=\"nofollow\">Installation instructions</a></li>\n<li><a href=\"#%EF%B8%8E-using-eprints2bags\" rel=\"nofollow\">Using eprints2bags</a></li>\n<li><a href=\"#-getting-help-and-support\" rel=\"nofollow\">Getting help and support</a></li>\n<li><a href=\"#-do-you-like-it\" rel=\"nofollow\">Do you like it?</a></li>\n<li><a href=\"#-contributing--info-for-developers\" rel=\"nofollow\">Contributing — info for developers</a></li>\n<li><a href=\"#-history\" rel=\"nofollow\">History</a></li>\n<li><a href=\"#%EF%B8%8E-acknowledgments\" rel=\"nofollow\">Acknowledgments</a></li>\n<li><a href=\"#%EF%B8%8E-copyright-and-license\" rel=\"nofollow\">Copyright and license</a></li>\n</ul>\n<h2>☀ Introduction</h2>\n<p>Materials in EPrints must be extracted before they can be moved to a long-term preservation system or dark archive.  <em>Eprints2bags</em> is a self-contained program that encapsulates the processes needed to download records and documents from EPrints, bundle up individual records in <a href=\"https://en.wikipedia.org/wiki/BagIt\" rel=\"nofollow\">BagIt</a> packages, and create single-file archives (e.g., in <a href=\"https://en.wikipedia.org/wiki/Zip_(file_format)\" rel=\"nofollow\">ZIP</a> format) of each bag.  The program is written in Python 3 and works over a network using an EPrints server's REST API.</p>\n<h2>✺ Installation instructions</h2>\n<p>The instructions below assume you have a Python interpreter installed on your computer; if that's not the case, please first install Python and familiarize yourself with running Python programs on your system.</p>\n<p>On <strong>Linux</strong>, <strong>macOS</strong>, and <strong>Windows</strong> operating systems, you should be able to install <code>eprints2bags</code> with <a href=\"https://pip.pypa.io/en/stable/installing/\" rel=\"nofollow\">pip</a>.  If you don't have the <code>pip</code> package or are uncertain if you do, first run the following command in a terminal command line interpreter:</p>\n<pre><code>sudo python3 -m ensurepip\n</code></pre>\n<p>Then, to install <code>eprints2bags</code> from the Python package repository, run the following command:</p>\n<pre><code>python3 -m pip install eprints2bags --user --upgrade\n</code></pre>\n<p>As an alternative to getting it from PyPI, you can instruct <code>pip</code> to install <code>eprints2bags</code> directly from the GitHub repository:</p>\n<pre>python3 -m pip install git+https@github.com:caltechlibrary/eprints2bags.git --user --upgrade\n</pre>\n<p>On Linux and macOS systems, assuming that the installation proceeds normally, you should end up with a program called <code>eprints2bags</code> in a location normally searched by your terminal shell for commands.</p>\n<h2>▶︎ Using Eprints2bags</h2>\n<p>For help with usage at any time, run <code>eprints2bags</code> with the option <code>-h</code> (or <code>/h</code> on Windows).</p>\n<p><code>eprints2bags</code> contacts an EPrints REST server whose network API is accessible at the URL given by the command-line option <code>-a</code> (or <code>/a</code> on Windows).  A typical EPrints server URL has the form <code>https://somename.yourinstitution.edu/rest</code>.  <strong>This program will automatically add <code>/eprint</code> to the URL path given</strong>, so omit that part of the URL in the value given to <code>-a</code>.  The <code>-a</code> (or <code>/a</code>) option is required; the program cannot infer the server address on its own.</p>\n<h3><em>Specifying which records to get</em></h3>\n<p>The EPrints records to be written will be limited to the list of EPrints numbers found in the file given by the option <code>-i</code> (or <code>/i</code> on Windows).  If no <code>-i</code> option is given, this program will download all the contents available at the given EPrints server.  The value of <code>-i</code> can also be one or more integers separated by commas (e.g., <code>-i 54602,54604</code>), or a range of numbers separated by a dash (e.g., <code>-i 1-100</code>, which is interpreted as the list of numbers 1, 2, ..., 100 inclusive), or some combination thereof.  In those cases, the records written will be limited to those numbered.</p>\n<p>If the <code>-l</code> option (or <code>/l</code> on Windows) is given, the records will be additionally filtered to return only those whose last-modified date/time stamp is no older than the given date/time description.  Valid descriptors are those accepted by the Python <a href=\"https://pypi.org/project/dateparser/\" rel=\"nofollow\">dateparser</a> library.  Make sure to enclose descriptions within single or double quotes.  Examples:</p>\n<pre><code>eprints2bags -l \"2 weeks ago\" -a ....\neprints2bags -l \"2014-08-29\"  -a ....\neprints2bags -l \"12 Dec 2014\" -a ....\neprints2bags -l \"July 4, 2013\" -a ....\n</code></pre>\n<p>If the <code>-s</code> option (or <code>/s</code> on Windows) is given, the records will also be filtered to include only those whose <code>&lt;eprint_status&gt;</code> element value is one of the listed status codes.  Comparisons are done in a case-insensitive manner.  Putting a caret character (<code>^</code>) in front of the status (or status list) negates the sense, so that <code>eprints2bags</code> will only keep those records whose <code>&lt;eprint_status&gt;</code> value is <em>not</em> among those given.  Examples:</p>\n<pre><code>eprints2bags -s archive -a ...\neprints2bags -s ^inbox,buffer,deletion -a ...\n</code></pre>\n<p>Both lastmod and status filering are done after the <code>-i</code> argument is processed.</p>\n<p>By default, if an error occurs when requesting a record from the EPrints server, it stops execution of <code>eprints2bags</code>.  Common causes of errors include missing records implied by the arguments to <code>-i</code>, missing files associated with a given record, and files inaccessible due to permissions errors.  If the option <code>-k</code> (or <code>/k</code> on Windows) is given, <code>eprints2bags</code> will attempt to keep going upon encountering missing records, or missing files within records, or similar errors.  Option <code>-k</code> is particularly useful when giving a range of numbers with the <code>-i</code> option, as it is common for EPrints records to be updated or deleted and gaps to be left in the numbering.  (Running without <code>-i</code> will skip over gaps in the numbering because the available record numbers will be obtained directly from the server, which is unlike the user providing a list of record numbers that may or may not exist on the server.  However, even without <code>-i</code>, errors may still result from permissions errors or other causes.)</p>\n<h3><em>Specifying what to do with the records</em></h3>\n<p>This program writes its output in subdirectories under the directory given by the command-line option <code>-o</code> (or <code>/o</code> on Windows).  If the directory does not exist, this program will create it.  If no <code>-o</code> is given, the current directory where <code>eprints2bags</code> is running is used.  Whatever the destination is, <code>eprints2bags</code> will create subdirectories in the destination, with each subdirectory named according to the EPrints record number (e.g., <code>/path/to/output/43</code>, <code>/path/to/output/44</code>, <code>/path/to/output/45</code>, ...).  If the <code>-n</code> option (<code>/n</code> on Windows) is given, the subdirectory names are changed to have the form <em>NAME-NUMBER</em>_ where <em>NAME</em> is the text string provided to the <code>-n</code> option and the <em>NUMBER</em> is the EPrints number for a given entry (meaning, <code>/path/to/output/NAME-43</code>, <code>/path/to/output/NAME-44</code>, <code>/path/to/output/NAME-45</code>, ...).</p>\n<p>Each directory will contain an <a href=\"https://wiki.eprints.org/w/XML_Export_Format\" rel=\"nofollow\">EPrints XML</a> file and additional document file(s) associated with the EPrints record in question.  Documents associated with each record will be fetched over the network.  The list of documents for each record is determined from XML file, in the <code>&lt;documents&gt;</code> element.  Certain EPrints internal documents such as <code>indexcodes.txt</code> and preview images are ignored.</p>\n<p>By default, each record and associated files downloaded from EPrints will be placed in a directory structure that follows the <a href=\"https://en.wikipedia.org/wiki/BagIt\" rel=\"nofollow\">BagIt</a> specification, and then this bag will then be put into its own single-file archive.  The default archive file format is <a href=\"https://en.wikipedia.org/wiki/Zip_(file_format)\" rel=\"nofollow\">ZIP</a> with compression turned off (see next paragraph).  Option <code>-b</code> (<code>/b</code> on Windows) can be used to change this behavior.  This option takes a keyword value; possible values are <code>none</code>, <code>bag</code> and <code>bag-and-archive</code>, with the last being the default.  Value <code>none</code> will cause <code>eprints2bags</code> to leave the downloaded record content in individual directories without bagging or archiving, and value <code>bag</code> will cause <code>eprints2bags</code> to create BagIt bags but not single-file archives from the results.  Everything will be left in the output directory (the location given by the <code>-o</code> or <code>/o</code> option).  Note that creating bags is a destructive operation: it replaces the individual directories of each record with a restructured directory corresponding to the BagIt format.</p>\n<p>The type of archive made when <code>bag-and-archive</code> mode is used for the <code>-b</code> option can be changed using the option <code>-t</code> (or <code>/t</code> on Windows).  The possible values are: <code>compressed-zip</code>, <code>uncompressed-zip</code>, <code>compressed-tar</code>, and <code>uncompressed-tar</code>.  As mentioned above, the default is <code>uncompressed-zip</code> (used if no <code>-t</code> option is given).  <a href=\"https://en.wikipedia.org/wiki/Zip_(file_format)\" rel=\"nofollow\">ZIP</a> is the default because it is more widely recognized and supported than <a href=\"https://en.wikipedia.org/wiki/Tar_(computing)\" rel=\"nofollow\">tar</a> format, and <em>uncompressed</em> ZIP is used because file corruption is generally more damaging to a compressed archive than an uncompressed one.  Since the main use case for <code>eprints2bags</code> is to archive contents for long-term storage, avoiding compression seems safer.</p>\n<p>The ZIP archive file will be written with a text comment describing the contents of the archive.  This comment can be viewed by ZIP utilities (e.g., using <code>zipinfo -z</code> on Unix/Linux and macOS).  The following is an example of a comment and the information it contains:</p>\n<pre><code>~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\nAbout this archive file:\n\nThis is an archive of a file directory organized in BagIt v1.0 format.\nThe bag contains the content from the EPrints record located at\nhttp://resolver.caltech.edu/CaltechAUTHORS:SHIjfm98\n\nThe software used to create this archive file was:\neprints2bags version 1.3.1 &lt;https://github.com/caltechlibrary/eprints2bags&gt;\n\nThe following is the metadata contained in bag-info.txt:\nBag-Software-Agent: bagit.py v1.7.0 &lt;https://github.com/LibraryOfCongress/bagit-python&gt;\nBagging-Date: 2018-12-13\nExternal-Description: Archive of EPrints record and document files\nExternal-Identifier: http://resolver.caltech.edu/CaltechAUTHORS:SHIjfm98\nInternal-Sender-Identifier: https://authors.library.caltech.edu/id/eprint/355\nPayload-Oxum: 4646541.2\n~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~ ~\n</code></pre>\n<p>Archive comments are a feature of the <a href=\"https://en.wikipedia.org/wiki/Zip_(file_format)\" rel=\"nofollow\">ZIP</a> file format and not available with <a href=\"https://en.wikipedia.org/wiki/Tar_(computing)\" rel=\"nofollow\">tar</a>.</p>\n<p>Finally, the overall collection of EPrints records (whether the records are bagged and archived, or just bagged, or left as-is) can optionally be itself put into a bag and/or put in a ZIP archive.  This behavior can be changed with the option <code>-e</code> (<code>/e</code> on Windows).  Like <code>-b</code>, this option takes the possible values <code>none</code>, <code>bag</code>, and <code>bag-and-archive</code>.  The default is <code>none</code>.  If the value <code>bag</code> is used, a top-level bag containing the individual EPrints bags is created out of the output directory (the location given by the <code>-o</code> option); if the value <code>bag-and-archive</code> is used, the bag is also put into a single-file archive.  (In other words, the result will be a ZIP archive of a bag whose data directory contains other ZIP archives of bags.)  For safety, <code>eprints2bags</code> will refuse to do <code>bag</code> or <code>bag-and-archive</code> unless a separate output directory is given via the <code>-o</code> option; otherwise, this would restructure the current directory where <code>eprints2bags</code> is running – with potentially unexpected or even catastrophic results.  (Imagine if the current directory were the user's home directory!)</p>\n<p>Generating checksum values can be a time-consuming operation for large bags.  By default, during the bagging step, <code>eprints2bags</code> will use a number of processes equal to one-half of the available CPUs on the computer.  The number of processes can be changed using the option <code>-c</code> (or <code>/c</code> on Windows).</p>\n<p>The use of separate options for the different stages provides some flexibility in choosing the final output.  For example,</p>\n<pre><code>eprints2bags --bag-action none --end-action bag-and-archive\n</code></pre>\n<p>will create a ZIP archive containing a single bag directory whose <code>data/</code> subdirectory contains the set of (unbagged) EPrints records retrieved by <code>eprints2bags</code> from the server.</p>\n<h3><em>Server credentials</em></h3>\n<p>Downloading documents usually requires supplying a user login and password to the EPrints server.  By default, this program uses the operating system's keyring/keychain functionality to get a user name and password.  If the information does not exist from a previous run of <code>eprints2bags</code>, it will query the user interactively for the user name and password, and unless the <code>-K</code> argument (<code>/K</code> on Windows) is given, store them in the user's keyring/keychain so that it does not have to ask again in the future.  It is also possible to supply the information directly on the command line using the <code>-u</code> and <code>-p</code> options (or <code>/u</code> and <code>/p</code> on Windows), but this is discouraged because it is insecure on multiuser computer systems.</p>\n<p>If a given EPrints server does not require a user name and password, do not use <code>-u</code> or <code>-p</code> and leave the name and password blank when prompted for them by <code>eprints2bags</code>.  Empty user name and password are allowed values.</p>\n<p>To reset the user name and password (e.g., if a mistake was made the last time and the wrong credentials were stored in the keyring/keychain system), add the <code>-R</code> (or <code>/R</code> on Windows) command-line argument to a command.  When <code>eprints2bags</code> is run with this option, it will query for the user name and password again even if an entry already exists in the keyring or keychain.</p>\n<h3><em>Other options</em></h3>\n<p><code>eprints2bags</code> produces color-coded diagnostic output as it runs, by default.  However, some terminals or terminal configurations may make it hard to read the text with colors, so <code>eprints2bags</code> offers the <code>-C</code> option (<code>/C</code> on Windows) to turn off colored output.</p>\n<p>If given the <code>-@</code> argument (<code>/@</code> on Windows), this program will output a detailed trace of what it is doing, and will also drop into a debugger upon the occurrence of any errors.  The debug trace will be written to the given destination, which can be a dash character (<code>-</code>) to indicate console output, or a file path.</p>\n<p>If given the <code>-V</code> option (<code>/V</code> on Windows), this program will print the version and other information, and exit without doing anything else.</p>\n<h3><em>Basic usage examples</em></h3>\n<p>Running <code>eprints2bags</code> then consists of invoking the program like any other program on your system.  The following is a simple example showing how to get a single record (#85447) from Caltech's <a href=\"https://libguides.caltech.edu/CODA\" rel=\"nofollow\">CODA</a> EPrints server (with user name and password blanked out here for security reasons):</p>\n<pre><code># eprints2bags -o /tmp/eprints -i 85447 -a https://authors.library.caltech.edu/rest -u XXXXX -p XXXXX\n\nBeginning to process 1 EPrints entry.\nOutput will be written under directory \"/tmp/eprints\"\n======================================================================\nGetting record with id 85447\nCreating /tmp/eprints/85447\nDownloading https://authors.library.caltech.edu/85447/1/1-s2.0-S0164121218300517-main.pdf\nMaking bag out of /tmp/eprints/85447\nCreating tarball /tmp/eprints/85447.tgz\n======================================================================\nDone. Wrote 1 EPrints record to /tmp/eprints/.\n</code></pre>\n<p>The following is a screen cast to give a sense for what it's like to run <code>eprints2bags</code>. Click on the following image:</p>\n<p align=\"center\">\n  <a href=\"https://asciinema.org/a/kUg8werG8YPobFKgPhsJnHwBi\" rel=\"nofollow\"><img alt=\"Screencast of simple eprints2bags demo\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/5828d7b5d56f226d119ccd951ade60b6c571ba2f/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f63616c746563686c6962726172792f657072696e747332626167732f6d61737465722f2e67726170686963732f657072696e747332626167732d61736369696e656d612e706e67\" width=\"80%\"></a>\n</p>\n<h3><em>Summary of command-line options</em></h3>\n<p>The following table summarizes all the command line options available. (Note: on Windows computers, <code>/</code> must be used as the prefix character instead of <code>-</code>):</p>\n<table>\n<thead>\n<tr>\n<th>Short     </th>\n<th>Long form opt  </th>\n<th>Meaning</th>\n<th>Default</th>\n<th></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>-a</code><em>A</em></td>\n<td><code>--api-url</code><em>A</em></td>\n<td>Use <em>A</em> as the server's REST API URL</td>\n<td></td>\n<td>⚑</td>\n</tr>\n<tr>\n<td><code>-b</code><em>B</em></td>\n<td><code>--bag-action</code><em>B</em></td>\n<td>Do <em>B</em> with each record directory</td>\n<td>Bag and archive</td>\n<td>✦</td>\n</tr>\n<tr>\n<td><code>-c</code><em>C</em></td>\n<td><code>--processes</code><em>C</em></td>\n<td>No. of processes during bag creation</td>\n<td>½ the number of CPUs</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-e</code><em>E</em></td>\n<td><code>--end-action</code><em>E</em></td>\n<td>Do <em>E</em> with the entire set of records</td>\n<td>Nothing</td>\n<td>✦</td>\n</tr>\n<tr>\n<td><code>-i</code><em>I</em></td>\n<td><code>--id-list</code><em>I</em></td>\n<td>Records to get (can be a file name)</td>\n<td>Fetch all records from the server</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-k</code></td>\n<td><code>--keep-going</code></td>\n<td>Don't count missing records as an error</td>\n<td>Stop if encounter missing record</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-l</code><em>L</em></td>\n<td><code>--lastmod</code><em>L</em></td>\n<td>Filter by last-modified date/time</td>\n<td>Don't filter by date/time</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-n</code><em>N</em></td>\n<td><code>--name-base</code><em>N</em></td>\n<td>Prefix directory names with <em>N</em></td>\n<td>Use record number only</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-o</code><em>O</em></td>\n<td><code>--output-dir</code><em>O</em></td>\n<td>Write outputs in the directory <em>O</em></td>\n<td>Write in the current directory</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-q</code></td>\n<td><code>--quiet</code></td>\n<td>Don't print info messages while working</td>\n<td>Be chatty while working</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-s</code><em>S</em></td>\n<td><code>--status</code><em>S</em></td>\n<td>Filter by status(s) in <em>S</em></td>\n<td>Don't filter by status</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-u</code><em>U</em></td>\n<td><code>--user</code><em>U</em></td>\n<td>User name for EPrints server login</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td><code>-p</code><em>P</em></td>\n<td><code>--password</code><em>U</em></td>\n<td>Password for EPrints proxy login</td>\n<td></td>\n<td></td>\n</tr>\n<tr>\n<td><code>-t</code><em>T</em></td>\n<td><code>--arch-type</code><em>T</em></td>\n<td>Use archive type <em>T</em></td>\n<td>Uncompressed ZIP</td>\n<td>♢</td>\n</tr>\n<tr>\n<td><code>-y</code><em>Y</em></td>\n<td><code>--delay</code><em>Y</em></td>\n<td>Pause <em>Y</em> ms between getting records</td>\n<td>100 milliseconds</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-C</code></td>\n<td><code>--no-color</code></td>\n<td>Don't color-code the output</td>\n<td>Use colors in the terminal output</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-K</code></td>\n<td><code>--no-keyring</code></td>\n<td>Don't use a keyring/keychain</td>\n<td>Store login info in keyring</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-R</code></td>\n<td><code>--reset</code></td>\n<td>Reset user login &amp; password used</td>\n<td>Reuse previous credentials</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-V</code></td>\n<td><code>--version</code></td>\n<td>Print program version info and exit</td>\n<td>Do other actions instead</td>\n<td></td>\n</tr>\n<tr>\n<td><code>-@</code><em>OUT</em></td>\n<td><code>--debug</code><em>OUT</em></td>\n<td>Debugging mode; write trace to <em>OUT</em></td>\n<td>Normal mode</td>\n<td>♣</td>\n</tr></tbody></table>\n<p>⚑   Required argument.<br>\n✦   Possible values: <code>none</code>, <code>bag</code>, <code>bag-and-archive</code>.<br>\n♢   Possible values: <code>uncompressed-zip</code>, <code>compressed-zip</code>, <code>uncompressed-tar</code>, <code>compressed-tar</code>.<br>\n♣   To write to the console, use the character <code>-</code> as the value of <em>OUT</em>; otherwise, <em>OUT</em> must be the name of a file where the output should be written.</p>\n<h3>Additional notes and considerations</h3>\n<p>Beware that some file systems have limitations on the number of subdirectories that can be created, which directly impacts how many record subdirectories can be created by this program.  <code>eprints2bags</code> attempts to guess the type of file system where the output is being written and warn the user if the number of records exceeds known maximums (e.g., 31,998 subdirectories for the <a href=\"https://en.wikipedia.org/wiki/Ext2\" rel=\"nofollow\">ext2</a> and <a href=\"https://en.wikipedia.org/wiki/Ext3\" rel=\"nofollow\">ext3</a> file systems in Linux), but its internal table does not include all possible file systems and it may not be able to warn users in all cases.  If you encounter file system limitations on the number of subdirectories that can be created, a simple solution is to manually create an intermediate level of subdirectories under the destination given to <code>-o</code>, then run <code>eprints2bags</code> multiple times, each time indicating a different subrange of records to the <code>-i</code> option and a different subdirectory to <code>-o</code>, such that the number of records written to each destination is below the file system's limit on total number of directories.</p>\n<p>It is also noteworthy that hitting a server for tens of thousands of records and documents in rapid succession is likely to draw suspicion from server administrators.  By default, this program inserts a small delay between record fetches (adjustable using the <code>-y</code> command-line option), which may be too short in some cases.  Setting the value to 0 is also possible, but might get you blocked or banned from an institution's servers.</p>\n<h2>⁇ Getting help and support</h2>\n<p>If you find an issue, please submit it in <a href=\"https://github.com/caltechlibrary/eprints2bags/issues\" rel=\"nofollow\">the GitHub issue tracker</a> for this repository.</p>\n<h2>★ Do you like it?</h2>\n<p>If you like this software, don't forget to give this repo a star on GitHub to show your support!</p>\n<h2>♬ Contributing — info for developers</h2>\n<p>We would be happy to receive your help and participation with enhancing <code>eprints2bags</code>!  Please visit the <a href=\"CONTRIBUTING.md\" rel=\"nofollow\">guidelines for contributing</a> for some tips on getting started.</p>\n<h2>❡ History</h2>\n<p>In 2018, <a href=\"https://github.com/betsycoles\" rel=\"nofollow\">Betsy Coles</a> wrote a <a href=\"https://github.com/caltechlibrary/eprints2dpn\" rel=\"nofollow\">set of Perl scripts</a> and described a workflow for bagging contents from Caltech's EPrints-based <a href=\"https://libguides.caltech.edu/CODA\" rel=\"nofollow\">Caltech Collection of Open Digital Archives (CODA)</a> server.  The original code is still available in this repository in the <a href=\"historical\" rel=\"nofollow\">historical</a> subdirectory.  In late 2018, Mike Hucka sought to expand the functionality of the original tools and generalize them in anticipation of having to stop using DPN because on 2018-12-04, DPN announced they were shutting down. Thus was born <em>Eprints2bags</em>.</p>\n<h2>☺︎ Acknowledgments</h2>\n<p>The <a href=\"https://thenounproject.com/search/?q=bag&amp;i=1002779\" rel=\"nofollow\">vector artwork</a> of a bag used as a logo for this repository was created by <a href=\"https://thenounproject.com/stonehub/\" rel=\"nofollow\">StoneHub</a> from the Noun Project.  It is licensed under the Creative Commons <a href=\"https://creativecommons.org/licenses/by/3.0/\" rel=\"nofollow\">CC-BY 3.0</a> license.</p>\n<p>We thank the following people for suggestions and ideas that led to improvements in <code>eprints2bags</code>: Robert Doiel, Tom Morrell, Tommy Keswick.</p>\n<p><code>eprints2bags</code> makes use of numerous open-source packages, without which it would have been effectively impossible to develop <code>eprints2bags</code> with the resources we had.  We want to acknowledge this debt.  In alphabetical order, the packages are:</p>\n<ul>\n<li><a href=\"https://github.com/LibraryOfCongress/bagit-python\" rel=\"nofollow\">bagit</a> – Python library for working with <a href=\"https://tools.ietf.org/html/draft-kunze-bagit-17\" rel=\"nofollow\">BagIt</a> style packages</li>\n<li><a href=\"https://github.com/tartley/colorama\" rel=\"nofollow\">colorama</a> – makes ANSI escape character sequences work under MS Windows terminals</li>\n<li><a href=\"https://pypi.org/project/dateparser/\" rel=\"nofollow\">dateparser</a> – parse dates in almost any string format</li>\n<li><a href=\"https://github.com/jmoiron/humanize\" rel=\"nofollow\">humanize</a> – helps write large numbers in a more human-readable form</li>\n<li><a href=\"https://github.com/gotcha/ipdb\" rel=\"nofollow\">ipdb</a> – the IPython debugger</li>\n<li><a href=\"https://github.com/jaraco/keyring\" rel=\"nofollow\">keyring</a> – access the system keyring service from Python</li>\n<li><a href=\"https://lxml.de\" rel=\"nofollow\">lxml</a> – an XML parsing library for Python</li>\n<li><a href=\"http://micheles.github.io/plac/\" rel=\"nofollow\">plac</a> – a command line argument parser</li>\n<li><a href=\"https://github.com/giampaolo/psutil\" rel=\"nofollow\">psutil</a> – process and system utilities</li>\n<li><a href=\"http://docs.python-requests.org\" rel=\"nofollow\">requests</a> – an HTTP library for Python</li>\n<li><a href=\"https://github.com/pypa/setuptools\" rel=\"nofollow\">setuptools</a> – library for <code>setup.py</code></li>\n<li><a href=\"https://pypi.org/project/termcolor/\" rel=\"nofollow\">termcolor</a> – ANSI color formatting for output in terminal</li>\n<li><a href=\"https://github.com/pypa/twine/\" rel=\"nofollow\">twine</a> – Twine is a utility for publishing Python packages on PyPI</li>\n<li><a href=\"https://urllib3.readthedocs.io/en/latest/\" rel=\"nofollow\">urllib3</a> – HTTP client library for Python</li>\n<li><a href=\"https://github.com/kvesteri/validators\" rel=\"nofollow\">validators</a> – data validation package for Python</li>\n</ul>\n<h2>☮︎ Copyright and license</h2>\n<p>Copyright (C) 2019, Caltech.  This software is freely distributed under a BSD/MIT type license.  Please see the <a href=\"LICENSE\" rel=\"nofollow\">LICENSE</a> file for more information.</p>\n<div>\n  <a href=\"https://www.caltech.edu\" rel=\"nofollow\">\n    <img height=\"100\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/c0cc8c2ac8dea00f25a044ba77c9cdeabf1c57e4/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f63616c746563686c6962726172792f657072696e747332626167732f6d61737465722f2e67726170686963732f63616c746563682d726f756e642e706e67\" width=\"100\">\n  </a>\n</div>\n\n          </div>"}, "last_serial": 6108615, "releases": {"1.9.1": [{"comment_text": "", "digests": {"md5": "9064aad2ee5844675551fb86c0552fd4", "sha256": "83b8b08d92aec9258da70492ea7b81dc000ff785ea4d06b328435b723d4d8c52"}, "downloads": -1, "filename": "eprints2bags-1.9.1-py3-none-any.whl", "has_sig": false, "md5_digest": "9064aad2ee5844675551fb86c0552fd4", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 40277, "upload_time": "2019-11-09T22:09:16", "upload_time_iso_8601": "2019-11-09T22:09:16.561180Z", "url": "https://files.pythonhosted.org/packages/1f/06/170060df275f331537c26d8b24c5d73109f49aa07c6d3b1257d8cc9de855/eprints2bags-1.9.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "674dcc9a4a43d6fc8b8c1a77643cee87", "sha256": "f18d56df6c280aa49125d1719557933756ca958b61295932b658f59a7645452e"}, "downloads": -1, "filename": "eprints2bags-1.9.1.tar.gz", "has_sig": false, "md5_digest": "674dcc9a4a43d6fc8b8c1a77643cee87", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 42141, "upload_time": "2019-11-09T22:09:19", "upload_time_iso_8601": "2019-11-09T22:09:19.291120Z", "url": "https://files.pythonhosted.org/packages/8d/11/caecebce80e63b7b919e4f213d5f48df5a865bd6c8a5815fba282f1ec985/eprints2bags-1.9.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "9064aad2ee5844675551fb86c0552fd4", "sha256": "83b8b08d92aec9258da70492ea7b81dc000ff785ea4d06b328435b723d4d8c52"}, "downloads": -1, "filename": "eprints2bags-1.9.1-py3-none-any.whl", "has_sig": false, "md5_digest": "9064aad2ee5844675551fb86c0552fd4", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5", "size": 40277, "upload_time": "2019-11-09T22:09:16", "upload_time_iso_8601": "2019-11-09T22:09:16.561180Z", "url": "https://files.pythonhosted.org/packages/1f/06/170060df275f331537c26d8b24c5d73109f49aa07c6d3b1257d8cc9de855/eprints2bags-1.9.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "674dcc9a4a43d6fc8b8c1a77643cee87", "sha256": "f18d56df6c280aa49125d1719557933756ca958b61295932b658f59a7645452e"}, "downloads": -1, "filename": "eprints2bags-1.9.1.tar.gz", "has_sig": false, "md5_digest": "674dcc9a4a43d6fc8b8c1a77643cee87", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 42141, "upload_time": "2019-11-09T22:09:19", "upload_time_iso_8601": "2019-11-09T22:09:19.291120Z", "url": "https://files.pythonhosted.org/packages/8d/11/caecebce80e63b7b919e4f213d5f48df5a865bd6c8a5815fba282f1ec985/eprints2bags-1.9.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:45:55 2020"}