{"info": {"author": "Benjamin C. Jantzen", "author_email": "bjantzen@vt.edu", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Intended Audience :: Science/Research", "License :: OSI Approved :: MIT License", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Topic :: Scientific/Engineering :: Artificial Intelligence"], "description": "====================\nThe EUGENE Project\n====================\n\n--------------------------------------------------------------------------------\nA toolbox for detecting, comparing, and characterizing dynamical kinds\n--------------------------------------------------------------------------------\n\nOverview\n====================\n\nThis software implements a variety of algorithms for assessing whether two or more systems belong to the same \"dynamical kind.\" A system is a set of causally related variables. A dynamical kind is a class of systems that, while not identical in their causal structure, are sufficiently similar to support a rich set of generalizations across the class. \n\nThe primary algorithm in this first release is a method for comparing the dynamical symmetries of two systems in order to determine whether they belong to the same dynamical kind. (This algorithm is implemented by methods in the compare.py module.) Note that this comparison is accomplished without any prior knowledge of the detailed dynamics of either system.\n\nTheoretical Background\n========================================\nThe algorithms for discovering and exploiting dynamical kinds that comprise the EUGENE project are motivated by a theory of dynamical kinds as \"natural kinds\" -- categories that support inductive learning. For a detailed account of this theory and its motivation, see Jantzen, B. (2015) “Projection, symmetry, and natural kinds,” *Synthese* **192** (11): 3617-3646. You can find the paper at the publisher's site `here <https://link.springer.com/article/10.1007%2Fs11229-014-0637-5>`_, or as a preprint from the author's `webpage <http://www.ratiocination.org/wp-content/uploads/2014/08/Jantzen__Projection_Symmetry_and_Natural_Kinds.pdf>`_.\n\nDetection of dynamical kinds can be applied to a wide variety of problems in system identification, model validation, and automated scientific discovery. For an overview of some of these as well as a detailed characterization of the algorithms in this package, see https://arxiv.org/abs/1612.04933.\n\nUsage\n====================\nThe primary algorithm in this tool set is the ``CompareModels`` method in the ``compare`` module. (Please note that the ``categorize`` module is only a place holder -- the method it implements is both inefficient and inconsistent). The purpose of the ``CompareModels`` method is to decide whether symmetry curves sampled from two different systems are the same, and thus whether the two systems belong to the same dynamical kind. \n\nTo decide whether two systems belong to the same dynamical kind using the ``CompareModels`` method, it is necessary to first acquire one or more samples of the symmetries characteristic of each system. These are stored in objects of the class ``SymModel``. The most important attribute of these objects is the ``_sampled_data`` attribute. It consists of a list of *m* representations of a symmetry -- generally a vector function from the set of \"target variables\" to itself. Each element of ``_sampled_data`` is thus a list of length *v*, where *v* is number of target variables. For each of these lists, the elements are numpy nd-arrays with shape (*p*, *v* + 1), where *p* is the number of points sampled. The first *v* columns give the value of all target variables in the untransformed system, while the last gives the value of one of the target variables to which that state is mapped in the transformed system.\n\n``SymModel`` objects can be built directly, but to build them automatically from data acquired by sampling virtual physical systems, this is the procedure to follow:\n\n1. For each system, build sensor and actuator objects (both are provided in the ``connect`` module for a variety of virtual systems, which are in turn to be found in the ``virtual_sys`` module).\n\n2. For each system, assemble the sensors and actuators into an ``interface`` object.\n\n3. Pass each interface object to the ``TimeSampleData`` method in order to acquire time-series data that is stored in ``DataFrame`` objects.\n\n4. Initialize ``SymModel`` objects with the resulting data frames (the conversion to symmetry models takes place during initialization).\n\n5. Finally, pass the pair of ``SymModel`` objects to the ``CompareModels`` method. The method returns 1 if the systems are of different dynamical kinds (if the symmetry models are different) and 0 otherwise.\n\nThe best way to gain familiarity with the procedure is to examine the demonstration methods discussed in the next section.\n\nDemos\n--------------------\nWe have packaged a demonstration module, LotkaVolterraDemo, with the core algorithms. The demo builds a couple of virtual systems whose dynamics are described by the competitive Lotka-Volterra equations for two species. The demo builds corresponding sensors and actuators for probing these systems, then collects data and invokes the core comparison algorithm to determine whether or not the systems belong to the same dynamical kind.\n\nContributors\n====================\nThe project PI and principal code author is `Dr. Benjamin C. Jantzen <mailto:bjantzen@vt.edu>`_. His homepage and research blog can be found at http://www.ratiocination.org.\n\nThe following people have contributed ideas or code to this, or earlier versions of the EUGENE Project software:\n\n- Colin Shea-Blymyer\n- Joseph Mehr\n- JP Gazewood\n- Jack Parker\n- Alex Karvelis\n\nThe PI would also like to thank Teddy Seidenfeld for helpful suggestions regarding the comparison algorithm. While any errors or deficiencies in the algorithm are solely those of the EUGENE team, Teddy's suggestions greatly influenced the final design.\n\nFunding and Support\n====================\nThis material is based upon work supported by the National Science Foundation under Grant No. 1454190. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the National Science Foundation.\n\nThe project maintainers would also like to thank the Philosophy Department of Virginia Tech for their material and intellectual support.\n\nA Note on the Name\n====================\nYou may be wondering why this is called the \"EUGENE\" project. There are two reasons:\n\n(1) The name honors physicist Eugene Wigner, whose ideas about the role of symmetry in physical theory have played a central role in motivating the theory of dynamical kinds underlying the discovery algorithms implemented in this package. (Of course, that's not to say that we believe Wigner would have endorsed out approach -- we make no such claim.)\n\n(2) The name \"Eugene\" is derived from the ancient Greek word *eugenes*, meaning \"well-born\". This notion is doubly significant for our project. First, the methods of automated discovery pursued here are consonant with a view of scientific methodology and general epistemology that takes seriously the origins of a hypothesis -- if a hypothesis originates via a sound method of generation (if it is \"well-born\") then it is well-justified. Second, this is the first release of software implementing the first generation of algorithms constructed for the EUGENE project. We hope it is *eugenes*.\n\n\n", "description_content_type": null, "docs_url": null, "download_url": "https://github.com/jantzen/eugene", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://www.ratiocination.org/", "keywords": "discovery kinds dynamical system-identification natural-kinds", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "eugene", "package_url": "https://pypi.org/project/eugene/", "platform": "", "project_url": "https://pypi.org/project/eugene/", "project_urls": {"Download": "https://github.com/jantzen/eugene", "Homepage": "http://www.ratiocination.org/"}, "release_url": "https://pypi.org/project/eugene/0.1.0/", "requires_dist": ["numpy", "scipy"], "requires_python": "", "summary": "Tools for automated scientific discovery", "version": "0.1.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <div id=\"overview\">\n<h2>Overview</h2>\n<p>This software implements a variety of algorithms for assessing whether two or more systems belong to the same “dynamical kind.” A system is a set of causally related variables. A dynamical kind is a class of systems that, while not identical in their causal structure, are sufficiently similar to support a rich set of generalizations across the class.</p>\n<p>The primary algorithm in this first release is a method for comparing the dynamical symmetries of two systems in order to determine whether they belong to the same dynamical kind. (This algorithm is implemented by methods in the compare.py module.) Note that this comparison is accomplished without any prior knowledge of the detailed dynamics of either system.</p>\n</div>\n<div id=\"theoretical-background\">\n<h2>Theoretical Background</h2>\n<p>The algorithms for discovering and exploiting dynamical kinds that comprise the EUGENE project are motivated by a theory of dynamical kinds as “natural kinds” – categories that support inductive learning. For a detailed account of this theory and its motivation, see Jantzen, B. (2015) “Projection, symmetry, and natural kinds,” <em>Synthese</em> <strong>192</strong> (11): 3617-3646. You can find the paper at the publisher’s site <a href=\"https://link.springer.com/article/10.1007%2Fs11229-014-0637-5\" rel=\"nofollow\">here</a>, or as a preprint from the author’s <a href=\"http://www.ratiocination.org/wp-content/uploads/2014/08/Jantzen__Projection_Symmetry_and_Natural_Kinds.pdf\" rel=\"nofollow\">webpage</a>.</p>\n<p>Detection of dynamical kinds can be applied to a wide variety of problems in system identification, model validation, and automated scientific discovery. For an overview of some of these as well as a detailed characterization of the algorithms in this package, see <a href=\"https://arxiv.org/abs/1612.04933\" rel=\"nofollow\">https://arxiv.org/abs/1612.04933</a>.</p>\n</div>\n<div id=\"usage\">\n<h2>Usage</h2>\n<p>The primary algorithm in this tool set is the <tt>CompareModels</tt> method in the <tt>compare</tt> module. (Please note that the <tt>categorize</tt> module is only a place holder – the method it implements is both inefficient and inconsistent). The purpose of the <tt>CompareModels</tt> method is to decide whether symmetry curves sampled from two different systems are the same, and thus whether the two systems belong to the same dynamical kind.</p>\n<p>To decide whether two systems belong to the same dynamical kind using the <tt>CompareModels</tt> method, it is necessary to first acquire one or more samples of the symmetries characteristic of each system. These are stored in objects of the class <tt>SymModel</tt>. The most important attribute of these objects is the <tt>_sampled_data</tt> attribute. It consists of a list of <em>m</em> representations of a symmetry – generally a vector function from the set of “target variables” to itself. Each element of <tt>_sampled_data</tt> is thus a list of length <em>v</em>, where <em>v</em> is number of target variables. For each of these lists, the elements are numpy nd-arrays with shape (<em>p</em>, <em>v</em> + 1), where <em>p</em> is the number of points sampled. The first <em>v</em> columns give the value of all target variables in the untransformed system, while the last gives the value of one of the target variables to which that state is mapped in the transformed system.</p>\n<p><tt>SymModel</tt> objects can be built directly, but to build them automatically from data acquired by sampling virtual physical systems, this is the procedure to follow:</p>\n<ol>\n<li>For each system, build sensor and actuator objects (both are provided in the <tt>connect</tt> module for a variety of virtual systems, which are in turn to be found in the <tt>virtual_sys</tt> module).</li>\n<li>For each system, assemble the sensors and actuators into an <tt>interface</tt> object.</li>\n<li>Pass each interface object to the <tt>TimeSampleData</tt> method in order to acquire time-series data that is stored in <tt>DataFrame</tt> objects.</li>\n<li>Initialize <tt>SymModel</tt> objects with the resulting data frames (the conversion to symmetry models takes place during initialization).</li>\n<li>Finally, pass the pair of <tt>SymModel</tt> objects to the <tt>CompareModels</tt> method. The method returns 1 if the systems are of different dynamical kinds (if the symmetry models are different) and 0 otherwise.</li>\n</ol>\n<p>The best way to gain familiarity with the procedure is to examine the demonstration methods discussed in the next section.</p>\n<div id=\"demos\">\n<h3>Demos</h3>\n<p>We have packaged a demonstration module, LotkaVolterraDemo, with the core algorithms. The demo builds a couple of virtual systems whose dynamics are described by the competitive Lotka-Volterra equations for two species. The demo builds corresponding sensors and actuators for probing these systems, then collects data and invokes the core comparison algorithm to determine whether or not the systems belong to the same dynamical kind.</p>\n</div>\n</div>\n<div id=\"contributors\">\n<h2>Contributors</h2>\n<p>The project PI and principal code author is <a href=\"mailto:bjantzen%40vt.edu\">Dr<span>.</span> Benjamin C<span>.</span> Jantzen</a>. His homepage and research blog can be found at <a href=\"http://www.ratiocination.org\" rel=\"nofollow\">http://www.ratiocination.org</a>.</p>\n<p>The following people have contributed ideas or code to this, or earlier versions of the EUGENE Project software:</p>\n<ul>\n<li>Colin Shea-Blymyer</li>\n<li>Joseph Mehr</li>\n<li>JP Gazewood</li>\n<li>Jack Parker</li>\n<li>Alex Karvelis</li>\n</ul>\n<p>The PI would also like to thank Teddy Seidenfeld for helpful suggestions regarding the comparison algorithm. While any errors or deficiencies in the algorithm are solely those of the EUGENE team, Teddy’s suggestions greatly influenced the final design.</p>\n</div>\n<div id=\"funding-and-support\">\n<h2>Funding and Support</h2>\n<p>This material is based upon work supported by the National Science Foundation under Grant No. 1454190. Any opinions, findings, and conclusions or recommendations expressed in this material are those of the author(s) and do not necessarily reflect the views of the National Science Foundation.</p>\n<p>The project maintainers would also like to thank the Philosophy Department of Virginia Tech for their material and intellectual support.</p>\n</div>\n<div id=\"a-note-on-the-name\">\n<h2>A Note on the Name</h2>\n<p>You may be wondering why this is called the “EUGENE” project. There are two reasons:</p>\n<ol>\n<li>The name honors physicist Eugene Wigner, whose ideas about the role of symmetry in physical theory have played a central role in motivating the theory of dynamical kinds underlying the discovery algorithms implemented in this package. (Of course, that’s not to say that we believe Wigner would have endorsed out approach – we make no such claim.)</li>\n<li>The name “Eugene” is derived from the ancient Greek word <em>eugenes</em>, meaning “well-born”. This notion is doubly significant for our project. First, the methods of automated discovery pursued here are consonant with a view of scientific methodology and general epistemology that takes seriously the origins of a hypothesis – if a hypothesis originates via a sound method of generation (if it is “well-born”) then it is well-justified. Second, this is the first release of software implementing the first generation of algorithms constructed for the EUGENE project. We hope it is <em>eugenes</em>.</li>\n</ol>\n</div>\n\n          </div>"}, "last_serial": 2682562, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "ee381a30fbbcec5ee236bab08209d668", "sha256": "4a6be0cd413dc3ddbbdca6d92d48fa300924880a8ffe6b35929e38123a0da325"}, "downloads": -1, "filename": "eugene-0.1.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "ee381a30fbbcec5ee236bab08209d668", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 29783, "upload_time": "2017-03-04T17:52:29", "upload_time_iso_8601": "2017-03-04T17:52:29.756058Z", "url": "https://files.pythonhosted.org/packages/24/4b/a121962017c8a3a1da7b2b770907eec2f53c585c478aa23d270683576c0a/eugene-0.1.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "90f37c786c213e975893b40a27d7ac89", "sha256": "0d61f06c0e9f830a3ca60eb84f3c2ca7be39576efbdb1ffddbc353cbfef6313a"}, "downloads": -1, "filename": "eugene-0.1.0.tar.gz", "has_sig": false, "md5_digest": "90f37c786c213e975893b40a27d7ac89", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23975, "upload_time": "2017-03-04T17:52:30", "upload_time_iso_8601": "2017-03-04T17:52:30.993836Z", "url": "https://files.pythonhosted.org/packages/0b/58/55ce2ab40778a383f5f115e8a6521049c14a72ad80fb44cc2ff638207ee0/eugene-0.1.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "ee381a30fbbcec5ee236bab08209d668", "sha256": "4a6be0cd413dc3ddbbdca6d92d48fa300924880a8ffe6b35929e38123a0da325"}, "downloads": -1, "filename": "eugene-0.1.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "ee381a30fbbcec5ee236bab08209d668", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 29783, "upload_time": "2017-03-04T17:52:29", "upload_time_iso_8601": "2017-03-04T17:52:29.756058Z", "url": "https://files.pythonhosted.org/packages/24/4b/a121962017c8a3a1da7b2b770907eec2f53c585c478aa23d270683576c0a/eugene-0.1.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "90f37c786c213e975893b40a27d7ac89", "sha256": "0d61f06c0e9f830a3ca60eb84f3c2ca7be39576efbdb1ffddbc353cbfef6313a"}, "downloads": -1, "filename": "eugene-0.1.0.tar.gz", "has_sig": false, "md5_digest": "90f37c786c213e975893b40a27d7ac89", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23975, "upload_time": "2017-03-04T17:52:30", "upload_time_iso_8601": "2017-03-04T17:52:30.993836Z", "url": "https://files.pythonhosted.org/packages/0b/58/55ce2ab40778a383f5f115e8a6521049c14a72ad80fb44cc2ff638207ee0/eugene-0.1.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:45:21 2020"}