{"info": {"author": "Carsen Stringer", "author_email": "carsen.stringer@gmail.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: GNU General Public License v3 (GPLv3)", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# FaceMap <img src=\"facemap/mouse.png\" width=\"200\" title=\"lilmouse\" alt=\"lilmouse\" align=\"right\" vspace = \"50\">\n\nGUI for processing videos of rodents, implemented in python and MATLAB. Works for grayscale and RGB movies. Can process multi-camera videos. Some example movies to test the GUI on are located [here](https://drive.google.com/open?id=1cRWCDl8jxWToz50dCX1Op-dHcAC-ttto). You can save the output from both the python and matlab versions as a matlab file with a checkbox in the GUI (if you'd like to use the python version - it has a better GUI).\n\n# Data acquisition info\n\nIR ILLUMINATION:\n\nFor recording in darkness we use [IR illumination](https://www.amazon.com/Logisaf-Invisible-Infrared-Security-Cameras/dp/B01MQW8K7Z/ref=sr_1_12?s=security-surveillance&ie=UTF8&qid=1505507302&sr=1-12&keywords=ir+light) at 850nm, which works well with 2p imaging at 970nm and even 920nm. Depending on your needs, you might want to choose a different wavelength, which changes all the filters below as well. 950nm works just as well, and probably so does 750nm, which still outside of the visible range for rodents.  \n\nIf you want to focus the illumination on the mouse eye or face, you will need a different, more expensive system. Here is an example, courtesy of Michael Krumin from the Carandini lab: [driver](https://www.thorlabs.com/thorproduct.cfm?partnumber=LEDD1B), [power supply](https://www.thorlabs.com/newgrouppage9.cfm?objectgroup_id=1710&pn=KPS101#8865), [LED](https://www.thorlabs.com/newgrouppage9.cfm?objectgroup_id=2692&pn=M850L3#4426), [lens](https://www.thorlabs.com/newgrouppage9.cfm?objectgroup_id=259&pn=AC254-030-B#2231), and [lens tube](https://www.thorlabs.com/newgrouppage9.cfm?objectgroup_id=4109&pn=SM1V10#3389), and another [lens tube](https://www.thorlabs.com/thorproduct.cfm?partnumber=SM1L10).\n\nCAMERAS:\n\nWe use [ptgrey cameras](https://www.ptgrey.com/flea3-13-mp-mono-usb3-vision-vita-1300-camera). The software we use for simultaneous acquisition from multiple cameras is [BIAS](http://public.iorodeo.com/notes/bias/) software. A basic lens that works for zoomed out views [here](https://www.bhphotovideo.com/c/product/414195-REG/Tamron_12VM412ASIR_12VM412ASIR_1_2_4_12_F_1_2.html). To see the pupil well you might need a better zoom lens [10x here](https://www.edmundoptics.com/imaging-lenses/zoom-lenses/10x-13-130mm-fl-c-mount-close-focus-zoom-lens/#specs).\n\nFor 2p imaging, you'll need a tighter filter around 850nm so you don't see the laser shining through the mouse's eye/head, for example [this](https://www.thorlabs.de/thorproduct.cfm?partnumber=FB850-40). Depending on your lenses you'll need to figure out the right adapter(s) for such a filter. For our 10x lens above, you might need all of these:  [adapter1](https://www.edmundoptics.com/optics/optical-filters/optical-filter-accessories/M52-to-M46-Filter-Thread-Adapter/), [adapter2](https://www.thorlabs.de/thorproduct.cfm?partnumber=SM2A53), [adapter3](https://www.thorlabs.de/thorproduct.cfm?partnumber=SM2A6), [adapter4](https://www.thorlabs.de/thorproduct.cfm?partnumber=SM1L03).\n\n# Installation\n\n## PYTHON\n\nThis package only supports python 3 installed with **[Anaconda](https://www.anaconda.com/download/)**.\n\n**Linux users** run this first: `sudo apt-get install ffmpeg`\n\n### Using the environment.yml file (try this FIRST)\n\n1. Download the `environment.yml` file from the repository\n2. Open an anaconda prompt / command prompt with `conda` for **python 3** in the path\n3. Run `conda env create -f environment.yml`\n4. To activate this new environment, run `conda activate facemap`\n5. You should see `(facemap)` on the left side of the terminal line. Now run `python -m facemap` and you're all set.\n\nTo upgrade FaceMap (package [here](https://pypi.org/project/facemap/)), within the environment run:\n~~~~\npip install facemap --upgrade\n~~~~\n\n### Manual installation of dependencies\n\n1. From a command line terminal / anaconda prompt, install the video libraries: `conda install av -c conda-forge`\n2. Install other conda dependencies (they may be already installed in base anaconda but try these commands)\n~~~~\nconda install -c numba numba\nconda install -c conda-forge mkl_fft\n~~~~\n3. Install facemap and the rest of its dependencies: `pip install facemap`\n4. Now try to run `python -m facemap` and if you see missing dependencies, try to pip install them or post issues.\n\n### NEXT (EVERYONE)\n\nIf you have **big** files or if you have **frame reading errors** try the following command for [pims](http://soft-matter.github.io/pims/v0.4.1/install.html), which allows non-sequential indexing into videos:\n~~~~\npip install git+https://github.com/soft-matter/pims.git\n~~~~\nYou will need to have git installed for this.\n\n### Common issues\n\nIf you have pip issues, there might be some interaction between pre-installed dependencies and the ones FaceMap needs. First thing to try is\n~~~~\npython -m pip install --upgrade pip\n~~~~\n\n\nIf when running `python -m facemap`, you receive the error: `No module named PyQt5.sip`, then try uninstalling and reinstalling pyqt5\n~~~\npip uninstall pyqt5 pyqt5-tools\npip install pyqt5 pyqt5-tools pyqt5.sip\n~~~\n\nIf when running `python -m facemap`, you receive an error associated with **matplotlib**, try upgrading it:\n~~~\npip install matplotlib --upgrade\n~~~\n\nIf you are on Yosemite Mac OS, PyQt doesn't work, and you won't be able to install FaceMap. More recent versions of Mac OS are fine.\n\nThe software has been heavily tested on Ubuntu 18.04, and less well tested on Windows 10 and Mac OS. Please post an issue if you have installation problems. Also, try to follow the instructions that `pip` provides if more drivers are needed to run `ffmpeg` / `pims`.\n\n### Dependencies\n\nFaceMap python relies on these awesome packages:\n- [ffmpeg](https://ffmpeg.org/)\n- [pims](http://soft-matter.github.io/pims/v0.4.1/install.html)\n- [pyqtgraph](http://pyqtgraph.org/)\n- [PyQt5](http://pyqt.sourceforge.net/Docs/PyQt5/)\n- [numpy](http://www.numpy.org/) (>=1.13.0)\n- [scipy](https://www.scipy.org/)\n- [matplotlib](https://matplotlib.org/) (not for plotting (only using hsv_to_rgb function), should not conflict with PyQt5)\n\n## MATLAB\n\nThe matlab version needs to be downloaded/cloned from github (no install required). It works in Matlab 2014b and above - please submit issues if it's not working. The Image Processing Toolbox is necessary to use the GUI. For GPU functionality, the Parallel Processing Toolbox is required. If you don't have the Parallel Processing Toolbox, uncheck the box next to \"use GPU\" in the GUI before processing.\n\n### Supported movie files\n\n'.mj2','.mp4','.mkv','.avi','.mpeg','.mpg','.asf'\n\n# Start processing! *HOW TO GUI*\n\n## PYTHON\n\n<img src=\"figs/face_fast.gif\" width=\"100%\" alt=\"face gif\">\n\nRun the following command in a terminal\n```\npython -m facemap\n```\nThe following window should appear. The upper left \"file\" button loads single files, the upper middle \"folder\" button loads whole folders (from which you can select movies), and the upper right \"folder\" button loads processed files (\"_proc.npy\" files). Load a video or a group of videos (see below for file formats for simultaneous videos). The video(s) will pop up in the left side of the GUI. You can zoom in and out with the mouse wheel, and you can drag by holding down the mouse. Double-click to return to the original, full view.\n\nChoose a type of ROI to add and then click \"add ROI\" to add it to the view. The pixels in the ROI will show up in the right window (with different processing depending on the ROI type - see below). You can move it and resize the ROI anytime. You can delete the ROI with \"right-click\" and selecting \"remove\". You can change the saturation of the ROI with the upper right saturation bar. You can also just click on the ROI at any time to see what it looks like in the right view.\n\nBy default, the \"Compute multivideo SVD\" box is unchecked. If you check it, then the motion SVD is computed across ALL videos - all videos are concatenated at each timepoint, and the SVD of this matrix of ALL_PIXELS x timepoints is computed. If you have just one video acquired at a time, then it is the SVD of this video.\n\n<div align=\"center\">\n<img src=\"figs/multivideo_fast.gif\" width=\"100%\" alt=\"multivideo gif\" >\n</div>\n\nOnce processing starts, the interface will no longer be clickable and all information about processing will be in the terminal in which you opened FaceMap:\n<div align=\"center\">\n<img src=\"figs/terminal.png\" width=\"50%\" alt=\"terminal\" >\n</div>\n\nIf you want to open the GUI with a movie file specified and/or save path specified, the following command will allow this:\n~~~\npython -m facemap --movie '/home/carsen/movie.avi' --savedir '/media/carsen/SSD/'\n~~~\nNote this will only work if you only have one file that you need to load (can't have multiple in series / multiple views).\n\n\n### Batch processing (python only)\n\nLoad a video or a set of videos and draw your ROIs and choose your processing settings. Then click **save ROIs**. This will save a *_proc.npy file in the folder in the specified **save folder**. The name of this proc file will be listed below **process batch** (this button will also activate). You can then repeat this process: load the video(s), draw ROIs, choose settings, and click **save ROIs**. Then to process all the listed *_proc.npy files click **process batch**.\n\n## MATLAB\n\nTo start the GUI, run the command `MovieGUI` in this folder. The following window should appear. After you click an ROI button and draw an area, you have to **double-click** inside the drawn box to confirm it. To compute the SVD across multiple simultaneously acquired videos you need to use the \"multivideo SVD\" options to draw ROI's on each video one at a time.\n\n<div align=\"center\">\n<img src=\"figs/GUIscreenshot.png\" width=\"80%\" alt=\"gui screenshot\" >\n</div>\n\n## Default starting folder\n\n**python**: wherever you run `python -m FaceMap`\n\n**MATLAB**: set at line 59 of MovieGUI.m (h.filepath)\n\n## File loading structure\n\nIf you choose a folder instead of a single file, it will assemble a list of all video files in that folder and also all videos 1 folder down. The MATLAB GUI will ask *\"would you like to process all movies?\"*. If you say no, then a list of movies to choose from will appear. By default the python version shows you a list of movies. If you choose no movies in the python version then it's assumed you want to process ALL of them.\n\n## Processing movies captured simultaneously (multiple camera setups)\n\nBoth GUIs will then ask *\"are you processing multiple videos taken simultaneously?\"*. If you say yes, then the script will look if across movies the **FIRST FOUR** letters of the filename vary. If the first four letters of two movies are the same, then the GUI assumed that they were acquired *sequentially* not *simultaneously*.\n\nExample file list:\n+ cam1_G7c1_1.avi\n+ cam1_G7c1_2.avi\n+ cam2_G7c1_1.avi\n+ cam2_G7c1_2.avi\n+ cam3_G7c1_1.avi\n+ cam3_G7c1_2.avi\n\n*\"are you processing multiple videos taken simultaneously?\"* ANSWER: Yes\n\nThen the GUIs assume {cam1_G7c1_1.avi, cam2_G7c1_1.avi, cam3_G7c1_1.avi} were acquired simultaneously and {cam1_G7c1_2.avi, cam2_G7c1_2.avi, cam3_G7c1_2.avi} were acquired simultaneously. They will be processed in alphabetical order (1 before 2) and the results from the videos will be concatenated in time. If one of these files was missing, then the GUI will error and you will have to choose file folders again. Also you will get errors if the files acquired at the same time aren't the same frame length (e.g. {cam1_G7c1_1.avi, cam2_G7c1_1.avi, cam3_G7c1_1.avi} should all have the same number of frames).\n\nNote: if you have many simultaneous videos / overall pixels (e.g. 2000 x 2000) you will need around 32GB of RAM to compute the full SVD motion masks.\n\n**python**: you will be able to see all the videos that were simultaneously collected at once. However, you can only draw ROIs that are within ONE video. Only the \"multivideo SVD\" is computed over all videos.\n\n**MATLAB**: after the file choosing process is over, you will see all the movies in the drop down menu (by filename). You can switch between them and inspect how well an ROI works for each of the movies.\n\n# ROI types\n\n## Pupil computation\n\nThe minimum pixel value is subtracted from the ROI. Use the saturation bar to reduce the background of the eye. The algorithm zeros out any pixels less than the saturation level (I recommend a *very* low value - so most pixels are white in the GUI).\n\nNext it finds the pixel with the largest magnitude. It draws a box around that area (1/2 the size of the ROI) and then finds the center-of-mass of that region. It then centers the box on that area. It fits a multivariate gaussian to the pixels in the box using maximum likelihood (see [pupil.py](facemap/pupil.py) or [fitMVGaus.m](matlab/utils/fitMVGaus.m)).\n\nAfter a Gaussian is fit, it zeros out pixels whose squared distance from the center (normalized by the standard deviation of the Gaussian fit) is greater than 2 * sigma^2 where sigma is set by the user in the GUI (default sigma = 2.5). It now performs the fit again with these points erased, and repeats this process 4 more times. The pupil is then defined as an ellipse sigma standard deviations away from the center-of-mass of the gaussian. This is plotted with '+' around the ellipse and with one '+' at the center.\n\nIf there are reflections on the mouse's eye, then you can draw ellipses to account for this \"corneal reflection\" (plotted in black). You can add as many of these per pupil ROI as needed. The algorithm fills in these areas of the image with the predicted values, which allows for smooth transitions between big and small pupils.\n\n<img src=\"figs/out.gif\" width=\"80%\" alt=\"pupil gif\">\n\nThis raw pupil area trace is post-processed (see [smoothPupil.m](pupil/smoothPupil.m))). The trace is median filtered with a window of 30 timeframes. At each timepoint, the difference between the raw trace and the median filtered trace is computed. If the difference at a given point exceeds half the standard deviation of the raw trace, then the raw value is replaced by the median filtered value.\n\n![pupil](/figs/pupilfilter.png?raw=true \"pupil filtering\")\n\n## Blink computation\n\nYou may want to ignore frames in which the animal is blinking if you are looking at pupil size. The blink area is the number of pixels above the saturation level that you set (all non-white pixels).\n\n\n## Motion SVD\n\nThe motion SVDs (small ROIs / multivideo) are computed on the movie downsampled in space by the spatial downsampling input box in the GUI (default 4 pixels). Note the saturation set in this window is NOT used for any processing.\n\nThe motion *M* is defined as the abs(current_frame - previous_frame), and the average motion energy across frames is computed using a subset of frames (*avgmot*) (at least 1000 frames - set at line 45 in [subsampledMean.m](matlab/subsampledMean.m) or line 183 in [process.py](facemap/process.py)). Then the singular vectors of the motion energy are computed on chunks of data, also from a subset of frames (15 chunks of 1000 frames each). Let *F* be the chunk of frames [pixels x time]. Then\n```\nuMot = [];\nfor j = 1:nchunks\n  M = abs(diff(F,1,2));\n  M = M - avgmot;\n  [u,~,~] = svd(M);\n  uMot = cat(2, uMot, u);\nend\n[uMot,~,~] = svd(uMot);\nuMotMask = normc(uMot(:, 1:500)); % keep 500 components\n```\n*uMotMask* are the motion masks that are then projected onto the video at all timepoints (done in chunks of size *nt*=500):\n```\nfor j = 1:nchunks\n  M = abs(diff(F,1,2));\n  M = M - avgmot;\n  motSVD0 = M' * uMotMask;\n  motSVD((j-1)*nt + [1:nt],:) = motSVD0;\nend\n```\nExample motion masks *uMotMask* and traces *motSVD*:\n\n<img src=\"figs/exsvds.png\" width=\"50%\" alt=\"example SVDs\">\n\nWe found that these extracted singular vectors explained up to half of the total explainable variance in neural activity in visual cortex and in other forebrain areas. See our [paper](https://science.sciencemag.org/content/364/6437/eaav7893) for more details.\n\n## Running computation\n\nThe phase-correlation between consecutive frames (in running ROI) are computed in the fourier domain (see [running.py](/facemap/running.py) or [processRunning.m](/matlab/running/processRunning.m)). The XY position of maximal correlation gives the amount of shift between the two consecutive frames. Depending on how fast the movement is frame-to-frame you may want at least a 50x50 pixel ROI to compute this.\n\n## Multivideo SVD ROIs\n\n**PYTHON**: Check box \"Compute multivideo SVD\" to compute the SVD of all pixels in all videos.\n\n**MATLAB**: You can draw areas to be included and excluded in the multivideo SVD (or single video if you only have one view). The buttons are \"area to keep\" and \"area to exclude\" and will draw blue and red boxes respectively. The union of all pixels in \"areas to include\" are used, excluding any pixels that intersect this union from \"areas to exclude\" (you can toggle between viewing the boxes and viewing the included pixels using the \"Show areas\" checkbox, see example below).\n\n<img src=\"figs/incexcareas.png\" width=\"60%\" alt=\"example areas\">\n\nThe motion energy is then computed from these non-red pixels.\n\n# Output of processing\n\nThe GUIs create one file for all videos (saved in current folder), the npy file has name \"videofile_proc.npy\" and the mat file has name \"videofile_proc.mat\".\n\n**PYTHON**:\n- **filenames**: list of lists of video filenames - each list are the videos taken simultaneously\n- **Ly**, **Lx**: list of number of pixels in Y (Ly) and X (Lx) for each video taken simultaneously\n- **sbin**: spatial bin size for motion SVDs\n- **Lybin**, **Lxbin**: list of number of pixels binned by sbin in Y (Ly) and X (Lx) for each video taken simultaneously\n- **sybin**, **sxbin**: coordinates of multivideo (for plotting/reshaping ONLY)\n- **LYbin**, **LXbin**: full-size of all videos embedded in rectangle (binned)\n- **fullSVD**: whether or not \"multivideo SVD\" is computed\n- **save_mat**: whether or not to save proc as *.mat file\n- **avgframe**: list of average frames for each video from a subset of frames (binned by sbin)\n- **avgframe_reshape**: average frame reshaped to be y-pixels x x-pixels\n- **avgmotion**: list of average motions for each video from a subset of frames (binned by sbin)\n- **avgmotion_reshape**: average motion reshaped to be y-pixels x x-pixels\n- **iframes**: array containing number of frames in each consecutive video\n- **motSVD**: list of motion SVDs - first is \"multivideo SVD\" (empty if not computed) - each is nframes x components\n- **motMask**: list of motion masks for each motion SVD - each motMask is pixels x components\n- **motMask_reshape**: motion masks reshaped to be y-pixels x x-pixels x components\n- **pupil**: list of pupil ROI outputs - each is a dict with 'area', 'area_smooth', and 'com' (center-of-mass)\n- **blink**: list of blink ROI outputs - each is nframes, the blink area on each frame\n- **running**: list of running ROI outputs - each is nframes x 2, for X and Y motion on each frame\n- **rois**: ROIs that were drawn and computed\n    - *rind*: type of ROI in number\n    - *rtype*: what type of ROI ('motion SVD', 'pupil', 'blink', 'running')\n    - *ivid*: in which video is the ROI\n    - *color*: color of ROI\n    - *yrange*: y indices of ROI\n    - *xrange*: x indices of ROI\n    - *saturation*: saturation of ROI (0-255)\n    - *pupil_sigma*: number of stddevs used to compute pupil radius (for pupil ROIs)\n    - *yrange_bin*: binned indices in y (if motion SVD)\n    - *xrange_bin*: binned indices in x (if motion SVD)\n\nNote this is a dict, so say *.item() after loading:\n```\nimport numpy as np\nproc = np.load('cam1_proc.npy').item()\n```\n\nThese *_proc.npy* files can be loaded into the GUI (and will automatically be loaded after processing). The checkboxes in the lower left allow you to view different traces from the processing.\n\n**MATLAB**:\n- **nX**,**nY**: cell arrays of number of pixels in X and Y in each video taken simultaneously\n- **sc**: spatial downsampling constant used\n- **ROI**: [# of videos x # of areas] - areas to be included for multivideo SVD (in downsampled reference)\n- **eROI**: [# of videos x # of areas] - areas to be excluded from multivideo SVD (in downsampled reference)\n- **locROI**: location of small ROIs (in order running, ROI1, ROI2, ROI3, pupil1, pupil2); in downsampled reference\n- **ROIfile**: in which movie is the small ROI\n- **plotROIs**: which ROIs are being processed (these are the ones shown on the frame in the GUI)\n- **files**: all the files you processed together\n- **npix**: array of number of pixels from each video used for multivideo SVD\n- **tpix**: array of number of pixels in each view that was used for SVD processing\n- **wpix**: cell array of which pixels were used from each video for multivideo SVD\n- **avgframe**: [sum(tpix) x 1] average frame across videos computed on a subset of frames\n- **avgmotion**: [sum(tpix) x 1] average frame across videos computed on a subset of frames\n- **motSVD**: cell array of motion SVDs [components x time] (in order: multivideo, ROI1, ROI2, ROI3)\n- **uMotMask**: cell array of motion masks [pixels x time]\n- **runSpeed**: 2D running speed computed using phase correlation [time x 2]\n- **pupil**: structure of size 2 (pupil1 and pupil2) with 3 fields: area, area_raw, and com\n- **thres**: pupil sigma used\n- **saturation**: saturation levels (array in order running, ROI1, ROI2, ROI3, pupil1, pupil2); only saturation levels for pupil1 and pupil2 are used in the processing, others are just for viewing ROIs\n\nan ROI is [1x4]: [y0 x0 Ly Lx]\n\n## Motion SVD Masks in MATLAB\n\nUse the script [plotSVDmasks.m](figs/plotSVDmasks.m) to easily view motion masks from the multivideo SVD. The motion masks from the smaller ROIs have been reshaped to be [xpixels x ypixels x components].\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/MouseLand/FaceMap", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "facemap", "package_url": "https://pypi.org/project/facemap/", "platform": "", "project_url": "https://pypi.org/project/facemap/", "project_urls": {"Homepage": "https://github.com/MouseLand/FaceMap"}, "release_url": "https://pypi.org/project/facemap/0.1.4/", "requires_dist": ["ffmpeg", "pyqtgraph", "PyQt5", "PyQt5.sip", "numpy (>=1.13.0)", "scipy", "matplotlib", "pims", "natsort"], "requires_python": "", "summary": "Processing motion SVDs of videos", "version": "0.1.4", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>FaceMap <img align=\"right\" alt=\"lilmouse\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2c1ee59c67639fa8589a633f5f0cb6a072fc2c0e/666163656d61702f6d6f7573652e706e67\" width=\"200\"></h1>\n<p>GUI for processing videos of rodents, implemented in python and MATLAB. Works for grayscale and RGB movies. Can process multi-camera videos. Some example movies to test the GUI on are located <a href=\"https://drive.google.com/open?id=1cRWCDl8jxWToz50dCX1Op-dHcAC-ttto\" rel=\"nofollow\">here</a>. You can save the output from both the python and matlab versions as a matlab file with a checkbox in the GUI (if you'd like to use the python version - it has a better GUI).</p>\n<h1>Data acquisition info</h1>\n<p>IR ILLUMINATION:</p>\n<p>For recording in darkness we use <a href=\"https://www.amazon.com/Logisaf-Invisible-Infrared-Security-Cameras/dp/B01MQW8K7Z/ref=sr_1_12?s=security-surveillance&amp;ie=UTF8&amp;qid=1505507302&amp;sr=1-12&amp;keywords=ir+light\" rel=\"nofollow\">IR illumination</a> at 850nm, which works well with 2p imaging at 970nm and even 920nm. Depending on your needs, you might want to choose a different wavelength, which changes all the filters below as well. 950nm works just as well, and probably so does 750nm, which still outside of the visible range for rodents.</p>\n<p>If you want to focus the illumination on the mouse eye or face, you will need a different, more expensive system. Here is an example, courtesy of Michael Krumin from the Carandini lab: <a href=\"https://www.thorlabs.com/thorproduct.cfm?partnumber=LEDD1B\" rel=\"nofollow\">driver</a>, <a href=\"https://www.thorlabs.com/newgrouppage9.cfm?objectgroup_id=1710&amp;pn=KPS101#8865\" rel=\"nofollow\">power supply</a>, <a href=\"https://www.thorlabs.com/newgrouppage9.cfm?objectgroup_id=2692&amp;pn=M850L3#4426\" rel=\"nofollow\">LED</a>, <a href=\"https://www.thorlabs.com/newgrouppage9.cfm?objectgroup_id=259&amp;pn=AC254-030-B#2231\" rel=\"nofollow\">lens</a>, and <a href=\"https://www.thorlabs.com/newgrouppage9.cfm?objectgroup_id=4109&amp;pn=SM1V10#3389\" rel=\"nofollow\">lens tube</a>, and another <a href=\"https://www.thorlabs.com/thorproduct.cfm?partnumber=SM1L10\" rel=\"nofollow\">lens tube</a>.</p>\n<p>CAMERAS:</p>\n<p>We use <a href=\"https://www.ptgrey.com/flea3-13-mp-mono-usb3-vision-vita-1300-camera\" rel=\"nofollow\">ptgrey cameras</a>. The software we use for simultaneous acquisition from multiple cameras is <a href=\"http://public.iorodeo.com/notes/bias/\" rel=\"nofollow\">BIAS</a> software. A basic lens that works for zoomed out views <a href=\"https://www.bhphotovideo.com/c/product/414195-REG/Tamron_12VM412ASIR_12VM412ASIR_1_2_4_12_F_1_2.html\" rel=\"nofollow\">here</a>. To see the pupil well you might need a better zoom lens <a href=\"https://www.edmundoptics.com/imaging-lenses/zoom-lenses/10x-13-130mm-fl-c-mount-close-focus-zoom-lens/#specs\" rel=\"nofollow\">10x here</a>.</p>\n<p>For 2p imaging, you'll need a tighter filter around 850nm so you don't see the laser shining through the mouse's eye/head, for example <a href=\"https://www.thorlabs.de/thorproduct.cfm?partnumber=FB850-40\" rel=\"nofollow\">this</a>. Depending on your lenses you'll need to figure out the right adapter(s) for such a filter. For our 10x lens above, you might need all of these:  <a href=\"https://www.edmundoptics.com/optics/optical-filters/optical-filter-accessories/M52-to-M46-Filter-Thread-Adapter/\" rel=\"nofollow\">adapter1</a>, <a href=\"https://www.thorlabs.de/thorproduct.cfm?partnumber=SM2A53\" rel=\"nofollow\">adapter2</a>, <a href=\"https://www.thorlabs.de/thorproduct.cfm?partnumber=SM2A6\" rel=\"nofollow\">adapter3</a>, <a href=\"https://www.thorlabs.de/thorproduct.cfm?partnumber=SM1L03\" rel=\"nofollow\">adapter4</a>.</p>\n<h1>Installation</h1>\n<h2>PYTHON</h2>\n<p>This package only supports python 3 installed with <strong><a href=\"https://www.anaconda.com/download/\" rel=\"nofollow\">Anaconda</a></strong>.</p>\n<p><strong>Linux users</strong> run this first: <code>sudo apt-get install ffmpeg</code></p>\n<h3>Using the environment.yml file (try this FIRST)</h3>\n<ol>\n<li>Download the <code>environment.yml</code> file from the repository</li>\n<li>Open an anaconda prompt / command prompt with <code>conda</code> for <strong>python 3</strong> in the path</li>\n<li>Run <code>conda env create -f environment.yml</code></li>\n<li>To activate this new environment, run <code>conda activate facemap</code></li>\n<li>You should see <code>(facemap)</code> on the left side of the terminal line. Now run <code>python -m facemap</code> and you're all set.</li>\n</ol>\n<p>To upgrade FaceMap (package <a href=\"https://pypi.org/project/facemap/\" rel=\"nofollow\">here</a>), within the environment run:</p>\n<pre><code>pip install facemap --upgrade\n</code></pre>\n<h3>Manual installation of dependencies</h3>\n<ol>\n<li>From a command line terminal / anaconda prompt, install the video libraries: <code>conda install av -c conda-forge</code></li>\n<li>Install other conda dependencies (they may be already installed in base anaconda but try these commands)</li>\n</ol>\n<pre><code>conda install -c numba numba\nconda install -c conda-forge mkl_fft\n</code></pre>\n<ol>\n<li>Install facemap and the rest of its dependencies: <code>pip install facemap</code></li>\n<li>Now try to run <code>python -m facemap</code> and if you see missing dependencies, try to pip install them or post issues.</li>\n</ol>\n<h3>NEXT (EVERYONE)</h3>\n<p>If you have <strong>big</strong> files or if you have <strong>frame reading errors</strong> try the following command for <a href=\"http://soft-matter.github.io/pims/v0.4.1/install.html\" rel=\"nofollow\">pims</a>, which allows non-sequential indexing into videos:</p>\n<pre><code>pip install git+https://github.com/soft-matter/pims.git\n</code></pre>\n<p>You will need to have git installed for this.</p>\n<h3>Common issues</h3>\n<p>If you have pip issues, there might be some interaction between pre-installed dependencies and the ones FaceMap needs. First thing to try is</p>\n<pre><code>python -m pip install --upgrade pip\n</code></pre>\n<p>If when running <code>python -m facemap</code>, you receive the error: <code>No module named PyQt5.sip</code>, then try uninstalling and reinstalling pyqt5</p>\n<pre><code>pip uninstall pyqt5 pyqt5-tools\npip install pyqt5 pyqt5-tools pyqt5.sip\n</code></pre>\n<p>If when running <code>python -m facemap</code>, you receive an error associated with <strong>matplotlib</strong>, try upgrading it:</p>\n<pre><code>pip install matplotlib --upgrade\n</code></pre>\n<p>If you are on Yosemite Mac OS, PyQt doesn't work, and you won't be able to install FaceMap. More recent versions of Mac OS are fine.</p>\n<p>The software has been heavily tested on Ubuntu 18.04, and less well tested on Windows 10 and Mac OS. Please post an issue if you have installation problems. Also, try to follow the instructions that <code>pip</code> provides if more drivers are needed to run <code>ffmpeg</code> / <code>pims</code>.</p>\n<h3>Dependencies</h3>\n<p>FaceMap python relies on these awesome packages:</p>\n<ul>\n<li><a href=\"https://ffmpeg.org/\" rel=\"nofollow\">ffmpeg</a></li>\n<li><a href=\"http://soft-matter.github.io/pims/v0.4.1/install.html\" rel=\"nofollow\">pims</a></li>\n<li><a href=\"http://pyqtgraph.org/\" rel=\"nofollow\">pyqtgraph</a></li>\n<li><a href=\"http://pyqt.sourceforge.net/Docs/PyQt5/\" rel=\"nofollow\">PyQt5</a></li>\n<li><a href=\"http://www.numpy.org/\" rel=\"nofollow\">numpy</a> (&gt;=1.13.0)</li>\n<li><a href=\"https://www.scipy.org/\" rel=\"nofollow\">scipy</a></li>\n<li><a href=\"https://matplotlib.org/\" rel=\"nofollow\">matplotlib</a> (not for plotting (only using hsv_to_rgb function), should not conflict with PyQt5)</li>\n</ul>\n<h2>MATLAB</h2>\n<p>The matlab version needs to be downloaded/cloned from github (no install required). It works in Matlab 2014b and above - please submit issues if it's not working. The Image Processing Toolbox is necessary to use the GUI. For GPU functionality, the Parallel Processing Toolbox is required. If you don't have the Parallel Processing Toolbox, uncheck the box next to \"use GPU\" in the GUI before processing.</p>\n<h3>Supported movie files</h3>\n<p>'.mj2','.mp4','.mkv','.avi','.mpeg','.mpg','.asf'</p>\n<h1>Start processing! <em>HOW TO GUI</em></h1>\n<h2>PYTHON</h2>\n<img alt=\"face gif\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2c48fe029cda04d63e2173ef91d3df8419cccf7f/666967732f666163655f666173742e676966\" width=\"100%\">\n<p>Run the following command in a terminal</p>\n<pre><code>python -m facemap\n</code></pre>\n<p>The following window should appear. The upper left \"file\" button loads single files, the upper middle \"folder\" button loads whole folders (from which you can select movies), and the upper right \"folder\" button loads processed files (\"_proc.npy\" files). Load a video or a group of videos (see below for file formats for simultaneous videos). The video(s) will pop up in the left side of the GUI. You can zoom in and out with the mouse wheel, and you can drag by holding down the mouse. Double-click to return to the original, full view.</p>\n<p>Choose a type of ROI to add and then click \"add ROI\" to add it to the view. The pixels in the ROI will show up in the right window (with different processing depending on the ROI type - see below). You can move it and resize the ROI anytime. You can delete the ROI with \"right-click\" and selecting \"remove\". You can change the saturation of the ROI with the upper right saturation bar. You can also just click on the ROI at any time to see what it looks like in the right view.</p>\n<p>By default, the \"Compute multivideo SVD\" box is unchecked. If you check it, then the motion SVD is computed across ALL videos - all videos are concatenated at each timepoint, and the SVD of this matrix of ALL_PIXELS x timepoints is computed. If you have just one video acquired at a time, then it is the SVD of this video.</p>\n<div>\n<img alt=\"multivideo gif\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/620f92b3de7c146ebac2af6748a18b740413195e/666967732f6d756c7469766964656f5f666173742e676966\" width=\"100%\">\n</div>\n<p>Once processing starts, the interface will no longer be clickable and all information about processing will be in the terminal in which you opened FaceMap:</p>\n<div>\n<img alt=\"terminal\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/d54787dc8973988351d78438d9bff4c6097f0bba/666967732f7465726d696e616c2e706e67\" width=\"50%\">\n</div>\n<p>If you want to open the GUI with a movie file specified and/or save path specified, the following command will allow this:</p>\n<pre><code>python -m facemap --movie '/home/carsen/movie.avi' --savedir '/media/carsen/SSD/'\n</code></pre>\n<p>Note this will only work if you only have one file that you need to load (can't have multiple in series / multiple views).</p>\n<h3>Batch processing (python only)</h3>\n<p>Load a video or a set of videos and draw your ROIs and choose your processing settings. Then click <strong>save ROIs</strong>. This will save a *_proc.npy file in the folder in the specified <strong>save folder</strong>. The name of this proc file will be listed below <strong>process batch</strong> (this button will also activate). You can then repeat this process: load the video(s), draw ROIs, choose settings, and click <strong>save ROIs</strong>. Then to process all the listed *_proc.npy files click <strong>process batch</strong>.</p>\n<h2>MATLAB</h2>\n<p>To start the GUI, run the command <code>MovieGUI</code> in this folder. The following window should appear. After you click an ROI button and draw an area, you have to <strong>double-click</strong> inside the drawn box to confirm it. To compute the SVD across multiple simultaneously acquired videos you need to use the \"multivideo SVD\" options to draw ROI's on each video one at a time.</p>\n<div>\n<img alt=\"gui screenshot\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/9b12508dc8c60b63bb1a6c9e1bc54c73db3844c1/666967732f47554973637265656e73686f742e706e67\" width=\"80%\">\n</div>\n<h2>Default starting folder</h2>\n<p><strong>python</strong>: wherever you run <code>python -m FaceMap</code></p>\n<p><strong>MATLAB</strong>: set at line 59 of MovieGUI.m (h.filepath)</p>\n<h2>File loading structure</h2>\n<p>If you choose a folder instead of a single file, it will assemble a list of all video files in that folder and also all videos 1 folder down. The MATLAB GUI will ask <em>\"would you like to process all movies?\"</em>. If you say no, then a list of movies to choose from will appear. By default the python version shows you a list of movies. If you choose no movies in the python version then it's assumed you want to process ALL of them.</p>\n<h2>Processing movies captured simultaneously (multiple camera setups)</h2>\n<p>Both GUIs will then ask <em>\"are you processing multiple videos taken simultaneously?\"</em>. If you say yes, then the script will look if across movies the <strong>FIRST FOUR</strong> letters of the filename vary. If the first four letters of two movies are the same, then the GUI assumed that they were acquired <em>sequentially</em> not <em>simultaneously</em>.</p>\n<p>Example file list:</p>\n<ul>\n<li>cam1_G7c1_1.avi</li>\n<li>cam1_G7c1_2.avi</li>\n<li>cam2_G7c1_1.avi</li>\n<li>cam2_G7c1_2.avi</li>\n<li>cam3_G7c1_1.avi</li>\n<li>cam3_G7c1_2.avi</li>\n</ul>\n<p><em>\"are you processing multiple videos taken simultaneously?\"</em> ANSWER: Yes</p>\n<p>Then the GUIs assume {cam1_G7c1_1.avi, cam2_G7c1_1.avi, cam3_G7c1_1.avi} were acquired simultaneously and {cam1_G7c1_2.avi, cam2_G7c1_2.avi, cam3_G7c1_2.avi} were acquired simultaneously. They will be processed in alphabetical order (1 before 2) and the results from the videos will be concatenated in time. If one of these files was missing, then the GUI will error and you will have to choose file folders again. Also you will get errors if the files acquired at the same time aren't the same frame length (e.g. {cam1_G7c1_1.avi, cam2_G7c1_1.avi, cam3_G7c1_1.avi} should all have the same number of frames).</p>\n<p>Note: if you have many simultaneous videos / overall pixels (e.g. 2000 x 2000) you will need around 32GB of RAM to compute the full SVD motion masks.</p>\n<p><strong>python</strong>: you will be able to see all the videos that were simultaneously collected at once. However, you can only draw ROIs that are within ONE video. Only the \"multivideo SVD\" is computed over all videos.</p>\n<p><strong>MATLAB</strong>: after the file choosing process is over, you will see all the movies in the drop down menu (by filename). You can switch between them and inspect how well an ROI works for each of the movies.</p>\n<h1>ROI types</h1>\n<h2>Pupil computation</h2>\n<p>The minimum pixel value is subtracted from the ROI. Use the saturation bar to reduce the background of the eye. The algorithm zeros out any pixels less than the saturation level (I recommend a <em>very</em> low value - so most pixels are white in the GUI).</p>\n<p>Next it finds the pixel with the largest magnitude. It draws a box around that area (1/2 the size of the ROI) and then finds the center-of-mass of that region. It then centers the box on that area. It fits a multivariate gaussian to the pixels in the box using maximum likelihood (see <a href=\"facemap/pupil.py\" rel=\"nofollow\">pupil.py</a> or <a href=\"matlab/utils/fitMVGaus.m\" rel=\"nofollow\">fitMVGaus.m</a>).</p>\n<p>After a Gaussian is fit, it zeros out pixels whose squared distance from the center (normalized by the standard deviation of the Gaussian fit) is greater than 2 * sigma^2 where sigma is set by the user in the GUI (default sigma = 2.5). It now performs the fit again with these points erased, and repeats this process 4 more times. The pupil is then defined as an ellipse sigma standard deviations away from the center-of-mass of the gaussian. This is plotted with '+' around the ellipse and with one '+' at the center.</p>\n<p>If there are reflections on the mouse's eye, then you can draw ellipses to account for this \"corneal reflection\" (plotted in black). You can add as many of these per pupil ROI as needed. The algorithm fills in these areas of the image with the predicted values, which allows for smooth transitions between big and small pupils.</p>\n<img alt=\"pupil gif\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/3de9666de9189f3ac2084196b5d4866b8d9182c4/666967732f6f75742e676966\" width=\"80%\">\n<p>This raw pupil area trace is post-processed (see <a href=\"pupil/smoothPupil.m\" rel=\"nofollow\">smoothPupil.m</a>)). The trace is median filtered with a window of 30 timeframes. At each timepoint, the difference between the raw trace and the median filtered trace is computed. If the difference at a given point exceeds half the standard deviation of the raw trace, then the raw value is replaced by the median filtered value.</p>\n<p><img alt=\"pupil\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/4d0189b0c463bb3744202a580827394936d876d1/2f666967732f707570696c66696c7465722e706e673f7261773d74727565\"></p>\n<h2>Blink computation</h2>\n<p>You may want to ignore frames in which the animal is blinking if you are looking at pupil size. The blink area is the number of pixels above the saturation level that you set (all non-white pixels).</p>\n<h2>Motion SVD</h2>\n<p>The motion SVDs (small ROIs / multivideo) are computed on the movie downsampled in space by the spatial downsampling input box in the GUI (default 4 pixels). Note the saturation set in this window is NOT used for any processing.</p>\n<p>The motion <em>M</em> is defined as the abs(current_frame - previous_frame), and the average motion energy across frames is computed using a subset of frames (<em>avgmot</em>) (at least 1000 frames - set at line 45 in <a href=\"matlab/subsampledMean.m\" rel=\"nofollow\">subsampledMean.m</a> or line 183 in <a href=\"facemap/process.py\" rel=\"nofollow\">process.py</a>). Then the singular vectors of the motion energy are computed on chunks of data, also from a subset of frames (15 chunks of 1000 frames each). Let <em>F</em> be the chunk of frames [pixels x time]. Then</p>\n<pre><code>uMot = [];\nfor j = 1:nchunks\n  M = abs(diff(F,1,2));\n  M = M - avgmot;\n  [u,~,~] = svd(M);\n  uMot = cat(2, uMot, u);\nend\n[uMot,~,~] = svd(uMot);\nuMotMask = normc(uMot(:, 1:500)); % keep 500 components\n</code></pre>\n<p><em>uMotMask</em> are the motion masks that are then projected onto the video at all timepoints (done in chunks of size <em>nt</em>=500):</p>\n<pre><code>for j = 1:nchunks\n  M = abs(diff(F,1,2));\n  M = M - avgmot;\n  motSVD0 = M' * uMotMask;\n  motSVD((j-1)*nt + [1:nt],:) = motSVD0;\nend\n</code></pre>\n<p>Example motion masks <em>uMotMask</em> and traces <em>motSVD</em>:</p>\n<img alt=\"example SVDs\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/60b4d7c10f5626e0f4a9fd40d91545388957548f/666967732f6578737664732e706e67\" width=\"50%\">\n<p>We found that these extracted singular vectors explained up to half of the total explainable variance in neural activity in visual cortex and in other forebrain areas. See our <a href=\"https://science.sciencemag.org/content/364/6437/eaav7893\" rel=\"nofollow\">paper</a> for more details.</p>\n<h2>Running computation</h2>\n<p>The phase-correlation between consecutive frames (in running ROI) are computed in the fourier domain (see <a href=\"/facemap/running.py\" rel=\"nofollow\">running.py</a> or <a href=\"/matlab/running/processRunning.m\" rel=\"nofollow\">processRunning.m</a>). The XY position of maximal correlation gives the amount of shift between the two consecutive frames. Depending on how fast the movement is frame-to-frame you may want at least a 50x50 pixel ROI to compute this.</p>\n<h2>Multivideo SVD ROIs</h2>\n<p><strong>PYTHON</strong>: Check box \"Compute multivideo SVD\" to compute the SVD of all pixels in all videos.</p>\n<p><strong>MATLAB</strong>: You can draw areas to be included and excluded in the multivideo SVD (or single video if you only have one view). The buttons are \"area to keep\" and \"area to exclude\" and will draw blue and red boxes respectively. The union of all pixels in \"areas to include\" are used, excluding any pixels that intersect this union from \"areas to exclude\" (you can toggle between viewing the boxes and viewing the included pixels using the \"Show areas\" checkbox, see example below).</p>\n<img alt=\"example areas\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/f10bd095f2e5d184e34bfd8fbf0655a28c902336/666967732f696e6365786361726561732e706e67\" width=\"60%\">\n<p>The motion energy is then computed from these non-red pixels.</p>\n<h1>Output of processing</h1>\n<p>The GUIs create one file for all videos (saved in current folder), the npy file has name \"videofile_proc.npy\" and the mat file has name \"videofile_proc.mat\".</p>\n<p><strong>PYTHON</strong>:</p>\n<ul>\n<li><strong>filenames</strong>: list of lists of video filenames - each list are the videos taken simultaneously</li>\n<li><strong>Ly</strong>, <strong>Lx</strong>: list of number of pixels in Y (Ly) and X (Lx) for each video taken simultaneously</li>\n<li><strong>sbin</strong>: spatial bin size for motion SVDs</li>\n<li><strong>Lybin</strong>, <strong>Lxbin</strong>: list of number of pixels binned by sbin in Y (Ly) and X (Lx) for each video taken simultaneously</li>\n<li><strong>sybin</strong>, <strong>sxbin</strong>: coordinates of multivideo (for plotting/reshaping ONLY)</li>\n<li><strong>LYbin</strong>, <strong>LXbin</strong>: full-size of all videos embedded in rectangle (binned)</li>\n<li><strong>fullSVD</strong>: whether or not \"multivideo SVD\" is computed</li>\n<li><strong>save_mat</strong>: whether or not to save proc as *.mat file</li>\n<li><strong>avgframe</strong>: list of average frames for each video from a subset of frames (binned by sbin)</li>\n<li><strong>avgframe_reshape</strong>: average frame reshaped to be y-pixels x x-pixels</li>\n<li><strong>avgmotion</strong>: list of average motions for each video from a subset of frames (binned by sbin)</li>\n<li><strong>avgmotion_reshape</strong>: average motion reshaped to be y-pixels x x-pixels</li>\n<li><strong>iframes</strong>: array containing number of frames in each consecutive video</li>\n<li><strong>motSVD</strong>: list of motion SVDs - first is \"multivideo SVD\" (empty if not computed) - each is nframes x components</li>\n<li><strong>motMask</strong>: list of motion masks for each motion SVD - each motMask is pixels x components</li>\n<li><strong>motMask_reshape</strong>: motion masks reshaped to be y-pixels x x-pixels x components</li>\n<li><strong>pupil</strong>: list of pupil ROI outputs - each is a dict with 'area', 'area_smooth', and 'com' (center-of-mass)</li>\n<li><strong>blink</strong>: list of blink ROI outputs - each is nframes, the blink area on each frame</li>\n<li><strong>running</strong>: list of running ROI outputs - each is nframes x 2, for X and Y motion on each frame</li>\n<li><strong>rois</strong>: ROIs that were drawn and computed\n<ul>\n<li><em>rind</em>: type of ROI in number</li>\n<li><em>rtype</em>: what type of ROI ('motion SVD', 'pupil', 'blink', 'running')</li>\n<li><em>ivid</em>: in which video is the ROI</li>\n<li><em>color</em>: color of ROI</li>\n<li><em>yrange</em>: y indices of ROI</li>\n<li><em>xrange</em>: x indices of ROI</li>\n<li><em>saturation</em>: saturation of ROI (0-255)</li>\n<li><em>pupil_sigma</em>: number of stddevs used to compute pupil radius (for pupil ROIs)</li>\n<li><em>yrange_bin</em>: binned indices in y (if motion SVD)</li>\n<li><em>xrange_bin</em>: binned indices in x (if motion SVD)</li>\n</ul>\n</li>\n</ul>\n<p>Note this is a dict, so say *.item() after loading:</p>\n<pre><code>import numpy as np\nproc = np.load('cam1_proc.npy').item()\n</code></pre>\n<p>These <em>_proc.npy</em> files can be loaded into the GUI (and will automatically be loaded after processing). The checkboxes in the lower left allow you to view different traces from the processing.</p>\n<p><strong>MATLAB</strong>:</p>\n<ul>\n<li><strong>nX</strong>,<strong>nY</strong>: cell arrays of number of pixels in X and Y in each video taken simultaneously</li>\n<li><strong>sc</strong>: spatial downsampling constant used</li>\n<li><strong>ROI</strong>: [# of videos x # of areas] - areas to be included for multivideo SVD (in downsampled reference)</li>\n<li><strong>eROI</strong>: [# of videos x # of areas] - areas to be excluded from multivideo SVD (in downsampled reference)</li>\n<li><strong>locROI</strong>: location of small ROIs (in order running, ROI1, ROI2, ROI3, pupil1, pupil2); in downsampled reference</li>\n<li><strong>ROIfile</strong>: in which movie is the small ROI</li>\n<li><strong>plotROIs</strong>: which ROIs are being processed (these are the ones shown on the frame in the GUI)</li>\n<li><strong>files</strong>: all the files you processed together</li>\n<li><strong>npix</strong>: array of number of pixels from each video used for multivideo SVD</li>\n<li><strong>tpix</strong>: array of number of pixels in each view that was used for SVD processing</li>\n<li><strong>wpix</strong>: cell array of which pixels were used from each video for multivideo SVD</li>\n<li><strong>avgframe</strong>: [sum(tpix) x 1] average frame across videos computed on a subset of frames</li>\n<li><strong>avgmotion</strong>: [sum(tpix) x 1] average frame across videos computed on a subset of frames</li>\n<li><strong>motSVD</strong>: cell array of motion SVDs [components x time] (in order: multivideo, ROI1, ROI2, ROI3)</li>\n<li><strong>uMotMask</strong>: cell array of motion masks [pixels x time]</li>\n<li><strong>runSpeed</strong>: 2D running speed computed using phase correlation [time x 2]</li>\n<li><strong>pupil</strong>: structure of size 2 (pupil1 and pupil2) with 3 fields: area, area_raw, and com</li>\n<li><strong>thres</strong>: pupil sigma used</li>\n<li><strong>saturation</strong>: saturation levels (array in order running, ROI1, ROI2, ROI3, pupil1, pupil2); only saturation levels for pupil1 and pupil2 are used in the processing, others are just for viewing ROIs</li>\n</ul>\n<p>an ROI is [1x4]: [y0 x0 Ly Lx]</p>\n<h2>Motion SVD Masks in MATLAB</h2>\n<p>Use the script <a href=\"figs/plotSVDmasks.m\" rel=\"nofollow\">plotSVDmasks.m</a> to easily view motion masks from the multivideo SVD. The motion masks from the smaller ROIs have been reshaped to be [xpixels x ypixels x components].</p>\n\n          </div>"}, "last_serial": 5874992, "releases": {"0.0.1": [{"comment_text": "", "digests": {"md5": "fd6f5cb5ccf528518f830fcc63d6207a", "sha256": "62946a3bb6bb88dfed39962028cad6ab911271d86fc3213d26fd638053c0b195"}, "downloads": -1, "filename": "facemap-0.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "fd6f5cb5ccf528518f830fcc63d6207a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 13971, "upload_time": "2018-11-19T16:51:25", "upload_time_iso_8601": "2018-11-19T16:51:25.788754Z", "url": "https://files.pythonhosted.org/packages/08/d5/d84b7c1dab638af7e068c71fe017bfdf9b93d527eb2c2b4e17b041d8a617/facemap-0.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5823ec74100358cf4dc8692bf9ddc9c5", "sha256": "393a55bb4cfce2619b77379e6d0f9196cc0087d977e463fe1458e94359f0f1df"}, "downloads": -1, "filename": "facemap-0.0.1.tar.gz", "has_sig": false, "md5_digest": "5823ec74100358cf4dc8692bf9ddc9c5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 13375, "upload_time": "2018-11-19T16:51:27", "upload_time_iso_8601": "2018-11-19T16:51:27.228578Z", "url": "https://files.pythonhosted.org/packages/dd/f0/f9c7b5b806341a598bece3fe0bb659f41595bfda7e0a5eb896e10e68d422/facemap-0.0.1.tar.gz", "yanked": false}], "0.0.2": [{"comment_text": "", "digests": {"md5": "9020ece3cf47a2f1f5a7dfe6d5da47fe", "sha256": "a9da63f58a92296449ebbbb862a828a9093e9d5fbe3e0debdae2d9f992219640"}, "downloads": -1, "filename": "facemap-0.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "9020ece3cf47a2f1f5a7dfe6d5da47fe", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 13968, "upload_time": "2018-11-19T16:53:21", "upload_time_iso_8601": "2018-11-19T16:53:21.504234Z", "url": "https://files.pythonhosted.org/packages/a1/11/4d3313ab4f83375b9eb828dcbec44565bb314af8bf69838b8ffb1330cbd3/facemap-0.0.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7ef5c0b0676e8c88ff1f82441899d47c", "sha256": "c8e4eaf9d8dca3dfe9f0e38e8181a13d3a6364ae17aee352b2f101877966a869"}, "downloads": -1, "filename": "facemap-0.0.2.tar.gz", "has_sig": false, "md5_digest": "7ef5c0b0676e8c88ff1f82441899d47c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 13367, "upload_time": "2018-11-19T16:53:22", "upload_time_iso_8601": "2018-11-19T16:53:22.768287Z", "url": "https://files.pythonhosted.org/packages/83/06/9522a948498561c866989130d92126eff1a1631bc17cc456b15218401340/facemap-0.0.2.tar.gz", "yanked": false}], "0.0.3": [{"comment_text": "", "digests": {"md5": "2600b5c781f052a426ca475390f7db58", "sha256": "022d0f7a172146203b9d9e22e5426308aff741d02c489a94b83ddcdc8aff455f"}, "downloads": -1, "filename": "facemap-0.0.3-py3-none-any.whl", "has_sig": false, "md5_digest": "2600b5c781f052a426ca475390f7db58", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 13977, "upload_time": "2018-11-19T17:14:45", "upload_time_iso_8601": "2018-11-19T17:14:45.797657Z", "url": "https://files.pythonhosted.org/packages/28/6c/cea78ba421950d7805fce906a7c16a77b7a9b2b63ac6ee33bd4374acb347/facemap-0.0.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a0e8167f93e6d9d7e077b6da8de3d47d", "sha256": "99d9db63e60ee1df29b78b91df20abae7ec59a31e99d8800686432dcce79e96c"}, "downloads": -1, "filename": "facemap-0.0.3.tar.gz", "has_sig": false, "md5_digest": "a0e8167f93e6d9d7e077b6da8de3d47d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 13380, "upload_time": "2018-11-19T17:14:47", "upload_time_iso_8601": "2018-11-19T17:14:47.138639Z", "url": "https://files.pythonhosted.org/packages/1d/da/67bea2460cf712313367f8ff03ad34873f2244e56bffee7dd11e5ff87c26/facemap-0.0.3.tar.gz", "yanked": false}], "0.0.4": [{"comment_text": "", "digests": {"md5": "0ef7c419b120189465f08b3b9f57dd98", "sha256": "076bfd31e4973e02315e527bcf80468b695070e9d88f6c1e7c319a2413fd4229"}, "downloads": -1, "filename": "facemap-0.0.4-py3-none-any.whl", "has_sig": false, "md5_digest": "0ef7c419b120189465f08b3b9f57dd98", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 50021, "upload_time": "2019-04-27T19:53:53", "upload_time_iso_8601": "2019-04-27T19:53:53.755271Z", "url": "https://files.pythonhosted.org/packages/72/5f/138a5155354e0dae253c018005171788703a49546a57ed02566175cbc284/facemap-0.0.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9d5a95efdc6823777d7912b945ebf38e", "sha256": "78a0fbe43e0877b1ee10e081fbc0493623e5a43cbcccadc6056fb1fb6b735a6e"}, "downloads": -1, "filename": "facemap-0.0.4.tar.gz", "has_sig": false, "md5_digest": "9d5a95efdc6823777d7912b945ebf38e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 70914, "upload_time": "2019-04-27T19:53:56", "upload_time_iso_8601": "2019-04-27T19:53:56.112350Z", "url": "https://files.pythonhosted.org/packages/d3/66/e3c40c3ff41102a6b2c3ef36691a6c108f5e19739f1bfdb4de7564785dbd/facemap-0.0.4.tar.gz", "yanked": false}], "0.0.5": [{"comment_text": "", "digests": {"md5": "32466316c7c6c9af1e8bf63630fa9f84", "sha256": "88a645947c981eebfc6bfe2d7f50e2e7a5da01f7c92172e871d83f0849bd191f"}, "downloads": -1, "filename": "facemap-0.0.5-py3-none-any.whl", "has_sig": false, "md5_digest": "32466316c7c6c9af1e8bf63630fa9f84", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 49991, "upload_time": "2019-04-28T18:35:29", "upload_time_iso_8601": "2019-04-28T18:35:29.258849Z", "url": "https://files.pythonhosted.org/packages/94/6f/bc71aaa0fd819863d4f7d6c9f7b1007eab0bb5e72e5e443a2b947a777d24/facemap-0.0.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5755578c8654e3d7f6c85d2270af7b90", "sha256": "67a5ff4418fdf8156be0477c128708982b3c514cf51fcad794d15a9311c4c24c"}, "downloads": -1, "filename": "facemap-0.0.5.tar.gz", "has_sig": false, "md5_digest": "5755578c8654e3d7f6c85d2270af7b90", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 70868, "upload_time": "2019-04-28T18:35:33", "upload_time_iso_8601": "2019-04-28T18:35:33.190954Z", "url": "https://files.pythonhosted.org/packages/e1/e9/7cdaca7e1b991f4605e0df258b89f63e1729886ff1131d98aa6e8152eb4b/facemap-0.0.5.tar.gz", "yanked": false}], "0.0.6": [{"comment_text": "", "digests": {"md5": "10f0f8b731262eb4f9d0f56c74e47733", "sha256": "168d93aa6c3b66e9f29764732762eb4f825a25d3315d042419292de41ddb554d"}, "downloads": -1, "filename": "facemap-0.0.6-py3-none-any.whl", "has_sig": false, "md5_digest": "10f0f8b731262eb4f9d0f56c74e47733", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 49993, "upload_time": "2019-04-29T14:59:01", "upload_time_iso_8601": "2019-04-29T14:59:01.933997Z", "url": "https://files.pythonhosted.org/packages/46/66/62c318df737992f0e9682790c55f0524eb5560198e8e431f0c0f2e94026e/facemap-0.0.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "012fd87473cdf8f94aacb9820e0d1b12", "sha256": "e1e40e004a7f9cd246c3d4ed1a361ccccc242459634810cdbda7b38b2530e261"}, "downloads": -1, "filename": "facemap-0.0.6.tar.gz", "has_sig": false, "md5_digest": "012fd87473cdf8f94aacb9820e0d1b12", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 70872, "upload_time": "2019-04-29T14:59:08", "upload_time_iso_8601": "2019-04-29T14:59:08.004570Z", "url": "https://files.pythonhosted.org/packages/a6/74/19b1e857e05406a8df3881ef40aa96876c436ed0d1a57c0f569e804dba3f/facemap-0.0.6.tar.gz", "yanked": false}], "0.0.7": [{"comment_text": "", "digests": {"md5": "d671db80c04a94890e9be311879f7d32", "sha256": "ff34618edbea6ac6d0be277089e484460323df319cbb1328d38cbbf196e6b1fe"}, "downloads": -1, "filename": "facemap-0.0.7-py3-none-any.whl", "has_sig": false, "md5_digest": "d671db80c04a94890e9be311879f7d32", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 52423, "upload_time": "2019-05-06T16:42:48", "upload_time_iso_8601": "2019-05-06T16:42:48.365743Z", "url": "https://files.pythonhosted.org/packages/b6/38/fdadcdc9f22e4d401e460e365511a6242a82d1e3f376aa8bac36f07531d9/facemap-0.0.7-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1ac947d8cd577e270e513af58357fd43", "sha256": "a140c1482a48b271a6f1dae3964da81b5dbcc4affe8b3faf90d65ab5d2e776e8"}, "downloads": -1, "filename": "facemap-0.0.7.tar.gz", "has_sig": false, "md5_digest": "1ac947d8cd577e270e513af58357fd43", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 73221, "upload_time": "2019-05-06T16:42:50", "upload_time_iso_8601": "2019-05-06T16:42:50.011248Z", "url": "https://files.pythonhosted.org/packages/b9/c9/dfc85d7d0d18aaa2f10e9cb1575a92e6d08933331dcf27b431313a45f106/facemap-0.0.7.tar.gz", "yanked": false}], "0.0.8": [{"comment_text": "", "digests": {"md5": "149e22c6f1f04b2c56cdbf33ea23043e", "sha256": "6d466a695ed4c0601e7c6a22d0f0e43e3dab7fa03a765e9baaa6ca7b73733666"}, "downloads": -1, "filename": "facemap-0.0.8-py3-none-any.whl", "has_sig": false, "md5_digest": "149e22c6f1f04b2c56cdbf33ea23043e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 52543, "upload_time": "2019-05-06T16:55:43", "upload_time_iso_8601": "2019-05-06T16:55:43.572364Z", "url": "https://files.pythonhosted.org/packages/4d/ce/69bb1e9b7241d537f04c30375e9f309b4efed8b0e00f10f636ca94665e52/facemap-0.0.8-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b59242a63e17308b38c7f7619b9664b4", "sha256": "b7534d3f3e215c83b1a8cbed3cf01bb503d03c7b3c8870da60b4c921a7368efb"}, "downloads": -1, "filename": "facemap-0.0.8.tar.gz", "has_sig": false, "md5_digest": "b59242a63e17308b38c7f7619b9664b4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 73469, "upload_time": "2019-05-06T16:55:45", "upload_time_iso_8601": "2019-05-06T16:55:45.204998Z", "url": "https://files.pythonhosted.org/packages/f6/cc/cbdb5acb3cca78bd05116dcc9cfac6164312139ea31509623bfb558ff916/facemap-0.0.8.tar.gz", "yanked": false}], "0.1.0": [{"comment_text": "", "digests": {"md5": "48a9b8fecccee9a260b59d5fa37a5ac0", "sha256": "6a8cc06e93531861d7044966b486f1a027a24215b212d87d2dce38c149d73b64"}, "downloads": -1, "filename": "facemap-0.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "48a9b8fecccee9a260b59d5fa37a5ac0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 46528, "upload_time": "2019-07-15T00:23:39", "upload_time_iso_8601": "2019-07-15T00:23:39.635492Z", "url": "https://files.pythonhosted.org/packages/04/69/a88961cafbf445a7d57a3d80d22c3624fab3c83c527e1fe8a45a3789a69b/facemap-0.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7f98c76ba48aa56cf2eb0ee005ec10f9", "sha256": "e908a2338c1dd7ebb3e3824f47b80b1d84b82d31694a3886abdcc9a21a93ed6f"}, "downloads": -1, "filename": "facemap-0.1.0.tar.gz", "has_sig": false, "md5_digest": "7f98c76ba48aa56cf2eb0ee005ec10f9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 68835, "upload_time": "2019-07-15T00:23:41", "upload_time_iso_8601": "2019-07-15T00:23:41.011234Z", "url": "https://files.pythonhosted.org/packages/55/6d/208a7c48210986ab8ac7017b0f37c468f4dbfcbd4fd0f7379607e9236227/facemap-0.1.0.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "dcb1ce8d451afc98837aff803adb1255", "sha256": "fae252d906d726dbabca3b281b89a41768d3b8696bb22010d1230f6b62f65bc4"}, "downloads": -1, "filename": "facemap-0.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "dcb1ce8d451afc98837aff803adb1255", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 46524, "upload_time": "2019-08-17T17:18:06", "upload_time_iso_8601": "2019-08-17T17:18:06.250400Z", "url": "https://files.pythonhosted.org/packages/bd/c6/1cb4ebf55b9931b0ff808fde08524e432b7fc1d9bb825734798d9207a72c/facemap-0.1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "de23bf55a6b83845b10ae38afa2b9cf7", "sha256": "e8b93d8de526a357d71980e9b9d7545fac79716a7f442982eb1d389581f898bd"}, "downloads": -1, "filename": "facemap-0.1.1.tar.gz", "has_sig": false, "md5_digest": "de23bf55a6b83845b10ae38afa2b9cf7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 68914, "upload_time": "2019-08-17T17:18:07", "upload_time_iso_8601": "2019-08-17T17:18:07.820296Z", "url": "https://files.pythonhosted.org/packages/0e/f0/b5adb0d86a62d28767783a529c18866ddf793f916b3548a8abe0db7c61cd/facemap-0.1.1.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "e1c29b76db3336109393301ee9ec6c3f", "sha256": "b6093b481ab88e8f1283cafcb59094ea87bdd7db3589146d9383a28954f95cf8"}, "downloads": -1, "filename": "facemap-0.1.2-py3-none-any.whl", "has_sig": false, "md5_digest": "e1c29b76db3336109393301ee9ec6c3f", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 46565, "upload_time": "2019-08-17T17:49:13", "upload_time_iso_8601": "2019-08-17T17:49:13.713732Z", "url": "https://files.pythonhosted.org/packages/6c/da/b803d1241f2ed1658ed23bf28df03d980530ec82099b553f52cfaf30c247/facemap-0.1.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4692cfb8021e46b4911220176bcef8c9", "sha256": "70a78e410657193118969deb387ee8b9500c52af4bad670ebbc399380100ed3d"}, "downloads": -1, "filename": "facemap-0.1.2.tar.gz", "has_sig": false, "md5_digest": "4692cfb8021e46b4911220176bcef8c9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 68974, "upload_time": "2019-08-17T17:49:15", "upload_time_iso_8601": "2019-08-17T17:49:15.484068Z", "url": "https://files.pythonhosted.org/packages/e6/8e/02787951e25b229b9103d85bd7d7dd8d5ce64f61ce917bafd074a78d7c31/facemap-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "bd5063033741aa6e0550873229c14505", "sha256": "5d3b932be29661d3ccc1ecdbc0a8ec9eb9469523d629333af31a0c049ed261a1"}, "downloads": -1, "filename": "facemap-0.1.3-py3-none-any.whl", "has_sig": false, "md5_digest": "bd5063033741aa6e0550873229c14505", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 66888, "upload_time": "2019-08-17T18:01:41", "upload_time_iso_8601": "2019-08-17T18:01:41.017024Z", "url": "https://files.pythonhosted.org/packages/fc/e9/8f74c701c0562d660005654c313ec79abb443996a1d874bfa98b163fabc6/facemap-0.1.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "474437dbeb27006a0a62a6215b82e3b9", "sha256": "dec34a744555c127c846b5cbd361120331dfd609108301847195d27d9982305e"}, "downloads": -1, "filename": "facemap-0.1.3.tar.gz", "has_sig": false, "md5_digest": "474437dbeb27006a0a62a6215b82e3b9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 75644, "upload_time": "2019-08-17T18:01:43", "upload_time_iso_8601": "2019-08-17T18:01:43.342016Z", "url": "https://files.pythonhosted.org/packages/28/ba/5897c1c847cb05090e60e2ef2c9a2d208536f9b48c46428f5b7560eba7c0/facemap-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "f5cb25a4d1422856cbd0244ff44a62dd", "sha256": "063953e6022e8cf6517cc438bffb08ad4f8de98bb094d0ca1f9deee4f82a007c"}, "downloads": -1, "filename": "facemap-0.1.4-py3-none-any.whl", "has_sig": false, "md5_digest": "f5cb25a4d1422856cbd0244ff44a62dd", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 66728, "upload_time": "2019-09-23T17:29:21", "upload_time_iso_8601": "2019-09-23T17:29:21.306797Z", "url": "https://files.pythonhosted.org/packages/70/a0/bb3bbbccc26e05cc7c44dbdc7a2dbd0c6e724d8c8456bda1b8d068e6d61a/facemap-0.1.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "095c96411b1ec912021ca1bd0125750e", "sha256": "300a1f94a123f87421968689cd1b5e273254bc3ab722a84274a61c7c6a6546c0"}, "downloads": -1, "filename": "facemap-0.1.4.tar.gz", "has_sig": false, "md5_digest": "095c96411b1ec912021ca1bd0125750e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 75364, "upload_time": "2019-09-23T17:29:23", "upload_time_iso_8601": "2019-09-23T17:29:23.080121Z", "url": "https://files.pythonhosted.org/packages/6e/10/c2dc62ba243e7b8e13c42819c7ec655f758d9d7b9933b61c2679cbda0408/facemap-0.1.4.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "f5cb25a4d1422856cbd0244ff44a62dd", "sha256": "063953e6022e8cf6517cc438bffb08ad4f8de98bb094d0ca1f9deee4f82a007c"}, "downloads": -1, "filename": "facemap-0.1.4-py3-none-any.whl", "has_sig": false, "md5_digest": "f5cb25a4d1422856cbd0244ff44a62dd", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 66728, "upload_time": "2019-09-23T17:29:21", "upload_time_iso_8601": "2019-09-23T17:29:21.306797Z", "url": "https://files.pythonhosted.org/packages/70/a0/bb3bbbccc26e05cc7c44dbdc7a2dbd0c6e724d8c8456bda1b8d068e6d61a/facemap-0.1.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "095c96411b1ec912021ca1bd0125750e", "sha256": "300a1f94a123f87421968689cd1b5e273254bc3ab722a84274a61c7c6a6546c0"}, "downloads": -1, "filename": "facemap-0.1.4.tar.gz", "has_sig": false, "md5_digest": "095c96411b1ec912021ca1bd0125750e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 75364, "upload_time": "2019-09-23T17:29:23", "upload_time_iso_8601": "2019-09-23T17:29:23.080121Z", "url": "https://files.pythonhosted.org/packages/6e/10/c2dc62ba243e7b8e13c42819c7ec655f758d9d7b9933b61c2679cbda0408/facemap-0.1.4.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:44:07 2020"}