{"info": {"author": "Cathal Garvey", "author_email": "cathalgarvey@cathalgarvey.me", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Environment :: Console", "Intended Audience :: Science/Research", "License :: OSI Approved :: GNU Affero General Public License v3 or later (AGPLv3+)", "Natural Language :: English", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.1", "Programming Language :: Python :: 3.2", "Programming Language :: Python :: 3.3", "Topic :: Scientific/Engineering :: Bio-Informatics", "Topic :: Utilities"], "description": "FASTAC - A FASTA Compiler\n=========================\n(C) Cathal Garvey, Licensed under the GNU Affero General Public Licence v3\n\nTwitter: @onetruecathal\n\nNeglected Blog: http://www.indiebiotech.com\n\nWhat is this?\n-------------\nThis is a \"compiler\" for FASTA files which supports markup in the original FASTA style, using semicolons, and additionally supports a number of bash-scripting-style extensions including \"macros\" such as sequence inclusion from \"libraries\", translation, basic reverse translation, and reverse complementation. Additionally, it supports metadata definition whether in the title as a large block (allowing metadata to be used in a manner that does not interfere with other FASTA-compatible tools), or inline using semicolon markup. Finally, 'throwaway' comments are permitted using the \"#\" character, which are ignored during compilation and are not entered as metadata.\n\nIn other words, it's \"yet another synthetic biology compiler\".\n\nHuh?\n----\nThe easiest way to grok my jive is to open up a bash prompt, move into the tests directory, and call \"../fastac.py testcase.fasta\", then compare the raw file to the output you see on the terminal. The raw files, including the two demo \"libraries\", make heavy use of the scripting extensions to define compound or transformed blocks, which are then imported and further transformed in the \"testcase.fasta\" file. The output, however, is standard FASTA, formed to 50 characters per line with any remaining metadata compressed into the title line.\n\nHow do I use this?\n------------------\nYou'll need to acquaint yourself with a terminal prompt such as Bash/Sh or (if you use Windows) cmd.exe. I leave that to you to figure out.\n\nThen, just call this using python3 (Linux users can just call the script directly after using chmod to set the executable flag):\n$ python3 fastac.py [fastafile]\n\nFor additional options, mostly at this point relating to the style of the output, try:\n$ python3 fastac.py --help\n\nRight now, output contains metadata in the title by default, such as the (inferred or user-defined) sequence type and any inline \";\" comments: I'll add an option to disable this in future.\n\nHow do I extend this?\n---------------------\nTo write your own \"scripts\", simply use valid multi-fasta files as \"libraries\", and then \"include\" sequences from these libraries using similar commands to those you see in the testcase.fasta file.\n\n\"Macro\" commands are invoked on their own lines within a fasta block with a \"$\" character before the macro. Macro commands have a bash-style calling syntax, with positional and optional arguments. Examples of usage are given in the testcase.fasta file.\n\nWhen a reference to a Fasta block is necessary (as with include, for example), use the title minus any metadata JSON blocks. So, a block with a title consisting of \"> LacI Amino Acid Sequence {\"type\":\"aminos\"}\" should be referred to as \"LacI Amino Acid Sequence\", with quotes. If the title has no space characters (recommended), then quotes are not needed.\n\nAvailable macros as of first upload are:\ninclude [--lib libraryfile] fasta_block_by_title\ncomplement [--lib libraryfile] fasta_block_by_title\ntranslate [--lib libraryfile] [--table table_name] fasta_block_by_title\nmutate [--lib libraryfile] fasta_block_by_title sequence_index replacement_character\ndumb_backtranslate [--lib libraryfile] [--table table_name] fasta_block_by_title\n\nAdding new macros is ~easy: Just define a function that takes a list of arguments as returned by the shlex.split() function in the Python standard library, and a FastaCompiler object (which defines the current scope for the macro, allowing libraries to recurse).\n\nYour function should return the results of whatever transforms it has been called to perform for direct inclusion in Fasta blocks in which it is called. Then add your new function to the Macros dictionary with the name it will be called by, preferably the same name as the function itself.\n\nThe easiest way to handle lists of arguments as returned by shlex.split is to define an argparse.ArgumentParser instance and call \"add_argument()\" on the argparse instance to add each argument you expect or support; check the Python Standard Library for help on how to use argparse, or mimic what I've done with the builtin Macros. Then tell your parser to parse the args list, and use the returned namespace object to get the passed argument values.\n\nThat's horrible\n---------------\nGet over it.\n\nWhy?\n----\nThere are plenty of projects to make DNA \"compilers\" that operate on a GUI-only basis, emphasising drag-and-drop design of DNA \"parts\". However, most of these are closed source, and most also function essentially as a pretty veneer on copy/paste operations. I've endeavoured to create in fastac a simple but extensible scripting language which can be enhanced easily with plugins to define new commands. Because it is written in pure python, it is also very cross-platform, portable, easy to extend, and has no closed-source dependencies.\n\nI've been meaning to write a \"compiler\" for amino acids, RNA and DNA for a while, and I have created a number of tools previously which I intend to embed in fastac as native functions, including PySplicer (which performs far more evidence-based and hopefully effective reverse translation than the stupid function I have included in fastac already), and DNAmespace, which provides a namespace-like interface to Genbank files at the genome-scale. With these tools and a bash-scripting like interface that can compile and use \"libraries\" of parts, a proper DNA \"coding environment\" will hopefully emerge.\n\nMy intention is that these tools, or their (better designed) successors, will help fill the gap between copy/paste and GUI-patina which has remained fairly untouched so far.\n\nWhat next?\n----------\nWell, PySplicer needs a rewrite or a refactor for starters, and then I plan to integrate PySplicer properly into this \"language\" to provide a real reverse translation function that might actually work.\n\nThen, I plan to integrate DNAmespace so that Genbank files can be used as Libraries, not just fasta files. This will allow richer access to genetic data such as by permitting \"imports\" of genes from entire bacterial genomes trivially.\n\nI also plan to revamp the \"macros\" system a little so that macros are defined in a separate, more easily extended, file, or perhaps are imported from all files in a directory, allowing drag/drop addition of plugins.\n\nI am happy to accept offers to extend this system provided they pass all the test cases and add useful functions. I am not interested in \"coding style\" or \"PEP8\" submissions, as I'm quite comfortable remembering the code as I have written it, thank you. :)", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://gitorious.org/fastac/fastac", "keywords": null, "license": "GNU Affero General Public License v3", "maintainer": null, "maintainer_email": null, "name": "fastac", "package_url": "https://pypi.org/project/fastac/", "platform": "any", "project_url": "https://pypi.org/project/fastac/", "project_urls": {"Download": "UNKNOWN", "Homepage": "https://gitorious.org/fastac/fastac"}, "release_url": "https://pypi.org/project/fastac/0.2/", "requires_dist": null, "requires_python": null, "summary": "Compiler for FASTA files and a FASTA-based DNA scripting language.", "version": "0.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <ol>\n<li>Cathal Garvey, Licensed under the GNU Affero General Public Licence v3</li>\n</ol>\n<p>Twitter: @onetruecathal</p>\n<p>Neglected Blog: <a href=\"http://www.indiebiotech.com\" rel=\"nofollow\">http://www.indiebiotech.com</a></p>\n<div id=\"what-is-this\">\n<h2>What is this?</h2>\n<p>This is a “compiler” for FASTA files which supports markup in the original FASTA style, using semicolons, and additionally supports a number of bash-scripting-style extensions including “macros” such as sequence inclusion from “libraries”, translation, basic reverse translation, and reverse complementation. Additionally, it supports metadata definition whether in the title as a large block (allowing metadata to be used in a manner that does not interfere with other FASTA-compatible tools), or inline using semicolon markup. Finally, ‘throwaway’ comments are permitted using the “#” character, which are ignored during compilation and are not entered as metadata.</p>\n<p>In other words, it’s “yet another synthetic biology compiler”.</p>\n</div>\n<div id=\"huh\">\n<h2>Huh?</h2>\n<p>The easiest way to grok my jive is to open up a bash prompt, move into the tests directory, and call “../fastac.py testcase.fasta”, then compare the raw file to the output you see on the terminal. The raw files, including the two demo “libraries”, make heavy use of the scripting extensions to define compound or transformed blocks, which are then imported and further transformed in the “testcase.fasta” file. The output, however, is standard FASTA, formed to 50 characters per line with any remaining metadata compressed into the title line.</p>\n</div>\n<div id=\"how-do-i-use-this\">\n<h2>How do I use this?</h2>\n<p>You’ll need to acquaint yourself with a terminal prompt such as Bash/Sh or (if you use Windows) cmd.exe. I leave that to you to figure out.</p>\n<p>Then, just call this using python3 (Linux users can just call the script directly after using chmod to set the executable flag):\n$ python3 fastac.py [fastafile]</p>\n<p>For additional options, mostly at this point relating to the style of the output, try:\n$ python3 fastac.py –help</p>\n<p>Right now, output contains metadata in the title by default, such as the (inferred or user-defined) sequence type and any inline “;” comments: I’ll add an option to disable this in future.</p>\n</div>\n<div id=\"how-do-i-extend-this\">\n<h2>How do I extend this?</h2>\n<p>To write your own “scripts”, simply use valid multi-fasta files as “libraries”, and then “include” sequences from these libraries using similar commands to those you see in the testcase.fasta file.</p>\n<p>“Macro” commands are invoked on their own lines within a fasta block with a “$” character before the macro. Macro commands have a bash-style calling syntax, with positional and optional arguments. Examples of usage are given in the testcase.fasta file.</p>\n<p>When a reference to a Fasta block is necessary (as with include, for example), use the title minus any metadata JSON blocks. So, a block with a title consisting of “&gt; LacI Amino Acid Sequence {“type”:”aminos”}” should be referred to as “LacI Amino Acid Sequence”, with quotes. If the title has no space characters (recommended), then quotes are not needed.</p>\n<p>Available macros as of first upload are:\ninclude [–lib libraryfile] fasta_block_by_title\ncomplement [–lib libraryfile] fasta_block_by_title\ntranslate [–lib libraryfile] [–table table_name] fasta_block_by_title\nmutate [–lib libraryfile] fasta_block_by_title sequence_index replacement_character\ndumb_backtranslate [–lib libraryfile] [–table table_name] fasta_block_by_title</p>\n<p>Adding new macros is ~easy: Just define a function that takes a list of arguments as returned by the shlex.split() function in the Python standard library, and a FastaCompiler object (which defines the current scope for the macro, allowing libraries to recurse).</p>\n<p>Your function should return the results of whatever transforms it has been called to perform for direct inclusion in Fasta blocks in which it is called. Then add your new function to the Macros dictionary with the name it will be called by, preferably the same name as the function itself.</p>\n<p>The easiest way to handle lists of arguments as returned by shlex.split is to define an argparse.ArgumentParser instance and call “add_argument()” on the argparse instance to add each argument you expect or support; check the Python Standard Library for help on how to use argparse, or mimic what I’ve done with the builtin Macros. Then tell your parser to parse the args list, and use the returned namespace object to get the passed argument values.</p>\n</div>\n<div id=\"that-s-horrible\">\n<h2>That’s horrible</h2>\n<p>Get over it.</p>\n</div>\n<div id=\"why\">\n<h2>Why?</h2>\n<p>There are plenty of projects to make DNA “compilers” that operate on a GUI-only basis, emphasising drag-and-drop design of DNA “parts”. However, most of these are closed source, and most also function essentially as a pretty veneer on copy/paste operations. I’ve endeavoured to create in fastac a simple but extensible scripting language which can be enhanced easily with plugins to define new commands. Because it is written in pure python, it is also very cross-platform, portable, easy to extend, and has no closed-source dependencies.</p>\n<p>I’ve been meaning to write a “compiler” for amino acids, RNA and DNA for a while, and I have created a number of tools previously which I intend to embed in fastac as native functions, including PySplicer (which performs far more evidence-based and hopefully effective reverse translation than the stupid function I have included in fastac already), and DNAmespace, which provides a namespace-like interface to Genbank files at the genome-scale. With these tools and a bash-scripting like interface that can compile and use “libraries” of parts, a proper DNA “coding environment” will hopefully emerge.</p>\n<p>My intention is that these tools, or their (better designed) successors, will help fill the gap between copy/paste and GUI-patina which has remained fairly untouched so far.</p>\n</div>\n<div id=\"what-next\">\n<h2>What next?</h2>\n<p>Well, PySplicer needs a rewrite or a refactor for starters, and then I plan to integrate PySplicer properly into this “language” to provide a real reverse translation function that might actually work.</p>\n<p>Then, I plan to integrate DNAmespace so that Genbank files can be used as Libraries, not just fasta files. This will allow richer access to genetic data such as by permitting “imports” of genes from entire bacterial genomes trivially.</p>\n<p>I also plan to revamp the “macros” system a little so that macros are defined in a separate, more easily extended, file, or perhaps are imported from all files in a directory, allowing drag/drop addition of plugins.</p>\n<p>I am happy to accept offers to extend this system provided they pass all the test cases and add useful functions. I am not interested in “coding style” or “PEP8” submissions, as I’m quite comfortable remembering the code as I have written it, thank you. :)</p>\n</div>\n\n          </div>"}, "last_serial": 791894, "releases": {"0.1": [{"comment_text": "", "digests": {"md5": "6f76d3bcce2416b34e2baa5c0dffc03f", "sha256": "5ddc8f41934305d20a293a3e4b4031fc26a8405a59b5febab08e94072a2b2fca"}, "downloads": -1, "filename": "fastac-0.1.tar.gz", "has_sig": false, "md5_digest": "6f76d3bcce2416b34e2baa5c0dffc03f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 16203, "upload_time": "2013-03-27T21:10:31", "upload_time_iso_8601": "2013-03-27T21:10:31.149486Z", "url": "https://files.pythonhosted.org/packages/94/a5/5216ce532c9a34796a3ac93dcf40b6eb69bf1c1e20f5f56d4ba37be2a952/fastac-0.1.tar.gz", "yanked": false}], "0.2": [{"comment_text": "", "digests": {"md5": "d5bb1f1c670ea71c8384249d9e02e47d", "sha256": "6a1b681ef22b43f3213f073fdd60d09b7d2bcec194272402b74d9e5f68f5df07"}, "downloads": -1, "filename": "fastac-0.2.tar.gz", "has_sig": false, "md5_digest": "d5bb1f1c670ea71c8384249d9e02e47d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27870, "upload_time": "2013-03-27T21:28:28", "upload_time_iso_8601": "2013-03-27T21:28:28.225102Z", "url": "https://files.pythonhosted.org/packages/cc/fb/a4826255c52df349e9b7198921dc761dd4618b0831c54614bbe737f8d918/fastac-0.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "d5bb1f1c670ea71c8384249d9e02e47d", "sha256": "6a1b681ef22b43f3213f073fdd60d09b7d2bcec194272402b74d9e5f68f5df07"}, "downloads": -1, "filename": "fastac-0.2.tar.gz", "has_sig": false, "md5_digest": "d5bb1f1c670ea71c8384249d9e02e47d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27870, "upload_time": "2013-03-27T21:28:28", "upload_time_iso_8601": "2013-03-27T21:28:28.225102Z", "url": "https://files.pythonhosted.org/packages/cc/fb/a4826255c52df349e9b7198921dc761dd4618b0831c54614bbe737f8d918/fastac-0.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:43:41 2020"}