{"info": {"author": "Stephen Larroque", "author_email": "lrq3000@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Console", "Framework :: IPython", "Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Operating System :: MacOS :: MacOS X", "Operating System :: Microsoft :: Windows", "Operating System :: POSIX", "Operating System :: POSIX :: BSD", "Operating System :: POSIX :: BSD :: FreeBSD", "Operating System :: POSIX :: Linux", "Operating System :: POSIX :: SunOS/Solaris", "Programming Language :: Python", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.6", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.2", "Programming Language :: Python :: 3.3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: Implementation :: PyPy", "Topic :: Software Development :: Libraries", "Topic :: Software Development :: Libraries :: Python Modules", "Topic :: Utilities"], "description": "fdict\r\n=====\r\n\r\n|PyPI-Status| |PyPI-Versions|\r\n\r\n|Build-Status| |Branch-Coverage-Status| |Codacy-Grade|\r\n\r\n|LICENCE|\r\n\r\n\r\nEasy out-of-core computing with recursive data structures in Python with a drop-in dict replacement. Just use ``sfdict()`` instead of ``dict()``, you are good to go!\r\n\r\n``fdict`` and ``sfdict`` can be initialized with a standard ``dict``:\r\n\r\n.. code:: python\r\n\r\n    from fdict import fdict, sfdict\r\n    d = fdict({'a': {'b': 1, 'c': [2, 3]}, 'd': 4})\r\n\r\n``Out: {'a/c': [2, 3], 'd': 4, 'a/b': 1}``\r\n\r\nNested dicts will be converted on-the-fly:\r\n\r\n.. code:: python\r\n\r\n    d['e'] = {'f': {'g': {'h': 5}}}\r\n\r\n``Out: {'e/f/g/h': 5, 'a/c': [2, 3], 'd': 4, 'a/b': 1}``\r\n\r\nAnd it can be converted back to a dict at any time:\r\n\r\n.. code:: python\r\n\r\n    d.to_dict_nested()\r\n\r\n``Out: {'a': {'c': [2, 3], 'b': 1}, 'e': {'f': {'g': {'h': 5}}}, 'd': 4}``\r\n\r\nTo store all items on disk (out-of-core computing), use ``sfdict``, a subclass of ``fdict`` using ``shelve`` internally:\r\n\r\n.. code:: python\r\n\r\n    # Initialize an empty database in file myshelf.db\r\n    d = sfdict(filename='myshelf.db')\r\n    d['a'] = {'b': 1, 'c': [2, 3]}\r\n    d.sync()  # synchronize all changes back to disk\r\n    d.close()  # should always close a db\r\n\r\n    # Reopen the same database\r\n    d2 = sfdict(filename='myshelf.db')\r\n    print(d2)\r\n    d2.close()\r\n\r\n``Out: {'a/b': 1, 'a/c': [2, 3]}``\r\n\r\nThe intention of this module is to provide a very easy and pythonic data structure to do out-of-core computing of very nested/recursive big data, while still having reasonably acceptable performances. Currently, no other library can do out-of-core computing of very recursive data, because they all serialize at 1st level nodes. Hence, the goal is to provide a very easy way to prototype out-of-core applications, which you can later replace with a faster datatype.\r\n\r\nHence, this module provides ``fdict()`` and ``sfdict()``, which both provide a similar interface to ``dict()`` with flattened keys for the first and out-of-core storage for the second (using native ``shelve`` library). There is no third-party dependancy.\r\n\r\nThe ``fdict()`` class provides the basic system allowing to have an internal flattened representation of a nested dict, then you can subclass it to support your favorite out-of-core library as long as it implements dict-like methods: an exemple is provided with ``sfdict()`` using ``shelve``, but you can subclass to use ``chest``, ``shove``, ``sqlite``, ``zodb``, etc.\r\n\r\nNote: if you use ``sfdict()``, do not forget to ``.sync()`` and ``.close()`` to commit the changes back to the file.\r\n\r\nAlternatives, notably based on numpy and so probably faster but with fixed dimensions, can be found in the `wendelin.core project <https://github.com/Nexedi/wendelin.core>`__, `zarr <https://github.com/alimanfoo/zarr>`__, `zict <http://zict.readthedocs.io/en/latest/>`__ and there is also `dask <https://dask.pydata.org/en/latest/>`__ for pandas dataframes.\r\n\r\nDifferences with dict\r\n----------------------------\r\n\r\nAlthough maximum compatibility was the primary goal, a different implementation of course brings differences that are unavoidable.\r\n\r\nThe primary difference is that calling `items()`, `keys()`, `values()` and `view*` methods will return all children leaves nested at any level, whereas a dict returns only the direct children. Also, by default, these methods return only leaves (non-dict objects) and not nodes, although you can override this by suppling the `nodes=True` argument.\r\n\r\nAnother difference is conflicts: you can have an item being both a leaf and a node, because there is no way to check that there is no node without walking all items (ie, using ``viewitems()``, and this method is the limitation of ``fdict`` data structure).\r\n\r\nThis also means that when assigning an item that was already assigned, nodes will NOT get replaced, but singleton will be correctly replaced. To be more explicit:\r\n\r\nThis works:\r\n\r\n.. code:: python\r\n\r\n    d = fdict({'a': 1, 'b': {'c': 2}})\r\n    d['a'] = -1\r\n    print(d)\r\n    d['a'] = {'d': 3, 'e': 4}\r\n    print(d)\r\n\r\n``{'a': -1, 'b/c': 2}``\r\n``{'a/d': 3, 'a/e': 4, 'b/c': 2}``\r\n\r\nBut this does NOT work as expected:\r\n\r\n.. code:: python\r\n\r\n    d = fdict({'a': 1, 'b': {'c': 2}})\r\n    d['b'] = -1\r\n    print(d)\r\n\r\n``{'a': 1, 'b': -1, 'b/c': 2}``\r\n\r\nA minor difference is the handling of keys: assigning an empty dict to a key will not create the key (e.g. ``d['a'] = {}`` will not create the key ``a``, it will stay inexistent until it gets assigned a non empty dict value), and assigning sub-keys that do not exist is ok without any prior parent dict creation (e.g. ``d = fdict(); d['a']['b']['c']['d']['e'] = 1`` is OK).\r\n\r\nSimilarly, walking ``keys()``, ``values()`` and ``items()`` will walk through all nested leaves at any nested level. For exploration convenience, if you want a behavior similar to ``dict`` to explore only the direct children displaying only the direct children, you can use ``viewkeys_restrict()``, ``viewitems_restrict()``, ``viewvalues_restrict()``, ``firstkey()``, ``firstitem()``, ``firstvalue()``. Note however that the walking will not be faster than walking all items (because internally that is what is being done), so you cannot optimize speed with these methods, it is only for convenience.\r\n\r\nAnother minor difference is how `pop()` and `popitem()` are handled: they will return the next leaf at any nested level, and never nodes. Thus, you cannot get the next item at a specific level, but only the next item at any nested level.\r\n\r\nPerformances\r\n--------------------\r\n\r\n``fdict`` was made with maximum compatibility with existing code using ``dict`` and with reasonable performances. That's in theory, in practice ``fdict`` are slower than ``dict`` for most purposes, except setitem and getitem if you use direct access form (eg, x['a/b/c'] instead of x['a']['b']['c']).\r\n\r\nAs such, you can expect O(1) performance just like ``dict`` for any operation on leaves (non-dict objects): getitem, setitem, delitem, eq contains. In practice, ``fdict`` is about 10x slower than ``dict`` because of class overhead and key string manipulation, for both indirect access (ie, ``x['a']['b']['c']``) and 3x slower for direct access on leaves (ie, ``x['a/b/c']``). Thus direct access form might be preferable if you want a faster set and get. This performance cost is acceptable for a quick prototype of a bigdata database, since building and retrieving items are the most common operations.\r\n\r\nThe major drawback comes when you work on nodes (nested dict objects): since all keys are flattened and on the same level, the only way to get only the children of a nested dict (aka a branch) is to walk through all keys and filter out the ones not matching the current branch. This means that any operation on nodes will be in O(n) where n is the total number of items in the whole fdict. Affected operations are: items, keys, values, view*, iter*, delitem on nodes, eq on nodes, contains on nodes.\r\n\r\nInterestingly, getitem on nodes is not affected, because we use a lazy approach: getting a nested dict will not build anything, it will just spawn a new fdict with a different filtering rootpath. Nothing gets evaluated, until you either attain a leaf (in this case we return the non-dict object value) or you use an operation on node such as items(). Keep in mind that any nested fdict will share the same internal flattened dict, so any nested fdict will also have access to all items at any level!\r\n\r\nThis was done by design: ``fdict`` is made to be as fast as ``dict`` to build and to retrieve leaves, in exchange for slower exploration. In other words, you can expect blazingly fast creation of ``fdict`` as well as getting any leaf object at any nested level, but you should be careful when exploring. However, even if your dict is bigger than RAM, you can use the view* methods (viewitems, viewkeys, viewvalues) to walk all the items as a generator.\r\n\r\nTo circumvent this pitfall, two things were implemented:\r\n\r\n    * ``extract()`` method can be used on a nested fdict to filter all keys once and build a new fdict containing only the pertinent nested items. Usage is ``extracted_fdict = fdict({'a': {'b': 1, 'c': [2, 3]}})['a'].extract()``.\r\n\r\n    * ``fastview=True`` argument can be used when creating a fdict to enable the FastView mode. This mode will imply a small memory/space overhead to store nodes and also will increase complexity of setitem on nodes to O(m*l) where m is the number of parents of the current leaf added, and l the number of leaves added (usually one but if you set a dict it will be converted to multiple leaves). On the other hand, it will make items, keys, values, view* and other nodes operations methods as fast as with a ``dict`` by using lookup tables to access direct children directly, which was O(n) where n was the whole list of items at any level in the fdict. It is possible to convert a non-fastview fdict to a fastview fdict, just by supplying it as the initialization dict.\r\n\r\n    * ``nodel=True`` argument activates a special mode where delitem is nullified, but key lookup (contains test) time is O(1) for nodes. With standard ``fdict``, contains test is O(1) only for leaves and O(n) for nodes because it calls ``viewkeys()``. With this mode, empty nodes metadata are created and so lookup for nodes existence is very fast, but at the expense that deletion is not possible because it would make the database incoherent (i.e. nodes without leaf). However, setitem to replace a leaf will still work. This mode is particularly useful for fast database building, and then you can initialize a standard fdict with your finalized nodel fdict, which will then allow you to delitem.\r\n\r\nThus, if you want to do data exploration on a ``fdict``, you can use either of these two approaches to speed up your exploration to a reasonable time, with performances close to a ``dict``. In practice, ``extract`` is better if you have lots of items per nesting level, whereas ``fastview`` might be better if you have a very nested structure with few items per level but lots of levels.\r\n\r\nThere is probably room for speed optimization, if you have any idea please feel free to open an issue on Github.\r\n\r\nNote that this module is compatible with `PyPy <https://pypy.org/>`__, so you might get a speed-up with this interpreter.\r\n\r\nIn any case, this module is primarily meant to do quick prototypes of bigdata databases, that you can then switch to another faster database after reworking the structure a bit.\r\n\r\nA good example is the retrieval of online data: in this case, you care less about the data structure performance since it is negligible compared to network bandwidth and I/O. Then, when you have the data, you can rework it to convert to another type of database with a flat schema (by extracting only the fields you are interested in).\r\n\r\nAlso you can convert a ``fdict`` or ``sfdict`` to a flat ``dict`` using the ``to_dict()`` method, or to a nested (natural) ``dict`` using ``to_dict_nested()``, you will then get a standard ``dict`` stored in RAM that you can access at full speed, or use as an input to initialize another type of out-of-core database.\r\n\r\nDocumentation\r\n-------------\r\n\r\nfdict class\r\n~~~~~~~~~~~\r\n\r\n.. code:: python\r\n\r\n    class fdict(dict):\r\n        '''\r\n        Flattened nested dict, all items are settable and gettable through ['item1']['item2'] standard form or ['item1/item2'] internal form.\r\n        This allows to replace the internal dict with any on-disk storage system like a shelve's shelf (great for huge nested dicts that cannot fit into memory).\r\n        Main limitation: an entry can be both a singleton and a nested fdict: when an item is a singleton, you can setitem to replace to a nested dict, but if it is a nested dict and you setitem it to a singleton, both will coexist. Except for fastview mode, there is no way to know if a nested dict exists unless you walk through all items, which would be too consuming for a simple setitem. In this case, a getitem will always return the singleton, but nested leaves can always be accessed via items() or by direct access (eg, x['a/b/c']).\r\n\r\n        Fastview mode: remove conflicts issue and allow for fast O(m) contains(), delete() and view*() (such as vieitems()) where m in the number of subitems, instead of O(n) where n was the total number of elements in the fdict(). Downside is setitem() being O(m) too because of nodes metadata building, and memory/storage overhead, since we store all nodes and leaves lists in order to allow for fast lookup.\r\n        '''\r\n\r\n        def __init__(self, d=None, rootpath='', delimiter='/', fastview=False, nodel=False, **kwargs):\r\n\r\nParameters:\r\n\r\n* d  : dict, optional\r\n    Initialize with a pre-existing dict.\r\n    Also used internally to pass a reference to parent fdict.\r\n* rootpath : str, optional\r\n    Internal variable, define the nested level.\r\n* delimiter  : str, optional\r\n    Internal delimiter for nested levels. Can also be used for\r\n    getitem direct access (e.g. ``x['a/b/c']``).\r\n    [default : '/']\r\n* fastview  : bool, optional\r\n    Activates fastview mode, which makes setitem slower\r\n    in O(m*l) instead of O(1), but makes view* methods\r\n    (viewitem, viewkeys, viewvalues) as fast as dict's.\r\n    [default : False]\r\n* nodel  : bool, optional\r\n    Activates nodel mode, which makes contains test\r\n    in O(1) for nodes (leaf test is always O(1) in any mode).\r\n    Only drawback: delitem is not suppressed.\r\n    Useful for quick building of databases, then you can\r\n    reopen the database with a normal fdict if you want\r\n    the ability to delitem.\r\n    [default : False]\r\n\r\nReturns:\r\n\r\n* out  : dict-like object.\r\n\r\nsfdict class\r\n~~~~~~~~~~~~\r\n\r\n.. code:: python\r\n\r\n    class sfdict(fdict):\r\n        '''\r\n        A nested dict with flattened internal representation, combined with shelve to allow for efficient storage and memory allocation of huge nested dictionnaries.\r\n        If you change leaf items (eg, list.append), do not forget to sync() to commit changes to disk and empty memory cache because else this class has no way to know if leaf items were changed!\r\n        '''\r\n\r\n        def __init__(self, *args, **kwargs):\r\n\r\nParameters:\r\n\r\n* d  : dict, optional\r\n    Initialize with a pre-existing dict.\r\n    Also used internally to pass a reference to parent fdict.\r\n* rootpath : str, optional\r\n    Internal variable, define the nested level.\r\n* delimiter  : str, optional\r\n    Internal delimiter for nested levels. Can also be used for\r\n    getitem direct access (e.g. ``x['a/b/c']``).\r\n    [default : '/']\r\n* fastview  : bool, optional\r\n    Activates fastview mode, which makes setitem slower\r\n    in O(m*l) instead of O(1), but makes view* methods\r\n    (viewitem, viewkeys, viewvalues) as fast as dict's.\r\n    [default : False]\r\n* nodel  : bool, optional\r\n    Activates nodel mode, which makes contains test\r\n    in O(1) for nodes (leaf test is always O(1) in any mode).\r\n    Only drawback: delitem is not suppressed.\r\n    Useful for quick building of databases, then you can\r\n    reopen the database with a normal fdict if you want\r\n    the ability to delitem.\r\n    [default : False]\r\n* filename : str, optional\r\n    Path and filename where to store the database.\r\n    [default : random temporary file]\r\n* autosync : bool, optional\r\n    Commit (sync) to file at every setitem (assignment).\r\n    Assignments are always stored on-disk asap, but not\r\n    changes to non-dict collections stored in leaves\r\n    (e.g. updating a list stored in a leaf will not commit to disk).\r\n    This option allows to sync at the next assignment automatically\r\n    (because there is no way to know if a leaf collection changed).\r\n    Drawback: if you do a lot of assignments, this will significantly\r\n    slow down your processing, so it is advised to rather sync()\r\n    manually at regular intervals.\r\n    [default : False]\r\n* writeback : bool, optional\r\n    Activates shelve writeback option. If False, only assignments\r\n    will allow committing changes of leaf collections. See shelve\r\n    documentation.\r\n    [default : True]\r\n* forcedumbdbm : bool, optional\r\n    Force the use of the Dumb DBM implementation to manage\r\n    the on-disk database (should not be used unless you get an\r\n    exception because not any other implementation of anydbm\r\n    can be found on your system). Dumb DBM should work on\r\n    any platform, it is native to Python.\r\n    [default : False]\r\n\r\nReturns:\r\n\r\n* out  : dict-like object.\r\n\r\nLICENCE\r\n-------------\r\n\r\nThis library is licensed under the MIT License. It was initially made for the Coma Science Group - GIGA Consciousness - CHU de Liege, Belgium.\r\n\r\nIncluded are the ``flatkeys`` function by `bfontaine <https://github.com/bfontaine/flatkeys>`__  and ``_count_iter_items`` by `zuo <https://stackoverflow.com/a/15112059/1121352>`__.\r\n\r\n\r\n.. |Build-Status| image:: https://travis-ci.org/lrq3000/fdict.svg?branch=master\r\n   :target: https://travis-ci.org/lrq3000/fdict\r\n.. |LICENCE| image:: https://img.shields.io/pypi/l/fdict.svg\r\n   :target: https://raw.githubusercontent.com/lrq3000/fdict/master/LICENCE\r\n.. |PyPI-Status| image:: https://img.shields.io/pypi/v/fdict.svg\r\n   :target: https://pypi.python.org/pypi/fdict\r\n.. |PyPI-Downloads| image:: https://img.shields.io/pypi/dm/fdict.svg\r\n   :target: https://pypi.python.org/pypi/fdict\r\n.. |PyPI-Versions| image:: https://img.shields.io/pypi/pyversions/fdict.svg\r\n   :target: https://pypi.python.org/pypi/fdict\r\n.. |Branch-Coverage-Status| image:: https://codecov.io/github/lrq3000/fdict/coverage.svg?branch=master\r\n   :target: https://codecov.io/github/lrq3000/fdict?branch=master\r\n.. |Codacy-Grade| image:: https://api.codacy.com/project/badge/Grade/3f965571598f44549c7818f29cdcf177\r\n   :target: https://www.codacy.com/app/lrq3000/fdict?utm_source=github.com&amp;utm_medium=referral&amp;utm_content=lrq3000/fdict&amp;utm_campaign=Badge_Grade\r\n\r\n", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/LRQ3000/fdict", "keywords": "dict file disk out-of-core bigdata", "license": "MIT Licence", "maintainer": "", "maintainer_email": "", "name": "fdict", "package_url": "https://pypi.org/project/fdict/", "platform": "any", "project_url": "https://pypi.org/project/fdict/", "project_urls": {"Homepage": "https://github.com/LRQ3000/fdict"}, "release_url": "https://pypi.org/project/fdict/0.8.1/", "requires_dist": null, "requires_python": "", "summary": "Easy out-of-core computing of recursive dict", "version": "0.8.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><a href=\"https://pypi.python.org/pypi/fdict\" rel=\"nofollow\"><img alt=\"PyPI-Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/18c49ee95a3a7fff57eab46f74e23a548ff5a01f/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f66646963742e737667\"></a> <a href=\"https://pypi.python.org/pypi/fdict\" rel=\"nofollow\"><img alt=\"PyPI-Versions\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/6cda3fb8c95fe3bd91db52a069b41bad9808b149/68747470733a2f2f696d672e736869656c64732e696f2f707970692f707976657273696f6e732f66646963742e737667\"></a></p>\n<p><a href=\"https://travis-ci.org/lrq3000/fdict\" rel=\"nofollow\"><img alt=\"Build-Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/7b4260dfb6c3c9f4d1ada6631ace8027f5ff48b5/68747470733a2f2f7472617669732d63692e6f72672f6c7271333030302f66646963742e7376673f6272616e63683d6d6173746572\"></a> <a href=\"https://codecov.io/github/lrq3000/fdict?branch=master\" rel=\"nofollow\"><img alt=\"Branch-Coverage-Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/85fcb5563cc7b206f71231e0b25927661316234d/68747470733a2f2f636f6465636f762e696f2f6769746875622f6c7271333030302f66646963742f636f7665726167652e7376673f6272616e63683d6d6173746572\"></a> <a href=\"https://www.codacy.com/app/lrq3000/fdict?utm_source=github.com&amp;amp;utm_medium=referral&amp;amp;utm_content=lrq3000/fdict&amp;amp;utm_campaign=Badge_Grade\" rel=\"nofollow\"><img alt=\"Codacy-Grade\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/ceedc1737ea939e84d30520312d900551a117c90/68747470733a2f2f6170692e636f646163792e636f6d2f70726f6a6563742f62616467652f47726164652f3366393635353731353938663434353439633738313866323963646366313737\"></a></p>\n<p><a href=\"https://raw.githubusercontent.com/lrq3000/fdict/master/LICENCE\" rel=\"nofollow\"><img alt=\"LICENCE\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8f8b4bbefce776add0ce45624192d56044be5477/68747470733a2f2f696d672e736869656c64732e696f2f707970692f6c2f66646963742e737667\"></a></p>\n<p>Easy out-of-core computing with recursive data structures in Python with a drop-in dict replacement. Just use <tt>sfdict()</tt> instead of <tt>dict()</tt>, you are good to go!</p>\n<p><tt>fdict</tt> and <tt>sfdict</tt> can be initialized with a standard <tt>dict</tt>:</p>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">fdict</span> <span class=\"kn\">import</span> <span class=\"n\">fdict</span><span class=\"p\">,</span> <span class=\"n\">sfdict</span>\n<span class=\"n\">d</span> <span class=\"o\">=</span> <span class=\"n\">fdict</span><span class=\"p\">({</span><span class=\"s1\">'a'</span><span class=\"p\">:</span> <span class=\"p\">{</span><span class=\"s1\">'b'</span><span class=\"p\">:</span> <span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"s1\">'c'</span><span class=\"p\">:</span> <span class=\"p\">[</span><span class=\"mi\">2</span><span class=\"p\">,</span> <span class=\"mi\">3</span><span class=\"p\">]},</span> <span class=\"s1\">'d'</span><span class=\"p\">:</span> <span class=\"mi\">4</span><span class=\"p\">})</span>\n</pre>\n<p><tt>Out: {'a/c': [2, 3], 'd': 4, 'a/b': 1}</tt></p>\n<p>Nested dicts will be converted on-the-fly:</p>\n<pre><span class=\"n\">d</span><span class=\"p\">[</span><span class=\"s1\">'e'</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"p\">{</span><span class=\"s1\">'f'</span><span class=\"p\">:</span> <span class=\"p\">{</span><span class=\"s1\">'g'</span><span class=\"p\">:</span> <span class=\"p\">{</span><span class=\"s1\">'h'</span><span class=\"p\">:</span> <span class=\"mi\">5</span><span class=\"p\">}}}</span>\n</pre>\n<p><tt>Out: {'e/f/g/h': 5, 'a/c': [2, 3], 'd': 4, 'a/b': 1}</tt></p>\n<p>And it can be converted back to a dict at any time:</p>\n<pre><span class=\"n\">d</span><span class=\"o\">.</span><span class=\"n\">to_dict_nested</span><span class=\"p\">()</span>\n</pre>\n<p><tt>Out: {'a': {'c': [2, 3], 'b': 1}, 'e': {'f': {'g': {'h': <span class=\"pre\">5}}},</span> 'd': 4}</tt></p>\n<p>To store all items on disk (out-of-core computing), use <tt>sfdict</tt>, a subclass of <tt>fdict</tt> using <tt>shelve</tt> internally:</p>\n<pre><span class=\"c1\"># Initialize an empty database in file myshelf.db</span>\n<span class=\"n\">d</span> <span class=\"o\">=</span> <span class=\"n\">sfdict</span><span class=\"p\">(</span><span class=\"n\">filename</span><span class=\"o\">=</span><span class=\"s1\">'myshelf.db'</span><span class=\"p\">)</span>\n<span class=\"n\">d</span><span class=\"p\">[</span><span class=\"s1\">'a'</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"p\">{</span><span class=\"s1\">'b'</span><span class=\"p\">:</span> <span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"s1\">'c'</span><span class=\"p\">:</span> <span class=\"p\">[</span><span class=\"mi\">2</span><span class=\"p\">,</span> <span class=\"mi\">3</span><span class=\"p\">]}</span>\n<span class=\"n\">d</span><span class=\"o\">.</span><span class=\"n\">sync</span><span class=\"p\">()</span>  <span class=\"c1\"># synchronize all changes back to disk</span>\n<span class=\"n\">d</span><span class=\"o\">.</span><span class=\"n\">close</span><span class=\"p\">()</span>  <span class=\"c1\"># should always close a db</span>\n\n<span class=\"c1\"># Reopen the same database</span>\n<span class=\"n\">d2</span> <span class=\"o\">=</span> <span class=\"n\">sfdict</span><span class=\"p\">(</span><span class=\"n\">filename</span><span class=\"o\">=</span><span class=\"s1\">'myshelf.db'</span><span class=\"p\">)</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">d2</span><span class=\"p\">)</span>\n<span class=\"n\">d2</span><span class=\"o\">.</span><span class=\"n\">close</span><span class=\"p\">()</span>\n</pre>\n<p><tt>Out: {'a/b': 1, 'a/c': [2, 3]}</tt></p>\n<p>The intention of this module is to provide a very easy and pythonic data structure to do out-of-core computing of very nested/recursive big data, while still having reasonably acceptable performances. Currently, no other library can do out-of-core computing of very recursive data, because they all serialize at 1st level nodes. Hence, the goal is to provide a very easy way to prototype out-of-core applications, which you can later replace with a faster datatype.</p>\n<p>Hence, this module provides <tt>fdict()</tt> and <tt>sfdict()</tt>, which both provide a similar interface to <tt>dict()</tt> with flattened keys for the first and out-of-core storage for the second (using native <tt>shelve</tt> library). There is no third-party dependancy.</p>\n<p>The <tt>fdict()</tt> class provides the basic system allowing to have an internal flattened representation of a nested dict, then you can subclass it to support your favorite out-of-core library as long as it implements dict-like methods: an exemple is provided with <tt>sfdict()</tt> using <tt>shelve</tt>, but you can subclass to use <tt>chest</tt>, <tt>shove</tt>, <tt>sqlite</tt>, <tt>zodb</tt>, etc.</p>\n<p>Note: if you use <tt>sfdict()</tt>, do not forget to <tt>.sync()</tt> and <tt>.close()</tt> to commit the changes back to the file.</p>\n<p>Alternatives, notably based on numpy and so probably faster but with fixed dimensions, can be found in the <a href=\"https://github.com/Nexedi/wendelin.core\" rel=\"nofollow\">wendelin.core project</a>, <a href=\"https://github.com/alimanfoo/zarr\" rel=\"nofollow\">zarr</a>, <a href=\"http://zict.readthedocs.io/en/latest/\" rel=\"nofollow\">zict</a> and there is also <a href=\"https://dask.pydata.org/en/latest/\" rel=\"nofollow\">dask</a> for pandas dataframes.</p>\n<div id=\"differences-with-dict\">\n<h2>Differences with dict</h2>\n<p>Although maximum compatibility was the primary goal, a different implementation of course brings differences that are unavoidable.</p>\n<p>The primary difference is that calling <cite>items()</cite>, <cite>keys()</cite>, <cite>values()</cite> and <cite>view*</cite> methods will return all children leaves nested at any level, whereas a dict returns only the direct children. Also, by default, these methods return only leaves (non-dict objects) and not nodes, although you can override this by suppling the <cite>nodes=True</cite> argument.</p>\n<p>Another difference is conflicts: you can have an item being both a leaf and a node, because there is no way to check that there is no node without walking all items (ie, using <tt>viewitems()</tt>, and this method is the limitation of <tt>fdict</tt> data structure).</p>\n<p>This also means that when assigning an item that was already assigned, nodes will NOT get replaced, but singleton will be correctly replaced. To be more explicit:</p>\n<p>This works:</p>\n<pre><span class=\"n\">d</span> <span class=\"o\">=</span> <span class=\"n\">fdict</span><span class=\"p\">({</span><span class=\"s1\">'a'</span><span class=\"p\">:</span> <span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"s1\">'b'</span><span class=\"p\">:</span> <span class=\"p\">{</span><span class=\"s1\">'c'</span><span class=\"p\">:</span> <span class=\"mi\">2</span><span class=\"p\">}})</span>\n<span class=\"n\">d</span><span class=\"p\">[</span><span class=\"s1\">'a'</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"o\">-</span><span class=\"mi\">1</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">d</span><span class=\"p\">)</span>\n<span class=\"n\">d</span><span class=\"p\">[</span><span class=\"s1\">'a'</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"p\">{</span><span class=\"s1\">'d'</span><span class=\"p\">:</span> <span class=\"mi\">3</span><span class=\"p\">,</span> <span class=\"s1\">'e'</span><span class=\"p\">:</span> <span class=\"mi\">4</span><span class=\"p\">}</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">d</span><span class=\"p\">)</span>\n</pre>\n<p><tt>{'a': <span class=\"pre\">-1,</span> 'b/c': 2}</tt>\n<tt>{'a/d': 3, 'a/e': 4, 'b/c': 2}</tt></p>\n<p>But this does NOT work as expected:</p>\n<pre><span class=\"n\">d</span> <span class=\"o\">=</span> <span class=\"n\">fdict</span><span class=\"p\">({</span><span class=\"s1\">'a'</span><span class=\"p\">:</span> <span class=\"mi\">1</span><span class=\"p\">,</span> <span class=\"s1\">'b'</span><span class=\"p\">:</span> <span class=\"p\">{</span><span class=\"s1\">'c'</span><span class=\"p\">:</span> <span class=\"mi\">2</span><span class=\"p\">}})</span>\n<span class=\"n\">d</span><span class=\"p\">[</span><span class=\"s1\">'b'</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"o\">-</span><span class=\"mi\">1</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">d</span><span class=\"p\">)</span>\n</pre>\n<p><tt>{'a': 1, 'b': <span class=\"pre\">-1,</span> 'b/c': 2}</tt></p>\n<p>A minor difference is the handling of keys: assigning an empty dict to a key will not create the key (e.g. <tt><span class=\"pre\">d['a']</span> = {}</tt> will not create the key <tt>a</tt>, it will stay inexistent until it gets assigned a non empty dict value), and assigning sub-keys that do not exist is ok without any prior parent dict creation (e.g. <tt>d = <span class=\"pre\">fdict();</span> <span class=\"pre\">d['a']['b']['c']['d']['e']</span> = 1</tt> is OK).</p>\n<p>Similarly, walking <tt>keys()</tt>, <tt>values()</tt> and <tt>items()</tt> will walk through all nested leaves at any nested level. For exploration convenience, if you want a behavior similar to <tt>dict</tt> to explore only the direct children displaying only the direct children, you can use <tt>viewkeys_restrict()</tt>, <tt>viewitems_restrict()</tt>, <tt>viewvalues_restrict()</tt>, <tt>firstkey()</tt>, <tt>firstitem()</tt>, <tt>firstvalue()</tt>. Note however that the walking will not be faster than walking all items (because internally that is what is being done), so you cannot optimize speed with these methods, it is only for convenience.</p>\n<p>Another minor difference is how <cite>pop()</cite> and <cite>popitem()</cite> are handled: they will return the next leaf at any nested level, and never nodes. Thus, you cannot get the next item at a specific level, but only the next item at any nested level.</p>\n</div>\n<div id=\"performances\">\n<h2>Performances</h2>\n<p><tt>fdict</tt> was made with maximum compatibility with existing code using <tt>dict</tt> and with reasonable performances. That’s in theory, in practice <tt>fdict</tt> are slower than <tt>dict</tt> for most purposes, except setitem and getitem if you use direct access form (eg, x[‘a/b/c’] instead of x[‘a’][‘b’][‘c’]).</p>\n<p>As such, you can expect O(1) performance just like <tt>dict</tt> for any operation on leaves (non-dict objects): getitem, setitem, delitem, eq contains. In practice, <tt>fdict</tt> is about 10x slower than <tt>dict</tt> because of class overhead and key string manipulation, for both indirect access (ie, <tt><span class=\"pre\">x['a']['b']['c']</span></tt>) and 3x slower for direct access on leaves (ie, <tt><span class=\"pre\">x['a/b/c']</span></tt>). Thus direct access form might be preferable if you want a faster set and get. This performance cost is acceptable for a quick prototype of a bigdata database, since building and retrieving items are the most common operations.</p>\n<p>The major drawback comes when you work on nodes (nested dict objects): since all keys are flattened and on the same level, the only way to get only the children of a nested dict (aka a branch) is to walk through all keys and filter out the ones not matching the current branch. This means that any operation on nodes will be in O(n) where n is the total number of items in the whole fdict. Affected operations are: items, keys, values, view*, iter*, delitem on nodes, eq on nodes, contains on nodes.</p>\n<p>Interestingly, getitem on nodes is not affected, because we use a lazy approach: getting a nested dict will not build anything, it will just spawn a new fdict with a different filtering rootpath. Nothing gets evaluated, until you either attain a leaf (in this case we return the non-dict object value) or you use an operation on node such as items(). Keep in mind that any nested fdict will share the same internal flattened dict, so any nested fdict will also have access to all items at any level!</p>\n<p>This was done by design: <tt>fdict</tt> is made to be as fast as <tt>dict</tt> to build and to retrieve leaves, in exchange for slower exploration. In other words, you can expect blazingly fast creation of <tt>fdict</tt> as well as getting any leaf object at any nested level, but you should be careful when exploring. However, even if your dict is bigger than RAM, you can use the view* methods (viewitems, viewkeys, viewvalues) to walk all the items as a generator.</p>\n<p>To circumvent this pitfall, two things were implemented:</p>\n<blockquote>\n<ul>\n<li><tt>extract()</tt> method can be used on a nested fdict to filter all keys once and build a new fdict containing only the pertinent nested items. Usage is <tt>extracted_fdict = <span class=\"pre\">fdict({'a':</span> {'b': 1, 'c': [2, <span class=\"pre\">3]}})['a'].extract()</span></tt>.</li>\n<li><tt>fastview=True</tt> argument can be used when creating a fdict to enable the FastView mode. This mode will imply a small memory/space overhead to store nodes and also will increase complexity of setitem on nodes to O(m*l) where m is the number of parents of the current leaf added, and l the number of leaves added (usually one but if you set a dict it will be converted to multiple leaves). On the other hand, it will make items, keys, values, view* and other nodes operations methods as fast as with a <tt>dict</tt> by using lookup tables to access direct children directly, which was O(n) where n was the whole list of items at any level in the fdict. It is possible to convert a non-fastview fdict to a fastview fdict, just by supplying it as the initialization dict.</li>\n<li><tt>nodel=True</tt> argument activates a special mode where delitem is nullified, but key lookup (contains test) time is O(1) for nodes. With standard <tt>fdict</tt>, contains test is O(1) only for leaves and O(n) for nodes because it calls <tt>viewkeys()</tt>. With this mode, empty nodes metadata are created and so lookup for nodes existence is very fast, but at the expense that deletion is not possible because it would make the database incoherent (i.e. nodes without leaf). However, setitem to replace a leaf will still work. This mode is particularly useful for fast database building, and then you can initialize a standard fdict with your finalized nodel fdict, which will then allow you to delitem.</li>\n</ul>\n</blockquote>\n<p>Thus, if you want to do data exploration on a <tt>fdict</tt>, you can use either of these two approaches to speed up your exploration to a reasonable time, with performances close to a <tt>dict</tt>. In practice, <tt>extract</tt> is better if you have lots of items per nesting level, whereas <tt>fastview</tt> might be better if you have a very nested structure with few items per level but lots of levels.</p>\n<p>There is probably room for speed optimization, if you have any idea please feel free to open an issue on Github.</p>\n<p>Note that this module is compatible with <a href=\"https://pypy.org/\" rel=\"nofollow\">PyPy</a>, so you might get a speed-up with this interpreter.</p>\n<p>In any case, this module is primarily meant to do quick prototypes of bigdata databases, that you can then switch to another faster database after reworking the structure a bit.</p>\n<p>A good example is the retrieval of online data: in this case, you care less about the data structure performance since it is negligible compared to network bandwidth and I/O. Then, when you have the data, you can rework it to convert to another type of database with a flat schema (by extracting only the fields you are interested in).</p>\n<p>Also you can convert a <tt>fdict</tt> or <tt>sfdict</tt> to a flat <tt>dict</tt> using the <tt>to_dict()</tt> method, or to a nested (natural) <tt>dict</tt> using <tt>to_dict_nested()</tt>, you will then get a standard <tt>dict</tt> stored in RAM that you can access at full speed, or use as an input to initialize another type of out-of-core database.</p>\n</div>\n<div id=\"documentation\">\n<h2>Documentation</h2>\n<div id=\"fdict-class\">\n<h3>fdict class</h3>\n<pre><span class=\"k\">class</span> <span class=\"nc\">fdict</span><span class=\"p\">(</span><span class=\"nb\">dict</span><span class=\"p\">):</span>\n    <span class=\"sd\">'''\n    Flattened nested dict, all items are settable and gettable through ['item1']['item2'] standard form or ['item1/item2'] internal form.\n    This allows to replace the internal dict with any on-disk storage system like a shelve's shelf (great for huge nested dicts that cannot fit into memory).\n    Main limitation: an entry can be both a singleton and a nested fdict: when an item is a singleton, you can setitem to replace to a nested dict, but if it is a nested dict and you setitem it to a singleton, both will coexist. Except for fastview mode, there is no way to know if a nested dict exists unless you walk through all items, which would be too consuming for a simple setitem. In this case, a getitem will always return the singleton, but nested leaves can always be accessed via items() or by direct access (eg, x['a/b/c']).\n\n    Fastview mode: remove conflicts issue and allow for fast O(m) contains(), delete() and view*() (such as vieitems()) where m in the number of subitems, instead of O(n) where n was the total number of elements in the fdict(). Downside is setitem() being O(m) too because of nodes metadata building, and memory/storage overhead, since we store all nodes and leaves lists in order to allow for fast lookup.\n    '''</span>\n\n    <span class=\"k\">def</span> <span class=\"fm\">__init__</span><span class=\"p\">(</span><span class=\"bp\">self</span><span class=\"p\">,</span> <span class=\"n\">d</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">rootpath</span><span class=\"o\">=</span><span class=\"s1\">''</span><span class=\"p\">,</span> <span class=\"n\">delimiter</span><span class=\"o\">=</span><span class=\"s1\">'/'</span><span class=\"p\">,</span> <span class=\"n\">fastview</span><span class=\"o\">=</span><span class=\"kc\">False</span><span class=\"p\">,</span> <span class=\"n\">nodel</span><span class=\"o\">=</span><span class=\"kc\">False</span><span class=\"p\">,</span> <span class=\"o\">**</span><span class=\"n\">kwargs</span><span class=\"p\">):</span>\n</pre>\n<p>Parameters:</p>\n<ul>\n<li><dl>\n<dt>d <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">dict, optional</span></dt>\n<dd>Initialize with a pre-existing dict.\nAlso used internally to pass a reference to parent fdict.</dd>\n</dl>\n</li>\n<li><dl>\n<dt>rootpath <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">str, optional</span></dt>\n<dd>Internal variable, define the nested level.</dd>\n</dl>\n</li>\n<li><dl>\n<dt>delimiter <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">str, optional</span></dt>\n<dd>Internal delimiter for nested levels. Can also be used for\ngetitem direct access (e.g. <tt><span class=\"pre\">x['a/b/c']</span></tt>).\n[default : ‘/’]</dd>\n</dl>\n</li>\n<li><dl>\n<dt>fastview <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">bool, optional</span></dt>\n<dd>Activates fastview mode, which makes setitem slower\nin O(m*l) instead of O(1), but makes view* methods\n(viewitem, viewkeys, viewvalues) as fast as dict’s.\n[default : False]</dd>\n</dl>\n</li>\n<li><dl>\n<dt>nodel <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">bool, optional</span></dt>\n<dd>Activates nodel mode, which makes contains test\nin O(1) for nodes (leaf test is always O(1) in any mode).\nOnly drawback: delitem is not suppressed.\nUseful for quick building of databases, then you can\nreopen the database with a normal fdict if you want\nthe ability to delitem.\n[default : False]</dd>\n</dl>\n</li>\n</ul>\n<p>Returns:</p>\n<ul>\n<li>out  : dict-like object.</li>\n</ul>\n</div>\n<div id=\"sfdict-class\">\n<h3>sfdict class</h3>\n<pre><span class=\"k\">class</span> <span class=\"nc\">sfdict</span><span class=\"p\">(</span><span class=\"n\">fdict</span><span class=\"p\">):</span>\n    <span class=\"sd\">'''\n    A nested dict with flattened internal representation, combined with shelve to allow for efficient storage and memory allocation of huge nested dictionnaries.\n    If you change leaf items (eg, list.append), do not forget to sync() to commit changes to disk and empty memory cache because else this class has no way to know if leaf items were changed!\n    '''</span>\n\n    <span class=\"k\">def</span> <span class=\"fm\">__init__</span><span class=\"p\">(</span><span class=\"bp\">self</span><span class=\"p\">,</span> <span class=\"o\">*</span><span class=\"n\">args</span><span class=\"p\">,</span> <span class=\"o\">**</span><span class=\"n\">kwargs</span><span class=\"p\">):</span>\n</pre>\n<p>Parameters:</p>\n<ul>\n<li><dl>\n<dt>d <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">dict, optional</span></dt>\n<dd>Initialize with a pre-existing dict.\nAlso used internally to pass a reference to parent fdict.</dd>\n</dl>\n</li>\n<li><dl>\n<dt>rootpath <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">str, optional</span></dt>\n<dd>Internal variable, define the nested level.</dd>\n</dl>\n</li>\n<li><dl>\n<dt>delimiter <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">str, optional</span></dt>\n<dd>Internal delimiter for nested levels. Can also be used for\ngetitem direct access (e.g. <tt><span class=\"pre\">x['a/b/c']</span></tt>).\n[default : ‘/’]</dd>\n</dl>\n</li>\n<li><dl>\n<dt>fastview <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">bool, optional</span></dt>\n<dd>Activates fastview mode, which makes setitem slower\nin O(m*l) instead of O(1), but makes view* methods\n(viewitem, viewkeys, viewvalues) as fast as dict’s.\n[default : False]</dd>\n</dl>\n</li>\n<li><dl>\n<dt>nodel <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">bool, optional</span></dt>\n<dd>Activates nodel mode, which makes contains test\nin O(1) for nodes (leaf test is always O(1) in any mode).\nOnly drawback: delitem is not suppressed.\nUseful for quick building of databases, then you can\nreopen the database with a normal fdict if you want\nthe ability to delitem.\n[default : False]</dd>\n</dl>\n</li>\n<li><dl>\n<dt>filename <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">str, optional</span></dt>\n<dd>Path and filename where to store the database.\n[default : random temporary file]</dd>\n</dl>\n</li>\n<li><dl>\n<dt>autosync <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">bool, optional</span></dt>\n<dd>Commit (sync) to file at every setitem (assignment).\nAssignments are always stored on-disk asap, but not\nchanges to non-dict collections stored in leaves\n(e.g. updating a list stored in a leaf will not commit to disk).\nThis option allows to sync at the next assignment automatically\n(because there is no way to know if a leaf collection changed).\nDrawback: if you do a lot of assignments, this will significantly\nslow down your processing, so it is advised to rather sync()\nmanually at regular intervals.\n[default : False]</dd>\n</dl>\n</li>\n<li><dl>\n<dt>writeback <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">bool, optional</span></dt>\n<dd>Activates shelve writeback option. If False, only assignments\nwill allow committing changes of leaf collections. See shelve\ndocumentation.\n[default : True]</dd>\n</dl>\n</li>\n<li><dl>\n<dt>forcedumbdbm <span class=\"classifier-delimiter\">:</span> <span class=\"classifier\">bool, optional</span></dt>\n<dd>Force the use of the Dumb DBM implementation to manage\nthe on-disk database (should not be used unless you get an\nexception because not any other implementation of anydbm\ncan be found on your system). Dumb DBM should work on\nany platform, it is native to Python.\n[default : False]</dd>\n</dl>\n</li>\n</ul>\n<p>Returns:</p>\n<ul>\n<li>out  : dict-like object.</li>\n</ul>\n</div>\n</div>\n<div id=\"licence\">\n<h2>LICENCE</h2>\n<p>This library is licensed under the MIT License. It was initially made for the Coma Science Group - GIGA Consciousness - CHU de Liege, Belgium.</p>\n<p>Included are the <tt>flatkeys</tt> function by <a href=\"https://github.com/bfontaine/flatkeys\" rel=\"nofollow\">bfontaine</a>  and <tt>_count_iter_items</tt> by <a href=\"https://stackoverflow.com/a/15112059/1121352\" rel=\"nofollow\">zuo</a>.</p>\n</div>\n\n          </div>"}, "last_serial": 3082104, "releases": {"0.6.2": [{"comment_text": "", "digests": {"md5": "8cd10c2c256eabb4dcd84be6f878eecc", "sha256": "8daf73447b294cf26627cf3ca8c9551c78fa407648a997774d42c3faa2532e96"}, "downloads": -1, "filename": "fdict-0.6.2-py2-none-any.whl", "has_sig": false, "md5_digest": "8cd10c2c256eabb4dcd84be6f878eecc", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 19485, "upload_time": "2017-08-06T17:00:14", "upload_time_iso_8601": "2017-08-06T17:00:14.588906Z", "url": "https://files.pythonhosted.org/packages/12/8d/01d71a460087d74c7fbf961def15ad8e03a414be15677798c503fc8dd38c/fdict-0.6.2-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "aa30330c67a56cf2e0ed807baf913af4", "sha256": "87d67b694dc184e107ceb022f79c205cb0c30b508432c97420db6d85c1d6c4b6"}, "downloads": -1, "filename": "fdict-0.6.2.tar.gz", "has_sig": false, "md5_digest": "aa30330c67a56cf2e0ed807baf913af4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 24493, "upload_time": "2017-08-06T17:00:16", "upload_time_iso_8601": "2017-08-06T17:00:16.064526Z", "url": "https://files.pythonhosted.org/packages/f4/6f/9823af27567000fe6ca5904b0cc03df4085f7454a8113b031a9b30fb2f56/fdict-0.6.2.tar.gz", "yanked": false}], "0.6.4": [{"comment_text": "", "digests": {"md5": "9e732807c73fdcb6d384cd6f8241781f", "sha256": "96c08d55e730c870e5eba38c4896ed562f254f54441313808dceec967c9b6ce3"}, "downloads": -1, "filename": "fdict-0.6.4-py2-none-any.whl", "has_sig": false, "md5_digest": "9e732807c73fdcb6d384cd6f8241781f", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 22764, "upload_time": "2017-08-06T21:40:58", "upload_time_iso_8601": "2017-08-06T21:40:58.861017Z", "url": "https://files.pythonhosted.org/packages/e2/5d/5873bd4befdf2a40369ad83efaa15376b3beec39eee189d722c56a908d1c/fdict-0.6.4-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7f072df24c06c6f3163fd4792eed7ecd", "sha256": "ece24ed1fae0fcb08c4547f17eec93122b9f22cfecd95e288f67e00192b82cc1"}, "downloads": -1, "filename": "fdict-0.6.4.tar.gz", "has_sig": false, "md5_digest": "7f072df24c06c6f3163fd4792eed7ecd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26997, "upload_time": "2017-08-06T21:41:00", "upload_time_iso_8601": "2017-08-06T21:41:00.439690Z", "url": "https://files.pythonhosted.org/packages/da/2d/7498bbc947600b0b535738b99bfa586d154e24e01df14f829e612456f7b1/fdict-0.6.4.tar.gz", "yanked": false}], "0.6.5": [{"comment_text": "", "digests": {"md5": "a17a853bfc622a0802063df58e3cc1a8", "sha256": "e71b36dfdcd2bc1170223bdcf7443a31644fee95bdb99ca7c01f9b32ad1b0b5f"}, "downloads": -1, "filename": "fdict-0.6.5-py2-none-any.whl", "has_sig": false, "md5_digest": "a17a853bfc622a0802063df58e3cc1a8", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 21041, "upload_time": "2017-08-07T15:20:21", "upload_time_iso_8601": "2017-08-07T15:20:21.681464Z", "url": "https://files.pythonhosted.org/packages/64/a3/b50bd463f85fb39c7c7d8cbe15ed29ae4b1b75ba36bebbdc265c8b6379ad/fdict-0.6.5-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "dc307e3fcf17b2515a28e31e5d2239fb", "sha256": "6b3c1b94874b2edad3b7cf14e24d2d37084d2929fc0436cebfa004615bb0121f"}, "downloads": -1, "filename": "fdict-0.6.5.tar.gz", "has_sig": false, "md5_digest": "dc307e3fcf17b2515a28e31e5d2239fb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 25800, "upload_time": "2017-08-07T15:20:24", "upload_time_iso_8601": "2017-08-07T15:20:24.523120Z", "url": "https://files.pythonhosted.org/packages/8b/2b/8081ac5be1a3606a7a03af2e9704719f3475b71b951ee07d500b610bb66f/fdict-0.6.5.tar.gz", "yanked": false}], "0.7.1": [{"comment_text": "", "digests": {"md5": "6a59bb5acdeaf8c16e0aecb5afe32666", "sha256": "a9761afe3e03045aa4717ef5b78f3c1616a2e26b06a3890a3ccb1c3b21bb2db4"}, "downloads": -1, "filename": "fdict-0.7.1-py2-none-any.whl", "has_sig": false, "md5_digest": "6a59bb5acdeaf8c16e0aecb5afe32666", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 26113, "upload_time": "2017-08-07T23:11:54", "upload_time_iso_8601": "2017-08-07T23:11:54.720487Z", "url": "https://files.pythonhosted.org/packages/61/ac/b0d31684e041e587d626b8c3e9b178f306cf328e0f1998036686c4914c94/fdict-0.7.1-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6f6e506993998ea7010de5c8cafdd5e5", "sha256": "5b01eb54b009062f9e8e3301fd1a620ad775c49f83388b5c23978498abe28be0"}, "downloads": -1, "filename": "fdict-0.7.1.tar.gz", "has_sig": false, "md5_digest": "6f6e506993998ea7010de5c8cafdd5e5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30218, "upload_time": "2017-08-07T23:11:56", "upload_time_iso_8601": "2017-08-07T23:11:56.739930Z", "url": "https://files.pythonhosted.org/packages/6c/9d/897224691d2edd5f8e31f18d97ce8089e6029ac1ceb287217d57e4735dc4/fdict-0.7.1.tar.gz", "yanked": false}], "0.7.3": [{"comment_text": "", "digests": {"md5": "7b30d41e04004d8a288e3856b7cdc633", "sha256": "91ec2a3333efa01aa65240e209a989cb4d70718c5e6a74660609026ca6da8f55"}, "downloads": -1, "filename": "fdict-0.7.3-py2-none-any.whl", "has_sig": false, "md5_digest": "7b30d41e04004d8a288e3856b7cdc633", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 26222, "upload_time": "2017-08-07T23:20:47", "upload_time_iso_8601": "2017-08-07T23:20:47.178289Z", "url": "https://files.pythonhosted.org/packages/0f/59/c2f32f49debdcde5fc6e0ce9b35037b96aa54b69191ca7583c68e551cd1b/fdict-0.7.3-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "15bf940d8f54d2503a7652b9cf272991", "sha256": "1568df258cc5d1ab6d6722f70d758d7110bc10061c04147f9bc051e7f1ef3662"}, "downloads": -1, "filename": "fdict-0.7.3.tar.gz", "has_sig": false, "md5_digest": "15bf940d8f54d2503a7652b9cf272991", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30271, "upload_time": "2017-08-07T23:20:48", "upload_time_iso_8601": "2017-08-07T23:20:48.807294Z", "url": "https://files.pythonhosted.org/packages/be/f1/7cea74d017da72a5a5f4f3e1ab3febfb7b8b4c24515a0c09461920ba09dc/fdict-0.7.3.tar.gz", "yanked": false}], "0.7.5": [{"comment_text": "", "digests": {"md5": "bfea273047cab04c36b04bf1f3fe6fd3", "sha256": "ad2a4d8473802fec2803e7b055632db120816f10291680a76b5cc21042be01cc"}, "downloads": -1, "filename": "fdict-0.7.5-py2-none-any.whl", "has_sig": false, "md5_digest": "bfea273047cab04c36b04bf1f3fe6fd3", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 26338, "upload_time": "2017-08-08T14:14:52", "upload_time_iso_8601": "2017-08-08T14:14:52.705181Z", "url": "https://files.pythonhosted.org/packages/2c/52/28f7c89544d4d4967e9a323166131e96574a858ec00c762d284d711c33c2/fdict-0.7.5-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5b35b98e044d7062fff6fcbf86db99da", "sha256": "1f38cc0d3d0937b0fc25aa8dd9dc12d2b8736372d8fe39128c9b223c3f4f77eb"}, "downloads": -1, "filename": "fdict-0.7.5.tar.gz", "has_sig": false, "md5_digest": "5b35b98e044d7062fff6fcbf86db99da", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30489, "upload_time": "2017-08-08T14:14:54", "upload_time_iso_8601": "2017-08-08T14:14:54.426114Z", "url": "https://files.pythonhosted.org/packages/ea/d8/83646235ca1fec6a17c25c60e51e193b0df84468c7f44feb9a17007ab0c5/fdict-0.7.5.tar.gz", "yanked": false}], "0.7.8": [{"comment_text": "", "digests": {"md5": "11bd08fe33b3d88c1b11347f0e427a70", "sha256": "92d9b1cf1f713d7e8f67cadb74f01884544b7ac535a7984cb271914f2bee1454"}, "downloads": -1, "filename": "fdict-0.7.8-py2-none-any.whl", "has_sig": false, "md5_digest": "11bd08fe33b3d88c1b11347f0e427a70", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 26345, "upload_time": "2017-08-08T15:08:48", "upload_time_iso_8601": "2017-08-08T15:08:48.101965Z", "url": "https://files.pythonhosted.org/packages/ef/e6/0c1e08c0c7daf0a9debf7eca0e559730f62429bb49e22740c2b6e46fcc7d/fdict-0.7.8-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a101660e99b0ca3181d80b8a5312fe05", "sha256": "6a38cacb7b1059aa8d5e9304e6102510ffb1ee6e43140562f65d6f57f550d70a"}, "downloads": -1, "filename": "fdict-0.7.8.tar.gz", "has_sig": false, "md5_digest": "a101660e99b0ca3181d80b8a5312fe05", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30772, "upload_time": "2017-08-08T15:08:49", "upload_time_iso_8601": "2017-08-08T15:08:49.512575Z", "url": "https://files.pythonhosted.org/packages/f6/67/f60d9a3e5124dc0f3a41174f887847c3b917b8328faf5ed263d56636d027/fdict-0.7.8.tar.gz", "yanked": false}], "0.7.9": [{"comment_text": "", "digests": {"md5": "5ddc849d9053922b36269a0cfd3b3786", "sha256": "40146126c9e70d498dc52540625dc2629be095a7225ffca5baef1a02e988ff5c"}, "downloads": -1, "filename": "fdict-0.7.9-py2-none-any.whl", "has_sig": false, "md5_digest": "5ddc849d9053922b36269a0cfd3b3786", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 26627, "upload_time": "2017-08-08T15:52:55", "upload_time_iso_8601": "2017-08-08T15:52:55.137256Z", "url": "https://files.pythonhosted.org/packages/57/19/73470de2e00f045ce048decb326aa9a79032785483a4f9f1b58cd2aaed1d/fdict-0.7.9-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "debb6ceb938e66f58b9816f0a520326f", "sha256": "028183f0a302b5aa1fdd76ae2cdebf0397ec9940960883da3c6d43f27cc07acf"}, "downloads": -1, "filename": "fdict-0.7.9.tar.gz", "has_sig": false, "md5_digest": "debb6ceb938e66f58b9816f0a520326f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30908, "upload_time": "2017-08-08T15:52:59", "upload_time_iso_8601": "2017-08-08T15:52:59.036863Z", "url": "https://files.pythonhosted.org/packages/14/62/fcf8775e76d3bd93cfe2846cfff42a336fe1a6a0dc43767e6669d3b340c2/fdict-0.7.9.tar.gz", "yanked": false}], "0.8.1": [{"comment_text": "", "digests": {"md5": "5872c5bd9ba86ef640d71b5240f81994", "sha256": "f5993142da3f6c3ba1af2f068675fd237113cd0dc151138d8529f62411cb852f"}, "downloads": -1, "filename": "fdict-0.8.1-py2-none-any.whl", "has_sig": false, "md5_digest": "5872c5bd9ba86ef640d71b5240f81994", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 27909, "upload_time": "2017-08-08T19:01:56", "upload_time_iso_8601": "2017-08-08T19:01:56.625803Z", "url": "https://files.pythonhosted.org/packages/64/f2/b88f71f347803695e2e6a93122c06a96ed2d090ccb733b29b53c4585573d/fdict-0.8.1-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "bfad64754f077c74ec2b29afe1f642d4", "sha256": "7044857b1062b68abe719c7ebcb06771c440ac0616bd1d862f9310ce2c95c154"}, "downloads": -1, "filename": "fdict-0.8.1.tar.gz", "has_sig": false, "md5_digest": "bfad64754f077c74ec2b29afe1f642d4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 32306, "upload_time": "2017-08-08T19:01:58", "upload_time_iso_8601": "2017-08-08T19:01:58.715035Z", "url": "https://files.pythonhosted.org/packages/b5/fd/e7048c496d0da592bafe18f31d0693d0ad10c08d678b53fc0a8ac8292dab/fdict-0.8.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "5872c5bd9ba86ef640d71b5240f81994", "sha256": "f5993142da3f6c3ba1af2f068675fd237113cd0dc151138d8529f62411cb852f"}, "downloads": -1, "filename": "fdict-0.8.1-py2-none-any.whl", "has_sig": false, "md5_digest": "5872c5bd9ba86ef640d71b5240f81994", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 27909, "upload_time": "2017-08-08T19:01:56", "upload_time_iso_8601": "2017-08-08T19:01:56.625803Z", "url": "https://files.pythonhosted.org/packages/64/f2/b88f71f347803695e2e6a93122c06a96ed2d090ccb733b29b53c4585573d/fdict-0.8.1-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "bfad64754f077c74ec2b29afe1f642d4", "sha256": "7044857b1062b68abe719c7ebcb06771c440ac0616bd1d862f9310ce2c95c154"}, "downloads": -1, "filename": "fdict-0.8.1.tar.gz", "has_sig": false, "md5_digest": "bfad64754f077c74ec2b29afe1f642d4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 32306, "upload_time": "2017-08-08T19:01:58", "upload_time_iso_8601": "2017-08-08T19:01:58.715035Z", "url": "https://files.pythonhosted.org/packages/b5/fd/e7048c496d0da592bafe18f31d0693d0ad10c08d678b53fc0a8ac8292dab/fdict-0.8.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:43:09 2020"}