{"info": {"author": "Eldest Daughter, LLC., Free Ebook Foundation", "author_email": "gcaprio@eldestdaughter.com, eric@hellman.net", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Web Environment", "Framework :: Django", "Intended Audience :: Developers", "License :: OSI Approved :: BSD License", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3.6"], "description": "# FEF Questionnaire\n\n## Introduction\n\nFEF Questionnaire is a Django questionnaire app which is easily customizable\nand includes advanced dependency support using boolean expressions.\n\nIt allows an administrator to create and edit questionnaires in the Django\nadmin interface, with support for multiple languages.\n\nIt can be run either as a survey where subjects are solicited by email, or as a web-based poll.\n\nIn either mode, an instance can be linked to an arbitrary object via the django content-types module.\n\nTry out the questionaire on the Unglue.it page for \"Open Access Ebooks\" https://unglue.it/work/82028/\n\n## History\n\nThe questionnaire app was originally developed by [Seantis](https://github.com/seantis), itself derived from [rmt](https://github.com/rmt). Eldest Daughter picked up the project and named it [ED-questionnaire](git://github.com/eldest-daughter/ed-questionnaire)  because they had been using it and the Seantis version had entered a steady state of development. There are several feature changes they wanted and decided to head up the maintenance themselves.\n\nThe old versions are tagged as follows:\n\n * tag 1.0 - state of last commit by the original developer (rmt)\n * tag 1.1 - contains merged changes by other forks improving the original\n * tag 2.0 - original updated trunk from Seantis version\n * tag 2.5 - contains the original Seantis version and all PRs merged in as of 12/09/15. It's considered to be the backwards compatible version of the repository.\n\nThe \"ED-questionnaire\" version was dubbed v3.0. It is not compatible with the v2.x branches.\n\nThe \"FEF-questionnaire\" version was created to add the ability to link the questionnaire to individual books in a book database. We'll call this v4.0. The app was extensively renovated and updated. This work was funded by the Mellon Foundation as part of the [Mapping the Free Ebook Supply Chain Project](https://www.publishing.umich.edu/projects/mapping-the-free-ebook/).\n\n## About this Manual\n\nQuestionnaire was not a very well documented app so far to say the least. This manual should give you a general idea of the layout and concepts of it, but please help us improve it.\n\nWhat it does cover is the following:\n\n * **Integration** lays out the steps needed to create a new Django app together with the questionnaire. The same steps can be used to integrate the questionnaire into an existing site (though you would be entering unpaved ways).\n * **Concepts** talks about the data model and the design of the application.\n * **Migration** explains how a questionnaire defined with 1.0 can be used in 2.0.\n * **2.0 Postmortem** talks about some experiences made during the development of 2.0.\n\n    \n    \n## Integration\n\n### Install\n\nIf you just want to install, start with \n\n    pip install fef-Questionnaire\n    \n### Example Setup\n\nThis part of the docs will take you through the steps needed to create a questionnaire app from scratch. It should also be quite handy for the task of integrating the questionnaire into an existing site.\n\nFirst, create a folder for your new site:\n\n    mkdir site\n    cd site\n\nCreate a virtual environment so your python packages don't influence your system\n    \n    virtualenv --no-site-packages -p python2.7 .\n\nActivate your virtual environment\n\n    source bin/activate\n\nInstall Django\n\n    pip install django==1.8.18\n\nCreate your Django site\n\n    django-admin.py startproject example\n\nCreate a place for the questionnare\n\n    cd example\n    mkdir apps\n    cd apps\n\nClone the questionnaire source\n\n    git clone git://github.com/EbookFoundation/fef-questionnaire.git\n\nYou should now have a fef-questionnaire folder in your apps folder\n\n    cd fef-questionnaire\n\nThe next step is to install the questionnaire.\n\n    python setup.py install\n\nIf you are working with ed-questionnaire from your own fork you may want to use `python setup.py develop` instead, which will save you from running `python setup.py install` every time the questionnaire changes.\n\nNow let's configure your basic questionnaire OR copy the settings.py, urls.py, and models.py files from the \"example\" folder into `example/example`, then skip down to [initialize your database](#initialize-the-database).\n\n\nAlso add the locale and request cache middleware to MIDDLEWARE_CLASSES:\n\n    'questionnaire.request_cache.RequestCacheMiddleware'\n\nAdd the questionnaire template directory as well as your own to TEMPLATES:\n\n    'DIRS': [os.path.join(BASE_DIR, 'example/templates/')],\n\nIf you want to use multiple languages, add the i18n context processor to TEMPLATES\n    'context_processors': ['django.template.context_processors.i18n',]\n\nNow add `transmeta`, `questionnaire` to your INSTALLED_APPS:\n\n    'transmeta',\n    'questionnaire',\n    'questionnaire.page',\n\nTo finish the settings, add the fef-questionaire specific parameters. For our example, we'll use:\n    \n    QUESTIONNAIRE_PROGRESS = 'async'\n    QUESTIONNAIRE_USE_SESSION = False\n    QUESTIONNAIRE_ITEM_MODEL = 'example.Book'\n    QUESTIONNAIRE_SHOW_ITEM_RESULTS = True\n\nNext up we want to edit the `urls.py` file of your project to link the questionnaire views to your site's url configuration. The example app shows you how.\n\nFinally, we want to add a model to the example app for us to link our questionnaires to. It needs to have a back-relation named \"items\"\n\n    class Book(models.Model):\n        title = models.CharField(max_length=1000, default=\"\")\n        landings = GenericRelation(Landing, related_query_name='items')\n        def __unicode__(self):\n            return self.title\n\n\n### Initialize the database\n\nHaving done that we can initialize our database. (For this to work you must have set up your DATABASES in `settings.py`.). First, in your CLI navigate back to the `example` folder:\n\n    cd ../..\n\nThe check that you are in the proper folder, type `ls`: if you can see `manage.py` in your list of files, you are good. Otherwise, find your way to the folder that contains that file. Then type:\n\n    python manage.py migrate\n\nYou will be asked to create a superuser.\n\nThe questionnaire expects a `base-questionnaire.html` template to be there, with certain stylesheets and blocks inside. Have a look at `./apps/fef-questionnaire/example/templates/base-questionnaire.html`. if you're adding the app to an existing project.\n\nCongratulations, you have setup the basics of the questionnaire! At this point this site doesn't really do anything, as there are no questionnaires defined.\n\n### Internationalizating the database\n\nFirst, you want to setup the languages used in your questionnaire. Open up your `example` folder in your favorite text editor.\n\nOpen `example/example/settings.py` and add following lines, representing your languages of choice:\n\n    LANGUAGES = (\n        ('en', 'English'),\n        ('de', 'Deutsch')\n    )\n\nNow, you'll need to \n\n    python manage.py makemigrations\n    python manage.py migrate\n\nIf you want to use multiple languages, add the i18n context processor to TEMPLATES\n    'context_processors': ['django.template.context_processors.i18n',]\n    \nand set up middleware as described in the [Django translation docs](https://docs.djangoproject.com/en/1.8/topics/i18n/translation/)\n\nTo see example questionnaires you can do the following (Note: this will only work if you have both English and German defined as Languages in `settings.py`):\n\n    python manage.py loaddata ./apps/fef-questionnaire/example/fixtures/example.yaml\n    python manage.py loaddata ./apps/fef-questionnaire/example/fixtures/books.yaml\n\n\n### Start the server!\n\nStart your development server:\n\n    python manage.py runserver\n\nAnd navigate to [localhost:8000](http://localhost:8000/).\n\nFirst, go to the admin console and log yourself in. Otherwise, there won't be items for you to link  questionnaires to.\n\nTake a questionnaire. the \"Example\" has English and German translations. the \"MappingSurvey\" is English only.\n\n\n\n## Concepts\n\nThe ED Questionnaire has the following tables, described in detail below.\n\n * Subject\n * RunInfo\n * RunInfoHistory\n * Question\n * Choice\n * QuestionSet\n * Questionnaire\n * Answer\n * Landing\n\n### Subject\n\nA subject is someone filling out a questionnaire. \n\nSubjects are primarily useful in a study where the participants answer a questionnaire repeatedly. In this case a subject may be entered. Whoever is conducting the study (i.e. the person running the questionnaire app), may then periodically send emails inviting the subjects to fill out the questionnaire.\n\nSending Emails is covered in detail later.\n\nOf course, not every questionnaire is part of a study. Sometimes you just want to find out what people regard as more awesome: pirates or ninjas*? \n\n*(it's pirates!)\n\nThough a poll would be a better choice for this example, one can find the answer to that question with ED Questionnaire by using an anonymous subject. The next chapter *Questionnaire* will talk about that in more detail.\n\n### RunInfo\n\nA runinfo refers to the currently active run of a subject.\n\nA subject who is presently taking a questionnaire is considered to be on a run. The runinfo refers to that run and carries information about it.\n\nThe most important information associated with a runinfo is the subject, a random value that is used to generate the unique url to the questionnaire, the result of already answered questions and the progress.\n\nOnce a run is over it is deleted with some information being carried over to the RunInfoHistory.\n\nRuns can be tagged by any number of comma separated tags. If tags are used, questions can be made to only show up if the given tag is part of the RunInfo.\n\n### RunInfoHistory\n\nThe runinfo history is used to refer to a set of answers.\n\n### Question\n\nA question is anything you want to ask a subject. There are a number of different types you can use:\n\n * **choice-yesno** - Yes or No\n * **choice-yesnocomment** - Yes or No with a chance to comment on the answer\n * **choice-yesnodontknow** - Yes or No or Whaaa?\n * **open** - A simple one line input box\n * **open-textfield** - A box for lengthy answers\n * **choice** - A list of choices to choose from\n * **choice-freeform** - A list of choices with a chance to enter something else\n * **choice-multiple** - A list of choices with multiple answers\n * **choice-multiple-freeform** - Multiple Answers with multiple user defined answers\n * **range** - A range of number from which one number can be chosen\n * **number** - A number\n * **timeperiod** - A timeperiod\n * **custom** - Custom question using a custom template\n * **comment** - Not a question, but only a comment displayed to the user\n * **sameas** - Same type as another question\n\n*Some of these types, depend on checks or choices. The number question for instance can be controlled by setting the checks to something like `range=1-100 step=1`. The range question may also use the before-mentioned checks and also `unit=%`. Other questions like the choice-multiple-freeform need a `extracount=10` if ten extra options should be given to the user.\n\nI would love to go into all the details here but time I have not so I my only choice is to kindly refer you to the qprocessor submodule which handles all the question types.*\n\nNext up is the question number. The question number defines the order of questions alphanumerically as long as a number of questions are shown on the same page. The number is also used to refer to the question.\n\nThe text of the question is what the user will be asked. There can be one text for each language defined in the `settings.py` file.\n\nThe extra is an additional piece of information shown to the user. As of yet not all questions support this, but most do.\n\nAn important aspect of questions (and their parents, QuestionSets) is the checks field. The checks field does a lot of things (possibly too many), the most important of which is to define if a certain question or questionset should be shown to the current subject.\n\nThe most important checks on the question are the following:\n\n * **required** A required question must be answered by the user\n * **requiredif=\"number,answer\"**  Means that the question is required if the question with *number* is equal to *answer*.\n * **shownif** Same as requiredif, but defining if the question is shown at all.\n * **maleonly** Only shown to male subjects\n * **femaleonly** Only shown to female subjects\n * **iftag=\"tag\"** Question is only shown if the given tag is in the RunInfo\n\nChecks allow for simple boolean expressions like this:\n`iftag=\"foo or bar\"` or `requiredif=\"1,yes and 2,no\"`\n\n### Choice\n\nA choice is a possible value for a multiple choice question.\n\n### QuestionSet\n\nA number of questions together form a questionset. A questionset is ultimately single page of questions. Questions in the same questionset are shown on the same page.\n\nQuestionSets also have checks, with the same options as Questions. There's only one difference, **required** and **requiredif** don't do anything.\n\nA questionset which contains no visible questions (as defined by **shownif**) is skipped.\n\n### Answer\n\nContains the answer to a question. The value of the answer is stored as JSON.\n\n### Questionnaire \n\nA questionnaire is a group of questionsets together.\n\n### Landing \n\nIn Poll mode, the landing url links a Questionnaire to an Object and a User to a Subject. This is useful if you have a database of things you want to ask questions about.\n\nMigration of 1.x to 2.0\n-----------------------\n\nVersion 4.0 does not support migration of 1.X data files.\n\n2.0 Postmortem\n--------------\n\n2.0 was the result of the work we put into Seantis questionnaire for our second project with it. We did this project without the help of the questionnaire's creator and were pretty much on our own during that time.\n\nHere's what we think we learned:\n\n### Questionnaire is a Framework\n\nMore than anything else ed.questionnaire should be thought of as a framework. Your site has to provide and do certain things for the questionnaire to work. If your site is a customized questionnaire for a company with other needs on the same site you will end up integrating code which will call questionnaire to setup runs and you will probably work through the answer records to provide some sort of summary.\n\nIf it was a library you could just work with a nice API, which does not exist.\n\n### Don't Go Crazy with Your Checks\n\nWe used a fair amount of checks in both questionset and questions to control a complex questionnaire. We offloaded the complexity of the questionnaire into an Excel file defined by the customer and generated checks to copy that complexity into our application.\n\nThough this approach certainly works fine it does not give you a good performance. The problem is, if you have hundreds of questions controlled by runinfo tags, that you end up with most CPU cycles spent on calculating the progress bar on each request. It is precisely for that reason that we implemented the QUESTIONNAIRE_PROGRESS setting (you can learn more about that by looking at the example settings.py).\n\nWe managed to keep our rendering time low by doing the progress bar using AJAX after a page was rendered. It is only a workaround though. Calculating the progress of a run in a huge questionnaire remains a heavy operation, so for really huge questionnaires one might consider removing the progress bar altogether. There is still some optimization to be made, but it essentially will remain the slowest part of the questionnaire, because at the end of the day interpreting loads of checks is not something you can do in a fast way, unless your name is PyPy and your programmers are insanely talented.\n\n### There are not Enough Tests\n\nThere are a few that do some simple testing, but more are needed. More tests would also mean that more refactoring could be done which would be nice, because there certainly is a need for some refactoring.\n\n### The Admin Interface is not Good Enough\n\nDjango admin is a nice feature to have, but we either don't leverage it well enough, or it is not the right tool for the questionnaire. In any case, if you are expecting your customer to work with the questionnaire's structure you might have to write your own admin interface. The current one is not good enough.\n\n4.0 Changes\n--------------\nVersion 4.0 has not been tested for compatibility with previous versions.\n\n* Broken back links have been fixed. The application works in session mode and non-session mode.\n* We've updated to Bootstrap 3.3.6 and implemented label tags for accessibility\n* \"landings\" have been added so that survey responses can be linked to arbitrary models in an application. template tags have been added that allow questions and answers to refer to those models.\n* question types have been added so that choices can be offered without making the question required.\n* styling of required questions has been spiffed up.\n* export of response data has been fixed.\n* compatibility with Django 1.8. Compatibility with other versions of Django has not been tested.\n* refactoring of views\n* documentation has been updated to reflect Django 1.8.\n* email and subject functionality has not been tested\n\n4.0.1\n---------------\nUpdated for Django 1.11\n\n5.0\n---------------\nUpdated for Python 3.6", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/EbookFoundation/fef-questionnaire", "keywords": "", "license": "BSD", "maintainer": "", "maintainer_email": "", "name": "fef-questionnaire", "package_url": "https://pypi.org/project/fef-questionnaire/", "platform": "", "project_url": "https://pypi.org/project/fef-questionnaire/", "project_urls": {"Homepage": "https://github.com/EbookFoundation/fef-questionnaire"}, "release_url": "https://pypi.org/project/fef-questionnaire/5.0/", "requires_dist": null, "requires_python": "", "summary": "A Django application for creating online questionnaires/surveys.", "version": "5.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>FEF Questionnaire</h1>\n<h2>Introduction</h2>\n<p>FEF Questionnaire is a Django questionnaire app which is easily customizable\nand includes advanced dependency support using boolean expressions.</p>\n<p>It allows an administrator to create and edit questionnaires in the Django\nadmin interface, with support for multiple languages.</p>\n<p>It can be run either as a survey where subjects are solicited by email, or as a web-based poll.</p>\n<p>In either mode, an instance can be linked to an arbitrary object via the django content-types module.</p>\n<p>Try out the questionaire on the Unglue.it page for \"Open Access Ebooks\" <a href=\"https://unglue.it/work/82028/\" rel=\"nofollow\">https://unglue.it/work/82028/</a></p>\n<h2>History</h2>\n<p>The questionnaire app was originally developed by <a href=\"https://github.com/seantis\" rel=\"nofollow\">Seantis</a>, itself derived from <a href=\"https://github.com/rmt\" rel=\"nofollow\">rmt</a>. Eldest Daughter picked up the project and named it <a>ED-questionnaire</a>  because they had been using it and the Seantis version had entered a steady state of development. There are several feature changes they wanted and decided to head up the maintenance themselves.</p>\n<p>The old versions are tagged as follows:</p>\n<ul>\n<li>tag 1.0 - state of last commit by the original developer (rmt)</li>\n<li>tag 1.1 - contains merged changes by other forks improving the original</li>\n<li>tag 2.0 - original updated trunk from Seantis version</li>\n<li>tag 2.5 - contains the original Seantis version and all PRs merged in as of 12/09/15. It's considered to be the backwards compatible version of the repository.</li>\n</ul>\n<p>The \"ED-questionnaire\" version was dubbed v3.0. It is not compatible with the v2.x branches.</p>\n<p>The \"FEF-questionnaire\" version was created to add the ability to link the questionnaire to individual books in a book database. We'll call this v4.0. The app was extensively renovated and updated. This work was funded by the Mellon Foundation as part of the <a href=\"https://www.publishing.umich.edu/projects/mapping-the-free-ebook/\" rel=\"nofollow\">Mapping the Free Ebook Supply Chain Project</a>.</p>\n<h2>About this Manual</h2>\n<p>Questionnaire was not a very well documented app so far to say the least. This manual should give you a general idea of the layout and concepts of it, but please help us improve it.</p>\n<p>What it does cover is the following:</p>\n<ul>\n<li><strong>Integration</strong> lays out the steps needed to create a new Django app together with the questionnaire. The same steps can be used to integrate the questionnaire into an existing site (though you would be entering unpaved ways).</li>\n<li><strong>Concepts</strong> talks about the data model and the design of the application.</li>\n<li><strong>Migration</strong> explains how a questionnaire defined with 1.0 can be used in 2.0.</li>\n<li><strong>2.0 Postmortem</strong> talks about some experiences made during the development of 2.0.</li>\n</ul>\n<h2>Integration</h2>\n<h3>Install</h3>\n<p>If you just want to install, start with</p>\n<pre><code>pip install fef-Questionnaire\n</code></pre>\n<h3>Example Setup</h3>\n<p>This part of the docs will take you through the steps needed to create a questionnaire app from scratch. It should also be quite handy for the task of integrating the questionnaire into an existing site.</p>\n<p>First, create a folder for your new site:</p>\n<pre><code>mkdir site\ncd site\n</code></pre>\n<p>Create a virtual environment so your python packages don't influence your system</p>\n<pre><code>virtualenv --no-site-packages -p python2.7 .\n</code></pre>\n<p>Activate your virtual environment</p>\n<pre><code>source bin/activate\n</code></pre>\n<p>Install Django</p>\n<pre><code>pip install django==1.8.18\n</code></pre>\n<p>Create your Django site</p>\n<pre><code>django-admin.py startproject example\n</code></pre>\n<p>Create a place for the questionnare</p>\n<pre><code>cd example\nmkdir apps\ncd apps\n</code></pre>\n<p>Clone the questionnaire source</p>\n<pre><code>git clone git://github.com/EbookFoundation/fef-questionnaire.git\n</code></pre>\n<p>You should now have a fef-questionnaire folder in your apps folder</p>\n<pre><code>cd fef-questionnaire\n</code></pre>\n<p>The next step is to install the questionnaire.</p>\n<pre><code>python setup.py install\n</code></pre>\n<p>If you are working with ed-questionnaire from your own fork you may want to use <code>python setup.py develop</code> instead, which will save you from running <code>python setup.py install</code> every time the questionnaire changes.</p>\n<p>Now let's configure your basic questionnaire OR copy the settings.py, urls.py, and models.py files from the \"example\" folder into <code>example/example</code>, then skip down to <a href=\"#initialize-the-database\" rel=\"nofollow\">initialize your database</a>.</p>\n<p>Also add the locale and request cache middleware to MIDDLEWARE_CLASSES:</p>\n<pre><code>'questionnaire.request_cache.RequestCacheMiddleware'\n</code></pre>\n<p>Add the questionnaire template directory as well as your own to TEMPLATES:</p>\n<pre><code>'DIRS': [os.path.join(BASE_DIR, 'example/templates/')],\n</code></pre>\n<p>If you want to use multiple languages, add the i18n context processor to TEMPLATES\n'context_processors': ['django.template.context_processors.i18n',]</p>\n<p>Now add <code>transmeta</code>, <code>questionnaire</code> to your INSTALLED_APPS:</p>\n<pre><code>'transmeta',\n'questionnaire',\n'questionnaire.page',\n</code></pre>\n<p>To finish the settings, add the fef-questionaire specific parameters. For our example, we'll use:</p>\n<pre><code>QUESTIONNAIRE_PROGRESS = 'async'\nQUESTIONNAIRE_USE_SESSION = False\nQUESTIONNAIRE_ITEM_MODEL = 'example.Book'\nQUESTIONNAIRE_SHOW_ITEM_RESULTS = True\n</code></pre>\n<p>Next up we want to edit the <code>urls.py</code> file of your project to link the questionnaire views to your site's url configuration. The example app shows you how.</p>\n<p>Finally, we want to add a model to the example app for us to link our questionnaires to. It needs to have a back-relation named \"items\"</p>\n<pre><code>class Book(models.Model):\n    title = models.CharField(max_length=1000, default=\"\")\n    landings = GenericRelation(Landing, related_query_name='items')\n    def __unicode__(self):\n        return self.title\n</code></pre>\n<h3>Initialize the database</h3>\n<p>Having done that we can initialize our database. (For this to work you must have set up your DATABASES in <code>settings.py</code>.). First, in your CLI navigate back to the <code>example</code> folder:</p>\n<pre><code>cd ../..\n</code></pre>\n<p>The check that you are in the proper folder, type <code>ls</code>: if you can see <code>manage.py</code> in your list of files, you are good. Otherwise, find your way to the folder that contains that file. Then type:</p>\n<pre><code>python manage.py migrate\n</code></pre>\n<p>You will be asked to create a superuser.</p>\n<p>The questionnaire expects a <code>base-questionnaire.html</code> template to be there, with certain stylesheets and blocks inside. Have a look at <code>./apps/fef-questionnaire/example/templates/base-questionnaire.html</code>. if you're adding the app to an existing project.</p>\n<p>Congratulations, you have setup the basics of the questionnaire! At this point this site doesn't really do anything, as there are no questionnaires defined.</p>\n<h3>Internationalizating the database</h3>\n<p>First, you want to setup the languages used in your questionnaire. Open up your <code>example</code> folder in your favorite text editor.</p>\n<p>Open <code>example/example/settings.py</code> and add following lines, representing your languages of choice:</p>\n<pre><code>LANGUAGES = (\n    ('en', 'English'),\n    ('de', 'Deutsch')\n)\n</code></pre>\n<p>Now, you'll need to</p>\n<pre><code>python manage.py makemigrations\npython manage.py migrate\n</code></pre>\n<p>If you want to use multiple languages, add the i18n context processor to TEMPLATES\n'context_processors': ['django.template.context_processors.i18n',]</p>\n<p>and set up middleware as described in the <a href=\"https://docs.djangoproject.com/en/1.8/topics/i18n/translation/\" rel=\"nofollow\">Django translation docs</a></p>\n<p>To see example questionnaires you can do the following (Note: this will only work if you have both English and German defined as Languages in <code>settings.py</code>):</p>\n<pre><code>python manage.py loaddata ./apps/fef-questionnaire/example/fixtures/example.yaml\npython manage.py loaddata ./apps/fef-questionnaire/example/fixtures/books.yaml\n</code></pre>\n<h3>Start the server!</h3>\n<p>Start your development server:</p>\n<pre><code>python manage.py runserver\n</code></pre>\n<p>And navigate to <a href=\"http://localhost:8000/\" rel=\"nofollow\">localhost:8000</a>.</p>\n<p>First, go to the admin console and log yourself in. Otherwise, there won't be items for you to link  questionnaires to.</p>\n<p>Take a questionnaire. the \"Example\" has English and German translations. the \"MappingSurvey\" is English only.</p>\n<h2>Concepts</h2>\n<p>The ED Questionnaire has the following tables, described in detail below.</p>\n<ul>\n<li>Subject</li>\n<li>RunInfo</li>\n<li>RunInfoHistory</li>\n<li>Question</li>\n<li>Choice</li>\n<li>QuestionSet</li>\n<li>Questionnaire</li>\n<li>Answer</li>\n<li>Landing</li>\n</ul>\n<h3>Subject</h3>\n<p>A subject is someone filling out a questionnaire.</p>\n<p>Subjects are primarily useful in a study where the participants answer a questionnaire repeatedly. In this case a subject may be entered. Whoever is conducting the study (i.e. the person running the questionnaire app), may then periodically send emails inviting the subjects to fill out the questionnaire.</p>\n<p>Sending Emails is covered in detail later.</p>\n<p>Of course, not every questionnaire is part of a study. Sometimes you just want to find out what people regard as more awesome: pirates or ninjas*?</p>\n<p>*(it's pirates!)</p>\n<p>Though a poll would be a better choice for this example, one can find the answer to that question with ED Questionnaire by using an anonymous subject. The next chapter <em>Questionnaire</em> will talk about that in more detail.</p>\n<h3>RunInfo</h3>\n<p>A runinfo refers to the currently active run of a subject.</p>\n<p>A subject who is presently taking a questionnaire is considered to be on a run. The runinfo refers to that run and carries information about it.</p>\n<p>The most important information associated with a runinfo is the subject, a random value that is used to generate the unique url to the questionnaire, the result of already answered questions and the progress.</p>\n<p>Once a run is over it is deleted with some information being carried over to the RunInfoHistory.</p>\n<p>Runs can be tagged by any number of comma separated tags. If tags are used, questions can be made to only show up if the given tag is part of the RunInfo.</p>\n<h3>RunInfoHistory</h3>\n<p>The runinfo history is used to refer to a set of answers.</p>\n<h3>Question</h3>\n<p>A question is anything you want to ask a subject. There are a number of different types you can use:</p>\n<ul>\n<li><strong>choice-yesno</strong> - Yes or No</li>\n<li><strong>choice-yesnocomment</strong> - Yes or No with a chance to comment on the answer</li>\n<li><strong>choice-yesnodontknow</strong> - Yes or No or Whaaa?</li>\n<li><strong>open</strong> - A simple one line input box</li>\n<li><strong>open-textfield</strong> - A box for lengthy answers</li>\n<li><strong>choice</strong> - A list of choices to choose from</li>\n<li><strong>choice-freeform</strong> - A list of choices with a chance to enter something else</li>\n<li><strong>choice-multiple</strong> - A list of choices with multiple answers</li>\n<li><strong>choice-multiple-freeform</strong> - Multiple Answers with multiple user defined answers</li>\n<li><strong>range</strong> - A range of number from which one number can be chosen</li>\n<li><strong>number</strong> - A number</li>\n<li><strong>timeperiod</strong> - A timeperiod</li>\n<li><strong>custom</strong> - Custom question using a custom template</li>\n<li><strong>comment</strong> - Not a question, but only a comment displayed to the user</li>\n<li><strong>sameas</strong> - Same type as another question</li>\n</ul>\n<p>*Some of these types, depend on checks or choices. The number question for instance can be controlled by setting the checks to something like <code>range=1-100 step=1</code>. The range question may also use the before-mentioned checks and also <code>unit=%</code>. Other questions like the choice-multiple-freeform need a <code>extracount=10</code> if ten extra options should be given to the user.</p>\n<p>I would love to go into all the details here but time I have not so I my only choice is to kindly refer you to the qprocessor submodule which handles all the question types.*</p>\n<p>Next up is the question number. The question number defines the order of questions alphanumerically as long as a number of questions are shown on the same page. The number is also used to refer to the question.</p>\n<p>The text of the question is what the user will be asked. There can be one text for each language defined in the <code>settings.py</code> file.</p>\n<p>The extra is an additional piece of information shown to the user. As of yet not all questions support this, but most do.</p>\n<p>An important aspect of questions (and their parents, QuestionSets) is the checks field. The checks field does a lot of things (possibly too many), the most important of which is to define if a certain question or questionset should be shown to the current subject.</p>\n<p>The most important checks on the question are the following:</p>\n<ul>\n<li><strong>required</strong> A required question must be answered by the user</li>\n<li><strong>requiredif=\"number,answer\"</strong>  Means that the question is required if the question with <em>number</em> is equal to <em>answer</em>.</li>\n<li><strong>shownif</strong> Same as requiredif, but defining if the question is shown at all.</li>\n<li><strong>maleonly</strong> Only shown to male subjects</li>\n<li><strong>femaleonly</strong> Only shown to female subjects</li>\n<li><strong>iftag=\"tag\"</strong> Question is only shown if the given tag is in the RunInfo</li>\n</ul>\n<p>Checks allow for simple boolean expressions like this:\n<code>iftag=\"foo or bar\"</code> or <code>requiredif=\"1,yes and 2,no\"</code></p>\n<h3>Choice</h3>\n<p>A choice is a possible value for a multiple choice question.</p>\n<h3>QuestionSet</h3>\n<p>A number of questions together form a questionset. A questionset is ultimately single page of questions. Questions in the same questionset are shown on the same page.</p>\n<p>QuestionSets also have checks, with the same options as Questions. There's only one difference, <strong>required</strong> and <strong>requiredif</strong> don't do anything.</p>\n<p>A questionset which contains no visible questions (as defined by <strong>shownif</strong>) is skipped.</p>\n<h3>Answer</h3>\n<p>Contains the answer to a question. The value of the answer is stored as JSON.</p>\n<h3>Questionnaire</h3>\n<p>A questionnaire is a group of questionsets together.</p>\n<h3>Landing</h3>\n<p>In Poll mode, the landing url links a Questionnaire to an Object and a User to a Subject. This is useful if you have a database of things you want to ask questions about.</p>\n<h2>Migration of 1.x to 2.0</h2>\n<p>Version 4.0 does not support migration of 1.X data files.</p>\n<h2>2.0 Postmortem</h2>\n<p>2.0 was the result of the work we put into Seantis questionnaire for our second project with it. We did this project without the help of the questionnaire's creator and were pretty much on our own during that time.</p>\n<p>Here's what we think we learned:</p>\n<h3>Questionnaire is a Framework</h3>\n<p>More than anything else ed.questionnaire should be thought of as a framework. Your site has to provide and do certain things for the questionnaire to work. If your site is a customized questionnaire for a company with other needs on the same site you will end up integrating code which will call questionnaire to setup runs and you will probably work through the answer records to provide some sort of summary.</p>\n<p>If it was a library you could just work with a nice API, which does not exist.</p>\n<h3>Don't Go Crazy with Your Checks</h3>\n<p>We used a fair amount of checks in both questionset and questions to control a complex questionnaire. We offloaded the complexity of the questionnaire into an Excel file defined by the customer and generated checks to copy that complexity into our application.</p>\n<p>Though this approach certainly works fine it does not give you a good performance. The problem is, if you have hundreds of questions controlled by runinfo tags, that you end up with most CPU cycles spent on calculating the progress bar on each request. It is precisely for that reason that we implemented the QUESTIONNAIRE_PROGRESS setting (you can learn more about that by looking at the example settings.py).</p>\n<p>We managed to keep our rendering time low by doing the progress bar using AJAX after a page was rendered. It is only a workaround though. Calculating the progress of a run in a huge questionnaire remains a heavy operation, so for really huge questionnaires one might consider removing the progress bar altogether. There is still some optimization to be made, but it essentially will remain the slowest part of the questionnaire, because at the end of the day interpreting loads of checks is not something you can do in a fast way, unless your name is PyPy and your programmers are insanely talented.</p>\n<h3>There are not Enough Tests</h3>\n<p>There are a few that do some simple testing, but more are needed. More tests would also mean that more refactoring could be done which would be nice, because there certainly is a need for some refactoring.</p>\n<h3>The Admin Interface is not Good Enough</h3>\n<p>Django admin is a nice feature to have, but we either don't leverage it well enough, or it is not the right tool for the questionnaire. In any case, if you are expecting your customer to work with the questionnaire's structure you might have to write your own admin interface. The current one is not good enough.</p>\n<h2>4.0 Changes</h2>\n<p>Version 4.0 has not been tested for compatibility with previous versions.</p>\n<ul>\n<li>Broken back links have been fixed. The application works in session mode and non-session mode.</li>\n<li>We've updated to Bootstrap 3.3.6 and implemented label tags for accessibility</li>\n<li>\"landings\" have been added so that survey responses can be linked to arbitrary models in an application. template tags have been added that allow questions and answers to refer to those models.</li>\n<li>question types have been added so that choices can be offered without making the question required.</li>\n<li>styling of required questions has been spiffed up.</li>\n<li>export of response data has been fixed.</li>\n<li>compatibility with Django 1.8. Compatibility with other versions of Django has not been tested.</li>\n<li>refactoring of views</li>\n<li>documentation has been updated to reflect Django 1.8.</li>\n<li>email and subject functionality has not been tested</li>\n</ul>\n<h2>4.0.1</h2>\n<p>Updated for Django 1.11</p>\n<h2>5.0</h2>\n<p>Updated for Python 3.6</p>\n\n          </div>"}, "last_serial": 6839536, "releases": {"4.0.0": [{"comment_text": "", "digests": {"md5": "baa0c69b82d9e3f82e92b342a959ffaf", "sha256": "a150d64c5ba1a6d1832ed29b18cae7caa487856bb66bfee7ecdf2552a05f2424"}, "downloads": -1, "filename": "fef-questionnaire-4.0.0.tar.gz", "has_sig": false, "md5_digest": "baa0c69b82d9e3f82e92b342a959ffaf", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 130070, "upload_time": "2017-06-20T03:29:10", "upload_time_iso_8601": "2017-06-20T03:29:10.959259Z", "url": "https://files.pythonhosted.org/packages/2d/15/66dda90d365d4c2127ae717dfb3eeb015cb82d491156a8441513f98deea1/fef-questionnaire-4.0.0.tar.gz", "yanked": false}], "4.0.1": [{"comment_text": "", "digests": {"md5": "7f81d464135d8eef8f0e418a60494374", "sha256": "e2afa8876383cc3eebcc7d4c47253b4130bba43fe074889c09b6fa3a5d5fd90f"}, "downloads": -1, "filename": "fef-questionnaire-4.0.1.tar.gz", "has_sig": false, "md5_digest": "7f81d464135d8eef8f0e418a60494374", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 130495, "upload_time": "2017-12-12T17:45:57", "upload_time_iso_8601": "2017-12-12T17:45:57.724279Z", "url": "https://files.pythonhosted.org/packages/42/dc/f0a9994e75ab2ce00200ab2c9c473fdbe51df0b3fd76041e26f42e343a30/fef-questionnaire-4.0.1.tar.gz", "yanked": false}], "5.0": [{"comment_text": "", "digests": {"md5": "b4d21b1803b63a083902e26b1b12d522", "sha256": "4b44e6fc29267089e2af84ed1e4d7c9be34a2c61f12d1179df59d19729579dbe"}, "downloads": -1, "filename": "fef-questionnaire-5.0.tar.gz", "has_sig": false, "md5_digest": "b4d21b1803b63a083902e26b1b12d522", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 134725, "upload_time": "2020-03-18T20:53:13", "upload_time_iso_8601": "2020-03-18T20:53:13.731459Z", "url": "https://files.pythonhosted.org/packages/e7/e7/131be41cb8fb84444dbb8b2e87ce3921ffd60b0a55564c6064dafc8ef1a9/fef-questionnaire-5.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "b4d21b1803b63a083902e26b1b12d522", "sha256": "4b44e6fc29267089e2af84ed1e4d7c9be34a2c61f12d1179df59d19729579dbe"}, "downloads": -1, "filename": "fef-questionnaire-5.0.tar.gz", "has_sig": false, "md5_digest": "b4d21b1803b63a083902e26b1b12d522", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 134725, "upload_time": "2020-03-18T20:53:13", "upload_time_iso_8601": "2020-03-18T20:53:13.731459Z", "url": "https://files.pythonhosted.org/packages/e7/e7/131be41cb8fb84444dbb8b2e87ce3921ffd60b0a55564c6064dafc8ef1a9/fef-questionnaire-5.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:42:58 2020"}