{"info": {"author": "Bret Lowery", "author_email": "bret.lowery@gmail.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# FLAN: Fake (Access) Logs for Apache or NGINX\n\nFLAN is a Python 3.x utility that creates one or more fake Apache or NGINX access.log files with fake entries based on the entries from a real-world access.log file that you provide it. The name itself is actually fake: it can generate logs for anything that consumes NCSA Combined Log Format, but FLNCSACLF seems like the name of a Wonka-brand prescription nasal spray rather than a properly ascetic Github project acronym, so.\n\n----------------------\n### Feature Highlights\n1. It's fast, with speed enhancements like replay ability;\n2. It's real, generating its data in part from one or more example \"template\" log file(s) you provide and using valid IPs and user agent combos that make sense;\n3. You can optionally preserve sessions and session semantics while obfuscating their original source;\n4. Use different traffic distributions in your generated files: normal (bell curve), even (random), etc. between start and end dates you specify;\n5. You can include bot traffic, or not;\n6. You can include only bots that actually appear in your provided template log file, bots that occur in the wild (in the proportions they actually occur in), both, or no bots at all;\n7. You can include only user agents found in your template file, user agents that are common in the wild (in the proportions they actually occur in), or both;\n8. Supports and obfuscates both IPv4 and IPv6, using intelligent rules that guarantee valid global IPs while maintaining non-global IPs like loopback and private networks as-is without obfuscation;\n9. Write to files, or stream results to stdout;\n10. Optionally gzip any or all generated log files.\n11. Run interactively, or as a service/daemon.\n\n--------------\n### Supported Template Log Input Sources\n  * Uncompressed files in the standard access.log[.N] format\n  * Compressed files in the standard access.log[.N][.gz] format\n  * Splunk via the Enterprise API (from the log-formatted results of a customizable Splunk query)\n\n--------------\n### Supported Output Destinations\n  * Write/stream to stdout<br>\n  * Write to uncompressed files in the standard access.log.N format<br>\n  * Write to gzip files in the standard access.log.N.gz format<br>\n  * Splunk via the Enterprise API or Universal Forwarder (text or JSON)<br>\n  * Kafka (text, JSON or Avro)<br>\n  * ActiveMQ Artemis, Amazon MQ, RabbitMQ, Apollo, or any other STOMP 1.x-compliant queueing system (text or JSON)<br>\n  * FluentD (JSON)\n  * AWS SQS (Simple Queue Services)\n\n--------------\n### Real-World Use Cases\n\nTesting & using Splunk's ML features on real data to see what real patterns it finds, but doing so in a restricted POC lab environment...\n\nReplicating access log data from a production Splunk index to a non-production security team restricted index...\n\n_ALL while ensuring user, IP, and location anonymity AND session semantics!_\n\n--------------\n### Background\nI needed a way to test some systems that consume access.log entries in an environment where:\n\n1. Volume/scale was  high (millions of users/sessions);\n2. Production access.logs were protected with limited access for obvious reasons;\n3. Logs were hard to acquire (multiple approvals required every time; long turnaround times; no direct, easy paths between production and dev/test environments, etc);\n4. Logs had to be scrubbed once acquired, for (debateably) PII in the form of global IP addresses, and global IP address + HTTP user-agent combinations;\n5. Some specific use cases needed to be tested in the test environment: partner, SEO, etc. traffic with certain IPs, CIDRs, and/or user-agents;\n6. Some private network access on 10.0.0.0/8, 172.16.0.0/12, 192.168.0.0/16 needed to be tested as-is without being changed.\n\nand some other considerations.\n\nI looked for solutions but they lacked. 90% generated random data, including invalid IP addresses, or user agents that didn't match a real-world distribution of user-agents, which was important for my immediate needs (fraud research). The other 10% couldn't handle my special use cases, like preservation of partner/SEO bots and private network IPs. So, I created FLAN.\n\nFLAN generates up to 1K test access.log files of up to 1M records each, per run. On my Mac, it can generate 200K records in about 30 seconds in verbose mode with basic settings so it's way way fast on any ol' EC2 or GCE server including the free tier stuff.\n\n---------------------------------------------------------------\n### Flan generates log files semantically similar to YOUR production environment\nTo ensure your fake logs look as semantically real as your production ones, it reads one or more \"template\" access.logs from a real production system that you provide (hereinafter referred to as the \"template logs\"). It doesn't matter how many records the template logs contain, but the longer it/they are, the more realistic your generated fake logs will be. If you do NOT specify session preservation with the -p flag (described below), you can specify the number of files and records to generate, and your template log(s) can be bigger or smaller than your generated log file(s). If you specify session preservation, your generated log files will contain the same number of records as the total number of records contained in your template log file(s).\n\nTo provide more than one template log file, use wildcards; for example, \"/var/logs/access.log*\". Your template logs may be gzipped; if they have a \".gz\" extension, FLAN will unzip them when it reads them. You can mix both non-zipped and gzipped files in your wildcard spec.\n\nYou can specify the number of access.log file(s) you want to generate, and the entries per file. Access logs are created using the standard suffixes access.log, access.log.1, access.log.2, etc. \n\nYou can specify start and end datetimea for your generated log entries that can, but don't have to, match the dates in the template logs. There is no guarantee that entries *exactly* matching your start and end dates will be generated, however. They are just guaranteed to be between your selected dates. \n\n_IP addresses_<br><br>Global addresses in the template log are obfuscated. The last three (/24) or six (/16) digits of an IPv4, or the last four digits (/116) of an IPv6, are randomized. This provides minimal IP obfuscation while maximizing retention of other interesting properties in your IP addresses, like the geolocation of your users, commercial vs residential, etc. \n\nNon-global IPs (private, loopback, etc) are kept as-is. All generated IPs are guaranteed valid: for example, 192.168.0.0 is a network identifier and is never assigned to an interface, and 169.254.0.0/16 link-locals aren't routable, so it won't use any of those. \n\nThe -m parameter allows you to obfuscate IPs using either a one-to-many or one-to-one mapping. One-to-many will obfuscate the same IP to one or multiple random IPs in the resulting log files. One-to-one will ensure that IP \"X\" is obfuscated to the same IP \"Y\" every time during any given run. One-to-one mappings are not preserved between runs.\n\n_User Agents_<br><br>A basic bot-or-not check is made on all user agents in the template log. All user agents identified as bots are extracted and optionally replayed as-is into your generated fake logs, with their real originating IPs. \n\nReal-device agents are generated from a list of the top real-world user agents in the wild, weighted by frequency of occurrence, and matching the distribution of browser, os, and desktop/mobile possibilities that are found in your template log. If your template log contains only mobile Safari UAs, all you will see in your generated logs is mobile Safari UAs. If you have 70% mobile Chrome and 30% desktop all others in your template log, you will get that. \n\nYou have the ability to control what percentage of bots vs non-bot UAs you get (currently, this is hard-coded to what I use, 21.9% bots and 78.1% everything else, but that's easy to change). You can optionally include bots from a list of common bots found in the supplied user-agents.json file, an d/or optionally include only those bots that are found in your template file, or you can choose to include no bots at all. The -u and -b commandline parameters control what bots if any appear. See the commandline parameter descriptions for details. \n\n--------------------------\n### IP/User Agent Examples\n1. One template log entry with IP 123.4.5.6, Chromebook Mac UA is expanded to one or more generated entries with IPs in the range 123.4.5.0/24 (bc it's global) + Chromebook Mac UA\n\n2. One template log entry with IP 10.1.2.3, Linux, curl UA is expanded to one or more generated entries with IP 10.1.2.3 (bc it's private) + the same Linux curl UA\n\n3. Googlebot stays Googlebot: same UA, IPs\n\n----------------------\n### Time Distributions \nYou can specify the overall time distribution you want to appear in the logs, one of:\n\n*Normal*<br>Specifies that a normal distribution of entries should be generated, centered around the midpoint time-wise between your start and end datetimes. This is the default as most real-world web access follows natural wake/sleep cycles.\n\n*Even*<br>Specifies a random (even) distribution be used instead. You may want to use this if you are an international company and no one time zone wake/sleep cycle dominates your site/app usage patterns.\n\n----------------------\n### How many records does it generate?\n\n##### IF YOU ARE NOT CONTINUOUSLY STREAMING (-C IS NOT SPECIFIED)\n###### AND if you are writing output to files:\n> The total number of entries generated is equal to the -n parameter value TIMES the -r parameter value, spread in the selected distribution across the timeframe specified between the -s and -e parameter start and end datetimes. \n###### OR if you are streaming output to stdout, Kafka, Splunk, or another streaming target:\n> The total number of entries generated is equal the -r parameter value, spread in the selected distribution across the timeframe specified between the -s and -e parameter start and end datetimes. \n\n##### IF YOU ARE CONTINUOUSLY STREAMING (-C IS SPECIFIED) \n> The -e end datetime is ignored, and Flan streams records until settings.R_MAX (100,000,000) is reached, or you CTRL-C or shut the service down, or until it hits the UNIX maxdate or you run out of memory or something else and it errors out :-). Specify --pace to slow things down.\n\nNote: as of v0.0.31, session preservation (-p) no longer limits the number of records generated to the size of the template log(s). \n\n----------------------\n### What does it cost, resource-wise?\nMemory is the main resource used by Flan. Memory consumption is primarily influenced by two factors:\n\n1. The size of the template log file used and in particular the number of unique user agent strings within it, and;\n\n2. The need to cache an entire time distribution period in memory to \"keep the shape\" of the distribution as we go. The number of seconds between -s and -e determines how much memory is used by this.\n\nA 500K-record template log file with -n 10 -r 100000 uses less than 1GB memory on my Mac. Your results may vary. Use Flan's --profile switch to see memory consumed.\n\nDisk usage (if you're using file mode) is highly dependent on the length of the user agents and request paths. With my test file, using -n 10 -r 1000000 I get roughly 250MB of storage per file for a total of 2.5GB total disk.\n\nCPU cycles are mostly taken up by the hidden Bitcoin miner I've added (just kidding... Flan is not particularly CPU intensive). \n\nOverall runtime is dependent on the time range between your start and end dates, the size of your template log, and the total number of records you are generating. Larger template logs create more accurate output data, but take longer to parse and in particular to go through and obfuscate all of the user agents, given that they are pretty-free-form, often-lengthy strings. Use replay mode to minimize template log parse time. Quiet mode will also reduce runtime.\n\nI'm not currently supporting preservation of sessions across a time distribution period boundary. That would mean I'd have to keep multiple time distribution periods cached simultaneously, and that just eats memory alive. So for example, a 3-day range starting at midnight between start and end dates, using a normal distribution and session preservation, creates a \"3-humped\" pattern with saddles at midnight, peaks at noon, and sessions preserved within each day/hump but not spanning days/humps.\n\n## Instructions\n\nFlan is developed and tested on Python 3.7 (as of July 2019). It's untested on other versions. \n\n### Dependencies\n>  numpy <br>\n   python-dateutil <br>\n   pyYAML <br>\n   service <br>\n   ua-parser <br>\n   user-agents<br>\n>  boto (if using AWS integration)<br>\n   confluent_kafka (if using Kafka integration)<br>\n>  fluent-logger (if using FluentD integration)<br>\n   splunk-sdk (if using Splunk integration)<br>\n>  stomp.py (if using STOMP MQ integration)\n\n\n### Installation\n\n##### FROM PIP\n\n` pip install flan`\n\n##### FROM SOURCE\n\n1. Download and extract all *.py files, *requirements.txt files, and (optionally) user-agents.json to a installation directory of your choice. You don't need the tests folder or its contents if you are not running unit tests. This exercise is left to the reader.\n\n2. (Optional) Set up a Python 3.7 virtualenv and activate it. This exercise is left to the reader.\n\n3. Install dependency requirements. You may optionally first comment out any integration dependencies you don't need:\n\n   `pip install -r requirements.txt`\n\n4. Run setup.py:\n\n   `python setup.py install`\n\n   OPTION: if you (might) want to uninstall later, record the files created locally during install by using this command instead:\n\n   `python setup.py install --record flaninstalledfiles.txt`\n\n5. Run it:\n\n   `flan [arguments] template.log outputdir`\n\n### Uninstall\n\n   `xargs rm -rf < flaninstalledfiles.txt`\n\n### Update\n\nUninstall, then reinstall using the same installation instructions listed above.\n\n-------------------------\n## Syntax and Parameters\n\n##### INTERACTIVE MODE (uses commandline arguments)\n\nFile output:\n\n```\nflan -n <number of files to write> -r <number of records per file> [arguments] templatelogspec outputdir\n```\nStreaming output:\n\n```\nflan -c [-o outputtarget] [--pace] [arguments] templatelogspec\n```\n\n##### SERVICE/DAEMON MODE (uses flan.config.yaml)\n\n```\nflan [ start | stop | status ]\n```\n\n##### CONTROLLING FLAN VIA ARGUMENTS AND CONFIGS\n\nFor service mode, use flan.config.yaml instead of commandline arguments. Each of its entries map one-to-one to one of the arguments below. Quiet (-q), stats (--stats), profile (--profile), and overwrite (-w) are set to fixed defaults in service mode and if set in flan.config.yaml are ignored. flan.config.yaml is ignored in interactive mode.\n\n\n| Commandline Argument            | Definition                             | Default       |\n| ------------------- |:---------------------------------------| ------------- |\n| &#x2011;a | If specified, halt on any (i.e. the first) unparseable entries in your template log. | Skip any&all unparseable entries |\n| &#x2011;b,<br>&#x2011;&#x2011;botfilter | Iff -u is set to 'all' or 'bots', defines which bots appear in the generated log files, one of:<br><br>seen=only use bots that appear in the template log file and are identifiable as robotic;<br><br>unseen=only use bots found in the user-agents.json file (if used, this should be located in the same directory as flan.py);<br><br>all=use bots from both the template log and the user-agents.json file. | seen |\n| &#x2011;c | Continuous streaming mode. If enabled, ignores the -e setting, and streams entries continuously until settings.R_MAX is reached. -o must be specified. Not available for file output.| No continuous streaming |\n| &#x2011;d,<br>&#x2011;&#x2011;distribution | Defines the distribution of the timestamps across the period (the \"shape\") of the resulting entries. One of:<br><br>normal=use a normal distribution centered midway between start and end datetimes for the time dimension;<br><br>random=use a random (\"shotgun blast\") distribution. | normal |\n| &#x2011;e,<br>&#x2011;&#x2011;end | Specifies the end datetime to use for the generated log entries. All log entries will have a timestamp on or before this date. | Midnight tomorrow local/server time |\n| &#x2011;f,<br>&#x2011;&#x2011;ipfilter | If provided, this should specify one or more optional IP(s) and/or CIDR range(s) in quotes that all entries in the template log file must match in order to be used for output log generation. Only lines containing an IP that matches one or more of these will be used. Separate one or more IPs or CIDRs here by commas; for example, '--ipfilter \\\"123.4.5.6,145.0.0.0/16,2001:db8::/48\\\"'. | Use all otherwise eligible template log lines and their IPs in generating the output logs. |\n| &#x2011;g,<br>&#x2011;&#x2011;gzip | Gzip support. Used in conjunction with the passed -n value, this specifies a file index number at which to begin gzipping generated log files. It must be between 0 and the -n value provided. For example, \"-n 5 -g 3\" generates log files called \"access.log\", \"access.log.1\", \"access.log.2.gz\", \"access.log.3.gz\", and \"access.log.4.gz\": 5 total files, the last 3 of which are gzipped. | 0; no gzipping occurs. |\n| &#x2011;h | Print out these options on the commandline. | |\n| &#x2011;i<br>&#x2011;&#x2011;inputsource | The source of the input, one of: <br><br>files=load template log(s) from one or more files as controlled by the flan.files.yaml config file's \"import\" section;<br><br>splunk=load template logs from the NCSA Combined Log Format entries from the Splunk server and index specified in the flan.splunk.yaml file's \"import\" section. | files |\n| &#x2011;&#x2011;inputformat | The format of each line in the the template log file (a valid NCSA Combined Log Format string). | '$remote_addr - $remote_user [$time_local] \\\"$request\\\" $status $body_bytes_sent \\\"$http_referer\\\" \\\"$http_user_agent\\\"' |\n| &#x2011;j | Continuous streaming periodicity. If using continuous streaming (-c), defines the length of a single time distribution period in seconds (1d=exactly 24h; no leap minutes or days are taken into account). If using a normal distribution, the distribution will be this long, with the peak in the middle of it. | 86400 seconds (1 day) |\n| &#x2011;k | If specified, add single quotes to the beginning and end of every generated log entry line. | Do not add quotes. |\n| &#x2011;l,<br>&#x2011;&#x2011;linedelimiter | Line delimiter to append to all generated log entries, one of:<br><br>[None, No, False, N, F];<br>[Comma, C];<br>[Tab, T];<br>CR;<br>LF;<br>CRLF.| CRLF |\n| &#x2011;m,<br>&#x2011;&#x2011;ipmapping | Defines how IPs are obfuscated, one of:<br><br>otm24=map one IPv4 to up to 255 IPv4 /24 addresses or one IPv6 to up to ~65K IPv6 /116 addresses (session destroying);<br><br>otm16=map one IPv4 to up to 65535 IPv4 /16 addresses or one IPv6 to up to ~65K IPv6 /116 addresses (session destroying);<br><br>oto24=map one IPv4/IPv6 address to one IPv4/IPv6 address within the same /24 or /116 block (session preserving); <br><br>oto16=map one IPv4/IPv6 address to one IPv4/IPv6 address within the same /16 or /116 block (session preserving);<br><br>off=do not obfuscate IPs (session preserving).<br><br>Flan guarantees that global IPs stay global, private stay private, loopback stays loopback etc. post-obfuscation. Known bot IPs are not obfuscated, so (for example) Googlebot IPs stay the same. If -p (preserve sessions) is specified, this setting must be set to either \"none\", \"oto24\", or \"oto16\". | If -p is specified, \"oto24\". If -p is not specified, \"otm24\". |\n| &#x2011;&#x2011;meta | Replaces the old --stats parameter. Collect and emit (at the end) meta data and per-hour cumulative counts on all the log entries generated. Use this to identify the source of the log files and verify the spread across your chosen distribution. | No meta is emitted. | \n| &#x2011;n,<br>&#x2011;&#x2011;numfiles | The total number of access.log files to generate. Min=1, Max=1000. Example: '-n 4' creates access.log, access.log.1, access.log.2, and access.log.3 in the output directory. | 1 |\n| &#x2011;&#x2011;nouatag | If specified, excludes the \"Flan/<version#> (https://bret.guru/flan)\" from the user agent values in the generated log files. | Append the Flan UA tag to all generated UAs. |\n| &#x2011;o | Stream mode output target. If specified, ignores the output directory and -n flag values, and streams all output to the designated target. One of:<br><br>fluentd=stream to a FluentD remote as defined in the flan.fluentd.yaml config file's \"export\" section<br><br>kafka=stream to a Kafka pub/sub as defined in the flan.kafka.yaml config file's \"export\" section<br><br>splunk=stream to a Splunk Enterprise API as defined in the flan.splunk.yaml config file's \"export\" section<br><br>stompmq=stream to a Apache ActiveMQ, Amazon MQ, RabbitMQ, or other STOMP-compliant queue as defined in the flan.stompmq.yaml config file's \"export\" section<br><br>stdout=stream to stdout | No stream output. Output is written to file(s) in the output directory provided. |\n| &#x2011;&#x2011;outputformat | Format of individual emitted entries in the generated logs. A valid NCSA Combined Log Format string, or one of two special values:<br><br>json=emits entries in JSON format;<br><br>avro=emits JSON-encoded entries in Avro binary format. | '$remote_addr - $remote_user [$time_local] \\\"$request\\\" $status $body_bytes_sent \\\"$http_referer\\\" \\\"$http_user_agent\\\"' |\n| &#x2011;p | Session preservation. If specified, preserves sessions by maintaining the time index order of the request paths in the template log in the generated logs, and keeoping the same UA post-IP-obfuscation for each IP found in the template log. The -m ipmapping setting must be set to either \"onetoone\" or \"none\". | No session preservation. Request paths are randomly assigned throughout the generated time distribution, destroying sessions. |\n| &#x2011;&#x2011;pace | Pacing. If specified, syncs the timestamps in the generated log records with the current clock time as log entries are generated such that log entries are emitted in apparent 'real time'. Each second in the log timestamps corresponds to a second of emission time in real time. | Default=no pacing; emit entries as fast as possible. |\n| &#x2011;q | Basho-like stdout. | Proust-like stdout. |\n| &#x2011;r,<br>&#x2011;&#x2011;records | The number of entries to write per generated log file. Min=1, Max=100M. | 100,000,000 if -c is specified<br>10,000 if -c is NOT specified |\n| &#x2011;s,<br>&#x2011;&#x2011;start | Specifies the start datetime to use for the generated log entries. All log entries will have a timestamp on or after this date. | Midnight today local/server time |\n| &#x2011;t,<br>&#x2011;&#x2011;timeformat | Timestamp format to use in the generated log file(s), EXCLUDING TIMEZONE (see -z parameter), in Python strftime format (see http://strftime.org/). | '%-d/%b/%Y:%H:%M:%S' |\n| &#x2011;u,<br>&#x2011;&#x2011;uafilter | Defines the kinds of user agents that will appear in the generated log files, one of: <br><br>bots=bot UAs only;<br><br> nonbots=non-bot UAs only;<br><br>all=both bot and non-bot UAs. | all |\n| &#x2011;v | Print version number and immediately exit. | |\n| &#x2011;w | If specified, overwrites any generated log file(s) that already exist. This check is made before writing anything. | Error if any already exist, leaving any & all of them unchanged. |\n| &#x2011;x,<br>&#x2011;&#x2011;regex | Custom regex matching. Specifies a custom regex to use as a line-by-line filter for entries in the template log. Only lines that match the regex are included in log generation; lines that do not match are excluded. | All otherwise eligible lines in the template log file are used to generate logs. |\n| &#x2011;y | Replay logging. If specified, enables the replay log. Replay logging parses the template log file on first execution and stores the parsed results in a binary 'flan.replay' file located in the same directory as flan.py. On subsequent execution, Flan will load the already-parsed replay log rather than reparse the template log file, saving lots of time when reusing the same large template log repeatedly. Once created, the replay log is never overwritten or deleted; delete it manually first to recreate it on the next Flan run, if needed. If a replay log exists but -y is not specified, the replay log is ignored (neither read nor overwritten).| Do not use replay logs; parse the template log every time and ignore any existing replay log. |\n| &#x2011;z,<br>&#x2011;&#x2011;timezone | Timezone offset in (+/-)HHMM format to append to timestamps in the generated log file(s), or pass '' to specify no timezone. | Your current local/server timezone. |\n\n--------------------------------------------------\n### Where can I get access.log files to test with?\nTest log files are available in the tests folder.\n\nHere's another resource:\n\nhttps://gist.github.com/rm-hull/bd60aed44024e9986e3c\n\nOr, just Google \"example access.log files\".\n\n-----------------------\n### Future Enhancements\nDefinitely:\n\n1. Integrations: various AWS services, Google Cloud Pub/Sub, Redis Pub/Sub, Apache Flume, Apache Pulsar, Apache Nifi... If you want an integration, ask, or submit a PR.\n\nPossibly:\n\n1. Ability to specify the generation of specific CIDRs, ASNUM blocks, IP ranges, etc. There are certain use cases for this;\n\n2. Ability to inject custom data into the user-agent field, or alter the user agents in specific ways (map a user agent to another user agent) for downstream flagging/detection; \n\n3. Support other time distributions for specific use cases. Examples: heavy-tailed Poisson to model unlikely events/DDoS, discrete/degenerate distributions to emulate API/RESTful activity, etc. For considerations, see: \n<br/>https://en.wikipedia.org/wiki/Web_traffic \n<br/>https://www.nngroup.com/articles/traffic-log-patterns\n<br/>https://en.wikipedia.org/wiki/Traffic_generation_model\n<br>https://en.wikipedia.org/wiki/List_of_probability_distributions\n\n-------------\n### Citations\ncrawler-user-agents.json Copyright (c) 2019 Martin Monperrus <br>\nhttps://github.com/monperrus/crawler-user-agents/blob/master/crawler-user-agents.json\n\n----------------------\n### Disclaimer\n\nThe material embodied in this software is provided to you \"as-is\" and without warranty of any kind, express, implied or otherwise, including without limitation, any warranty of fitness for a particular purpose. Your use of this software in whole or part signifies your agreement that I am not liable to you or anyone else for any direct, special, incidental, indirect or consequential damages of any kind, or any damages whatsoever, including without limitation, loss of profit, loss of use, savings or revenue, or the claims of third parties, whether or not I have been advised of the possibility of such loss, however caused and on any theory of liability, arising out of or in connection with the possession, use or performance of this software.\n\n## PRs welcome!\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/bretlowery/flan", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "flan", "package_url": "https://pypi.org/project/flan/", "platform": "", "project_url": "https://pypi.org/project/flan/", "project_urls": {"Homepage": "https://github.com/bretlowery/flan"}, "release_url": "https://pypi.org/project/flan/0.0.37/", "requires_dist": ["python-dateutil (>=2.8.0)", "ua-parser (>=0.8.0)", "user-agents (>=2.0)", "numpy (>=1.16.4.0)", "service (>=0.6.0)", "PyYAML (>=5.1.2)", "boto (>=2.49.0)", "confluent-kafka (>=1.1.0)", "fluent-logger (>=0.9.3)", "pyspark (>=2.4.3)", "splunk-sdk (>=1.6.6)", "stomp.py (>=4.1.22)"], "requires_python": "", "summary": "Create (very good) fake NCSA Combined Log Format access.log files for testing log-consuming systems like Splunk, ActiveMQ, Amazon MQ, RabbitMQ, Kafka, FluentD, Flume, Pulsar, Nifi...", "version": "0.0.37", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>FLAN: Fake (Access) Logs for Apache or NGINX</h1>\n<p>FLAN is a Python 3.x utility that creates one or more fake Apache or NGINX access.log files with fake entries based on the entries from a real-world access.log file that you provide it. The name itself is actually fake: it can generate logs for anything that consumes NCSA Combined Log Format, but FLNCSACLF seems like the name of a Wonka-brand prescription nasal spray rather than a properly ascetic Github project acronym, so.</p>\n<hr>\n<h3>Feature Highlights</h3>\n<ol>\n<li>It's fast, with speed enhancements like replay ability;</li>\n<li>It's real, generating its data in part from one or more example \"template\" log file(s) you provide and using valid IPs and user agent combos that make sense;</li>\n<li>You can optionally preserve sessions and session semantics while obfuscating their original source;</li>\n<li>Use different traffic distributions in your generated files: normal (bell curve), even (random), etc. between start and end dates you specify;</li>\n<li>You can include bot traffic, or not;</li>\n<li>You can include only bots that actually appear in your provided template log file, bots that occur in the wild (in the proportions they actually occur in), both, or no bots at all;</li>\n<li>You can include only user agents found in your template file, user agents that are common in the wild (in the proportions they actually occur in), or both;</li>\n<li>Supports and obfuscates both IPv4 and IPv6, using intelligent rules that guarantee valid global IPs while maintaining non-global IPs like loopback and private networks as-is without obfuscation;</li>\n<li>Write to files, or stream results to stdout;</li>\n<li>Optionally gzip any or all generated log files.</li>\n<li>Run interactively, or as a service/daemon.</li>\n</ol>\n<hr>\n<h3>Supported Template Log Input Sources</h3>\n<ul>\n<li>Uncompressed files in the standard access.log[.N] format</li>\n<li>Compressed files in the standard access.log[.N][.gz] format</li>\n<li>Splunk via the Enterprise API (from the log-formatted results of a customizable Splunk query)</li>\n</ul>\n<hr>\n<h3>Supported Output Destinations</h3>\n<ul>\n<li>Write/stream to stdout<br></li>\n<li>Write to uncompressed files in the standard access.log.N format<br></li>\n<li>Write to gzip files in the standard access.log.N.gz format<br></li>\n<li>Splunk via the Enterprise API or Universal Forwarder (text or JSON)<br></li>\n<li>Kafka (text, JSON or Avro)<br></li>\n<li>ActiveMQ Artemis, Amazon MQ, RabbitMQ, Apollo, or any other STOMP 1.x-compliant queueing system (text or JSON)<br></li>\n<li>FluentD (JSON)</li>\n<li>AWS SQS (Simple Queue Services)</li>\n</ul>\n<hr>\n<h3>Real-World Use Cases</h3>\n<p>Testing &amp; using Splunk's ML features on real data to see what real patterns it finds, but doing so in a restricted POC lab environment...</p>\n<p>Replicating access log data from a production Splunk index to a non-production security team restricted index...</p>\n<p><em>ALL while ensuring user, IP, and location anonymity AND session semantics!</em></p>\n<hr>\n<h3>Background</h3>\n<p>I needed a way to test some systems that consume access.log entries in an environment where:</p>\n<ol>\n<li>Volume/scale was  high (millions of users/sessions);</li>\n<li>Production access.logs were protected with limited access for obvious reasons;</li>\n<li>Logs were hard to acquire (multiple approvals required every time; long turnaround times; no direct, easy paths between production and dev/test environments, etc);</li>\n<li>Logs had to be scrubbed once acquired, for (debateably) PII in the form of global IP addresses, and global IP address + HTTP user-agent combinations;</li>\n<li>Some specific use cases needed to be tested in the test environment: partner, SEO, etc. traffic with certain IPs, CIDRs, and/or user-agents;</li>\n<li>Some private network access on 10.0.0.0/8, 172.16.0.0/12, 192.168.0.0/16 needed to be tested as-is without being changed.</li>\n</ol>\n<p>and some other considerations.</p>\n<p>I looked for solutions but they lacked. 90% generated random data, including invalid IP addresses, or user agents that didn't match a real-world distribution of user-agents, which was important for my immediate needs (fraud research). The other 10% couldn't handle my special use cases, like preservation of partner/SEO bots and private network IPs. So, I created FLAN.</p>\n<p>FLAN generates up to 1K test access.log files of up to 1M records each, per run. On my Mac, it can generate 200K records in about 30 seconds in verbose mode with basic settings so it's way way fast on any ol' EC2 or GCE server including the free tier stuff.</p>\n<hr>\n<h3>Flan generates log files semantically similar to YOUR production environment</h3>\n<p>To ensure your fake logs look as semantically real as your production ones, it reads one or more \"template\" access.logs from a real production system that you provide (hereinafter referred to as the \"template logs\"). It doesn't matter how many records the template logs contain, but the longer it/they are, the more realistic your generated fake logs will be. If you do NOT specify session preservation with the -p flag (described below), you can specify the number of files and records to generate, and your template log(s) can be bigger or smaller than your generated log file(s). If you specify session preservation, your generated log files will contain the same number of records as the total number of records contained in your template log file(s).</p>\n<p>To provide more than one template log file, use wildcards; for example, \"/var/logs/access.log*\". Your template logs may be gzipped; if they have a \".gz\" extension, FLAN will unzip them when it reads them. You can mix both non-zipped and gzipped files in your wildcard spec.</p>\n<p>You can specify the number of access.log file(s) you want to generate, and the entries per file. Access logs are created using the standard suffixes access.log, access.log.1, access.log.2, etc.</p>\n<p>You can specify start and end datetimea for your generated log entries that can, but don't have to, match the dates in the template logs. There is no guarantee that entries <em>exactly</em> matching your start and end dates will be generated, however. They are just guaranteed to be between your selected dates.</p>\n<p><em>IP addresses</em><br><br>Global addresses in the template log are obfuscated. The last three (/24) or six (/16) digits of an IPv4, or the last four digits (/116) of an IPv6, are randomized. This provides minimal IP obfuscation while maximizing retention of other interesting properties in your IP addresses, like the geolocation of your users, commercial vs residential, etc.</p>\n<p>Non-global IPs (private, loopback, etc) are kept as-is. All generated IPs are guaranteed valid: for example, 192.168.0.0 is a network identifier and is never assigned to an interface, and 169.254.0.0/16 link-locals aren't routable, so it won't use any of those.</p>\n<p>The -m parameter allows you to obfuscate IPs using either a one-to-many or one-to-one mapping. One-to-many will obfuscate the same IP to one or multiple random IPs in the resulting log files. One-to-one will ensure that IP \"X\" is obfuscated to the same IP \"Y\" every time during any given run. One-to-one mappings are not preserved between runs.</p>\n<p><em>User Agents</em><br><br>A basic bot-or-not check is made on all user agents in the template log. All user agents identified as bots are extracted and optionally replayed as-is into your generated fake logs, with their real originating IPs.</p>\n<p>Real-device agents are generated from a list of the top real-world user agents in the wild, weighted by frequency of occurrence, and matching the distribution of browser, os, and desktop/mobile possibilities that are found in your template log. If your template log contains only mobile Safari UAs, all you will see in your generated logs is mobile Safari UAs. If you have 70% mobile Chrome and 30% desktop all others in your template log, you will get that.</p>\n<p>You have the ability to control what percentage of bots vs non-bot UAs you get (currently, this is hard-coded to what I use, 21.9% bots and 78.1% everything else, but that's easy to change). You can optionally include bots from a list of common bots found in the supplied user-agents.json file, an d/or optionally include only those bots that are found in your template file, or you can choose to include no bots at all. The -u and -b commandline parameters control what bots if any appear. See the commandline parameter descriptions for details.</p>\n<hr>\n<h3>IP/User Agent Examples</h3>\n<ol>\n<li>\n<p>One template log entry with IP 123.4.5.6, Chromebook Mac UA is expanded to one or more generated entries with IPs in the range 123.4.5.0/24 (bc it's global) + Chromebook Mac UA</p>\n</li>\n<li>\n<p>One template log entry with IP 10.1.2.3, Linux, curl UA is expanded to one or more generated entries with IP 10.1.2.3 (bc it's private) + the same Linux curl UA</p>\n</li>\n<li>\n<p>Googlebot stays Googlebot: same UA, IPs</p>\n</li>\n</ol>\n<hr>\n<h3>Time Distributions</h3>\n<p>You can specify the overall time distribution you want to appear in the logs, one of:</p>\n<p><em>Normal</em><br>Specifies that a normal distribution of entries should be generated, centered around the midpoint time-wise between your start and end datetimes. This is the default as most real-world web access follows natural wake/sleep cycles.</p>\n<p><em>Even</em><br>Specifies a random (even) distribution be used instead. You may want to use this if you are an international company and no one time zone wake/sleep cycle dominates your site/app usage patterns.</p>\n<hr>\n<h3>How many records does it generate?</h3>\n<h5>IF YOU ARE NOT CONTINUOUSLY STREAMING (-C IS NOT SPECIFIED)</h5>\n<h6>AND if you are writing output to files:</h6>\n<blockquote>\n<p>The total number of entries generated is equal to the -n parameter value TIMES the -r parameter value, spread in the selected distribution across the timeframe specified between the -s and -e parameter start and end datetimes.</p>\n</blockquote>\n<h6>OR if you are streaming output to stdout, Kafka, Splunk, or another streaming target:</h6>\n<blockquote>\n<p>The total number of entries generated is equal the -r parameter value, spread in the selected distribution across the timeframe specified between the -s and -e parameter start and end datetimes.</p>\n</blockquote>\n<h5>IF YOU ARE CONTINUOUSLY STREAMING (-C IS SPECIFIED)</h5>\n<blockquote>\n<p>The -e end datetime is ignored, and Flan streams records until settings.R_MAX (100,000,000) is reached, or you CTRL-C or shut the service down, or until it hits the UNIX maxdate or you run out of memory or something else and it errors out :-). Specify --pace to slow things down.</p>\n</blockquote>\n<p>Note: as of v0.0.31, session preservation (-p) no longer limits the number of records generated to the size of the template log(s).</p>\n<hr>\n<h3>What does it cost, resource-wise?</h3>\n<p>Memory is the main resource used by Flan. Memory consumption is primarily influenced by two factors:</p>\n<ol>\n<li>\n<p>The size of the template log file used and in particular the number of unique user agent strings within it, and;</p>\n</li>\n<li>\n<p>The need to cache an entire time distribution period in memory to \"keep the shape\" of the distribution as we go. The number of seconds between -s and -e determines how much memory is used by this.</p>\n</li>\n</ol>\n<p>A 500K-record template log file with -n 10 -r 100000 uses less than 1GB memory on my Mac. Your results may vary. Use Flan's --profile switch to see memory consumed.</p>\n<p>Disk usage (if you're using file mode) is highly dependent on the length of the user agents and request paths. With my test file, using -n 10 -r 1000000 I get roughly 250MB of storage per file for a total of 2.5GB total disk.</p>\n<p>CPU cycles are mostly taken up by the hidden Bitcoin miner I've added (just kidding... Flan is not particularly CPU intensive).</p>\n<p>Overall runtime is dependent on the time range between your start and end dates, the size of your template log, and the total number of records you are generating. Larger template logs create more accurate output data, but take longer to parse and in particular to go through and obfuscate all of the user agents, given that they are pretty-free-form, often-lengthy strings. Use replay mode to minimize template log parse time. Quiet mode will also reduce runtime.</p>\n<p>I'm not currently supporting preservation of sessions across a time distribution period boundary. That would mean I'd have to keep multiple time distribution periods cached simultaneously, and that just eats memory alive. So for example, a 3-day range starting at midnight between start and end dates, using a normal distribution and session preservation, creates a \"3-humped\" pattern with saddles at midnight, peaks at noon, and sessions preserved within each day/hump but not spanning days/humps.</p>\n<h2>Instructions</h2>\n<p>Flan is developed and tested on Python 3.7 (as of July 2019). It's untested on other versions.</p>\n<h3>Dependencies</h3>\n<blockquote>\n<p>numpy <br>\npython-dateutil <br>\npyYAML <br>\nservice <br>\nua-parser <br>\nuser-agents<br>\nboto (if using AWS integration)<br>\nconfluent_kafka (if using Kafka integration)<br>\nfluent-logger (if using FluentD integration)<br>\nsplunk-sdk (if using Splunk integration)<br>\nstomp.py (if using STOMP MQ integration)</p>\n</blockquote>\n<h3>Installation</h3>\n<h5>FROM PIP</h5>\n<p><code>pip install flan</code></p>\n<h5>FROM SOURCE</h5>\n<ol>\n<li>\n<p>Download and extract all *.py files, *requirements.txt files, and (optionally) user-agents.json to a installation directory of your choice. You don't need the tests folder or its contents if you are not running unit tests. This exercise is left to the reader.</p>\n</li>\n<li>\n<p>(Optional) Set up a Python 3.7 virtualenv and activate it. This exercise is left to the reader.</p>\n</li>\n<li>\n<p>Install dependency requirements. You may optionally first comment out any integration dependencies you don't need:</p>\n<p><code>pip install -r requirements.txt</code></p>\n</li>\n<li>\n<p>Run setup.py:</p>\n<p><code>python setup.py install</code></p>\n<p>OPTION: if you (might) want to uninstall later, record the files created locally during install by using this command instead:</p>\n<p><code>python setup.py install --record flaninstalledfiles.txt</code></p>\n</li>\n<li>\n<p>Run it:</p>\n<p><code>flan [arguments] template.log outputdir</code></p>\n</li>\n</ol>\n<h3>Uninstall</h3>\n<p><code>xargs rm -rf &lt; flaninstalledfiles.txt</code></p>\n<h3>Update</h3>\n<p>Uninstall, then reinstall using the same installation instructions listed above.</p>\n<hr>\n<h2>Syntax and Parameters</h2>\n<h5>INTERACTIVE MODE (uses commandline arguments)</h5>\n<p>File output:</p>\n<pre><code>flan -n &lt;number of files to write&gt; -r &lt;number of records per file&gt; [arguments] templatelogspec outputdir\n</code></pre>\n<p>Streaming output:</p>\n<pre><code>flan -c [-o outputtarget] [--pace] [arguments] templatelogspec\n</code></pre>\n<h5>SERVICE/DAEMON MODE (uses flan.config.yaml)</h5>\n<pre><code>flan [ start | stop | status ]\n</code></pre>\n<h5>CONTROLLING FLAN VIA ARGUMENTS AND CONFIGS</h5>\n<p>For service mode, use flan.config.yaml instead of commandline arguments. Each of its entries map one-to-one to one of the arguments below. Quiet (-q), stats (--stats), profile (--profile), and overwrite (-w) are set to fixed defaults in service mode and if set in flan.config.yaml are ignored. flan.config.yaml is ignored in interactive mode.</p>\n<table>\n<thead>\n<tr>\n<th>Commandline Argument</th>\n<th align=\"left\">Definition</th>\n<th>Default</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>‑a</td>\n<td align=\"left\">If specified, halt on any (i.e. the first) unparseable entries in your template log.</td>\n<td>Skip any&amp;all unparseable entries</td>\n</tr>\n<tr>\n<td>‑b,<br>‑‑botfilter</td>\n<td align=\"left\">Iff -u is set to 'all' or 'bots', defines which bots appear in the generated log files, one of:<br><br>seen=only use bots that appear in the template log file and are identifiable as robotic;<br><br>unseen=only use bots found in the user-agents.json file (if used, this should be located in the same directory as flan.py);<br><br>all=use bots from both the template log and the user-agents.json file.</td>\n<td>seen</td>\n</tr>\n<tr>\n<td>‑c</td>\n<td align=\"left\">Continuous streaming mode. If enabled, ignores the -e setting, and streams entries continuously until settings.R_MAX is reached. -o must be specified. Not available for file output.</td>\n<td>No continuous streaming</td>\n</tr>\n<tr>\n<td>‑d,<br>‑‑distribution</td>\n<td align=\"left\">Defines the distribution of the timestamps across the period (the \"shape\") of the resulting entries. One of:<br><br>normal=use a normal distribution centered midway between start and end datetimes for the time dimension;<br><br>random=use a random (\"shotgun blast\") distribution.</td>\n<td>normal</td>\n</tr>\n<tr>\n<td>‑e,<br>‑‑end</td>\n<td align=\"left\">Specifies the end datetime to use for the generated log entries. All log entries will have a timestamp on or before this date.</td>\n<td>Midnight tomorrow local/server time</td>\n</tr>\n<tr>\n<td>‑f,<br>‑‑ipfilter</td>\n<td align=\"left\">If provided, this should specify one or more optional IP(s) and/or CIDR range(s) in quotes that all entries in the template log file must match in order to be used for output log generation. Only lines containing an IP that matches one or more of these will be used. Separate one or more IPs or CIDRs here by commas; for example, '--ipfilter \"123.4.5.6,145.0.0.0/16,2001:db8::/48\"'.</td>\n<td>Use all otherwise eligible template log lines and their IPs in generating the output logs.</td>\n</tr>\n<tr>\n<td>‑g,<br>‑‑gzip</td>\n<td align=\"left\">Gzip support. Used in conjunction with the passed -n value, this specifies a file index number at which to begin gzipping generated log files. It must be between 0 and the -n value provided. For example, \"-n 5 -g 3\" generates log files called \"access.log\", \"access.log.1\", \"access.log.2.gz\", \"access.log.3.gz\", and \"access.log.4.gz\": 5 total files, the last 3 of which are gzipped.</td>\n<td>0; no gzipping occurs.</td>\n</tr>\n<tr>\n<td>‑h</td>\n<td align=\"left\">Print out these options on the commandline.</td>\n<td></td>\n</tr>\n<tr>\n<td>‑i<br>‑‑inputsource</td>\n<td align=\"left\">The source of the input, one of: <br><br>files=load template log(s) from one or more files as controlled by the flan.files.yaml config file's \"import\" section;<br><br>splunk=load template logs from the NCSA Combined Log Format entries from the Splunk server and index specified in the flan.splunk.yaml file's \"import\" section.</td>\n<td>files</td>\n</tr>\n<tr>\n<td>‑‑inputformat</td>\n<td align=\"left\">The format of each line in the the template log file (a valid NCSA Combined Log Format string).</td>\n<td>'$remote_addr - $remote_user [$time_local] \"$request\" $status $body_bytes_sent \"$http_referer\" \"$http_user_agent\"'</td>\n</tr>\n<tr>\n<td>‑j</td>\n<td align=\"left\">Continuous streaming periodicity. If using continuous streaming (-c), defines the length of a single time distribution period in seconds (1d=exactly 24h; no leap minutes or days are taken into account). If using a normal distribution, the distribution will be this long, with the peak in the middle of it.</td>\n<td>86400 seconds (1 day)</td>\n</tr>\n<tr>\n<td>‑k</td>\n<td align=\"left\">If specified, add single quotes to the beginning and end of every generated log entry line.</td>\n<td>Do not add quotes.</td>\n</tr>\n<tr>\n<td>‑l,<br>‑‑linedelimiter</td>\n<td align=\"left\">Line delimiter to append to all generated log entries, one of:<br><br>[None, No, False, N, F];<br>[Comma, C];<br>[Tab, T];<br>CR;<br>LF;<br>CRLF.</td>\n<td>CRLF</td>\n</tr>\n<tr>\n<td>‑m,<br>‑‑ipmapping</td>\n<td align=\"left\">Defines how IPs are obfuscated, one of:<br><br>otm24=map one IPv4 to up to 255 IPv4 /24 addresses or one IPv6 to up to ~65K IPv6 /116 addresses (session destroying);<br><br>otm16=map one IPv4 to up to 65535 IPv4 /16 addresses or one IPv6 to up to ~65K IPv6 /116 addresses (session destroying);<br><br>oto24=map one IPv4/IPv6 address to one IPv4/IPv6 address within the same /24 or /116 block (session preserving); <br><br>oto16=map one IPv4/IPv6 address to one IPv4/IPv6 address within the same /16 or /116 block (session preserving);<br><br>off=do not obfuscate IPs (session preserving).<br><br>Flan guarantees that global IPs stay global, private stay private, loopback stays loopback etc. post-obfuscation. Known bot IPs are not obfuscated, so (for example) Googlebot IPs stay the same. If -p (preserve sessions) is specified, this setting must be set to either \"none\", \"oto24\", or \"oto16\".</td>\n<td>If -p is specified, \"oto24\". If -p is not specified, \"otm24\".</td>\n</tr>\n<tr>\n<td>‑‑meta</td>\n<td align=\"left\">Replaces the old --stats parameter. Collect and emit (at the end) meta data and per-hour cumulative counts on all the log entries generated. Use this to identify the source of the log files and verify the spread across your chosen distribution.</td>\n<td>No meta is emitted.</td>\n</tr>\n<tr>\n<td>‑n,<br>‑‑numfiles</td>\n<td align=\"left\">The total number of access.log files to generate. Min=1, Max=1000. Example: '-n 4' creates access.log, access.log.1, access.log.2, and access.log.3 in the output directory.</td>\n<td>1</td>\n</tr>\n<tr>\n<td>‑‑nouatag</td>\n<td align=\"left\">If specified, excludes the \"Flan/&lt;version#&gt; (<a href=\"https://bret.guru/flan\" rel=\"nofollow\">https://bret.guru/flan</a>)\" from the user agent values in the generated log files.</td>\n<td>Append the Flan UA tag to all generated UAs.</td>\n</tr>\n<tr>\n<td>‑o</td>\n<td align=\"left\">Stream mode output target. If specified, ignores the output directory and -n flag values, and streams all output to the designated target. One of:<br><br>fluentd=stream to a FluentD remote as defined in the flan.fluentd.yaml config file's \"export\" section<br><br>kafka=stream to a Kafka pub/sub as defined in the flan.kafka.yaml config file's \"export\" section<br><br>splunk=stream to a Splunk Enterprise API as defined in the flan.splunk.yaml config file's \"export\" section<br><br>stompmq=stream to a Apache ActiveMQ, Amazon MQ, RabbitMQ, or other STOMP-compliant queue as defined in the flan.stompmq.yaml config file's \"export\" section<br><br>stdout=stream to stdout</td>\n<td>No stream output. Output is written to file(s) in the output directory provided.</td>\n</tr>\n<tr>\n<td>‑‑outputformat</td>\n<td align=\"left\">Format of individual emitted entries in the generated logs. A valid NCSA Combined Log Format string, or one of two special values:<br><br>json=emits entries in JSON format;<br><br>avro=emits JSON-encoded entries in Avro binary format.</td>\n<td>'$remote_addr - $remote_user [$time_local] \"$request\" $status $body_bytes_sent \"$http_referer\" \"$http_user_agent\"'</td>\n</tr>\n<tr>\n<td>‑p</td>\n<td align=\"left\">Session preservation. If specified, preserves sessions by maintaining the time index order of the request paths in the template log in the generated logs, and keeoping the same UA post-IP-obfuscation for each IP found in the template log. The -m ipmapping setting must be set to either \"onetoone\" or \"none\".</td>\n<td>No session preservation. Request paths are randomly assigned throughout the generated time distribution, destroying sessions.</td>\n</tr>\n<tr>\n<td>‑‑pace</td>\n<td align=\"left\">Pacing. If specified, syncs the timestamps in the generated log records with the current clock time as log entries are generated such that log entries are emitted in apparent 'real time'. Each second in the log timestamps corresponds to a second of emission time in real time.</td>\n<td>Default=no pacing; emit entries as fast as possible.</td>\n</tr>\n<tr>\n<td>‑q</td>\n<td align=\"left\">Basho-like stdout.</td>\n<td>Proust-like stdout.</td>\n</tr>\n<tr>\n<td>‑r,<br>‑‑records</td>\n<td align=\"left\">The number of entries to write per generated log file. Min=1, Max=100M.</td>\n<td>100,000,000 if -c is specified<br>10,000 if -c is NOT specified</td>\n</tr>\n<tr>\n<td>‑s,<br>‑‑start</td>\n<td align=\"left\">Specifies the start datetime to use for the generated log entries. All log entries will have a timestamp on or after this date.</td>\n<td>Midnight today local/server time</td>\n</tr>\n<tr>\n<td>‑t,<br>‑‑timeformat</td>\n<td align=\"left\">Timestamp format to use in the generated log file(s), EXCLUDING TIMEZONE (see -z parameter), in Python strftime format (see <a href=\"http://strftime.org/\" rel=\"nofollow\">http://strftime.org/</a>).</td>\n<td>'%-d/%b/%Y:%H:%M:%S'</td>\n</tr>\n<tr>\n<td>‑u,<br>‑‑uafilter</td>\n<td align=\"left\">Defines the kinds of user agents that will appear in the generated log files, one of: <br><br>bots=bot UAs only;<br><br> nonbots=non-bot UAs only;<br><br>all=both bot and non-bot UAs.</td>\n<td>all</td>\n</tr>\n<tr>\n<td>‑v</td>\n<td align=\"left\">Print version number and immediately exit.</td>\n<td></td>\n</tr>\n<tr>\n<td>‑w</td>\n<td align=\"left\">If specified, overwrites any generated log file(s) that already exist. This check is made before writing anything.</td>\n<td>Error if any already exist, leaving any &amp; all of them unchanged.</td>\n</tr>\n<tr>\n<td>‑x,<br>‑‑regex</td>\n<td align=\"left\">Custom regex matching. Specifies a custom regex to use as a line-by-line filter for entries in the template log. Only lines that match the regex are included in log generation; lines that do not match are excluded.</td>\n<td>All otherwise eligible lines in the template log file are used to generate logs.</td>\n</tr>\n<tr>\n<td>‑y</td>\n<td align=\"left\">Replay logging. If specified, enables the replay log. Replay logging parses the template log file on first execution and stores the parsed results in a binary 'flan.replay' file located in the same directory as flan.py. On subsequent execution, Flan will load the already-parsed replay log rather than reparse the template log file, saving lots of time when reusing the same large template log repeatedly. Once created, the replay log is never overwritten or deleted; delete it manually first to recreate it on the next Flan run, if needed. If a replay log exists but -y is not specified, the replay log is ignored (neither read nor overwritten).</td>\n<td>Do not use replay logs; parse the template log every time and ignore any existing replay log.</td>\n</tr>\n<tr>\n<td>‑z,<br>‑‑timezone</td>\n<td align=\"left\">Timezone offset in (+/-)HHMM format to append to timestamps in the generated log file(s), or pass '' to specify no timezone.</td>\n<td>Your current local/server timezone.</td>\n</tr></tbody></table>\n<hr>\n<h3>Where can I get access.log files to test with?</h3>\n<p>Test log files are available in the tests folder.</p>\n<p>Here's another resource:</p>\n<p><a href=\"https://gist.github.com/rm-hull/bd60aed44024e9986e3c\" rel=\"nofollow\">https://gist.github.com/rm-hull/bd60aed44024e9986e3c</a></p>\n<p>Or, just Google \"example access.log files\".</p>\n<hr>\n<h3>Future Enhancements</h3>\n<p>Definitely:</p>\n<ol>\n<li>Integrations: various AWS services, Google Cloud Pub/Sub, Redis Pub/Sub, Apache Flume, Apache Pulsar, Apache Nifi... If you want an integration, ask, or submit a PR.</li>\n</ol>\n<p>Possibly:</p>\n<ol>\n<li>\n<p>Ability to specify the generation of specific CIDRs, ASNUM blocks, IP ranges, etc. There are certain use cases for this;</p>\n</li>\n<li>\n<p>Ability to inject custom data into the user-agent field, or alter the user agents in specific ways (map a user agent to another user agent) for downstream flagging/detection;</p>\n</li>\n<li>\n<p>Support other time distributions for specific use cases. Examples: heavy-tailed Poisson to model unlikely events/DDoS, discrete/degenerate distributions to emulate API/RESTful activity, etc. For considerations, see:\n<br><a href=\"https://en.wikipedia.org/wiki/Web_traffic\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Web_traffic</a>\n<br><a href=\"https://www.nngroup.com/articles/traffic-log-patterns\" rel=\"nofollow\">https://www.nngroup.com/articles/traffic-log-patterns</a>\n<br><a href=\"https://en.wikipedia.org/wiki/Traffic_generation_model\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Traffic_generation_model</a>\n<br><a href=\"https://en.wikipedia.org/wiki/List_of_probability_distributions\" rel=\"nofollow\">https://en.wikipedia.org/wiki/List_of_probability_distributions</a></p>\n</li>\n</ol>\n<hr>\n<h3>Citations</h3>\n<p>crawler-user-agents.json Copyright (c) 2019 Martin Monperrus <br>\n<a href=\"https://github.com/monperrus/crawler-user-agents/blob/master/crawler-user-agents.json\" rel=\"nofollow\">https://github.com/monperrus/crawler-user-agents/blob/master/crawler-user-agents.json</a></p>\n<hr>\n<h3>Disclaimer</h3>\n<p>The material embodied in this software is provided to you \"as-is\" and without warranty of any kind, express, implied or otherwise, including without limitation, any warranty of fitness for a particular purpose. Your use of this software in whole or part signifies your agreement that I am not liable to you or anyone else for any direct, special, incidental, indirect or consequential damages of any kind, or any damages whatsoever, including without limitation, loss of profit, loss of use, savings or revenue, or the claims of third parties, whether or not I have been advised of the possibility of such loss, however caused and on any theory of liability, arising out of or in connection with the possession, use or performance of this software.</p>\n<h2>PRs welcome!</h2>\n\n          </div>"}, "last_serial": 5696422, "releases": {"0.0.37": [{"comment_text": "", "digests": {"md5": "3f0cee7994280ae985346bb0802a279d", "sha256": "1d6ea08b28c784c8f249bf6aae494ac20af73dc1830e512a026bdba1a26719d1"}, "downloads": -1, "filename": "flan-0.0.37-py3-none-any.whl", "has_sig": false, "md5_digest": "3f0cee7994280ae985346bb0802a279d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 49836, "upload_time": "2019-08-19T02:35:25", "upload_time_iso_8601": "2019-08-19T02:35:25.467806Z", "url": "https://files.pythonhosted.org/packages/ae/5b/363936465c5cbd0fd35878efa3b4360f27368058934d0fa2f15bc046e7d1/flan-0.0.37-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "13deaeafe18ca1bbccc70297fbb57667", "sha256": "8ad888825310a7d9bd826f2260ad60d3dbe367377ad05ffb133aada581d227e2"}, "downloads": -1, "filename": "flan-0.0.37.tar.gz", "has_sig": false, "md5_digest": "13deaeafe18ca1bbccc70297fbb57667", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 53998, "upload_time": "2019-08-19T02:35:27", "upload_time_iso_8601": "2019-08-19T02:35:27.280601Z", "url": "https://files.pythonhosted.org/packages/e5/76/e73abdc689e0c40034be115e6192bbe5a39b72e9012c22af1f0797a45c0e/flan-0.0.37.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "3f0cee7994280ae985346bb0802a279d", "sha256": "1d6ea08b28c784c8f249bf6aae494ac20af73dc1830e512a026bdba1a26719d1"}, "downloads": -1, "filename": "flan-0.0.37-py3-none-any.whl", "has_sig": false, "md5_digest": "3f0cee7994280ae985346bb0802a279d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 49836, "upload_time": "2019-08-19T02:35:25", "upload_time_iso_8601": "2019-08-19T02:35:25.467806Z", "url": "https://files.pythonhosted.org/packages/ae/5b/363936465c5cbd0fd35878efa3b4360f27368058934d0fa2f15bc046e7d1/flan-0.0.37-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "13deaeafe18ca1bbccc70297fbb57667", "sha256": "8ad888825310a7d9bd826f2260ad60d3dbe367377ad05ffb133aada581d227e2"}, "downloads": -1, "filename": "flan-0.0.37.tar.gz", "has_sig": false, "md5_digest": "13deaeafe18ca1bbccc70297fbb57667", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 53998, "upload_time": "2019-08-19T02:35:27", "upload_time_iso_8601": "2019-08-19T02:35:27.280601Z", "url": "https://files.pythonhosted.org/packages/e5/76/e73abdc689e0c40034be115e6192bbe5a39b72e9012c22af1f0797a45c0e/flan-0.0.37.tar.gz", "yanked": false}], "timestamp": "Fri May  8 01:03:17 2020"}