{"info": {"author": "Phan Hoang", "author_email": "phan.huy.hoang@framgia.com", "bugtrack_url": null, "classifiers": ["Development Status :: 2 - Pre-Alpha", "Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Natural Language :: English", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7"], "description": "framler\n=======\n\n[![PyPi](https://img.shields.io/pypi/v/framler.svg)](https://pypi.python.org/pypi/framler) \n[![Build Status](https://travis-ci.org/huyhoang17/framler.svg?branch=master)](https://travis-ci.org/huyhoang17/framler) \n[![Coverage Status](https://coveralls.io/repos/github/huyhoang17/framler/badge.svg?branch=master)](https://coveralls.io/github/huyhoang17/framler?branch=master)\n[![Updates](https://pyup.io/repos/github/huyhoang17/framler/shield.svg)](https://pyup.io/repos/github/huyhoang17/framler/)  \n[![Python 3](https://pyup.io/repos/github/huyhoang17/framler/python-3-shield.svg)](https://pyup.io/repos/github/huyhoang17/framler/)\n[![Documentation Status](https://readthedocs.org/projects/framler/badge/?version=latest)](https://framler.readthedocs.io/en/latest/?badge=latest)\n\n\nPython package for crawler data and extract main information \n\n- Free software: MIT license\n- Documentation: https://framler.readthedocs.io.\n\n\nFeatures\n--------\n\n### Package to crawl and extract main information for websites\n\n- Some Vietnamese online newspapers:\n    - Dan Tri: https://dantri.com.vn/\n    - VnExpress: https://vnexpress.net/\n    - vietnamnet: https://vietnamnet.vn/\n    - Tuoi Tre: https://tuoitre.vn/\n    - Lao Dong: https://laodong.vn/\n    - Thanh Nien: https://thanhnien.vn/\n    - VOV: https://vov.vn/\n    - Zing: https://news.zing.vn/\n    - .... \n\n- Main information to extract:\n    - Url\n    - Title\n    - Text (content)\n    - Authors\n    - Publish date\n    - Image urls\n    - Tags\n\n- Additional information:\n    - Extract keyword (TODO)\n    - Summary content  (TODO)\n\n- Additional features:\n    - Export data (text, image) to file, database (csv, mongo, ....) (TODO)\n    - Multiprocessing\n    - Render and crawl website contains Js (TODO)\n    - Define base solution to extract main information from website (title, text, author, published_data, image_urls, tags)\n    - Auto extract roadmaps (rss, sitemap) of some common Vietnamese online newspapers. Support export data to database, multiprocessing (TODO)\n    - Add auto extract roadmap (rss, sitemap) mechanism (TODO)\n    - Add cronjob to automatically crawler specific websites, checking duplicate and export data to database (TODO)\n\n- Folder structure\n```\n    ├── _base.py - base abstract class for extracting, parsing and exporting data\n    ├── articles.py - contain article's meta information \n    ├── cleaners.py - base object to clean article's content, include: html, text, stopword, ...\n    ├── extractors.py - base extractor to auto extract main information for any articles, must include: url, title, content, author\n    ├── parsers.py - base class to define some short methods to extract information from html elements, ex: regex define; find element by tag, id, class, ...\n    ├── images.py - define common pattern to extract and download images\n    ├── logs.py - base logging module\n    ├── utils.py - define some common and useful methods\n    ├── config.yaml - define meta information for each field \n    └── html.yaml - define some common values for specific tags\n```\n\n- Some prerequisite libraries:\n    - selenium\n    - requests\n    - beautifulsoup4\n    - lxml\n    - datefinder\n\n### Command\n\n```\npip install framler\n```\n\nor\n\n```\npip install --upgrade framler\n```\n\n### Usage\n\n- For Vietnamese online newspapers, support (a.k.a parser name):\n    - dantri\n    - vnexpress\n    - vietnamnet\n    - tuoitrevn\n    - thanhnien\n\n```\nIn [1]: import framler                                                                                                                                                                                              \n\nIn [2]: dt = framler.NewspapersParser(\"thanhnien\")                                                                                                                                                                                 \n2829it [00:30, 91.76it/s] \ngeckodriver\n2019-02-19 14:04:24,324 - framler.utils - INFO - Untar completed!\nINFO:framler.utils:Untar completed!\n\nIn [3]: url = \"https://thanhnien.vn/thoi-su/ngan-hang-vdb-sai-pham-gi-tai-du-an-gang-thep-nghin-ti-dap-chieu-1054082.html\"                                                                       \n\nIn [4]: article = dt.parse(url)                                                                                                                                                                                     \n\nIn [5]: article.title                                                                                                                                                                                               \nOut[5]: 'Ngân hàng VDB sai phạm gì tại dự án gang thép nghìn tỉ ‘đắp chiếu’?'\n\nIn [6]: article.text                                                                                                                                                                                                \nOut[6]: 'Đề nghị Bộ Tài chính xử lý trách nhiệm tại VDB\\nĐây là số tiền nằm trong các gói thầu mà Thanh tra Chính phủ vừa kết luận sai phạm, thất thoát tại dự án mở rộng sản xuất giai đoạn 2\\xa0của Công ty cổ phần gang thép Thái Nguyên (TISCO).\\nDự án có tổng mức đầu tư hơn 3.800 tỉ đồng, sau 5 năm triển khai đội vốn lên tới 8.104 tỉ đồng. Sai phạm xảy ra ở tất cả các khâu, có liên quan đến trách nhiệm của TISCO, Tổng Công ty thép (VNS), Bộ Công thương...\\nNhà máy đã \"đắp chiếu\" từ năm 2013 đến nay, với khoản lãi vay ngân hàng phải trả gần 40 tỉ đồng/tháng. Hai ngân hàng liên quan, giải ngân cho dự án này gồm VDB và Ngân hàng Công thương (Vietinbank). Theo Thanh tra chính phủ, đối với VDB, Chi nhánh Thái Nguyên, trên cơ sở đề nghị của TISCO, VDB Chi nhánh Thái Nguyên đã giải ngân cho Tổng Công ty cổ phần Xây dựng công nghiệp Việt Nam (Vinaincon), các nhà thầu phụ khác 757 tỉ đồng theo đơn giá điều chỉnh không đúng Hợp đồng EPC số 01#. Theo Quyết định số 1515/QĐ-TTg, VDB là ngân hàng chính sách do nhà nước nắm giữ 100% vốn điều lệ. VDB được áp dụng tỷ lệ dự trữ bắt buộc bằng 0% và không phải tham gia bảo hiểm tiền gửi. Do hoạt động của VDB không vì mục đích lợi nhuận nên được ngân sách nhà nước cấp bù chênh lệch lãi suất và phí quản lý, được Chính phủ bảo đảm khả năng thanh toán, được miễn nộp thuế và các khoản nộp ngân sách nhà nước. Vốn điều lệ của VDB 15.086 tỉ đồng và dự kiến tăng lên 30.000 tỉ đồng vào năm 2020. Tại hợp đồng EPC 01#, Vinaincon sau khi trở thành nhà thầu phụ, được giao thực hiện thi công với giá trị tạm tính hơn 764 tỉ đồng, đã lập tức ký hợp đồng giao việc với 29 nhà thầu khác với giá trị hơn 505 tỉ đồng và thu phí quản lý 5 - 10% giá trị hợp đồng. Đây là hành vi cố ý làm trái quy định pháp luật về đầu tư.\\nTừ đó, Thanh tra Chính phủ kiến nghị Bộ Công thương chủ trì phối hợp với Bộ Tài chính, Ngân hàng nhà nước, Bộ Kế hoạch - Đầu tư rà soát, xử lý những tồn tại, áp dụng cơ chế giảm lãi vay phát sinh trong thời gian dự án dừng thi công, Tisco không có khả năng thanh toán, báo cáo Thủ tướng cho ý kiến xử lý những vướng mắc nếu có. Thanh tra Chính phủ cũng kiến nghị giao Bộ Tài chính theo thẩm quyền chỉ đạo, kiểm điểm xử lý trách nhiệm tổ chức, cá nhân tại VDB, VDB Chi nhánh Thái Nguyên có khuyết điểm, nêu tại kết luận thanh tra. Nguy cơ phá sản, mất vốn\\nTheo nguồn tin của Thanh Niên, đến nay, VDB vẫn chưa thực hiện được việc cơ cấu nợ gốc và lãi cho TISCO. Hàng tháng, VDB vẫn thông báo thu nợ, tính lãi phạt và đang xếp tín dụng của TISCO vào nợ xấu nhóm 5. Đến thời điểm 31.5.2018, TISCO đang nợ VDB 1.573 tỉ đồng, trong đó, nợ quá hạn là 415 tỉ đồng.\\nLiên quan đến việc cho vay dự án này còn có Tổng Công ty Đầu tư và Kinh doanh vốn nhà nước (SCIC). Ngày 20.11.2014, Văn phòng Chính phủ ban hành văn bản số 2339/TTg-KTTH gửi các bộ, ngành, VNS và Tisco, trong đó có nội dung “tiếp tục thực hiện dự án với tổng mức đầu tư điều chỉnh là 8.104 tỉ đồng. SCIC góp tối thiếu 1.000 tỉ đồng”.\\nTin liên quan Dự án gang thép ngàn tỉ \\'đắp chiếu\\': Bán thầu hưởng phí trái luật\\nHàng ngàn tỉ đồng \\'đốt\\' tại dự án gang thép Thái Nguyên\\nKiến nghị Bộ Công an điều tra 4 vụ sai phạm tại Gang thép Thái Nguyên Bên cạnh đó, TISCO cũng ký với Vietinbank Chi nhánh Hà Nội hợp đồng tín dụng số 01/2010/HĐTD ngày 25.1.2010 và các phụ lục hợp đồng triển khai dự án với giá trị hợp đồng không vượt quá 1.863 tỉ đồng, số tiền đã giải ngân thanh toán giá trị thiết bị dự án là 1.458 tỉ đồng (đến 31.12.2016, số tiền Tisco còn nợ là 225 tỉ đồng và 72,1 triệu USD). Hiện, khoản nợ vay tại VietinBank đã được VietinBank cơ cấu thời gian trả nợ cho TISCO đến tháng 6.2019.\\nTuy nhiên, báo cáo tại Đại hội cổ đông đầu năm 2019 của TISCO cho thấy, công ty này đứng trước nguy cơ phá sản, có thể mất vốn đầu tư của các cổ đông, trong đó có cổ đông nhà nước là Tổng Công ty Thép Việt Nam (chiếm 65% vốn điều lệ - 1.196 tỉ đồng), các ngân hàng mất vốn do TISCO không trả nợ được, gần 5.000 người lao động không có việc làm.'\n\nIn [7]: article.published_date                                                                                                                                                                                      \nOut[7]: '13:17 - 22/02/2019\\n0\\nThanh Niên Online'\n\nIn [8]: article.tags                                                                                                                                                                                                \nOut[8]: '#tisco#thái nguyên#vdb#ngân hàng#phát triển#dự án ngàn tỉ đắp chiếu'\n\nIn [9]: article.image_urls                                                                                                                                                                                          \nOut[9]: \n['https://image.thanhnien.vn/660/uploaded/xuanvu/vang/1111_adrl.jpg']\n\nIn [10]: article.author                                                                                                                                                                                      \nOut[10]: 'Anh Vũ ngovutb@gmail.com'\n```\n\n- Crawl with auto parser mode (requests):\n\n```\nIn [1]: import framler                                                                                                                                                                                              \n\nIn [2]: ac = framler.AutoCrawlParser(\"requests\")                                                                                                                                                                    \n\nIn [3]: url = \"https://laodong.vn/bong-da-quoc-te/lukaku-lap-cu-dup-man-united-nguoc-dong-kinh-dien-truoc-psg-660940.ldo\"                                                                                           \n\nIn [4]: article = ac.parse(url)                                                                                                                                                                                \n\nIn [5]: article.title                                                                                                                                                                                               \nOut[5]: 'Lukaku lập cú đúp, Man United ngược dòng kinh điển trước PSG'\n\nIn [6]: article.text                                                                                                                                                                                                \nOut[6]: 'Với dàn đội hình gồm 7 cầu thủ được đôn lên từ tuyến trẻ của Man United, không ai nghĩ \"Quỷ đỏ\" lại \"ca khúc khải hoàn\" ngay tại thánh địa Parc des Princes của PSG. Khi khán giả còn chưa ngồi ấm chỗ, Man United bất ngờ có bàn mở tỉ số ở phút thứ 2 sau tình huống dứt điểm ở sát đường biên ngang của Lukaku. Pha bóng tinh tế đến giật mình của tiền đạo người Bỉ báo hiệu về một ngày may mắn cho các vị khách đến từ Anh. Lukaku tinh tế đến khó tin, mở tỉ số cho đội khách. Ảnh: EPA. Quả thực, đến phút 30, sau một sai lầm khá ngớ ngẩn của thủ thành kì cựu Buffon, Lukaku có bàn thắng thứ 2 trong trận đấu. Vẫn từ một tình huống theo kịch bản chớp nhoáng, Man United sống lại hi vọng đi tiếp. Trước đó, phút 12, PSG có bàn gỡ hòa 1-1 sau pha đệm bóng cận thằng của Bernat. Thế nhưng, 1 bàn là quá ít với thầy trò Tuchel ở trận này. Lukaku tiếp tục tỏa sáng. Ảnh: Reuters. Bước sang hiệp 2, không ai tin Mbappe lại chơi vô duyên đến thế. Siêu tiền đạo người Pháp bỏ phí rất nhiều cơ hội. Thậm chí, đến khi đối mặt với De Gea, anh cũng tự vấp ngã do trượt chân. Mbappe đã vậy, các mũi nhọn khác của PSG cũng không thể làm gì hơn, Di Maria đã có 1 lần đưa được bóng vào lưới nhưng trọng tài căng cờ báo việt vị. Trọng tài đã căng cờ khá muộn sau khi Di Maria dứt điểm. Ảnh: Getty. Trận đấu trôi dần về những phút cuối, Ole Solskjaer tung hết tất cả nhân tố trẻ như Chong, Greenwood vào sân. Và rồi từ một tình huống bất ngờ, Dalot nã đại bác từ ngoài vòng cấm ở phút 90, bóng chạm tay Kimpembe trong vòng cấm. Kimpembe đã quá non với pha bật lên để phòng ngự. Ảnh: BPI. Mất 3 phút xem VAR, trọng tài chính chỉ tay lên chấm 11m trong sự cay cú của Neymar ngoài đường pitch. Siêu sao Brazil không thể góp mặt do chấn thương và đành nhìn Buffon thêm một lần bị đánh bại bởi pha đá phạt đền như xé lưới của Rashford. Rashford sút penalty rất quyết đoán, đưa bóng lên góc cao. Ảnh: Reuters. Dù trọng tài chính cho thời gian bù giờ lên đến gần 10 phút nhưng những nỗ lực còn lại của PSG là không đủ. 2 năm liên tiếp, họ bị loại cay đắng bởi những kịch bản lội ngược dòng không tưởng của Barcelona và Man United. Còn với đoàn quân của Ole Solskjaer , giờ là lúc mơ về những điều tươi đẹp. Sau 10 năm, Ole Solskjaer lại ngược dòng không tưởng cùng Man United. Ảnh: Getty. Ở trận đấu còn lại, FC Porto vượt qua AS Roma trên sân nhà với tỉ số 3-1 (4-3). Bàn ấn định tỉ số được ghi ở những phút cuối hiệp phụ thứ 2 và cũng nhờ tới VAR. Manchester United , PSG'\n\nIn [7]: article.published_date                                                                                                                                                                                      \nOut[7]: '2019-03-13'\n\nIn [8]: article.tags                                                                                                                                                                                                \nOut[8]: ['manchester united', 'psg']\n\nIn [9]: article.image_urls                                                                                                                                                                                          \nOut[9]: \n['https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/3.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/8.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/10.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/4.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/7.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/12.jpg',\n 'https://www.googletagmanager.com/ns.html?id=GTM-TTSKMGW',\n 'https://certify.alexametrics.com/atrk.gif?account=BZc6s1P8cT20VR',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/11.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/5.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/13.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/9.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/6.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/14.jpg',\n 'https://laodong.vn/img/go-top.png']\n\nIn [10]: article.authors                                                                                                                                                                                            \nOut[10]: ['VIỆT HÙNG']\n```\n\n- Crawl website use Javascript to render content (use selenium):\n\n```\n# add later, bugs :)\n```\n\n- Crawl with multiprocessing (use requests mode):\n\n```\nIn [1]: import framler                                                                                                                                                                                              \n\nIn [2]: ac = framler.AutoCrawlParser()                                                                                                                                                                              \n\nIn [3]: urls = ['https://thanhnien.vn/thoi-su/de-xuat-dua-chuan-muc-dao-duc-nha-giao-vao-luat-de-bao-ve-hoc-sinh-1059827.html', \n   ...:  'https://thethao.thanhnien.vn/bong-da-quoc-te/chien-thang-truoc-psg-da-mang-lai-hop-dong-dai-han-cho-solskjaer-o-mu-99218.html', \n   ...:  'https://dantri.com.vn/xa-hoi/co-van-nha-trang-thuong-dinh-my-trieu-tai-viet-nam-la-mot-thanh-cong-20190304074414493.htm', \n   ...:  'https://vnexpress.net/the-gioi/cuoc-gap-phut-chot-cua-doan-viet-nam-tai-binh-nhuong-truoc-thuong-dinh-my-trieu-3892871.html', \n   ...:  'https://tuoitre.vn/bao-trieu-tien-chuyen-di-viet-nam-cua-ong-kim-ong-un-lam-rung-chuyen-the-gioi-20190306111422098.htm', \n   ...:  'https://news.zing.vn/ong-chu-masan-tro-thanh-ty-phu-usd-khi-chi-so-huu-15-co-phieu-post922676.html', \n   ...:  'https://vov.vn/the-gioi/tong-thong-trump-va-dang-dan-chu-2-nam-cuoc-chien-tai-quoc-hoi-882872.vov', \n   ...:  'https://laodong.vn/bong-da-quoc-te/lukaku-lap-cu-dup-man-united-nguoc-dong-kinh-dien-truoc-psg-660940.ldo', \n   ...:  'https://startup.vnexpress.net/tin-tuc/y-tuong-moi/startup-kiem-nua-ty-dong-nho-cong-nghe-nhan-dien-khuon-mat-3795045.html', \n   ...:  'http://cafebiz.vn/ceo-dj-koh-thua-nhan-samsung-da-tut-xuong-vi-tri-thu-hai-o-an-do-20190308083452665.chn', \n   ...:  'https://huyhoang17.github.io/machine-learning/2018/09/13/viblo-recommender-system.html', \n   ...:  'http://gamek.vn/ban-da-biet-gi-ve-autochess-tua-game-day-nhan-pham-dang-lam-mua-lam-gio-trong-cong-dong-dota-2-20190212150017453.chn']                                                                    \n\nIn [4]: articles = ac.run_processes(urls)                                                                                                                                                                           \n2019-03-13 11:38:56,858 - framler._base - INFO - Number of cpu: 6\nINFO:framler._base:Number of cpu: 6\n2019-03-13 11:39:14,338 - framler._base - INFO - Elapsed run time: 17.478716611862183 seconds\nINFO:framler._base:Elapsed run time: 17.478716611862183 seconds\n2019-03-13 11:39:14,338 - framler._base - INFO - Task ended. Pool join!\nINFO:framler._base:Task ended. Pool join!\n\nIn [5]: len(articles)                                                                                                                                                                                               \nOut[5]: 12\n\nIn [6]: for article in articles: \n   ...:     print(article.title) \n   ...:                                                                                                                                                                                                             \nThời sự Đề xuất đưa chuẩn mực đạo đức nhà giáo vào luật để bảo vệ học sinh\nChiến thắng trước PSG đã mang lại hợp đồng dài hạn cho Solskjaer ở M.U\nCố vấn Nhà Trắng: Thượng đỉnh Mỹ - Triều tại Việt Nam là một thành công\nCuộc gặp phút chót của đoàn Việt Nam tại Bình Nhưỡng trước thượng đỉnh Mỹ - Triều\nBáo Triều Tiên: Chuyến đi Việt Nam của ông Kim Jong Un 'làm rung chuyển thế giới'\nZing.vn Tri thức trực tuyến Ông chủ Masan trở thành tỷ phú USD khi chỉ sở hữu 15 cổ phiếu?\nTổng thống Trump và đảng Dân chủ: 2 năm cuộc chiến tại Quốc hội Phe Dân chủ muốn “đánh” đòn hiểm vào ông Trump bằng tài liệu nhạy cảm\nLukaku lập cú đúp, Man United ngược dòng kinh điển trước PSG\nStartup kiếm nửa tỷ đồng nhờ công nghệ nhận diện khuôn mặt\nCEO DJ Koh thừa nhận Samsung đã tụt xuống vị trí thứ hai ở Ấn Độ\nXây dựng hệ thống gợi ý bài viết cho ... website Viblo\nBạn đã biết gì về Auto Chess, tựa game đầy \"nhân phẩm\" đang làm mưa làm gió trong cộng đồng DOTA 2\n```\n\n### TODO\n\n- Add document\n\nReference\n---------\n\nBased on newspaper's API library: https://github.com/codelucas/newspaper and AutoCrawler library: https://github.com/YoongiKim/AutoCrawler\n\nCredits\n-------\n\nThis package was created with [Cookiecutter](https://github.com/audreyr/cookiecutter) and the [`audreyr/cookiecutter-pypackage`](https://github.com/audreyr/cookiecutter-pypackage) project template.\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/huyhoang17/framler", "keywords": "framler", "license": "MIT license", "maintainer": "", "maintainer_email": "", "name": "framler", "package_url": "https://pypi.org/project/framler/", "platform": "", "project_url": "https://pypi.org/project/framler/", "project_urls": {"Homepage": "https://github.com/huyhoang17/framler"}, "release_url": "https://pypi.org/project/framler/0.1.1/", "requires_dist": ["beautifulsoup4 (==4.7.1)", "certifi (==2018.11.29)", "chardet (==3.0.4)", "Click (==7.0)", "datefinder (==0.7.0)", "idna (==2.8)", "lxml (==4.3.2)", "python-dateutil (==2.8.0)", "pytz (==2018.9)", "PyYAML (==3.13)", "regex (==2019.3.12)", "requests (==2.21.0)", "selenium (==3.141.0)", "six (==1.12.0)", "soupsieve (==1.8)", "tqdm (==4.31.1)", "urllib3 (==1.24.1)"], "requires_python": "", "summary": "Python package for crawler data and extract main information", "version": "0.1.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>framler</h1>\n<p><a href=\"https://pypi.python.org/pypi/framler\" rel=\"nofollow\"><img alt=\"PyPi\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2497965b205ad7663b361dcf9c189fc25df03b77/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f6672616d6c65722e737667\"></a>\n<a href=\"https://travis-ci.org/huyhoang17/framler\" rel=\"nofollow\"><img alt=\"Build Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/30f76bfa52502b23181dc0c9b0a35c0f0ceda4ae/68747470733a2f2f7472617669732d63692e6f72672f687579686f616e6731372f6672616d6c65722e7376673f6272616e63683d6d6173746572\"></a>\n<a href=\"https://coveralls.io/github/huyhoang17/framler?branch=master\" rel=\"nofollow\"><img alt=\"Coverage Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/6d920ee1b000b9ffd120d52f583ad1574b37c9a6/68747470733a2f2f636f766572616c6c732e696f2f7265706f732f6769746875622f687579686f616e6731372f6672616d6c65722f62616467652e7376673f6272616e63683d6d6173746572\"></a>\n<a href=\"https://pyup.io/repos/github/huyhoang17/framler/\" rel=\"nofollow\"><img alt=\"Updates\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/661cb4b909ee6064d63ef200addd5da2f4c692cb/68747470733a2f2f707975702e696f2f7265706f732f6769746875622f687579686f616e6731372f6672616d6c65722f736869656c642e737667\"></a><br>\n<a href=\"https://pyup.io/repos/github/huyhoang17/framler/\" rel=\"nofollow\"><img alt=\"Python 3\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/26610664384514b19493d309b517917673163e6d/68747470733a2f2f707975702e696f2f7265706f732f6769746875622f687579686f616e6731372f6672616d6c65722f707974686f6e2d332d736869656c642e737667\"></a>\n<a href=\"https://framler.readthedocs.io/en/latest/?badge=latest\" rel=\"nofollow\"><img alt=\"Documentation Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8e7d87923152a13bd16e77caef7288d4efa9065a/68747470733a2f2f72656164746865646f63732e6f72672f70726f6a656374732f6672616d6c65722f62616467652f3f76657273696f6e3d6c6174657374\"></a></p>\n<p>Python package for crawler data and extract main information</p>\n<ul>\n<li>Free software: MIT license</li>\n<li>Documentation: <a href=\"https://framler.readthedocs.io\" rel=\"nofollow\">https://framler.readthedocs.io</a>.</li>\n</ul>\n<h2>Features</h2>\n<h3>Package to crawl and extract main information for websites</h3>\n<ul>\n<li>\n<p>Some Vietnamese online newspapers:</p>\n<ul>\n<li>Dan Tri: <a href=\"https://dantri.com.vn/\" rel=\"nofollow\">https://dantri.com.vn/</a></li>\n<li>VnExpress: <a href=\"https://vnexpress.net/\" rel=\"nofollow\">https://vnexpress.net/</a></li>\n<li>vietnamnet: <a href=\"https://vietnamnet.vn/\" rel=\"nofollow\">https://vietnamnet.vn/</a></li>\n<li>Tuoi Tre: <a href=\"https://tuoitre.vn/\" rel=\"nofollow\">https://tuoitre.vn/</a></li>\n<li>Lao Dong: <a href=\"https://laodong.vn/\" rel=\"nofollow\">https://laodong.vn/</a></li>\n<li>Thanh Nien: <a href=\"https://thanhnien.vn/\" rel=\"nofollow\">https://thanhnien.vn/</a></li>\n<li>VOV: <a href=\"https://vov.vn/\" rel=\"nofollow\">https://vov.vn/</a></li>\n<li>Zing: <a href=\"https://news.zing.vn/\" rel=\"nofollow\">https://news.zing.vn/</a></li>\n<li>....</li>\n</ul>\n</li>\n<li>\n<p>Main information to extract:</p>\n<ul>\n<li>Url</li>\n<li>Title</li>\n<li>Text (content)</li>\n<li>Authors</li>\n<li>Publish date</li>\n<li>Image urls</li>\n<li>Tags</li>\n</ul>\n</li>\n<li>\n<p>Additional information:</p>\n<ul>\n<li>Extract keyword (TODO)</li>\n<li>Summary content  (TODO)</li>\n</ul>\n</li>\n<li>\n<p>Additional features:</p>\n<ul>\n<li>Export data (text, image) to file, database (csv, mongo, ....) (TODO)</li>\n<li>Multiprocessing</li>\n<li>Render and crawl website contains Js (TODO)</li>\n<li>Define base solution to extract main information from website (title, text, author, published_data, image_urls, tags)</li>\n<li>Auto extract roadmaps (rss, sitemap) of some common Vietnamese online newspapers. Support export data to database, multiprocessing (TODO)</li>\n<li>Add auto extract roadmap (rss, sitemap) mechanism (TODO)</li>\n<li>Add cronjob to automatically crawler specific websites, checking duplicate and export data to database (TODO)</li>\n</ul>\n</li>\n<li>\n<p>Folder structure</p>\n</li>\n</ul>\n<pre><code>    ├── _base.py - base abstract class for extracting, parsing and exporting data\n    ├── articles.py - contain article's meta information \n    ├── cleaners.py - base object to clean article's content, include: html, text, stopword, ...\n    ├── extractors.py - base extractor to auto extract main information for any articles, must include: url, title, content, author\n    ├── parsers.py - base class to define some short methods to extract information from html elements, ex: regex define; find element by tag, id, class, ...\n    ├── images.py - define common pattern to extract and download images\n    ├── logs.py - base logging module\n    ├── utils.py - define some common and useful methods\n    ├── config.yaml - define meta information for each field \n    └── html.yaml - define some common values for specific tags\n</code></pre>\n<ul>\n<li>Some prerequisite libraries:\n<ul>\n<li>selenium</li>\n<li>requests</li>\n<li>beautifulsoup4</li>\n<li>lxml</li>\n<li>datefinder</li>\n</ul>\n</li>\n</ul>\n<h3>Command</h3>\n<pre><code>pip install framler\n</code></pre>\n<p>or</p>\n<pre><code>pip install --upgrade framler\n</code></pre>\n<h3>Usage</h3>\n<ul>\n<li>For Vietnamese online newspapers, support (a.k.a parser name):\n<ul>\n<li>dantri</li>\n<li>vnexpress</li>\n<li>vietnamnet</li>\n<li>tuoitrevn</li>\n<li>thanhnien</li>\n</ul>\n</li>\n</ul>\n<pre><code>In [1]: import framler                                                                                                                                                                                              \n\nIn [2]: dt = framler.NewspapersParser(\"thanhnien\")                                                                                                                                                                                 \n2829it [00:30, 91.76it/s] \ngeckodriver\n2019-02-19 14:04:24,324 - framler.utils - INFO - Untar completed!\nINFO:framler.utils:Untar completed!\n\nIn [3]: url = \"https://thanhnien.vn/thoi-su/ngan-hang-vdb-sai-pham-gi-tai-du-an-gang-thep-nghin-ti-dap-chieu-1054082.html\"                                                                       \n\nIn [4]: article = dt.parse(url)                                                                                                                                                                                     \n\nIn [5]: article.title                                                                                                                                                                                               \nOut[5]: 'Ngân hàng VDB sai phạm gì tại dự án gang thép nghìn tỉ ‘đắp chiếu’?'\n\nIn [6]: article.text                                                                                                                                                                                                \nOut[6]: 'Đề nghị Bộ Tài chính xử lý trách nhiệm tại VDB\\nĐây là số tiền nằm trong các gói thầu mà Thanh tra Chính phủ vừa kết luận sai phạm, thất thoát tại dự án mở rộng sản xuất giai đoạn 2\\xa0của Công ty cổ phần gang thép Thái Nguyên (TISCO).\\nDự án có tổng mức đầu tư hơn 3.800 tỉ đồng, sau 5 năm triển khai đội vốn lên tới 8.104 tỉ đồng. Sai phạm xảy ra ở tất cả các khâu, có liên quan đến trách nhiệm của TISCO, Tổng Công ty thép (VNS), Bộ Công thương...\\nNhà máy đã \"đắp chiếu\" từ năm 2013 đến nay, với khoản lãi vay ngân hàng phải trả gần 40 tỉ đồng/tháng. Hai ngân hàng liên quan, giải ngân cho dự án này gồm VDB và Ngân hàng Công thương (Vietinbank). Theo Thanh tra chính phủ, đối với VDB, Chi nhánh Thái Nguyên, trên cơ sở đề nghị của TISCO, VDB Chi nhánh Thái Nguyên đã giải ngân cho Tổng Công ty cổ phần Xây dựng công nghiệp Việt Nam (Vinaincon), các nhà thầu phụ khác 757 tỉ đồng theo đơn giá điều chỉnh không đúng Hợp đồng EPC số 01#. Theo Quyết định số 1515/QĐ-TTg, VDB là ngân hàng chính sách do nhà nước nắm giữ 100% vốn điều lệ. VDB được áp dụng tỷ lệ dự trữ bắt buộc bằng 0% và không phải tham gia bảo hiểm tiền gửi. Do hoạt động của VDB không vì mục đích lợi nhuận nên được ngân sách nhà nước cấp bù chênh lệch lãi suất và phí quản lý, được Chính phủ bảo đảm khả năng thanh toán, được miễn nộp thuế và các khoản nộp ngân sách nhà nước. Vốn điều lệ của VDB 15.086 tỉ đồng và dự kiến tăng lên 30.000 tỉ đồng vào năm 2020. Tại hợp đồng EPC 01#, Vinaincon sau khi trở thành nhà thầu phụ, được giao thực hiện thi công với giá trị tạm tính hơn 764 tỉ đồng, đã lập tức ký hợp đồng giao việc với 29 nhà thầu khác với giá trị hơn 505 tỉ đồng và thu phí quản lý 5 - 10% giá trị hợp đồng. Đây là hành vi cố ý làm trái quy định pháp luật về đầu tư.\\nTừ đó, Thanh tra Chính phủ kiến nghị Bộ Công thương chủ trì phối hợp với Bộ Tài chính, Ngân hàng nhà nước, Bộ Kế hoạch - Đầu tư rà soát, xử lý những tồn tại, áp dụng cơ chế giảm lãi vay phát sinh trong thời gian dự án dừng thi công, Tisco không có khả năng thanh toán, báo cáo Thủ tướng cho ý kiến xử lý những vướng mắc nếu có. Thanh tra Chính phủ cũng kiến nghị giao Bộ Tài chính theo thẩm quyền chỉ đạo, kiểm điểm xử lý trách nhiệm tổ chức, cá nhân tại VDB, VDB Chi nhánh Thái Nguyên có khuyết điểm, nêu tại kết luận thanh tra. Nguy cơ phá sản, mất vốn\\nTheo nguồn tin của Thanh Niên, đến nay, VDB vẫn chưa thực hiện được việc cơ cấu nợ gốc và lãi cho TISCO. Hàng tháng, VDB vẫn thông báo thu nợ, tính lãi phạt và đang xếp tín dụng của TISCO vào nợ xấu nhóm 5. Đến thời điểm 31.5.2018, TISCO đang nợ VDB 1.573 tỉ đồng, trong đó, nợ quá hạn là 415 tỉ đồng.\\nLiên quan đến việc cho vay dự án này còn có Tổng Công ty Đầu tư và Kinh doanh vốn nhà nước (SCIC). Ngày 20.11.2014, Văn phòng Chính phủ ban hành văn bản số 2339/TTg-KTTH gửi các bộ, ngành, VNS và Tisco, trong đó có nội dung “tiếp tục thực hiện dự án với tổng mức đầu tư điều chỉnh là 8.104 tỉ đồng. SCIC góp tối thiếu 1.000 tỉ đồng”.\\nTin liên quan Dự án gang thép ngàn tỉ \\'đắp chiếu\\': Bán thầu hưởng phí trái luật\\nHàng ngàn tỉ đồng \\'đốt\\' tại dự án gang thép Thái Nguyên\\nKiến nghị Bộ Công an điều tra 4 vụ sai phạm tại Gang thép Thái Nguyên Bên cạnh đó, TISCO cũng ký với Vietinbank Chi nhánh Hà Nội hợp đồng tín dụng số 01/2010/HĐTD ngày 25.1.2010 và các phụ lục hợp đồng triển khai dự án với giá trị hợp đồng không vượt quá 1.863 tỉ đồng, số tiền đã giải ngân thanh toán giá trị thiết bị dự án là 1.458 tỉ đồng (đến 31.12.2016, số tiền Tisco còn nợ là 225 tỉ đồng và 72,1 triệu USD). Hiện, khoản nợ vay tại VietinBank đã được VietinBank cơ cấu thời gian trả nợ cho TISCO đến tháng 6.2019.\\nTuy nhiên, báo cáo tại Đại hội cổ đông đầu năm 2019 của TISCO cho thấy, công ty này đứng trước nguy cơ phá sản, có thể mất vốn đầu tư của các cổ đông, trong đó có cổ đông nhà nước là Tổng Công ty Thép Việt Nam (chiếm 65% vốn điều lệ - 1.196 tỉ đồng), các ngân hàng mất vốn do TISCO không trả nợ được, gần 5.000 người lao động không có việc làm.'\n\nIn [7]: article.published_date                                                                                                                                                                                      \nOut[7]: '13:17 - 22/02/2019\\n0\\nThanh Niên Online'\n\nIn [8]: article.tags                                                                                                                                                                                                \nOut[8]: '#tisco#thái nguyên#vdb#ngân hàng#phát triển#dự án ngàn tỉ đắp chiếu'\n\nIn [9]: article.image_urls                                                                                                                                                                                          \nOut[9]: \n['https://image.thanhnien.vn/660/uploaded/xuanvu/vang/1111_adrl.jpg']\n\nIn [10]: article.author                                                                                                                                                                                      \nOut[10]: 'Anh Vũ ngovutb@gmail.com'\n</code></pre>\n<ul>\n<li>Crawl with auto parser mode (requests):</li>\n</ul>\n<pre><code>In [1]: import framler                                                                                                                                                                                              \n\nIn [2]: ac = framler.AutoCrawlParser(\"requests\")                                                                                                                                                                    \n\nIn [3]: url = \"https://laodong.vn/bong-da-quoc-te/lukaku-lap-cu-dup-man-united-nguoc-dong-kinh-dien-truoc-psg-660940.ldo\"                                                                                           \n\nIn [4]: article = ac.parse(url)                                                                                                                                                                                \n\nIn [5]: article.title                                                                                                                                                                                               \nOut[5]: 'Lukaku lập cú đúp, Man United ngược dòng kinh điển trước PSG'\n\nIn [6]: article.text                                                                                                                                                                                                \nOut[6]: 'Với dàn đội hình gồm 7 cầu thủ được đôn lên từ tuyến trẻ của Man United, không ai nghĩ \"Quỷ đỏ\" lại \"ca khúc khải hoàn\" ngay tại thánh địa Parc des Princes của PSG. Khi khán giả còn chưa ngồi ấm chỗ, Man United bất ngờ có bàn mở tỉ số ở phút thứ 2 sau tình huống dứt điểm ở sát đường biên ngang của Lukaku. Pha bóng tinh tế đến giật mình của tiền đạo người Bỉ báo hiệu về một ngày may mắn cho các vị khách đến từ Anh. Lukaku tinh tế đến khó tin, mở tỉ số cho đội khách. Ảnh: EPA. Quả thực, đến phút 30, sau một sai lầm khá ngớ ngẩn của thủ thành kì cựu Buffon, Lukaku có bàn thắng thứ 2 trong trận đấu. Vẫn từ một tình huống theo kịch bản chớp nhoáng, Man United sống lại hi vọng đi tiếp. Trước đó, phút 12, PSG có bàn gỡ hòa 1-1 sau pha đệm bóng cận thằng của Bernat. Thế nhưng, 1 bàn là quá ít với thầy trò Tuchel ở trận này. Lukaku tiếp tục tỏa sáng. Ảnh: Reuters. Bước sang hiệp 2, không ai tin Mbappe lại chơi vô duyên đến thế. Siêu tiền đạo người Pháp bỏ phí rất nhiều cơ hội. Thậm chí, đến khi đối mặt với De Gea, anh cũng tự vấp ngã do trượt chân. Mbappe đã vậy, các mũi nhọn khác của PSG cũng không thể làm gì hơn, Di Maria đã có 1 lần đưa được bóng vào lưới nhưng trọng tài căng cờ báo việt vị. Trọng tài đã căng cờ khá muộn sau khi Di Maria dứt điểm. Ảnh: Getty. Trận đấu trôi dần về những phút cuối, Ole Solskjaer tung hết tất cả nhân tố trẻ như Chong, Greenwood vào sân. Và rồi từ một tình huống bất ngờ, Dalot nã đại bác từ ngoài vòng cấm ở phút 90, bóng chạm tay Kimpembe trong vòng cấm. Kimpembe đã quá non với pha bật lên để phòng ngự. Ảnh: BPI. Mất 3 phút xem VAR, trọng tài chính chỉ tay lên chấm 11m trong sự cay cú của Neymar ngoài đường pitch. Siêu sao Brazil không thể góp mặt do chấn thương và đành nhìn Buffon thêm một lần bị đánh bại bởi pha đá phạt đền như xé lưới của Rashford. Rashford sút penalty rất quyết đoán, đưa bóng lên góc cao. Ảnh: Reuters. Dù trọng tài chính cho thời gian bù giờ lên đến gần 10 phút nhưng những nỗ lực còn lại của PSG là không đủ. 2 năm liên tiếp, họ bị loại cay đắng bởi những kịch bản lội ngược dòng không tưởng của Barcelona và Man United. Còn với đoàn quân của Ole Solskjaer , giờ là lúc mơ về những điều tươi đẹp. Sau 10 năm, Ole Solskjaer lại ngược dòng không tưởng cùng Man United. Ảnh: Getty. Ở trận đấu còn lại, FC Porto vượt qua AS Roma trên sân nhà với tỉ số 3-1 (4-3). Bàn ấn định tỉ số được ghi ở những phút cuối hiệp phụ thứ 2 và cũng nhờ tới VAR. Manchester United , PSG'\n\nIn [7]: article.published_date                                                                                                                                                                                      \nOut[7]: '2019-03-13'\n\nIn [8]: article.tags                                                                                                                                                                                                \nOut[8]: ['manchester united', 'psg']\n\nIn [9]: article.image_urls                                                                                                                                                                                          \nOut[9]: \n['https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/3.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/8.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/10.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/4.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/7.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/12.jpg',\n 'https://www.googletagmanager.com/ns.html?id=GTM-TTSKMGW',\n 'https://certify.alexametrics.com/atrk.gif?account=BZc6s1P8cT20VR',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/11.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/5.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/13.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/9.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/6.jpg',\n 'https://media.laodong.vn/Storage/newsportal/2019/3/6/660940/14.jpg',\n 'https://laodong.vn/img/go-top.png']\n\nIn [10]: article.authors                                                                                                                                                                                            \nOut[10]: ['VIỆT HÙNG']\n</code></pre>\n<ul>\n<li>Crawl website use Javascript to render content (use selenium):</li>\n</ul>\n<pre><code># add later, bugs :)\n</code></pre>\n<ul>\n<li>Crawl with multiprocessing (use requests mode):</li>\n</ul>\n<pre><code>In [1]: import framler                                                                                                                                                                                              \n\nIn [2]: ac = framler.AutoCrawlParser()                                                                                                                                                                              \n\nIn [3]: urls = ['https://thanhnien.vn/thoi-su/de-xuat-dua-chuan-muc-dao-duc-nha-giao-vao-luat-de-bao-ve-hoc-sinh-1059827.html', \n   ...:  'https://thethao.thanhnien.vn/bong-da-quoc-te/chien-thang-truoc-psg-da-mang-lai-hop-dong-dai-han-cho-solskjaer-o-mu-99218.html', \n   ...:  'https://dantri.com.vn/xa-hoi/co-van-nha-trang-thuong-dinh-my-trieu-tai-viet-nam-la-mot-thanh-cong-20190304074414493.htm', \n   ...:  'https://vnexpress.net/the-gioi/cuoc-gap-phut-chot-cua-doan-viet-nam-tai-binh-nhuong-truoc-thuong-dinh-my-trieu-3892871.html', \n   ...:  'https://tuoitre.vn/bao-trieu-tien-chuyen-di-viet-nam-cua-ong-kim-ong-un-lam-rung-chuyen-the-gioi-20190306111422098.htm', \n   ...:  'https://news.zing.vn/ong-chu-masan-tro-thanh-ty-phu-usd-khi-chi-so-huu-15-co-phieu-post922676.html', \n   ...:  'https://vov.vn/the-gioi/tong-thong-trump-va-dang-dan-chu-2-nam-cuoc-chien-tai-quoc-hoi-882872.vov', \n   ...:  'https://laodong.vn/bong-da-quoc-te/lukaku-lap-cu-dup-man-united-nguoc-dong-kinh-dien-truoc-psg-660940.ldo', \n   ...:  'https://startup.vnexpress.net/tin-tuc/y-tuong-moi/startup-kiem-nua-ty-dong-nho-cong-nghe-nhan-dien-khuon-mat-3795045.html', \n   ...:  'http://cafebiz.vn/ceo-dj-koh-thua-nhan-samsung-da-tut-xuong-vi-tri-thu-hai-o-an-do-20190308083452665.chn', \n   ...:  'https://huyhoang17.github.io/machine-learning/2018/09/13/viblo-recommender-system.html', \n   ...:  'http://gamek.vn/ban-da-biet-gi-ve-autochess-tua-game-day-nhan-pham-dang-lam-mua-lam-gio-trong-cong-dong-dota-2-20190212150017453.chn']                                                                    \n\nIn [4]: articles = ac.run_processes(urls)                                                                                                                                                                           \n2019-03-13 11:38:56,858 - framler._base - INFO - Number of cpu: 6\nINFO:framler._base:Number of cpu: 6\n2019-03-13 11:39:14,338 - framler._base - INFO - Elapsed run time: 17.478716611862183 seconds\nINFO:framler._base:Elapsed run time: 17.478716611862183 seconds\n2019-03-13 11:39:14,338 - framler._base - INFO - Task ended. Pool join!\nINFO:framler._base:Task ended. Pool join!\n\nIn [5]: len(articles)                                                                                                                                                                                               \nOut[5]: 12\n\nIn [6]: for article in articles: \n   ...:     print(article.title) \n   ...:                                                                                                                                                                                                             \nThời sự Đề xuất đưa chuẩn mực đạo đức nhà giáo vào luật để bảo vệ học sinh\nChiến thắng trước PSG đã mang lại hợp đồng dài hạn cho Solskjaer ở M.U\nCố vấn Nhà Trắng: Thượng đỉnh Mỹ - Triều tại Việt Nam là một thành công\nCuộc gặp phút chót của đoàn Việt Nam tại Bình Nhưỡng trước thượng đỉnh Mỹ - Triều\nBáo Triều Tiên: Chuyến đi Việt Nam của ông Kim Jong Un 'làm rung chuyển thế giới'\nZing.vn Tri thức trực tuyến Ông chủ Masan trở thành tỷ phú USD khi chỉ sở hữu 15 cổ phiếu?\nTổng thống Trump và đảng Dân chủ: 2 năm cuộc chiến tại Quốc hội Phe Dân chủ muốn “đánh” đòn hiểm vào ông Trump bằng tài liệu nhạy cảm\nLukaku lập cú đúp, Man United ngược dòng kinh điển trước PSG\nStartup kiếm nửa tỷ đồng nhờ công nghệ nhận diện khuôn mặt\nCEO DJ Koh thừa nhận Samsung đã tụt xuống vị trí thứ hai ở Ấn Độ\nXây dựng hệ thống gợi ý bài viết cho ... website Viblo\nBạn đã biết gì về Auto Chess, tựa game đầy \"nhân phẩm\" đang làm mưa làm gió trong cộng đồng DOTA 2\n</code></pre>\n<h3>TODO</h3>\n<ul>\n<li>Add document</li>\n</ul>\n<h2>Reference</h2>\n<p>Based on newspaper's API library: <a href=\"https://github.com/codelucas/newspaper\" rel=\"nofollow\">https://github.com/codelucas/newspaper</a> and AutoCrawler library: <a href=\"https://github.com/YoongiKim/AutoCrawler\" rel=\"nofollow\">https://github.com/YoongiKim/AutoCrawler</a></p>\n<h2>Credits</h2>\n<p>This package was created with <a href=\"https://github.com/audreyr/cookiecutter\" rel=\"nofollow\">Cookiecutter</a> and the <a href=\"https://github.com/audreyr/cookiecutter-pypackage\" rel=\"nofollow\"><code>audreyr/cookiecutter-pypackage</code></a> project template.</p>\n\n          </div>"}, "last_serial": 4933940, "releases": {"0.0.1": [{"comment_text": "", "digests": {"md5": "066ef8966cef7518a0d5c912ba0f5537", "sha256": "4acb1e82344f9070aac2ccccc652da44ab513cab73d1f4db1b18022bf5bb0181"}, "downloads": -1, "filename": "framler-0.0.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "066ef8966cef7518a0d5c912ba0f5537", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 3924, "upload_time": "2019-02-12T07:04:37", "upload_time_iso_8601": "2019-02-12T07:04:37.155449Z", "url": "https://files.pythonhosted.org/packages/3d/bc/d1c3cc76902b2ba8c70bbc033fce764729a5ac1028f6837c96edaf517654/framler-0.0.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "91eb880bce8c21951290549fb923ceb3", "sha256": "a388e01ffeb728fcca1c601a4e3691861785cdaee1d0a310ffd3bcb135b52308"}, "downloads": -1, "filename": "framler-0.0.1.tar.gz", "has_sig": false, "md5_digest": "91eb880bce8c21951290549fb923ceb3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8546, "upload_time": "2019-02-12T07:04:39", "upload_time_iso_8601": "2019-02-12T07:04:39.393798Z", "url": "https://files.pythonhosted.org/packages/18/5f/e6797ab8a95627867dafedd9ae01b3b9f2dc529ad05f9c8b381bdaafac47/framler-0.0.1.tar.gz", "yanked": false}], "0.0.2": [{"comment_text": "", "digests": {"md5": "fdfb32c409db29fc96333515f3d394b0", "sha256": "6946d8078ba763689c12cbfee3ffe79c26e6087345b1a048097590dcf69f3ccf"}, "downloads": -1, "filename": "framler-0.0.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "fdfb32c409db29fc96333515f3d394b0", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 3851, "upload_time": "2019-02-12T07:34:45", "upload_time_iso_8601": "2019-02-12T07:34:45.986306Z", "url": "https://files.pythonhosted.org/packages/7e/4f/57fc5ab2c14d4e6158c83287a0b8ec6373e626e53b1589c6c7f1d1a7013b/framler-0.0.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b5f89bb30d8b6e32789d0986f601d0fc", "sha256": "d8d6a796ee6e1f83d7f543cf797732e696e0e58fe80f498b8e37c61634b95c52"}, "downloads": -1, "filename": "framler-0.0.2.tar.gz", "has_sig": false, "md5_digest": "b5f89bb30d8b6e32789d0986f601d0fc", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8555, "upload_time": "2019-02-12T07:34:47", "upload_time_iso_8601": "2019-02-12T07:34:47.418066Z", "url": "https://files.pythonhosted.org/packages/8f/a4/f34778ad74af8e3440c9d170583aea2288355cef8b3780a780a16d100098/framler-0.0.2.tar.gz", "yanked": false}], "0.0.3": [{"comment_text": "", "digests": {"md5": "a3497f38c1aa74600cbb87ddff4488fa", "sha256": "72a24027b7b44acbf946bb077d1d034811d26bb95326958eb10c2bb5469d2c4b"}, "downloads": -1, "filename": "framler-0.0.3-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "a3497f38c1aa74600cbb87ddff4488fa", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 3685, "upload_time": "2019-02-12T07:54:56", "upload_time_iso_8601": "2019-02-12T07:54:56.100692Z", "url": "https://files.pythonhosted.org/packages/49/15/a1bb4eb7b269a06dd6123d7a93e0f0c7fca512dd1bb5317102c16a49d669/framler-0.0.3-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0493484005743759d448f111a71e4941", "sha256": "b4f7f165c0798ec08b4bb8afd91580299c3ed06b72c2a669976ecc908b408bb2"}, "downloads": -1, "filename": "framler-0.0.3.tar.gz", "has_sig": false, "md5_digest": "0493484005743759d448f111a71e4941", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8432, "upload_time": "2019-02-12T07:54:57", "upload_time_iso_8601": "2019-02-12T07:54:57.705629Z", "url": "https://files.pythonhosted.org/packages/f4/20/b3f819395c2d8c527bdeadb6fd6408685254b407968332c7703762642c72/framler-0.0.3.tar.gz", "yanked": false}], "0.0.4": [{"comment_text": "", "digests": {"md5": "3bd7a0c8563f0a682c2b80b7b4b1a10c", "sha256": "b340da14bfb442b856cb2d084a14d2213f7c5c3810f95faf854548a41b571126"}, "downloads": -1, "filename": "framler-0.0.4-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "3bd7a0c8563f0a682c2b80b7b4b1a10c", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 9177, "upload_time": "2019-02-19T06:54:55", "upload_time_iso_8601": "2019-02-19T06:54:55.136535Z", "url": "https://files.pythonhosted.org/packages/a3/cb/1f472eee64adb73583ba610122222ece22a7d521d6d83584e544dfbd1cc8/framler-0.0.4-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5a59da9e5bd86d7d5e385ab2ae983c27", "sha256": "f3c86ed9e27d1b751930cfcc45b75cbc177c3eb8827576d6fc2c17e4900f1ffe"}, "downloads": -1, "filename": "framler-0.0.4.tar.gz", "has_sig": false, "md5_digest": "5a59da9e5bd86d7d5e385ab2ae983c27", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12339, "upload_time": "2019-02-19T06:54:56", "upload_time_iso_8601": "2019-02-19T06:54:56.809318Z", "url": "https://files.pythonhosted.org/packages/82/1e/d3cc61982d70a736c7b2b46b6dd8ebfcff19937a8444955e2ec9cf6bd2a7/framler-0.0.4.tar.gz", "yanked": false}], "0.0.5": [{"comment_text": "", "digests": {"md5": "13aaf0151c3529218dfea1b81febdc90", "sha256": "2e931dc3a7b7c63c1837aa21747645414d09f979e696315b698b9bd83dbe2b48"}, "downloads": -1, "filename": "framler-0.0.5-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "13aaf0151c3529218dfea1b81febdc90", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 11201, "upload_time": "2019-02-19T07:08:04", "upload_time_iso_8601": "2019-02-19T07:08:04.693828Z", "url": "https://files.pythonhosted.org/packages/67/27/0ff087a7c3602cb002d04a44980fe66a0d357d40725bd27ae0748067457c/framler-0.0.5-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ad7bd538d934acddd1497076ffd11643", "sha256": "09beff3a1d43c701d4add9f2b6797168542832a90332f93c8d6cd99fc75bdab6"}, "downloads": -1, "filename": "framler-0.0.5.tar.gz", "has_sig": false, "md5_digest": "ad7bd538d934acddd1497076ffd11643", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 17035, "upload_time": "2019-02-19T07:08:06", "upload_time_iso_8601": "2019-02-19T07:08:06.357319Z", "url": "https://files.pythonhosted.org/packages/96/5c/31d606fb5f89c76276f9802fe7cc80c963b8c2a03cfdfeb5d9e182fde5bf/framler-0.0.5.tar.gz", "yanked": false}], "0.0.6": [{"comment_text": "", "digests": {"md5": "d1aa354e3f24a5c71ec1cbdfbb94aabd", "sha256": "b03bd964cd78a2af479f79ed77b4b6d9a5d40b141e8c67a2ebcc7747628618be"}, "downloads": -1, "filename": "framler-0.0.6-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "d1aa354e3f24a5c71ec1cbdfbb94aabd", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 11694, "upload_time": "2019-02-19T07:21:10", "upload_time_iso_8601": "2019-02-19T07:21:10.590524Z", "url": "https://files.pythonhosted.org/packages/9f/7c/cc68e4a36f1fb6cea0f49f400e79d8cf3310a427e3fb39bd5d00911ff2a5/framler-0.0.6-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e9d1929c04b5725ccd2511290a4092bf", "sha256": "a419d0a798e2a8f3f318c16f29e8044e93a4131a22d27e23a2e7dd30341a1819"}, "downloads": -1, "filename": "framler-0.0.6.tar.gz", "has_sig": false, "md5_digest": "e9d1929c04b5725ccd2511290a4092bf", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 17478, "upload_time": "2019-02-19T07:21:12", "upload_time_iso_8601": "2019-02-19T07:21:12.403887Z", "url": "https://files.pythonhosted.org/packages/26/b9/8a3dfc8b0dc480df325d42aadb03839fe65f0de89402f8c9c228cb3ea960/framler-0.0.6.tar.gz", "yanked": false}], "0.0.7": [{"comment_text": "", "digests": {"md5": "5ab83fb00c2309e9b9a0c5091aaf2626", "sha256": "c13fb992bc2f338382a6db6359586c4e673a347400fba3000cd021854d9981de"}, "downloads": -1, "filename": "framler-0.0.7-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "5ab83fb00c2309e9b9a0c5091aaf2626", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 11854, "upload_time": "2019-02-19T07:58:49", "upload_time_iso_8601": "2019-02-19T07:58:49.117495Z", "url": "https://files.pythonhosted.org/packages/4c/11/aa80e6080d2bc15af5d48f152d49df85bdd4724d6608acda3ba69f712405/framler-0.0.7-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1abae71ea8e90a0987f0ff952a24f5e5", "sha256": "e5f829d04737be5e3e34d78f84cc20e71fa1812efd0cb3284a5df5f23229328c"}, "downloads": -1, "filename": "framler-0.0.7.tar.gz", "has_sig": false, "md5_digest": "1abae71ea8e90a0987f0ff952a24f5e5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 17681, "upload_time": "2019-02-19T07:58:50", "upload_time_iso_8601": "2019-02-19T07:58:50.760368Z", "url": "https://files.pythonhosted.org/packages/03/a0/93bee08578e8d86f6d0490dda9e900b53f50c39c4638b8b6cface9c4967d/framler-0.0.7.tar.gz", "yanked": false}], "0.0.8": [{"comment_text": "", "digests": {"md5": "0d491554cee50ec7903a273f3b8f1984", "sha256": "5927bc139a68ff1fac00d8f0f283af403ed2e8320b79925619b592f69c8e4cca"}, "downloads": -1, "filename": "framler-0.0.8-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "0d491554cee50ec7903a273f3b8f1984", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 13612, "upload_time": "2019-02-22T08:59:56", "upload_time_iso_8601": "2019-02-22T08:59:56.075430Z", "url": "https://files.pythonhosted.org/packages/1c/d7/62ec0f853d3fb29f2b955f7b65e86c7c9499487024f893d0e7b36c3e604a/framler-0.0.8-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0055bd6c2d6b66a5c841955bfc145b06", "sha256": "2bf0ff94b6ac7d8c284567786821fc7058e593ba7cc40ecfda18649dfd9508bc"}, "downloads": -1, "filename": "framler-0.0.8.tar.gz", "has_sig": false, "md5_digest": "0055bd6c2d6b66a5c841955bfc145b06", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 20196, "upload_time": "2019-02-22T08:59:57", "upload_time_iso_8601": "2019-02-22T08:59:57.775049Z", "url": "https://files.pythonhosted.org/packages/53/61/4c46669153a9ee955b7789ef0a0065f546a1a0bae4ea966f98303f7963f6/framler-0.0.8.tar.gz", "yanked": false}], "0.1.0": [{"comment_text": "", "digests": {"md5": "0e67d32a32a3d67984ebdf0e982951f1", "sha256": "e3f2b47d00e991fb440616fbed7cd9351adc947464aa1c4beada820c72484a8b"}, "downloads": -1, "filename": "framler-0.1.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "0e67d32a32a3d67984ebdf0e982951f1", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 20114, "upload_time": "2019-03-13T04:48:57", "upload_time_iso_8601": "2019-03-13T04:48:57.184500Z", "url": "https://files.pythonhosted.org/packages/79/59/7703a283aebeace7417795343e9b13b422573b04c2d6855e519497ac4273/framler-0.1.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "adb442d281a2629f8e2bad3b1e4293ae", "sha256": "d1483fbffd084b95c5828b7e78d6804da788e815c9a01589ab22f9fdf5f5c36f"}, "downloads": -1, "filename": "framler-0.1.0.tar.gz", "has_sig": false, "md5_digest": "adb442d281a2629f8e2bad3b1e4293ae", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30326, "upload_time": "2019-03-13T04:48:59", "upload_time_iso_8601": "2019-03-13T04:48:59.311146Z", "url": "https://files.pythonhosted.org/packages/8a/71/927cea5b8de9a1ef6dbd67507919c45b70da19f6359a293f2140a5bb9dd6/framler-0.1.0.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "e8914f33bbddaf5beb5b300f1ac5e1b4", "sha256": "dc80ee006c487ae28a69ecdad5390677c9a0367e78b1a2fbb9d4e1e2dbb94919"}, "downloads": -1, "filename": "framler-0.1.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "e8914f33bbddaf5beb5b300f1ac5e1b4", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 20465, "upload_time": "2019-03-13T10:16:48", "upload_time_iso_8601": "2019-03-13T10:16:48.568991Z", "url": "https://files.pythonhosted.org/packages/e7/fa/21708e09db882dc1011c93436517194eea95e5640d3d0851194ed82d3d96/framler-0.1.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ac60863f83e403821ced8b9f567a6552", "sha256": "72149d98546c1a201290762e77985ba043c27115c938958e8b398714e2d9979f"}, "downloads": -1, "filename": "framler-0.1.1.tar.gz", "has_sig": false, "md5_digest": "ac60863f83e403821ced8b9f567a6552", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30474, "upload_time": "2019-03-13T10:16:50", "upload_time_iso_8601": "2019-03-13T10:16:50.521035Z", "url": "https://files.pythonhosted.org/packages/ec/1a/557c7f869050a39cb34f7ff8b526eea0d0cd85ef88375c5649a35a672800/framler-0.1.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "e8914f33bbddaf5beb5b300f1ac5e1b4", "sha256": "dc80ee006c487ae28a69ecdad5390677c9a0367e78b1a2fbb9d4e1e2dbb94919"}, "downloads": -1, "filename": "framler-0.1.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "e8914f33bbddaf5beb5b300f1ac5e1b4", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 20465, "upload_time": "2019-03-13T10:16:48", "upload_time_iso_8601": "2019-03-13T10:16:48.568991Z", "url": "https://files.pythonhosted.org/packages/e7/fa/21708e09db882dc1011c93436517194eea95e5640d3d0851194ed82d3d96/framler-0.1.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ac60863f83e403821ced8b9f567a6552", "sha256": "72149d98546c1a201290762e77985ba043c27115c938958e8b398714e2d9979f"}, "downloads": -1, "filename": "framler-0.1.1.tar.gz", "has_sig": false, "md5_digest": "ac60863f83e403821ced8b9f567a6552", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30474, "upload_time": "2019-03-13T10:16:50", "upload_time_iso_8601": "2019-03-13T10:16:50.521035Z", "url": "https://files.pythonhosted.org/packages/ec/1a/557c7f869050a39cb34f7ff8b526eea0d0cd85ef88375c5649a35a672800/framler-0.1.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 01:00:34 2020"}