{"info": {"author": "Corentin Cadiou", "author_email": "contact@cphyc.me", "bugtrack_url": null, "classifiers": [], "description": "BY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. TO THE EXTENT THIS LICENSE MAY BE CONSIDERED TO BE A CONTRACT, THE LICENSOR GRANTS YOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS AND CONDITIONS.\n\n1. Definitions\n\n    \"Adaptation\" means a work based upon the Work, or upon the Work and other pre-existing works, such as a translation, adaptation, derivative work, arrangement of music or other alterations of a literary or artistic work, or phonogram or performance and includes cinematographic adaptations or any other form in which the Work may be recast, transformed, or adapted including in any form recognizably derived from the original, except that a work that constitutes a Collection will not be considered an Adaptation for the purpose of this License. For the avoidance of doubt, where the Work is a musical work, performance or phonogram, the synchronization of the Work in timed-relation with a moving image (\"synching\") will be considered an Adaptation for the purpose of this License.\n    \"Collection\" means a collection of literary or artistic works, such as encyclopedias and anthologies, or performances, phonograms or broadcasts, or other works or subject matter other than works listed in Section 1(f) below, which, by reason of the selection and arrangement of their contents, constitute intellectual creations, in which the Work is included in its entirety in unmodified form along with one or more other contributions, each constituting separate and independent works in themselves, which together are assembled into a collective whole. A work that constitutes a Collection will not be considered an Adaptation (as defined below) for the purposes of this License.\n    \"Creative Commons Compatible License\" means a license that is listed at https://creativecommons.org/compatiblelicenses that has been approved by Creative Commons as being essentially equivalent to this License, including, at a minimum, because that license: (i) contains terms that have the same purpose, meaning and effect as the License Elements of this License; and, (ii) explicitly permits the relicensing of adaptations of works made available under that license under this License or a Creative Commons jurisdiction license with the same License Elements as this License.\n    \"Distribute\" means to make available to the public the original and copies of the Work or Adaptation, as appropriate, through sale or other transfer of ownership.\n    \"License Elements\" means the following high-level license attributes as selected by Licensor and indicated in the title of this License: Attribution, ShareAlike.\n    \"Licensor\" means the individual, individuals, entity or entities that offer(s) the Work under the terms of this License.\n    \"Original Author\" means, in the case of a literary or artistic work, the individual, individuals, entity or entities who created the Work or if no individual or entity can be identified, the publisher; and in addition (i) in the case of a performance the actors, singers, musicians, dancers, and other persons who act, sing, deliver, declaim, play in, interpret or otherwise perform literary or artistic works or expressions of folklore; (ii) in the case of a phonogram the producer being the person or legal entity who first fixes the sounds of a performance or other sounds; and, (iii) in the case of broadcasts, the organization that transmits the broadcast.\n    \"Work\" means the literary and/or artistic work offered under the terms of this License including without limitation any production in the literary, scientific and artistic domain, whatever may be the mode or form of its expression including digital form, such as a book, pamphlet and other writing; a lecture, address, sermon or other work of the same nature; a dramatic or dramatico-musical work; a choreographic work or entertainment in dumb show; a musical composition with or without words; a cinematographic work to which are assimilated works expressed by a process analogous to cinematography; a work of drawing, painting, architecture, sculpture, engraving or lithography; a photographic work to which are assimilated works expressed by a process analogous to photography; a work of applied art; an illustration, map, plan, sketch or three-dimensional work relative to geography, topography, architecture or science; a performance; a broadcast; a phonogram; a compilation of data to the extent it is protected as a copyrightable work; or a work performed by a variety or circus performer to the extent it is not otherwise considered a literary or artistic work.\n    \"You\" means an individual or entity exercising rights under this License who has not previously violated the terms of this License with respect to the Work, or who has received express permission from the Licensor to exercise rights under this License despite a previous violation.\n    \"Publicly Perform\" means to perform public recitations of the Work and to communicate to the public those public recitations, by any means or process, including by wire or wireless means or public digital performances; to make available to the public Works in such a way that members of the public may access these Works from a place and at a place individually chosen by them; to perform the Work to the public by any means or process and the communication to the public of the performances of the Work, including by public digital performance; to broadcast and rebroadcast the Work by any means including signs, sounds or images.\n    \"Reproduce\" means to make copies of the Work by any means including without limitation by sound or visual recordings and the right of fixation and reproducing fixations of the Work, including storage of a protected performance or phonogram in digital form or other electronic medium.\n\n2. Fair Dealing Rights. Nothing in this License is intended to reduce, limit, or restrict any uses free from copyright or rights arising from limitations or exceptions that are provided for in connection with the copyright protection under copyright law or other applicable laws.\n\n3. License Grant. Subject to the terms and conditions of this License, Licensor hereby grants You a worldwide, royalty-free, non-exclusive, perpetual (for the duration of the applicable copyright) license to exercise the rights in the Work as stated below:\n\n    to Reproduce the Work, to incorporate the Work into one or more Collections, and to Reproduce the Work as incorporated in the Collections;\n    to create and Reproduce Adaptations provided that any such Adaptation, including any translation in any medium, takes reasonable steps to clearly label, demarcate or otherwise identify that changes were made to the original Work. For example, a translation could be marked \"The original work was translated from English to Spanish,\" or a modification could indicate \"The original work has been modified.\";\n    to Distribute and Publicly Perform the Work including as incorporated in Collections; and,\n    to Distribute and Publicly Perform Adaptations.\n\n    For the avoidance of doubt:\n        Non-waivable Compulsory License Schemes. In those jurisdictions in which the right to collect royalties through any statutory or compulsory licensing scheme cannot be waived, the Licensor reserves the exclusive right to collect such royalties for any exercise by You of the rights granted under this License;\n        Waivable Compulsory License Schemes. In those jurisdictions in which the right to collect royalties through any statutory or compulsory licensing scheme can be waived, the Licensor waives the exclusive right to collect such royalties for any exercise by You of the rights granted under this License; and,\n        Voluntary License Schemes. The Licensor waives the right to collect royalties, whether individually or, in the event that the Licensor is a member of a collecting society that administers voluntary licensing schemes, via that society, from any exercise by You of the rights granted under this License.\n\nThe above rights may be exercised in all media and formats whether now known or hereafter devised. The above rights include the right to make such modifications as are technically necessary to exercise the rights in other media and formats. Subject to Section 8(f), all rights not expressly granted by Licensor are hereby reserved.\n\n4. Restrictions. The license granted in Section 3 above is expressly made subject to and limited by the following restrictions:\n\n    You may Distribute or Publicly Perform the Work only under the terms of this License. You must include a copy of, or the Uniform Resource Identifier (URI) for, this License with every copy of the Work You Distribute or Publicly Perform. You may not offer or impose any terms on the Work that restrict the terms of this License or the ability of the recipient of the Work to exercise the rights granted to that recipient under the terms of the License. You may not sublicense the Work. You must keep intact all notices that refer to this License and to the disclaimer of warranties with every copy of the Work You Distribute or Publicly Perform. When You Distribute or Publicly Perform the Work, You may not impose any effective technological measures on the Work that restrict the ability of a recipient of the Work from You to exercise the rights granted to that recipient under the terms of the License. This Section 4(a) applies to the Work as incorporated in a Collection, but this does not require the Collection apart from the Work itself to be made subject to the terms of this License. If You create a Collection, upon notice from any Licensor You must, to the extent practicable, remove from the Collection any credit as required by Section 4(c), as requested. If You create an Adaptation, upon notice from any Licensor You must, to the extent practicable, remove from the Adaptation any credit as required by Section 4(c), as requested.\n    You may Distribute or Publicly Perform an Adaptation only under the terms of: (i) this License; (ii) a later version of this License with the same License Elements as this License; (iii) a Creative Commons jurisdiction license (either this or a later license version) that contains the same License Elements as this License (e.g., Attribution-ShareAlike 3.0 US)); (iv) a Creative Commons Compatible License. If you license the Adaptation under one of the licenses mentioned in (iv), you must comply with the terms of that license. If you license the Adaptation under the terms of any of the licenses mentioned in (i), (ii) or (iii) (the \"Applicable License\"), you must comply with the terms of the Applicable License generally and the following provisions: (I) You must include a copy of, or the URI for, the Applicable License with every copy of each Adaptation You Distribute or Publicly Perform; (II) You may not offer or impose any terms on the Adaptation that restrict the terms of the Applicable License or the ability of the recipient of the Adaptation to exercise the rights granted to that recipient under the terms of the Applicable License; (III) You must keep intact all notices that refer to the Applicable License and to the disclaimer of warranties with every copy of the Work as included in the Adaptation You Distribute or Publicly Perform; (IV) when You Distribute or Publicly Perform the Adaptation, You may not impose any effective technological measures on the Adaptation that restrict the ability of a recipient of the Adaptation from You to exercise the rights granted to that recipient under the terms of the Applicable License. This Section 4(b) applies to the Adaptation as incorporated in a Collection, but this does not require the Collection apart from the Adaptation itself to be made subject to the terms of the Applicable License.\n    If You Distribute, or Publicly Perform the Work or any Adaptations or Collections, You must, unless a request has been made pursuant to Section 4(a), keep intact all copyright notices for the Work and provide, reasonable to the medium or means You are utilizing: (i) the name of the Original Author (or pseudonym, if applicable) if supplied, and/or if the Original Author and/or Licensor designate another party or parties (e.g., a sponsor institute, publishing entity, journal) for attribution (\"Attribution Parties\") in Licensor's copyright notice, terms of service or by other reasonable means, the name of such party or parties; (ii) the title of the Work if supplied; (iii) to the extent reasonably practicable, the URI, if any, that Licensor specifies to be associated with the Work, unless such URI does not refer to the copyright notice or licensing information for the Work; and (iv) , consistent with Ssection 3(b), in the case of an Adaptation, a credit identifying the use of the Work in the Adaptation (e.g., \"French translation of the Work by Original Author,\" or \"Screenplay based on original Work by Original Author\"). The credit required by this Section 4(c) may be implemented in any reasonable manner; provided, however, that in the case of a Adaptation or Collection, at a minimum such credit will appear, if a credit for all contributing authors of the Adaptation or Collection appears, then as part of these credits and in a manner at least as prominent as the credits for the other contributing authors. For the avoidance of doubt, You may only use the credit required by this Section for the purpose of attribution in the manner set out above and, by exercising Your rights under this License, You may not implicitly or explicitly assert or imply any connection with, sponsorship or endorsement by the Original Author, Licensor and/or Attribution Parties, as appropriate, of You or Your use of the Work, without the separate, express prior written permission of the Original Author, Licensor and/or Attribution Parties.\n    Except as otherwise agreed in writing by the Licensor or as may be otherwise permitted by applicable law, if You Reproduce, Distribute or Publicly Perform the Work either by itself or as part of any Adaptations or Collections, You must not distort, mutilate, modify or take other derogatory action in relation to the Work which would be prejudicial to the Original Author's honor or reputation. Licensor agrees that in those jurisdictions (e.g. Japan), in which any exercise of the right granted in Section 3(b) of this License (the right to make Adaptations) would be deemed to be a distortion, mutilation, modification or other derogatory action prejudicial to the Original Author's honor and reputation, the Licensor will waive or not assert, as appropriate, this Section, to the fullest extent permitted by the applicable national law, to enable You to reasonably exercise Your right under Section 3(b) of this License (right to make Adaptations) but not otherwise.\n\n5. Representations, Warranties and Disclaimer\n\nUNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING, LICENSOR OFFERS THE WORK AS-IS AND MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED, STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF TITLE, MERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY, OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO SUCH EXCLUSION MAY NOT APPLY TO YOU.\n\n6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY APPLICABLE LAW, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK, EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. Termination\n\n    This License and the rights granted hereunder will terminate automatically upon any breach by You of the terms of this License. Individuals or entities who have received Adaptations or Collections from You under this License, however, will not have their licenses terminated provided such individuals or entities remain in full compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will survive any termination of this License.\n    Subject to the above terms and conditions, the license granted here is perpetual (for the duration of the applicable copyright in the Work). Notwithstanding the above, Licensor reserves the right to release the Work under different license terms or to stop distributing the Work at any time; provided, however that any such election will not serve to withdraw this License (or any other license that has been, or is required to be, granted under the terms of this License), and this License will continue in full force and effect unless terminated as stated above.\n\n8. Miscellaneous\n\n    Each time You Distribute or Publicly Perform the Work or a Collection, the Licensor offers to the recipient a license to the Work on the same terms and conditions as the license granted to You under this License.\n    Each time You Distribute or Publicly Perform an Adaptation, Licensor offers to the recipient a license to the original Work on the same terms and conditions as the license granted to You under this License.\n    If any provision of this License is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this License, and without further action by the parties to this agreement, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\n    No term or provision of this License shall be deemed waived and no breach consented to unless such waiver or consent shall be in writing and signed by the party to be charged with such waiver or consent.\n    This License constitutes the entire agreement between the parties with respect to the Work licensed here. There are no understandings, agreements or representations with respect to the Work not specified here. Licensor shall not be bound by any additional provisions that may appear in any communication from You. This License may not be modified without the mutual written agreement of the Licensor and You.\n    The rights granted under, and the subject matter referenced, in this License were drafted utilizing the terminology of the Berne Convention for the Protection of Literary and Artistic Works (as amended on September 28, 1979), the Rome Convention of 1961, the WIPO Copyright Treaty of 1996, the WIPO Performances and Phonograms Treaty of 1996 and the Universal Copyright Convention (as revised on July 24, 1971). These rights and subject matter take effect in the relevant jurisdiction in which the License terms are sought to be enforced according to the corresponding provisions of the implementation of those treaty provisions in the applicable national law. If the standard suite of rights granted under applicable copyright law includes additional rights not granted under this License, such additional rights are deemed to be included in the License; this License is not intended to restrict the license of any rights under applicable law.\n\n\nDescription-Content-Type: UNKNOWN\nDescription: FyeldGenerator repository\n        =========================\n        \n        This package provides with a quick way of generating random field having a specified power spectrum.\n        \n        \n        Example\n        -------\n        \n        ```python\n        \n        from FyeldGenerator import generate_field\n        import matplotlib.pyplot as plt\n        import numpy as np\n        \n        # Helper that generates power-law power spectrum\n        def Pkgen(n):\n            def Pk(k):\n                return np.power(k, -n)\n        \n            return Pk\n        \n        # Draw samples from a normal distribution\n        def distrib(shape):\n            return np.random.normal(size=shape)\n        \n        shape = (512, 512)\n        \n        field = generate_field(distrib, Pkgen(2), shape)\n        \n        plt.imshow(field, cmap='seismic')\n        \n        ```\n        \n        Install\n        -------\n        It is now on pypi!\n        For the \"official\" release, use:\n        ```bash\n        pip install FyeldGenerator\n        ```\n        \n        For the latest release:\n        ```bash\n        pip install -e git+https://github.com/cphyc/FyeldGenerator.git#egg=FyeldGenerator\n        ```\n        \n        License\n        -------\n        This work is licensed under the CC-BY-SA license. You are allowed to copy, modify and distribute it as long as you keed the license. See more in the LICENSE file.\n        \nPlatform: UNKNOWN\nClassifier: Development status :: 1 - Alpha\nClassifier: License :: CC-By-SA2.0\nClassifier: Programming Language :: Python\nClassifier: Topic :: Gaussian Random Field\n", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/cphyc/FyeldGenerator", "keywords": "", "license": "THE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE COMMONS PUBLIC LICENSE (\"CCPL\" OR \"LICENSE\"). THE WORK IS PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS PROHIBITED.", "maintainer": "", "maintainer_email": "", "name": "FyeldGenerator", "package_url": "https://pypi.org/project/FyeldGenerator/", "platform": "", "project_url": "https://pypi.org/project/FyeldGenerator/", "project_urls": {"Homepage": "https://github.com/cphyc/FyeldGenerator"}, "release_url": "https://pypi.org/project/FyeldGenerator/0.1.6/", "requires_dist": ["numpy", "six"], "requires_python": "", "summary": "Simple package to symmetric generate random field.", "version": "0.1.6", "yanked": false, "html_description": "<div class=\"project-description\">\n            BY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. TO THE EXTENT THIS LICENSE MAY BE CONSIDERED TO BE A CONTRACT, THE LICENSOR GRANTS YOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS AND CONDITIONS.<br><br>1. Definitions<br><br>    \"Adaptation\" means a work based upon the Work, or upon the Work and other pre-existing works, such as a translation, adaptation, derivative work, arrangement of music or other alterations of a literary or artistic work, or phonogram or performance and includes cinematographic adaptations or any other form in which the Work may be recast, transformed, or adapted including in any form recognizably derived from the original, except that a work that constitutes a Collection will not be considered an Adaptation for the purpose of this License. For the avoidance of doubt, where the Work is a musical work, performance or phonogram, the synchronization of the Work in timed-relation with a moving image (\"synching\") will be considered an Adaptation for the purpose of this License.<br>    \"Collection\" means a collection of literary or artistic works, such as encyclopedias and anthologies, or performances, phonograms or broadcasts, or other works or subject matter other than works listed in Section 1(f) below, which, by reason of the selection and arrangement of their contents, constitute intellectual creations, in which the Work is included in its entirety in unmodified form along with one or more other contributions, each constituting separate and independent works in themselves, which together are assembled into a collective whole. A work that constitutes a Collection will not be considered an Adaptation (as defined below) for the purposes of this License.<br>    \"Creative Commons Compatible License\" means a license that is listed at https://creativecommons.org/compatiblelicenses that has been approved by Creative Commons as being essentially equivalent to this License, including, at a minimum, because that license: (i) contains terms that have the same purpose, meaning and effect as the License Elements of this License; and, (ii) explicitly permits the relicensing of adaptations of works made available under that license under this License or a Creative Commons jurisdiction license with the same License Elements as this License.<br>    \"Distribute\" means to make available to the public the original and copies of the Work or Adaptation, as appropriate, through sale or other transfer of ownership.<br>    \"License Elements\" means the following high-level license attributes as selected by Licensor and indicated in the title of this License: Attribution, ShareAlike.<br>    \"Licensor\" means the individual, individuals, entity or entities that offer(s) the Work under the terms of this License.<br>    \"Original Author\" means, in the case of a literary or artistic work, the individual, individuals, entity or entities who created the Work or if no individual or entity can be identified, the publisher; and in addition (i) in the case of a performance the actors, singers, musicians, dancers, and other persons who act, sing, deliver, declaim, play in, interpret or otherwise perform literary or artistic works or expressions of folklore; (ii) in the case of a phonogram the producer being the person or legal entity who first fixes the sounds of a performance or other sounds; and, (iii) in the case of broadcasts, the organization that transmits the broadcast.<br>    \"Work\" means the literary and/or artistic work offered under the terms of this License including without limitation any production in the literary, scientific and artistic domain, whatever may be the mode or form of its expression including digital form, such as a book, pamphlet and other writing; a lecture, address, sermon or other work of the same nature; a dramatic or dramatico-musical work; a choreographic work or entertainment in dumb show; a musical composition with or without words; a cinematographic work to which are assimilated works expressed by a process analogous to cinematography; a work of drawing, painting, architecture, sculpture, engraving or lithography; a photographic work to which are assimilated works expressed by a process analogous to photography; a work of applied art; an illustration, map, plan, sketch or three-dimensional work relative to geography, topography, architecture or science; a performance; a broadcast; a phonogram; a compilation of data to the extent it is protected as a copyrightable work; or a work performed by a variety or circus performer to the extent it is not otherwise considered a literary or artistic work.<br>    \"You\" means an individual or entity exercising rights under this License who has not previously violated the terms of this License with respect to the Work, or who has received express permission from the Licensor to exercise rights under this License despite a previous violation.<br>    \"Publicly Perform\" means to perform public recitations of the Work and to communicate to the public those public recitations, by any means or process, including by wire or wireless means or public digital performances; to make available to the public Works in such a way that members of the public may access these Works from a place and at a place individually chosen by them; to perform the Work to the public by any means or process and the communication to the public of the performances of the Work, including by public digital performance; to broadcast and rebroadcast the Work by any means including signs, sounds or images.<br>    \"Reproduce\" means to make copies of the Work by any means including without limitation by sound or visual recordings and the right of fixation and reproducing fixations of the Work, including storage of a protected performance or phonogram in digital form or other electronic medium.<br><br>2. Fair Dealing Rights. Nothing in this License is intended to reduce, limit, or restrict any uses free from copyright or rights arising from limitations or exceptions that are provided for in connection with the copyright protection under copyright law or other applicable laws.<br><br>3. License Grant. Subject to the terms and conditions of this License, Licensor hereby grants You a worldwide, royalty-free, non-exclusive, perpetual (for the duration of the applicable copyright) license to exercise the rights in the Work as stated below:<br><br>    to Reproduce the Work, to incorporate the Work into one or more Collections, and to Reproduce the Work as incorporated in the Collections;<br>    to create and Reproduce Adaptations provided that any such Adaptation, including any translation in any medium, takes reasonable steps to clearly label, demarcate or otherwise identify that changes were made to the original Work. For example, a translation could be marked \"The original work was translated from English to Spanish,\" or a modification could indicate \"The original work has been modified.\";<br>    to Distribute and Publicly Perform the Work including as incorporated in Collections; and,<br>    to Distribute and Publicly Perform Adaptations.<br><br>    For the avoidance of doubt:<br>        Non-waivable Compulsory License Schemes. In those jurisdictions in which the right to collect royalties through any statutory or compulsory licensing scheme cannot be waived, the Licensor reserves the exclusive right to collect such royalties for any exercise by You of the rights granted under this License;<br>        Waivable Compulsory License Schemes. In those jurisdictions in which the right to collect royalties through any statutory or compulsory licensing scheme can be waived, the Licensor waives the exclusive right to collect such royalties for any exercise by You of the rights granted under this License; and,<br>        Voluntary License Schemes. The Licensor waives the right to collect royalties, whether individually or, in the event that the Licensor is a member of a collecting society that administers voluntary licensing schemes, via that society, from any exercise by You of the rights granted under this License.<br><br>The above rights may be exercised in all media and formats whether now known or hereafter devised. The above rights include the right to make such modifications as are technically necessary to exercise the rights in other media and formats. Subject to Section 8(f), all rights not expressly granted by Licensor are hereby reserved.<br><br>4. Restrictions. The license granted in Section 3 above is expressly made subject to and limited by the following restrictions:<br><br>    You may Distribute or Publicly Perform the Work only under the terms of this License. You must include a copy of, or the Uniform Resource Identifier (URI) for, this License with every copy of the Work You Distribute or Publicly Perform. You may not offer or impose any terms on the Work that restrict the terms of this License or the ability of the recipient of the Work to exercise the rights granted to that recipient under the terms of the License. You may not sublicense the Work. You must keep intact all notices that refer to this License and to the disclaimer of warranties with every copy of the Work You Distribute or Publicly Perform. When You Distribute or Publicly Perform the Work, You may not impose any effective technological measures on the Work that restrict the ability of a recipient of the Work from You to exercise the rights granted to that recipient under the terms of the License. This Section 4(a) applies to the Work as incorporated in a Collection, but this does not require the Collection apart from the Work itself to be made subject to the terms of this License. If You create a Collection, upon notice from any Licensor You must, to the extent practicable, remove from the Collection any credit as required by Section 4(c), as requested. If You create an Adaptation, upon notice from any Licensor You must, to the extent practicable, remove from the Adaptation any credit as required by Section 4(c), as requested.<br>    You may Distribute or Publicly Perform an Adaptation only under the terms of: (i) this License; (ii) a later version of this License with the same License Elements as this License; (iii) a Creative Commons jurisdiction license (either this or a later license version) that contains the same License Elements as this License (e.g., Attribution-ShareAlike 3.0 US)); (iv) a Creative Commons Compatible License. If you license the Adaptation under one of the licenses mentioned in (iv), you must comply with the terms of that license. If you license the Adaptation under the terms of any of the licenses mentioned in (i), (ii) or (iii) (the \"Applicable License\"), you must comply with the terms of the Applicable License generally and the following provisions: (I) You must include a copy of, or the URI for, the Applicable License with every copy of each Adaptation You Distribute or Publicly Perform; (II) You may not offer or impose any terms on the Adaptation that restrict the terms of the Applicable License or the ability of the recipient of the Adaptation to exercise the rights granted to that recipient under the terms of the Applicable License; (III) You must keep intact all notices that refer to the Applicable License and to the disclaimer of warranties with every copy of the Work as included in the Adaptation You Distribute or Publicly Perform; (IV) when You Distribute or Publicly Perform the Adaptation, You may not impose any effective technological measures on the Adaptation that restrict the ability of a recipient of the Adaptation from You to exercise the rights granted to that recipient under the terms of the Applicable License. This Section 4(b) applies to the Adaptation as incorporated in a Collection, but this does not require the Collection apart from the Adaptation itself to be made subject to the terms of the Applicable License.<br>    If You Distribute, or Publicly Perform the Work or any Adaptations or Collections, You must, unless a request has been made pursuant to Section 4(a), keep intact all copyright notices for the Work and provide, reasonable to the medium or means You are utilizing: (i) the name of the Original Author (or pseudonym, if applicable) if supplied, and/or if the Original Author and/or Licensor designate another party or parties (e.g., a sponsor institute, publishing entity, journal) for attribution (\"Attribution Parties\") in Licensor's copyright notice, terms of service or by other reasonable means, the name of such party or parties; (ii) the title of the Work if supplied; (iii) to the extent reasonably practicable, the URI, if any, that Licensor specifies to be associated with the Work, unless such URI does not refer to the copyright notice or licensing information for the Work; and (iv) , consistent with Ssection 3(b), in the case of an Adaptation, a credit identifying the use of the Work in the Adaptation (e.g., \"French translation of the Work by Original Author,\" or \"Screenplay based on original Work by Original Author\"). The credit required by this Section 4(c) may be implemented in any reasonable manner; provided, however, that in the case of a Adaptation or Collection, at a minimum such credit will appear, if a credit for all contributing authors of the Adaptation or Collection appears, then as part of these credits and in a manner at least as prominent as the credits for the other contributing authors. For the avoidance of doubt, You may only use the credit required by this Section for the purpose of attribution in the manner set out above and, by exercising Your rights under this License, You may not implicitly or explicitly assert or imply any connection with, sponsorship or endorsement by the Original Author, Licensor and/or Attribution Parties, as appropriate, of You or Your use of the Work, without the separate, express prior written permission of the Original Author, Licensor and/or Attribution Parties.<br>    Except as otherwise agreed in writing by the Licensor or as may be otherwise permitted by applicable law, if You Reproduce, Distribute or Publicly Perform the Work either by itself or as part of any Adaptations or Collections, You must not distort, mutilate, modify or take other derogatory action in relation to the Work which would be prejudicial to the Original Author's honor or reputation. Licensor agrees that in those jurisdictions (e.g. Japan), in which any exercise of the right granted in Section 3(b) of this License (the right to make Adaptations) would be deemed to be a distortion, mutilation, modification or other derogatory action prejudicial to the Original Author's honor and reputation, the Licensor will waive or not assert, as appropriate, this Section, to the fullest extent permitted by the applicable national law, to enable You to reasonably exercise Your right under Section 3(b) of this License (right to make Adaptations) but not otherwise.<br><br>5. Representations, Warranties and Disclaimer<br><br>UNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING, LICENSOR OFFERS THE WORK AS-IS AND MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED, STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF TITLE, MERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY, OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO SUCH EXCLUSION MAY NOT APPLY TO YOU.<br><br>6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY APPLICABLE LAW, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK, EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.<br><br>7. Termination<br><br>    This License and the rights granted hereunder will terminate automatically upon any breach by You of the terms of this License. Individuals or entities who have received Adaptations or Collections from You under this License, however, will not have their licenses terminated provided such individuals or entities remain in full compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will survive any termination of this License.<br>    Subject to the above terms and conditions, the license granted here is perpetual (for the duration of the applicable copyright in the Work). Notwithstanding the above, Licensor reserves the right to release the Work under different license terms or to stop distributing the Work at any time; provided, however that any such election will not serve to withdraw this License (or any other license that has been, or is required to be, granted under the terms of this License), and this License will continue in full force and effect unless terminated as stated above.<br><br>8. Miscellaneous<br><br>    Each time You Distribute or Publicly Perform the Work or a Collection, the Licensor offers to the recipient a license to the Work on the same terms and conditions as the license granted to You under this License.<br>    Each time You Distribute or Publicly Perform an Adaptation, Licensor offers to the recipient a license to the original Work on the same terms and conditions as the license granted to You under this License.<br>    If any provision of this License is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this License, and without further action by the parties to this agreement, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.<br>    No term or provision of this License shall be deemed waived and no breach consented to unless such waiver or consent shall be in writing and signed by the party to be charged with such waiver or consent.<br>    This License constitutes the entire agreement between the parties with respect to the Work licensed here. There are no understandings, agreements or representations with respect to the Work not specified here. Licensor shall not be bound by any additional provisions that may appear in any communication from You. This License may not be modified without the mutual written agreement of the Licensor and You.<br>    The rights granted under, and the subject matter referenced, in this License were drafted utilizing the terminology of the Berne Convention for the Protection of Literary and Artistic Works (as amended on September 28, 1979), the Rome Convention of 1961, the WIPO Copyright Treaty of 1996, the WIPO Performances and Phonograms Treaty of 1996 and the Universal Copyright Convention (as revised on July 24, 1971). These rights and subject matter take effect in the relevant jurisdiction in which the License terms are sought to be enforced according to the corresponding provisions of the implementation of those treaty provisions in the applicable national law. If the standard suite of rights granted under applicable copyright law includes additional rights not granted under this License, such additional rights are deemed to be included in the License; this License is not intended to restrict the license of any rights under applicable law.<br><br><br>Description-Content-Type: UNKNOWN<br>Description: FyeldGenerator repository<br>        =========================<br>        <br>        This package provides with a quick way of generating random field having a specified power spectrum.<br>        <br>        <br>        Example<br>        -------<br>        <br>        ```python<br>        <br>        from FyeldGenerator import generate_field<br>        import matplotlib.pyplot as plt<br>        import numpy as np<br>        <br>        # Helper that generates power-law power spectrum<br>        def Pkgen(n):<br>            def Pk(k):<br>                return np.power(k, -n)<br>        <br>            return Pk<br>        <br>        # Draw samples from a normal distribution<br>        def distrib(shape):<br>            return np.random.normal(size=shape)<br>        <br>        shape = (512, 512)<br>        <br>        field = generate_field(distrib, Pkgen(2), shape)<br>        <br>        plt.imshow(field, cmap='seismic')<br>        <br>        ```<br>        <br>        Install<br>        -------<br>        It is now on pypi!<br>        For the \"official\" release, use:<br>        ```bash<br>        pip install FyeldGenerator<br>        ```<br>        <br>        For the latest release:<br>        ```bash<br>        pip install -e git+https://github.com/cphyc/FyeldGenerator.git#egg=FyeldGenerator<br>        ```<br>        <br>        License<br>        -------<br>        This work is licensed under the CC-BY-SA license. You are allowed to copy, modify and distribute it as long as you keed the license. See more in the LICENSE file.<br>        <br>Platform: UNKNOWN<br>Classifier: Development status :: 1 - Alpha<br>Classifier: License :: CC-By-SA2.0<br>Classifier: Programming Language :: Python<br>Classifier: Topic :: Gaussian Random Field<br>\n          </div>"}, "last_serial": 3473721, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "0b3c5101da4f6becfd45af13f35f8387", "sha256": "b8d2293b771e23396d6ad5945a46a9c995a7e78ed7e63df8220935f7c95e2ca3"}, "downloads": -1, "filename": "FyeldGenerator-0.1.0-py2.7.egg", "has_sig": false, "md5_digest": "0b3c5101da4f6becfd45af13f35f8387", "packagetype": "bdist_egg", "python_version": "2.7", "requires_python": null, "size": 10635, "upload_time": "2017-03-05T11:35:06", "upload_time_iso_8601": "2017-03-05T11:35:06.256254Z", "url": "https://files.pythonhosted.org/packages/9d/ac/ef2e340698aa84611f0b3bb5e2409643a4b5d4bc12d61db60bf3beae351b/FyeldGenerator-0.1.0-py2.7.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "eb4a0e70db9941faa48c752ebdd17a8c", "sha256": "55e7b66631f1d5918d7c62a8a992db2ccc39e4c32459b110f1f21ced3f6f3f5d"}, "downloads": -1, "filename": "FyeldGenerator-0.1.0-py2-none-any.whl", "has_sig": false, "md5_digest": "eb4a0e70db9941faa48c752ebdd17a8c", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 16864, "upload_time": "2017-03-05T11:35:01", "upload_time_iso_8601": "2017-03-05T11:35:01.699421Z", "url": "https://files.pythonhosted.org/packages/75/62/8f2440be2789eb848a14b0b22b75ecbab5aff2bba8918b9ab6277656aade/FyeldGenerator-0.1.0-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "44bd0cb8c8c7216c1d05a40b20cf66e8", "sha256": "7aacedadff51ca2a426c44fb53c47a3d33147ee19502f034847603999378c018"}, "downloads": -1, "filename": "FyeldGenerator-0.1.0-py3.6.egg", "has_sig": false, "md5_digest": "44bd0cb8c8c7216c1d05a40b20cf66e8", "packagetype": "bdist_egg", "python_version": "3.6", "requires_python": null, "size": 10340, "upload_time": "2017-03-05T11:35:07", "upload_time_iso_8601": "2017-03-05T11:35:07.989456Z", "url": "https://files.pythonhosted.org/packages/35/e3/dde97ee2a81f6647bdbeb9eec2e346df59a19e88577b2d822142578a712e/FyeldGenerator-0.1.0-py3.6.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "32a514bf88868adab7615c4ca0e0388d", "sha256": "5e99d9514c6a7ffaf5b9ace41885d84874ccefb960622066a04bd67c97656b42"}, "downloads": -1, "filename": "FyeldGenerator-0.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "32a514bf88868adab7615c4ca0e0388d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 16865, "upload_time": "2017-03-05T11:35:03", "upload_time_iso_8601": "2017-03-05T11:35:03.438665Z", "url": "https://files.pythonhosted.org/packages/d4/7c/cee3a7878763d162372dc1153286010f29994b03933933eee396e00e1c3a/FyeldGenerator-0.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a83964607a510a44dd97dd1cc5382c9a", "sha256": "be07cb565a320af19a26353b7e47efebf44b371fa8ce2c19ba8c79fd46ff016b"}, "downloads": -1, "filename": "FyeldGenerator-0.1.0.tar.gz", "has_sig": false, "md5_digest": "a83964607a510a44dd97dd1cc5382c9a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8863, "upload_time": "2017-03-05T11:10:19", "upload_time_iso_8601": "2017-03-05T11:10:19.151703Z", "url": "https://files.pythonhosted.org/packages/eb/0a/db41b082e6e02052cb8d7bd32e56d5fc99790b760f8b60f5bbade7463d80/FyeldGenerator-0.1.0.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "ab03198769cdfab435b323ef78f7947c", "sha256": "74a83f715bcae263567a618983bd043e5b9b045a4de03fab29f5c6aa5e8dec95"}, "downloads": -1, "filename": "FyeldGenerator-0.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "ab03198769cdfab435b323ef78f7947c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 17048, "upload_time": "2017-04-11T16:09:50", "upload_time_iso_8601": "2017-04-11T16:09:50.568643Z", "url": "https://files.pythonhosted.org/packages/80/9c/485a6363e05a3299dc9c5aff665bb1287213f6827ef63b15b82d7d7a309d/FyeldGenerator-0.1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0f13c40b78fbc8b1fd90ea4c53ad7696", "sha256": "61afc840d17178e63fa344d134fcd898ce64685e2b9dc6ae565149d5a799744e"}, "downloads": -1, "filename": "FyeldGenerator-0.1.1.tar.gz", "has_sig": false, "md5_digest": "0f13c40b78fbc8b1fd90ea4c53ad7696", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9776, "upload_time": "2017-04-11T16:11:13", "upload_time_iso_8601": "2017-04-11T16:11:13.900958Z", "url": "https://files.pythonhosted.org/packages/1a/e5/37dbb272d55c8e182c97720667a6d236c6b768d031331a1c1ee506298e94/FyeldGenerator-0.1.1.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "b87623e5cc8bfde2617384d774d14d0b", "sha256": "32c79906ca11d5a4653fdfee5407d8f4aaa2b04ecf72595341286c4936863891"}, "downloads": -1, "filename": "FyeldGenerator-0.1.2-py3-none-any.whl", "has_sig": false, "md5_digest": "b87623e5cc8bfde2617384d774d14d0b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 17097, "upload_time": "2017-04-11T16:24:13", "upload_time_iso_8601": "2017-04-11T16:24:13.857830Z", "url": "https://files.pythonhosted.org/packages/bc/3e/0b20116a9ca99991c55383689b4ace842668b7926c1aea59c73eb473d880/FyeldGenerator-0.1.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a6a20d40dd57d772d25e32d89bc2fdb8", "sha256": "52439c96d6e8cefc0cd423079685b6e1d54fd31caad45ab60f220d65d9c51979"}, "downloads": -1, "filename": "FyeldGenerator-0.1.2.tar.gz", "has_sig": false, "md5_digest": "a6a20d40dd57d772d25e32d89bc2fdb8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9815, "upload_time": "2017-04-11T16:24:14", "upload_time_iso_8601": "2017-04-11T16:24:14.887961Z", "url": "https://files.pythonhosted.org/packages/a3/c5/12aa22a0586eaa6a47528f820238938d1daf7e6f37dbd80ea0b92622244b/FyeldGenerator-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "940fa3702b0eb0c1bcdf900995c2c6a2", "sha256": "98d345bb02530c194f268eeee566fd47252b7604dac32c2907ba361e98d07c39"}, "downloads": -1, "filename": "FyeldGenerator-0.1.3-py2-none-any.whl", "has_sig": false, "md5_digest": "940fa3702b0eb0c1bcdf900995c2c6a2", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 17219, "upload_time": "2017-05-04T13:46:52", "upload_time_iso_8601": "2017-05-04T13:46:52.087391Z", "url": "https://files.pythonhosted.org/packages/58/d4/16edce018c4fbda0a1869ee63594424a944920df7b0c8d9b33e1dda71ed1/FyeldGenerator-0.1.3-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f9e0821e5566ce9943b96a20ebf9c5c2", "sha256": "82eb98b51fa0e797544da88fe540d6045aa920e1c5ec96833f317815fce429b7"}, "downloads": -1, "filename": "FyeldGenerator-0.1.3-py3-none-any.whl", "has_sig": false, "md5_digest": "f9e0821e5566ce9943b96a20ebf9c5c2", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 17218, "upload_time": "2017-05-04T13:46:38", "upload_time_iso_8601": "2017-05-04T13:46:38.829572Z", "url": "https://files.pythonhosted.org/packages/b5/64/8ced580a3720fe2e41bc5d9a5e5aec1b1d4bd7857e85b12d3cc7866575e7/FyeldGenerator-0.1.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "29bcd946d13964a4b4a18d119da4793b", "sha256": "aa7a625a83b458956134c236bbab6b437986555d0e3a72060ee1400424e4b811"}, "downloads": -1, "filename": "FyeldGenerator-0.1.3.tar.gz", "has_sig": false, "md5_digest": "29bcd946d13964a4b4a18d119da4793b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9936, "upload_time": "2017-05-04T13:46:41", "upload_time_iso_8601": "2017-05-04T13:46:41.916843Z", "url": "https://files.pythonhosted.org/packages/b4/1b/60fefff8314973ef6a62da4c06b98820e6b30f9247986101e62f0a883433/FyeldGenerator-0.1.3.tar.gz", "yanked": false}], "0.1.3b0": [{"comment_text": "", "digests": {"md5": "570c130bbc2f0fddeac2f72f31324be3", "sha256": "6f2aa74e0f90a701815b07dbddf4da24241f9d4d540a5d0ca275ece0a55c3d78"}, "downloads": -1, "filename": "FyeldGenerator-0.1.3b0-py2-none-any.whl", "has_sig": false, "md5_digest": "570c130bbc2f0fddeac2f72f31324be3", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 17107, "upload_time": "2017-05-04T14:31:17", "upload_time_iso_8601": "2017-05-04T14:31:17.090472Z", "url": "https://files.pythonhosted.org/packages/64/41/bb8ade54f1e52d5590b584ee473eb9e44380762ce05c99fb587a2e51a5de/FyeldGenerator-0.1.3b0-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "695ab26ae8deedb2257ff8be3e20abc7", "sha256": "5791161746a6b7209264e5acd4404b77061277942e6a2de5396fda25352b2a55"}, "downloads": -1, "filename": "FyeldGenerator-0.1.3b0-py3-none-any.whl", "has_sig": false, "md5_digest": "695ab26ae8deedb2257ff8be3e20abc7", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 17108, "upload_time": "2017-05-04T14:31:07", "upload_time_iso_8601": "2017-05-04T14:31:07.306172Z", "url": "https://files.pythonhosted.org/packages/ea/4d/849dcd14b8cd6d34dd979da127ba871ae91218370d7a124e6b752c020ac0/FyeldGenerator-0.1.3b0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "3ac1cf67af2a2c673488c25039575f25", "sha256": "74c3c6b61d29450d3c0fb4a52e73e65333905c480727b391eb7f5136f4444ff9"}, "downloads": -1, "filename": "FyeldGenerator-0.1.3b0.tar.gz", "has_sig": false, "md5_digest": "3ac1cf67af2a2c673488c25039575f25", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9801, "upload_time": "2017-05-04T14:31:08", "upload_time_iso_8601": "2017-05-04T14:31:08.892576Z", "url": "https://files.pythonhosted.org/packages/48/1c/8fdf88f2a0aa268872cbc2b5a37b663d9aef9d8e40d82db14b30af6e325c/FyeldGenerator-0.1.3b0.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "e67c6e73ff37571c02e3ec14329bf739", "sha256": "6811278d9780919ff73bf2c3693cc393d4150575e72e38c2694af5722e5ded1c"}, "downloads": -1, "filename": "FyeldGenerator-0.1.4-py2-none-any.whl", "has_sig": false, "md5_digest": "e67c6e73ff37571c02e3ec14329bf739", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 17078, "upload_time": "2017-05-04T14:33:08", "upload_time_iso_8601": "2017-05-04T14:33:08.384085Z", "url": "https://files.pythonhosted.org/packages/b2/00/6f8020a74270198d24cc553febc473235755628fbd913553d48c08eac503/FyeldGenerator-0.1.4-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a7d33e1a00ece45da4ccbbd5d0140d89", "sha256": "e9d4dea2b573787a878fef85e23941bd80c5cbaf6545b2fd21cafc2ea8fcd5de"}, "downloads": -1, "filename": "FyeldGenerator-0.1.4-py3-none-any.whl", "has_sig": false, "md5_digest": "a7d33e1a00ece45da4ccbbd5d0140d89", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 17078, "upload_time": "2017-05-04T14:32:49", "upload_time_iso_8601": "2017-05-04T14:32:49.650933Z", "url": "https://files.pythonhosted.org/packages/75/70/805b3f09b9437af7a4d0d8bcde92f7107a93b57161fb960fbae1cda9657f/FyeldGenerator-0.1.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b373dfcebf6714c4ff7653fbb59bdfbe", "sha256": "842dd164bc1df79dfe0171e04f4f9e69f81f0df210863df091076c01d08b377d"}, "downloads": -1, "filename": "FyeldGenerator-0.1.4.tar.gz", "has_sig": false, "md5_digest": "b373dfcebf6714c4ff7653fbb59bdfbe", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9800, "upload_time": "2017-05-04T14:32:51", "upload_time_iso_8601": "2017-05-04T14:32:51.962945Z", "url": "https://files.pythonhosted.org/packages/0a/98/004126376049bd2ad7c00af62ec6b437ed5c71b86ac3f4ef1b6e5afdbad1/FyeldGenerator-0.1.4.tar.gz", "yanked": false}], "0.1.4rc2": [{"comment_text": "", "digests": {"md5": "34af84165724efa39f6780875c9f83e8", "sha256": "57df64135c0d9fbfc44e46179280bfa08029f27eea16cc440defaeb7164821c3"}, "downloads": -1, "filename": "FyeldGenerator-0.1.4rc2-py3-none-any.whl", "has_sig": false, "md5_digest": "34af84165724efa39f6780875c9f83e8", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 17123, "upload_time": "2017-05-04T14:35:41", "upload_time_iso_8601": "2017-05-04T14:35:41.561224Z", "url": "https://files.pythonhosted.org/packages/4e/df/6b18bbb5fa3373b91470177db78c79fd2616b71a9af8b28c4e2d46d85127/FyeldGenerator-0.1.4rc2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "829c2c4e92327d44f71e9569aa08f050", "sha256": "3862bf4f034db67417f290b2d9d50f77ebae4b2229580f844aa977666227a3d5"}, "downloads": -1, "filename": "FyeldGenerator-0.1.4rc2.tar.gz", "has_sig": false, "md5_digest": "829c2c4e92327d44f71e9569aa08f050", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9802, "upload_time": "2017-05-04T14:35:44", "upload_time_iso_8601": "2017-05-04T14:35:44.535144Z", "url": "https://files.pythonhosted.org/packages/53/19/bfce65cae9ffb36d3c5a43823bed2c49ec5c46e9583cdf4debad3e9f4bf8/FyeldGenerator-0.1.4rc2.tar.gz", "yanked": false}], "0.1.5": [{"comment_text": "", "digests": {"md5": "6423bd78dff37f1c4a43707d79a313be", "sha256": "81715973a67279f6c34ed0435323713757fdd824ed595343251f317f20715f2b"}, "downloads": -1, "filename": "FyeldGenerator-0.1.5-py3-none-any.whl", "has_sig": false, "md5_digest": "6423bd78dff37f1c4a43707d79a313be", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 17078, "upload_time": "2017-05-04T14:38:48", "upload_time_iso_8601": "2017-05-04T14:38:48.504988Z", "url": "https://files.pythonhosted.org/packages/17/bc/170a69fdf897e346351253ee9ad86540308956d34158b64ff455b98f6b1b/FyeldGenerator-0.1.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "de89a3f8a2adb1cd4ccf4283ba696251", "sha256": "74b0abb2bb092d85530d770ac0d214d0857c7ae88339352baafdc5558c3a35bd"}, "downloads": -1, "filename": "FyeldGenerator-0.1.5.tar.gz", "has_sig": false, "md5_digest": "de89a3f8a2adb1cd4ccf4283ba696251", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9793, "upload_time": "2017-05-04T14:38:51", "upload_time_iso_8601": "2017-05-04T14:38:51.026528Z", "url": "https://files.pythonhosted.org/packages/b9/41/f9f234432ae0cd86154b8ea80183c9578fe65964f670f8bfa3726f95c2aa/FyeldGenerator-0.1.5.tar.gz", "yanked": false}], "0.1.6": [{"comment_text": "", "digests": {"md5": "b1898556e06618f8080317f5ebd6f11b", "sha256": "ef6074e46328a5455b3fa61717764c1663386321b088d31b5e0e35d3f9b3247d"}, "downloads": -1, "filename": "FyeldGenerator-0.1.6-py3-none-any.whl", "has_sig": false, "md5_digest": "b1898556e06618f8080317f5ebd6f11b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 17397, "upload_time": "2018-01-09T10:25:23", "upload_time_iso_8601": "2018-01-09T10:25:23.010637Z", "url": "https://files.pythonhosted.org/packages/63/a1/5f4b0cbb91396a9ff63e1a1b5a30fe4250787b69bf7812862c4ee28a4a40/FyeldGenerator-0.1.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "224d621a8d4d28ae596f90a4b509052b", "sha256": "8e8bb895e3e5680f706a10ca499f46b2465bcde465ed16b119c1e875d2f6fa5c"}, "downloads": -1, "filename": "FyeldGenerator-0.1.6.tar.gz", "has_sig": false, "md5_digest": "224d621a8d4d28ae596f90a4b509052b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10095, "upload_time": "2018-01-09T10:25:26", "upload_time_iso_8601": "2018-01-09T10:25:26.079417Z", "url": "https://files.pythonhosted.org/packages/21/3f/f54a006dcf628c732998dce527b786b3483097692105ce0e62f79c931140/FyeldGenerator-0.1.6.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "b1898556e06618f8080317f5ebd6f11b", "sha256": "ef6074e46328a5455b3fa61717764c1663386321b088d31b5e0e35d3f9b3247d"}, "downloads": -1, "filename": "FyeldGenerator-0.1.6-py3-none-any.whl", "has_sig": false, "md5_digest": "b1898556e06618f8080317f5ebd6f11b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 17397, "upload_time": "2018-01-09T10:25:23", "upload_time_iso_8601": "2018-01-09T10:25:23.010637Z", "url": "https://files.pythonhosted.org/packages/63/a1/5f4b0cbb91396a9ff63e1a1b5a30fe4250787b69bf7812862c4ee28a4a40/FyeldGenerator-0.1.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "224d621a8d4d28ae596f90a4b509052b", "sha256": "8e8bb895e3e5680f706a10ca499f46b2465bcde465ed16b119c1e875d2f6fa5c"}, "downloads": -1, "filename": "FyeldGenerator-0.1.6.tar.gz", "has_sig": false, "md5_digest": "224d621a8d4d28ae596f90a4b509052b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10095, "upload_time": "2018-01-09T10:25:26", "upload_time_iso_8601": "2018-01-09T10:25:26.079417Z", "url": "https://files.pythonhosted.org/packages/21/3f/f54a006dcf628c732998dce527b786b3483097692105ce0e62f79c931140/FyeldGenerator-0.1.6.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:59:28 2020"}