{"info": {"author": "Al Sweigart", "author_email": "al@inventwithpython.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Programming Language :: Python", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3.8"], "description": "# PythonStdioGames\n\nA collection of Python 3 source code for simple, text-based games & simulations to use as example programs.\n\nINSTALL: `pip install --user gamesbyexample`\n\n(Use `pip3` on macOS and Linux.)\n\nRUN LAUNCHER: `python -m gamesbyexample`\n\nI'm not accepting pull requests currently, but feel free to leave comments or send suggestions to al@inventwithpython.com\n\nAbout this Collection\n=====================\n\nAfter beginners learn the syntax of Python and basic programming concepts (loops, branching, functions, etc.) they often hit a dead-end: \"How do I become better at programming?\" At this point, people will tell them to work on their own practice projects (which leaves them without guidance on what to make and how to make it) or to contribute to open source projects (which can be difficult to find, understand its code base, and get guidance on how to contribute).\n\nWhat helped me learn to code was finding small projects whose source code I copied and then made small adjustments to. This gave me insight on how loops, branching, and functions combined together into actual programs.\n\nTo help others down the same path, I'm creating a collection of example programs aimed at being easy to copy and understand by beginners. These programs (mostly games) have the following constraints:\n\n* They're short, with a limit of 256 lines of code. *This makes them easy to read and understand in one sitting. The shorter the better. The \"256\" number was arbitrarily selected, but this also means programs will fit on 4 or 5 printed pages.*\n* They fit into a single source code file and have no installer. *This makes these games trivial to share by copy/pasting code to a pastebin site. Data/image/save files can be used, but the source should link to some examples in their comments.*\n* They only use the Python standard library. *Fewer things to install means wider compatibility and less chance of failing during environment setup.*\n* They only use stdio text; `print()` and `input()` in Python. *The output being in the same text medium as the text source code makes it less abstract, and easier to see the cause-effect relationship between code and output. This means there's no graphics or mouse input, but makes it simple to port these programs to other languages since they all support stdio text.*\n* They're necessarily turn-based. *Relying on `input()` means the program must wait for the user to enter text, but this means we can't have real-time programs that respond to single key-presses.*\n* They're well commented. *Comments should be aimed at beginners and will be more verbose. The 256-line limit includes comments and whitespace. If the program is too long to include abundant comments and sensible whitespace, the program should be simplified, not the comments.*\n* They use as few programming concepts as possible. *If classes, list comprehensions, recursion, aren't necessary for the program, then they are't used.*\n* **Elegant** and **efficient** code is worthless next to code that is **easy to understand** and **readable**. *These programs are for education, not production. Standard best practices, like not using global variables, can be ignored to make it easier to understand.*\n* They do input validation and are bug free. *It should be impossible to crash a program with bad input or an edge case.*\n* All functions have docstrings. *This is good documentation practice, but also enables the `help()` function to work in the interactive shell.*\n\n\nAdditional Guidelines\n=====================\n\nAdditional guidelines include:\n\n* Don't use f-strings. Raspberry Pis as of 2019 have Python 3.5 installed, and f-strings only came about in 3.6. One guideline for these programs is to be as widely compatible as possible.\n* Some of these programs use the `bext` module, which adds curses-like features like color, clearing the screen, and moving the cursor\n* Include a link to a run-through of the program on https://pythontutor.com so that the student can see how the program runs.\n* Longer, more descriptive variable names are better than shorter ones. Avoid using single-letter variable names except for `i` and `j`, or `x` and `y`.\n* Have comments marked as `# EXPERIMENT!` that describe minor changes that they can make (increasing health, changing difficulty, etc.)\n* Use jsdifflib to create online diffs. *This is an easy way for students to find their own typos when copying the code. An example is here: https://inventwithpython.com/invent4thed/diff/*\n* Use `assert` statements to catch common typos the student makes when typing in the code, especially for constants that they may modify.\n* Use Python 3. *The only time Python 2 is appropriate to use is when there's a large existing codebase. But this is for new programmers working on greenfield projects.*\n* Stick to characters in WGL4 character repertoire, which is basically CP 1252, code pages for Cyrillic/Greek/Turkish/Baltic characters, and the MS-DOS era CP437 \"extended ASCII\" encoding. *Windows' command line is the limiting factor here; it can't display all UTF-8 characters.*\n* The source code must be typeable. *Don't put box-drawing or extended ascii characters directly into the source code, but rather make chr() calls instead to acquire these characters.*\n* Time can be a factor, even if the programs aren't real-time. *You can check for time or add pauses in between calls to `input()`, but note that you'll never be able to interrupt when the user is typing.*\n* The `pyperclip` module can be used to interact with the clipboard. *Large amounts of text can be input-ed into or output-ed from the program using the clipboard.*\n* I use %s string interpolation instead of f-strings. *I love f-strings, but they were only introduced in Python 3.6 and I don't want to limit the versions that these programs are compatible with.*\n* For all dictionaries, I have a short comment explaining what types the keys and values are. *For example, # Keys=places, values=strings of the suspect & item there.*\n* Use the \"DOS box-drawing\" characters to draw complicated board games. *Though sticking to +, -, and | for lines is good too since it's simpler.*\n* Player vs player games can often be simpler and shorter than player vs computer games. *This necessarily means that multiplayer games must be \"perfect information\" games since both players can view the screen.*\n* Don't modify mutable objects (e.g. lists) in functions to pass information into/out of the function; only use parameters and return values. *This can make your program seem magical to someone not familiar with the Python Data Model.*\n* Avoid insulting the player when they lose. *This is something I learned from instructing programming classes for kids. They respond poorly to messages like, \"Game Over, Dummy!\" even if they seem innocuous to adults.*\n\nAfter making several of these programs, I've notice various \"categories\" of program complexity. Programs can be of zero or more of these categories:\n\n* Absolute beginner level. *No functions, no nested data structures, avoid nested loops. Just uses simple branching and loops.*\n* Choose-your-own-adventure level. *Programs don't model things with data structures, but rather mostly use flow control.*\n* STDIO-only. *You can't undo things that have been previously printed (aside from \"printing\" backspace characters to erase characters on the current line). The output is like an append-only log file.*\n* Curses-like. *Requires the `bext` module, but can clear/refresh the screen, draw at arbitrary places on the screen in color, etc.*\n* Modify source code to run. *Instead of getting input from `input()`, the user edits variables at the top of the file to change the settings in the program.*\n\n\nAdditional modules I recommend using:\n\n* `bext` for colorful text and controlling the positioning of the text cursor.\n* `blessings` for a better version of curses.\n* `pyperclip` for copying/psating text with the clipboard.\n* `playsound` for playing sound files.\n* `pyttsx3` for text to speech.\n* `pytextcavas` for 2D strings you can draw on\n* `pyrect` for rectangle data structure\n* `pybresenham` for various line-drawing functions\n\n\nCompleted Programs in This Collection\n=====================================\n\n*Alphabetize Quiz* - A time-based quiz game to see how fast you can alphabetize letters.\n\n*Alphabetize Word Quiz* - A time-based quiz game to see how fast you can alphabetize words.\n\n*Analog Clock* - An analog clock animation. Press Ctrl-C to stop.\n\n*Bagels* - A deductive logic game where you must guess a number based on clues.\n\n*Birthday Paradox Simulation* - Explore the mathematics of the \"Birthday Paradox\". More info at https://en.wikipedia.org/wiki/Birthday_problem\n\n*Blackjack* - A card game also known as 21. More info at: https://en.wikipedia.org/wiki/Blackjack\n\n*Bouncing Ball* - A bouncing ball animation. Press Ctrl-C to stop.\n\n*Bouncing Lines* - A bouncing line animation. Press Ctrl-C to stop.\n\n*Calendar Maker* - Create monthly calendars, saved to a text file and fit for printing.\n\n*Chance Checkers* - Checkers, but you can move 3 random checkers per turn. These checkers are randomly decided, and can be the player's own checkers or their opponents', but you can't move your opponents' promoted checkers. In this version, capturing is not mandatory.\n\n*Daleks* - Try to get the robots to crash into each other.\n\n*Checkers* - The classic checkers board game. In this version, capturing is not mandatory.\n\n*Chomp* - A dangerously delicious logic game. Inspired by a Frederik Schuh and David Gale puzzle, published by Martin Gardner in Scientific American (January 1973) More info at: https://en.wikipedia.org/wiki/Chomp\n\n*Clickbait Headline Generator* - A clickbait headline generator for your soulless content farm.\n\n*Coin Flip Simulator* - Simulate a large number of coin flips.\n\n*Collatz Sequence* - Generates numbers for the Collatz sequence, given a starting number.\n\n*Collatz Sequence Stats* - Finds out how long various Collatz Sequences are.\n\n*Connect Four* - A board game to get four tiles in a row.\n\n*Conway's Game of Life* - The classic cellular automata simulation. Press Ctrl-C to stop. More info at: https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life\n\n*Conway's Game of Life (Terminal)* - The classic cellular automata simulation. Press Ctrl-C to stop. More info at: https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life\n\n*Countdown* - Show a countdown timer animation using a seven-segment display. Press Ctrl-C to stop. More info at https://en.wikipedia.org/wiki/Seven-segment_display Requires our sevseg.py program.\n\n*Diagonal Maze* - Prints out a random, diagonal maze. Inspired by the 10 PRINT CHR$(205.5+RND(1)); : GOTO 10 program.\n\n*Dice Roller* - Simulates dice rolls using the Dungeons & Dragons notation.\n\n*Digital Clock* - Display a digital clock of the current time with a seven-segment display. Press Ctrl-C to stop. More info at https://en.wikipedia.org/wiki/Seven-segment_display Requires our sevseg.py program.\n\n*DNA* - A simple animation of a DNA double-helix. Press Ctrl-C to stop. Thanks to matoken for inspiration: https://asciinema.org/a/155441\n\n*Eeny-Meeny-Miny-Moe* - An elimination game for multiple players. Press Ctrl-C to stop. More info at https://en.wikipedia.org/wiki/Eeny,_meeny,_miny,_moe More info at https://en.wikipedia.org/wiki/Josephus_problem\n\n*Etch a Sketch* - Draw a trailing line on the screen.\n\n*Factorization* - Find all the factors of a number.\n\n*Fireflies* - A beautiful animation of fireflies. Press Ctrl-C to stop.\n\n*Fish Tank* - A peaceful animation of a fish tank. Press Ctrl-C to stop.\n\n*FizzBuzz Calculation* - Calculates the answers for the fizz buzz programming problem.\n\n*FizzBuzz Game* - A number game where you also race against the clock.\n\n*Flippy (a Reversi clone)* - (Requires Pygame) Play against the computer and try to flip their tiles.\n\n*Flood Fill* - An example of a \"flood fill\" algorithm. This is a basic demo of both the recursive and iterative floodfill algorithms. This algorithm is commonly used in \"fill tools\" in graphics programs like MS Paint or Photoshop. This algorithm is also used in the floodit.py game.\n\n*Flood It!* - A colorful game where you try to fill the board with a single color.\n\n*Forest Fire Sim* - A simulation of fires spreading in a growing forest. Press Ctrl-C to stop. Inspired by Nicky Case's Emoji Sim http://ncase.me/simulating/model/\n\n*Four-In-A-Row* - (Requires Pygame) Play against the computer, dropping tiles to connect four.\n\n*Nonuniform Fractal Tree Drawer* - Draws nonuniform fractal trees with turtle graphics.\n\n*Fractal Tree Drawer* - Draws fractal trees with turtle graphics.\n\n*2048 Game* - A sliding tile game to combine exponentially-increasing numbers. Inspired by Gabriele Cirulli's 2048, which is a clone of Veewo Studios' 1024, which in turn is a clone of the Threes! game. More info at https://en.wikipedia.org/wiki/2048_(video_game)\n\n*Gemgem (a Bejeweled clone)* - (Requires Pygame) An addictive jewel matching game.\n\n*Ghost Leg Lottery* - Follow the trail to see who wins! More info at: https://en.wikipedia.org/wiki/Ghost_Leg\n\n*Guess the Number* - While given hints, try to guess the secret number.\n\n*Guillotine* - A French variant of Hangman with different graphics. Ooh la la!\n\n*Hacking* - The hacking mini-game from \"Fallout 3\".\n\n*Hammurabi* - The classic game Hamurabi.bas by Doug Dyment, popularized by David Ahl.\n\n*Hamsburger* - A program for making silly pluralizations. Press Ctrl-C to stop.\n\n*Hangman* - A word-guessing game.\n\n*Hangman with Random Letters* - A completely unfair word-guessing game. (This is a joke program.)\n\n*Hard-coded Tic Tac Toe* - Play tic tac toe against the computer. Every possible move has been hard-coded into this program. The program is 5700 lines long. This is a joke program, don't actually write code like this.\n\n*Hilbert Curve* - Draws the Hilbert Curve fractal with turtle graphics. More info at: https://en.wikipedia.org/wiki/hilbertCurve Good videos on space-filling curves: https://youtu.be/RU0wScIj36o and https://youtu.be/3s7h2MHQtxc\n\n*Hour Glass Animation* - An animation of an hour glass filled with falling sand. Press Ctrl-C to stop.\n\n*Idiot* - How to keep an idiot busy for hours. (This is a joke program.)\n\n*Ink Spill (a Flood It clone)* - (Requires Pygame) Try to make the entire field a single color.\n\n*J'ACCUSE!* - A mystery game of intrigue and a missing cat. Inspired by Homestar Runner's \"Where's an Egg?\" game\n\n*Koch Snowflake* - Draws a Koch snowflake fractal with turtle graphics.\n\n*Langton's Ant* - A cellular automata animation. Press Ctrl-C to stop. More info: https://en.wikipedia.org/wiki/Langton%27s_ant\n\n*Lawnmower* - Watch grass get cut and grow again. Press Ctrl-C to stop. Inspired by Tondeuse by Jules Villard, https://asciinema.org/a/21743 https://bitbucket.org/jvillard/tondeuse/src/default/\n\n*Leetspeak* - Translates English messages into l33t5p34]<.\n\n*Luhn Checksum Algorithm* - The mathematics behind credit card numbers. More info at: https://en.wikipedia.org/wiki/Luhn_algorithm More info at: https://youtu.be/Erp8IAUouus\n\n*Magic Eight Ball* - Ask a question about your future.\n\n*Magic Hexagon* - Place numbers in a hexagon so each row adds up to 38. More info at https://en.wikipedia.org/wiki/Magic_hexagon More info at https://www.youtube.com/watch?v=ZkVSRwFWjy0\n\n*Mancala* - The ancient seed-sowing board game. Rules at http://www.mancalarules.com/ More info at https://en.wikipedia.org/wiki/Mancala\n\n*Matching Parentheses* - A parentheses/bracket/braces matching algorithm.\n\n*Maze Maker* - Make mazes with the recursive backtracker algorithm. More info at: https://en.wikipedia.org/wiki/Maze_generation_algorithm#Recursive_backtracker An animated demo: https://scratch.mit.edu/projects/17358777/\n\n*Maze Runner* - Move around a maze and try to escape.\n\n*Maze 3D* - Move around a maze and try to escape... in 3D!\n\n*Maze Runner HTML* - Move around a maze and try to escape... in 3D and IN YOUR WEB BROWSER!\n\n*Memory Puzzle* - (Requires Pygame) A simple memory matching game.\n\n*Middle Letter Scrambler* - Scrambles the middle letters of words, but not the first and last letters.\n\n*Million Dice Roll Stats* - A simulation of one million dice rolls.\n\n*Mona Lisa* - Draws an Andy Warhol-like drawing of the Mona Lisa with turtle graphics.\n\n*Mondrian Art Generator* - Randomly generates Mondrian-style art.\n\n*Monty Hall Problem* - A simulation of the Monty Hall game show problem. More info at https://en.wikipedia.org/wiki/Monty_Hall_problem\n\n*Morse Code* - Translates between English and Morse Code. More info at: https://en.wikipedia.org/wiki/Morse_code\n\n*Multiplication Table* - Print a multiplication table.\n\n*Multiplicative Persistence* - A fun math challenge. For more information about this topic, see https://youtu.be/Wim9WJeDTHQ\n\n*99 Bottles of Beer on the Wall* - Print the full lyrics to one of the most longest songs ever! Press Ctrl-C to stop.\n\n*Peg Solitaire* - A single-player, peg-jumping game to eliminate all the pegs. More info at https://en.wikipedia.org/wiki/Peg_solitaire\n\n*Pentomino* - (Requires Pygame) Like Pygame, except with 5-box blocks.\n\n*Periodic Table of Elements* - Displays atomic information for all the elements.\n\n*Pig Latin* - Translates English messages into Igpay Atinlay.\n\n*Polygons* - A turtle program to draw polygons. Every line is the same length.\n\n*Progress Bar* - A sample progress bar animation that can be used in other programs.\n\n*Pythons* - Drawing pythons with turtle graphics.\n\n*Rail Fence Cipher* - The \"rail fence\" cipher for encrypting text. More info at: https://en.wikipedia.org/wiki/Rail_fence_cipher\n\n*Rainbow* - Shows a simple rainbow animation. Press Ctrl-C to stop.\n\n*Rainbow 2* - Shows a simple squiggle rainbow animation. Press Ctrl-C to stop.\n\n*Random Walk* - Generate splatter-art with the \"random walk\" algorithm. Press Ctrl-C to stop. More info at: https://en.wikipedia.org/wiki/Random_walk\n\n*Reversi* - A tile flipping game, also called reversi. More info https://en.wikipedia.org/wiki/Reversi\n\n*Rock-Paper-Scissors* - A hand game of luck.\n\n*Rock-Paper-Scissors (Always Win)* - A hand game of luck, except you cannot lose.\n\n*ROT13 Cipher* - The simplest cipher for encrypting and decrypting text. More info at https://en.wikipedia.org/wiki/ROT13\n\n*Rotating Cube* - A rotating cube animation. Press Ctrl-C to stop.\n\n*Rotating Cube (Bext Version)* - A rotating cube animation. Press Ctrl-C to stop.\n\n*Rotating Sphere* - A rotating sphere animation. Press Ctrl-C to stop.\n\n*Rush Hour* - A sliding tile puzzle game to move cars out of the way. Original game by Nob Yoshihagara More info at https://www.michaelfogleman.com/rush/\n\n*Sand Fall* - A falling sand animation. Inspired by https://asciinema.org/a/6515\n\n*Sand Fall (Bext Version)* - A falling sand animation. Inspired by https://asciinema.org/a/6515\n\n*Sevseg* - A seven-segment display module. More info at https://en.wikipedia.org/wiki/Seven-segment_display\n\n*Shell Game* - A random gambling game.\n\n*Sierpinkski's Game* - Sierpinkski's \"game\" is an algorithm that draws Sierpinski's Triangle with turtle graphics. More info at https://en.wikipedia.org/wiki/Chaos_game\n\n*Sierpinski Square* - Draws the Sierpinski Square (also called Carpet) with turtle graphics. More info at: https://en.wikipedia.org/wiki/Sierpinski_carpet\n\n*Sierpinski Triangle* - Draws the Sierpinski Triangle fractal with turtle graphics.\n\n*Simulate (a Simon clone)* - (Requires Pygame) Copy the pattern of flashing lights for as long as possible.\n\n*Slide Puzzle* - (Requires Pygame) The classic 15-tile slide puzzle.\n\n*15-Sliding Puzzle* - Slide the numbered tiles into the correct order.\n\n*Snail Race* - Fast-paced snail racing action!\n\n*Sokoban clone* - The classic crate-pushing game.\n\n*Sonar Treasure Hunt* - Try to locate treasure chests hidden under the waves.\n\n*Soroban* - A simulation of a Japanese abacus calculator tool. More info at: https://en.wikipedia.org/wiki/Soroban\n\n*Spiral* - Draws a simple square spiral.\n\n*sPoNgEtExT* - Translates English messages into sPOnGEtExT.\n\n*Squirrel Eat Squirrel* - (Requires Pygame) A game where squirrels eat each other and grow monstrously large.\n\n*Star Pusher (a Sokoban clone)* - (Requires Pygame) A puzzle game where you push the stars over their goals.\n\n*Sticky Hands* - A jewel-stealing, movement puzzle game.\n\n*Sudoku* - The classic 9x9 number placement puzzle. More info at https://en.wikipedia.org/wiki/Sudoku\n\n*Tetromino (a Tetris clone)* - (Requires Pygame) The classic block falling puzzle from the Soviet Union.\n\n*Tetromino for Idiots* - (Requires Pygame) Tetris, but... simpler.\n\n*Three-Card Monte* - Find the Queen of Hearts after cards have been swapped around. (In the real-life version, the scammer palms the Queen of Hearts so you always lose.) More info at https://en.wikipedia.org/wiki/Three-card_Monte\n\n*Tic Tac Toe* - The classic board game.\n\n*Tic Tac Toe (OOP)* - The classic board game. (Object-oriented programming version.)\n\n*Towers of Hanoi puzzle* - A puzzle where you must move the discs of one tower to another tower. More info at https://en.wikipedia.org/wiki/Tower_of_Hanoi\n\n*Ulam Spiral* - The Ulam spiral is a mysterious mathematics pattern for prime numbers with turtle graphics. More info at https://en.wikipedia.org/wiki/Ulam_spiral\n\n*Water Bucket Puzzle* - A water pouring puzzle. More info: https://en.wikipedia.org/wiki/Water_pouring_puzzle\n\n*Wormy* - (Requires Pygame) Lead the green snake around the screen eating red apples.\n\n*Zigzag* - A simple zig zag animation. Press Ctrl-C to stop.\n\n\nTODO NOTES\n==========\n\n(The rest of these are placeholder ideas and not officially a part of this README)\n\nTODO - explain why I don't use cls/clear if it isn't necessary (it's to make programs compatible with non terminal environemnts, like idle or vscode or pycharm)\n\nGames should:\n\n* Have unit tests, which show how you can call the individual functions and see what they do with their input.\n* Should I include type hints? (Decision: nah. They're often not needed and I feel like their occassional presence would be more distracting than illuminating.)\n* Maybe include a barebones version of games, with stub functions that specify what their input/output, and hint at what other functions in the program they'll call? And the data structures used?\n* I should focus on games that don't require data structures (this removes most board games).\n* Games should have logging messages that can be enabled?\n\n\nTODO polishing process\n* Create unit tests for each game.\n* Test inputs. It should be impossible to crash a game with user input.\n* Add comments liberally.\n* Add assert statements. These should never arise during the game. (Test!)\n* Create the \"skeletons\" of each game, which has just the function stubs and docstring, plus list of functions that this function calls. Unit tests can help them with filling out their skeletons.\n* Write up a description for each game, which includes a sample play session text.\n* Description should have a link to pythontutor.com.\n* Describe data structures used, including examples.\n\n\nGame Ideas:\n- Nonograms https://en.wikipedia.org/wiki/Nonogram\n\nClass protocol:\n* Copy the source code by typing it.\n* Run the program and test it.\n* Run it under a debugger, answer questions about variable values.\n* Make the changes suggested for this project.\n* Try to remake the game without looking at the source, read the list of objectives.\n\n\nTODO entry outline (what a single program looks like on its page or book)\n- Name\n- Brief description and credits (This plus name and link should be able to fit into a tweet.)\n- Three screenshots. (To include in the tweet)\n- Longer description.\n- Sample play text.\n- Data structure examples.\n- Pythontutor link\n- SKIP THIS: Skeleton source code\n- SKIP THIS: Unit tests (not utterly comprehensive or 100 % code coverage, but enough to convey the idea of the game's functions)\n- Full source code (and github link)\n- List of questions that probe if the reader knows how the code works.\n- List of experiments to try out.\n\nNote: Remind readers that they can hit Ctrl-C to quit a program. Also remind them to run the programs under a debugger.\n\nNote: I think we should avoid the \"stub/skeleton\" code format. The reader is put into a position of trying to read the original programmer's mind, instead of just creating a game they want to play. So this means we don't need extensive docstrings, unit tests, or assertions at the top of each function.\n\nTODO tweet format:\nPython programming tutorial for text-based games: <NAME> <DESC> <LINK>\n\nCopyright 2019, Al Sweigart. All rights reserved.", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/asweigart/pythonstdiogames", "keywords": "games", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "gamesbyexample", "package_url": "https://pypi.org/project/gamesbyexample/", "platform": "", "project_url": "https://pypi.org/project/gamesbyexample/", "project_urls": {"Homepage": "https://github.com/asweigart/pythonstdiogames"}, "release_url": "https://pypi.org/project/gamesbyexample/0.1.5/", "requires_dist": null, "requires_python": "", "summary": "A collection of games (with source code) to use for example programming lessons.", "version": "0.1.5", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>PythonStdioGames</h1>\n<p>A collection of Python 3 source code for simple, text-based games &amp; simulations to use as example programs.</p>\n<p>INSTALL: <code>pip install --user gamesbyexample</code></p>\n<p>(Use <code>pip3</code> on macOS and Linux.)</p>\n<p>RUN LAUNCHER: <code>python -m gamesbyexample</code></p>\n<p>I'm not accepting pull requests currently, but feel free to leave comments or send suggestions to <a href=\"mailto:al@inventwithpython.com\">al@inventwithpython.com</a></p>\n<h1>About this Collection</h1>\n<p>After beginners learn the syntax of Python and basic programming concepts (loops, branching, functions, etc.) they often hit a dead-end: \"How do I become better at programming?\" At this point, people will tell them to work on their own practice projects (which leaves them without guidance on what to make and how to make it) or to contribute to open source projects (which can be difficult to find, understand its code base, and get guidance on how to contribute).</p>\n<p>What helped me learn to code was finding small projects whose source code I copied and then made small adjustments to. This gave me insight on how loops, branching, and functions combined together into actual programs.</p>\n<p>To help others down the same path, I'm creating a collection of example programs aimed at being easy to copy and understand by beginners. These programs (mostly games) have the following constraints:</p>\n<ul>\n<li>They're short, with a limit of 256 lines of code. <em>This makes them easy to read and understand in one sitting. The shorter the better. The \"256\" number was arbitrarily selected, but this also means programs will fit on 4 or 5 printed pages.</em></li>\n<li>They fit into a single source code file and have no installer. <em>This makes these games trivial to share by copy/pasting code to a pastebin site. Data/image/save files can be used, but the source should link to some examples in their comments.</em></li>\n<li>They only use the Python standard library. <em>Fewer things to install means wider compatibility and less chance of failing during environment setup.</em></li>\n<li>They only use stdio text; <code>print()</code> and <code>input()</code> in Python. <em>The output being in the same text medium as the text source code makes it less abstract, and easier to see the cause-effect relationship between code and output. This means there's no graphics or mouse input, but makes it simple to port these programs to other languages since they all support stdio text.</em></li>\n<li>They're necessarily turn-based. <em>Relying on <code>input()</code> means the program must wait for the user to enter text, but this means we can't have real-time programs that respond to single key-presses.</em></li>\n<li>They're well commented. <em>Comments should be aimed at beginners and will be more verbose. The 256-line limit includes comments and whitespace. If the program is too long to include abundant comments and sensible whitespace, the program should be simplified, not the comments.</em></li>\n<li>They use as few programming concepts as possible. <em>If classes, list comprehensions, recursion, aren't necessary for the program, then they are't used.</em></li>\n<li><strong>Elegant</strong> and <strong>efficient</strong> code is worthless next to code that is <strong>easy to understand</strong> and <strong>readable</strong>. <em>These programs are for education, not production. Standard best practices, like not using global variables, can be ignored to make it easier to understand.</em></li>\n<li>They do input validation and are bug free. <em>It should be impossible to crash a program with bad input or an edge case.</em></li>\n<li>All functions have docstrings. <em>This is good documentation practice, but also enables the <code>help()</code> function to work in the interactive shell.</em></li>\n</ul>\n<h1>Additional Guidelines</h1>\n<p>Additional guidelines include:</p>\n<ul>\n<li>Don't use f-strings. Raspberry Pis as of 2019 have Python 3.5 installed, and f-strings only came about in 3.6. One guideline for these programs is to be as widely compatible as possible.</li>\n<li>Some of these programs use the <code>bext</code> module, which adds curses-like features like color, clearing the screen, and moving the cursor</li>\n<li>Include a link to a run-through of the program on <a href=\"https://pythontutor.com\" rel=\"nofollow\">https://pythontutor.com</a> so that the student can see how the program runs.</li>\n<li>Longer, more descriptive variable names are better than shorter ones. Avoid using single-letter variable names except for <code>i</code> and <code>j</code>, or <code>x</code> and <code>y</code>.</li>\n<li>Have comments marked as <code># EXPERIMENT!</code> that describe minor changes that they can make (increasing health, changing difficulty, etc.)</li>\n<li>Use jsdifflib to create online diffs. <em>This is an easy way for students to find their own typos when copying the code. An example is here: <a href=\"https://inventwithpython.com/invent4thed/diff/\" rel=\"nofollow\">https://inventwithpython.com/invent4thed/diff/</a></em></li>\n<li>Use <code>assert</code> statements to catch common typos the student makes when typing in the code, especially for constants that they may modify.</li>\n<li>Use Python 3. <em>The only time Python 2 is appropriate to use is when there's a large existing codebase. But this is for new programmers working on greenfield projects.</em></li>\n<li>Stick to characters in WGL4 character repertoire, which is basically CP 1252, code pages for Cyrillic/Greek/Turkish/Baltic characters, and the MS-DOS era CP437 \"extended ASCII\" encoding. <em>Windows' command line is the limiting factor here; it can't display all UTF-8 characters.</em></li>\n<li>The source code must be typeable. <em>Don't put box-drawing or extended ascii characters directly into the source code, but rather make chr() calls instead to acquire these characters.</em></li>\n<li>Time can be a factor, even if the programs aren't real-time. <em>You can check for time or add pauses in between calls to <code>input()</code>, but note that you'll never be able to interrupt when the user is typing.</em></li>\n<li>The <code>pyperclip</code> module can be used to interact with the clipboard. <em>Large amounts of text can be input-ed into or output-ed from the program using the clipboard.</em></li>\n<li>I use %s string interpolation instead of f-strings. <em>I love f-strings, but they were only introduced in Python 3.6 and I don't want to limit the versions that these programs are compatible with.</em></li>\n<li>For all dictionaries, I have a short comment explaining what types the keys and values are. <em>For example, # Keys=places, values=strings of the suspect &amp; item there.</em></li>\n<li>Use the \"DOS box-drawing\" characters to draw complicated board games. <em>Though sticking to +, -, and | for lines is good too since it's simpler.</em></li>\n<li>Player vs player games can often be simpler and shorter than player vs computer games. <em>This necessarily means that multiplayer games must be \"perfect information\" games since both players can view the screen.</em></li>\n<li>Don't modify mutable objects (e.g. lists) in functions to pass information into/out of the function; only use parameters and return values. <em>This can make your program seem magical to someone not familiar with the Python Data Model.</em></li>\n<li>Avoid insulting the player when they lose. <em>This is something I learned from instructing programming classes for kids. They respond poorly to messages like, \"Game Over, Dummy!\" even if they seem innocuous to adults.</em></li>\n</ul>\n<p>After making several of these programs, I've notice various \"categories\" of program complexity. Programs can be of zero or more of these categories:</p>\n<ul>\n<li>Absolute beginner level. <em>No functions, no nested data structures, avoid nested loops. Just uses simple branching and loops.</em></li>\n<li>Choose-your-own-adventure level. <em>Programs don't model things with data structures, but rather mostly use flow control.</em></li>\n<li>STDIO-only. <em>You can't undo things that have been previously printed (aside from \"printing\" backspace characters to erase characters on the current line). The output is like an append-only log file.</em></li>\n<li>Curses-like. <em>Requires the <code>bext</code> module, but can clear/refresh the screen, draw at arbitrary places on the screen in color, etc.</em></li>\n<li>Modify source code to run. <em>Instead of getting input from <code>input()</code>, the user edits variables at the top of the file to change the settings in the program.</em></li>\n</ul>\n<p>Additional modules I recommend using:</p>\n<ul>\n<li><code>bext</code> for colorful text and controlling the positioning of the text cursor.</li>\n<li><code>blessings</code> for a better version of curses.</li>\n<li><code>pyperclip</code> for copying/psating text with the clipboard.</li>\n<li><code>playsound</code> for playing sound files.</li>\n<li><code>pyttsx3</code> for text to speech.</li>\n<li><code>pytextcavas</code> for 2D strings you can draw on</li>\n<li><code>pyrect</code> for rectangle data structure</li>\n<li><code>pybresenham</code> for various line-drawing functions</li>\n</ul>\n<h1>Completed Programs in This Collection</h1>\n<p><em>Alphabetize Quiz</em> - A time-based quiz game to see how fast you can alphabetize letters.</p>\n<p><em>Alphabetize Word Quiz</em> - A time-based quiz game to see how fast you can alphabetize words.</p>\n<p><em>Analog Clock</em> - An analog clock animation. Press Ctrl-C to stop.</p>\n<p><em>Bagels</em> - A deductive logic game where you must guess a number based on clues.</p>\n<p><em>Birthday Paradox Simulation</em> - Explore the mathematics of the \"Birthday Paradox\". More info at <a href=\"https://en.wikipedia.org/wiki/Birthday_problem\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Birthday_problem</a></p>\n<p><em>Blackjack</em> - A card game also known as 21. More info at: <a href=\"https://en.wikipedia.org/wiki/Blackjack\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Blackjack</a></p>\n<p><em>Bouncing Ball</em> - A bouncing ball animation. Press Ctrl-C to stop.</p>\n<p><em>Bouncing Lines</em> - A bouncing line animation. Press Ctrl-C to stop.</p>\n<p><em>Calendar Maker</em> - Create monthly calendars, saved to a text file and fit for printing.</p>\n<p><em>Chance Checkers</em> - Checkers, but you can move 3 random checkers per turn. These checkers are randomly decided, and can be the player's own checkers or their opponents', but you can't move your opponents' promoted checkers. In this version, capturing is not mandatory.</p>\n<p><em>Daleks</em> - Try to get the robots to crash into each other.</p>\n<p><em>Checkers</em> - The classic checkers board game. In this version, capturing is not mandatory.</p>\n<p><em>Chomp</em> - A dangerously delicious logic game. Inspired by a Frederik Schuh and David Gale puzzle, published by Martin Gardner in Scientific American (January 1973) More info at: <a href=\"https://en.wikipedia.org/wiki/Chomp\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Chomp</a></p>\n<p><em>Clickbait Headline Generator</em> - A clickbait headline generator for your soulless content farm.</p>\n<p><em>Coin Flip Simulator</em> - Simulate a large number of coin flips.</p>\n<p><em>Collatz Sequence</em> - Generates numbers for the Collatz sequence, given a starting number.</p>\n<p><em>Collatz Sequence Stats</em> - Finds out how long various Collatz Sequences are.</p>\n<p><em>Connect Four</em> - A board game to get four tiles in a row.</p>\n<p><em>Conway's Game of Life</em> - The classic cellular automata simulation. Press Ctrl-C to stop. More info at: <a href=\"https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life</a></p>\n<p><em>Conway's Game of Life (Terminal)</em> - The classic cellular automata simulation. Press Ctrl-C to stop. More info at: <a href=\"https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life</a></p>\n<p><em>Countdown</em> - Show a countdown timer animation using a seven-segment display. Press Ctrl-C to stop. More info at <a href=\"https://en.wikipedia.org/wiki/Seven-segment_display\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Seven-segment_display</a> Requires our sevseg.py program.</p>\n<p><em>Diagonal Maze</em> - Prints out a random, diagonal maze. Inspired by the 10 PRINT CHR$(205.5+RND(1)); : GOTO 10 program.</p>\n<p><em>Dice Roller</em> - Simulates dice rolls using the Dungeons &amp; Dragons notation.</p>\n<p><em>Digital Clock</em> - Display a digital clock of the current time with a seven-segment display. Press Ctrl-C to stop. More info at <a href=\"https://en.wikipedia.org/wiki/Seven-segment_display\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Seven-segment_display</a> Requires our sevseg.py program.</p>\n<p><em>DNA</em> - A simple animation of a DNA double-helix. Press Ctrl-C to stop. Thanks to matoken for inspiration: <a href=\"https://asciinema.org/a/155441\" rel=\"nofollow\">https://asciinema.org/a/155441</a></p>\n<p><em>Eeny-Meeny-Miny-Moe</em> - An elimination game for multiple players. Press Ctrl-C to stop. More info at <a href=\"https://en.wikipedia.org/wiki/Eeny,_meeny,_miny,_moe\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Eeny,_meeny,_miny,_moe</a> More info at <a href=\"https://en.wikipedia.org/wiki/Josephus_problem\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Josephus_problem</a></p>\n<p><em>Etch a Sketch</em> - Draw a trailing line on the screen.</p>\n<p><em>Factorization</em> - Find all the factors of a number.</p>\n<p><em>Fireflies</em> - A beautiful animation of fireflies. Press Ctrl-C to stop.</p>\n<p><em>Fish Tank</em> - A peaceful animation of a fish tank. Press Ctrl-C to stop.</p>\n<p><em>FizzBuzz Calculation</em> - Calculates the answers for the fizz buzz programming problem.</p>\n<p><em>FizzBuzz Game</em> - A number game where you also race against the clock.</p>\n<p><em>Flippy (a Reversi clone)</em> - (Requires Pygame) Play against the computer and try to flip their tiles.</p>\n<p><em>Flood Fill</em> - An example of a \"flood fill\" algorithm. This is a basic demo of both the recursive and iterative floodfill algorithms. This algorithm is commonly used in \"fill tools\" in graphics programs like MS Paint or Photoshop. This algorithm is also used in the floodit.py game.</p>\n<p><em>Flood It!</em> - A colorful game where you try to fill the board with a single color.</p>\n<p><em>Forest Fire Sim</em> - A simulation of fires spreading in a growing forest. Press Ctrl-C to stop. Inspired by Nicky Case's Emoji Sim <a href=\"http://ncase.me/simulating/model/\" rel=\"nofollow\">http://ncase.me/simulating/model/</a></p>\n<p><em>Four-In-A-Row</em> - (Requires Pygame) Play against the computer, dropping tiles to connect four.</p>\n<p><em>Nonuniform Fractal Tree Drawer</em> - Draws nonuniform fractal trees with turtle graphics.</p>\n<p><em>Fractal Tree Drawer</em> - Draws fractal trees with turtle graphics.</p>\n<p><em>2048 Game</em> - A sliding tile game to combine exponentially-increasing numbers. Inspired by Gabriele Cirulli's 2048, which is a clone of Veewo Studios' 1024, which in turn is a clone of the Threes! game. More info at <a href=\"https://en.wikipedia.org/wiki/2048_(video_game)\" rel=\"nofollow\">https://en.wikipedia.org/wiki/2048_(video_game)</a></p>\n<p><em>Gemgem (a Bejeweled clone)</em> - (Requires Pygame) An addictive jewel matching game.</p>\n<p><em>Ghost Leg Lottery</em> - Follow the trail to see who wins! More info at: <a href=\"https://en.wikipedia.org/wiki/Ghost_Leg\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Ghost_Leg</a></p>\n<p><em>Guess the Number</em> - While given hints, try to guess the secret number.</p>\n<p><em>Guillotine</em> - A French variant of Hangman with different graphics. Ooh la la!</p>\n<p><em>Hacking</em> - The hacking mini-game from \"Fallout 3\".</p>\n<p><em>Hammurabi</em> - The classic game Hamurabi.bas by Doug Dyment, popularized by David Ahl.</p>\n<p><em>Hamsburger</em> - A program for making silly pluralizations. Press Ctrl-C to stop.</p>\n<p><em>Hangman</em> - A word-guessing game.</p>\n<p><em>Hangman with Random Letters</em> - A completely unfair word-guessing game. (This is a joke program.)</p>\n<p><em>Hard-coded Tic Tac Toe</em> - Play tic tac toe against the computer. Every possible move has been hard-coded into this program. The program is 5700 lines long. This is a joke program, don't actually write code like this.</p>\n<p><em>Hilbert Curve</em> - Draws the Hilbert Curve fractal with turtle graphics. More info at: <a href=\"https://en.wikipedia.org/wiki/hilbertCurve\" rel=\"nofollow\">https://en.wikipedia.org/wiki/hilbertCurve</a> Good videos on space-filling curves: <a href=\"https://youtu.be/RU0wScIj36o\" rel=\"nofollow\">https://youtu.be/RU0wScIj36o</a> and <a href=\"https://youtu.be/3s7h2MHQtxc\" rel=\"nofollow\">https://youtu.be/3s7h2MHQtxc</a></p>\n<p><em>Hour Glass Animation</em> - An animation of an hour glass filled with falling sand. Press Ctrl-C to stop.</p>\n<p><em>Idiot</em> - How to keep an idiot busy for hours. (This is a joke program.)</p>\n<p><em>Ink Spill (a Flood It clone)</em> - (Requires Pygame) Try to make the entire field a single color.</p>\n<p><em>J'ACCUSE!</em> - A mystery game of intrigue and a missing cat. Inspired by Homestar Runner's \"Where's an Egg?\" game</p>\n<p><em>Koch Snowflake</em> - Draws a Koch snowflake fractal with turtle graphics.</p>\n<p><em>Langton's Ant</em> - A cellular automata animation. Press Ctrl-C to stop. More info: <a href=\"https://en.wikipedia.org/wiki/Langton%27s_ant\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Langton%27s_ant</a></p>\n<p><em>Lawnmower</em> - Watch grass get cut and grow again. Press Ctrl-C to stop. Inspired by Tondeuse by Jules Villard, <a href=\"https://asciinema.org/a/21743\" rel=\"nofollow\">https://asciinema.org/a/21743</a> <a href=\"https://bitbucket.org/jvillard/tondeuse/src/default/\" rel=\"nofollow\">https://bitbucket.org/jvillard/tondeuse/src/default/</a></p>\n<p><em>Leetspeak</em> - Translates English messages into l33t5p34]&lt;.</p>\n<p><em>Luhn Checksum Algorithm</em> - The mathematics behind credit card numbers. More info at: <a href=\"https://en.wikipedia.org/wiki/Luhn_algorithm\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Luhn_algorithm</a> More info at: <a href=\"https://youtu.be/Erp8IAUouus\" rel=\"nofollow\">https://youtu.be/Erp8IAUouus</a></p>\n<p><em>Magic Eight Ball</em> - Ask a question about your future.</p>\n<p><em>Magic Hexagon</em> - Place numbers in a hexagon so each row adds up to 38. More info at <a href=\"https://en.wikipedia.org/wiki/Magic_hexagon\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Magic_hexagon</a> More info at <a href=\"https://www.youtube.com/watch?v=ZkVSRwFWjy0\" rel=\"nofollow\">https://www.youtube.com/watch?v=ZkVSRwFWjy0</a></p>\n<p><em>Mancala</em> - The ancient seed-sowing board game. Rules at <a href=\"http://www.mancalarules.com/\" rel=\"nofollow\">http://www.mancalarules.com/</a> More info at <a href=\"https://en.wikipedia.org/wiki/Mancala\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Mancala</a></p>\n<p><em>Matching Parentheses</em> - A parentheses/bracket/braces matching algorithm.</p>\n<p><em>Maze Maker</em> - Make mazes with the recursive backtracker algorithm. More info at: <a href=\"https://en.wikipedia.org/wiki/Maze_generation_algorithm#Recursive_backtracker\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Maze_generation_algorithm#Recursive_backtracker</a> An animated demo: <a href=\"https://scratch.mit.edu/projects/17358777/\" rel=\"nofollow\">https://scratch.mit.edu/projects/17358777/</a></p>\n<p><em>Maze Runner</em> - Move around a maze and try to escape.</p>\n<p><em>Maze 3D</em> - Move around a maze and try to escape... in 3D!</p>\n<p><em>Maze Runner HTML</em> - Move around a maze and try to escape... in 3D and IN YOUR WEB BROWSER!</p>\n<p><em>Memory Puzzle</em> - (Requires Pygame) A simple memory matching game.</p>\n<p><em>Middle Letter Scrambler</em> - Scrambles the middle letters of words, but not the first and last letters.</p>\n<p><em>Million Dice Roll Stats</em> - A simulation of one million dice rolls.</p>\n<p><em>Mona Lisa</em> - Draws an Andy Warhol-like drawing of the Mona Lisa with turtle graphics.</p>\n<p><em>Mondrian Art Generator</em> - Randomly generates Mondrian-style art.</p>\n<p><em>Monty Hall Problem</em> - A simulation of the Monty Hall game show problem. More info at <a href=\"https://en.wikipedia.org/wiki/Monty_Hall_problem\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Monty_Hall_problem</a></p>\n<p><em>Morse Code</em> - Translates between English and Morse Code. More info at: <a href=\"https://en.wikipedia.org/wiki/Morse_code\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Morse_code</a></p>\n<p><em>Multiplication Table</em> - Print a multiplication table.</p>\n<p><em>Multiplicative Persistence</em> - A fun math challenge. For more information about this topic, see <a href=\"https://youtu.be/Wim9WJeDTHQ\" rel=\"nofollow\">https://youtu.be/Wim9WJeDTHQ</a></p>\n<p><em>99 Bottles of Beer on the Wall</em> - Print the full lyrics to one of the most longest songs ever! Press Ctrl-C to stop.</p>\n<p><em>Peg Solitaire</em> - A single-player, peg-jumping game to eliminate all the pegs. More info at <a href=\"https://en.wikipedia.org/wiki/Peg_solitaire\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Peg_solitaire</a></p>\n<p><em>Pentomino</em> - (Requires Pygame) Like Pygame, except with 5-box blocks.</p>\n<p><em>Periodic Table of Elements</em> - Displays atomic information for all the elements.</p>\n<p><em>Pig Latin</em> - Translates English messages into Igpay Atinlay.</p>\n<p><em>Polygons</em> - A turtle program to draw polygons. Every line is the same length.</p>\n<p><em>Progress Bar</em> - A sample progress bar animation that can be used in other programs.</p>\n<p><em>Pythons</em> - Drawing pythons with turtle graphics.</p>\n<p><em>Rail Fence Cipher</em> - The \"rail fence\" cipher for encrypting text. More info at: <a href=\"https://en.wikipedia.org/wiki/Rail_fence_cipher\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Rail_fence_cipher</a></p>\n<p><em>Rainbow</em> - Shows a simple rainbow animation. Press Ctrl-C to stop.</p>\n<p><em>Rainbow 2</em> - Shows a simple squiggle rainbow animation. Press Ctrl-C to stop.</p>\n<p><em>Random Walk</em> - Generate splatter-art with the \"random walk\" algorithm. Press Ctrl-C to stop. More info at: <a href=\"https://en.wikipedia.org/wiki/Random_walk\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Random_walk</a></p>\n<p><em>Reversi</em> - A tile flipping game, also called reversi. More info <a href=\"https://en.wikipedia.org/wiki/Reversi\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Reversi</a></p>\n<p><em>Rock-Paper-Scissors</em> - A hand game of luck.</p>\n<p><em>Rock-Paper-Scissors (Always Win)</em> - A hand game of luck, except you cannot lose.</p>\n<p><em>ROT13 Cipher</em> - The simplest cipher for encrypting and decrypting text. More info at <a href=\"https://en.wikipedia.org/wiki/ROT13\" rel=\"nofollow\">https://en.wikipedia.org/wiki/ROT13</a></p>\n<p><em>Rotating Cube</em> - A rotating cube animation. Press Ctrl-C to stop.</p>\n<p><em>Rotating Cube (Bext Version)</em> - A rotating cube animation. Press Ctrl-C to stop.</p>\n<p><em>Rotating Sphere</em> - A rotating sphere animation. Press Ctrl-C to stop.</p>\n<p><em>Rush Hour</em> - A sliding tile puzzle game to move cars out of the way. Original game by Nob Yoshihagara More info at <a href=\"https://www.michaelfogleman.com/rush/\" rel=\"nofollow\">https://www.michaelfogleman.com/rush/</a></p>\n<p><em>Sand Fall</em> - A falling sand animation. Inspired by <a href=\"https://asciinema.org/a/6515\" rel=\"nofollow\">https://asciinema.org/a/6515</a></p>\n<p><em>Sand Fall (Bext Version)</em> - A falling sand animation. Inspired by <a href=\"https://asciinema.org/a/6515\" rel=\"nofollow\">https://asciinema.org/a/6515</a></p>\n<p><em>Sevseg</em> - A seven-segment display module. More info at <a href=\"https://en.wikipedia.org/wiki/Seven-segment_display\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Seven-segment_display</a></p>\n<p><em>Shell Game</em> - A random gambling game.</p>\n<p><em>Sierpinkski's Game</em> - Sierpinkski's \"game\" is an algorithm that draws Sierpinski's Triangle with turtle graphics. More info at <a href=\"https://en.wikipedia.org/wiki/Chaos_game\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Chaos_game</a></p>\n<p><em>Sierpinski Square</em> - Draws the Sierpinski Square (also called Carpet) with turtle graphics. More info at: <a href=\"https://en.wikipedia.org/wiki/Sierpinski_carpet\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Sierpinski_carpet</a></p>\n<p><em>Sierpinski Triangle</em> - Draws the Sierpinski Triangle fractal with turtle graphics.</p>\n<p><em>Simulate (a Simon clone)</em> - (Requires Pygame) Copy the pattern of flashing lights for as long as possible.</p>\n<p><em>Slide Puzzle</em> - (Requires Pygame) The classic 15-tile slide puzzle.</p>\n<p><em>15-Sliding Puzzle</em> - Slide the numbered tiles into the correct order.</p>\n<p><em>Snail Race</em> - Fast-paced snail racing action!</p>\n<p><em>Sokoban clone</em> - The classic crate-pushing game.</p>\n<p><em>Sonar Treasure Hunt</em> - Try to locate treasure chests hidden under the waves.</p>\n<p><em>Soroban</em> - A simulation of a Japanese abacus calculator tool. More info at: <a href=\"https://en.wikipedia.org/wiki/Soroban\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Soroban</a></p>\n<p><em>Spiral</em> - Draws a simple square spiral.</p>\n<p><em>sPoNgEtExT</em> - Translates English messages into sPOnGEtExT.</p>\n<p><em>Squirrel Eat Squirrel</em> - (Requires Pygame) A game where squirrels eat each other and grow monstrously large.</p>\n<p><em>Star Pusher (a Sokoban clone)</em> - (Requires Pygame) A puzzle game where you push the stars over their goals.</p>\n<p><em>Sticky Hands</em> - A jewel-stealing, movement puzzle game.</p>\n<p><em>Sudoku</em> - The classic 9x9 number placement puzzle. More info at <a href=\"https://en.wikipedia.org/wiki/Sudoku\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Sudoku</a></p>\n<p><em>Tetromino (a Tetris clone)</em> - (Requires Pygame) The classic block falling puzzle from the Soviet Union.</p>\n<p><em>Tetromino for Idiots</em> - (Requires Pygame) Tetris, but... simpler.</p>\n<p><em>Three-Card Monte</em> - Find the Queen of Hearts after cards have been swapped around. (In the real-life version, the scammer palms the Queen of Hearts so you always lose.) More info at <a href=\"https://en.wikipedia.org/wiki/Three-card_Monte\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Three-card_Monte</a></p>\n<p><em>Tic Tac Toe</em> - The classic board game.</p>\n<p><em>Tic Tac Toe (OOP)</em> - The classic board game. (Object-oriented programming version.)</p>\n<p><em>Towers of Hanoi puzzle</em> - A puzzle where you must move the discs of one tower to another tower. More info at <a href=\"https://en.wikipedia.org/wiki/Tower_of_Hanoi\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Tower_of_Hanoi</a></p>\n<p><em>Ulam Spiral</em> - The Ulam spiral is a mysterious mathematics pattern for prime numbers with turtle graphics. More info at <a href=\"https://en.wikipedia.org/wiki/Ulam_spiral\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Ulam_spiral</a></p>\n<p><em>Water Bucket Puzzle</em> - A water pouring puzzle. More info: <a href=\"https://en.wikipedia.org/wiki/Water_pouring_puzzle\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Water_pouring_puzzle</a></p>\n<p><em>Wormy</em> - (Requires Pygame) Lead the green snake around the screen eating red apples.</p>\n<p><em>Zigzag</em> - A simple zig zag animation. Press Ctrl-C to stop.</p>\n<h1>TODO NOTES</h1>\n<p>(The rest of these are placeholder ideas and not officially a part of this README)</p>\n<p>TODO - explain why I don't use cls/clear if it isn't necessary (it's to make programs compatible with non terminal environemnts, like idle or vscode or pycharm)</p>\n<p>Games should:</p>\n<ul>\n<li>Have unit tests, which show how you can call the individual functions and see what they do with their input.</li>\n<li>Should I include type hints? (Decision: nah. They're often not needed and I feel like their occassional presence would be more distracting than illuminating.)</li>\n<li>Maybe include a barebones version of games, with stub functions that specify what their input/output, and hint at what other functions in the program they'll call? And the data structures used?</li>\n<li>I should focus on games that don't require data structures (this removes most board games).</li>\n<li>Games should have logging messages that can be enabled?</li>\n</ul>\n<p>TODO polishing process</p>\n<ul>\n<li>Create unit tests for each game.</li>\n<li>Test inputs. It should be impossible to crash a game with user input.</li>\n<li>Add comments liberally.</li>\n<li>Add assert statements. These should never arise during the game. (Test!)</li>\n<li>Create the \"skeletons\" of each game, which has just the function stubs and docstring, plus list of functions that this function calls. Unit tests can help them with filling out their skeletons.</li>\n<li>Write up a description for each game, which includes a sample play session text.</li>\n<li>Description should have a link to pythontutor.com.</li>\n<li>Describe data structures used, including examples.</li>\n</ul>\n<p>Game Ideas:</p>\n<ul>\n<li>Nonograms <a href=\"https://en.wikipedia.org/wiki/Nonogram\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Nonogram</a></li>\n</ul>\n<p>Class protocol:</p>\n<ul>\n<li>Copy the source code by typing it.</li>\n<li>Run the program and test it.</li>\n<li>Run it under a debugger, answer questions about variable values.</li>\n<li>Make the changes suggested for this project.</li>\n<li>Try to remake the game without looking at the source, read the list of objectives.</li>\n</ul>\n<p>TODO entry outline (what a single program looks like on its page or book)</p>\n<ul>\n<li>Name</li>\n<li>Brief description and credits (This plus name and link should be able to fit into a tweet.)</li>\n<li>Three screenshots. (To include in the tweet)</li>\n<li>Longer description.</li>\n<li>Sample play text.</li>\n<li>Data structure examples.</li>\n<li>Pythontutor link</li>\n<li>SKIP THIS: Skeleton source code</li>\n<li>SKIP THIS: Unit tests (not utterly comprehensive or 100 % code coverage, but enough to convey the idea of the game's functions)</li>\n<li>Full source code (and github link)</li>\n<li>List of questions that probe if the reader knows how the code works.</li>\n<li>List of experiments to try out.</li>\n</ul>\n<p>Note: Remind readers that they can hit Ctrl-C to quit a program. Also remind them to run the programs under a debugger.</p>\n<p>Note: I think we should avoid the \"stub/skeleton\" code format. The reader is put into a position of trying to read the original programmer's mind, instead of just creating a game they want to play. So this means we don't need extensive docstrings, unit tests, or assertions at the top of each function.</p>\n<p>TODO tweet format:\nPython programming tutorial for text-based games: &lt;NAME&gt; &lt;DESC&gt; &lt;LINK&gt;</p>\n<p>Copyright 2019, Al Sweigart. All rights reserved.</p>\n\n          </div>"}, "last_serial": 6852034, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "6b129c33cf244a5c5e986802972db617", "sha256": "1972e8cb90cff9f47163b91548b26e1cfedf4b1c3bf7c88bb7683074ae71a3a8"}, "downloads": -1, "filename": "gamesbyexample-0.1.0.tar.gz", "has_sig": false, "md5_digest": "6b129c33cf244a5c5e986802972db617", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 114859, "upload_time": "2019-11-13T06:42:09", "upload_time_iso_8601": "2019-11-13T06:42:09.193849Z", "url": "https://files.pythonhosted.org/packages/d4/fa/0522e884a69f809cf2633ffa0925cc5e8f74202c86dd4a670caef22e2ae6/gamesbyexample-0.1.0.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "6275e163d1c8d318ea939d54c6be978b", "sha256": "caa4601654eef66f32884cdac1307e7f541688aaf9edf7c1fbe3df2b27edf23b"}, "downloads": -1, "filename": "gamesbyexample-0.1.2.tar.gz", "has_sig": false, "md5_digest": "6275e163d1c8d318ea939d54c6be978b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 11140906, "upload_time": "2019-12-14T07:29:03", "upload_time_iso_8601": "2019-12-14T07:29:03.569175Z", "url": "https://files.pythonhosted.org/packages/2a/45/d50e5dcfe4f18c88127090500c1a1b2b000321d95eb6cd33dd0bb8f8b2be/gamesbyexample-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "3df5f8b815cb869f9f8d1a7c628a95f5", "sha256": "c6838a1ad68f3fa4023b8d67536cce2dafa28472f8d06b0b7c27f0ef09ac0a2b"}, "downloads": -1, "filename": "gamesbyexample-0.1.3.tar.gz", "has_sig": false, "md5_digest": "3df5f8b815cb869f9f8d1a7c628a95f5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 11181645, "upload_time": "2020-03-20T18:28:10", "upload_time_iso_8601": "2020-03-20T18:28:10.711225Z", "url": "https://files.pythonhosted.org/packages/5f/18/8cf9bd061afc88202a6ae1b68935ed791cdaedc9cf4282b0ac722c3c259c/gamesbyexample-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "5933b288b1a09950a9ed99840a6977f6", "sha256": "b86cce3c62cd5bdb8b72c6b4142eea7a16f78f6100849f23b259f5cec17c45b1"}, "downloads": -1, "filename": "gamesbyexample-0.1.4.tar.gz", "has_sig": false, "md5_digest": "5933b288b1a09950a9ed99840a6977f6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 11188774, "upload_time": "2020-03-20T19:09:18", "upload_time_iso_8601": "2020-03-20T19:09:18.416960Z", "url": "https://files.pythonhosted.org/packages/f3/c6/fa327f0348b7756ba14360f21a5429642966e1efd34affb0023421068d0e/gamesbyexample-0.1.4.tar.gz", "yanked": false}], "0.1.5": [{"comment_text": "", "digests": {"md5": "3b314f4db3f297a03facf20fffc23f07", "sha256": "fa505c68c51522c99d097e8919f4004f5ae751e1703de001d7e174f63c3407fa"}, "downloads": -1, "filename": "gamesbyexample-0.1.5.tar.gz", "has_sig": false, "md5_digest": "3b314f4db3f297a03facf20fffc23f07", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3639959, "upload_time": "2020-03-20T19:59:33", "upload_time_iso_8601": "2020-03-20T19:59:33.911269Z", "url": "https://files.pythonhosted.org/packages/a1/ab/240fdeea34ac3cd406273e4cb9999978fbcff04931a96e1b433a135c466e/gamesbyexample-0.1.5.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "3b314f4db3f297a03facf20fffc23f07", "sha256": "fa505c68c51522c99d097e8919f4004f5ae751e1703de001d7e174f63c3407fa"}, "downloads": -1, "filename": "gamesbyexample-0.1.5.tar.gz", "has_sig": false, "md5_digest": "3b314f4db3f297a03facf20fffc23f07", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3639959, "upload_time": "2020-03-20T19:59:33", "upload_time_iso_8601": "2020-03-20T19:59:33.911269Z", "url": "https://files.pythonhosted.org/packages/a1/ab/240fdeea34ac3cd406273e4cb9999978fbcff04931a96e1b433a135c466e/gamesbyexample-0.1.5.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:59:13 2020"}