{"info": {"author": "Ben Moews and Joe Zuntz", "author_email": "ben.moews@protonmail.com", "bugtrack_url": null, "classifiers": ["Intended Audience :: Science/Research", "License :: OSI Approved :: MIT License", "Programming Language :: Python :: 3 :: Only"], "description": "# Gaussbock\n\n#### Fast parallel-iterative cosmological parameter estimation with Bayesian nonparametrics\n\nGaussbock is a general-purpose tool for parameter estimation with computationally expensive likelihood calculations, developed for high-dimensional cosmological parameter estimation for contemporary missions like the [Dark Energy Survey (DES)](https://www.darkenergysurvey.org/), and with upcoming surveys like the [Large Synoptic Sky Telescope (LSST)](https://www.lsst.org/) and [ESA's Euclid mission](http://sci.esa.int/euclid/) in mind. Current efforts in cosmological parameter estimation often suffer from both the computational costs of approximating distributions in high-dimensional parameter spaces and the wide-spread need for model tuning. Specifically, calculating the likelihoods of parameter proposals through anisotropic simulations of the universe imposes high computational costs, which leads to excessive time requirements per experiment in an era of cheap parallel computing resources.\n\nMaking use of parallelization and an iterative approach to Bayesian nonparametrics, the provided method starts with a set of data points from a rough distribution guess for the true posterior. In order to obtain such a sample, the code either uses an affine-invariant MCMC ensemble as intoduced by [Goodman and Weare (2004)](https://projecteuclid.org/euclid.camcos/1513731992) via [emcee](http://dfm.io/emcee/current/) or an initial set of data points provided by the user. After that, a variational Bayesian non-parametric Gaussian mixture model (GMM), which makes use of an infinite Dirichlet process mixtures approximated with a stick-breaking representation (see [Blei and Jordan, 2006](https://projecteuclid.org/euclid.ba/1340371077)), is fitted to the data points and a consistent number of data points is sampled from the model.\n\nThese data points are then re-sampled via probabilities derived from truncated importance sampling, an extension of importance sampling less sensitive to proposal distributions to avoid dominating high-posterior samples and introduced by [Ionides (2008)](https://amstat.tandfonline.com/doi/abs/10.1198/106186008X320456), for which the computation is spread over the provided cores as an embarrassingly parallel problem. The model fitting and importance sampling steps are then iteratively repeated, shifting towards an ever-narrower fit around the true posterior distribution, and leading to a significant speed-up in comparison to other established cosmological parameter estimation approaches. At the end, Gaussbock returns a user-specified number of samples and, if the user wishes, the importance weights and the final model itself, allowing for the sampling of an unlimited number of data points and to investigate the importance probabilities to ensure a reasonable distribution of the latter.\n\nIf you use or adapt Gaussbock, please cite the corresponding paper ([arXiv:1905.09800](https://arxiv.org/abs/1905.09800)).\n\n### Installation\n\nGaussbock can be installed via [PyPI](https://pypi.org), with a single command in the terminal:\n\n```\npip install gaussbock\n```\n\nAlternatively, the file `gaussbock.py` can be downloaded from the folder `gaussbock` in this repository and used locally by placing the file into the working directory for a given project. An installation via the terminal is, however, highly recommended, as the installation process will check for the package requirements and automatically update or install any missing dependencies, thus sparing the user the effort of troubleshooting and installing them themselves.\n\n### Quickstart guide\n\nOnly three inputs are required by Gaussbock: The list of parameter ranges, each as a tuple with the lower and upper limit for each parameter (`parameter_ranges`), the handle for a posterior function that is to be used to evaluate samples (`posterior_evaluation`), and the required number of posterior samples in the output (`output_samples`).\n\nGaussbock offers a variety of optional inputs. An affine-invariate MCMC ensemble to obtain an initial approximation of the posterior can be used, or users provide their own initial sample (`initial_samples`). This takes the form `['automatic', int, int]` for the MCMC ensemble, with the integer referring to the number of walker and steps per walker, respectively, or `['custom', array-like]`, with the array-like object providing the initial samples in the parameter space. \n\nThe maximum number of Gaussbock iterations (`gaussbock_iterations`) can be set, as can the threshold for the convergence criterion using inter-iteration variance differences (`convergence_threshold`). Other optional inputs include the number of samples that are drawn from the current posterior approximation before each truncated importance sampling step (`mixture_samples`) and the maximum number of expectation-maximization (EM) iterations to fit the variational Bayesian GMM (`em_iterations`).\n\nIn addition, the start and end for a shrinking convergence threshold for the posterior fitting in the form `[float, float]` can be provided (`tolerance_range`), as can the maximum number of Gaussians to be fitted to samples in each iteration (`model_components`) and the tpe of covariance parameters from the set `{'full', 'tied', 'diag', spherical'}` used for the fitting process (`model_covariance`). Another optional input is the method used to initialize the model's weights, means and covariances as either `'kmeans'` or `'random'` as possible values (`parameter_init`). The armount of information the model fitting should provide during runtime can be set as `0`, `1` or `2` (`model_verbosity`).\n\nIn order to make use of parallelization, the user can either choose to use MPI pools and set the corresponding input to `True` (`mpi_parallelization`), for example for running on supercomputers or local clusters, or specify a number of processes for multi-core parallelization (`processes`). Another boolean input is the choice whether both importance weights and the final model should be returned (`weights_and_model`). Since truncated importance sampling is used, the truncation value for importance probability reweighting can be chosen as a float from `[1.0, 3.0]`. Lower values lead to a more general fitting with strong truncation, whereas smaller values result in a higher level of retained dominant data points. This input should only be customized if the approximation is problematic and can't be resolved via other inputs.\n\nThe model used for the fitting process can be selected, with `'kde`' for kernel density estimation (KDE) being the default for problems in less than three dimensions, and `'gmm'` being the default otherwise to use the variational Bayesian GMM suitable for higher-dimensional problems. Lastly, if KDE is used, the kernel bandwidth that should be used can be specified (`kde_bandwidth`). The required and optional inputs, together with their default values and with optional inputs marked with an asterisk, are listed below, with _D_ denoting the dimensionality of the parameter estimation problem, or the number of parameters.\n\n\n<br></br>\n\n| Variables                        | Explanations                                              | Default                  |\n|:---------------------------------|:----------------------------------------------------------|:-------------------------|\n| parameter_ranges                 | The lower and upper limit for each parameter              |                          |\n| posterior_evaluation             | Evaluation function handle for the posterior              |                          |\n| output_samples                   | Number of posterior samples that are required             |                          |\n| * initial_samples                | Choice of 'emcee' or a provided start sample              | ['automatic', 50, 1000]  |\n| * gaussbock_iterations           | Maximum number of Gaussbock iterations                    | 10                       |\n| *convergence_threshold           | Threshold for inter-iteration convegence checks           | 1e-3                     |\n| * mixture_samples                | Number of samples drawn for importance sampling           | 1e5                      |\n| * em_iterations                  | Maximum number of EM iterations for the mixture model     | 1000                     |\n| * tolerance_range                | The range for the shrinking convergence threshold         | [1e-2, 1e-7]             |\n| * model_components               | Maximum number of Gaussians fitted to samples             | ceiling((2 / 3) * _D_)   |\n| * model_covariance               | Type of covariance for the GMM fitting process            | 'full'                   |\n| * parameter_init                 | How to intialize model weights, means and covariances     | 'random'                 |\n| * model_verbosity                | The amount of information printed during runtime          | 1                        |\n| * mpi_parallelization            | Whether to parallelize Gaussbock using an MPI pool        | False                    |\n| * processes                      | Number of processes Gaussbock should parallelize over     | 1                        |\n| * weights_and_model              | Whether to return importance weights and the model        | False                    |\n| * truncation_alpha               | Truncation value for importance probability re-weighting  | 2.0                      |\n| * model_selection                | Type of model used for the fitting process                | None                     |\n| * kde_bandwidth                  | Kernel bandwidth used when fitting via KDE                | 0.5                      |\n\n<br></br>\n\nAfter the installation via [PyPI](https://pypi.org), or using the `gaussbock.py` file locally, the usage looks like this:\n\n```python\nfrom gaussbock import gaussbock\n\noutput = gaussbock(parameter_ranges = your_posterior_ranges,\n                   posterior_evaluation = your_posterior_function,\n                   output_samples = your_required_samples,\n                   mpi_parallelization = True,\n                   weights_and_model = True)\n\nsamples, weights, model = output\n\n```\n\nNote that, in the above example, we use two of the optional parameters to tell the tool to parallelize using MPI, for example for the use on a supercomputer, and to return the importance weights and the model, for example for weighting the returned samples and saving the model to draw further samples later. If we wouldn't set the weights and model return indicator to be true, there would be no need to split the output up, as the output would be just the list of samples.\n\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/moews/gaussbock", "keywords": "astronomy,astrophysics,cosmology,bayesian,parameter estimation", "license": "", "maintainer": "", "maintainer_email": "", "name": "gaussbock", "package_url": "https://pypi.org/project/gaussbock/", "platform": "", "project_url": "https://pypi.org/project/gaussbock/", "project_urls": {"Homepage": "https://github.com/moews/gaussbock"}, "release_url": "https://pypi.org/project/gaussbock/1.0.9/", "requires_dist": ["numpy", "emcee (>=2.0.0)", "schwimmbad (>=0.3.0)", "scikit-learn (>=0.18.1)"], "requires_python": "", "summary": "Fast parallel-iterative cosmological parameter estimation with Bayesian nonparametrics", "version": "1.0.9", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Gaussbock</h1>\n<h4>Fast parallel-iterative cosmological parameter estimation with Bayesian nonparametrics</h4>\n<p>Gaussbock is a general-purpose tool for parameter estimation with computationally expensive likelihood calculations, developed for high-dimensional cosmological parameter estimation for contemporary missions like the <a href=\"https://www.darkenergysurvey.org/\" rel=\"nofollow\">Dark Energy Survey (DES)</a>, and with upcoming surveys like the <a href=\"https://www.lsst.org/\" rel=\"nofollow\">Large Synoptic Sky Telescope (LSST)</a> and <a href=\"http://sci.esa.int/euclid/\" rel=\"nofollow\">ESA's Euclid mission</a> in mind. Current efforts in cosmological parameter estimation often suffer from both the computational costs of approximating distributions in high-dimensional parameter spaces and the wide-spread need for model tuning. Specifically, calculating the likelihoods of parameter proposals through anisotropic simulations of the universe imposes high computational costs, which leads to excessive time requirements per experiment in an era of cheap parallel computing resources.</p>\n<p>Making use of parallelization and an iterative approach to Bayesian nonparametrics, the provided method starts with a set of data points from a rough distribution guess for the true posterior. In order to obtain such a sample, the code either uses an affine-invariant MCMC ensemble as intoduced by <a href=\"https://projecteuclid.org/euclid.camcos/1513731992\" rel=\"nofollow\">Goodman and Weare (2004)</a> via <a href=\"http://dfm.io/emcee/current/\" rel=\"nofollow\">emcee</a> or an initial set of data points provided by the user. After that, a variational Bayesian non-parametric Gaussian mixture model (GMM), which makes use of an infinite Dirichlet process mixtures approximated with a stick-breaking representation (see <a href=\"https://projecteuclid.org/euclid.ba/1340371077\" rel=\"nofollow\">Blei and Jordan, 2006</a>), is fitted to the data points and a consistent number of data points is sampled from the model.</p>\n<p>These data points are then re-sampled via probabilities derived from truncated importance sampling, an extension of importance sampling less sensitive to proposal distributions to avoid dominating high-posterior samples and introduced by <a href=\"https://amstat.tandfonline.com/doi/abs/10.1198/106186008X320456\" rel=\"nofollow\">Ionides (2008)</a>, for which the computation is spread over the provided cores as an embarrassingly parallel problem. The model fitting and importance sampling steps are then iteratively repeated, shifting towards an ever-narrower fit around the true posterior distribution, and leading to a significant speed-up in comparison to other established cosmological parameter estimation approaches. At the end, Gaussbock returns a user-specified number of samples and, if the user wishes, the importance weights and the final model itself, allowing for the sampling of an unlimited number of data points and to investigate the importance probabilities to ensure a reasonable distribution of the latter.</p>\n<p>If you use or adapt Gaussbock, please cite the corresponding paper (<a href=\"https://arxiv.org/abs/1905.09800\" rel=\"nofollow\">arXiv:1905.09800</a>).</p>\n<h3>Installation</h3>\n<p>Gaussbock can be installed via <a href=\"https://pypi.org\" rel=\"nofollow\">PyPI</a>, with a single command in the terminal:</p>\n<pre><code>pip install gaussbock\n</code></pre>\n<p>Alternatively, the file <code>gaussbock.py</code> can be downloaded from the folder <code>gaussbock</code> in this repository and used locally by placing the file into the working directory for a given project. An installation via the terminal is, however, highly recommended, as the installation process will check for the package requirements and automatically update or install any missing dependencies, thus sparing the user the effort of troubleshooting and installing them themselves.</p>\n<h3>Quickstart guide</h3>\n<p>Only three inputs are required by Gaussbock: The list of parameter ranges, each as a tuple with the lower and upper limit for each parameter (<code>parameter_ranges</code>), the handle for a posterior function that is to be used to evaluate samples (<code>posterior_evaluation</code>), and the required number of posterior samples in the output (<code>output_samples</code>).</p>\n<p>Gaussbock offers a variety of optional inputs. An affine-invariate MCMC ensemble to obtain an initial approximation of the posterior can be used, or users provide their own initial sample (<code>initial_samples</code>). This takes the form <code>['automatic', int, int]</code> for the MCMC ensemble, with the integer referring to the number of walker and steps per walker, respectively, or <code>['custom', array-like]</code>, with the array-like object providing the initial samples in the parameter space.</p>\n<p>The maximum number of Gaussbock iterations (<code>gaussbock_iterations</code>) can be set, as can the threshold for the convergence criterion using inter-iteration variance differences (<code>convergence_threshold</code>). Other optional inputs include the number of samples that are drawn from the current posterior approximation before each truncated importance sampling step (<code>mixture_samples</code>) and the maximum number of expectation-maximization (EM) iterations to fit the variational Bayesian GMM (<code>em_iterations</code>).</p>\n<p>In addition, the start and end for a shrinking convergence threshold for the posterior fitting in the form <code>[float, float]</code> can be provided (<code>tolerance_range</code>), as can the maximum number of Gaussians to be fitted to samples in each iteration (<code>model_components</code>) and the tpe of covariance parameters from the set <code>{'full', 'tied', 'diag', spherical'}</code> used for the fitting process (<code>model_covariance</code>). Another optional input is the method used to initialize the model's weights, means and covariances as either <code>'kmeans'</code> or <code>'random'</code> as possible values (<code>parameter_init</code>). The armount of information the model fitting should provide during runtime can be set as <code>0</code>, <code>1</code> or <code>2</code> (<code>model_verbosity</code>).</p>\n<p>In order to make use of parallelization, the user can either choose to use MPI pools and set the corresponding input to <code>True</code> (<code>mpi_parallelization</code>), for example for running on supercomputers or local clusters, or specify a number of processes for multi-core parallelization (<code>processes</code>). Another boolean input is the choice whether both importance weights and the final model should be returned (<code>weights_and_model</code>). Since truncated importance sampling is used, the truncation value for importance probability reweighting can be chosen as a float from <code>[1.0, 3.0]</code>. Lower values lead to a more general fitting with strong truncation, whereas smaller values result in a higher level of retained dominant data points. This input should only be customized if the approximation is problematic and can't be resolved via other inputs.</p>\n<p>The model used for the fitting process can be selected, with <code>'kde</code>' for kernel density estimation (KDE) being the default for problems in less than three dimensions, and <code>'gmm'</code> being the default otherwise to use the variational Bayesian GMM suitable for higher-dimensional problems. Lastly, if KDE is used, the kernel bandwidth that should be used can be specified (<code>kde_bandwidth</code>). The required and optional inputs, together with their default values and with optional inputs marked with an asterisk, are listed below, with <em>D</em> denoting the dimensionality of the parameter estimation problem, or the number of parameters.</p>\n<p><br><br></p>\n<table>\n<thead>\n<tr>\n<th align=\"left\">Variables</th>\n<th align=\"left\">Explanations</th>\n<th align=\"left\">Default</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td align=\"left\">parameter_ranges</td>\n<td align=\"left\">The lower and upper limit for each parameter</td>\n<td align=\"left\"></td>\n</tr>\n<tr>\n<td align=\"left\">posterior_evaluation</td>\n<td align=\"left\">Evaluation function handle for the posterior</td>\n<td align=\"left\"></td>\n</tr>\n<tr>\n<td align=\"left\">output_samples</td>\n<td align=\"left\">Number of posterior samples that are required</td>\n<td align=\"left\"></td>\n</tr>\n<tr>\n<td align=\"left\">* initial_samples</td>\n<td align=\"left\">Choice of 'emcee' or a provided start sample</td>\n<td align=\"left\">['automatic', 50, 1000]</td>\n</tr>\n<tr>\n<td align=\"left\">* gaussbock_iterations</td>\n<td align=\"left\">Maximum number of Gaussbock iterations</td>\n<td align=\"left\">10</td>\n</tr>\n<tr>\n<td align=\"left\">*convergence_threshold</td>\n<td align=\"left\">Threshold for inter-iteration convegence checks</td>\n<td align=\"left\">1e-3</td>\n</tr>\n<tr>\n<td align=\"left\">* mixture_samples</td>\n<td align=\"left\">Number of samples drawn for importance sampling</td>\n<td align=\"left\">1e5</td>\n</tr>\n<tr>\n<td align=\"left\">* em_iterations</td>\n<td align=\"left\">Maximum number of EM iterations for the mixture model</td>\n<td align=\"left\">1000</td>\n</tr>\n<tr>\n<td align=\"left\">* tolerance_range</td>\n<td align=\"left\">The range for the shrinking convergence threshold</td>\n<td align=\"left\">[1e-2, 1e-7]</td>\n</tr>\n<tr>\n<td align=\"left\">* model_components</td>\n<td align=\"left\">Maximum number of Gaussians fitted to samples</td>\n<td align=\"left\">ceiling((2 / 3) * <em>D</em>)</td>\n</tr>\n<tr>\n<td align=\"left\">* model_covariance</td>\n<td align=\"left\">Type of covariance for the GMM fitting process</td>\n<td align=\"left\">'full'</td>\n</tr>\n<tr>\n<td align=\"left\">* parameter_init</td>\n<td align=\"left\">How to intialize model weights, means and covariances</td>\n<td align=\"left\">'random'</td>\n</tr>\n<tr>\n<td align=\"left\">* model_verbosity</td>\n<td align=\"left\">The amount of information printed during runtime</td>\n<td align=\"left\">1</td>\n</tr>\n<tr>\n<td align=\"left\">* mpi_parallelization</td>\n<td align=\"left\">Whether to parallelize Gaussbock using an MPI pool</td>\n<td align=\"left\">False</td>\n</tr>\n<tr>\n<td align=\"left\">* processes</td>\n<td align=\"left\">Number of processes Gaussbock should parallelize over</td>\n<td align=\"left\">1</td>\n</tr>\n<tr>\n<td align=\"left\">* weights_and_model</td>\n<td align=\"left\">Whether to return importance weights and the model</td>\n<td align=\"left\">False</td>\n</tr>\n<tr>\n<td align=\"left\">* truncation_alpha</td>\n<td align=\"left\">Truncation value for importance probability re-weighting</td>\n<td align=\"left\">2.0</td>\n</tr>\n<tr>\n<td align=\"left\">* model_selection</td>\n<td align=\"left\">Type of model used for the fitting process</td>\n<td align=\"left\">None</td>\n</tr>\n<tr>\n<td align=\"left\">* kde_bandwidth</td>\n<td align=\"left\">Kernel bandwidth used when fitting via KDE</td>\n<td align=\"left\">0.5</td>\n</tr></tbody></table>\n<p><br><br></p>\n<p>After the installation via <a href=\"https://pypi.org\" rel=\"nofollow\">PyPI</a>, or using the <code>gaussbock.py</code> file locally, the usage looks like this:</p>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">gaussbock</span> <span class=\"kn\">import</span> <span class=\"n\">gaussbock</span>\n\n<span class=\"n\">output</span> <span class=\"o\">=</span> <span class=\"n\">gaussbock</span><span class=\"p\">(</span><span class=\"n\">parameter_ranges</span> <span class=\"o\">=</span> <span class=\"n\">your_posterior_ranges</span><span class=\"p\">,</span>\n                   <span class=\"n\">posterior_evaluation</span> <span class=\"o\">=</span> <span class=\"n\">your_posterior_function</span><span class=\"p\">,</span>\n                   <span class=\"n\">output_samples</span> <span class=\"o\">=</span> <span class=\"n\">your_required_samples</span><span class=\"p\">,</span>\n                   <span class=\"n\">mpi_parallelization</span> <span class=\"o\">=</span> <span class=\"kc\">True</span><span class=\"p\">,</span>\n                   <span class=\"n\">weights_and_model</span> <span class=\"o\">=</span> <span class=\"kc\">True</span><span class=\"p\">)</span>\n\n<span class=\"n\">samples</span><span class=\"p\">,</span> <span class=\"n\">weights</span><span class=\"p\">,</span> <span class=\"n\">model</span> <span class=\"o\">=</span> <span class=\"n\">output</span>\n</pre>\n<p>Note that, in the above example, we use two of the optional parameters to tell the tool to parallelize using MPI, for example for the use on a supercomputer, and to return the importance weights and the model, for example for weighting the returned samples and saving the model to draw further samples later. If we wouldn't set the weights and model return indicator to be true, there would be no need to split the output up, as the output would be just the list of samples.</p>\n\n          </div>"}, "last_serial": 5310714, "releases": {"1.0.0": [{"comment_text": "", "digests": {"md5": "04fc6667647783b8440f4e38bb8c1394", "sha256": "9f451116b5f64300c7c38c45702a5b1fc2252b820ad23ec6455784e796dac38e"}, "downloads": -1, "filename": "gaussbock-1.0.0.tar.gz", "has_sig": false, "md5_digest": "04fc6667647783b8440f4e38bb8c1394", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12324, "upload_time": "2018-04-16T15:24:05", "upload_time_iso_8601": "2018-04-16T15:24:05.341246Z", "url": "https://files.pythonhosted.org/packages/46/21/808d1556628d61c8e6768e5d4f93610b804b708fb1f2d7cb7d27726dacb0/gaussbock-1.0.0.tar.gz", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "fabc1cf334ff01a12fdb557c4faa7cfd", "sha256": "d280137eb983b166b23093e4eb20e8aeed5bea97ba00396e2021824de321089e"}, "downloads": -1, "filename": "gaussbock-1.0.1.tar.gz", "has_sig": false, "md5_digest": "fabc1cf334ff01a12fdb557c4faa7cfd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12324, "upload_time": "2018-04-16T15:50:56", "upload_time_iso_8601": "2018-04-16T15:50:56.185079Z", "url": "https://files.pythonhosted.org/packages/66/97/1884169c7c47f797220eebf4360d712d053d3285655f61691b66394f9aad/gaussbock-1.0.1.tar.gz", "yanked": false}], "1.0.2": [{"comment_text": "", "digests": {"md5": "9ed36476cecc11fa2be0b9de4bfb0604", "sha256": "2cd2917d1f896090cf4de0bd84173d945f892d75151c7d0f1b0c36600891939e"}, "downloads": -1, "filename": "gaussbock-1.0.2.tar.gz", "has_sig": false, "md5_digest": "9ed36476cecc11fa2be0b9de4bfb0604", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12328, "upload_time": "2018-04-16T21:45:04", "upload_time_iso_8601": "2018-04-16T21:45:04.072815Z", "url": "https://files.pythonhosted.org/packages/11/dd/8cefa6f4e3c0e85c7f1a0c23444d75cbec29ebe3f36cc20acdd6d5dc54c5/gaussbock-1.0.2.tar.gz", "yanked": false}], "1.0.3": [{"comment_text": "", "digests": {"md5": "67185937ad68866236b77a9be32685e7", "sha256": "26e8300b077c64fb28c3ddd335c06a960108c8bcfe35c4c7326a55958eee9819"}, "downloads": -1, "filename": "gaussbock-1.0.3.tar.gz", "has_sig": false, "md5_digest": "67185937ad68866236b77a9be32685e7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12460, "upload_time": "2018-04-22T17:24:56", "upload_time_iso_8601": "2018-04-22T17:24:56.928096Z", "url": "https://files.pythonhosted.org/packages/9d/66/c37d0c2446cc0083a7c8e38fac9c65e6c459bd09ca788c375d3239b62e7e/gaussbock-1.0.3.tar.gz", "yanked": false}], "1.0.4": [{"comment_text": "", "digests": {"md5": "d1520bf1deecc732ab88e5bc0753c92c", "sha256": "0033802685e9a8470bb3dd2edce70816b1b5af3337b55a69864720d081095859"}, "downloads": -1, "filename": "gaussbock-1.0.4.tar.gz", "has_sig": false, "md5_digest": "d1520bf1deecc732ab88e5bc0753c92c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12454, "upload_time": "2018-04-22T17:32:56", "upload_time_iso_8601": "2018-04-22T17:32:56.981122Z", "url": "https://files.pythonhosted.org/packages/af/77/78805b7c484f8c3bd9c599052b34500634a666554acf0d6ecc5f2e99c488/gaussbock-1.0.4.tar.gz", "yanked": false}], "1.0.5": [{"comment_text": "", "digests": {"md5": "e38d737e8dfe64aecf477b745651ff89", "sha256": "1d7d1b4e3bb42f5d79f7a920373944314f5e5eb0295f7b14c657c44fce314624"}, "downloads": -1, "filename": "gaussbock-1.0.5-py3-none-any.whl", "has_sig": false, "md5_digest": "e38d737e8dfe64aecf477b745651ff89", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 14575, "upload_time": "2019-05-24T00:42:02", "upload_time_iso_8601": "2019-05-24T00:42:02.431358Z", "url": "https://files.pythonhosted.org/packages/52/5f/d686553054bbc38e5ec401444363b26b29b69edab2b67c6bbd9aa7797c57/gaussbock-1.0.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7dc2c262f4b67d124341db4b15882e56", "sha256": "8cd4bba068b183dc807b0a58268ec0f6da4547e37092a271de91e81ec401d502"}, "downloads": -1, "filename": "gaussbock-1.0.5.tar.gz", "has_sig": false, "md5_digest": "7dc2c262f4b67d124341db4b15882e56", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 15678, "upload_time": "2019-05-24T00:42:04", "upload_time_iso_8601": "2019-05-24T00:42:04.485443Z", "url": "https://files.pythonhosted.org/packages/47/e9/562c01ce7bb04759dc27c746ffeac309f2348470de053a5efc593c359491/gaussbock-1.0.5.tar.gz", "yanked": false}], "1.0.6": [{"comment_text": "", "digests": {"md5": "ee4ad97313da770fe1a77f8cc515a6eb", "sha256": "8ba42176117944eb68735a5f2502edc1b43fd2f6564c087ae5b31324d7ab97f3"}, "downloads": -1, "filename": "gaussbock-1.0.6-py3-none-any.whl", "has_sig": false, "md5_digest": "ee4ad97313da770fe1a77f8cc515a6eb", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18232, "upload_time": "2019-05-24T00:55:38", "upload_time_iso_8601": "2019-05-24T00:55:38.377085Z", "url": "https://files.pythonhosted.org/packages/a8/83/e50d22428ccd549355b740567d3dd83ed7fa5d4c3a0563e815a7034cf604/gaussbock-1.0.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "fe6fe77b9e1b8fc4f81b0aa798af81b8", "sha256": "d7a998b31435b1382b682f2a4856e34a418af0ae81f0c5aab841e7224e709cf2"}, "downloads": -1, "filename": "gaussbock-1.0.6.tar.gz", "has_sig": false, "md5_digest": "fe6fe77b9e1b8fc4f81b0aa798af81b8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 16213, "upload_time": "2019-05-24T00:55:40", "upload_time_iso_8601": "2019-05-24T00:55:40.447038Z", "url": "https://files.pythonhosted.org/packages/14/95/85c3fafbf714dbc71656d8906651c2106c196599a32f87fd0f881c4e8cf8/gaussbock-1.0.6.tar.gz", "yanked": false}], "1.0.7": [{"comment_text": "", "digests": {"md5": "3fd36b41e7e654571134838b2ef3ba5f", "sha256": "e6396116ca7d1b3768640c9f4d8a303c6949bf5b47cdf4780642bb5714874911"}, "downloads": -1, "filename": "gaussbock-1.0.7-py3-none-any.whl", "has_sig": false, "md5_digest": "3fd36b41e7e654571134838b2ef3ba5f", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18192, "upload_time": "2019-05-24T00:57:00", "upload_time_iso_8601": "2019-05-24T00:57:00.652060Z", "url": "https://files.pythonhosted.org/packages/b2/40/f1d08c9e287823238edf844f1ee050d818c22e10ee669fb8e2f63a8277e6/gaussbock-1.0.7-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e3becb78ed2aa50f22be75f52f5efdc6", "sha256": "590ef8b148bdc119ad02e2fa5707962ab25b40c349ccd52981546a695ef0eb38"}, "downloads": -1, "filename": "gaussbock-1.0.7.tar.gz", "has_sig": false, "md5_digest": "e3becb78ed2aa50f22be75f52f5efdc6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 16106, "upload_time": "2019-05-24T00:57:04", "upload_time_iso_8601": "2019-05-24T00:57:04.202782Z", "url": "https://files.pythonhosted.org/packages/76/c6/ad6afd8c92ad15f66cd1593209cc51236de4d17c5ceeccd6f609acc64d83/gaussbock-1.0.7.tar.gz", "yanked": false}], "1.0.8": [{"comment_text": "", "digests": {"md5": "9b4dc3c1f780192e027ac8b76ec42683", "sha256": "1e01689c60f9e265e0eaf0b7f91cd9a71cce238b52179a761189eef0cba4926b"}, "downloads": -1, "filename": "gaussbock-1.0.8-py3-none-any.whl", "has_sig": false, "md5_digest": "9b4dc3c1f780192e027ac8b76ec42683", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18237, "upload_time": "2019-05-24T04:44:11", "upload_time_iso_8601": "2019-05-24T04:44:11.664465Z", "url": "https://files.pythonhosted.org/packages/6b/a8/46b4b7d9d730bbbce32945bb2147626e477f49c3efad00aec84beccedbd6/gaussbock-1.0.8-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a98c5b4caddfb189c65f20e904b3ade4", "sha256": "2453b90259f4e6ef9cec6462d2eac4c65932fa1612db78103b8f5a6072f588a7"}, "downloads": -1, "filename": "gaussbock-1.0.8.tar.gz", "has_sig": false, "md5_digest": "a98c5b4caddfb189c65f20e904b3ade4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 16214, "upload_time": "2019-05-24T04:44:16", "upload_time_iso_8601": "2019-05-24T04:44:16.150170Z", "url": "https://files.pythonhosted.org/packages/11/6a/bb8d573a5163f04ca8ffdc2a2d75a8b66fd27db4487ee7d4fdff28b45aa3/gaussbock-1.0.8.tar.gz", "yanked": false}], "1.0.9": [{"comment_text": "", "digests": {"md5": "e53fbc6312897925230cad1872a8d002", "sha256": "944d7f393818cc4de87c4c408cb5b005924fb8f6b8f9ff2f3893ef3a5c75507a"}, "downloads": -1, "filename": "gaussbock-1.0.9-py3-none-any.whl", "has_sig": false, "md5_digest": "e53fbc6312897925230cad1872a8d002", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18234, "upload_time": "2019-05-24T04:47:06", "upload_time_iso_8601": "2019-05-24T04:47:06.831482Z", "url": "https://files.pythonhosted.org/packages/28/0f/a80f270ba30bea717f747a722c040fa910a47b6197ac8baaa9c738f8d7c8/gaussbock-1.0.9-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e58caefb47fcf7c146af01eec14034f3", "sha256": "8cc8560f2505954b82d34ea2b34bd84804dacd0dd09987232212743b5184c107"}, "downloads": -1, "filename": "gaussbock-1.0.9.tar.gz", "has_sig": false, "md5_digest": "e58caefb47fcf7c146af01eec14034f3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 16211, "upload_time": "2019-05-24T04:47:12", "upload_time_iso_8601": "2019-05-24T04:47:12.276738Z", "url": "https://files.pythonhosted.org/packages/41/0e/f342bc3f0089f1257116b91e8f2e14e6c36b6d5202d9287f9a9c68164826/gaussbock-1.0.9.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "e53fbc6312897925230cad1872a8d002", "sha256": "944d7f393818cc4de87c4c408cb5b005924fb8f6b8f9ff2f3893ef3a5c75507a"}, "downloads": -1, "filename": "gaussbock-1.0.9-py3-none-any.whl", "has_sig": false, "md5_digest": "e53fbc6312897925230cad1872a8d002", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18234, "upload_time": "2019-05-24T04:47:06", "upload_time_iso_8601": "2019-05-24T04:47:06.831482Z", "url": "https://files.pythonhosted.org/packages/28/0f/a80f270ba30bea717f747a722c040fa910a47b6197ac8baaa9c738f8d7c8/gaussbock-1.0.9-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e58caefb47fcf7c146af01eec14034f3", "sha256": "8cc8560f2505954b82d34ea2b34bd84804dacd0dd09987232212743b5184c107"}, "downloads": -1, "filename": "gaussbock-1.0.9.tar.gz", "has_sig": false, "md5_digest": "e58caefb47fcf7c146af01eec14034f3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 16211, "upload_time": "2019-05-24T04:47:12", "upload_time_iso_8601": "2019-05-24T04:47:12.276738Z", "url": "https://files.pythonhosted.org/packages/41/0e/f342bc3f0089f1257116b91e8f2e14e6c36b6d5202d9287f9a9c68164826/gaussbock-1.0.9.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:58:59 2020"}