{"info": {"author": "Corey Bobco", "author_email": "corey.bobco@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Intended Audience :: Developers", "Intended Audience :: Education", "Intended Audience :: Science/Research", "License :: OSI Approved :: BSD License", "License :: OSI Approved :: MIT License", "Natural Language :: English", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Topic :: Artistic Software"], "description": "Generative Poetry\n=================\nA library primarily for procedurally generating visual poems\n\n.. image:: https://travis-ci.org/coreybobco/generativepoetry-py.svg?branch=master\n   :target: https://travis-ci.org/coreybobco/generativepoetry-py\n   :alt: Build Status\n\n.. image:: https://coveralls.io/repos/github/coreybobco/generativepoetry-py/badge.svg?branch=master\n   :target: https://coveralls.io/github/coreybobco/generativepoetry-py?branch=master\n   :alt: Coverage Status\n\n.. image:: https://badge.fury.io/py/generativepoetry.svg\n   :target: https://badge.fury.io/py/generativepoetry\n\nAcknowledgements\n^^^^^^^^^^^^^^^^\nConceptual writing handled by code is a fairly recent emergent field, so I would like to thank and acknowledge the following fellow travelers:\n\n* Thanks to Allison Parrish, whose `pronouncing <https://github.com/aparrish/pronouncingpy>`_ package I used. Parrish's poetic computation projects and poetry, such as `Articulations <http://counterpathpress.org/articulations-allison-parrish>`_, have also been highly inspiring.\n* Leonard Richardson's `olipy <https://github.com/leonardr/olipy/>`_ is another generative text software library with similar (Oulipian) concerns to my own which experiments with Markov chains, Queneau assembly, and has other fun miscellaneous functions like swapping letters in a text with corrupt ASCII versions.\n* Riley Wong's `poetry theremin <https://github.com/rileynwong/rpi-poetry-generator>`_ transforms light sensor values into visual poems composed from words sampled from the poetry of the great modernist Mina Loy as well as Allen Ginsberg and William Carlos Williams, among others.\n\nTry now\n^^^^^^^\n\nColab (recommended for most)\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\nYou can install this software and launch the interactive menu for creating visual poems from the following `link <https://colab.research.google.com/drive/1eNTBSLMPpemYQq4n3keKCjVpw_JqY6w->`_ to a Jupyter notebook hosted on Google Colab.\n\nNote: this will only work on desktop and tablet effectively because of screen-size issues. Keep this readme open to consult for reference.\n\nOn Your Computer\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nAlternatively, if you install this on your own machine (see below), you can initalize the interactive menu by running the following command from a terminal/shell: generative-poetry-cli\n\nWhat is this?\n^^^^^^^^^^^^^\nThis software library contains various constraint-based procedures for stochastically generating `concrete poetry <https://en.wikipedia.org/wiki/Concrete_poetry>`_ (a.k.a. visual poetry) as a PDF or to the terminal. Most of these procedures are interactive and designed to be used and re-used once you learn to \"play the game\" by exploiting the rules of the procedure. All these procedures rely on common building blocks, after all. When you provide a list of input words, hidden algorithms find words related to those: phonetically or by way of meaning or context (more on this below). The words are then joined with various connectors depending on the procedure: random conjunctions and punctuation, related words (often creating stochastically generated puns and prosody as well as aberrations of syntax), mathematical symbols, uniform space, variable space.\n\nThe visual poems this produces are interesting for two reasons. As readers, we are trained to read horizontally and sometimes vertically, so we draw connections based on the spatial proximity of words on a page or on a screen. We also draw connections between words with similar meanings or similar sounds to one another. When reading many of these procedurally generated poems, it is easy to suspend one's disbelief and invent a context or reading for what is happening, or try to find a meaning or intention in a seemingly enigmatic or ambiguous word choice or phrasing when the execution of the code, which is not a human author, had no ascribed intents. In this sense, these poems are similar to abstract paintings in which paint is thrown onto the canvas, or to a Rorschach test. They are, for the most part, suggestive optical illusions, engineered by chance and a choice palette of words rather than paints. Nonetheless, the way some lines weave between prosody, pun, meaning, syntax and all these elements' destruction in pure nonsense creates an amusing and unique 21st century voice that reflects the chaotic nature of the Internet itself, home to literary gems and templated spam alike, and the questionable faith of many in the eventual emergence of a sentient artificial intelligence capable of thought and writing which adopts human concerns, style, and syntax.\n\nThis project was heavily inspired by Oulipo, the literary movement founded in 1960 short for a phrase best translated as \"workshop of potential literature\" whose ranks included Raymond Queneau, Italo Calvino, and Georges Perec. According to Marjorie Perloff, whose work on concrete poetry and copying Unoriginal Genius was also a great inspiration for this project, \"the Oulipo constraint is a generative device:  it creates a formal structure whose rules of composition are internalized so that the constraint in question is not only a rule but a thematic property of the poem.\" Due respect also must be given to Alastair Brotchie's `Book Of Surrealist Games <https://monoskop.org/images/e/e0/Brotchie_Alastair_Gooding_Mel_eds_A_Book_of_Surrealist_Games_1995.pdf>`_, which has taught me to keep experimenting and combining procedures, just as the Surrealist Groups have done in practice. The conceptual artist is often stereotyped as too wedded to the pure product of the procedure, but I find this attitude unhelpful; sometimes algorithmic output needs an edit, a remix, or some other medium touched by human hands to shine.\n\nBy way of example, here are five concrete poems from the same recipe I digitally collaged together using the same *procedure*: the words *paranoid*, *marinate*, *hysteria*, *radio*, *waves*, and *reverie*.\n\n.. image:: https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/collage.png\n\nHow do these procedures find related words, utilize random sampling, and filter out stuff like acronyms?\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\nThis project uses the CMU rhyming dictionary along with `Datamuse API <https://pypi.org/project/python-datamuse/>`_, which can find similar sounding words, similar meaning words, frequently following words, or contextually linked words for a given word. (A contextually linked word is a word that appears frequently on the Internet in the same document as another word: metamorphosis is contextually linked to the word Kafka, for example. However, CMU and Datamuse return many *extremely* archaic words (e.g. medieval English variants of words) as well as abbreviations, extremely uncommon words and abbreviations are mostly filtered out when the words are fetched.\n\nThis all occurs in the package's lexigen submodule, where, if you decide to import this to make your own generative text project, you can also tweak function parameters to have more or less Datamuse API results returned. Since Project Datamuse always orders their API results by relevancy (e.g. most to least similar sounding), it is possible to tweak the number of API results returned before this package randomly samples one of those words or a subset of those words in order to adjust the level of dynamism/chaos and structure/repetition in generated output.\n\nWhat are these artistic procedures and what can one make with them?\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\nTechnical Implementation of Futurist Literature\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nIn F.T. Marinetti's 1912 `Technical Manifesto of Futurist Literature <http://greeninteger.com/pdfs/marinetti-technical-manifesto-of-futurist-literature.pdf>`_, he proposes replacing conjunctions in language with mathematical operators and eliminating most parts of speech to make a poetry of becoming and shifting velocities. In many ways this manifesto anticipates the syntax of programming languages. This method of poem generation connects random phonetically related words together with mathematical operators.\n\nMarinetti took himself far too seriously, however. This project is more in the spirit of pataphysics which Alfred Jarry defined as \"the science of imaginary solutions, which symbolically attributes the properties of objects, described by their virtuality, to their lineaments\" (c.f. `Exploits and Opinions of Doctor Faustroll, Pataphysician <http://libgen.is/book/index.php?md5=213C8D9CFDF94D5CB849372FEE7D9C77>`_). This original 1894 meaning of 'virtuality' did not carry connotations of computation but instead those of the philosophy of his professor Henri Bergson, who attempted to rethink the metaphysics of space and time in terms of \"matter and memory,\" e.g. the matter of the world as we perceive it vs. the layers of connotations and relationships of meaning we inevitably bring into any act of perception, linguistic creatures that we are. Nonetheless today virtuality comprises the digital world as well, and it is fitting that Jarry also wrote: \"'Pataphysics will be, above all, the science of the particular, despite the common opinion that the only science is that of the general. 'Pataphysics will examine the laws governing exceptions, and will explain the universe supplementary to this one.\" I assure you this project implements exception handling. For more on the relationship between pataphysics and computation, see Andrew Hugill's `Pataphysics And Computing <http://andrewhugill.com/writings/Pataphysics%20and%20Computing.pdf>`_.\n\nBelow is an example \"Futurist poem\" concerning pataphysics and surrealism. The following words were given as input: *logic*, *dialectic*, *critical*, *surreal*, and *pataphysics*.\n\n.. image:: https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/futurist_pdf.png\n\nStochastic Jolastic: Markov Generation by Way of (Per)Mutation\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nThis is the most complex generative method--it takes user-provided words and first gets phonetically related words to those words. It then randomly selects one of these phonetically related words, finds all the phonetically related words to that word, and picks one of those twice-removed results to begin a poem line. As the algorithms continue writing the line, they apply word transformations to previous words in the poem line (e.g. randomly selected similar meaning word, similar sounding word, contextually linked word, or frequently following word--see below) and there is also a 25% chance that another one of these operations is applied to the intermediate result. This means that there are often tens of thousands of results for the next word in a poem. The poem generator also forces line endings to rhyme in couplets.\n\nThe resultant stochastic emergence of puns and plays on words and cycle between sense and nonsense along with syntactic structure and anarchy remind me of James Joyce's Finnegan's Wake but were moreso inspired by another less known manifesto by Joyce's publisher and defender, Eugene Jolas, whose short and moving 1929 `Revolution of the Word <http://jot101ok.blogspot.com/2015/06/revolution-of-word-modernist-manifesto.html>`_ argued the poet \"has the right to use words of his own fashioning and to disregard existing grammatical and syntactical laws.\" The generative implementation this Python package employs also occasionally switches world languages and makes cultural allusions (usually triggered by the frequently following word and contextually linked word functionality) which reminds me of Jolas' aspirations towards a Translatlantic multilingual poetry (for more on this, check out `this piece <http://writing.upenn.edu/epc/authors/perloff/jolas.html>`_ by Marjorie Perloff). Right now this occurs somewhat by accident--by errors in Project Datamuse's English vocabulary--but in the future this package will incorporate more world languages as Project Datamuse incorporates them, starting with Spanish, which was recently added to Project Datamuse.\n\nThis example poem was produced from the following input words: *anxious*, *spectacular*, *life*, *death*, *ascent*, *peace*, *tragedy*, and *love*.\n\n.. image:: https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/markov_pdf.png\n\nChaotic Concrete Poem\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nThis one's more abstract  but also more concrete, and by that I mean concrete poetry, which deals more with spatial arrangement and usually lacked syntax. The following words were given as input: *chaos*, *dissolve*, *fire*, *morph*, *devolve*, *shapeshifter*, *transient*, and *cluster*.\n\n.. image:: https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/chaotic_concrete_pdf.png\n\nCharacter Soup\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\nBut not as chaotic as this method of making \"character soup\". (This method of generation does not take input words.)\n\n.. image:: https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/character_soup_pdf.png\n\nStop Word Soup\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\nAnd this last one does the same thing but using stop words from NLTK along with \"verbal stop words\" like \"um\" and \"ahem.\" (This method of generation does not take input words.)\n\n.. image:: https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/stopword_soup_pdf.png\n\nUseful Submodule #1: lexigen.py\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\nThe submodule lexigen is likely useful outside of this application, as it controls random sampling of rhymes, similar sounding words, phonetically related words, similarly meaning words,  contextually linked words, and rare related words.\n\nWord Sampling\n\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nImport the relevant submodule first.\n\n.. code-block::\n\n   from generativepoetry.lexigen import *\n\nRhymes\n\"\"\"\"\"\"\n\n.. code-block::\n\n   rhymes('cool')  # all words that rhyme with cool\n   rhymes('cool', sample_size=6)  # 6 random words that rhyme with cool\n   rhyme('cool')  # 1 at random\n\nSimilar sounding words\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nA similar sounding word is a word that does not rhyme with a word but sounds similar.\n\n.. code-block::\n\n   # To get all of the similar sounding words according to Project Datamuse:\n   similar_sounding_word('cool', sample_size=None, datamuse_api_max=None)\n   # To get the top 10 similar sounding words and then randomly select 5 from that:\n   similar_sounding_words('cool', sample_size=5, datamuse_api_max=10)\n   # When not provided, sample_size defaults to 6, and datamuse_api_max defaults to 20.\n   # The same arguments can be optionally supplied to similar_sounding_word, which draws one word at random:\n   similar_sounding_word('cool', sample_size=3, datamuse_api_max=15)\n   similar_sounding_word('cool')\n\nPhonetically related words\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\nPhonetically related words are all of the rhymes and similar sounding words for a word or for a list of words\n\n.. code-block::\n\n   # It optionally accepts sample_size and datamuse_api_max to help the user control random sampling.\n   # Note that datamuse_api_max will only be used to control the number of similar meaning words\n   # initially fetched by the Datamuse API, however.\n   phonetically_related_words('slimy')\n   phonetically_related_words('slimy', sample_size=5, datamuse_api_max=15)\n   phonetically_related_words(['word', 'list'])\n   phonetically_related_words(['word', 'list'], sample_size=5, datamuse_api_max=15)\n\nSimilar meaning words\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\nThese include but aren't limited to synonyms; for example, spatula counts for spoon.\n\n.. code-block::\n\n   # To get all of the similar sounding words according to Project Datamuse:\n   similar_meaning_words('vampire', sample_size=None, datamuse_api_max=None)\n   # To get the top 10 similar sounding words and then randomly select 5 from that:\n   similar_meaning_words('vampire', sample_size=5, datamuse_api_max=10)\n   # When not provided, sample_size defaults to 6, and datamuse_api_max defaults to 20.\n   # The same arguments can be optionally supplied to similar_meaning_word, which draws one word at random:\n   similar_meaning_word('vampire', sample_size=8, datamuse_api_max=12)\n   similar_meaning_word('vampire')\n\nContextually linked words\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nThese are words that are often found in the same documents as a given word but don't necessarily have a related meaning. For example, metamorphosis and Kafka.\n\n.. code-block::\n\n   # To get all of the contextually linked words according to Project Datamuse:\n   contextually_linked_words('metamorphosis', sample_size=None, datamuse_api_max=None)\n   # To get the top 10 contextually linked words and then randomly select 5 from that:\n   contextually_linked_words('metamorphosis', sample_size=5, datamuse_api_max=10)\n   # When not provided, sample_size defaults to 6, and datamuse_api_max defaults to 20.\n   # The same arguments can be optionally supplied to contextually_linked_word, which draws one word at random:\n   contextually_linked_word('metamorphosis', sample_size=8, datamuse_api_max=12)\n   contextually_linked_word('metamorphosis')\n\nRelated rare words\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nFinds a random sample of the rarest words that are related to a given input word, either phonetically, contextually, or by meaning.\n\n.. code-block::\n\n   # To get all of the related words to a given word:\n   related_rare_words('spherical', sample_size=None, rare_word_population_max=None)\n   # To get the top 10 rarest words and then randomly select 5 from that:\n   related_rare_words('spherical', sample_size=5, rare_word_population_max=16)\n   # When not provided, sample_size defaults to 8, and rare_word_population_max defaults to 20.\n   # The same arguments can be optionally supplied to related_rare_word, which draws one word at random:\n   related_rare_word('spherical', sample_size=8, rare_word_population_max=12)\n   related_rare_word('spherical')\n\nFrequently following words\n\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\"\n\nThese are words that frequently follow a given word in Project Datamuse's corpora.\n\n.. code-block::\n\n   # To get all of the frequently following words according to Project Datamuse:\n   frequently_following_words('metamorphosis', sample_size=None, datamuse_api_max=None)\n   # To get the top 10 frequently following words and then randomly select 5 from that:\n   frequently_following_words('metamorphosis', sample_size=5, datamuse_api_max=10)\n   # When not provided, sample_size defaults to 6, and datamuse_api_max defaults to 20.\n   # The same arguments can be optionally supplied to frequently_following_word, which draws one word at random:\n   frequently_following_word('metamorphosis', sample_size=8, datamuse_api_max=12)\n   frequently_following_word('metamorphosis')\n\nUseful Submodule #2: decomposer.py\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\n\nThere are many ways to write. In `Unoriginal Genius <http://writing.upenn.edu/~taransky/unoriginalgenius.pdf>`_, Marjorie Perloff contrasts the notion of 'original genius'--the mythic author of old who realizes works from the depths of their intellectual solitude--to a counter-tradition of 'unoriginal genius' including acts of plagiaristic parody (also known as détournement) and patchwriting. T.S. Eliot, James Joyce, and Thomas Pynchon are all exemplars of this style, having written their seminal works with encyclopedias, magazine, newspaper clippings, and world literature open face, according to `Uncreative Writing <http://www.libgen.is/book/index.php?md5=3E70C36B115111E10E371C72864ADAB7>`_ by Kenneth Goldsmith.\n\nToday there are countless ways to transform texts with software: Markov chains, cut-ups, substituting words for related words, swapping out verbs between books, GPT-2, BERT, etc. Today's cybernetic author can harness these as decomposing agents, destroying original texts to create messy new mélange that can be further edited, expanded upon, or synthesised into an original, meaningful work.\n\nThis submodule This project elaborates on these ideas, allowing the user to:\n\n- sample random sentences and paragraphs from publicly available works of literature on **Project Gutenberg** and **Archive.org** or any text you give it.\n- swap words that share the same part of speech between two texts--for instance, swapping all of one text's adjectives with another's and one text's nouns with another's, preserving the structure of a narrative or discursive formation while wildly changing the content. Take, for example, this passage from Charles Dickens' *Great Expectations*, which transforms into surrealist horror when you replace the nouns and adjectives with those from a paragraph in H.P. Lovecraft's story *The Shunned House*:\n\n    \"It was then I began to understand that chimney in the eye had stopped, like the enveloping and the head, a human fungus ago. I noticed that Miss Havisham put down the height exactly on the time from which she had taken it up. As Estella dealt the streams, I glanced at the corpse-abhorrent again, and saw that the outline upon it, once few, now diseased, had never been worn. I glanced down at the sight from which the outline was insectoid, and saw that the half stocking on it, once few, now diseased, had been trodden ragged. Without this cosmos of thing, this standing still of all the worse monstrous attentions, not even the withered phosphorescent mist on the collapsed dissolving could have looked so like horror-mockings, or the human hideousness so like a horror.\"\n- run individual texts or list of texts through a Markov chain, semi-intelligently recombining the words in a more or less chaotic manner depending on n-gram size (which defaults to 1, the most chaotic).\n\n     Markov chain based generative algorithms like this one can create prose whose repetitions and permutations lend it a strange rhythm and which appears syntactically and semantically valid at first but eventually turns into nonsense. The Markov chain's formulaic yet sassy and subversive sstyle is quite similar Gertrude Stein's in `The Making Of Americans <gutenberg.net.au/ebooks16/1600671h.html>`_, which she explains in details in the essay `Composition as Explanation <https://www.poetryfoundation.org/articles/69481/composition-as-explanation>`_.\n- perform a virtual simulation of the `cut-up method <https://www.writing.upenn.edu/~afilreis/88v/burroughs-cutup.html>`_ pioneered by William S. Burroughs and Brion Gysin by breaking texts down into components of random length (where the minimum and and maximum length in words is preserved) and then randomly rearranging them.\n\nHow to Use\n^^^^^^^^^^\n\nFirst, populate the Project Gutenberg cache if you are not using the pre-built Docker image:\n\n.. code-block::\n\n   python3 populate_cache.py\n\nNext, import the library:\n\n.. code-block::\n\n   from prosedecomposer import *\n\nTo extract and clean the text from Project Gutenberg or Archive.org:\n\n.. code-block::\n\n   # From an Archive.org URL:\n   calvino_text = get_internet_archive_document('https://archive.org/stream/CalvinoItaloCosmicomics/Calvino-Italo-Cosmicomics_djvu.txt')\n   # From a Project Gutenberg URL:\n   alice_in_wonderland = get_gutenberg_document('https://www.gutenberg.org/ebooks/11')\n   # Select a random document from Project Gutenberg\n   random_gutenberg_text = random_gutenberg_document\n\nThe ParsedText class offers some functions for randomly sampling one or more sentences or paragraphs of a certain length:\n\n.. code-block::\n\n   parsed_calvino = ParsedText(calvino_text)\n   parsed_calvino.random_sentence()   # Returns a random sentence\n   parsed_calvino.random_sentence(minimum_tokens=25)  # Returns a random sentence of a guaranteed length in tokens\n   parsed_calvino.random_sentences()  # Returns 5 random sentences\n   parsed_calvino.random_sentences(num=7, minimum_tokens=25)  # Returns 7 random sentences of a guaranteed length\n   parsed_calvino.random_paragraph()  # Returns a random paragraph (of at least 3 sentence by default)\n   parsed_calvino.random_paragraph(minimum_sentences=5)  # Returns a paragraph with at least 5 sentences\n\nTo swap words with the same part(s) of speech between texts:\n\n.. code-block::\n\n   # Swap out adjectives and nouns between two random paragraphs of two random Gutenberg documents\n   doc1 = ParsedText(random_gutenberg_document())\n   doc2 = ParsedText(random_gutenberg_document())\n   swap_parts_of_speech(doc1.random_paragraph(), doc2.random_paragraph())\n   # Any of Spacy's part of speech tag values should work, though: https://spacy.io/api/annotation#pos-tagging\n   swap_parts_of_speech(doc1.random_paragraph(), doc2.random_paragraph(), parts_of_speech=[\"VERB\", \"CONJ\"])\n   # Since NLG has not yet been implemented, expect syntax errors like subject-verb agreement.\n\nTo run text(s) through Markov chain text processing algorithms, see below. You may want a bigger n-gram size (2 or 3)\nif you are processing a lot of text, i.e. one or several books/stories/etc at once.\n\n.. code-block::\n\n   output = markov(text)  # Just one text (defaults to n-gram size of 1 and 5 output sentences)\n   output = markov(text, ngram_size=3, num_output_sentence=7)  # Bigger n-gram size, more output sentences\n   output = markov([text1, text2, text3])  # List of text (defaults to n-gram size of 1 and 5 output sentences)\n   output = markov([text1, text2, text3], ngram_size=3, num_output_sentences=7)  # Bigger n-gram size, more outputs\n\nTo virtually cut up and rearrange the text:\n\n.. code-block::\n\n   # Cuts up a text into cutouts between 3 and 7 words and rearrange them randomly (returns a list of cutout strings)\n   cutouts = cutup(text)\n   # Cuts up a text into cutouts between 2 an 10 words and rearrange them randomly (returns a list of cutout strings)\n\nInstallation\n^^^^^^^^^^^^\n\nIf you just want to try the notebook, I recommend using Google Colab. However, if you wish to modify the code or use some of the above functions in a live Python console or your own project, you can install the package on your local machine following the instructions listed below.\n\nWindows\n\"\"\"\"\"\"\"\n\nBecause this library currently relies on the Python package hunspell, which does not support Windows, use Docker to launch a Linux-based container, then use pip to install, and enter the Python interactive shell within:\n\n.. code-block::\n\n   docker run -t -d python python3 -m pip install generativepoetry && python3\n\nOSX\n\"\"\"\n\nOSX users must install hunspell beforehand:\n\n.. code-block::\n\n   brew install hunspell\n\nThen download the en_US dictionary from http://wordlist.aspell.net/dicts/ and unzip it to /Library/Spelling/ and install using pip:\n\n.. code-block::\n\n   python3 -m pip install generativepoetry\n\nYou will also need Microsoft's core font TTF files in /Library/Fonts/.\n\nLinux\n\"\"\"\"\"\n\nUbuntu/Debian users should install hunspell-en-us and libhunspell-dev beforehand and then install with pip:\n\n.. code-block::\n\n   sudo apt-get install hunspell-en-us libhunspell-dev\n   python3 -m pip install generativepoetry\n\n\nMore Documentation\n^^^^^^^^^^^^^^^^^^\n\nRead documentation of library's classes & functions `here <https://generativepoetry.readthedocs.io>`_ .\n\n", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/coreybobco/generativepoetry-py", "keywords": "poetry", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "generativepoetry", "package_url": "https://pypi.org/project/generativepoetry/", "platform": "", "project_url": "https://pypi.org/project/generativepoetry/", "project_urls": {"Homepage": "https://github.com/coreybobco/generativepoetry-py"}, "release_url": "https://pypi.org/project/generativepoetry/0.3.4/", "requires_dist": ["console-menu (==0.6.0)", "Gutenberg (==0.8.0)", "hunspell (>=0.5.5)", "inflect (==4.1.0)", "internetarchive (==1.8.5)", "markovify (==0.8.0)", "nltk (==3.4.5)", "pdf2image (==1.12.1)", "rdflib (==4.2.2)", "pronouncing (>=0.2.0)", "python-datamuse (>=1.3.0)", "spacy (>=2.2.3)", "reportlab (>=3.5.26)", "unittest2 (==1.1.0)", "wordfreq (>=2.2.2)"], "requires_python": "", "summary": "A library primarily for procedurally generating visual poems", "version": "0.3.4", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>A library primarily for procedurally generating visual poems</p>\n<a href=\"https://travis-ci.org/coreybobco/generativepoetry-py\" rel=\"nofollow\"><img alt=\"Build Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/e1bcb7ffb51b5298e645c6262b47ef570dd46b2f/68747470733a2f2f7472617669732d63692e6f72672f636f726579626f62636f2f67656e65726174697665706f657472792d70792e7376673f6272616e63683d6d6173746572\"></a>\n<a href=\"https://coveralls.io/github/coreybobco/generativepoetry-py?branch=master\" rel=\"nofollow\"><img alt=\"Coverage Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8f80ff21036ee5715385be9e30be4aa6cfbffc22/68747470733a2f2f636f766572616c6c732e696f2f7265706f732f6769746875622f636f726579626f62636f2f67656e65726174697665706f657472792d70792f62616467652e7376673f6272616e63683d6d6173746572\"></a>\n<a href=\"https://badge.fury.io/py/generativepoetry\" rel=\"nofollow\"><img alt=\"https://badge.fury.io/py/generativepoetry.svg\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/3392341558331e28b27e29a6c1c0c6c8688b9bea/68747470733a2f2f62616467652e667572792e696f2f70792f67656e65726174697665706f657472792e737667\"></a>\n<div id=\"acknowledgements\">\n<h2>Acknowledgements</h2>\n<p>Conceptual writing handled by code is a fairly recent emergent field, so I would like to thank and acknowledge the following fellow travelers:</p>\n<ul>\n<li>Thanks to Allison Parrish, whose <a href=\"https://github.com/aparrish/pronouncingpy\" rel=\"nofollow\">pronouncing</a> package I used. Parrish’s poetic computation projects and poetry, such as <a href=\"http://counterpathpress.org/articulations-allison-parrish\" rel=\"nofollow\">Articulations</a>, have also been highly inspiring.</li>\n<li>Leonard Richardson’s <a href=\"https://github.com/leonardr/olipy/\" rel=\"nofollow\">olipy</a> is another generative text software library with similar (Oulipian) concerns to my own which experiments with Markov chains, Queneau assembly, and has other fun miscellaneous functions like swapping letters in a text with corrupt ASCII versions.</li>\n<li>Riley Wong’s <a href=\"https://github.com/rileynwong/rpi-poetry-generator\" rel=\"nofollow\">poetry theremin</a> transforms light sensor values into visual poems composed from words sampled from the poetry of the great modernist Mina Loy as well as Allen Ginsberg and William Carlos Williams, among others.</li>\n</ul>\n</div>\n<div id=\"try-now\">\n<h2>Try now</h2>\n<div id=\"colab-recommended-for-most\">\n<h3>Colab (recommended for most)</h3>\n<p>You can install this software and launch the interactive menu for creating visual poems from the following <a href=\"https://colab.research.google.com/drive/1eNTBSLMPpemYQq4n3keKCjVpw_JqY6w-\" rel=\"nofollow\">link</a> to a Jupyter notebook hosted on Google Colab.</p>\n<p>Note: this will only work on desktop and tablet effectively because of screen-size issues. Keep this readme open to consult for reference.</p>\n</div>\n<div id=\"on-your-computer\">\n<h3>On Your Computer</h3>\n<p>Alternatively, if you install this on your own machine (see below), you can initalize the interactive menu by running the following command from a terminal/shell: generative-poetry-cli</p>\n</div>\n</div>\n<div id=\"what-is-this\">\n<h2>What is this?</h2>\n<p>This software library contains various constraint-based procedures for stochastically generating <a href=\"https://en.wikipedia.org/wiki/Concrete_poetry\" rel=\"nofollow\">concrete poetry</a> (a.k.a. visual poetry) as a PDF or to the terminal. Most of these procedures are interactive and designed to be used and re-used once you learn to “play the game” by exploiting the rules of the procedure. All these procedures rely on common building blocks, after all. When you provide a list of input words, hidden algorithms find words related to those: phonetically or by way of meaning or context (more on this below). The words are then joined with various connectors depending on the procedure: random conjunctions and punctuation, related words (often creating stochastically generated puns and prosody as well as aberrations of syntax), mathematical symbols, uniform space, variable space.</p>\n<p>The visual poems this produces are interesting for two reasons. As readers, we are trained to read horizontally and sometimes vertically, so we draw connections based on the spatial proximity of words on a page or on a screen. We also draw connections between words with similar meanings or similar sounds to one another. When reading many of these procedurally generated poems, it is easy to suspend one’s disbelief and invent a context or reading for what is happening, or try to find a meaning or intention in a seemingly enigmatic or ambiguous word choice or phrasing when the execution of the code, which is not a human author, had no ascribed intents. In this sense, these poems are similar to abstract paintings in which paint is thrown onto the canvas, or to a Rorschach test. They are, for the most part, suggestive optical illusions, engineered by chance and a choice palette of words rather than paints. Nonetheless, the way some lines weave between prosody, pun, meaning, syntax and all these elements’ destruction in pure nonsense creates an amusing and unique 21st century voice that reflects the chaotic nature of the Internet itself, home to literary gems and templated spam alike, and the questionable faith of many in the eventual emergence of a sentient artificial intelligence capable of thought and writing which adopts human concerns, style, and syntax.</p>\n<p>This project was heavily inspired by Oulipo, the literary movement founded in 1960 short for a phrase best translated as “workshop of potential literature” whose ranks included Raymond Queneau, Italo Calvino, and Georges Perec. According to Marjorie Perloff, whose work on concrete poetry and copying Unoriginal Genius was also a great inspiration for this project, “the Oulipo constraint is a generative device:  it creates a formal structure whose rules of composition are internalized so that the constraint in question is not only a rule but a thematic property of the poem.” Due respect also must be given to Alastair Brotchie’s <a href=\"https://monoskop.org/images/e/e0/Brotchie_Alastair_Gooding_Mel_eds_A_Book_of_Surrealist_Games_1995.pdf\" rel=\"nofollow\">Book Of Surrealist Games</a>, which has taught me to keep experimenting and combining procedures, just as the Surrealist Groups have done in practice. The conceptual artist is often stereotyped as too wedded to the pure product of the procedure, but I find this attitude unhelpful; sometimes algorithmic output needs an edit, a remix, or some other medium touched by human hands to shine.</p>\n<p>By way of example, here are five concrete poems from the same recipe I digitally collaged together using the same <em>procedure</em>: the words <em>paranoid</em>, <em>marinate</em>, <em>hysteria</em>, <em>radio</em>, <em>waves</em>, and <em>reverie</em>.</p>\n<img alt=\"https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/collage.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/a93f3a03299cfc1067e3c48111727e21c6bfb4db/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f636f726579626f62636f2f67656e65726174697665706f657472792d70792f6d61737465722f6578616d706c655f696d616765732f636f6c6c6167652e706e67\">\n</div>\n<div id=\"how-do-these-procedures-find-related-words-utilize-random-sampling-and-filter-out-stuff-like-acronyms\">\n<h2>How do these procedures find related words, utilize random sampling, and filter out stuff like acronyms?</h2>\n<p>This project uses the CMU rhyming dictionary along with <a href=\"https://pypi.org/project/python-datamuse/\" rel=\"nofollow\">Datamuse API</a>, which can find similar sounding words, similar meaning words, frequently following words, or contextually linked words for a given word. (A contextually linked word is a word that appears frequently on the Internet in the same document as another word: metamorphosis is contextually linked to the word Kafka, for example. However, CMU and Datamuse return many <em>extremely</em> archaic words (e.g. medieval English variants of words) as well as abbreviations, extremely uncommon words and abbreviations are mostly filtered out when the words are fetched.</p>\n<p>This all occurs in the package’s lexigen submodule, where, if you decide to import this to make your own generative text project, you can also tweak function parameters to have more or less Datamuse API results returned. Since Project Datamuse always orders their API results by relevancy (e.g. most to least similar sounding), it is possible to tweak the number of API results returned before this package randomly samples one of those words or a subset of those words in order to adjust the level of dynamism/chaos and structure/repetition in generated output.</p>\n</div>\n<div id=\"what-are-these-artistic-procedures-and-what-can-one-make-with-them\">\n<h2>What are these artistic procedures and what can one make with them?</h2>\n<div id=\"technical-implementation-of-futurist-literature\">\n<h3>Technical Implementation of Futurist Literature</h3>\n<p>In F.T. Marinetti’s 1912 <a href=\"http://greeninteger.com/pdfs/marinetti-technical-manifesto-of-futurist-literature.pdf\" rel=\"nofollow\">Technical Manifesto of Futurist Literature</a>, he proposes replacing conjunctions in language with mathematical operators and eliminating most parts of speech to make a poetry of becoming and shifting velocities. In many ways this manifesto anticipates the syntax of programming languages. This method of poem generation connects random phonetically related words together with mathematical operators.</p>\n<p>Marinetti took himself far too seriously, however. This project is more in the spirit of pataphysics which Alfred Jarry defined as “the science of imaginary solutions, which symbolically attributes the properties of objects, described by their virtuality, to their lineaments” (c.f. <a href=\"http://libgen.is/book/index.php?md5=213C8D9CFDF94D5CB849372FEE7D9C77\" rel=\"nofollow\">Exploits and Opinions of Doctor Faustroll, Pataphysician</a>). This original 1894 meaning of ‘virtuality’ did not carry connotations of computation but instead those of the philosophy of his professor Henri Bergson, who attempted to rethink the metaphysics of space and time in terms of “matter and memory,” e.g. the matter of the world as we perceive it vs. the layers of connotations and relationships of meaning we inevitably bring into any act of perception, linguistic creatures that we are. Nonetheless today virtuality comprises the digital world as well, and it is fitting that Jarry also wrote: “‘Pataphysics will be, above all, the science of the particular, despite the common opinion that the only science is that of the general. ‘Pataphysics will examine the laws governing exceptions, and will explain the universe supplementary to this one.” I assure you this project implements exception handling. For more on the relationship between pataphysics and computation, see Andrew Hugill’s <a href=\"http://andrewhugill.com/writings/Pataphysics%20and%20Computing.pdf\" rel=\"nofollow\">Pataphysics And Computing</a>.</p>\n<p>Below is an example “Futurist poem” concerning pataphysics and surrealism. The following words were given as input: <em>logic</em>, <em>dialectic</em>, <em>critical</em>, <em>surreal</em>, and <em>pataphysics</em>.</p>\n<img alt=\"https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/futurist_pdf.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/5883180a6ffd05238bb6c2f6cdf7f82b61c00ac8/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f636f726579626f62636f2f67656e65726174697665706f657472792d70792f6d61737465722f6578616d706c655f696d616765732f66757475726973745f7064662e706e67\">\n</div>\n<div id=\"stochastic-jolastic-markov-generation-by-way-of-per-mutation\">\n<h3>Stochastic Jolastic: Markov Generation by Way of (Per)Mutation</h3>\n<p>This is the most complex generative method–it takes user-provided words and first gets phonetically related words to those words. It then randomly selects one of these phonetically related words, finds all the phonetically related words to that word, and picks one of those twice-removed results to begin a poem line. As the algorithms continue writing the line, they apply word transformations to previous words in the poem line (e.g. randomly selected similar meaning word, similar sounding word, contextually linked word, or frequently following word–see below) and there is also a 25% chance that another one of these operations is applied to the intermediate result. This means that there are often tens of thousands of results for the next word in a poem. The poem generator also forces line endings to rhyme in couplets.</p>\n<p>The resultant stochastic emergence of puns and plays on words and cycle between sense and nonsense along with syntactic structure and anarchy remind me of James Joyce’s Finnegan’s Wake but were moreso inspired by another less known manifesto by Joyce’s publisher and defender, Eugene Jolas, whose short and moving 1929 <a href=\"http://jot101ok.blogspot.com/2015/06/revolution-of-word-modernist-manifesto.html\" rel=\"nofollow\">Revolution of the Word</a> argued the poet “has the right to use words of his own fashioning and to disregard existing grammatical and syntactical laws.” The generative implementation this Python package employs also occasionally switches world languages and makes cultural allusions (usually triggered by the frequently following word and contextually linked word functionality) which reminds me of Jolas’ aspirations towards a Translatlantic multilingual poetry (for more on this, check out <a href=\"http://writing.upenn.edu/epc/authors/perloff/jolas.html\" rel=\"nofollow\">this piece</a> by Marjorie Perloff). Right now this occurs somewhat by accident–by errors in Project Datamuse’s English vocabulary–but in the future this package will incorporate more world languages as Project Datamuse incorporates them, starting with Spanish, which was recently added to Project Datamuse.</p>\n<p>This example poem was produced from the following input words: <em>anxious</em>, <em>spectacular</em>, <em>life</em>, <em>death</em>, <em>ascent</em>, <em>peace</em>, <em>tragedy</em>, and <em>love</em>.</p>\n<img alt=\"https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/markov_pdf.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/09b1f5be7817d5c6cc34e313b38cfda4ddeb1f05/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f636f726579626f62636f2f67656e65726174697665706f657472792d70792f6d61737465722f6578616d706c655f696d616765732f6d61726b6f765f7064662e706e67\">\n</div>\n<div id=\"chaotic-concrete-poem\">\n<h3>Chaotic Concrete Poem</h3>\n<p>This one’s more abstract  but also more concrete, and by that I mean concrete poetry, which deals more with spatial arrangement and usually lacked syntax. The following words were given as input: <em>chaos</em>, <em>dissolve</em>, <em>fire</em>, <em>morph</em>, <em>devolve</em>, <em>shapeshifter</em>, <em>transient</em>, and <em>cluster</em>.</p>\n<img alt=\"https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/chaotic_concrete_pdf.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/558ba1c4eae97ac948934be3f872c85c4b27ced1/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f636f726579626f62636f2f67656e65726174697665706f657472792d70792f6d61737465722f6578616d706c655f696d616765732f6368616f7469635f636f6e63726574655f7064662e706e67\">\n</div>\n<div id=\"character-soup\">\n<h3>Character Soup</h3>\n<p>But not as chaotic as this method of making “character soup”. (This method of generation does not take input words.)</p>\n<img alt=\"https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/character_soup_pdf.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/0effd6a1c137b60d9f3d0cd0780e86ae2527ac05/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f636f726579626f62636f2f67656e65726174697665706f657472792d70792f6d61737465722f6578616d706c655f696d616765732f6368617261637465725f736f75705f7064662e706e67\">\n</div>\n<div id=\"stop-word-soup\">\n<h3>Stop Word Soup</h3>\n<p>And this last one does the same thing but using stop words from NLTK along with “verbal stop words” like “um” and “ahem.” (This method of generation does not take input words.)</p>\n<img alt=\"https://raw.githubusercontent.com/coreybobco/generativepoetry-py/master/example_images/stopword_soup_pdf.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/dcdc0e01692b33dc511770643be2a359cb9b791c/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f636f726579626f62636f2f67656e65726174697665706f657472792d70792f6d61737465722f6578616d706c655f696d616765732f73746f70776f72645f736f75705f7064662e706e67\">\n</div>\n</div>\n<div id=\"useful-submodule-1-lexigen-py\">\n<h2>Useful Submodule #1: lexigen.py</h2>\n<p>The submodule lexigen is likely useful outside of this application, as it controls random sampling of rhymes, similar sounding words, phonetically related words, similarly meaning words,  contextually linked words, and rare related words.</p>\n<div id=\"word-sampling\">\n<h3>Word Sampling</h3>\n<p>Import the relevant submodule first.</p>\n<pre>from generativepoetry.lexigen import *\n</pre>\n</div>\n<div id=\"rhymes\">\n<h3>Rhymes</h3>\n<pre>rhymes('cool')  # all words that rhyme with cool\nrhymes('cool', sample_size=6)  # 6 random words that rhyme with cool\nrhyme('cool')  # 1 at random\n</pre>\n</div>\n<div id=\"similar-sounding-words\">\n<h3>Similar sounding words</h3>\n<p>A similar sounding word is a word that does not rhyme with a word but sounds similar.</p>\n<pre># To get all of the similar sounding words according to Project Datamuse:\nsimilar_sounding_word('cool', sample_size=None, datamuse_api_max=None)\n# To get the top 10 similar sounding words and then randomly select 5 from that:\nsimilar_sounding_words('cool', sample_size=5, datamuse_api_max=10)\n# When not provided, sample_size defaults to 6, and datamuse_api_max defaults to 20.\n# The same arguments can be optionally supplied to similar_sounding_word, which draws one word at random:\nsimilar_sounding_word('cool', sample_size=3, datamuse_api_max=15)\nsimilar_sounding_word('cool')\n</pre>\n</div>\n<div id=\"phonetically-related-words\">\n<h3>Phonetically related words</h3>\n<p>Phonetically related words are all of the rhymes and similar sounding words for a word or for a list of words</p>\n<pre># It optionally accepts sample_size and datamuse_api_max to help the user control random sampling.\n# Note that datamuse_api_max will only be used to control the number of similar meaning words\n# initially fetched by the Datamuse API, however.\nphonetically_related_words('slimy')\nphonetically_related_words('slimy', sample_size=5, datamuse_api_max=15)\nphonetically_related_words(['word', 'list'])\nphonetically_related_words(['word', 'list'], sample_size=5, datamuse_api_max=15)\n</pre>\n</div>\n<div id=\"similar-meaning-words\">\n<h3>Similar meaning words</h3>\n<p>These include but aren’t limited to synonyms; for example, spatula counts for spoon.</p>\n<pre># To get all of the similar sounding words according to Project Datamuse:\nsimilar_meaning_words('vampire', sample_size=None, datamuse_api_max=None)\n# To get the top 10 similar sounding words and then randomly select 5 from that:\nsimilar_meaning_words('vampire', sample_size=5, datamuse_api_max=10)\n# When not provided, sample_size defaults to 6, and datamuse_api_max defaults to 20.\n# The same arguments can be optionally supplied to similar_meaning_word, which draws one word at random:\nsimilar_meaning_word('vampire', sample_size=8, datamuse_api_max=12)\nsimilar_meaning_word('vampire')\n</pre>\n</div>\n<div id=\"contextually-linked-words\">\n<h3>Contextually linked words</h3>\n<p>These are words that are often found in the same documents as a given word but don’t necessarily have a related meaning. For example, metamorphosis and Kafka.</p>\n<pre># To get all of the contextually linked words according to Project Datamuse:\ncontextually_linked_words('metamorphosis', sample_size=None, datamuse_api_max=None)\n# To get the top 10 contextually linked words and then randomly select 5 from that:\ncontextually_linked_words('metamorphosis', sample_size=5, datamuse_api_max=10)\n# When not provided, sample_size defaults to 6, and datamuse_api_max defaults to 20.\n# The same arguments can be optionally supplied to contextually_linked_word, which draws one word at random:\ncontextually_linked_word('metamorphosis', sample_size=8, datamuse_api_max=12)\ncontextually_linked_word('metamorphosis')\n</pre>\n</div>\n<div id=\"related-rare-words\">\n<h3>Related rare words</h3>\n<p>Finds a random sample of the rarest words that are related to a given input word, either phonetically, contextually, or by meaning.</p>\n<pre># To get all of the related words to a given word:\nrelated_rare_words('spherical', sample_size=None, rare_word_population_max=None)\n# To get the top 10 rarest words and then randomly select 5 from that:\nrelated_rare_words('spherical', sample_size=5, rare_word_population_max=16)\n# When not provided, sample_size defaults to 8, and rare_word_population_max defaults to 20.\n# The same arguments can be optionally supplied to related_rare_word, which draws one word at random:\nrelated_rare_word('spherical', sample_size=8, rare_word_population_max=12)\nrelated_rare_word('spherical')\n</pre>\n</div>\n<div id=\"frequently-following-words\">\n<h3>Frequently following words</h3>\n<p>These are words that frequently follow a given word in Project Datamuse’s corpora.</p>\n<pre># To get all of the frequently following words according to Project Datamuse:\nfrequently_following_words('metamorphosis', sample_size=None, datamuse_api_max=None)\n# To get the top 10 frequently following words and then randomly select 5 from that:\nfrequently_following_words('metamorphosis', sample_size=5, datamuse_api_max=10)\n# When not provided, sample_size defaults to 6, and datamuse_api_max defaults to 20.\n# The same arguments can be optionally supplied to frequently_following_word, which draws one word at random:\nfrequently_following_word('metamorphosis', sample_size=8, datamuse_api_max=12)\nfrequently_following_word('metamorphosis')\n</pre>\n</div>\n</div>\n<div id=\"useful-submodule-2-decomposer-py\">\n<h2>Useful Submodule #2: decomposer.py</h2>\n<p>There are many ways to write. In <a href=\"http://writing.upenn.edu/~taransky/unoriginalgenius.pdf\" rel=\"nofollow\">Unoriginal Genius</a>, Marjorie Perloff contrasts the notion of ‘original genius’–the mythic author of old who realizes works from the depths of their intellectual solitude–to a counter-tradition of ‘unoriginal genius’ including acts of plagiaristic parody (also known as détournement) and patchwriting. T.S. Eliot, James Joyce, and Thomas Pynchon are all exemplars of this style, having written their seminal works with encyclopedias, magazine, newspaper clippings, and world literature open face, according to <a href=\"http://www.libgen.is/book/index.php?md5=3E70C36B115111E10E371C72864ADAB7\" rel=\"nofollow\">Uncreative Writing</a> by Kenneth Goldsmith.</p>\n<p>Today there are countless ways to transform texts with software: Markov chains, cut-ups, substituting words for related words, swapping out verbs between books, GPT-2, BERT, etc. Today’s cybernetic author can harness these as decomposing agents, destroying original texts to create messy new mélange that can be further edited, expanded upon, or synthesised into an original, meaningful work.</p>\n<p>This submodule This project elaborates on these ideas, allowing the user to:</p>\n<ul>\n<li><p>sample random sentences and paragraphs from publicly available works of literature on <strong>Project Gutenberg</strong> and <strong>Archive.org</strong> or any text you give it.</p>\n</li>\n<li><p>swap words that share the same part of speech between two texts–for instance, swapping all of one text’s adjectives with another’s and one text’s nouns with another’s, preserving the structure of a narrative or discursive formation while wildly changing the content. Take, for example, this passage from Charles Dickens’ <em>Great Expectations</em>, which transforms into surrealist horror when you replace the nouns and adjectives with those from a paragraph in H.P. Lovecraft’s story <em>The Shunned House</em>:</p>\n<blockquote>\n<p>“It was then I began to understand that chimney in the eye had stopped, like the enveloping and the head, a human fungus ago. I noticed that Miss Havisham put down the height exactly on the time from which she had taken it up. As Estella dealt the streams, I glanced at the corpse-abhorrent again, and saw that the outline upon it, once few, now diseased, had never been worn. I glanced down at the sight from which the outline was insectoid, and saw that the half stocking on it, once few, now diseased, had been trodden ragged. Without this cosmos of thing, this standing still of all the worse monstrous attentions, not even the withered phosphorescent mist on the collapsed dissolving could have looked so like horror-mockings, or the human hideousness so like a horror.”</p>\n</blockquote>\n</li>\n<li><p>run individual texts or list of texts through a Markov chain, semi-intelligently recombining the words in a more or less chaotic manner depending on n-gram size (which defaults to 1, the most chaotic).</p>\n<blockquote>\n<p>Markov chain based generative algorithms like this one can create prose whose repetitions and permutations lend it a strange rhythm and which appears syntactically and semantically valid at first but eventually turns into nonsense. The Markov chain’s formulaic yet sassy and subversive sstyle is quite similar Gertrude Stein’s in <a href=\"gutenberg.net.au/ebooks16/1600671h.html\" rel=\"nofollow\">The Making Of Americans</a>, which she explains in details in the essay <a href=\"https://www.poetryfoundation.org/articles/69481/composition-as-explanation\" rel=\"nofollow\">Composition as Explanation</a>.</p>\n</blockquote>\n</li>\n<li><p>perform a virtual simulation of the <a href=\"https://www.writing.upenn.edu/~afilreis/88v/burroughs-cutup.html\" rel=\"nofollow\">cut-up method</a> pioneered by William S. Burroughs and Brion Gysin by breaking texts down into components of random length (where the minimum and and maximum length in words is preserved) and then randomly rearranging them.</p>\n</li>\n</ul>\n</div>\n<div id=\"how-to-use\">\n<h2>How to Use</h2>\n<p>First, populate the Project Gutenberg cache if you are not using the pre-built Docker image:</p>\n<pre>python3 populate_cache.py\n</pre>\n<p>Next, import the library:</p>\n<pre>from prosedecomposer import *\n</pre>\n<p>To extract and clean the text from Project Gutenberg or Archive.org:</p>\n<pre># From an Archive.org URL:\ncalvino_text = get_internet_archive_document('https://archive.org/stream/CalvinoItaloCosmicomics/Calvino-Italo-Cosmicomics_djvu.txt')\n# From a Project Gutenberg URL:\nalice_in_wonderland = get_gutenberg_document('https://www.gutenberg.org/ebooks/11')\n# Select a random document from Project Gutenberg\nrandom_gutenberg_text = random_gutenberg_document\n</pre>\n<p>The ParsedText class offers some functions for randomly sampling one or more sentences or paragraphs of a certain length:</p>\n<pre>parsed_calvino = ParsedText(calvino_text)\nparsed_calvino.random_sentence()   # Returns a random sentence\nparsed_calvino.random_sentence(minimum_tokens=25)  # Returns a random sentence of a guaranteed length in tokens\nparsed_calvino.random_sentences()  # Returns 5 random sentences\nparsed_calvino.random_sentences(num=7, minimum_tokens=25)  # Returns 7 random sentences of a guaranteed length\nparsed_calvino.random_paragraph()  # Returns a random paragraph (of at least 3 sentence by default)\nparsed_calvino.random_paragraph(minimum_sentences=5)  # Returns a paragraph with at least 5 sentences\n</pre>\n<p>To swap words with the same part(s) of speech between texts:</p>\n<pre># Swap out adjectives and nouns between two random paragraphs of two random Gutenberg documents\ndoc1 = ParsedText(random_gutenberg_document())\ndoc2 = ParsedText(random_gutenberg_document())\nswap_parts_of_speech(doc1.random_paragraph(), doc2.random_paragraph())\n# Any of Spacy's part of speech tag values should work, though: https://spacy.io/api/annotation#pos-tagging\nswap_parts_of_speech(doc1.random_paragraph(), doc2.random_paragraph(), parts_of_speech=[\"VERB\", \"CONJ\"])\n# Since NLG has not yet been implemented, expect syntax errors like subject-verb agreement.\n</pre>\n<p>To run text(s) through Markov chain text processing algorithms, see below. You may want a bigger n-gram size (2 or 3)\nif you are processing a lot of text, i.e. one or several books/stories/etc at once.</p>\n<pre>output = markov(text)  # Just one text (defaults to n-gram size of 1 and 5 output sentences)\noutput = markov(text, ngram_size=3, num_output_sentence=7)  # Bigger n-gram size, more output sentences\noutput = markov([text1, text2, text3])  # List of text (defaults to n-gram size of 1 and 5 output sentences)\noutput = markov([text1, text2, text3], ngram_size=3, num_output_sentences=7)  # Bigger n-gram size, more outputs\n</pre>\n<p>To virtually cut up and rearrange the text:</p>\n<pre># Cuts up a text into cutouts between 3 and 7 words and rearrange them randomly (returns a list of cutout strings)\ncutouts = cutup(text)\n# Cuts up a text into cutouts between 2 an 10 words and rearrange them randomly (returns a list of cutout strings)\n</pre>\n</div>\n<div id=\"installation\">\n<h2>Installation</h2>\n<p>If you just want to try the notebook, I recommend using Google Colab. However, if you wish to modify the code or use some of the above functions in a live Python console or your own project, you can install the package on your local machine following the instructions listed below.</p>\n<div id=\"windows\">\n<h3>Windows</h3>\n<p>Because this library currently relies on the Python package hunspell, which does not support Windows, use Docker to launch a Linux-based container, then use pip to install, and enter the Python interactive shell within:</p>\n<pre>docker run -t -d python python3 -m pip install generativepoetry &amp;&amp; python3\n</pre>\n</div>\n<div id=\"osx\">\n<h3>OSX</h3>\n<p>OSX users must install hunspell beforehand:</p>\n<pre>brew install hunspell\n</pre>\n<p>Then download the en_US dictionary from <a href=\"http://wordlist.aspell.net/dicts/\" rel=\"nofollow\">http://wordlist.aspell.net/dicts/</a> and unzip it to /Library/Spelling/ and install using pip:</p>\n<pre>python3 -m pip install generativepoetry\n</pre>\n<p>You will also need Microsoft’s core font TTF files in /Library/Fonts/.</p>\n</div>\n<div id=\"linux\">\n<h3>Linux</h3>\n<p>Ubuntu/Debian users should install hunspell-en-us and libhunspell-dev beforehand and then install with pip:</p>\n<pre>sudo apt-get install hunspell-en-us libhunspell-dev\npython3 -m pip install generativepoetry\n</pre>\n</div>\n</div>\n<div id=\"more-documentation\">\n<h2>More Documentation</h2>\n<p>Read documentation of library’s classes &amp; functions <a href=\"https://generativepoetry.readthedocs.io\" rel=\"nofollow\">here</a> .</p>\n</div>\n\n          </div>"}, "last_serial": 6866892, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "a6bb8421a3db599aa66d69a1eb96e047", "sha256": "f874f5efdcd155fff33d0ae8437434d87ea5adf2f88b3110378c85d74fa901f6"}, "downloads": -1, "filename": "generativepoetry-0.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "a6bb8421a3db599aa66d69a1eb96e047", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 7939, "upload_time": "2019-07-27T00:30:26", "upload_time_iso_8601": "2019-07-27T00:30:26.599461Z", "url": "https://files.pythonhosted.org/packages/c7/d8/96584d9e0813e6edbb39e6639d178a62a579b686cc4607e8878206cac411/generativepoetry-0.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0f76f3eeaca2ceee7f7b6bb877efe654", "sha256": "5b3d5a5e1d915cef0d7a00b1432cf304d70deacaaf022953907cf6deaf1a7854"}, "downloads": -1, "filename": "generativepoetry-0.1.0.tar.gz", "has_sig": false, "md5_digest": "0f76f3eeaca2ceee7f7b6bb877efe654", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6804, "upload_time": "2019-07-27T00:30:29", "upload_time_iso_8601": "2019-07-27T00:30:29.104248Z", "url": "https://files.pythonhosted.org/packages/14/3c/f0dae1aa69e9eaf258e4b68471d549f4940042cbda5e12027b1d7ca45daf/generativepoetry-0.1.0.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "6eb75881e6fc8662e8b47fb394944e19", "sha256": "43cb00b74105e039cec1274bc9dc83df670ad93af18f1688cb6193fbd9c4049e"}, "downloads": -1, "filename": "generativepoetry-0.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "6eb75881e6fc8662e8b47fb394944e19", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 8767, "upload_time": "2019-07-30T05:01:29", "upload_time_iso_8601": "2019-07-30T05:01:29.609317Z", "url": "https://files.pythonhosted.org/packages/82/86/da0af8f1e7e6bb08607c9375a8f14b6e0c4484a1b7bc6c942d8d5da683b9/generativepoetry-0.1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "071fd7f58e9c334fca2dc2998ce42e5a", "sha256": "eadc99dbc23be4fb2eb9306d5880c5ec58cd2088d41e1c62f50821d53e435200"}, "downloads": -1, "filename": "generativepoetry-0.1.1.tar.gz", "has_sig": false, "md5_digest": "071fd7f58e9c334fca2dc2998ce42e5a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8501, "upload_time": "2019-07-30T05:01:31", "upload_time_iso_8601": "2019-07-30T05:01:31.614852Z", "url": "https://files.pythonhosted.org/packages/d9/07/4e69eaae48de7f602ecccbf4b700660af5bc5c8fd052eb4febb45678961a/generativepoetry-0.1.1.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "2ae2748d00442a8dbf3d307250ee03e3", "sha256": "40d2c52877fac63519015a9635b94aa8f31c43c834511b1234a14bec8a2301e2"}, "downloads": -1, "filename": "generativepoetry-0.1.2-py3-none-any.whl", "has_sig": false, "md5_digest": "2ae2748d00442a8dbf3d307250ee03e3", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 8789, "upload_time": "2019-07-30T05:08:47", "upload_time_iso_8601": "2019-07-30T05:08:47.931980Z", "url": "https://files.pythonhosted.org/packages/41/ad/69d8cf2c98641d6cd4cb0f9543ffe9dbcffe97df76b34243c8201a119a27/generativepoetry-0.1.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "92dd95dc4d0f316f0ad2ac2be8802055", "sha256": "9f3c966d605f01744a4cdb489379801dab1edffb9e2ff1f6b80bb37899329046"}, "downloads": -1, "filename": "generativepoetry-0.1.2.tar.gz", "has_sig": false, "md5_digest": "92dd95dc4d0f316f0ad2ac2be8802055", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8517, "upload_time": "2019-07-30T05:08:49", "upload_time_iso_8601": "2019-07-30T05:08:49.572073Z", "url": "https://files.pythonhosted.org/packages/50/fb/e09919c0b759ef373c21df0ea8982af7c811e56977c9e2e5d1ed3953c8af/generativepoetry-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "67a08ffc7e3e5d8782191429dda615d3", "sha256": "298e8a302b1c59b223e24705ba3f33fd6d56de131d1bde4bc96ccfd80198f9e6"}, "downloads": -1, "filename": "generativepoetry-0.1.3-py3-none-any.whl", "has_sig": false, "md5_digest": "67a08ffc7e3e5d8782191429dda615d3", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 9239, "upload_time": "2019-08-19T01:09:38", "upload_time_iso_8601": "2019-08-19T01:09:38.511093Z", "url": "https://files.pythonhosted.org/packages/09/43/8926d62751870fefdbcdb70a453d95171677696813fb7d9126ea107d434d/generativepoetry-0.1.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "c8508f35a1f5c7e5f3ee0aef9b08ce28", "sha256": "8dee68a8b2cd12a55d837ea824dff3025032dc5060d989ff15a6051249a5f04e"}, "downloads": -1, "filename": "generativepoetry-0.1.3.tar.gz", "has_sig": false, "md5_digest": "c8508f35a1f5c7e5f3ee0aef9b08ce28", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9074, "upload_time": "2019-08-19T01:09:40", "upload_time_iso_8601": "2019-08-19T01:09:40.275636Z", "url": "https://files.pythonhosted.org/packages/1e/49/bb6cd3a930c377876e606c51c1eea34a22d0991415e8784d5d3e4e369d35/generativepoetry-0.1.3.tar.gz", "yanked": false}], "0.2.0": [{"comment_text": "", "digests": {"md5": "afcd1f57b8764b97b2e39471a33edaa1", "sha256": "12982de862605107d9ef4226f7ad2e29946e75ed321ac08f03b3395bb7a32743"}, "downloads": -1, "filename": "generativepoetry-0.2.0-py3-none-any.whl", "has_sig": false, "md5_digest": "afcd1f57b8764b97b2e39471a33edaa1", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 22003, "upload_time": "2020-01-14T03:25:43", "upload_time_iso_8601": "2020-01-14T03:25:43.590963Z", "url": "https://files.pythonhosted.org/packages/a0/f7/764fd1030e772f9692a84634273b101e49a5fef34b490bf4559049150dab/generativepoetry-0.2.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a636bee416e8c5a74c26b338e8baa069", "sha256": "9cb09ddceeef5c5c79a00725464b07272ea8d6f05e5efcbd774210c0f1b3db58"}, "downloads": -1, "filename": "generativepoetry-0.2.0.tar.gz", "has_sig": false, "md5_digest": "a636bee416e8c5a74c26b338e8baa069", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26167, "upload_time": "2020-01-14T03:25:45", "upload_time_iso_8601": "2020-01-14T03:25:45.529169Z", "url": "https://files.pythonhosted.org/packages/d0/13/794602a35d7d2bd1236904314091ea3e913de0031944027c7db5191f115f/generativepoetry-0.2.0.tar.gz", "yanked": false}], "0.2.1": [{"comment_text": "", "digests": {"md5": "dc692e7b828bffe646fd3f259d5c0f7e", "sha256": "211c995329c0b9d07cbaa9e96f52ec9674c2a14057c96c8fa5a3cb2037ff7786"}, "downloads": -1, "filename": "generativepoetry-0.2.1-py3-none-any.whl", "has_sig": false, "md5_digest": "dc692e7b828bffe646fd3f259d5c0f7e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 25319, "upload_time": "2020-02-13T05:30:05", "upload_time_iso_8601": "2020-02-13T05:30:05.561984Z", "url": "https://files.pythonhosted.org/packages/48/f5/8ca6ee9d4a5ca538f2a53bf0c8635e2dddc2d150a62075a24e60cbf7f00d/generativepoetry-0.2.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "2b80afdd9a981e1b46cafd7cf963c920", "sha256": "0659d0a56d1df3ae158a43fe2aab1fa7b5000b2e27b6c97acdd258966cc6da63"}, "downloads": -1, "filename": "generativepoetry-0.2.1.tar.gz", "has_sig": false, "md5_digest": "2b80afdd9a981e1b46cafd7cf963c920", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1108032, "upload_time": "2020-02-13T05:30:08", "upload_time_iso_8601": "2020-02-13T05:30:08.138784Z", "url": "https://files.pythonhosted.org/packages/3f/38/6c558e94627a5a6c6083318fbeb6a7c79baf36f2df294bf52dab10697b9f/generativepoetry-0.2.1.tar.gz", "yanked": false}], "0.2.2": [{"comment_text": "", "digests": {"md5": "b40a5ccfc747b7da770bcb05e649ad82", "sha256": "067fcd7af66f097b15582994a98178b6b7c9a0a412eb8676fc920ed2e31e9812"}, "downloads": -1, "filename": "generativepoetry-0.2.2-py3-none-any.whl", "has_sig": false, "md5_digest": "b40a5ccfc747b7da770bcb05e649ad82", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 25349, "upload_time": "2020-02-13T05:53:20", "upload_time_iso_8601": "2020-02-13T05:53:20.334700Z", "url": "https://files.pythonhosted.org/packages/bc/1c/ed7111ef7fb94fad3e724c9c1572436e045084d2611d183af11d682a9a84/generativepoetry-0.2.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1ecfc7d4210d16a5903c808c5ba15600", "sha256": "b4b66b97cec27767e55b6624794608bd94129df10016154d4213e0878d10dd89"}, "downloads": -1, "filename": "generativepoetry-0.2.2.tar.gz", "has_sig": false, "md5_digest": "1ecfc7d4210d16a5903c808c5ba15600", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1108064, "upload_time": "2020-02-13T05:53:22", "upload_time_iso_8601": "2020-02-13T05:53:22.208481Z", "url": "https://files.pythonhosted.org/packages/e0/2f/bb65a6ca479defb489e691b97fea21de7428c9db3ed563a6812c48e7d775/generativepoetry-0.2.2.tar.gz", "yanked": false}], "0.2.3": [{"comment_text": "", "digests": {"md5": "eab53474f69cf02c4ac49beee43b3d57", "sha256": "f2dde7b010171123b26b7aa11d7097ba9ee6c4a74777338a936af4a1f98aa08a"}, "downloads": -1, "filename": "generativepoetry-0.2.3-py3-none-any.whl", "has_sig": false, "md5_digest": "eab53474f69cf02c4ac49beee43b3d57", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 25322, "upload_time": "2020-02-13T06:55:52", "upload_time_iso_8601": "2020-02-13T06:55:52.922090Z", "url": "https://files.pythonhosted.org/packages/7b/93/aa831e6081fa800bf1806c2014458b8fc323917bf87aaea0d7427465e964/generativepoetry-0.2.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b69b7876b302d6efd8cd179ad47a55be", "sha256": "b959f097fd04892721b70a14b4c8b6b03ce3461c60871f198c12930d8792e2c9"}, "downloads": -1, "filename": "generativepoetry-0.2.3.tar.gz", "has_sig": false, "md5_digest": "b69b7876b302d6efd8cd179ad47a55be", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1108059, "upload_time": "2020-02-13T06:55:55", "upload_time_iso_8601": "2020-02-13T06:55:55.245140Z", "url": "https://files.pythonhosted.org/packages/f1/e8/48aa3f86a77c9051653cbda3342aabbe9d29a18cbf3af8dc77e545eb41fd/generativepoetry-0.2.3.tar.gz", "yanked": false}], "0.2.4": [{"comment_text": "", "digests": {"md5": "847a1d651c253791610d670d5e10ece1", "sha256": "733cf8c8f3ccae8b3e3e68d056cc017a6d5bfacea77e6fb9ca1dbb0d472e9d37"}, "downloads": -1, "filename": "generativepoetry-0.2.4-py3-none-any.whl", "has_sig": false, "md5_digest": "847a1d651c253791610d670d5e10ece1", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 25324, "upload_time": "2020-02-13T07:11:00", "upload_time_iso_8601": "2020-02-13T07:11:00.314986Z", "url": "https://files.pythonhosted.org/packages/1e/7e/15dfcbe4922b8f948668a59e4424f1a22bac5eb055ebd9d9a3377c1ecd3e/generativepoetry-0.2.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "45b7a3285c7e05803a4ea345841678d0", "sha256": "09cd123e78c86dd5a1bc0f4dff70e82470b93b416328b815182221b01420902d"}, "downloads": -1, "filename": "generativepoetry-0.2.4.tar.gz", "has_sig": false, "md5_digest": "45b7a3285c7e05803a4ea345841678d0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1108062, "upload_time": "2020-02-13T07:11:02", "upload_time_iso_8601": "2020-02-13T07:11:02.538783Z", "url": "https://files.pythonhosted.org/packages/9d/da/78f46721299a4e2db664402181551e9a151b9817add3686c9329588b44e8/generativepoetry-0.2.4.tar.gz", "yanked": false}], "0.2.5": [{"comment_text": "", "digests": {"md5": "8219f075560d881fa07ebf2bdfdc93b6", "sha256": "d7b109b440197a844f6f08f4ad2f073161269e6be54b42c719914c8ceb5fc0e6"}, "downloads": -1, "filename": "generativepoetry-0.2.5-py3-none-any.whl", "has_sig": false, "md5_digest": "8219f075560d881fa07ebf2bdfdc93b6", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 25326, "upload_time": "2020-02-13T07:30:04", "upload_time_iso_8601": "2020-02-13T07:30:04.110487Z", "url": "https://files.pythonhosted.org/packages/84/92/0f9526d460d3aac2d32ccfbc5c9e857e5fc671cc63ebb915b5b7579be0eb/generativepoetry-0.2.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e4eedf41b4a857f0ea8c5f68b44d0eec", "sha256": "15efa1ac659c6954d70a745b94b72193b207df65a28c153999f752e5b604cd7f"}, "downloads": -1, "filename": "generativepoetry-0.2.5.tar.gz", "has_sig": false, "md5_digest": "e4eedf41b4a857f0ea8c5f68b44d0eec", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1108070, "upload_time": "2020-02-13T07:30:06", "upload_time_iso_8601": "2020-02-13T07:30:06.602533Z", "url": "https://files.pythonhosted.org/packages/22/12/7085062492a734f8da49ef454635d44299ba4839d5c745c69bbb256d9e1c/generativepoetry-0.2.5.tar.gz", "yanked": false}], "0.3.0": [{"comment_text": "", "digests": {"md5": "2ec89f2e9a90952e388de04ef8224882", "sha256": "8fd77b78683170a69647773d94e6b7a23517c1d9c4267b188d9b1c8851501d30"}, "downloads": -1, "filename": "generativepoetry-0.3.0-py3-none-any.whl", "has_sig": false, "md5_digest": "2ec89f2e9a90952e388de04ef8224882", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 31379, "upload_time": "2020-03-21T17:48:43", "upload_time_iso_8601": "2020-03-21T17:48:43.148075Z", "url": "https://files.pythonhosted.org/packages/a2/1a/195a174312253142d26c2ab3fd67c68e03b49c28f326ac92ea67fdd5ed3f/generativepoetry-0.3.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b5689ea4c204837d67fdc9b20b95c845", "sha256": "8e7f9283a8dd5a0755924a7d78f95f097240d268fe73bf92a42c46a15e90509a"}, "downloads": -1, "filename": "generativepoetry-0.3.0.tar.gz", "has_sig": false, "md5_digest": "b5689ea4c204837d67fdc9b20b95c845", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 39077, "upload_time": "2020-03-21T17:48:47", "upload_time_iso_8601": "2020-03-21T17:48:47.340928Z", "url": "https://files.pythonhosted.org/packages/94/7d/d864b5445cec6b96bbc4bafe02fdb022c91ef9864862287f3e7cf55401ca/generativepoetry-0.3.0.tar.gz", "yanked": false}], "0.3.1": [{"comment_text": "", "digests": {"md5": "7c335802574be3a2ecb5465bd360908b", "sha256": "fa08391a1bcbbf0b44056bef10ea24cc1cd3c5932b91d7a724a41313cbd3a4af"}, "downloads": -1, "filename": "generativepoetry-0.3.1-py3-none-any.whl", "has_sig": false, "md5_digest": "7c335802574be3a2ecb5465bd360908b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 31368, "upload_time": "2020-03-21T18:30:41", "upload_time_iso_8601": "2020-03-21T18:30:41.541877Z", "url": "https://files.pythonhosted.org/packages/62/ac/0ab6de825507fbb7f2b92b4ee505d41e00713937f01e8dd9e409185cac76/generativepoetry-0.3.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d8d40176ed5e21aaa1c109a33fd809d6", "sha256": "9ece84f7ca1d9f49a0586ce443f9ef957d38bc1249e95b0ae5a82266e28558d2"}, "downloads": -1, "filename": "generativepoetry-0.3.1.tar.gz", "has_sig": false, "md5_digest": "d8d40176ed5e21aaa1c109a33fd809d6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 39062, "upload_time": "2020-03-21T18:30:43", "upload_time_iso_8601": "2020-03-21T18:30:43.269884Z", "url": "https://files.pythonhosted.org/packages/b8/cf/1ad8366bbeb33095110e781ee7a5077a7ad84efd2f2ee4819568364cb43a/generativepoetry-0.3.1.tar.gz", "yanked": false}], "0.3.2": [{"comment_text": "", "digests": {"md5": "6fd69a731ee807a4bd2b3ce5aa6e0e00", "sha256": "fc1fcd17bad366bdfe9b16d3ba39b8901a2a56863e3096ef3f1f57ebe863657c"}, "downloads": -1, "filename": "generativepoetry-0.3.2-py3-none-any.whl", "has_sig": false, "md5_digest": "6fd69a731ee807a4bd2b3ce5aa6e0e00", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 31662, "upload_time": "2020-03-21T18:58:54", "upload_time_iso_8601": "2020-03-21T18:58:54.846942Z", "url": "https://files.pythonhosted.org/packages/67/c1/f48d6fc4864e3694d8a7b36ce35bb3ceb92140c49426a8860cc2ae4c4575/generativepoetry-0.3.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d2888223f548effa8b88aa8e5c21c722", "sha256": "e0f3341e414f1059e8ea16f2fc69d44f1389cb41b87e2359b1cff24c432437fb"}, "downloads": -1, "filename": "generativepoetry-0.3.2.tar.gz", "has_sig": false, "md5_digest": "d2888223f548effa8b88aa8e5c21c722", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 39103, "upload_time": "2020-03-21T18:58:56", "upload_time_iso_8601": "2020-03-21T18:58:56.333261Z", "url": "https://files.pythonhosted.org/packages/98/a4/11070ea185171eef8141127b26b2236de1fb50c9f1a6b345ed58d8a9c169/generativepoetry-0.3.2.tar.gz", "yanked": false}], "0.3.3": [{"comment_text": "", "digests": {"md5": "dd0cc84ce928c3d2df471a72744964cb", "sha256": "aee54299afcc1eb1510886e0b5878ff664d965187edb806ffe00333a5521c5c0"}, "downloads": -1, "filename": "generativepoetry-0.3.3-py3-none-any.whl", "has_sig": false, "md5_digest": "dd0cc84ce928c3d2df471a72744964cb", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 31697, "upload_time": "2020-03-22T15:25:44", "upload_time_iso_8601": "2020-03-22T15:25:44.489030Z", "url": "https://files.pythonhosted.org/packages/8b/54/2522519dbbe6c520b9fee23f674935ab8e941f24a78cbb1041355a689ceb/generativepoetry-0.3.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "72bb18d89a029eb4590b2bf9ce2debbb", "sha256": "b2af08c3a86122f6650907504e0f294f3440f43907ef6bedf4d0902c4380b383"}, "downloads": -1, "filename": "generativepoetry-0.3.3.tar.gz", "has_sig": false, "md5_digest": "72bb18d89a029eb4590b2bf9ce2debbb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 39132, "upload_time": "2020-03-22T15:25:45", "upload_time_iso_8601": "2020-03-22T15:25:45.815631Z", "url": "https://files.pythonhosted.org/packages/9a/d8/20b25169d5361eba71451f68477769282b8595c3c9b74320754fe34460f9/generativepoetry-0.3.3.tar.gz", "yanked": false}], "0.3.4": [{"comment_text": "", "digests": {"md5": "1d14e7227bf8eacba34963d03f1fe15c", "sha256": "d6bc7236f4e4129c77de6e0894609a5eaefd089e7f19667d1327f7a5e8051c10"}, "downloads": -1, "filename": "generativepoetry-0.3.4-py3-none-any.whl", "has_sig": false, "md5_digest": "1d14e7227bf8eacba34963d03f1fe15c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 31520, "upload_time": "2020-03-23T16:55:13", "upload_time_iso_8601": "2020-03-23T16:55:13.842785Z", "url": "https://files.pythonhosted.org/packages/15/cb/8471a0e46d8fa889e9674c8efb4f815be44e5be2a6f295f36f22df24d2a6/generativepoetry-0.3.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6e0ed09d1442e7e1feb70416761d8113", "sha256": "21129e5837c400c80f1129633b65be88b3b59291219729f3df94aff8167df7de"}, "downloads": -1, "filename": "generativepoetry-0.3.4.tar.gz", "has_sig": false, "md5_digest": "6e0ed09d1442e7e1feb70416761d8113", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1482461, "upload_time": "2020-03-23T16:55:17", "upload_time_iso_8601": "2020-03-23T16:55:17.300901Z", "url": "https://files.pythonhosted.org/packages/32/fb/7794ba858dc22e37e57d42fd2ba550f52f69a1fbdfe651654c3ea637cd25/generativepoetry-0.3.4.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "1d14e7227bf8eacba34963d03f1fe15c", "sha256": "d6bc7236f4e4129c77de6e0894609a5eaefd089e7f19667d1327f7a5e8051c10"}, "downloads": -1, "filename": "generativepoetry-0.3.4-py3-none-any.whl", "has_sig": false, "md5_digest": "1d14e7227bf8eacba34963d03f1fe15c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 31520, "upload_time": "2020-03-23T16:55:13", "upload_time_iso_8601": "2020-03-23T16:55:13.842785Z", "url": "https://files.pythonhosted.org/packages/15/cb/8471a0e46d8fa889e9674c8efb4f815be44e5be2a6f295f36f22df24d2a6/generativepoetry-0.3.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6e0ed09d1442e7e1feb70416761d8113", "sha256": "21129e5837c400c80f1129633b65be88b3b59291219729f3df94aff8167df7de"}, "downloads": -1, "filename": "generativepoetry-0.3.4.tar.gz", "has_sig": false, "md5_digest": "6e0ed09d1442e7e1feb70416761d8113", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1482461, "upload_time": "2020-03-23T16:55:17", "upload_time_iso_8601": "2020-03-23T16:55:17.300901Z", "url": "https://files.pythonhosted.org/packages/32/fb/7794ba858dc22e37e57d42fd2ba550f52f69a1fbdfe651654c3ea637cd25/generativepoetry-0.3.4.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:58:24 2020"}