{"info": {"author": "Samuel Alexander", "author_email": "salexander2000@gmail.com", "bugtrack_url": null, "classifiers": [], "description": "CONTENTS OF THIS FILE\n---------------------\n   \n * Introduction\n * Requirements\n * Installation\n * Functionality\n * Instructions for Use\n * License\n * Contact\n\nINTRODUCTION\n------------\n\n getcite was created to save Florida Law Review member's time by automating\n the process called \"pulling sources.\" \n\nREQUIREMENTS\n------------\n\n getcite currently has the following software dependencies:\n\n \tPython 3.5.0 or higher;\n \tSelenium WebDriver 2.48.0 or higher;\n\tFirefox 43 or higher;\n\tPyPDF2 1.25.0 or higher;\n\n getcite has the following network dependencies:\n\n\tFor sources from HeinOnline: must be on local UF network or logged in \n\tto UF network through VPN;\n\nINSTALLATION\n------------\n\n For Mac:\n\n (1) Download and install Python 3.5 or above, by going to this website:\n\t\t\n\thttps://www.python.org/downloads/\n\n (2) Once Python is installed, download getcite by opening terminal and \n\t typing: \n\t\t\n\tpython3 -m pip install getcite --download ~/Downloads\n\n OR\n\n\tgit clone https://github.com/salexander2000/getcite\n\n(3) Once getcite is downloaded and unzipped, go to the getcite root \n\tfolder (that contains setup.py) and type:\n\n\tpython3 setup.py install\n\n(4) To run, go to the ./getcite folder and type:\n\n\tpython3 getcite.py\n\n\nFUNCTIONALITY\n-------------\n\n getcite can perform the following actions:\n\n Downloading:\n\tAny original PDFs, including S. Ct. opinions, on Westlaw, default \n\t\tpresumption;\n\tAny unpublished/recent cases available on Westlaw, via the Westlaw \n\t\tgenerate/download PDF function;\n\tSupreme Court cases on HeinOnline, automatically detected;\n\tU.S.C. statutes on HeinOnline, automatically detected;\n\tLaw review articles on HeinOnline, must be specified;\n\n Naming:\n\tNames automatically downloaded sources in the FLR source-naming \n\t\tformat; \n\tCan rename most recently downloaded file, if download \n\t\tcompleted manually, in FLR source-naming format;\n\n Shepardizing:\n\tCases and statutes on westlaw;\n\tUses auto-naming features;\n\tAutomatically concatenates PDFs when multiple histories are downloaded\n\t\te.g. cases with both negative treatment and case history;\n\nNOTE: As of right now, getcite cannot locate the table of contents\nassociated with a law review article. The process is too complex and\nidiosyncratic. \n\nLaw review articles often contain enough information on the first page \nof the article to determine the accuracy of the citation. However, they \noften do not. In order to make the best of getcite's automation process \nwhile not dropping required elements of the source-pulling process in \ngeneral, the following steps are recommended:\n\n1) Download the law review article automatically.\n2) After the source is automatically downloaded and named, look at\n\tthe first page, which should be open in Firefox, to see if more\n\tinformation is necessary to verify the accuracy of the citation.\n3) If the article page contains enough information, move on. \n\tOtherwise, you can now quickly find the associated table of \n\tcontents and download it manually.\n4) Once you've downloaded the table of contents, you'll need to \n\tmanually merge it into the properly named file using a PDF \n\teditor.\n\n\nINSTRUCTIONS FOR USE\n--------------------\n\n getcite will automatically attempt to detect the citation type and location. \n However, the user must first specify that they* intend to enter an article\n citation by using the \"article\" command.\n\n NOTE: There is really no difference between citations and commands. When a \n string is entered, getcite will first run it through the list of available\n commands. If getcite does not detect a known command, the program will treat \n the entry as a citation and attempt to automatically locate and download it.\n\n Abbreviation prompts:\n\n First, getcite will ask for the EDITOR abbreviation. Next, getcite will\n ask for the AUTHOR abbreviation. \n\n This information helps getcite automatically name downloaded sources \n only needs to be entered once every time getcite runs.\n\n Citation prompt and source naming: \n\n The user can now start entering citations and commands. \n\n Source naming:\n\n (1) If getcite successfully downloads a source, the program will prompt the \n user to either type a save-name different from the citation entered or \n simply press 'enter' to use the citation entered for the save-name. This\n functionality was added because reviewers often prefer to use a case or\n article name rather than a case or article citation when naming source \n files.\n\n The user may also type 'stop' here, which will return the program to the\n citation prompt without renaming a file. This is useful when getcite grabs\n the wrong file.\n\n (2) Next, getcite will ask the user for the footnote number, e.g.: 037(4) \n\n NOTE: Because the naming function runs immediately after the footnote is \n entered, you need to WAIT UNTIL THE DOWNLOAD IS COMPLETE before hitting\n 'return' after entering the footnote number. \n\n (3) Finally, getcite will print the most recently downloaded file's name, to\n ensure accuracy, and then will rename that file to an FLR format: \n\n \tauthor_abbreviation footnote_number name/citation editor_abbreviation.pdf\n\n Commands:\n\n quit:\t\tCloses the browser and quits getcite\n\n article: \tTells getcite that the citation is a Law Review article\n\n \tUSAGE:\tarticle:118 Harv. L. Rev. 833\n\n rename:\tRenames the most recently modified file in the download \n\t\t\tfolder. getcite assumes that the the most recently modified \n\t\t\tfile in that folder is the most recently downloaded file, so \n\t\t\tavoid modifying (e.g. renaming) files while getcite is \n\t\t\toperating\n\n\tUSAGE: \t\trename:name of case or article:footnote_number\n\tFor example: \trename:Shakur v. Smalls:003(4) \n\n\tAssuming EDITOR abb. is AB and AUTHOR abb. is CD,, getcite \n\twill save the most recently downloaded file in the download \n\tfolder as: \n\n\t\tCD 003(4) Shakur v. Smalls AB.pdf\n\t\t\t\n This command is helpful when: \n\n (a) the user has reached a point where getcite cannot download \n the source, but the user can finish the download manually.\n After the manual download is completed, getcite's \"rename\"\n function is still faster than using the operating system. \n\n (b) the user has not used getcite for the most recent download, \n but has manually downloaded a source into the download folder \n and wishes to use the rename function rather than renaming\n through the operating system;\n\n (c) the user has made a mistake in the naming of the most\n recently automatically-downloaded file, and wishes to name it\n again. For example, user enters 012 for footnote, but wants to\n change it to 012(1) without using the operating system;\n\n history:    Finds the westlaw history of the case or statute specified.\n            \t\n\tUSAGE:      history:citation\n\n    By simply typing \"history,\" with no argument, the user can\n    impute the previously entered citation as the argument. Useful\n    for when the history the user wants is from the previously\n    downloaded case.\n\n merge:\t\tMerges two files: the most recent in Sources and the most\n            recent in Downloads.\n\n            USAGE:  (1) Download an article, enter name, footnote.\n                    (2) Manually download ToC from HeinOnline. Leave\n                        in Downloads directory.\n                    (3) Use \"merge\" command to concatenate these two files.\n\t\n license:     Displays a shortened version of the getcite license.\n    \n warranty:    Displays the getcite warranty.\n\n help: \t\t  Displays the help screen\n\n\nLICENSE\n-------\n   \n Copyright (C) 2015\n\n This program is free software: you can redistribute it and/or modify it under \n the terms of the GNU General Public License as published by the Free Software \n Foundation, either version 3 of the License, or (at your option) any later \n version.\n\n This program is distributed in the hope that it will be useful, but WITHOUT \n ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or \n FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for \n more details.\n\n You should have received a copy of the GNU General Public License along with \n this program.  If not, see <http://www.gnu.org/licenses/>.\n\nCONTACT\n-------\n\n You can contact the author at: salexander2000@gmail.com\n \n", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "UNKNOWN", "keywords": null, "license": "GPL", "maintainer": null, "maintainer_email": null, "name": "getcite", "package_url": "https://pypi.org/project/getcite/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/getcite/", "project_urls": {"Download": "UNKNOWN", "Homepage": "UNKNOWN"}, "release_url": "https://pypi.org/project/getcite/1.3.32/", "requires_dist": null, "requires_python": null, "summary": "Pulls original sources from Westlaw and HeinOnline.org", "version": "1.3.32", "yanked": false, "html_description": "<div class=\"project-description\">\n            CONTENTS OF THIS FILE<br>---------------------<br>   <br> * Introduction<br> * Requirements<br> * Installation<br> * Functionality<br> * Instructions for Use<br> * License<br> * Contact<br><br>INTRODUCTION<br>------------<br><br> getcite was created to save Florida Law Review member's time by automating<br> the process called \"pulling sources.\" <br><br>REQUIREMENTS<br>------------<br><br> getcite currently has the following software dependencies:<br><br> \tPython 3.5.0 or higher;<br> \tSelenium WebDriver 2.48.0 or higher;<br>\tFirefox 43 or higher;<br>\tPyPDF2 1.25.0 or higher;<br><br> getcite has the following network dependencies:<br><br>\tFor sources from HeinOnline: must be on local UF network or logged in <br>\tto UF network through VPN;<br><br>INSTALLATION<br>------------<br><br> For Mac:<br><br> (1) Download and install Python 3.5 or above, by going to this website:<br>\t\t<br>\thttps://www.python.org/downloads/<br><br> (2) Once Python is installed, download getcite by opening terminal and <br>\t typing: <br>\t\t<br>\tpython3 -m pip install getcite --download ~/Downloads<br><br> OR<br><br>\tgit clone https://github.com/salexander2000/getcite<br><br>(3) Once getcite is downloaded and unzipped, go to the getcite root <br>\tfolder (that contains setup.py) and type:<br><br>\tpython3 setup.py install<br><br>(4) To run, go to the ./getcite folder and type:<br><br>\tpython3 getcite.py<br><br><br>FUNCTIONALITY<br>-------------<br><br> getcite can perform the following actions:<br><br> Downloading:<br>\tAny original PDFs, including S. Ct. opinions, on Westlaw, default <br>\t\tpresumption;<br>\tAny unpublished/recent cases available on Westlaw, via the Westlaw <br>\t\tgenerate/download PDF function;<br>\tSupreme Court cases on HeinOnline, automatically detected;<br>\tU.S.C. statutes on HeinOnline, automatically detected;<br>\tLaw review articles on HeinOnline, must be specified;<br><br> Naming:<br>\tNames automatically downloaded sources in the FLR source-naming <br>\t\tformat; <br>\tCan rename most recently downloaded file, if download <br>\t\tcompleted manually, in FLR source-naming format;<br><br> Shepardizing:<br>\tCases and statutes on westlaw;<br>\tUses auto-naming features;<br>\tAutomatically concatenates PDFs when multiple histories are downloaded<br>\t\te.g. cases with both negative treatment and case history;<br><br>NOTE: As of right now, getcite cannot locate the table of contents<br>associated with a law review article. The process is too complex and<br>idiosyncratic. <br><br>Law review articles often contain enough information on the first page <br>of the article to determine the accuracy of the citation. However, they <br>often do not. In order to make the best of getcite's automation process <br>while not dropping required elements of the source-pulling process in <br>general, the following steps are recommended:<br><br>1) Download the law review article automatically.<br>2) After the source is automatically downloaded and named, look at<br>\tthe first page, which should be open in Firefox, to see if more<br>\tinformation is necessary to verify the accuracy of the citation.<br>3) If the article page contains enough information, move on. <br>\tOtherwise, you can now quickly find the associated table of <br>\tcontents and download it manually.<br>4) Once you've downloaded the table of contents, you'll need to <br>\tmanually merge it into the properly named file using a PDF <br>\teditor.<br><br><br>INSTRUCTIONS FOR USE<br>--------------------<br><br> getcite will automatically attempt to detect the citation type and location. <br> However, the user must first specify that they* intend to enter an article<br> citation by using the \"article\" command.<br><br> NOTE: There is really no difference between citations and commands. When a <br> string is entered, getcite will first run it through the list of available<br> commands. If getcite does not detect a known command, the program will treat <br> the entry as a citation and attempt to automatically locate and download it.<br><br> Abbreviation prompts:<br><br> First, getcite will ask for the EDITOR abbreviation. Next, getcite will<br> ask for the AUTHOR abbreviation. <br><br> This information helps getcite automatically name downloaded sources <br> only needs to be entered once every time getcite runs.<br><br> Citation prompt and source naming: <br><br> The user can now start entering citations and commands. <br><br> Source naming:<br><br> (1) If getcite successfully downloads a source, the program will prompt the <br> user to either type a save-name different from the citation entered or <br> simply press 'enter' to use the citation entered for the save-name. This<br> functionality was added because reviewers often prefer to use a case or<br> article name rather than a case or article citation when naming source <br> files.<br><br> The user may also type 'stop' here, which will return the program to the<br> citation prompt without renaming a file. This is useful when getcite grabs<br> the wrong file.<br><br> (2) Next, getcite will ask the user for the footnote number, e.g.: 037(4) <br><br> NOTE: Because the naming function runs immediately after the footnote is <br> entered, you need to WAIT UNTIL THE DOWNLOAD IS COMPLETE before hitting<br> 'return' after entering the footnote number. <br><br> (3) Finally, getcite will print the most recently downloaded file's name, to<br> ensure accuracy, and then will rename that file to an FLR format: <br><br> \tauthor_abbreviation footnote_number name/citation editor_abbreviation.pdf<br><br> Commands:<br><br> quit:\t\tCloses the browser and quits getcite<br><br> article: \tTells getcite that the citation is a Law Review article<br><br> \tUSAGE:\tarticle:118 Harv. L. Rev. 833<br><br> rename:\tRenames the most recently modified file in the download <br>\t\t\tfolder. getcite assumes that the the most recently modified <br>\t\t\tfile in that folder is the most recently downloaded file, so <br>\t\t\tavoid modifying (e.g. renaming) files while getcite is <br>\t\t\toperating<br><br>\tUSAGE: \t\trename:name of case or article:footnote_number<br>\tFor example: \trename:Shakur v. Smalls:003(4) <br><br>\tAssuming EDITOR abb. is AB and AUTHOR abb. is CD,, getcite <br>\twill save the most recently downloaded file in the download <br>\tfolder as: <br><br>\t\tCD 003(4) Shakur v. Smalls AB.pdf<br>\t\t\t<br> This command is helpful when: <br><br> (a) the user has reached a point where getcite cannot download <br> the source, but the user can finish the download manually.<br> After the manual download is completed, getcite's \"rename\"<br> function is still faster than using the operating system. <br><br> (b) the user has not used getcite for the most recent download, <br> but has manually downloaded a source into the download folder <br> and wishes to use the rename function rather than renaming<br> through the operating system;<br><br> (c) the user has made a mistake in the naming of the most<br> recently automatically-downloaded file, and wishes to name it<br> again. For example, user enters 012 for footnote, but wants to<br> change it to 012(1) without using the operating system;<br><br> history:    Finds the westlaw history of the case or statute specified.<br>            \t<br>\tUSAGE:      history:citation<br><br>    By simply typing \"history,\" with no argument, the user can<br>    impute the previously entered citation as the argument. Useful<br>    for when the history the user wants is from the previously<br>    downloaded case.<br><br> merge:\t\tMerges two files: the most recent in Sources and the most<br>            recent in Downloads.<br><br>            USAGE:  (1) Download an article, enter name, footnote.<br>                    (2) Manually download ToC from HeinOnline. Leave<br>                        in Downloads directory.<br>                    (3) Use \"merge\" command to concatenate these two files.<br>\t<br> license:     Displays a shortened version of the getcite license.<br>    <br> warranty:    Displays the getcite warranty.<br><br> help: \t\t  Displays the help screen<br><br><br>LICENSE<br>-------<br>   <br> Copyright (C) 2015<br><br> This program is free software: you can redistribute it and/or modify it under <br> the terms of the GNU General Public License as published by the Free Software <br> Foundation, either version 3 of the License, or (at your option) any later <br> version.<br><br> This program is distributed in the hope that it will be useful, but WITHOUT <br> ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or <br> FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for <br> more details.<br><br> You should have received a copy of the GNU General Public License along with <br> this program.  If not, see &lt;http://www.gnu.org/licenses/&gt;.<br><br>CONTACT<br>-------<br><br> You can contact the author at: salexander2000@gmail.com<br> <br>\n          </div>"}, "last_serial": 2038389, "releases": {"1.3.0": [{"comment_text": "", "digests": {"md5": "7bdcc50a77796de71fe135f765d85c79", "sha256": "e6f339fe5c258ae10a09170326647cff1ccc6913b6e995b2c253710ea1e996c4"}, "downloads": -1, "filename": "getcite-1.3.0.tar.gz", "has_sig": false, "md5_digest": "7bdcc50a77796de71fe135f765d85c79", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3788, "upload_time": "2015-12-30T16:03:11", "upload_time_iso_8601": "2015-12-30T16:03:11.575468Z", "url": "https://files.pythonhosted.org/packages/97/4b/fe6a34963c076637cb18a37568aabdc310d493b53bb2b0d1f4f5956cb641/getcite-1.3.0.tar.gz", "yanked": false}], "1.3.1": [{"comment_text": "", "digests": {"md5": "6ff8e545fb80fcb5c063d74325b9ff79", "sha256": "102c78f1b9bb88eeb1768dd059a587f3fa0b3fb03444b25ab7cb0750bd84b7ed"}, "downloads": -1, "filename": "getcite-1.3.1.tar.gz", "has_sig": false, "md5_digest": "6ff8e545fb80fcb5c063d74325b9ff79", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3792, "upload_time": "2015-12-30T16:19:10", "upload_time_iso_8601": "2015-12-30T16:19:10.071269Z", "url": "https://files.pythonhosted.org/packages/42/71/f7d66d43c775cb5ef022029327a1eefc45a92b784e2cf9207d20795a18e0/getcite-1.3.1.tar.gz", "yanked": false}], "1.3.10": [{"comment_text": "", "digests": {"md5": "8d161618fc3ae5dc4bd19da9cb345b31", "sha256": "f417561b5c4cfa9971f4bf53e6c34b3351af84d6195b3c15f13c83e8943d9075"}, "downloads": -1, "filename": "getcite-1.3.10.tar.gz", "has_sig": false, "md5_digest": "8d161618fc3ae5dc4bd19da9cb345b31", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 11948, "upload_time": "2015-12-30T18:22:29", "upload_time_iso_8601": "2015-12-30T18:22:29.077935Z", "url": "https://files.pythonhosted.org/packages/ed/92/da9d3883ff74be63b2cc190fe950cfbfb581836ea94046cb229333d0e223/getcite-1.3.10.tar.gz", "yanked": false}], "1.3.11": [{"comment_text": "", "digests": {"md5": "22413d3c3b1a3941e22e5e2f65fd08db", "sha256": "45d68996b534b561c8043ac8e951737e6de7035d682808c90be614118a0583d3"}, "downloads": -1, "filename": "getcite-1.3.11.tar.gz", "has_sig": false, "md5_digest": "22413d3c3b1a3941e22e5e2f65fd08db", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23754, "upload_time": "2015-12-30T19:17:17", "upload_time_iso_8601": "2015-12-30T19:17:17.562995Z", "url": "https://files.pythonhosted.org/packages/7a/d3/5f5248c333bc17595b2aa6d317747ff927123bb1effe7043809a0ed75677/getcite-1.3.11.tar.gz", "yanked": false}], "1.3.12": [{"comment_text": "", "digests": {"md5": "4034be1db41767899fbd167b9594fe0d", "sha256": "0db813d9437d7ec92089331ef9b7cc6df2ad977aa31e6800cb14c82011c6e5c8"}, "downloads": -1, "filename": "getcite-1.3.12.tar.gz", "has_sig": false, "md5_digest": "4034be1db41767899fbd167b9594fe0d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23763, "upload_time": "2015-12-31T00:24:00", "upload_time_iso_8601": "2015-12-31T00:24:00.380083Z", "url": "https://files.pythonhosted.org/packages/ea/57/3598fc4287cb6f0e6eb56178263656328b8c392116761374f649d112ab7a/getcite-1.3.12.tar.gz", "yanked": false}], "1.3.13": [{"comment_text": "", "digests": {"md5": "76d86662b1593e56558ee7ead57ddf8c", "sha256": "95292efc7bd14560bf49c1c09bd0117856090d951e63706469cbbc2e1b641ca2"}, "downloads": -1, "filename": "getcite-1.3.13.tar.gz", "has_sig": false, "md5_digest": "76d86662b1593e56558ee7ead57ddf8c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23769, "upload_time": "2015-12-31T00:26:47", "upload_time_iso_8601": "2015-12-31T00:26:47.246879Z", "url": "https://files.pythonhosted.org/packages/79/78/4012b33887a4756b04d2bb35490b3c6b8115e141687ae78d657957f71af9/getcite-1.3.13.tar.gz", "yanked": false}], "1.3.14": [{"comment_text": "", "digests": {"md5": "0d30e7aed162256484153a24f801ab6f", "sha256": "e2c4b863d63385cda7391581ed4bd7f8b72f3047a07fb00cfa818fdd19065a48"}, "downloads": -1, "filename": "getcite-1.3.14.tar.gz", "has_sig": false, "md5_digest": "0d30e7aed162256484153a24f801ab6f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27733, "upload_time": "2015-12-31T00:35:38", "upload_time_iso_8601": "2015-12-31T00:35:38.914528Z", "url": "https://files.pythonhosted.org/packages/3b/e9/0ecada94cdd6b340c61c0d2957d66bc53df213ca9dc8116058e92aa3e5e8/getcite-1.3.14.tar.gz", "yanked": false}], "1.3.15": [{"comment_text": "", "digests": {"md5": "789ffe3e11363a3ee05f696c35962db2", "sha256": "0bc8625da0ffe7a8d2df53de221f695bd71d56696344ec30e0c99aa3b90ca170"}, "downloads": -1, "filename": "getcite-1.3.15.tar.gz", "has_sig": false, "md5_digest": "789ffe3e11363a3ee05f696c35962db2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27739, "upload_time": "2015-12-31T00:54:23", "upload_time_iso_8601": "2015-12-31T00:54:23.203968Z", "url": "https://files.pythonhosted.org/packages/34/87/eaa20aed35402be2c87d5e5185b2883c2c8b06ccfdbdb70b3a661e1aee04/getcite-1.3.15.tar.gz", "yanked": false}], "1.3.16": [{"comment_text": "", "digests": {"md5": "b4bacc44e81d180f12b1a0cd402e5c62", "sha256": "32bdcade9a1e7f32b7b3f34dda451a97b9f4f79035f2de6406f13b03bd806beb"}, "downloads": -1, "filename": "getcite-1.3.16.tar.gz", "has_sig": false, "md5_digest": "b4bacc44e81d180f12b1a0cd402e5c62", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27941, "upload_time": "2015-12-31T01:05:51", "upload_time_iso_8601": "2015-12-31T01:05:51.041436Z", "url": "https://files.pythonhosted.org/packages/0e/01/0f76a449e1af92fb20cfb548d9b337f7318b9ca7a2f84b1d8dc0ed8bfb79/getcite-1.3.16.tar.gz", "yanked": false}], "1.3.17": [{"comment_text": "", "digests": {"md5": "8c8cdc645f9ec61f4d21370e8600ed55", "sha256": "3819d2b2102dfcca659fc00ac1f994b7f199973cdfd48f383eae34edc6f75c45"}, "downloads": -1, "filename": "getcite-1.3.17.tar.gz", "has_sig": false, "md5_digest": "8c8cdc645f9ec61f4d21370e8600ed55", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27946, "upload_time": "2015-12-31T01:09:15", "upload_time_iso_8601": "2015-12-31T01:09:15.347850Z", "url": "https://files.pythonhosted.org/packages/28/89/762279209f5619fddfddd0dd43f9769d879caa1030080301207c728b0bfe/getcite-1.3.17.tar.gz", "yanked": false}], "1.3.18": [{"comment_text": "", "digests": {"md5": "1a54827ee320bfb0de137ac37dfb7d06", "sha256": "57f5a44360f7b65561f71a5becad0ae79237b4ac7d3cf6dc284541cfe5adddec"}, "downloads": -1, "filename": "getcite-1.3.18.tar.gz", "has_sig": false, "md5_digest": "1a54827ee320bfb0de137ac37dfb7d06", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27932, "upload_time": "2015-12-31T01:17:33", "upload_time_iso_8601": "2015-12-31T01:17:33.199470Z", "url": "https://files.pythonhosted.org/packages/22/87/2e602e7e04796490050ea657a953413de49730fa7523b8088e6d45d17c13/getcite-1.3.18.tar.gz", "yanked": false}], "1.3.19": [{"comment_text": "", "digests": {"md5": "669581d614d47e387e7cf5eadb9ec8ee", "sha256": "243d252df0010c35abee1a0dfa78a4c1c9c31a78b939adf70408f593b2cd4668"}, "downloads": -1, "filename": "getcite-1.3.19.tar.gz", "has_sig": false, "md5_digest": "669581d614d47e387e7cf5eadb9ec8ee", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27951, "upload_time": "2015-12-31T01:26:32", "upload_time_iso_8601": "2015-12-31T01:26:32.545373Z", "url": "https://files.pythonhosted.org/packages/fc/be/0047048cd9ef9b348ce4b2bb3f3ac8a11a6729c7c15dd7adb1567ffecf4a/getcite-1.3.19.tar.gz", "yanked": false}], "1.3.2": [{"comment_text": "", "digests": {"md5": "57ff29e258eeda32f51389f2764e633b", "sha256": "6890eb39f29c1f280c79e1a0176fe44bb56632cae7c0f3696977120550c248e3"}, "downloads": -1, "filename": "getcite-1.3.2.tar.gz", "has_sig": false, "md5_digest": "57ff29e258eeda32f51389f2764e633b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3786, "upload_time": "2015-12-30T16:29:17", "upload_time_iso_8601": "2015-12-30T16:29:17.891361Z", "url": "https://files.pythonhosted.org/packages/80/52/34007677211330132fac66480cab25e33956d9175dbfafd8e2216cbbf99c/getcite-1.3.2.tar.gz", "yanked": false}], "1.3.20": [{"comment_text": "", "digests": {"md5": "70e1eb998973d2c487556eb7e2fa9ad7", "sha256": "00e8c24a7ceb3d2a0b5c487c9645bfa42dbc43672ad5ac18a74f8d27033cdd5e"}, "downloads": -1, "filename": "getcite-1.3.20.tar.gz", "has_sig": false, "md5_digest": "70e1eb998973d2c487556eb7e2fa9ad7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27947, "upload_time": "2015-12-31T01:33:10", "upload_time_iso_8601": "2015-12-31T01:33:10.039067Z", "url": "https://files.pythonhosted.org/packages/a9/09/deebd4fea6fc343367edcbdac7b7e4529834859a8cf77ebbe8dc4a79943e/getcite-1.3.20.tar.gz", "yanked": false}], "1.3.21": [{"comment_text": "", "digests": {"md5": "35bb32dde57e36f57642fe27e63dc8b1", "sha256": "a9a0c4b14c73e2b404edca314be16c943d1db532841ce1e35f86ccea6e3411d3"}, "downloads": -1, "filename": "getcite-1.3.21.tar.gz", "has_sig": false, "md5_digest": "35bb32dde57e36f57642fe27e63dc8b1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 25375, "upload_time": "2016-01-02T03:19:41", "upload_time_iso_8601": "2016-01-02T03:19:41.210868Z", "url": "https://files.pythonhosted.org/packages/30/97/674952fe7b5eb14194f2ce247b99beb1e22c4fb67ce56fce6856d2b5b3af/getcite-1.3.21.tar.gz", "yanked": false}], "1.3.22": [{"comment_text": "", "digests": {"md5": "9be9314ce6836f67baf9bbe639d7f37e", "sha256": "f86e75c5d509984279e21ddb7c8c3916cce04ea9816b2c924a1470ff1d063a4c"}, "downloads": -1, "filename": "getcite-1.3.22.tar.gz", "has_sig": false, "md5_digest": "9be9314ce6836f67baf9bbe639d7f37e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 25368, "upload_time": "2016-01-02T03:22:20", "upload_time_iso_8601": "2016-01-02T03:22:20.713404Z", "url": "https://files.pythonhosted.org/packages/fd/57/8d9ae116524ec43e0d375fd86d132ed06e56c4f7856c013060672b16f760/getcite-1.3.22.tar.gz", "yanked": false}], "1.3.23": [{"comment_text": "", "digests": {"md5": "cbae59ac5cc72c28069b40721c857ea5", "sha256": "450dea33f90df3bfdf9dc169b52effb989166c07018a354bf730b68641da08e2"}, "downloads": -1, "filename": "getcite-1.3.23.tar.gz", "has_sig": false, "md5_digest": "cbae59ac5cc72c28069b40721c857ea5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 28128, "upload_time": "2016-01-02T03:53:10", "upload_time_iso_8601": "2016-01-02T03:53:10.868631Z", "url": "https://files.pythonhosted.org/packages/13/15/8d5f8d069fc49e55dcb998bc4fd1cfc3157e47c6f9c1c644a31dd1e0fced/getcite-1.3.23.tar.gz", "yanked": false}], "1.3.24": [{"comment_text": "", "digests": {"md5": "23d84cc1063f16e25b85147d7af7aa47", "sha256": "ec4d83b3cae5f427b20b28fccdf9a7b4323e9775cee5ac50060c933f54d54f10"}, "downloads": -1, "filename": "getcite-1.3.24.tar.gz", "has_sig": false, "md5_digest": "23d84cc1063f16e25b85147d7af7aa47", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 28658, "upload_time": "2016-01-06T20:27:37", "upload_time_iso_8601": "2016-01-06T20:27:37.572874Z", "url": "https://files.pythonhosted.org/packages/16/96/d086f291b4d262473d88ed988eb36c51023718678baa93a49048c79add67/getcite-1.3.24.tar.gz", "yanked": false}], "1.3.25": [{"comment_text": "", "digests": {"md5": "c75d05e767446ce5dda3395f06d09e86", "sha256": "cc4a759015aaac8b20044535ac81823e939e60088c06ee1e43aee7c854dfdf5c"}, "downloads": -1, "filename": "getcite-1.3.25.tar.gz", "has_sig": false, "md5_digest": "c75d05e767446ce5dda3395f06d09e86", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29316, "upload_time": "2016-01-12T18:46:42", "upload_time_iso_8601": "2016-01-12T18:46:42.609499Z", "url": "https://files.pythonhosted.org/packages/0d/74/c5f89624ec59e64fa7d0f0ffcec2ca3f49015f0fa0b5511c7429106754dc/getcite-1.3.25.tar.gz", "yanked": false}], "1.3.26": [{"comment_text": "", "digests": {"md5": "ed186eb1eca2ba26dede0642811a08f8", "sha256": "f566784464c2e6edc2e69f88c53e8df422ad1a36bc8c9e9ebec63d0b8085d259"}, "downloads": -1, "filename": "getcite-1.3.26.tar.gz", "has_sig": false, "md5_digest": "ed186eb1eca2ba26dede0642811a08f8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29410, "upload_time": "2016-01-29T18:36:17", "upload_time_iso_8601": "2016-01-29T18:36:17.258652Z", "url": "https://files.pythonhosted.org/packages/70/88/40ad56a633cbc6ff8e8505186bf72f034757d87eaf2404bdad8d956b05be/getcite-1.3.26.tar.gz", "yanked": false}], "1.3.27": [{"comment_text": "", "digests": {"md5": "cafb02083f386393d0670b9f2e20b081", "sha256": "aa3917fda9029f0e90cfbc4f17e81da2606251bb3d4eba0a5d85408021724ce3"}, "downloads": -1, "filename": "getcite-1.3.27.tar.gz", "has_sig": false, "md5_digest": "cafb02083f386393d0670b9f2e20b081", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29389, "upload_time": "2016-01-29T18:57:50", "upload_time_iso_8601": "2016-01-29T18:57:50.557123Z", "url": "https://files.pythonhosted.org/packages/b8/7c/731a70b03c4e9ab9d5d193051841640e208c035c94e6190b711789b64aae/getcite-1.3.27.tar.gz", "yanked": false}], "1.3.28": [{"comment_text": "", "digests": {"md5": "68ed36c94e290fb34f476bc31b0d23fe", "sha256": "be8db17fd1661040435ebc33061abc88465b757e6188c24015bf3c957906da1e"}, "downloads": -1, "filename": "getcite-1.3.28.tar.gz", "has_sig": false, "md5_digest": "68ed36c94e290fb34f476bc31b0d23fe", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29493, "upload_time": "2016-01-29T19:15:11", "upload_time_iso_8601": "2016-01-29T19:15:11.679140Z", "url": "https://files.pythonhosted.org/packages/e7/17/5a93bf4715313ee547e27fa4947ce807df9e8963dec2fcc550a2c533bd03/getcite-1.3.28.tar.gz", "yanked": false}], "1.3.29": [{"comment_text": "", "digests": {"md5": "c9b92e758ae5ae4820eab9ded3ae5b0f", "sha256": "d1c5f57d1f9044579b46866f40f6b9b50785c1bea857b7757b4a2d54ae7f8a0e"}, "downloads": -1, "filename": "getcite-1.3.29.tar.gz", "has_sig": false, "md5_digest": "c9b92e758ae5ae4820eab9ded3ae5b0f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29512, "upload_time": "2016-01-29T19:25:07", "upload_time_iso_8601": "2016-01-29T19:25:07.146350Z", "url": "https://files.pythonhosted.org/packages/ba/8b/e56d241d8f3a92481cfe059c81d8414a8e6c8193023fd175feec775a2cfc/getcite-1.3.29.tar.gz", "yanked": false}], "1.3.3": [{"comment_text": "", "digests": {"md5": "fe384233ea0bbe23b181b0e276b1eb77", "sha256": "6c537de55c13422f6a1fb4a91f397524a784bd641344dd1f9f82a4d648b32053"}, "downloads": -1, "filename": "getcite-1.3.3.tar.gz", "has_sig": false, "md5_digest": "fe384233ea0bbe23b181b0e276b1eb77", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3791, "upload_time": "2015-12-30T16:31:02", "upload_time_iso_8601": "2015-12-30T16:31:02.183470Z", "url": "https://files.pythonhosted.org/packages/c6/d0/f24f6170b7efcadbbb080a69b8081194a9458dff6e13477941413b692c05/getcite-1.3.3.tar.gz", "yanked": false}], "1.3.30": [{"comment_text": "", "digests": {"md5": "377a9872ad4c53d32c15daa102346c9e", "sha256": "ecb603657b97737b14fcf5ab15e6bda30cd5581cb1839d669a353454b35409d8"}, "downloads": -1, "filename": "getcite-1.3.30.tar.gz", "has_sig": false, "md5_digest": "377a9872ad4c53d32c15daa102346c9e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29596, "upload_time": "2016-03-07T22:01:21", "upload_time_iso_8601": "2016-03-07T22:01:21.336425Z", "url": "https://files.pythonhosted.org/packages/27/b9/453a52e0283036b98d5724106b7b6e3101d4a76dfcaf5d95fdeb6a15038e/getcite-1.3.30.tar.gz", "yanked": false}], "1.3.31": [{"comment_text": "", "digests": {"md5": "86e420c32eed7d8e60b7f102e950b95f", "sha256": "9dea73c266ba4cd3bd73662867c39154b4834e16f23d5fbcce82779165de815d"}, "downloads": -1, "filename": "getcite-1.3.31.tar.gz", "has_sig": false, "md5_digest": "86e420c32eed7d8e60b7f102e950b95f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29601, "upload_time": "2016-03-12T13:50:28", "upload_time_iso_8601": "2016-03-12T13:50:28.830233Z", "url": "https://files.pythonhosted.org/packages/ff/81/11c5b66578ec3c6dc4e1734b0b747fe1591a8fc1c825e9070079513a8a8c/getcite-1.3.31.tar.gz", "yanked": false}], "1.3.32": [{"comment_text": "", "digests": {"md5": "b730cf619dd900cec32d55596ceab719", "sha256": "da1452bc9859fe2fd9dee69836da1f511e3ed4dfbd8a2c3c6a6c18a4ea9e9149"}, "downloads": -1, "filename": "getcite-1.3.32.tar.gz", "has_sig": false, "md5_digest": "b730cf619dd900cec32d55596ceab719", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29694, "upload_time": "2016-03-31T15:21:50", "upload_time_iso_8601": "2016-03-31T15:21:50.740756Z", "url": "https://files.pythonhosted.org/packages/15/63/88f47fccfa4afedfa207276e4afb14196bc7a17f7324f1d8e1ce9b862aca/getcite-1.3.32.tar.gz", "yanked": false}], "1.3.4": [{"comment_text": "", "digests": {"md5": "b3a36686f78a4f79343a060d0d6c38a5", "sha256": "f05dc79054175d3cb7b57176a5d22398876448a3ec6e69ad605d16b63f6b59e3"}, "downloads": -1, "filename": "getcite-1.3.4.tar.gz", "has_sig": false, "md5_digest": "b3a36686f78a4f79343a060d0d6c38a5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3838, "upload_time": "2015-12-30T16:34:19", "upload_time_iso_8601": "2015-12-30T16:34:19.091242Z", "url": "https://files.pythonhosted.org/packages/d7/da/9babcb402e11d69e282712fae6706fd9434e9425e065d6c44d5bb36e2469/getcite-1.3.4.tar.gz", "yanked": false}], "1.3.5": [{"comment_text": "", "digests": {"md5": "a7f03d66b4c7eb44ac804f6b04483d9b", "sha256": "f288f2a3c3805f327eb386cefe37dcd2264d472b143f44c56df7e545d6dd012c"}, "downloads": -1, "filename": "getcite-1.3.5.tar.gz", "has_sig": false, "md5_digest": "a7f03d66b4c7eb44ac804f6b04483d9b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3838, "upload_time": "2015-12-30T16:36:22", "upload_time_iso_8601": "2015-12-30T16:36:22.038796Z", "url": "https://files.pythonhosted.org/packages/d1/8d/96f654b255c455a0e6d9262861ad2da728a43b63a29c14924a9e424f20ba/getcite-1.3.5.tar.gz", "yanked": false}], "1.3.6": [{"comment_text": "", "digests": {"md5": "1166405f7818fe170c2b7dd618d4b557", "sha256": "bb10f67240049c681a513661a6d0dfddd7168f12f87ec13027818de88971393b"}, "downloads": -1, "filename": "getcite-1.3.6.tar.gz", "has_sig": false, "md5_digest": "1166405f7818fe170c2b7dd618d4b557", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3835, "upload_time": "2015-12-30T16:37:14", "upload_time_iso_8601": "2015-12-30T16:37:14.658450Z", "url": "https://files.pythonhosted.org/packages/d2/fe/87061aa8c427ed38aa4f31f878c4c50fbf9f6ccac24619463723adf0b23f/getcite-1.3.6.tar.gz", "yanked": false}], "1.3.7": [{"comment_text": "", "digests": {"md5": "f28e28f0ddf4faa0643088d3b59c1596", "sha256": "a9836479f6cf47e30e04616ba76a73783b718c5b10c2404ddb06db1f5b3a5f5b"}, "downloads": -1, "filename": "getcite-1.3.7.tar.gz", "has_sig": false, "md5_digest": "f28e28f0ddf4faa0643088d3b59c1596", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3832, "upload_time": "2015-12-30T16:37:48", "upload_time_iso_8601": "2015-12-30T16:37:48.605453Z", "url": "https://files.pythonhosted.org/packages/3a/6a/7c0c9dcc45083c9148bacc855a2a1d056d2ccb116264e45e816e71bbd165/getcite-1.3.7.tar.gz", "yanked": false}], "1.3.9": [{"comment_text": "", "digests": {"md5": "7ec2b593afbeca68ef55ae50bc4849e5", "sha256": "2520cdd99b73e9226f976e69c2ff71e11ab6f2e6605fe2d939cc9b9bcb745761"}, "downloads": -1, "filename": "getcite-1.3.9.tar.gz", "has_sig": false, "md5_digest": "7ec2b593afbeca68ef55ae50bc4849e5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3818, "upload_time": "2015-12-30T16:43:57", "upload_time_iso_8601": "2015-12-30T16:43:57.300051Z", "url": "https://files.pythonhosted.org/packages/20/0a/1677563eed714d4f909790b5902033e6d965df38655853ada5d9f1dcee26/getcite-1.3.9.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "b730cf619dd900cec32d55596ceab719", "sha256": "da1452bc9859fe2fd9dee69836da1f511e3ed4dfbd8a2c3c6a6c18a4ea9e9149"}, "downloads": -1, "filename": "getcite-1.3.32.tar.gz", "has_sig": false, "md5_digest": "b730cf619dd900cec32d55596ceab719", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29694, "upload_time": "2016-03-31T15:21:50", "upload_time_iso_8601": "2016-03-31T15:21:50.740756Z", "url": "https://files.pythonhosted.org/packages/15/63/88f47fccfa4afedfa207276e4afb14196bc7a17f7324f1d8e1ce9b862aca/getcite-1.3.32.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:57:49 2020"}