{"info": {"author": "Andrius Laukavičius", "author_email": "dev@focusate.eu", "bugtrack_url": null, "classifiers": ["Environment :: Other Environment", "Intended Audience :: Developers", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Topic :: Software Development", "Topic :: Utilities"], "description": ".. image:: https://travis-ci.com/focusate/git-trunk.svg?branch=master\n    :target: https://travis-ci.com/focusate/git-trunk\n\nGit Trunk based workflow\n########################\n\nAdds git-trunk commands that automates some common git procedures.\n\nUsage: :code:`git trunk <command>`\n\nPossible commands:\n\n* :code:`init`: initialize trunk configuration to be used for other commands.\n* :code:`start`: create new branch specifying custom name or use patterns to fetch/filter remote branches. First match is used to create local branch.\n* :code:`finish`: finish active branch by merging it to trunk (then remove it).\n* :code:`release`: create tag with new release version.\n* :code:`refresh`: update trunk branch and rebase it on active branch.\n* :code:`squash`: squash commits on active branch.\n\nCode was tested using :code:`git version 2.25.1`.\n\nSource code in:\n\n* `github <https://github.com/focusate/git-trunk/>`_.\n* `pypi <https://pypi.org/project/git_trunk/>`_.\n\nQuick Start\n===========\n\nFor easier use, commands should be called when git repository is your working directory. If you need to call outside working directory, you can use :code:`--repo-path` argument, where you specify for which repository it should be called.\n\nTo know which commands are available, use :code:`git trunk -h`\n\nTo know what arguments are available and what they do for each command, use :code:`git trunk <command> -h` or :code:`git trunk <command> --help`\n\nRemote used is identified by your current branch tracking branch remote. If your current branch does not have tracking branch, then trunk branch tracking branch is checked. If trunk branch does not have tracking branch set, then it is assumed no remote is used for :code:`git-trunk` workflow.\n\ninit\n----\n\n:code:`init` command is used to initialize git trunk configuration that is later reused for other commands. usually it is meant to be called once, where you specify options to set on configuration. Configuration is saved on your repository inside :code:`.git/config` file. Trunk sections are named :code:`trunk`.\n\nWhen using :code:`init` command, by default it runs in \"interactive\" mode, where you have to confirm default option values or enter new ones. If you want to specify all options without a prompt, use :code:`--no-confirm` flag. With this flag, you can specify other argument and it will set without asking you to confirm it.\n\nIf you need to change configuration, you can just call :code:`init` command again by specifying options you want to change. Options not specified, will be assumed that old values must be kept.\n\nstart\n-----\n\n:code:`start` command is used to create new branch locally.\n\nBranch that is created, uses your :code:`trunk` branch as a fork. :code:`trunk` branch is always rebased from remote :code:`trunk` before creating new branch (if of course remote is used).\n\nWhen branch is created using :code:`start` command, by default it will also try to set upstream for it. To not set upstream, use :code:`--no-set-upstream` flag when running :code:`start` command.\n\nIf you need to create new branch that is not already on remote, you can use :code:`--name` argument. It will simply try to create new branch (given it does not exist already) forking from your trunk branch.\n\nIf you use system where branches are created on remote automatically (like tasks), you can configure :code:`git-trunk` to fetch specific branches only that are meant for you. :code:`start` command will try to fetch the first one (naturally sorting branch names) from remotely existing branches you filtered. If remote branch is already used as tracking branch for existing local branch, such branch is ignored and not used in automatic branch creation.\n\nThere are two ways to filter (can be combined):\n\n* First one is by using :code:`fetchbranchpattern` option. By default it fetches all available branches from your remote. To limit what is fetched, with :code:`init` command, for example you can set :code:`*-my` value for argument :code:`--fetch-branch-pattern`. With such pattern, it will only fetch branches which names end with :code:`-my` part. Pattern uses git `refspec <https://git-scm.com/book/en/v2/Git-Internals-The-Refspec>`_. With :code:`init` command, you can change :code:`asterisk` part, but skeleton remains the same: :code:`refs/heads/<pattern>:refs/remotes/<remote>/<pattern>`\n* Second can be specified every time you want to create new branch. For that you use :code:`--pattern` argument when calling :code:`git trunk start` command. Here you specify :code:`regex` pattern to further filter branches. This filtering option is used after fetched branches are filtered by refpsec pattern.\n\nfinish\n------\n\n:code:`finish` command is used to finish your temporary branch. In usual case, it is merged into trunk branch, pushed remotely and then remote respective branch is removed alongside local copy.\n\nCurrently the only exception is if you use branch that has :code:`release` prefix (:code:`init` command argument is :code:`--release-branch-prefix`). In this case such branch is recognized as release branch. When such branch is finished, it is only deleted, but not meged back into trunk. The reason is that release branches usually should not be merged into trunk.\n\nBranches by default will be merged with :code:`--ff-only` flag. You can change to :code:`--no-ff` flag with :code:`init` command.\n\nrelease\n-------\n\n:code:`release` command is used to create release tag.\n\nBy default version is created using current latest commit on a branch you are on. But it is possible to use specific reference to tag on (with :code:`--ref` argument).\n\nAlso release will be cancelled if there are no new changes after latest tag was created.\n\nCurrently there are two possible ways to manage versions:\n\n* Generic versioning. With generic, you need to manually specify new version every time. For that you use :code:`--version` argument, where you enter new version.\n* Semver versioning, which uses python :code:`semver` module as a base to manage version bumping. By default :code:`minor` part is used, but with :code:`--part` argument, you can specify other parts :code:`semver` module currently supports.\n\nIt is also possible to specify prefix for version. If prefix is used (it is set with :code:`init` command), custom version must be specified without prefix, so prefix would not be \"duplicated\".\n\nTag default message uses default template, where header line is version name and body is filled with abbreviated commits and their header lines being tagged. By default, tag message is opened for editing before being saved. Can be disabled if needed.\n\nrefresh\n-------\n\n:code:`refresh` command is used to update your current branch with new changes from trunk. It can also be used on trunk branch itself.\n\nWhen you are on working branch, and :code:`refresh` command is called, your changes are stashed, then branch is changed to trunk, which then is rebased with its tracking branch (if it has upstream). Then branch is changed back to your working one, new trunk changes rebased on your working branch and stashed changes applied (if there were any).\n\nSome other :code:`git-trunk` commands use refresh command internally to update code before executing command specific actions.\n\nIf there are conflicts during refresh, command execution stops and conflicts must be resolved (if stashes were applied, dont forget to reapply them after solving conflicts).\n\nsquash\n------\n\n:code:`squash` command is used to squash multiple commits. Squash can't be done on trunk branch.\n\nBefore initiating squash itself, branch is refreshed with newest trunk branch changes, to make sure branch is up to date.\n\nBy default it tries to squash all ahead trunk commits into first one. It is possible to specify how many commits to squash with :code:`--count` argument. Value cant be greater than maximum possible commits to squash on that branch (or actually default count that is used).\n\nBy default squash message generated is to concatenate all commit messages (including commit other commits are being squashed into). It is also possible to specify custom commit message, which replaces default message. It is also possible to not specify any message (but then edit mode must be enabled to enter one manually).\n\nBy default squash message edit is enabled, which allows to edit tag message before it is saved. Can be disabled if needed.\n\n|\n\n*Contributors*\n\n* Andrius Laukavičius (Focusate)", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/focusate/git-trunk", "keywords": "", "license": "LGPLv3", "maintainer": "", "maintainer_email": "", "name": "git-trunk", "package_url": "https://pypi.org/project/git-trunk/", "platform": "", "project_url": "https://pypi.org/project/git-trunk/", "project_urls": {"Homepage": "https://github.com/focusate/git-trunk"}, "release_url": "https://pypi.org/project/git-trunk/0.1.0/", "requires_dist": null, "requires_python": "", "summary": "Git Trunk based workflow", "version": "0.1.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <a href=\"https://travis-ci.com/focusate/git-trunk\" rel=\"nofollow\"><img alt=\"https://travis-ci.com/focusate/git-trunk.svg?branch=master\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/10f15adc1b921d514a3534cb5c678a90ea280b83/68747470733a2f2f7472617669732d63692e636f6d2f666f6375736174652f6769742d7472756e6b2e7376673f6272616e63683d6d6173746572\"></a>\n<div id=\"git-trunk-based-workflow\">\n<h2>Git Trunk based workflow</h2>\n<p>Adds git-trunk commands that automates some common git procedures.</p>\n<p>Usage: <code>git trunk &lt;command&gt;</code></p>\n<p>Possible commands:</p>\n<ul>\n<li><code>init</code>: initialize trunk configuration to be used for other commands.</li>\n<li><code>start</code>: create new branch specifying custom name or use patterns to fetch/filter remote branches. First match is used to create local branch.</li>\n<li><code>finish</code>: finish active branch by merging it to trunk (then remove it).</li>\n<li><code>release</code>: create tag with new release version.</li>\n<li><code>refresh</code>: update trunk branch and rebase it on active branch.</li>\n<li><code>squash</code>: squash commits on active branch.</li>\n</ul>\n<p>Code was tested using <code>git version 2.25.1</code>.</p>\n<p>Source code in:</p>\n<ul>\n<li><a href=\"https://github.com/focusate/git-trunk/\" rel=\"nofollow\">github</a>.</li>\n<li><a href=\"https://pypi.org/project/git_trunk/\" rel=\"nofollow\">pypi</a>.</li>\n</ul>\n<div id=\"quick-start\">\n<h3>Quick Start</h3>\n<p>For easier use, commands should be called when git repository is your working directory. If you need to call outside working directory, you can use <code>--repo-path</code> argument, where you specify for which repository it should be called.</p>\n<p>To know which commands are available, use <code>git trunk -h</code></p>\n<p>To know what arguments are available and what they do for each command, use <code>git trunk &lt;command&gt; -h</code> or <code>git trunk &lt;command&gt; --help</code></p>\n<p>Remote used is identified by your current branch tracking branch remote. If your current branch does not have tracking branch, then trunk branch tracking branch is checked. If trunk branch does not have tracking branch set, then it is assumed no remote is used for <code>git-trunk</code> workflow.</p>\n<div id=\"init\">\n<h4>init</h4>\n<p><code>init</code> command is used to initialize git trunk configuration that is later reused for other commands. usually it is meant to be called once, where you specify options to set on configuration. Configuration is saved on your repository inside <code>.git/config</code> file. Trunk sections are named <code>trunk</code>.</p>\n<p>When using <code>init</code> command, by default it runs in “interactive” mode, where you have to confirm default option values or enter new ones. If you want to specify all options without a prompt, use <code>--no-confirm</code> flag. With this flag, you can specify other argument and it will set without asking you to confirm it.</p>\n<p>If you need to change configuration, you can just call <code>init</code> command again by specifying options you want to change. Options not specified, will be assumed that old values must be kept.</p>\n</div>\n<div id=\"start\">\n<h4>start</h4>\n<p><code>start</code> command is used to create new branch locally.</p>\n<p>Branch that is created, uses your <code>trunk</code> branch as a fork. <code>trunk</code> branch is always rebased from remote <code>trunk</code> before creating new branch (if of course remote is used).</p>\n<p>When branch is created using <code>start</code> command, by default it will also try to set upstream for it. To not set upstream, use <code>--no-set-upstream</code> flag when running <code>start</code> command.</p>\n<p>If you need to create new branch that is not already on remote, you can use <code>--name</code> argument. It will simply try to create new branch (given it does not exist already) forking from your trunk branch.</p>\n<p>If you use system where branches are created on remote automatically (like tasks), you can configure <code>git-trunk</code> to fetch specific branches only that are meant for you. <code>start</code> command will try to fetch the first one (naturally sorting branch names) from remotely existing branches you filtered. If remote branch is already used as tracking branch for existing local branch, such branch is ignored and not used in automatic branch creation.</p>\n<p>There are two ways to filter (can be combined):</p>\n<ul>\n<li>First one is by using <code>fetchbranchpattern</code> option. By default it fetches all available branches from your remote. To limit what is fetched, with <code>init</code> command, for example you can set <code>*-my</code> value for argument <code>--fetch-branch-pattern</code>. With such pattern, it will only fetch branches which names end with <code>-my</code> part. Pattern uses git <a href=\"https://git-scm.com/book/en/v2/Git-Internals-The-Refspec\" rel=\"nofollow\">refspec</a>. With <code>init</code> command, you can change <code>asterisk</code> part, but skeleton remains the same: <code>refs/heads/&lt;pattern&gt;:refs/remotes/&lt;remote&gt;/&lt;pattern&gt;</code></li>\n<li>Second can be specified every time you want to create new branch. For that you use <code>--pattern</code> argument when calling <code>git trunk start</code> command. Here you specify <code>regex</code> pattern to further filter branches. This filtering option is used after fetched branches are filtered by refpsec pattern.</li>\n</ul>\n</div>\n<div id=\"finish\">\n<h4>finish</h4>\n<p><code>finish</code> command is used to finish your temporary branch. In usual case, it is merged into trunk branch, pushed remotely and then remote respective branch is removed alongside local copy.</p>\n<p>Currently the only exception is if you use branch that has <code>release</code> prefix (<code>init</code> command argument is <code>--release-branch-prefix</code>). In this case such branch is recognized as release branch. When such branch is finished, it is only deleted, but not meged back into trunk. The reason is that release branches usually should not be merged into trunk.</p>\n<p>Branches by default will be merged with <code>--ff-only</code> flag. You can change to <code>--no-ff</code> flag with <code>init</code> command.</p>\n</div>\n<div id=\"release\">\n<h4>release</h4>\n<p><code>release</code> command is used to create release tag.</p>\n<p>By default version is created using current latest commit on a branch you are on. But it is possible to use specific reference to tag on (with <code>--ref</code> argument).</p>\n<p>Also release will be cancelled if there are no new changes after latest tag was created.</p>\n<p>Currently there are two possible ways to manage versions:</p>\n<ul>\n<li>Generic versioning. With generic, you need to manually specify new version every time. For that you use <code>--version</code> argument, where you enter new version.</li>\n<li>Semver versioning, which uses python <code>semver</code> module as a base to manage version bumping. By default <code>minor</code> part is used, but with <code>--part</code> argument, you can specify other parts <code>semver</code> module currently supports.</li>\n</ul>\n<p>It is also possible to specify prefix for version. If prefix is used (it is set with <code>init</code> command), custom version must be specified without prefix, so prefix would not be “duplicated”.</p>\n<p>Tag default message uses default template, where header line is version name and body is filled with abbreviated commits and their header lines being tagged. By default, tag message is opened for editing before being saved. Can be disabled if needed.</p>\n</div>\n<div id=\"refresh\">\n<h4>refresh</h4>\n<p><code>refresh</code> command is used to update your current branch with new changes from trunk. It can also be used on trunk branch itself.</p>\n<p>When you are on working branch, and <code>refresh</code> command is called, your changes are stashed, then branch is changed to trunk, which then is rebased with its tracking branch (if it has upstream). Then branch is changed back to your working one, new trunk changes rebased on your working branch and stashed changes applied (if there were any).</p>\n<p>Some other <code>git-trunk</code> commands use refresh command internally to update code before executing command specific actions.</p>\n<p>If there are conflicts during refresh, command execution stops and conflicts must be resolved (if stashes were applied, dont forget to reapply them after solving conflicts).</p>\n</div>\n<div id=\"squash\">\n<h4>squash</h4>\n<p><code>squash</code> command is used to squash multiple commits. Squash can’t be done on trunk branch.</p>\n<p>Before initiating squash itself, branch is refreshed with newest trunk branch changes, to make sure branch is up to date.</p>\n<p>By default it tries to squash all ahead trunk commits into first one. It is possible to specify how many commits to squash with <code>--count</code> argument. Value cant be greater than maximum possible commits to squash on that branch (or actually default count that is used).</p>\n<p>By default squash message generated is to concatenate all commit messages (including commit other commits are being squashed into). It is also possible to specify custom commit message, which replaces default message. It is also possible to not specify any message (but then edit mode must be enabled to enter one manually).</p>\n<p>By default squash message edit is enabled, which allows to edit tag message before it is saved. Can be disabled if needed.</p>\n<div>\n<div><br></div>\n</div>\n<p><em>Contributors</em></p>\n<ul>\n<li>Andrius Laukavičius (Focusate)</li>\n</ul>\n</div>\n</div>\n</div>\n\n          </div>"}, "last_serial": 6927646, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "6e1d37ba6b843d91bb1674c5048f5084", "sha256": "95888075615aa581a64558feb9ab4ded06651b80b9b1d9e1e064db351fc0b6e4"}, "downloads": -1, "filename": "git_trunk-0.1.0.tar.gz", "has_sig": false, "md5_digest": "6e1d37ba6b843d91bb1674c5048f5084", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 31978, "upload_time": "2020-04-01T13:28:03", "upload_time_iso_8601": "2020-04-01T13:28:03.215416Z", "url": "https://files.pythonhosted.org/packages/50/38/634b34ae9fb3577ebb0b99d69d64c0cb08db89249d897b791b9f9251b44e/git_trunk-0.1.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "6e1d37ba6b843d91bb1674c5048f5084", "sha256": "95888075615aa581a64558feb9ab4ded06651b80b9b1d9e1e064db351fc0b6e4"}, "downloads": -1, "filename": "git_trunk-0.1.0.tar.gz", "has_sig": false, "md5_digest": "6e1d37ba6b843d91bb1674c5048f5084", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 31978, "upload_time": "2020-04-01T13:28:03", "upload_time_iso_8601": "2020-04-01T13:28:03.215416Z", "url": "https://files.pythonhosted.org/packages/50/38/634b34ae9fb3577ebb0b99d69d64c0cb08db89249d897b791b9f9251b44e/git_trunk-0.1.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:56:44 2020"}