{"info": {"author": "Matthieu Moy", "author_email": "git@matthieu-moy.fr", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Environment :: No Input/Output (Daemon)", "Intended Audience :: Developers", "Intended Audience :: System Administrators", "License :: OSI Approved :: GNU General Public License v2 (GPLv2)", "Operating System :: OS Independent", "Programming Language :: Python :: 2", "Programming Language :: Python :: 3", "Topic :: Communications :: Email", "Topic :: Software Development :: Version Control"], "description": "git-multimail version 1.5.0\n===========================\n\n.. image:: https://travis-ci.org/git-multimail/git-multimail.svg?branch=master\n    :target: https://travis-ci.org/git-multimail/git-multimail\n\ngit-multimail is a tool for sending notification emails on pushes to a\nGit repository.  It includes a Python module called ``git_multimail.py``,\nwhich can either be used as a hook script directly or can be imported\nas a Python module into another script.\n\ngit-multimail is derived from the Git project's old\ncontrib/hooks/post-receive-email, and is mostly compatible with that\nscript.  See README.migrate-from-post-receive-email for details about\nthe differences and for how to migrate from post-receive-email to\ngit-multimail.\n\ngit-multimail, like the rest of the Git project, is licensed under\nGPLv2 (see the COPYING file for details).\n\nPlease note: although, as a convenience, git-multimail may be\ndistributed along with the main Git project, development of\ngit-multimail takes place in its own, separate project.  Please, read\n`<https://github.com/git-multimail/git-multimail/blob/master/CONTRIBUTING.rst>`__ for more information.\n\n\nBy default, for each push received by the repository, git-multimail:\n\n1. Outputs one email summarizing each reference that was changed.\n   These \"reference change\" (called \"refchange\" below) emails describe\n   the nature of the change (e.g., was the reference created, deleted,\n   fast-forwarded, etc.) and include a one-line summary of each commit\n   that was added to the reference.\n\n2. Outputs one email for each new commit that was introduced by the\n   reference change.  These \"commit\" emails include a list of the\n   files changed by the commit, followed by the diffs of files\n   modified by the commit.  The commit emails are threaded to the\n   corresponding reference change email via \"In-Reply-To\".  This style\n   (similar to the \"git format-patch\" style used on the Git mailing\n   list) makes it easy to scan through the emails, jump to patches\n   that need further attention, and write comments about specific\n   commits.  Commits are handled in reverse topological order (i.e.,\n   parents shown before children).  For example::\n\n     [git] branch master updated\n     + [git] 01/08: doc: fix xref link from api docs to manual pages\n     + [git] 02/08: api-credentials.txt: show the big picture first\n     + [git] 03/08: api-credentials.txt: mention credential.helper explicitly\n     + [git] 04/08: api-credentials.txt: add \"see also\" section\n     + [git] 05/08: t3510 (cherry-pick-sequence): add missing '&&'\n     + [git] 06/08: Merge branch 'rr/maint-t3510-cascade-fix'\n     + [git] 07/08: Merge branch 'mm/api-credentials-doc'\n     + [git] 08/08: Git 1.7.11-rc2\n\n   By default, each commit appears in exactly one commit email, the\n   first time that it is pushed to the repository.  If a commit is later\n   merged into another branch, then a one-line summary of the commit\n   is included in the reference change email (as usual), but no\n   additional commit email is generated. See\n   `multimailhook.refFilter(Inclusion|Exclusion|DoSend|DontSend)Regex`\n   below to configure which branches and tags are watched by the hook.\n\n   By default, reference change emails have their \"Reply-To\" field set\n   to the person who pushed the change, and commit emails have their\n   \"Reply-To\" field set to the author of the commit.\n\n3. Output one \"announce\" mail for each new annotated tag, including\n   information about the tag and optionally a shortlog describing the\n   changes since the previous tag.  Such emails might be useful if you\n   use annotated tags to mark releases of your project.\n\n\nRequirements\n------------\n\n* Python 2.x, version 2.4 or later.  No non-standard Python modules\n  are required.  git-multimail has preliminary support for Python 3\n  (but it has been better tested with Python 2).\n\n* The ``git`` command must be in your PATH.  git-multimail is known to\n  work with Git versions back to 1.7.1.  (Earlier versions have not\n  been tested; if you do so, please report your results.)\n\n* To send emails using the default configuration, a standard sendmail\n  program must be located at '/usr/sbin/sendmail' or\n  '/usr/lib/sendmail' and must be configured correctly to send emails.\n  If this is not the case, set multimailhook.sendmailCommand, or see\n  the multimailhook.mailer configuration variable below for how to\n  configure git-multimail to send emails via an SMTP server.\n\n* git-multimail is currently tested only on Linux. It may or may not\n  work on other platforms such as Windows and Mac OS. See\n  `<https://github.com/git-multimail/git-multimail/blob/master/CONTRIBUTING.rst>`__ to improve the situation.\n\n\nInvocation\n----------\n\n``git_multimail.py`` is designed to be used as a ``post-receive`` hook in a\nGit repository (see githooks(5)).  Link or copy it to\n$GIT_DIR/hooks/post-receive within the repository for which email\nnotifications are desired.  Usually it should be installed on the\ncentral repository for a project, to which all commits are eventually\npushed.\n\nFor use on pre-v1.5.1 Git servers, ``git_multimail.py`` can also work as\nan ``update`` hook, taking its arguments on the command line.  To use\nthis script in this manner, link or copy it to $GIT_DIR/hooks/update.\nPlease note that the script is not completely reliable in this mode\n[1]_.\n\nAlternatively, ``git_multimail.py`` can be imported as a Python module\ninto your own Python post-receive script.  This method is a bit more\nwork, but allows the behavior of the hook to be customized using\narbitrary Python code.  For example, you can use a custom environment\n(perhaps inheriting from GenericEnvironment or GitoliteEnvironment) to\n\n* change how the user who did the push is determined\n\n* read users' email addresses from an LDAP server or from a database\n\n* decide which users should be notified about which commits based on\n  the contents of the commits (e.g., for users who want to be notified\n  only about changes affecting particular files or subdirectories)\n\nOr you can change how emails are sent by writing your own Mailer\nclass.  The ``post-receive`` script in this directory demonstrates how\nto use ``git_multimail.py`` as a Python module.  (If you make interesting\nchanges of this type, please consider sharing them with the\ncommunity.)\n\n\nTroubleshooting/FAQ\n-------------------\n\nPlease read `<https://github.com/git-multimail/git-multimail/blob/master/doc/troubleshooting.rst>`__ for frequently asked\nquestions and common issues with git-multimail.\n\n\nConfiguration\n-------------\n\nBy default, git-multimail mostly takes its configuration from the\nfollowing ``git config`` settings:\n\nmultimailhook.environment\n    This describes the general environment of the repository. In most\n    cases, you do not need to specify a value for this variable:\n    `git-multimail` will autodetect which environment to use.\n    Currently supported values:\n\n    generic\n      the username of the pusher is read from $USER or $USERNAME and\n      the repository name is derived from the repository's path.\n\n    gitolite\n      Environment to use when ``git-multimail`` is ran as a gitolite_\n      hook.\n\n      The username of the pusher is read from $GL_USER, the repository\n      name is read from $GL_REPO, and the From: header value is\n      optionally read from gitolite.conf (see multimailhook.from).\n\n      For more information about gitolite and git-multimail, read\n      `<https://github.com/git-multimail/git-multimail/blob/master/doc/gitolite.rst>`__\n\n    stash\n      Environment to use when ``git-multimail`` is ran as an Atlassian\n      BitBucket Server (formerly known as Atlassian Stash) hook.\n\n      **Warning:** this mode was provided by a third-party contributor\n      and never tested by the git-multimail maintainers. It is\n      provided as-is and may or may not work for you.\n\n      This value is automatically assumed when the stash-specific\n      flags (``--stash-user`` and ``--stash-repo``) are specified on\n      the command line. When this environment is active, the username\n      and repo come from these two command line flags, which must be\n      specified.\n\n    gerrit\n      Environment to use when ``git-multimail`` is ran as a\n      ``ref-updated`` Gerrit hook.\n\n      This value is used when the gerrit-specific command line flags\n      (``--oldrev``, ``--newrev``, ``--refname``, ``--project``) for\n      gerrit's ref-updated hook are present. When this environment is\n      active, the username of the pusher is taken from the\n      ``--submitter`` argument if that command line option is passed,\n      otherwise 'Gerrit' is used. The repository name is taken from\n      the ``--project`` option on the command line, which must be passed.\n\n      For more information about gerrit and git-multimail, read\n      `<https://github.com/git-multimail/git-multimail/blob/master/doc/gerrit.rst>`__\n\n    If none of these environments is suitable for your setup, then you\n    can implement a Python class that inherits from Environment and\n    instantiate it via a script that looks like the example\n    post-receive script.\n\n    The environment value can be specified on the command line using\n    the ``--environment`` option. If it is not specified on the\n    command line or by ``multimailhook.environment``, the value is\n    guessed as follows:\n\n    * If stash-specific (respectively gerrit-specific) command flags\n      are present on the command-line, then ``stash`` (respectively\n      ``gerrit``) is used.\n\n    * If the environment variables $GL_USER and $GL_REPO are set, then\n      ``gitolite`` is used.\n\n    * If none of the above apply, then ``generic`` is used.\n\nmultimailhook.repoName\n    A short name of this Git repository, to be used in various places\n    in the notification email text.  The default is to use $GL_REPO\n    for gitolite repositories, or otherwise to derive this value from\n    the repository path name.\n\nmultimailhook.mailingList\n    The list of email addresses to which notification emails should be\n    sent, as RFC 2822 email addresses separated by commas.  This\n    configuration option can be multivalued.  Leave it unset or set it\n    to the empty string to not send emails by default.  The next few\n    settings can be used to configure specific address lists for\n    specific types of notification email.\n\nmultimailhook.refchangeList\n    The list of email addresses to which summary emails about\n    reference changes should be sent, as RFC 2822 email addresses\n    separated by commas.  This configuration option can be\n    multivalued.  The default is the value in\n    multimailhook.mailingList.  Set this value to \"none\" (or the empty\n    string) to prevent reference change emails from being sent even if\n    multimailhook.mailingList is set.\n\nmultimailhook.announceList\n    The list of email addresses to which emails about new annotated\n    tags should be sent, as RFC 2822 email addresses separated by\n    commas.  This configuration option can be multivalued.  The\n    default is the value in multimailhook.refchangeList or\n    multimailhook.mailingList.  Set this value to \"none\" (or the empty\n    string) to prevent annotated tag announcement emails from being sent\n    even if one of the other values is set.\n\nmultimailhook.commitList\n    The list of email addresses to which emails about individual new\n    commits should be sent, as RFC 2822 email addresses separated by\n    commas.  This configuration option can be multivalued.  The\n    default is the value in multimailhook.mailingList.  Set this value\n    to \"none\" (or the empty string) to prevent notification emails about\n    individual commits from being sent even if\n    multimailhook.mailingList is set.\n\nmultimailhook.announceShortlog\n    If this option is set to true, then emails about changes to\n    annotated tags include a shortlog of changes since the previous\n    tag.  This can be useful if the annotated tags represent releases;\n    then the shortlog will be a kind of rough summary of what has\n    happened since the last release.  But if your tagging policy is\n    not so straightforward, then the shortlog might be confusing\n    rather than useful.  Default is false.\n\nmultimailhook.commitEmailFormat\n    The format of email messages for the individual commits, can be \"text\" or\n    \"html\". In the latter case, the emails will include diffs using colorized\n    HTML instead of plain text used by default. Note that this  currently the\n    ref change emails are always sent in plain text.\n\n    Note that when using \"html\", the formatting is done by parsing the\n    output of ``git log`` with ``-p``. When using\n    ``multimailhook.commitLogOpts`` to specify a ``--format`` for\n    ``git log``, one may get false positive (e.g. lines in the body of\n    the message starting with ``+++`` or ``---`` colored in red or\n    green).\n\n    By default, all the message is HTML-escaped. See\n    ``multimailhook.htmlInIntro`` to change this behavior.\n\nmultimailhook.commitBrowseURL\n    Used to generate a link to an online repository browser in commit\n    emails. This variable must be a string. Format directives like\n    ``%(<variable>)s`` will be expanded the same way as template\n    strings. In particular, ``%(id)s`` will be replaced by the full\n    Git commit identifier (40-chars hexadecimal).\n\n    If the string does not contain any format directive, then\n    ``%(id)s`` will be automatically added to the string. If you don't\n    want ``%(id)s`` to be automatically added, use the empty format\n    directive ``%()s`` anywhere in the string.\n\n    For example, a suitable value for the git-multimail project itself\n    would be\n    ``https://github.com/git-multimail/git-multimail/commit/%(id)s``.\n\nmultimailhook.htmlInIntro, multimailhook.htmlInFooter\n    When generating an HTML message, git-multimail escapes any HTML\n    sequence by default. This means that if a template contains HTML\n    like ``<a href=\"foo\">link</a>``, the reader will see the HTML\n    source code and not a proper link.\n\n    Set ``multimailhook.htmlInIntro`` to true to allow writing HTML\n    formatting in introduction templates. Similarly, set\n    ``multimailhook.htmlInFooter`` for HTML in the footer.\n\n    Variables expanded in the template are still escaped. For example,\n    if a repository's path contains a ``<``, it will be rendered as\n    such in the message.\n\n    Read `<https://github.com/git-multimail/git-multimail/blob/master/doc/customizing-emails.rst>`__ for more details and\n    examples.\n\nmultimailhook.refchangeShowGraph\n    If this option is set to true, then summary emails about reference\n    changes will additionally include:\n\n    * a graph of the added commits (if any)\n\n    * a graph of the discarded commits (if any)\n\n    The log is generated by running ``git log --graph`` with the options\n    specified in graphOpts.  The default is false.\n\nmultimailhook.refchangeShowLog\n    If this option is set to true, then summary emails about reference\n    changes will include a detailed log of the added commits in\n    addition to the one line summary.  The log is generated by running\n    ``git log`` with the options specified in multimailhook.logOpts.\n    Default is false.\n\nmultimailhook.mailer\n    This option changes the way emails are sent.  Accepted values are:\n\n    * **sendmail (the default)**: use the command ``/usr/sbin/sendmail`` or\n      ``/usr/lib/sendmail`` (or sendmailCommand, if configured).  This\n      mode can be further customized via the following options:\n\n      multimailhook.sendmailCommand\n          The command used by mailer ``sendmail`` to send emails.  Shell\n          quoting is allowed in the value of this setting, but remember that\n          Git requires double-quotes to be escaped; e.g.::\n\n              git config multimailhook.sendmailcommand '/usr/sbin/sendmail -oi -t -F \\\"Git Repo\\\"'\n\n          Default is '/usr/sbin/sendmail -oi -t' or\n          '/usr/lib/sendmail -oi -t' (depending on which file is\n          present and executable).\n\n      multimailhook.envelopeSender\n          If set then pass this value to sendmail via the -f option to set\n          the envelope sender address.\n\n    * **smtp**: use Python's smtplib.  This is useful when the sendmail\n      command is not available on the system.  This mode can be\n      further customized via the following options:\n\n      multimailhook.smtpServer\n          The name of the SMTP server to connect to.  The value can\n          also include a colon and a port number; e.g.,\n          ``mail.example.com:25``.  Default is 'localhost' using port 25.\n\n      multimailhook.smtpUser, multimailhook.smtpPass\n          Server username and password. Required if smtpEncryption is 'ssl'.\n          Note that the username and password currently need to be\n          set cleartext in the configuration file, which is not\n          recommended. If you need to use this option, be sure your\n          configuration file is read-only.\n\n      multimailhook.envelopeSender\n        The sender address to be passed to the SMTP server.  If\n        unset, then the value of multimailhook.from is used.\n\n      multimailhook.smtpServerTimeout\n        Timeout in seconds. Default is 10.\n\n      multimailhook.smtpEncryption\n        Set the security type. Allowed values: ``none``, ``ssl``, ``tls`` (starttls).\n        Default is ``none``.\n\n      multimailhook.smtpCACerts\n        Set the path to a list of trusted CA certificate to verify the\n        server certificate, only supported when ``smtpEncryption`` is\n        ``tls``. If unset or empty, the server certificate is not\n        verified. If it targets a file containing a list of trusted CA\n        certificates (PEM format) these CAs will be used to verify the\n        server certificate. For debian, you can set\n        ``/etc/ssl/certs/ca-certificates.crt`` for using the system\n        trusted CAs. For self-signed server, you can add your server\n        certificate to the system store::\n\n            cd /usr/local/share/ca-certificates/\n            openssl s_client -starttls smtp \\\n                   -connect mail.example.net:587 -showcerts \\\n                   </dev/null 2>/dev/null \\\n                 | openssl x509 -outform PEM >mail.example.net.crt\n            update-ca-certificates\n\n        and used the updated ``/etc/ssl/certs/ca-certificates.crt``. Or\n        directly use your ``/path/to/mail.example.net.crt``. Default is\n        unset.\n\n      multimailhook.smtpServerDebugLevel\n        Integer number. Set to greater than 0 to activate debugging.\n\nmultimailhook.from, multimailhook.fromCommit, multimailhook.fromRefchange\n    If set, use this value in the From: field of generated emails.\n    ``fromCommit`` is used for commit emails, ``fromRefchange`` is\n    used for refchange emails, and ``from`` is used as fall-back in\n    all cases.\n\n    The value for these variables can be either:\n\n    - An email address, which will be used directly.\n\n    - The value ``pusher``, in which case the pusher's address (if\n      available) will be used.\n\n    - The value ``author`` (meaningful only for ``fromCommit``), in which\n      case the commit author's address will be used.\n\n    If config values are unset, the value of the From: header is\n    determined as follows:\n\n    1. (gitolite environment only)\n       1.a) If ``multimailhook.MailaddressMap`` is set, and is a path\n       to an existing file (if relative, it is considered relative to\n       the place where ``gitolite.conf`` is located), then this file\n       should contain lines like::\n\n           username Firstname Lastname <email@example.com>\n\n       git-multimail will then look for a line where ``$GL_USER``\n       matches the ``username`` part, and use the rest of the line for\n       the ``From:`` header.\n\n       1.b) Parse gitolite.conf, looking for a block of comments that\n       looks like this::\n\n           # BEGIN USER EMAILS\n           # username Firstname Lastname <email@example.com>\n           # END USER EMAILS\n\n       If that block exists, and there is a line between the BEGIN\n       USER EMAILS and END USER EMAILS lines where the first field\n       matches the gitolite username ($GL_USER), use the rest of the\n       line for the From: header.\n\n    2. If the user.email configuration setting is set, use its value\n       (and the value of user.name, if set).\n\n    3. Use the value of multimailhook.envelopeSender.\n\nmultimailhook.MailaddressMap\n    (gitolite environment only)\n    File to look for a ``From:`` address based on the user doing the\n    push. Defaults to unset. See ``multimailhook.from`` for details.\n\nmultimailhook.administrator\n    The name and/or email address of the administrator of the Git\n    repository; used in FOOTER_TEMPLATE.  Default is\n    multimailhook.envelopesender if it is set; otherwise a generic\n    string is used.\n\nmultimailhook.emailPrefix\n    All emails have this string prepended to their subjects, to aid\n    email filtering (though filtering based on the X-Git-* email\n    headers is probably more robust).  Default is the short name of\n    the repository in square brackets; e.g., ``[myrepo]``.  Set this\n    value to the empty string to suppress the email prefix. You may\n    use the placeholder ``%(repo_shortname)s`` for the short name of\n    the repository.\n\nmultimailhook.emailMaxLines\n    The maximum number of lines that should be included in the body of\n    a generated email.  If not specified, there is no limit.  Lines\n    beyond the limit are suppressed and counted, and a final line is\n    added indicating the number of suppressed lines.\n\nmultimailhook.emailMaxLineLength\n    The maximum length of a line in the email body.  Lines longer than\n    this limit are truncated to this length with a trailing ``[...]``\n    added to indicate the missing text.  The default is 500, because\n    (a) diffs with longer lines are probably from binary files, for\n    which a diff is useless, and (b) even if a text file has such long\n    lines, the diffs are probably unreadable anyway.  To disable line\n    truncation, set this option to 0.\n\nmultimailhook.subjectMaxLength\n    The maximum length of the subject line (i.e. the ``oneline`` field\n    in templates, not including the prefix). Lines longer than this\n    limit are truncated to this length with a trailing ``[...]`` added\n    to indicate the missing text. This option The default is to use\n    ``multimailhook.emailMaxLineLength``. This option avoids sending\n    emails with overly long subject lines, but should not be needed if\n    the commit messages follow the Git convention (one short subject\n    line, then a blank line, then the message body). To disable line\n    truncation, set this option to 0.\n\nmultimailhook.maxCommitEmails\n    The maximum number of commit emails to send for a given change.\n    When the number of patches is larger that this value, only the\n    summary refchange email is sent.  This can avoid accidental\n    mailbombing, for example on an initial push.  To disable commit\n    emails limit, set this option to 0.  The default is 500.\n\nmultimailhook.excludeMergeRevisions\n    When sending out revision emails, do not consider merge commits (the\n    functional equivalent of `rev-list --no-merges`).\n    The default is `false` (send merge commit emails).\n\nmultimailhook.emailStrictUTF8\n    If this boolean option is set to `true`, then the main part of the\n    email body is forced to be valid UTF-8.  Any characters that are\n    not valid UTF-8 are converted to the Unicode replacement\n    character, U+FFFD.  The default is `true`.\n\n    This option is ineffective with Python 3, where non-UTF-8\n    characters are unconditionally replaced.\n\nmultimailhook.diffOpts\n    Options passed to ``git diff-tree`` when generating the summary\n    information for ReferenceChange emails.  Default is ``--stat\n    --summary --find-copies-harder``.  Add -p to those options to\n    include a unified diff of changes in addition to the usual summary\n    output.  Shell quoting is allowed; see ``multimailhook.logOpts`` for\n    details.\n\nmultimailhook.graphOpts\n    Options passed to ``git log --graph`` when generating graphs for the\n    reference change summary emails (used only if refchangeShowGraph\n    is true).  The default is '--oneline --decorate'.\n\n    Shell quoting is allowed; see logOpts for details.\n\nmultimailhook.logOpts\n    Options passed to ``git log`` to generate additional info for\n    reference change emails (used only if refchangeShowLog is set).\n    For example, adding -p will show each commit's complete diff.  The\n    default is empty.\n\n    Shell quoting is allowed; for example, a log format that contains\n    spaces can be specified using something like::\n\n      git config multimailhook.logopts '--pretty=format:\"%h %aN <%aE>%n%s%n%n%b%n\"'\n\n    If you want to set this by editing your configuration file\n    directly, remember that Git requires double-quotes to be escaped\n    (see git-config(1) for more information)::\n\n      [multimailhook]\n              logopts = --pretty=format:\\\"%h %aN <%aE>%n%s%n%n%b%n\\\"\n\nmultimailhook.commitLogOpts\n    Options passed to ``git log`` to generate additional info for\n    revision change emails.  For example, adding --ignore-all-spaces\n    will suppress whitespace changes.  The default options are ``-C\n    --stat -p --cc``.  Shell quoting is allowed; see\n    multimailhook.logOpts for details.\n\nmultimailhook.dateSubstitute\n    String to use as a substitute for ``Date:`` in the output of ``git\n    log`` while formatting commit messages. This is useful to avoid\n    emitting a line that can be interpreted by mailers as the start of\n    a cited message (Zimbra webmail in particular). Defaults to\n    ``CommitDate:``. Set to an empty string or ``none`` to deactivate\n    the behavior.\n\nmultimailhook.emailDomain\n    Domain name appended to the username of the person doing the push\n    to convert it into an email address\n    (via ``\"%s@%s\" % (username, emaildomain)``). More complicated\n    schemes can be implemented by overriding Environment and\n    overriding its get_pusher_email() method.\n\nmultimailhook.replyTo, multimailhook.replyToCommit, multimailhook.replyToRefchange\n    Addresses to use in the Reply-To: field for commit emails\n    (replyToCommit) and refchange emails (replyToRefchange).\n    multimailhook.replyTo is used as default when replyToCommit or\n    replyToRefchange is not set. The shortcuts ``pusher`` and\n    ``author`` are allowed with the same semantics as for\n    ``multimailhook.from``. In addition, the value ``none`` can be\n    used to omit the ``Reply-To:`` field.\n\n    The default is ``pusher`` for refchange emails, and ``author`` for\n    commit emails.\n\nmultimailhook.quiet\n    Do not output the list of email recipients from the hook\n\nmultimailhook.stdout\n    For debugging, send emails to stdout rather than to the\n    mailer.  Equivalent to the --stdout command line option\n\nmultimailhook.scanCommitForCc\n    If this option is set to true, than recipients from lines in commit body\n    that starts with ``CC:`` will be added to CC list.\n    Default: false\n\nmultimailhook.combineWhenSingleCommit\n    If this option is set to true and a single new commit is pushed to\n    a branch, combine the summary and commit email messages into a\n    single email.\n    Default: true\n\nmultimailhook.refFilterInclusionRegex, multimailhook.refFilterExclusionRegex, multimailhook.refFilterDoSendRegex, multimailhook.refFilterDontSendRegex\n    **Warning:** these options are experimental. They should work, but\n    the user-interface is not stable yet (in particular, the option\n    names may change). If you want to participate in stabilizing the\n    feature, please contact the maintainers and/or send pull-requests.\n    If you are happy with the current shape of the feature, please\n    report it too.\n\n    Regular expressions that can be used to limit refs for which email\n    updates will be sent.  It is an error to specify both an inclusion\n    and an exclusion regex.  If a ``refFilterInclusionRegex`` is\n    specified, emails will only be sent for refs which match this\n    regex.  If a ``refFilterExclusionRegex`` regex is specified,\n    emails will be sent for all refs except those that match this\n    regex (or that match a predefined regex specific to the\n    environment, such as \"^refs/notes\" for most environments and\n    \"^refs/notes|^refs/changes\" for the gerrit environment).\n\n    The expressions are matched against the complete refname, and is\n    considered to match if any substring matches. For example, to\n    filter-out all tags, set ``refFilterExclusionRegex`` to\n    ``^refs/tags/`` (note the leading ``^`` but no trailing ``$``). If\n    you set ``refFilterExclusionRegex`` to ``master``, then any ref\n    containing ``master`` will be excluded (the ``master`` branch, but\n    also ``refs/tags/master`` or ``refs/heads/foo-master-bar``).\n\n    ``refFilterDoSendRegex`` and ``refFilterDontSendRegex`` are\n    analogous to ``refFilterInclusionRegex`` and\n    ``refFilterExclusionRegex`` with one difference: with\n    ``refFilterDoSendRegex`` and ``refFilterDontSendRegex``, commits\n    introduced by one excluded ref will not be considered as new when\n    they reach an included ref. Typically, if you add a branch ``foo``\n    to  ``refFilterDontSendRegex``, push commits to this branch, and\n    later merge branch ``foo`` into ``master``, then the notification\n    email for ``master`` will contain a commit email only for the\n    merge commit. If you include ``foo`` in\n    ``refFilterExclusionRegex``, then at the time of merge, you will\n    receive one commit email per commit in the branch.\n\n    These variables can be multi-valued, like::\n\n      [multimailhook]\n              refFilterExclusionRegex = ^refs/tags/\n              refFilterExclusionRegex = ^refs/heads/master$\n\n    You can also provide a whitespace-separated list like::\n\n      [multimailhook]\n              refFilterExclusionRegex = ^refs/tags/ ^refs/heads/master$\n\n    Both examples exclude tags and the master branch, and are\n    equivalent to::\n\n      [multimailhook]\n              refFilterExclusionRegex = ^refs/tags/|^refs/heads/master$\n\n    ``refFilterInclusionRegex`` and ``refFilterExclusionRegex`` are\n    strictly stronger than ``refFilterDoSendRegex`` and\n    ``refFilterDontSendRegex``. In other words, adding a ref to a\n    DoSend/DontSend regex has no effect if it is already excluded by a\n    Exclusion/Inclusion regex.\n\nmultimailhook.logFile, multimailhook.errorLogFile, multimailhook.debugLogFile\n\n    When set, these variable designate path to files where\n    git-multimail will log some messages. Normal messages and error\n    messages are sent to ``logFile``, and error messages are also sent\n    to ``errorLogFile``. Debug messages and all other messages are\n    sent to ``debugLogFile``. The recommended way is to set only one\n    of these variables, but it is also possible to set several of them\n    (part of the information is then duplicated in several log files,\n    for example errors are duplicated to all log files).\n\n    Relative path are relative to the Git repository where the push is\n    done.\n\nmultimailhook.verbose\n\n    Verbosity level of git-multimail on its standard output. By\n    default, show only error and info messages. If set to true, show\n    also debug messages.\n\nEmail filtering aids\n--------------------\n\nAll emails include extra headers to enable fine tuned filtering and\ngive information for debugging.  All emails include the headers\n``X-Git-Host``, ``X-Git-Repo``, ``X-Git-Refname``, and ``X-Git-Reftype``.\nReferenceChange emails also include headers ``X-Git-Oldrev`` and ``X-Git-Newrev``;\nRevision emails also include header ``X-Git-Rev``.\n\n\nCustomizing email contents\n--------------------------\n\ngit-multimail mostly generates emails by expanding templates.  The\ntemplates can be customized.  To avoid the need to edit\n``git_multimail.py`` directly, the preferred way to change the templates\nis to write a separate Python script that imports ``git_multimail.py`` as\na module, then replaces the templates in place.  See the provided\npost-receive script for an example of how this is done.\n\n\nCustomizing git-multimail for your environment\n----------------------------------------------\n\ngit-multimail is mostly customized via an \"environment\" that describes\nthe local environment in which Git is running.  Two types of\nenvironment are built in:\n\nGenericEnvironment\n    a stand-alone Git repository.\n\nGitoliteEnvironment\n    a Git repository that is managed by gitolite_.  For such\n    repositories, the identity of the pusher is read from\n    environment variable $GL_USER, the name of the repository is read\n    from $GL_REPO (if it is not overridden by multimailhook.reponame),\n    and the From: header value is optionally read from gitolite.conf\n    (see multimailhook.from).\n\nBy default, git-multimail assumes GitoliteEnvironment if $GL_USER and\n$GL_REPO are set, and otherwise assumes GenericEnvironment.\nAlternatively, you can choose one of these two environments explicitly\nby setting a ``multimailhook.environment`` config setting (which can\nhave the value `generic` or `gitolite`) or by passing an --environment\noption to the script.\n\nIf you need to customize the script in ways that are not supported by\nthe existing environments, you can define your own environment class\nclass using arbitrary Python code.  To do so, you need to import\n``git_multimail.py`` as a Python module, as demonstrated by the example\npost-receive script.  Then implement your environment class; it should\nusually inherit from one of the existing Environment classes and\npossibly one or more of the EnvironmentMixin classes.  Then set the\n``environment`` variable to an instance of your own environment class\nand pass it to ``run_as_post_receive_hook()``.\n\nThe standard environment classes, GenericEnvironment and\nGitoliteEnvironment, are in fact themselves put together out of a\nnumber of mixin classes, each of which handles one aspect of the\ncustomization.  For the finest control over your configuration, you\ncan specify exactly which mixin classes your own environment class\nshould inherit from, and override individual methods (or even add your\nown mixin classes) to implement entirely new behaviors.  If you\nimplement any mixins that might be useful to other people, please\nconsider sharing them with the community!\n\n\nGetting involved\n----------------\n\nPlease, read `<https://github.com/git-multimail/git-multimail/blob/master/CONTRIBUTING.rst>`__ for instructions on how to\ncontribute to git-multimail.\n\n\nFootnotes\n---------\n\n.. [1] Because of the way information is passed to update hooks, the\n       script's method of determining whether a commit has already\n       been seen does not work when it is used as an ``update`` script.\n       In particular, no notification email will be generated for a\n       new commit that is added to multiple references in the same\n       push. A workaround is to use --force-send to force sending the\n       emails.\n\n.. _gitolite: https://github.com/sitaramc/gitolite\n", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/git-multimail/git-multimail", "keywords": "git hook email", "license": "GPLv2", "maintainer": "", "maintainer_email": "", "name": "git-multimail", "package_url": "https://pypi.org/project/git-multimail/", "platform": "", "project_url": "https://pypi.org/project/git-multimail/", "project_urls": {"Homepage": "https://github.com/git-multimail/git-multimail"}, "release_url": "https://pypi.org/project/git-multimail/1.5.0.post1/", "requires_dist": null, "requires_python": "", "summary": "Send notification emails for Git pushes", "version": "1.5.0.post1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <a href=\"https://travis-ci.org/git-multimail/git-multimail\" rel=\"nofollow\"><img alt=\"https://travis-ci.org/git-multimail/git-multimail.svg?branch=master\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2894aaa01f0f792489f1dae3eacba88c7e4a9ab1/68747470733a2f2f7472617669732d63692e6f72672f6769742d6d756c74696d61696c2f6769742d6d756c74696d61696c2e7376673f6272616e63683d6d6173746572\"></a>\n<p>git-multimail is a tool for sending notification emails on pushes to a\nGit repository.  It includes a Python module called <tt>git_multimail.py</tt>,\nwhich can either be used as a hook script directly or can be imported\nas a Python module into another script.</p>\n<p>git-multimail is derived from the Git project’s old\ncontrib/hooks/post-receive-email, and is mostly compatible with that\nscript.  See README.migrate-from-post-receive-email for details about\nthe differences and for how to migrate from post-receive-email to\ngit-multimail.</p>\n<p>git-multimail, like the rest of the Git project, is licensed under\nGPLv2 (see the COPYING file for details).</p>\n<p>Please note: although, as a convenience, git-multimail may be\ndistributed along with the main Git project, development of\ngit-multimail takes place in its own, separate project.  Please, read\n<a href=\"https://github.com/git-multimail/git-multimail/blob/master/CONTRIBUTING.rst\" rel=\"nofollow\">https://github.com/git-multimail/git-multimail/blob/master/CONTRIBUTING.rst</a> for more information.</p>\n<p>By default, for each push received by the repository, git-multimail:</p>\n<ol>\n<li><p>Outputs one email summarizing each reference that was changed.\nThese “reference change” (called “refchange” below) emails describe\nthe nature of the change (e.g., was the reference created, deleted,\nfast-forwarded, etc.) and include a one-line summary of each commit\nthat was added to the reference.</p>\n</li>\n<li><p>Outputs one email for each new commit that was introduced by the\nreference change.  These “commit” emails include a list of the\nfiles changed by the commit, followed by the diffs of files\nmodified by the commit.  The commit emails are threaded to the\ncorresponding reference change email via “In-Reply-To”.  This style\n(similar to the “git format-patch” style used on the Git mailing\nlist) makes it easy to scan through the emails, jump to patches\nthat need further attention, and write comments about specific\ncommits.  Commits are handled in reverse topological order (i.e.,\nparents shown before children).  For example:</p>\n<pre>[git] branch master updated\n+ [git] 01/08: doc: fix xref link from api docs to manual pages\n+ [git] 02/08: api-credentials.txt: show the big picture first\n+ [git] 03/08: api-credentials.txt: mention credential.helper explicitly\n+ [git] 04/08: api-credentials.txt: add \"see also\" section\n+ [git] 05/08: t3510 (cherry-pick-sequence): add missing '&amp;&amp;'\n+ [git] 06/08: Merge branch 'rr/maint-t3510-cascade-fix'\n+ [git] 07/08: Merge branch 'mm/api-credentials-doc'\n+ [git] 08/08: Git 1.7.11-rc2\n</pre>\n<p>By default, each commit appears in exactly one commit email, the\nfirst time that it is pushed to the repository.  If a commit is later\nmerged into another branch, then a one-line summary of the commit\nis included in the reference change email (as usual), but no\nadditional commit email is generated. See\n<cite>multimailhook.refFilter(Inclusion|Exclusion|DoSend|DontSend)Regex</cite>\nbelow to configure which branches and tags are watched by the hook.</p>\n<p>By default, reference change emails have their “Reply-To” field set\nto the person who pushed the change, and commit emails have their\n“Reply-To” field set to the author of the commit.</p>\n</li>\n<li><p>Output one “announce” mail for each new annotated tag, including\ninformation about the tag and optionally a shortlog describing the\nchanges since the previous tag.  Such emails might be useful if you\nuse annotated tags to mark releases of your project.</p>\n</li>\n</ol>\n<div id=\"requirements\">\n<h2>Requirements</h2>\n<ul>\n<li>Python 2.x, version 2.4 or later.  No non-standard Python modules\nare required.  git-multimail has preliminary support for Python 3\n(but it has been better tested with Python 2).</li>\n<li>The <tt>git</tt> command must be in your PATH.  git-multimail is known to\nwork with Git versions back to 1.7.1.  (Earlier versions have not\nbeen tested; if you do so, please report your results.)</li>\n<li>To send emails using the default configuration, a standard sendmail\nprogram must be located at ‘/usr/sbin/sendmail’ or\n‘/usr/lib/sendmail’ and must be configured correctly to send emails.\nIf this is not the case, set multimailhook.sendmailCommand, or see\nthe multimailhook.mailer configuration variable below for how to\nconfigure git-multimail to send emails via an SMTP server.</li>\n<li>git-multimail is currently tested only on Linux. It may or may not\nwork on other platforms such as Windows and Mac OS. See\n<a href=\"https://github.com/git-multimail/git-multimail/blob/master/CONTRIBUTING.rst\" rel=\"nofollow\">https://github.com/git-multimail/git-multimail/blob/master/CONTRIBUTING.rst</a> to improve the situation.</li>\n</ul>\n</div>\n<div id=\"invocation\">\n<h2>Invocation</h2>\n<p><tt>git_multimail.py</tt> is designed to be used as a <tt><span class=\"pre\">post-receive</span></tt> hook in a\nGit repository (see githooks(5)).  Link or copy it to\n$GIT_DIR/hooks/post-receive within the repository for which email\nnotifications are desired.  Usually it should be installed on the\ncentral repository for a project, to which all commits are eventually\npushed.</p>\n<p>For use on pre-v1.5.1 Git servers, <tt>git_multimail.py</tt> can also work as\nan <tt>update</tt> hook, taking its arguments on the command line.  To use\nthis script in this manner, link or copy it to $GIT_DIR/hooks/update.\nPlease note that the script is not completely reliable in this mode\n<a href=\"#id2\" id=\"id1\" rel=\"nofollow\">[1]</a>.</p>\n<p>Alternatively, <tt>git_multimail.py</tt> can be imported as a Python module\ninto your own Python post-receive script.  This method is a bit more\nwork, but allows the behavior of the hook to be customized using\narbitrary Python code.  For example, you can use a custom environment\n(perhaps inheriting from GenericEnvironment or GitoliteEnvironment) to</p>\n<ul>\n<li>change how the user who did the push is determined</li>\n<li>read users’ email addresses from an LDAP server or from a database</li>\n<li>decide which users should be notified about which commits based on\nthe contents of the commits (e.g., for users who want to be notified\nonly about changes affecting particular files or subdirectories)</li>\n</ul>\n<p>Or you can change how emails are sent by writing your own Mailer\nclass.  The <tt><span class=\"pre\">post-receive</span></tt> script in this directory demonstrates how\nto use <tt>git_multimail.py</tt> as a Python module.  (If you make interesting\nchanges of this type, please consider sharing them with the\ncommunity.)</p>\n</div>\n<div id=\"troubleshooting-faq\">\n<h2>Troubleshooting/FAQ</h2>\n<p>Please read <a href=\"https://github.com/git-multimail/git-multimail/blob/master/doc/troubleshooting.rst\" rel=\"nofollow\">https://github.com/git-multimail/git-multimail/blob/master/doc/troubleshooting.rst</a> for frequently asked\nquestions and common issues with git-multimail.</p>\n</div>\n<div id=\"configuration\">\n<h2>Configuration</h2>\n<p>By default, git-multimail mostly takes its configuration from the\nfollowing <tt>git config</tt> settings:</p>\n<dl>\n<dt>multimailhook.environment</dt>\n<dd><p>This describes the general environment of the repository. In most\ncases, you do not need to specify a value for this variable:\n<cite>git-multimail</cite> will autodetect which environment to use.\nCurrently supported values:</p>\n<dl>\n<dt>generic</dt>\n<dd>the username of the pusher is read from $USER or $USERNAME and\nthe repository name is derived from the repository’s path.</dd>\n<dt>gitolite</dt>\n<dd><p>Environment to use when <tt><span class=\"pre\">git-multimail</span></tt> is ran as a <a href=\"https://github.com/sitaramc/gitolite\" rel=\"nofollow\">gitolite</a>\nhook.</p>\n<p>The username of the pusher is read from $GL_USER, the repository\nname is read from $GL_REPO, and the From: header value is\noptionally read from gitolite.conf (see multimailhook.from).</p>\n<p>For more information about gitolite and git-multimail, read\n<a href=\"https://github.com/git-multimail/git-multimail/blob/master/doc/gitolite.rst\" rel=\"nofollow\">https://github.com/git-multimail/git-multimail/blob/master/doc/gitolite.rst</a></p>\n</dd>\n<dt>stash</dt>\n<dd><p>Environment to use when <tt><span class=\"pre\">git-multimail</span></tt> is ran as an Atlassian\nBitBucket Server (formerly known as Atlassian Stash) hook.</p>\n<p><strong>Warning:</strong> this mode was provided by a third-party contributor\nand never tested by the git-multimail maintainers. It is\nprovided as-is and may or may not work for you.</p>\n<p>This value is automatically assumed when the stash-specific\nflags (<tt><span class=\"pre\">--stash-user</span></tt> and <tt><span class=\"pre\">--stash-repo</span></tt>) are specified on\nthe command line. When this environment is active, the username\nand repo come from these two command line flags, which must be\nspecified.</p>\n</dd>\n<dt>gerrit</dt>\n<dd><p>Environment to use when <tt><span class=\"pre\">git-multimail</span></tt> is ran as a\n<tt><span class=\"pre\">ref-updated</span></tt> Gerrit hook.</p>\n<p>This value is used when the gerrit-specific command line flags\n(<tt><span class=\"pre\">--oldrev</span></tt>, <tt><span class=\"pre\">--newrev</span></tt>, <tt><span class=\"pre\">--refname</span></tt>, <tt><span class=\"pre\">--project</span></tt>) for\ngerrit’s ref-updated hook are present. When this environment is\nactive, the username of the pusher is taken from the\n<tt><span class=\"pre\">--submitter</span></tt> argument if that command line option is passed,\notherwise ‘Gerrit’ is used. The repository name is taken from\nthe <tt><span class=\"pre\">--project</span></tt> option on the command line, which must be passed.</p>\n<p>For more information about gerrit and git-multimail, read\n<a href=\"https://github.com/git-multimail/git-multimail/blob/master/doc/gerrit.rst\" rel=\"nofollow\">https://github.com/git-multimail/git-multimail/blob/master/doc/gerrit.rst</a></p>\n</dd>\n</dl>\n<p>If none of these environments is suitable for your setup, then you\ncan implement a Python class that inherits from Environment and\ninstantiate it via a script that looks like the example\npost-receive script.</p>\n<p>The environment value can be specified on the command line using\nthe <tt><span class=\"pre\">--environment</span></tt> option. If it is not specified on the\ncommand line or by <tt>multimailhook.environment</tt>, the value is\nguessed as follows:</p>\n<ul>\n<li>If stash-specific (respectively gerrit-specific) command flags\nare present on the command-line, then <tt>stash</tt> (respectively\n<tt>gerrit</tt>) is used.</li>\n<li>If the environment variables $GL_USER and $GL_REPO are set, then\n<tt>gitolite</tt> is used.</li>\n<li>If none of the above apply, then <tt>generic</tt> is used.</li>\n</ul>\n</dd>\n<dt>multimailhook.repoName</dt>\n<dd>A short name of this Git repository, to be used in various places\nin the notification email text.  The default is to use $GL_REPO\nfor gitolite repositories, or otherwise to derive this value from\nthe repository path name.</dd>\n<dt>multimailhook.mailingList</dt>\n<dd>The list of email addresses to which notification emails should be\nsent, as RFC 2822 email addresses separated by commas.  This\nconfiguration option can be multivalued.  Leave it unset or set it\nto the empty string to not send emails by default.  The next few\nsettings can be used to configure specific address lists for\nspecific types of notification email.</dd>\n<dt>multimailhook.refchangeList</dt>\n<dd>The list of email addresses to which summary emails about\nreference changes should be sent, as RFC 2822 email addresses\nseparated by commas.  This configuration option can be\nmultivalued.  The default is the value in\nmultimailhook.mailingList.  Set this value to “none” (or the empty\nstring) to prevent reference change emails from being sent even if\nmultimailhook.mailingList is set.</dd>\n<dt>multimailhook.announceList</dt>\n<dd>The list of email addresses to which emails about new annotated\ntags should be sent, as RFC 2822 email addresses separated by\ncommas.  This configuration option can be multivalued.  The\ndefault is the value in multimailhook.refchangeList or\nmultimailhook.mailingList.  Set this value to “none” (or the empty\nstring) to prevent annotated tag announcement emails from being sent\neven if one of the other values is set.</dd>\n<dt>multimailhook.commitList</dt>\n<dd>The list of email addresses to which emails about individual new\ncommits should be sent, as RFC 2822 email addresses separated by\ncommas.  This configuration option can be multivalued.  The\ndefault is the value in multimailhook.mailingList.  Set this value\nto “none” (or the empty string) to prevent notification emails about\nindividual commits from being sent even if\nmultimailhook.mailingList is set.</dd>\n<dt>multimailhook.announceShortlog</dt>\n<dd>If this option is set to true, then emails about changes to\nannotated tags include a shortlog of changes since the previous\ntag.  This can be useful if the annotated tags represent releases;\nthen the shortlog will be a kind of rough summary of what has\nhappened since the last release.  But if your tagging policy is\nnot so straightforward, then the shortlog might be confusing\nrather than useful.  Default is false.</dd>\n<dt>multimailhook.commitEmailFormat</dt>\n<dd><p>The format of email messages for the individual commits, can be “text” or\n“html”. In the latter case, the emails will include diffs using colorized\nHTML instead of plain text used by default. Note that this  currently the\nref change emails are always sent in plain text.</p>\n<p>Note that when using “html”, the formatting is done by parsing the\noutput of <tt>git log</tt> with <tt><span class=\"pre\">-p</span></tt>. When using\n<tt>multimailhook.commitLogOpts</tt> to specify a <tt><span class=\"pre\">--format</span></tt> for\n<tt>git log</tt>, one may get false positive (e.g. lines in the body of\nthe message starting with <tt>+++</tt> or <tt><span class=\"pre\">---</span></tt> colored in red or\ngreen).</p>\n<p>By default, all the message is HTML-escaped. See\n<tt>multimailhook.htmlInIntro</tt> to change this behavior.</p>\n</dd>\n<dt>multimailhook.commitBrowseURL</dt>\n<dd><p>Used to generate a link to an online repository browser in commit\nemails. This variable must be a string. Format directives like\n<tt><span class=\"pre\">%(&lt;variable&gt;)s</span></tt> will be expanded the same way as template\nstrings. In particular, <tt>%(id)s</tt> will be replaced by the full\nGit commit identifier (40-chars hexadecimal).</p>\n<p>If the string does not contain any format directive, then\n<tt>%(id)s</tt> will be automatically added to the string. If you don’t\nwant <tt>%(id)s</tt> to be automatically added, use the empty format\ndirective <tt><span class=\"pre\">%()s</span></tt> anywhere in the string.</p>\n<p>For example, a suitable value for the git-multimail project itself\nwould be\n<tt><span class=\"pre\">https://github.com/git-multimail/git-multimail/commit/%(id)s</span></tt>.</p>\n</dd>\n<dt>multimailhook.htmlInIntro, multimailhook.htmlInFooter</dt>\n<dd><p>When generating an HTML message, git-multimail escapes any HTML\nsequence by default. This means that if a template contains HTML\nlike <tt>&lt;a <span class=\"pre\">href=\"foo\"&gt;link&lt;/a&gt;</span></tt>, the reader will see the HTML\nsource code and not a proper link.</p>\n<p>Set <tt>multimailhook.htmlInIntro</tt> to true to allow writing HTML\nformatting in introduction templates. Similarly, set\n<tt>multimailhook.htmlInFooter</tt> for HTML in the footer.</p>\n<p>Variables expanded in the template are still escaped. For example,\nif a repository’s path contains a <tt>&lt;</tt>, it will be rendered as\nsuch in the message.</p>\n<p>Read <a href=\"https://github.com/git-multimail/git-multimail/blob/master/doc/customizing-emails.rst\" rel=\"nofollow\">https://github.com/git-multimail/git-multimail/blob/master/doc/customizing-emails.rst</a> for more details and\nexamples.</p>\n</dd>\n<dt>multimailhook.refchangeShowGraph</dt>\n<dd><p>If this option is set to true, then summary emails about reference\nchanges will additionally include:</p>\n<ul>\n<li>a graph of the added commits (if any)</li>\n<li>a graph of the discarded commits (if any)</li>\n</ul>\n<p>The log is generated by running <tt>git log <span class=\"pre\">--graph</span></tt> with the options\nspecified in graphOpts.  The default is false.</p>\n</dd>\n<dt>multimailhook.refchangeShowLog</dt>\n<dd>If this option is set to true, then summary emails about reference\nchanges will include a detailed log of the added commits in\naddition to the one line summary.  The log is generated by running\n<tt>git log</tt> with the options specified in multimailhook.logOpts.\nDefault is false.</dd>\n<dt>multimailhook.mailer</dt>\n<dd><p>This option changes the way emails are sent.  Accepted values are:</p>\n<ul>\n<li><p><strong>sendmail (the default)</strong>: use the command <tt>/usr/sbin/sendmail</tt> or\n<tt>/usr/lib/sendmail</tt> (or sendmailCommand, if configured).  This\nmode can be further customized via the following options:</p>\n<dl>\n<dt>multimailhook.sendmailCommand</dt>\n<dd><p>The command used by mailer <tt>sendmail</tt> to send emails.  Shell\nquoting is allowed in the value of this setting, but remember that\nGit requires double-quotes to be escaped; e.g.:</p>\n<pre>git config multimailhook.sendmailcommand '/usr/sbin/sendmail -oi -t -F \\\"Git Repo\\\"'\n</pre>\n<p>Default is ‘/usr/sbin/sendmail -oi -t’ or\n‘/usr/lib/sendmail -oi -t’ (depending on which file is\npresent and executable).</p>\n</dd>\n<dt>multimailhook.envelopeSender</dt>\n<dd><p>If set then pass this value to sendmail via the -f option to set\nthe envelope sender address.</p>\n</dd>\n</dl>\n</li>\n<li><p><strong>smtp</strong>: use Python’s smtplib.  This is useful when the sendmail\ncommand is not available on the system.  This mode can be\nfurther customized via the following options:</p>\n<dl>\n<dt>multimailhook.smtpServer</dt>\n<dd><p>The name of the SMTP server to connect to.  The value can\nalso include a colon and a port number; e.g.,\n<tt>mail.example.com:25</tt>.  Default is ‘localhost’ using port 25.</p>\n</dd>\n<dt>multimailhook.smtpUser, multimailhook.smtpPass</dt>\n<dd><p>Server username and password. Required if smtpEncryption is ‘ssl’.\nNote that the username and password currently need to be\nset cleartext in the configuration file, which is not\nrecommended. If you need to use this option, be sure your\nconfiguration file is read-only.</p>\n</dd>\n<dt>multimailhook.envelopeSender</dt>\n<dd><p>The sender address to be passed to the SMTP server.  If\nunset, then the value of multimailhook.from is used.</p>\n</dd>\n<dt>multimailhook.smtpServerTimeout</dt>\n<dd><p>Timeout in seconds. Default is 10.</p>\n</dd>\n<dt>multimailhook.smtpEncryption</dt>\n<dd><p>Set the security type. Allowed values: <tt>none</tt>, <tt>ssl</tt>, <tt>tls</tt> (starttls).\nDefault is <tt>none</tt>.</p>\n</dd>\n<dt>multimailhook.smtpCACerts</dt>\n<dd><p>Set the path to a list of trusted CA certificate to verify the\nserver certificate, only supported when <tt>smtpEncryption</tt> is\n<tt>tls</tt>. If unset or empty, the server certificate is not\nverified. If it targets a file containing a list of trusted CA\ncertificates (PEM format) these CAs will be used to verify the\nserver certificate. For debian, you can set\n<tt><span class=\"pre\">/etc/ssl/certs/ca-certificates.crt</span></tt> for using the system\ntrusted CAs. For self-signed server, you can add your server\ncertificate to the system store:</p>\n<pre>cd /usr/local/share/ca-certificates/\nopenssl s_client -starttls smtp \\\n       -connect mail.example.net:587 -showcerts \\\n       &lt;/dev/null 2&gt;/dev/null \\\n     | openssl x509 -outform PEM &gt;mail.example.net.crt\nupdate-ca-certificates\n</pre>\n<p>and used the updated <tt><span class=\"pre\">/etc/ssl/certs/ca-certificates.crt</span></tt>. Or\ndirectly use your <tt>/path/to/mail.example.net.crt</tt>. Default is\nunset.</p>\n</dd>\n<dt>multimailhook.smtpServerDebugLevel</dt>\n<dd><p>Integer number. Set to greater than 0 to activate debugging.</p>\n</dd>\n</dl>\n</li>\n</ul>\n</dd>\n<dt>multimailhook.from, multimailhook.fromCommit, multimailhook.fromRefchange</dt>\n<dd><p>If set, use this value in the From: field of generated emails.\n<tt>fromCommit</tt> is used for commit emails, <tt>fromRefchange</tt> is\nused for refchange emails, and <tt>from</tt> is used as fall-back in\nall cases.</p>\n<p>The value for these variables can be either:</p>\n<ul>\n<li>An email address, which will be used directly.</li>\n<li>The value <tt>pusher</tt>, in which case the pusher’s address (if\navailable) will be used.</li>\n<li>The value <tt>author</tt> (meaningful only for <tt>fromCommit</tt>), in which\ncase the commit author’s address will be used.</li>\n</ul>\n<p>If config values are unset, the value of the From: header is\ndetermined as follows:</p>\n<ol>\n<li><p>(gitolite environment only)\n1.a) If <tt>multimailhook.MailaddressMap</tt> is set, and is a path\nto an existing file (if relative, it is considered relative to\nthe place where <tt>gitolite.conf</tt> is located), then this file\nshould contain lines like:</p>\n<pre>username Firstname Lastname &lt;email@example.com&gt;\n</pre>\n<p>git-multimail will then look for a line where <tt>$GL_USER</tt>\nmatches the <tt>username</tt> part, and use the rest of the line for\nthe <tt>From:</tt> header.</p>\n<p>1.b) Parse gitolite.conf, looking for a block of comments that\nlooks like this:</p>\n<pre># BEGIN USER EMAILS\n# username Firstname Lastname &lt;email@example.com&gt;\n# END USER EMAILS\n</pre>\n<p>If that block exists, and there is a line between the BEGIN\nUSER EMAILS and END USER EMAILS lines where the first field\nmatches the gitolite username ($GL_USER), use the rest of the\nline for the From: header.</p>\n</li>\n<li><p>If the user.email configuration setting is set, use its value\n(and the value of user.name, if set).</p>\n</li>\n<li><p>Use the value of multimailhook.envelopeSender.</p>\n</li>\n</ol>\n</dd>\n<dt>multimailhook.MailaddressMap</dt>\n<dd>(gitolite environment only)\nFile to look for a <tt>From:</tt> address based on the user doing the\npush. Defaults to unset. See <tt>multimailhook.from</tt> for details.</dd>\n<dt>multimailhook.administrator</dt>\n<dd>The name and/or email address of the administrator of the Git\nrepository; used in FOOTER_TEMPLATE.  Default is\nmultimailhook.envelopesender if it is set; otherwise a generic\nstring is used.</dd>\n<dt>multimailhook.emailPrefix</dt>\n<dd>All emails have this string prepended to their subjects, to aid\nemail filtering (though filtering based on the X-Git-* email\nheaders is probably more robust).  Default is the short name of\nthe repository in square brackets; e.g., <tt>[myrepo]</tt>.  Set this\nvalue to the empty string to suppress the email prefix. You may\nuse the placeholder <tt>%(repo_shortname)s</tt> for the short name of\nthe repository.</dd>\n<dt>multimailhook.emailMaxLines</dt>\n<dd>The maximum number of lines that should be included in the body of\na generated email.  If not specified, there is no limit.  Lines\nbeyond the limit are suppressed and counted, and a final line is\nadded indicating the number of suppressed lines.</dd>\n<dt>multimailhook.emailMaxLineLength</dt>\n<dd>The maximum length of a line in the email body.  Lines longer than\nthis limit are truncated to this length with a trailing <tt><span class=\"pre\">[...]</span></tt>\nadded to indicate the missing text.  The default is 500, because\n(a) diffs with longer lines are probably from binary files, for\nwhich a diff is useless, and (b) even if a text file has such long\nlines, the diffs are probably unreadable anyway.  To disable line\ntruncation, set this option to 0.</dd>\n<dt>multimailhook.subjectMaxLength</dt>\n<dd>The maximum length of the subject line (i.e. the <tt>oneline</tt> field\nin templates, not including the prefix). Lines longer than this\nlimit are truncated to this length with a trailing <tt><span class=\"pre\">[...]</span></tt> added\nto indicate the missing text. This option The default is to use\n<tt>multimailhook.emailMaxLineLength</tt>. This option avoids sending\nemails with overly long subject lines, but should not be needed if\nthe commit messages follow the Git convention (one short subject\nline, then a blank line, then the message body). To disable line\ntruncation, set this option to 0.</dd>\n<dt>multimailhook.maxCommitEmails</dt>\n<dd>The maximum number of commit emails to send for a given change.\nWhen the number of patches is larger that this value, only the\nsummary refchange email is sent.  This can avoid accidental\nmailbombing, for example on an initial push.  To disable commit\nemails limit, set this option to 0.  The default is 500.</dd>\n<dt>multimailhook.excludeMergeRevisions</dt>\n<dd>When sending out revision emails, do not consider merge commits (the\nfunctional equivalent of <cite>rev-list –no-merges</cite>).\nThe default is <cite>false</cite> (send merge commit emails).</dd>\n<dt>multimailhook.emailStrictUTF8</dt>\n<dd><p>If this boolean option is set to <cite>true</cite>, then the main part of the\nemail body is forced to be valid UTF-8.  Any characters that are\nnot valid UTF-8 are converted to the Unicode replacement\ncharacter, U+FFFD.  The default is <cite>true</cite>.</p>\n<p>This option is ineffective with Python 3, where non-UTF-8\ncharacters are unconditionally replaced.</p>\n</dd>\n<dt>multimailhook.diffOpts</dt>\n<dd>Options passed to <tt>git <span class=\"pre\">diff-tree</span></tt> when generating the summary\ninformation for ReferenceChange emails.  Default is <tt><span class=\"pre\">--stat</span>\n<span class=\"pre\">--summary</span> <span class=\"pre\">--find-copies-harder</span></tt>.  Add -p to those options to\ninclude a unified diff of changes in addition to the usual summary\noutput.  Shell quoting is allowed; see <tt>multimailhook.logOpts</tt> for\ndetails.</dd>\n<dt>multimailhook.graphOpts</dt>\n<dd><p>Options passed to <tt>git log <span class=\"pre\">--graph</span></tt> when generating graphs for the\nreference change summary emails (used only if refchangeShowGraph\nis true).  The default is ‘–oneline –decorate’.</p>\n<p>Shell quoting is allowed; see logOpts for details.</p>\n</dd>\n<dt>multimailhook.logOpts</dt>\n<dd><p>Options passed to <tt>git log</tt> to generate additional info for\nreference change emails (used only if refchangeShowLog is set).\nFor example, adding -p will show each commit’s complete diff.  The\ndefault is empty.</p>\n<p>Shell quoting is allowed; for example, a log format that contains\nspaces can be specified using something like:</p>\n<pre>git config multimailhook.logopts '--pretty=format:\"%h %aN &lt;%aE&gt;%n%s%n%n%b%n\"'\n</pre>\n<p>If you want to set this by editing your configuration file\ndirectly, remember that Git requires double-quotes to be escaped\n(see git-config(1) for more information):</p>\n<pre>[multimailhook]\n        logopts = --pretty=format:\\\"%h %aN &lt;%aE&gt;%n%s%n%n%b%n\\\"\n</pre>\n</dd>\n<dt>multimailhook.commitLogOpts</dt>\n<dd>Options passed to <tt>git log</tt> to generate additional info for\nrevision change emails.  For example, adding –ignore-all-spaces\nwill suppress whitespace changes.  The default options are <tt><span class=\"pre\">-C</span>\n<span class=\"pre\">--stat</span> <span class=\"pre\">-p</span> <span class=\"pre\">--cc</span></tt>.  Shell quoting is allowed; see\nmultimailhook.logOpts for details.</dd>\n<dt>multimailhook.dateSubstitute</dt>\n<dd>String to use as a substitute for <tt>Date:</tt> in the output of <tt>git\nlog</tt> while formatting commit messages. This is useful to avoid\nemitting a line that can be interpreted by mailers as the start of\na cited message (Zimbra webmail in particular). Defaults to\n<tt>CommitDate:</tt>. Set to an empty string or <tt>none</tt> to deactivate\nthe behavior.</dd>\n<dt>multimailhook.emailDomain</dt>\n<dd>Domain name appended to the username of the person doing the push\nto convert it into an email address\n(via <tt><span class=\"pre\">\"%s@%s\"</span> % (username, emaildomain)</tt>). More complicated\nschemes can be implemented by overriding Environment and\noverriding its get_pusher_email() method.</dd>\n<dt>multimailhook.replyTo, multimailhook.replyToCommit, multimailhook.replyToRefchange</dt>\n<dd><p>Addresses to use in the Reply-To: field for commit emails\n(replyToCommit) and refchange emails (replyToRefchange).\nmultimailhook.replyTo is used as default when replyToCommit or\nreplyToRefchange is not set. The shortcuts <tt>pusher</tt> and\n<tt>author</tt> are allowed with the same semantics as for\n<tt>multimailhook.from</tt>. In addition, the value <tt>none</tt> can be\nused to omit the <tt><span class=\"pre\">Reply-To:</span></tt> field.</p>\n<p>The default is <tt>pusher</tt> for refchange emails, and <tt>author</tt> for\ncommit emails.</p>\n</dd>\n<dt>multimailhook.quiet</dt>\n<dd>Do not output the list of email recipients from the hook</dd>\n<dt>multimailhook.stdout</dt>\n<dd>For debugging, send emails to stdout rather than to the\nmailer.  Equivalent to the –stdout command line option</dd>\n<dt>multimailhook.scanCommitForCc</dt>\n<dd>If this option is set to true, than recipients from lines in commit body\nthat starts with <tt>CC:</tt> will be added to CC list.\nDefault: false</dd>\n<dt>multimailhook.combineWhenSingleCommit</dt>\n<dd>If this option is set to true and a single new commit is pushed to\na branch, combine the summary and commit email messages into a\nsingle email.\nDefault: true</dd>\n<dt>multimailhook.refFilterInclusionRegex, multimailhook.refFilterExclusionRegex, multimailhook.refFilterDoSendRegex, multimailhook.refFilterDontSendRegex</dt>\n<dd><p><strong>Warning:</strong> these options are experimental. They should work, but\nthe user-interface is not stable yet (in particular, the option\nnames may change). If you want to participate in stabilizing the\nfeature, please contact the maintainers and/or send pull-requests.\nIf you are happy with the current shape of the feature, please\nreport it too.</p>\n<p>Regular expressions that can be used to limit refs for which email\nupdates will be sent.  It is an error to specify both an inclusion\nand an exclusion regex.  If a <tt>refFilterInclusionRegex</tt> is\nspecified, emails will only be sent for refs which match this\nregex.  If a <tt>refFilterExclusionRegex</tt> regex is specified,\nemails will be sent for all refs except those that match this\nregex (or that match a predefined regex specific to the\nenvironment, such as “^refs/notes” for most environments and\n“^refs/notes|^refs/changes” for the gerrit environment).</p>\n<p>The expressions are matched against the complete refname, and is\nconsidered to match if any substring matches. For example, to\nfilter-out all tags, set <tt>refFilterExclusionRegex</tt> to\n<tt>^refs/tags/</tt> (note the leading <tt>^</tt> but no trailing <tt>$</tt>). If\nyou set <tt>refFilterExclusionRegex</tt> to <tt>master</tt>, then any ref\ncontaining <tt>master</tt> will be excluded (the <tt>master</tt> branch, but\nalso <tt>refs/tags/master</tt> or <tt><span class=\"pre\">refs/heads/foo-master-bar</span></tt>).</p>\n<p><tt>refFilterDoSendRegex</tt> and <tt>refFilterDontSendRegex</tt> are\nanalogous to <tt>refFilterInclusionRegex</tt> and\n<tt>refFilterExclusionRegex</tt> with one difference: with\n<tt>refFilterDoSendRegex</tt> and <tt>refFilterDontSendRegex</tt>, commits\nintroduced by one excluded ref will not be considered as new when\nthey reach an included ref. Typically, if you add a branch <tt>foo</tt>\nto  <tt>refFilterDontSendRegex</tt>, push commits to this branch, and\nlater merge branch <tt>foo</tt> into <tt>master</tt>, then the notification\nemail for <tt>master</tt> will contain a commit email only for the\nmerge commit. If you include <tt>foo</tt> in\n<tt>refFilterExclusionRegex</tt>, then at the time of merge, you will\nreceive one commit email per commit in the branch.</p>\n<p>These variables can be multi-valued, like:</p>\n<pre>[multimailhook]\n        refFilterExclusionRegex = ^refs/tags/\n        refFilterExclusionRegex = ^refs/heads/master$\n</pre>\n<p>You can also provide a whitespace-separated list like:</p>\n<pre>[multimailhook]\n        refFilterExclusionRegex = ^refs/tags/ ^refs/heads/master$\n</pre>\n<p>Both examples exclude tags and the master branch, and are\nequivalent to:</p>\n<pre>[multimailhook]\n        refFilterExclusionRegex = ^refs/tags/|^refs/heads/master$\n</pre>\n<p><tt>refFilterInclusionRegex</tt> and <tt>refFilterExclusionRegex</tt> are\nstrictly stronger than <tt>refFilterDoSendRegex</tt> and\n<tt>refFilterDontSendRegex</tt>. In other words, adding a ref to a\nDoSend/DontSend regex has no effect if it is already excluded by a\nExclusion/Inclusion regex.</p>\n</dd>\n</dl>\n<p>multimailhook.logFile, multimailhook.errorLogFile, multimailhook.debugLogFile</p>\n<blockquote>\n<p>When set, these variable designate path to files where\ngit-multimail will log some messages. Normal messages and error\nmessages are sent to <tt>logFile</tt>, and error messages are also sent\nto <tt>errorLogFile</tt>. Debug messages and all other messages are\nsent to <tt>debugLogFile</tt>. The recommended way is to set only one\nof these variables, but it is also possible to set several of them\n(part of the information is then duplicated in several log files,\nfor example errors are duplicated to all log files).</p>\n<p>Relative path are relative to the Git repository where the push is\ndone.</p>\n</blockquote>\n<p>multimailhook.verbose</p>\n<blockquote>\nVerbosity level of git-multimail on its standard output. By\ndefault, show only error and info messages. If set to true, show\nalso debug messages.</blockquote>\n</div>\n<div id=\"email-filtering-aids\">\n<h2>Email filtering aids</h2>\n<p>All emails include extra headers to enable fine tuned filtering and\ngive information for debugging.  All emails include the headers\n<tt><span class=\"pre\">X-Git-Host</span></tt>, <tt><span class=\"pre\">X-Git-Repo</span></tt>, <tt><span class=\"pre\">X-Git-Refname</span></tt>, and <tt><span class=\"pre\">X-Git-Reftype</span></tt>.\nReferenceChange emails also include headers <tt><span class=\"pre\">X-Git-Oldrev</span></tt> and <tt><span class=\"pre\">X-Git-Newrev</span></tt>;\nRevision emails also include header <tt><span class=\"pre\">X-Git-Rev</span></tt>.</p>\n</div>\n<div id=\"customizing-email-contents\">\n<h2>Customizing email contents</h2>\n<p>git-multimail mostly generates emails by expanding templates.  The\ntemplates can be customized.  To avoid the need to edit\n<tt>git_multimail.py</tt> directly, the preferred way to change the templates\nis to write a separate Python script that imports <tt>git_multimail.py</tt> as\na module, then replaces the templates in place.  See the provided\npost-receive script for an example of how this is done.</p>\n</div>\n<div id=\"customizing-git-multimail-for-your-environment\">\n<h2>Customizing git-multimail for your environment</h2>\n<p>git-multimail is mostly customized via an “environment” that describes\nthe local environment in which Git is running.  Two types of\nenvironment are built in:</p>\n<dl>\n<dt>GenericEnvironment</dt>\n<dd>a stand-alone Git repository.</dd>\n<dt>GitoliteEnvironment</dt>\n<dd>a Git repository that is managed by <a href=\"https://github.com/sitaramc/gitolite\" rel=\"nofollow\">gitolite</a>.  For such\nrepositories, the identity of the pusher is read from\nenvironment variable $GL_USER, the name of the repository is read\nfrom $GL_REPO (if it is not overridden by multimailhook.reponame),\nand the From: header value is optionally read from gitolite.conf\n(see multimailhook.from).</dd>\n</dl>\n<p>By default, git-multimail assumes GitoliteEnvironment if $GL_USER and\n$GL_REPO are set, and otherwise assumes GenericEnvironment.\nAlternatively, you can choose one of these two environments explicitly\nby setting a <tt>multimailhook.environment</tt> config setting (which can\nhave the value <cite>generic</cite> or <cite>gitolite</cite>) or by passing an –environment\noption to the script.</p>\n<p>If you need to customize the script in ways that are not supported by\nthe existing environments, you can define your own environment class\nclass using arbitrary Python code.  To do so, you need to import\n<tt>git_multimail.py</tt> as a Python module, as demonstrated by the example\npost-receive script.  Then implement your environment class; it should\nusually inherit from one of the existing Environment classes and\npossibly one or more of the EnvironmentMixin classes.  Then set the\n<tt>environment</tt> variable to an instance of your own environment class\nand pass it to <tt>run_as_post_receive_hook()</tt>.</p>\n<p>The standard environment classes, GenericEnvironment and\nGitoliteEnvironment, are in fact themselves put together out of a\nnumber of mixin classes, each of which handles one aspect of the\ncustomization.  For the finest control over your configuration, you\ncan specify exactly which mixin classes your own environment class\nshould inherit from, and override individual methods (or even add your\nown mixin classes) to implement entirely new behaviors.  If you\nimplement any mixins that might be useful to other people, please\nconsider sharing them with the community!</p>\n</div>\n<div id=\"getting-involved\">\n<h2>Getting involved</h2>\n<p>Please, read <a href=\"https://github.com/git-multimail/git-multimail/blob/master/CONTRIBUTING.rst\" rel=\"nofollow\">https://github.com/git-multimail/git-multimail/blob/master/CONTRIBUTING.rst</a> for instructions on how to\ncontribute to git-multimail.</p>\n</div>\n<div id=\"footnotes\">\n<h2>Footnotes</h2>\n<table id=\"id2\">\n<col><col>\n<tbody>\n<tr><td><a href=\"#id1\" rel=\"nofollow\">[1]</a></td><td>Because of the way information is passed to update hooks, the\nscript’s method of determining whether a commit has already\nbeen seen does not work when it is used as an <tt>update</tt> script.\nIn particular, no notification email will be generated for a\nnew commit that is added to multiple references in the same\npush. A workaround is to use –force-send to force sending the\nemails.</td></tr>\n</tbody>\n</table>\n</div>\n\n          </div>"}, "last_serial": 4723181, "releases": {"0.9.0": [], "1.1.0-1": [{"comment_text": "", "digests": {"md5": "eb88a3626c8a59983fccef4eb4b5ac3d", "sha256": "22ffa62326e8c40db6079adbcaae843e97a399332e256736733c670d90345184"}, "downloads": -1, "filename": "git-multimail-1.1.0-1.tar.gz", "has_sig": false, "md5_digest": "eb88a3626c8a59983fccef4eb4b5ac3d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 75179, "upload_time": "2015-06-18T18:08:44", "upload_time_iso_8601": "2015-06-18T18:08:44.609727Z", "url": "https://files.pythonhosted.org/packages/cb/66/c4f5a8922c986dc5d90a1f7d056e4b1a7c7c765d598d66a50410c6d305ce/git-multimail-1.1.0-1.tar.gz", "yanked": false}], "1.1.1": [{"comment_text": "", "digests": {"md5": "c0b0ebc90a3b5b8c0553282cfabf3699", "sha256": "2380f0556def8b60368a6b02eaaae307204a70360d618e426143f2637dd88c03"}, "downloads": -1, "filename": "git-multimail-1.1.1.tar.gz", "has_sig": false, "md5_digest": "c0b0ebc90a3b5b8c0553282cfabf3699", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 75235, "upload_time": "2015-07-03T14:00:36", "upload_time_iso_8601": "2015-07-03T14:00:36.788575Z", "url": "https://files.pythonhosted.org/packages/ca/d3/0f9e919f1d6da051115f3f2d327b005028d8426716f5c62f983350e0c215/git-multimail-1.1.1.tar.gz", "yanked": false}], "1.2.0": [{"comment_text": "", "digests": {"md5": "568e03a233517518c970ceeda58462fc", "sha256": "bc0da0ddbce8eba5bb63634561541b57980be017711fa520613c8606af56786c"}, "downloads": -1, "filename": "git-multimail-1.2.0.tar.gz", "has_sig": false, "md5_digest": "568e03a233517518c970ceeda58462fc", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 76524, "upload_time": "2015-10-11T18:45:20", "upload_time_iso_8601": "2015-10-11T18:45:20.855806Z", "url": "https://files.pythonhosted.org/packages/96/a1/012e48bb4c581ea0c2df62404b11880d03d00e223abd9e7f58e366444dfb/git-multimail-1.2.0.tar.gz", "yanked": false}], "1.3.0": [{"comment_text": "", "digests": {"md5": "6716ce0ee000f85f317b73801c57117c", "sha256": "7d9bbead2c9bb651be8df9213a4e4ba876dfdefdc74eb444c21fa44d848a693d"}, "downloads": -1, "filename": "git-multimail-1.3.0.tar.gz", "has_sig": false, "md5_digest": "6716ce0ee000f85f317b73801c57117c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 83188, "upload_time": "2016-05-03T08:36:45", "upload_time_iso_8601": "2016-05-03T08:36:45.577689Z", "url": "https://files.pythonhosted.org/packages/fa/43/7d18d79aea5f3a9f4907908e0352a046f2f0974a11d696eb97837decf282/git-multimail-1.3.0.tar.gz", "yanked": false}], "1.3.1": [{"comment_text": "", "digests": {"md5": "1221ded8a5710120ef1b4ef9cd13da5f", "sha256": "dbab0d0f69c8b4ec59d770eb30263bb38f4d150f8d0f6eb4bacdda6d16db1f88"}, "downloads": -1, "filename": "git-multimail-1.3.1.tar.gz", "has_sig": false, "md5_digest": "1221ded8a5710120ef1b4ef9cd13da5f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 83475, "upload_time": "2016-05-13T17:01:06", "upload_time_iso_8601": "2016-05-13T17:01:06.361847Z", "url": "https://files.pythonhosted.org/packages/a4/06/3828306b4cb9b6dea5b8ca9ca63fbc53c35bac2589cb9b68854aa46758fd/git-multimail-1.3.1.tar.gz", "yanked": false}], "1.4.0": [{"comment_text": "", "digests": {"md5": "2de8c2bbb148fd00a971153f29d05d08", "sha256": "4ba7616091a4ed3181010ff0565b90e315c36aee2ffb183a0d6e05a494017b9b"}, "downloads": -1, "filename": "git-multimail-1.4.0.tar.gz", "has_sig": false, "md5_digest": "2de8c2bbb148fd00a971153f29d05d08", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 89287, "upload_time": "2016-08-17T06:42:01", "upload_time_iso_8601": "2016-08-17T06:42:01.929748Z", "url": "https://files.pythonhosted.org/packages/13/26/989eaa37733f7406a2efee00e6a52a0665b1a1cf74ae60c47819849665d3/git-multimail-1.4.0.tar.gz", "yanked": false}], "1.5.0": [{"comment_text": "", "digests": {"md5": "78b5bc0d2efd83246c9f7a6d2d54c744", "sha256": "de4704abcbc6c8ba00e9e3ab46191d9adb51628e918c628efdbab7d9e07e23b2"}, "downloads": -1, "filename": "git-multimail-1.5.0.tar.gz", "has_sig": false, "md5_digest": "78b5bc0d2efd83246c9f7a6d2d54c744", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 91996, "upload_time": "2019-01-08T10:27:58", "upload_time_iso_8601": "2019-01-08T10:27:58.732398Z", "url": "https://files.pythonhosted.org/packages/cc/59/b7c8f73c3c46fc5102f9fa2843b7430192ae8048f97fdec043d865e1ea09/git-multimail-1.5.0.tar.gz", "yanked": false}], "1.5.0.post1": [{"comment_text": "", "digests": {"md5": "a8465b4a8dd062fcc43f9a80453ee2ef", "sha256": "3e9944d94df406ec67f4d13d3f890159dbb33255dc696f10bfdc2a70945e79fe"}, "downloads": -1, "filename": "git-multimail-1.5.0.post1.tar.gz", "has_sig": false, "md5_digest": "a8465b4a8dd062fcc43f9a80453ee2ef", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 91753, "upload_time": "2019-01-21T20:31:51", "upload_time_iso_8601": "2019-01-21T20:31:51.735127Z", "url": "https://files.pythonhosted.org/packages/ec/1e/e72afcddf5defdd873bdd40c92f4a6bb2934722eaa0c747c2c5dfb13a68f/git-multimail-1.5.0.post1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "a8465b4a8dd062fcc43f9a80453ee2ef", "sha256": "3e9944d94df406ec67f4d13d3f890159dbb33255dc696f10bfdc2a70945e79fe"}, "downloads": -1, "filename": "git-multimail-1.5.0.post1.tar.gz", "has_sig": false, "md5_digest": "a8465b4a8dd062fcc43f9a80453ee2ef", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 91753, "upload_time": "2019-01-21T20:31:51", "upload_time_iso_8601": "2019-01-21T20:31:51.735127Z", "url": "https://files.pythonhosted.org/packages/ec/1e/e72afcddf5defdd873bdd40c92f4a6bb2934722eaa0c747c2c5dfb13a68f/git-multimail-1.5.0.post1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:56:51 2020"}