{"info": {"author": "", "author_email": "", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "License :: OSI Approved :: MIT License", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3.8", "Programming Language :: Python :: Implementation :: CPython", "Programming Language :: Python :: Implementation :: PyPy"], "description": "git filter-repo is a versatile tool for rewriting history, which includes\n[capabilities I have not found anywhere\nelse](#design-rationale-behind-filter-repo).  It roughly falls into the\nsame space of tool as [git\nfilter-branch](https://git-scm.com/docs/git-filter-branch) but without the\ncapitulation-inducing poor\n[performance](https://public-inbox.org/git/CABPp-BGOz8nks0+Tdw5GyGqxeYR-3FF6FT5JcgVqZDYVRQ6qog@mail.gmail.com/),\nwith far more capabilities, and with a design that scales usability-wise\nbeyond trivial rewriting cases.  [git filter-repo is now recommended by the\ngit project](https://git-scm.com/docs/git-filter-branch#_warning) instead\nof git filter-branch.\n\nWhile most users will probably just use filter-repo as a simple command\nline tool (and likely only use a few of its flags), at its core filter-repo\ncontains a library for creating history rewriting tools.  As such, users\nwith specialized needs can leverage it to quickly create [entirely new\nhistory rewriting tools](contrib/filter-repo-demos).\n\n# Table of Contents\n\n  * [Prerequisites](#prerequisites)\n  * [How do I install it?](#how-do-i-install-it)\n  * [How do I use it?](#how-do-i-use-it)\n  * [Why filter-repo instead of other alternatives?](#why-filter-repo-instead-of-other-alternatives)\n    * [filter-branch](#filter-branch)\n    * [BFG Repo Cleaner](#bfg-repo-cleaner)\n  * [Simple example, with comparisons](#simple-example-with-comparisons)\n    * [Solving this with filter-repo](#solving-this-with-filter-repo)\n    * [Solving this with other filtering tools](#solving-this-with-other-filtering-tools)\n  * [Design rationale behind filter-repo](#design-rationale-behind-filter-repo)\n  * [How do I contribute?](#how-do-i-contribute)\n  * [Is there a Code of Conduct?](#is-there-a-code-of-conduct)\n  * [Upstream Improvements](#upstream-improvements)\n\n# Prerequisites\n\nfilter-repo requires:\n\n  * git >= 2.22.0 at a minimum; [some features](#upstream-improvements)\n    require git >= 2.24.0\n  * python3 >= 3.5\n\n# How do I install it?\n\ngit-filter-repo is a single-file python script, which was done to make\ninstallation for basic use trivial: just copy it into your $PATH.\n\nSee [INSTALL.md](INSTALL.md) for things beyond basic usage or special\ncases.  The more involved instructions are needed if you\n\n  * are working with a python3 executable named something other than \"python3\"\n  * want to install documentation (beyond the builtin docs shown with -h)\n  * want to run some of the [contrib](contrib/filter-repo-demos/) examples\n  * want to create your own python filtering scripts using filter-repo as a\n    module/library\n\n# How do I use it?\n\nSee the [user\nmanual](https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html).\nIf you prefer learning from examples, the [simple\nexample](#simple-example-with-comparisons) below may be of interest,\nand the user manual has an extensive [examples\nsection](https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#EXAMPLES).\n\n# Why filter-repo instead of other alternatives?\n\nThis was covered in more detail in a [Git Rev News article on\nfilter-repo](https://git.github.io/rev_news/2019/08/21/edition-54/#an-introduction-to-git-filter-repo--written-by-elijah-newren),\nbut some highlights for the main competitors:\n\n## filter-branch\n\n  * filter-branch is [extremely to unusably\n    slow](https://public-inbox.org/git/CABPp-BGOz8nks0+Tdw5GyGqxeYR-3FF6FT5JcgVqZDYVRQ6qog@mail.gmail.com/)\n    ([multiple orders of magnitude slower than it should\n    be](https://git-scm.com/docs/git-filter-branch#PERFORMANCE))\n    for non-trivial repositories.\n\n  * [filter-branch is riddled with\n    gotchas](https://git-scm.com/docs/git-filter-branch#SAFETY) that can\n    silently corrupt your rewrite or at least thwart your \"cleanup\"\n    efforts by giving you something more problematic and messy than what\n    you started with.\n\n  * filter-branch is [very onerous](#simple-example-with-comparisons)\n    [to\n    use](https://github.com/newren/git-filter-repo/blob/a6a6a1b0f62d365bbe2e76f823e1621857ec4dbd/contrib/filter-repo-demos/filter-lamely#L9-L61)\n    for any rewrite which is even slightly non-trivial.\n\n  * the git project has stated that the above issues with filter-branch\n    cannot be backward compatibly fixed; they recommend that you [stop\n    using\n    filter-branch](https://git-scm.com/docs/git-filter-branch#_warning)\n\n  * die-hard fans of filter-branch may be interested in\n    [filter-lamely](contrib/filter-repo-demos/filter-lamely)\n    (a.k.a. [filter-branch-ish](contrib/filter-repo-demos/filter-branch-ish)),\n    a reimplementation of filter-branch based on filter-repo which is\n    more performant (though not nearly as fast or safe as\n    filter-repo).\n\n## BFG Repo Cleaner\n\n  * great tool for its time, but while it makes some things simple, it\n    is limited to a few kinds of rewrites.\n\n  * its architecture is not amenable to handling more types of\n    rewrites.\n\n  * its architecture presents some shortcomings and bugs even for its\n    intended usecase.\n\n  * fans of bfg may be interested in\n    [bfg-ish](contrib/filter-repo-demos/bfg-ish), a reimplementation of bfg\n    based on filter-repo which includes several new features and bugfixes\n    relative to bfg.\n\n# Simple example, with comparisons\n\nLet's say that we want to extract a piece of a repository, with the intent\non merging just that piece into some other bigger repo.  For extraction, we\nwant to:\n\n  * extract the history of a single directory, src/.  This means that only\n    paths under src/ remain in the repo, and any commits that only touched\n    paths outside this directory will be removed.\n  * rename all files to have a new leading directory, my-module/ (e.g. so that\n    src/foo.c becomes my-module/src/foo.c)\n  * rename any tags in the extracted repository to have a 'my-module-'\n    prefix (to avoid any conflicts when we later merge this repo into\n    something else)\n\n## Solving this with filter-repo\n\nDoing this with filter-repo is as simple as the following command:\n```shell\n  git filter-repo --path src/ --to-subdirectory-filter my-module --tag-rename '':'my-module-'\n```\n(the single quotes are unnecessary, but make it clearer to a human that we\nare replacing the empty string as a prefix with `my-module-`)\n\n## Solving this with other filtering tools\n\nBy contrast, BFG Repo Cleaner is not capable of this kind of rewrite,\nit would take considerable effort to do this safely with\nfast-export/fast-import (especially if you wanted empty commits pruned\nor commit hashes rewritten), and filter-branch comes with a pile of\ncaveats (more on that below) even once you figure out the necessary\ninvocation(s):\n\n```shell\n  git filter-branch \\\n      --tree-filter 'mkdir -p my-module && \\\n                     git ls-files \\\n                         | grep -v ^src/ \\\n                         | xargs git rm -f -q && \\\n                     ls -d * \\\n                         | grep -v my-module \\\n                         | xargs -I files mv files my-module/' \\\n          --tag-name-filter 'echo \"my-module-$(cat)\"' \\\n\t  --prune-empty -- --all\n  git clone file://$(pwd) newcopy\n  cd newcopy\n  git for-each-ref --format=\"delete %(refname)\" refs/tags/ \\\n      | grep -v refs/tags/my-module- \\\n      | git update-ref --stdin\n  git gc --prune=now\n```\n\nSome might notice that the above filter-branch invocation will be really\nslow due to using --tree-filter; you could alternatively use the\n--index-filter option of filter-branch, changing the above commands to:\n\n```shell\n  git filter-branch \\\n      --index-filter 'git ls-files \\\n                          | grep -v ^src/ \\\n                          | xargs git rm -q --cached;\n                      git ls-files -s \\\n                          | sed \"s%$(printf \\\\t)%&my-module/%\" \\\n                          | git update-index --index-info;\n                      git ls-files \\\n                          | grep -v ^my-module/ \\\n                          | xargs git rm -q --cached' \\\n      --tag-name-filter 'echo \"my-module-$(cat)\"' \\\n      --prune-empty -- --all\n  git clone file://$(pwd) newcopy\n  cd newcopy\n  git for-each-ref --format=\"delete %(refname)\" refs/tags/ \\\n      | grep -v refs/tags/my-module- \\\n      | git update-ref --stdin\n  git gc --prune=now\n```\n\nHowever, for either filter-branch command there are a pile of caveats.\nFirst, some may be wondering why I list five commands here for\nfilter-branch.  Despite the use of --all and --tag-name-filter, and\nfilter-branch's manpage claiming that a clone is enough to get rid of\nold objects, the extra steps to delete the other tags and do another\ngc are still required to clean out the old objects and avoid mixing\nnew and old history before pushing somewhere.  Other caveats:\n  * Commit messages are not rewritten; so if some of your commit\n    messages refer to prior commits by (abbreviated) sha1, after the\n    rewrite those messages will now refer to commits that are no longer\n    part of the history.  It would be better to rewrite those\n    (abbreviated) sha1 references to refer to the new commit ids.\n  * The --prune-empty flag sometimes misses commits that should be\n    pruned, and it will also prune commits that *started* empty rather\n    than just ended empty due to filtering.  For repositories that\n    intentionally use empty commits for versioning and publishing\n    related purposes, this can be detrimental.\n  * The commands above are OS-specific.  GNU vs. BSD issues for sed,\n    xargs, and other commands often trip up users; I think I failed to\n    get most folks to use --index-filter since the only example in the\n    filter-branch manpage that both uses it and shows how to move\n    everything into a subdirectory is linux-specific, and it is not\n    obvious to the reader that it has a portability issue since it\n    silently misbehaves rather than failing loudly.\n  * The --index-filter version of the filter-branch command may be two to\n    three times faster than the --tree-filter version, but both\n    filter-branch commands are going to be multiple orders of magnitude\n    slower than filter-repo.\n  * Both commands assume all filenames are composed entirely of ascii\n    characters (even special ascii characters such as tabs or double\n    quotes will wreak havoc and likely result in missing files or\n    misnamed files)\n\n# Design rationale behind filter-repo\n\nNone of the existing repository filtering tools did what I wanted;\nthey all came up short for my needs.  No tool provided any of the\nfirst eight traits below I wanted, and all failed to provide at least\none of the last four traits as well:\n\n  1. [Starting report] Provide user an analysis of their repo to help\n     them get started on what to prune or rename, instead of expecting\n     them to guess or find other tools to figure it out.  (Triggered, e.g.\n     by running the first time with a special flag, such as --analyze.)\n\n  1. [Keep vs. remove] Instead of just providing a way for users to\n     easily remove selected paths, also provide flags for users to\n     only *keep* certain paths.  Sure, users could workaround this by\n     specifying to remove all paths other than the ones they want to\n     keep, but the need to specify all paths that *ever* existed in\n     **any** version of the repository could sometimes be quite\n     painful.  For filter-branch, using pipelines like `git ls-files |\n     grep -v ... | xargs -r git rm` might be a reasonable workaround\n     but can get unwieldy and isn't as straightforward for users; plus\n     those commands are often operating-system specific (can you spot\n     the GNUism in the snippet I provided?).\n\n  1. [Renaming] It should be easy to rename paths.  For example, in\n     addition to allowing one to treat some subdirectory as the root\n     of the repository, also provide options for users to make the\n     root of the repository just become a subdirectory.  And more\n     generally allow files and directories to be easily renamed.\n     Provide sanity checks if renaming causes multiple files to exist\n     at the same path.  (And add special handling so that if a commit\n     merely copied oldname->newname without modification, then\n     filtering oldname->newname doesn't trigger the sanity check and\n     die on that commit.)\n\n  1. [More intelligent safety] Writing copies of the original refs to\n     a special namespace within the repo does not provide a\n     user-friendly recovery mechanism.  Many would struggle to recover\n     using that.  Almost everyone I've ever seen do a repository\n     filtering operation has done so with a fresh clone, because\n     wiping out the clone in case of error is a vastly easier recovery\n     mechanism.  Strongly encourage that workflow by detecting and\n     bailing if we're not in a fresh clone, unless the user overrides\n     with --force.\n\n  1. [Auto shrink] Automatically remove old cruft and repack the\n     repository for the user after filtering (unless overridden); this\n     simplifies things for the user, helps avoid mixing old and new\n     history together, and avoids problems where the multi-step\n     process for shrinking the repo documented in the manpage doesn't\n     actually work in some cases.  (I'm looking at you,\n     filter-branch.)\n\n  1. [Clean separation] Avoid confusing users (and prevent accidental\n     re-pushing of old stuff) due to mixing old repo and rewritten\n     repo together.  (This is particularly a problem with filter-branch\n     when using the --tag-name-filter option, and sometimes also an\n     issue when only filtering a subset of branches.)\n\n  1. [Versatility] Provide the user the ability to extend the tool or\n     even write new tools that leverage existing capabilities, and\n     provide this extensibility in a way that (a) avoids the need to\n     fork separate processes (which would destroy performance), (b)\n     avoids making the user specify OS-dependent shell commands (which\n     would prevent users from sharing commands with each other), (c)\n     takes advantage of rich data structures (because hashes, dicts,\n     lists, and arrays are prohibitively difficult in shell) and (d)\n     provides reasonable string manipulation capabilities (which are\n     sorely lacking in shell).\n\n  1. [Old commit references] Provide a way for users to use old commit\n     IDs with the new repository (in particular via mapping from old to\n     new hashes with refs/replace/ references).\n\n  1. [Commit message consistency] If commit messages refer to other\n     commits by ID (e.g. \"this reverts commit 01234567890abcdef\", \"In\n     commit 0013deadbeef9a...\"), those commit messages should be\n     rewritten to refer to the new commit IDs.\n\n  1. [Become-empty pruning] Commits which become empty due to filtering\n     should be pruned.  If the parent of a commit is pruned, the first\n     non-pruned ancestor needs to become the new parent.  If no\n     non-pruned ancestor exists and the commit was not a merge, then it\n     becomes a new root commit.  If no non-pruned ancestor exists and\n     the commit was a merge, then the merge will have one less parent\n     (and thus make it likely to become a non-merge commit which would\n     itself be pruned if it had no file changes of its own).  One\n     special thing to note here is that we prune commits which become\n     empty, NOT commits which start empty.  Some projects intentionally\n     create empty commits for versioning or publishing reasons, and\n     these should not be removed.  (As a special case, commits which\n     started empty but whose parent was pruned away will also be\n     considered to have \"become empty\".)\n\n  1. [Become-degenerate pruning] Pruning of commits which become empty\n     can potentially cause topology changes, and there are lots of\n     special cases.  Normally, merge commits are not removed since they\n     are needed to preserve the graph topology, but the pruning of\n     parents and other ancestors can ultimately result in the loss of\n     one or more parents.  A simple case was already noted above: if a\n     merge commit loses enough parents to become a non-merge commit and\n     it has no file changes, then it too can be pruned.  Merge commits\n     can also have a topology that becomes degenerate: it could end up\n     with the merge_base serving as both parents (if all intervening\n     commits from the original repo were pruned), or it could end up\n     with one parent which is an ancestor of its other parent.  In such\n     cases, if the merge has no file changes of its own, then the merge\n     commit can also be pruned.  However, much as we do with empty\n     pruning we do not prune merge commits that started degenerate\n     (which indicates it may have been intentional, such as with --no-ff\n     merges) but only merge commits that become degenerate and have no\n     file changes of their own.\n\n  1. [Speed] Filtering should be reasonably fast\n\n# How do I contribute?\n\nSee the [contributing guidelines](Documentation/Contributing.md).\n\n# Is there a Code of Conduct?\n\nParticipants in the filter-repo community are expected to adhere to\nthe same standards as for the git project, so the [git Code of\nConduct](https://git.kernel.org/pub/scm/git/git.git/tree/CODE_OF_CONDUCT.md)\napplies.\n\n# Upstream Improvements\n\nWork on filter-repo and [its\npredecessor](https://public-inbox.org/git/51419b2c0904072035u1182b507o836a67ac308d32b9@mail.gmail.com/)\nhas also driven numerous improvements to fast-export and fast-import\n(and occasionally other commands) in core git, based on things\nfilter-repo needs to do its work:\n\n  * git-2.24.0\n    * [fast-export: handle nested tags](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=941790d7de)\n    * [t9350: add tests for tags of things other than a commit](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=8d7d33c1ce)\n    * [fast-export: allow user to request tags be marked with --mark-tags](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=a1638cfe12)\n    * [fast-export: add support for --import-marks-if-exists](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=208d69246e)\n    * [fast-import: add support for new 'alias' command](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=b8f50e5b60)\n    * [fast-import: allow tags to be identified by mark labels](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=f73b2aba05)\n    * [fast-import: fix handling of deleted tags](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=3164e6bd24)\n    * [fast-export: fix exporting a tag and nothing else](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=af2abd870b)\n    * [git-fast-import.txt: clarify that multiple merge commits are allowed](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=d1387d3895)\n  * git-2.23.0\n    * [t9350: fix encoding test to actually test reencoding](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=32615ce762)\n    * [fast-import: support 'encoding' commit header](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=3edfcc65fd)\n    * [fast-export: avoid stripping encoding header if we cannot reencode](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=ccbfc96dc4)\n    * [fast-export: differentiate between explicitly UTF-8 and implicitly\n      UTF-8](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=57a8be2cb0)\n    * [fast-export: do automatic reencoding of commit messages only if\n      requested](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=e80001f8fd)\n  * git-2.22.0\n    * [log,diff-tree: add --combined-all-paths option](\n        https://git.kernel.org/pub/scm/git/git.git/commit/?id=d76ce4f734)\n    * [t9300: demonstrate bug with get-mark and empty orphan commits](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=62edbec7de)\n    * [git-fast-import.txt: fix wording about where ls command can appear](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=a63c54a019)\n    * [fast-import: check most prominent commands first](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=5056bb7646)\n    * [fast-import: only allow cat-blob requests where it makes sense](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=7ffde293f2)\n    * [fast-import: fix erroneous handling of get-mark with empty orphan\n      commits](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=cf7b857a77)\n    * [Honor core.precomposeUnicode in more places](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=8e712ef6fc)\n  * git-2.21.0\n    * [fast-export: convert sha1 to oid](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=843b9e6d48)\n    * [git-fast-import.txt: fix documentation for --quiet option](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=f55c979b14)\n    * [git-fast-export.txt: clarify misleading documentation about rev-list\n      args](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=4532be7cba)\n    * [fast-export: use value from correct enum](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=b93b81e799)\n    * [fast-export: avoid dying when filtering by paths and old tags exist](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=1f30c904b3)\n    * [fast-export: move commit rewriting logic into a function for reuse](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=f129c4275c)\n    * [fast-export: when using paths, avoid corrupt stream with non-existent\n      mark](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=cd13762d8f)\n    * [fast-export: ensure we export requested refs](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=fdf31b6369)\n    * [fast-export: add --reference-excluded-parents option](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=530ca19c02)\n    * [fast-import: remove unmaintained duplicate documentation](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=25dd3e4889)\n    * [fast-export: add a --show-original-ids option to show\n      original names](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=a965bb3116)\n    * [git-show-ref.txt: fix order of flags](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=bd8d6f0def)\n  * git-2.20.0\n    * [update-ref: fix type of update_flags variable to\n      match its usage](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=e4c34855a2)\n    * [update-ref: allow --no-deref with --stdin](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=d345e9fbe7)\n  * git-1.7.3\n    * [fast-export: Fix dropping of files with --import-marks and path\n      limiting](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=4087a02e45)\n    * [fast-export: Add a --full-tree option](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=7f40ab0916)\n    * [fast-export: Fix output order of D/F changes](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=060df62422)\n    * [fast-import: Improve robustness when D->F changes provided in wrong\n      order](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=253fb5f889)\n  * git-1.6.4:\n    * [fast-export: Set revs.topo_order before calling setup_revisions](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=668f3aa776)\n    * [fast-export: Omit tags that tag trees](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=02c48cd69b)\n    * [fast-export: Make sure we show actual ref names instead of \"(null)\"](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=2374502c6c)\n    * [fast-export: Do parent rewriting to avoid dropping relevant commits](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=32164131db)\n    * [fast-export: Add a --tag-of-filtered-object option for newly\n      dangling tags](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=2d8ad46919)\n    * [Add new fast-export testcases](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=25e0ca5dd6)\n    * [fast-export: Document the fact that git-rev-list arguments are\n      accepted](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=8af15d282e)\n  * git-1.6.3:\n    * [git-filter-branch: avoid collisions with variables in eval'ed\n      commands](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=d5b0c97d13)\n    * [Correct missing SP characters in grammar comment at top of\n      fast-import.c](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=98e1a4186a)\n    * [fast-export: Avoid dropping files from commits](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=ebeec7dbc5)\n  * git-1.6.1.4:\n    * [fast-export: ensure we traverse commits in topological order](\n      https://git.kernel.org/pub/scm/git/git.git/commit/?id=784f8affe4)\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/newren/git-filter-repo", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "git-filter-repo", "package_url": "https://pypi.org/project/git-filter-repo/", "platform": "any", "project_url": "https://pypi.org/project/git-filter-repo/", "project_urls": {"Homepage": "https://github.com/newren/git-filter-repo", "Issues": "https://github.com/newren/git-filter-repo/issues/", "Source": "https://github.com/newren/git-filter-repo"}, "release_url": "https://pypi.org/project/git-filter-repo/2.26.0/", "requires_dist": null, "requires_python": ">=3.5", "summary": "Quickly rewrite git repository history", "version": "2.26.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>git filter-repo is a versatile tool for rewriting history, which includes\n<a href=\"#design-rationale-behind-filter-repo\" rel=\"nofollow\">capabilities I have not found anywhere\nelse</a>.  It roughly falls into the\nsame space of tool as <a href=\"https://git-scm.com/docs/git-filter-branch\" rel=\"nofollow\">git\nfilter-branch</a> but without the\ncapitulation-inducing poor\n<a href=\"https://public-inbox.org/git/CABPp-BGOz8nks0+Tdw5GyGqxeYR-3FF6FT5JcgVqZDYVRQ6qog@mail.gmail.com/\" rel=\"nofollow\">performance</a>,\nwith far more capabilities, and with a design that scales usability-wise\nbeyond trivial rewriting cases.  <a href=\"https://git-scm.com/docs/git-filter-branch#_warning\" rel=\"nofollow\">git filter-repo is now recommended by the\ngit project</a> instead\nof git filter-branch.</p>\n<p>While most users will probably just use filter-repo as a simple command\nline tool (and likely only use a few of its flags), at its core filter-repo\ncontains a library for creating history rewriting tools.  As such, users\nwith specialized needs can leverage it to quickly create <a href=\"contrib/filter-repo-demos\" rel=\"nofollow\">entirely new\nhistory rewriting tools</a>.</p>\n<h1>Table of Contents</h1>\n<ul>\n<li><a href=\"#prerequisites\" rel=\"nofollow\">Prerequisites</a></li>\n<li><a href=\"#how-do-i-install-it\" rel=\"nofollow\">How do I install it?</a></li>\n<li><a href=\"#how-do-i-use-it\" rel=\"nofollow\">How do I use it?</a></li>\n<li><a href=\"#why-filter-repo-instead-of-other-alternatives\" rel=\"nofollow\">Why filter-repo instead of other alternatives?</a>\n<ul>\n<li><a href=\"#filter-branch\" rel=\"nofollow\">filter-branch</a></li>\n<li><a href=\"#bfg-repo-cleaner\" rel=\"nofollow\">BFG Repo Cleaner</a></li>\n</ul>\n</li>\n<li><a href=\"#simple-example-with-comparisons\" rel=\"nofollow\">Simple example, with comparisons</a>\n<ul>\n<li><a href=\"#solving-this-with-filter-repo\" rel=\"nofollow\">Solving this with filter-repo</a></li>\n<li><a href=\"#solving-this-with-other-filtering-tools\" rel=\"nofollow\">Solving this with other filtering tools</a></li>\n</ul>\n</li>\n<li><a href=\"#design-rationale-behind-filter-repo\" rel=\"nofollow\">Design rationale behind filter-repo</a></li>\n<li><a href=\"#how-do-i-contribute\" rel=\"nofollow\">How do I contribute?</a></li>\n<li><a href=\"#is-there-a-code-of-conduct\" rel=\"nofollow\">Is there a Code of Conduct?</a></li>\n<li><a href=\"#upstream-improvements\" rel=\"nofollow\">Upstream Improvements</a></li>\n</ul>\n<h1>Prerequisites</h1>\n<p>filter-repo requires:</p>\n<ul>\n<li>git &gt;= 2.22.0 at a minimum; <a href=\"#upstream-improvements\" rel=\"nofollow\">some features</a>\nrequire git &gt;= 2.24.0</li>\n<li>python3 &gt;= 3.5</li>\n</ul>\n<h1>How do I install it?</h1>\n<p>git-filter-repo is a single-file python script, which was done to make\ninstallation for basic use trivial: just copy it into your $PATH.</p>\n<p>See <a href=\"INSTALL.md\" rel=\"nofollow\">INSTALL.md</a> for things beyond basic usage or special\ncases.  The more involved instructions are needed if you</p>\n<ul>\n<li>are working with a python3 executable named something other than \"python3\"</li>\n<li>want to install documentation (beyond the builtin docs shown with -h)</li>\n<li>want to run some of the <a href=\"contrib/filter-repo-demos/\" rel=\"nofollow\">contrib</a> examples</li>\n<li>want to create your own python filtering scripts using filter-repo as a\nmodule/library</li>\n</ul>\n<h1>How do I use it?</h1>\n<p>See the <a href=\"https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html\" rel=\"nofollow\">user\nmanual</a>.\nIf you prefer learning from examples, the <a href=\"#simple-example-with-comparisons\" rel=\"nofollow\">simple\nexample</a> below may be of interest,\nand the user manual has an extensive <a href=\"https://htmlpreview.github.io/?https://github.com/newren/git-filter-repo/blob/docs/html/git-filter-repo.html#EXAMPLES\" rel=\"nofollow\">examples\nsection</a>.</p>\n<h1>Why filter-repo instead of other alternatives?</h1>\n<p>This was covered in more detail in a <a href=\"https://git.github.io/rev_news/2019/08/21/edition-54/#an-introduction-to-git-filter-repo--written-by-elijah-newren\" rel=\"nofollow\">Git Rev News article on\nfilter-repo</a>,\nbut some highlights for the main competitors:</p>\n<h2>filter-branch</h2>\n<ul>\n<li>\n<p>filter-branch is <a href=\"https://public-inbox.org/git/CABPp-BGOz8nks0+Tdw5GyGqxeYR-3FF6FT5JcgVqZDYVRQ6qog@mail.gmail.com/\" rel=\"nofollow\">extremely to unusably\nslow</a>\n(<a href=\"https://git-scm.com/docs/git-filter-branch#PERFORMANCE\" rel=\"nofollow\">multiple orders of magnitude slower than it should\nbe</a>)\nfor non-trivial repositories.</p>\n</li>\n<li>\n<p><a href=\"https://git-scm.com/docs/git-filter-branch#SAFETY\" rel=\"nofollow\">filter-branch is riddled with\ngotchas</a> that can\nsilently corrupt your rewrite or at least thwart your \"cleanup\"\nefforts by giving you something more problematic and messy than what\nyou started with.</p>\n</li>\n<li>\n<p>filter-branch is <a href=\"#simple-example-with-comparisons\" rel=\"nofollow\">very onerous</a>\n<a href=\"https://github.com/newren/git-filter-repo/blob/a6a6a1b0f62d365bbe2e76f823e1621857ec4dbd/contrib/filter-repo-demos/filter-lamely#L9-L61\" rel=\"nofollow\">to\nuse</a>\nfor any rewrite which is even slightly non-trivial.</p>\n</li>\n<li>\n<p>the git project has stated that the above issues with filter-branch\ncannot be backward compatibly fixed; they recommend that you <a href=\"https://git-scm.com/docs/git-filter-branch#_warning\" rel=\"nofollow\">stop\nusing\nfilter-branch</a></p>\n</li>\n<li>\n<p>die-hard fans of filter-branch may be interested in\n<a href=\"contrib/filter-repo-demos/filter-lamely\" rel=\"nofollow\">filter-lamely</a>\n(a.k.a. <a href=\"contrib/filter-repo-demos/filter-branch-ish\" rel=\"nofollow\">filter-branch-ish</a>),\na reimplementation of filter-branch based on filter-repo which is\nmore performant (though not nearly as fast or safe as\nfilter-repo).</p>\n</li>\n</ul>\n<h2>BFG Repo Cleaner</h2>\n<ul>\n<li>\n<p>great tool for its time, but while it makes some things simple, it\nis limited to a few kinds of rewrites.</p>\n</li>\n<li>\n<p>its architecture is not amenable to handling more types of\nrewrites.</p>\n</li>\n<li>\n<p>its architecture presents some shortcomings and bugs even for its\nintended usecase.</p>\n</li>\n<li>\n<p>fans of bfg may be interested in\n<a href=\"contrib/filter-repo-demos/bfg-ish\" rel=\"nofollow\">bfg-ish</a>, a reimplementation of bfg\nbased on filter-repo which includes several new features and bugfixes\nrelative to bfg.</p>\n</li>\n</ul>\n<h1>Simple example, with comparisons</h1>\n<p>Let's say that we want to extract a piece of a repository, with the intent\non merging just that piece into some other bigger repo.  For extraction, we\nwant to:</p>\n<ul>\n<li>extract the history of a single directory, src/.  This means that only\npaths under src/ remain in the repo, and any commits that only touched\npaths outside this directory will be removed.</li>\n<li>rename all files to have a new leading directory, my-module/ (e.g. so that\nsrc/foo.c becomes my-module/src/foo.c)</li>\n<li>rename any tags in the extracted repository to have a 'my-module-'\nprefix (to avoid any conflicts when we later merge this repo into\nsomething else)</li>\n</ul>\n<h2>Solving this with filter-repo</h2>\n<p>Doing this with filter-repo is as simple as the following command:</p>\n<pre>  git filter-repo --path src/ --to-subdirectory-filter my-module --tag-rename <span class=\"s1\">''</span>:<span class=\"s1\">'my-module-'</span>\n</pre>\n<p>(the single quotes are unnecessary, but make it clearer to a human that we\nare replacing the empty string as a prefix with <code>my-module-</code>)</p>\n<h2>Solving this with other filtering tools</h2>\n<p>By contrast, BFG Repo Cleaner is not capable of this kind of rewrite,\nit would take considerable effort to do this safely with\nfast-export/fast-import (especially if you wanted empty commits pruned\nor commit hashes rewritten), and filter-branch comes with a pile of\ncaveats (more on that below) even once you figure out the necessary\ninvocation(s):</p>\n<pre>  git filter-branch <span class=\"se\">\\</span>\n      --tree-filter <span class=\"s1\">'mkdir -p my-module &amp;&amp; \\</span>\n<span class=\"s1\">                     git ls-files \\</span>\n<span class=\"s1\">                         | grep -v ^src/ \\</span>\n<span class=\"s1\">                         | xargs git rm -f -q &amp;&amp; \\</span>\n<span class=\"s1\">                     ls -d * \\</span>\n<span class=\"s1\">                         | grep -v my-module \\</span>\n<span class=\"s1\">                         | xargs -I files mv files my-module/'</span> <span class=\"se\">\\</span>\n          --tag-name-filter <span class=\"s1\">'echo \"my-module-$(cat)\"'</span> <span class=\"se\">\\</span>\n\t  --prune-empty -- --all\n  git clone file://<span class=\"k\">$(</span><span class=\"nb\">pwd</span><span class=\"k\">)</span> newcopy\n  <span class=\"nb\">cd</span> newcopy\n  git <span class=\"k\">for</span>-each-ref --format<span class=\"o\">=</span><span class=\"s2\">\"delete %(refname)\"</span> refs/tags/ <span class=\"se\">\\</span>\n      <span class=\"p\">|</span> grep -v refs/tags/my-module- <span class=\"se\">\\</span>\n      <span class=\"p\">|</span> git update-ref --stdin\n  git gc --prune<span class=\"o\">=</span>now\n</pre>\n<p>Some might notice that the above filter-branch invocation will be really\nslow due to using --tree-filter; you could alternatively use the\n--index-filter option of filter-branch, changing the above commands to:</p>\n<pre>  git filter-branch <span class=\"se\">\\</span>\n      --index-filter <span class=\"s1\">'git ls-files \\</span>\n<span class=\"s1\">                          | grep -v ^src/ \\</span>\n<span class=\"s1\">                          | xargs git rm -q --cached;</span>\n<span class=\"s1\">                      git ls-files -s \\</span>\n<span class=\"s1\">                          | sed \"s%$(printf \\\\t)%&amp;my-module/%\" \\</span>\n<span class=\"s1\">                          | git update-index --index-info;</span>\n<span class=\"s1\">                      git ls-files \\</span>\n<span class=\"s1\">                          | grep -v ^my-module/ \\</span>\n<span class=\"s1\">                          | xargs git rm -q --cached'</span> <span class=\"se\">\\</span>\n      --tag-name-filter <span class=\"s1\">'echo \"my-module-$(cat)\"'</span> <span class=\"se\">\\</span>\n      --prune-empty -- --all\n  git clone file://<span class=\"k\">$(</span><span class=\"nb\">pwd</span><span class=\"k\">)</span> newcopy\n  <span class=\"nb\">cd</span> newcopy\n  git <span class=\"k\">for</span>-each-ref --format<span class=\"o\">=</span><span class=\"s2\">\"delete %(refname)\"</span> refs/tags/ <span class=\"se\">\\</span>\n      <span class=\"p\">|</span> grep -v refs/tags/my-module- <span class=\"se\">\\</span>\n      <span class=\"p\">|</span> git update-ref --stdin\n  git gc --prune<span class=\"o\">=</span>now\n</pre>\n<p>However, for either filter-branch command there are a pile of caveats.\nFirst, some may be wondering why I list five commands here for\nfilter-branch.  Despite the use of --all and --tag-name-filter, and\nfilter-branch's manpage claiming that a clone is enough to get rid of\nold objects, the extra steps to delete the other tags and do another\ngc are still required to clean out the old objects and avoid mixing\nnew and old history before pushing somewhere.  Other caveats:</p>\n<ul>\n<li>Commit messages are not rewritten; so if some of your commit\nmessages refer to prior commits by (abbreviated) sha1, after the\nrewrite those messages will now refer to commits that are no longer\npart of the history.  It would be better to rewrite those\n(abbreviated) sha1 references to refer to the new commit ids.</li>\n<li>The --prune-empty flag sometimes misses commits that should be\npruned, and it will also prune commits that <em>started</em> empty rather\nthan just ended empty due to filtering.  For repositories that\nintentionally use empty commits for versioning and publishing\nrelated purposes, this can be detrimental.</li>\n<li>The commands above are OS-specific.  GNU vs. BSD issues for sed,\nxargs, and other commands often trip up users; I think I failed to\nget most folks to use --index-filter since the only example in the\nfilter-branch manpage that both uses it and shows how to move\neverything into a subdirectory is linux-specific, and it is not\nobvious to the reader that it has a portability issue since it\nsilently misbehaves rather than failing loudly.</li>\n<li>The --index-filter version of the filter-branch command may be two to\nthree times faster than the --tree-filter version, but both\nfilter-branch commands are going to be multiple orders of magnitude\nslower than filter-repo.</li>\n<li>Both commands assume all filenames are composed entirely of ascii\ncharacters (even special ascii characters such as tabs or double\nquotes will wreak havoc and likely result in missing files or\nmisnamed files)</li>\n</ul>\n<h1>Design rationale behind filter-repo</h1>\n<p>None of the existing repository filtering tools did what I wanted;\nthey all came up short for my needs.  No tool provided any of the\nfirst eight traits below I wanted, and all failed to provide at least\none of the last four traits as well:</p>\n<ol>\n<li>\n<p>[Starting report] Provide user an analysis of their repo to help\nthem get started on what to prune or rename, instead of expecting\nthem to guess or find other tools to figure it out.  (Triggered, e.g.\nby running the first time with a special flag, such as --analyze.)</p>\n</li>\n<li>\n<p>[Keep vs. remove] Instead of just providing a way for users to\neasily remove selected paths, also provide flags for users to\nonly <em>keep</em> certain paths.  Sure, users could workaround this by\nspecifying to remove all paths other than the ones they want to\nkeep, but the need to specify all paths that <em>ever</em> existed in\n<strong>any</strong> version of the repository could sometimes be quite\npainful.  For filter-branch, using pipelines like <code>git ls-files | grep -v ... | xargs -r git rm</code> might be a reasonable workaround\nbut can get unwieldy and isn't as straightforward for users; plus\nthose commands are often operating-system specific (can you spot\nthe GNUism in the snippet I provided?).</p>\n</li>\n<li>\n<p>[Renaming] It should be easy to rename paths.  For example, in\naddition to allowing one to treat some subdirectory as the root\nof the repository, also provide options for users to make the\nroot of the repository just become a subdirectory.  And more\ngenerally allow files and directories to be easily renamed.\nProvide sanity checks if renaming causes multiple files to exist\nat the same path.  (And add special handling so that if a commit\nmerely copied oldname-&gt;newname without modification, then\nfiltering oldname-&gt;newname doesn't trigger the sanity check and\ndie on that commit.)</p>\n</li>\n<li>\n<p>[More intelligent safety] Writing copies of the original refs to\na special namespace within the repo does not provide a\nuser-friendly recovery mechanism.  Many would struggle to recover\nusing that.  Almost everyone I've ever seen do a repository\nfiltering operation has done so with a fresh clone, because\nwiping out the clone in case of error is a vastly easier recovery\nmechanism.  Strongly encourage that workflow by detecting and\nbailing if we're not in a fresh clone, unless the user overrides\nwith --force.</p>\n</li>\n<li>\n<p>[Auto shrink] Automatically remove old cruft and repack the\nrepository for the user after filtering (unless overridden); this\nsimplifies things for the user, helps avoid mixing old and new\nhistory together, and avoids problems where the multi-step\nprocess for shrinking the repo documented in the manpage doesn't\nactually work in some cases.  (I'm looking at you,\nfilter-branch.)</p>\n</li>\n<li>\n<p>[Clean separation] Avoid confusing users (and prevent accidental\nre-pushing of old stuff) due to mixing old repo and rewritten\nrepo together.  (This is particularly a problem with filter-branch\nwhen using the --tag-name-filter option, and sometimes also an\nissue when only filtering a subset of branches.)</p>\n</li>\n<li>\n<p>[Versatility] Provide the user the ability to extend the tool or\neven write new tools that leverage existing capabilities, and\nprovide this extensibility in a way that (a) avoids the need to\nfork separate processes (which would destroy performance), (b)\navoids making the user specify OS-dependent shell commands (which\nwould prevent users from sharing commands with each other), (c)\ntakes advantage of rich data structures (because hashes, dicts,\nlists, and arrays are prohibitively difficult in shell) and (d)\nprovides reasonable string manipulation capabilities (which are\nsorely lacking in shell).</p>\n</li>\n<li>\n<p>[Old commit references] Provide a way for users to use old commit\nIDs with the new repository (in particular via mapping from old to\nnew hashes with refs/replace/ references).</p>\n</li>\n<li>\n<p>[Commit message consistency] If commit messages refer to other\ncommits by ID (e.g. \"this reverts commit 01234567890abcdef\", \"In\ncommit 0013deadbeef9a...\"), those commit messages should be\nrewritten to refer to the new commit IDs.</p>\n</li>\n<li>\n<p>[Become-empty pruning] Commits which become empty due to filtering\nshould be pruned.  If the parent of a commit is pruned, the first\nnon-pruned ancestor needs to become the new parent.  If no\nnon-pruned ancestor exists and the commit was not a merge, then it\nbecomes a new root commit.  If no non-pruned ancestor exists and\nthe commit was a merge, then the merge will have one less parent\n(and thus make it likely to become a non-merge commit which would\nitself be pruned if it had no file changes of its own).  One\nspecial thing to note here is that we prune commits which become\nempty, NOT commits which start empty.  Some projects intentionally\ncreate empty commits for versioning or publishing reasons, and\nthese should not be removed.  (As a special case, commits which\nstarted empty but whose parent was pruned away will also be\nconsidered to have \"become empty\".)</p>\n</li>\n<li>\n<p>[Become-degenerate pruning] Pruning of commits which become empty\ncan potentially cause topology changes, and there are lots of\nspecial cases.  Normally, merge commits are not removed since they\nare needed to preserve the graph topology, but the pruning of\nparents and other ancestors can ultimately result in the loss of\none or more parents.  A simple case was already noted above: if a\nmerge commit loses enough parents to become a non-merge commit and\nit has no file changes, then it too can be pruned.  Merge commits\ncan also have a topology that becomes degenerate: it could end up\nwith the merge_base serving as both parents (if all intervening\ncommits from the original repo were pruned), or it could end up\nwith one parent which is an ancestor of its other parent.  In such\ncases, if the merge has no file changes of its own, then the merge\ncommit can also be pruned.  However, much as we do with empty\npruning we do not prune merge commits that started degenerate\n(which indicates it may have been intentional, such as with --no-ff\nmerges) but only merge commits that become degenerate and have no\nfile changes of their own.</p>\n</li>\n<li>\n<p>[Speed] Filtering should be reasonably fast</p>\n</li>\n</ol>\n<h1>How do I contribute?</h1>\n<p>See the <a href=\"Documentation/Contributing.md\" rel=\"nofollow\">contributing guidelines</a>.</p>\n<h1>Is there a Code of Conduct?</h1>\n<p>Participants in the filter-repo community are expected to adhere to\nthe same standards as for the git project, so the <a href=\"https://git.kernel.org/pub/scm/git/git.git/tree/CODE_OF_CONDUCT.md\" rel=\"nofollow\">git Code of\nConduct</a>\napplies.</p>\n<h1>Upstream Improvements</h1>\n<p>Work on filter-repo and <a href=\"https://public-inbox.org/git/51419b2c0904072035u1182b507o836a67ac308d32b9@mail.gmail.com/\" rel=\"nofollow\">its\npredecessor</a>\nhas also driven numerous improvements to fast-export and fast-import\n(and occasionally other commands) in core git, based on things\nfilter-repo needs to do its work:</p>\n<ul>\n<li>git-2.24.0\n<ul>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=941790d7de\" rel=\"nofollow\">fast-export: handle nested tags</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=8d7d33c1ce\" rel=\"nofollow\">t9350: add tests for tags of things other than a commit</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=a1638cfe12\" rel=\"nofollow\">fast-export: allow user to request tags be marked with --mark-tags</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=208d69246e\" rel=\"nofollow\">fast-export: add support for --import-marks-if-exists</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=b8f50e5b60\" rel=\"nofollow\">fast-import: add support for new 'alias' command</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=f73b2aba05\" rel=\"nofollow\">fast-import: allow tags to be identified by mark labels</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=3164e6bd24\" rel=\"nofollow\">fast-import: fix handling of deleted tags</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=af2abd870b\" rel=\"nofollow\">fast-export: fix exporting a tag and nothing else</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=d1387d3895\" rel=\"nofollow\">git-fast-import.txt: clarify that multiple merge commits are allowed</a></li>\n</ul>\n</li>\n<li>git-2.23.0\n<ul>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=32615ce762\" rel=\"nofollow\">t9350: fix encoding test to actually test reencoding</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=3edfcc65fd\" rel=\"nofollow\">fast-import: support 'encoding' commit header</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=ccbfc96dc4\" rel=\"nofollow\">fast-export: avoid stripping encoding header if we cannot reencode</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=57a8be2cb0\" rel=\"nofollow\">fast-export: differentiate between explicitly UTF-8 and implicitly\nUTF-8</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=e80001f8fd\" rel=\"nofollow\">fast-export: do automatic reencoding of commit messages only if\nrequested</a></li>\n</ul>\n</li>\n<li>git-2.22.0\n<ul>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=d76ce4f734\" rel=\"nofollow\">log,diff-tree: add --combined-all-paths option</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=62edbec7de\" rel=\"nofollow\">t9300: demonstrate bug with get-mark and empty orphan commits</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=a63c54a019\" rel=\"nofollow\">git-fast-import.txt: fix wording about where ls command can appear</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=5056bb7646\" rel=\"nofollow\">fast-import: check most prominent commands first</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=7ffde293f2\" rel=\"nofollow\">fast-import: only allow cat-blob requests where it makes sense</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=cf7b857a77\" rel=\"nofollow\">fast-import: fix erroneous handling of get-mark with empty orphan\ncommits</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=8e712ef6fc\" rel=\"nofollow\">Honor core.precomposeUnicode in more places</a></li>\n</ul>\n</li>\n<li>git-2.21.0\n<ul>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=843b9e6d48\" rel=\"nofollow\">fast-export: convert sha1 to oid</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=f55c979b14\" rel=\"nofollow\">git-fast-import.txt: fix documentation for --quiet option</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=4532be7cba\" rel=\"nofollow\">git-fast-export.txt: clarify misleading documentation about rev-list\nargs</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=b93b81e799\" rel=\"nofollow\">fast-export: use value from correct enum</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=1f30c904b3\" rel=\"nofollow\">fast-export: avoid dying when filtering by paths and old tags exist</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=f129c4275c\" rel=\"nofollow\">fast-export: move commit rewriting logic into a function for reuse</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=cd13762d8f\" rel=\"nofollow\">fast-export: when using paths, avoid corrupt stream with non-existent\nmark</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=fdf31b6369\" rel=\"nofollow\">fast-export: ensure we export requested refs</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=530ca19c02\" rel=\"nofollow\">fast-export: add --reference-excluded-parents option</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=25dd3e4889\" rel=\"nofollow\">fast-import: remove unmaintained duplicate documentation</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=a965bb3116\" rel=\"nofollow\">fast-export: add a --show-original-ids option to show\noriginal names</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=bd8d6f0def\" rel=\"nofollow\">git-show-ref.txt: fix order of flags</a></li>\n</ul>\n</li>\n<li>git-2.20.0\n<ul>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=e4c34855a2\" rel=\"nofollow\">update-ref: fix type of update_flags variable to\nmatch its usage</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=d345e9fbe7\" rel=\"nofollow\">update-ref: allow --no-deref with --stdin</a></li>\n</ul>\n</li>\n<li>git-1.7.3\n<ul>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=4087a02e45\" rel=\"nofollow\">fast-export: Fix dropping of files with --import-marks and path\nlimiting</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=7f40ab0916\" rel=\"nofollow\">fast-export: Add a --full-tree option</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=060df62422\" rel=\"nofollow\">fast-export: Fix output order of D/F changes</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=253fb5f889\" rel=\"nofollow\">fast-import: Improve robustness when D-&gt;F changes provided in wrong\norder</a></li>\n</ul>\n</li>\n<li>git-1.6.4:\n<ul>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=668f3aa776\" rel=\"nofollow\">fast-export: Set revs.topo_order before calling setup_revisions</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=02c48cd69b\" rel=\"nofollow\">fast-export: Omit tags that tag trees</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=2374502c6c\" rel=\"nofollow\">fast-export: Make sure we show actual ref names instead of \"(null)\"</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=32164131db\" rel=\"nofollow\">fast-export: Do parent rewriting to avoid dropping relevant commits</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=2d8ad46919\" rel=\"nofollow\">fast-export: Add a --tag-of-filtered-object option for newly\ndangling tags</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=25e0ca5dd6\" rel=\"nofollow\">Add new fast-export testcases</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=8af15d282e\" rel=\"nofollow\">fast-export: Document the fact that git-rev-list arguments are\naccepted</a></li>\n</ul>\n</li>\n<li>git-1.6.3:\n<ul>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=d5b0c97d13\" rel=\"nofollow\">git-filter-branch: avoid collisions with variables in eval'ed\ncommands</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=98e1a4186a\" rel=\"nofollow\">Correct missing SP characters in grammar comment at top of\nfast-import.c</a></li>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=ebeec7dbc5\" rel=\"nofollow\">fast-export: Avoid dropping files from commits</a></li>\n</ul>\n</li>\n<li>git-1.6.1.4:\n<ul>\n<li><a href=\"https://git.kernel.org/pub/scm/git/git.git/commit/?id=784f8affe4\" rel=\"nofollow\">fast-export: ensure we traverse commits in topological order</a></li>\n</ul>\n</li>\n</ul>\n\n          </div>"}, "last_serial": 6869284, "releases": {"2.23.0": [{"comment_text": "", "digests": {"md5": "4557a3d14a8830ca950d8f1f348424f9", "sha256": "fa971935329be6a0da7fda83301d34204a82316613ccf7b0d12d2c4b30eaf41e"}, "downloads": -1, "filename": "git_filter_repo-2.23.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "4557a3d14a8830ca950d8f1f348424f9", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5", "size": 87654, "upload_time": "2019-12-26T20:42:50", "upload_time_iso_8601": "2019-12-26T20:42:50.459987Z", "url": "https://files.pythonhosted.org/packages/30/99/6d9301bfcc81aa304bdbc39bb7883bc2f466488ef52bcaf9074970259f91/git_filter_repo-2.23.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e1c2582abefa1a787343d8b33b570f4a", "sha256": "2f6478762605a89e835b4e8707dd736c007f316be8a0995c3a8e65a45a4a1db7"}, "downloads": -1, "filename": "git-filter-repo-2.23.0.tar.gz", "has_sig": false, "md5_digest": "e1c2582abefa1a787343d8b33b570f4a", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 95706, "upload_time": "2019-12-26T20:42:53", "upload_time_iso_8601": "2019-12-26T20:42:53.831489Z", "url": "https://files.pythonhosted.org/packages/ba/54/6ba541d1dd2abc6898219dfba5a95b91e0fa0ef39cdf46248915b8a2b7f8/git-filter-repo-2.23.0.tar.gz", "yanked": false}], "2.24.0": [{"comment_text": "", "digests": {"md5": "5f394d0af2125fb3d3911728f409e0b8", "sha256": "da47049ad71ae3edfc061843585a4f513bcf2deb5846ba4e706ba46f8a7b9021"}, "downloads": -1, "filename": "git_filter_repo-2.24.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "5f394d0af2125fb3d3911728f409e0b8", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5", "size": 93464, "upload_time": "2019-12-26T20:45:02", "upload_time_iso_8601": "2019-12-26T20:45:02.554285Z", "url": "https://files.pythonhosted.org/packages/89/8b/d213be7cd9ef60e5fe4906501443b54ae401084ce3bca17abf7bcc2664d6/git_filter_repo-2.24.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "2dcf8b9d6461d66f095b2b8941bc6b47", "sha256": "f366501b64506b0a05a8d134fe19ca0f41bb62a2dbe16f9c93c9bfb3610ec44e"}, "downloads": -1, "filename": "git-filter-repo-2.24.0.tar.gz", "has_sig": false, "md5_digest": "2dcf8b9d6461d66f095b2b8941bc6b47", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 101963, "upload_time": "2019-12-26T20:45:04", "upload_time_iso_8601": "2019-12-26T20:45:04.927041Z", "url": "https://files.pythonhosted.org/packages/96/66/0fa5cb9ca4b6e327730f01c9628c997480e39045338e4a6973d763fb1dbd/git-filter-repo-2.24.0.tar.gz", "yanked": false}], "2.25.0": [{"comment_text": "", "digests": {"md5": "59cb3f351eae7913b736b730301e2292", "sha256": "e0c1006530edaa07df0e70828f6292374c93c5111caed3e8a3ae9450b05f5dbe"}, "downloads": -1, "filename": "git_filter_repo-2.25.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "59cb3f351eae7913b736b730301e2292", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5", "size": 94653, "upload_time": "2020-01-13T20:06:33", "upload_time_iso_8601": "2020-01-13T20:06:33.814773Z", "url": "https://files.pythonhosted.org/packages/70/9e/0be778afd9b4bf7d40d0fc1997e357e5823b2a9f6bd2e7bb01e96f4d8105/git_filter_repo-2.25.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "44f260c5baa28d0f3f935a28def4fa7f", "sha256": "9591b395bd5a58c4ac999d929e4f475c60d02849b6b4ce7fd3261429a5195ee6"}, "downloads": -1, "filename": "git-filter-repo-2.25.0.tar.gz", "has_sig": false, "md5_digest": "44f260c5baa28d0f3f935a28def4fa7f", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 109320, "upload_time": "2020-01-13T20:06:35", "upload_time_iso_8601": "2020-01-13T20:06:35.787002Z", "url": "https://files.pythonhosted.org/packages/fd/58/4ecd7989d9516fb1d5a835e48e91486690112194ef21a903ff48ea830aec/git-filter-repo-2.25.0.tar.gz", "yanked": false}], "2.26.0": [{"comment_text": "", "digests": {"md5": "36824711d359edb2d143ed9449499954", "sha256": "e2d57941b6eb74c8807e2ec6bb71ec436647ac6ce1b9ccfcd161866e0b1b33e3"}, "downloads": -1, "filename": "git_filter_repo-2.26.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "36824711d359edb2d143ed9449499954", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5", "size": 95565, "upload_time": "2020-03-23T22:58:17", "upload_time_iso_8601": "2020-03-23T22:58:17.933806Z", "url": "https://files.pythonhosted.org/packages/0f/8b/d7f077e1be429cbdbc55a16048467cf9aa7faf7b7bc776a2905c0b8139ca/git_filter_repo-2.26.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "382f58aa94ceaab288cf5c05554619f6", "sha256": "c17c012fb9730e5e6f4bc886067d88cabce55f7f24fc0262f8159dadf2f0fee1"}, "downloads": -1, "filename": "git-filter-repo-2.26.0.tar.gz", "has_sig": false, "md5_digest": "382f58aa94ceaab288cf5c05554619f6", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 104539, "upload_time": "2020-03-23T22:58:20", "upload_time_iso_8601": "2020-03-23T22:58:20.081579Z", "url": "https://files.pythonhosted.org/packages/40/5f/b1d353c2a173a36fcff0b4d4c3182b8eb2e5d0d225f71f27bdd3dff39588/git-filter-repo-2.26.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "36824711d359edb2d143ed9449499954", "sha256": "e2d57941b6eb74c8807e2ec6bb71ec436647ac6ce1b9ccfcd161866e0b1b33e3"}, "downloads": -1, "filename": "git_filter_repo-2.26.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "36824711d359edb2d143ed9449499954", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5", "size": 95565, "upload_time": "2020-03-23T22:58:17", "upload_time_iso_8601": "2020-03-23T22:58:17.933806Z", "url": "https://files.pythonhosted.org/packages/0f/8b/d7f077e1be429cbdbc55a16048467cf9aa7faf7b7bc776a2905c0b8139ca/git_filter_repo-2.26.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "382f58aa94ceaab288cf5c05554619f6", "sha256": "c17c012fb9730e5e6f4bc886067d88cabce55f7f24fc0262f8159dadf2f0fee1"}, "downloads": -1, "filename": "git-filter-repo-2.26.0.tar.gz", "has_sig": false, "md5_digest": "382f58aa94ceaab288cf5c05554619f6", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 104539, "upload_time": "2020-03-23T22:58:20", "upload_time_iso_8601": "2020-03-23T22:58:20.081579Z", "url": "https://files.pythonhosted.org/packages/40/5f/b1d353c2a173a36fcff0b4d4c3182b8eb2e5d0d225f71f27bdd3dff39588/git-filter-repo-2.26.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:57:05 2020"}