{"info": {"author": "PlanB", "author_email": "mingyu.planb@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Operating System :: MacOS", "Operating System :: Microsoft", "Programming Language :: Python", "Programming Language :: Python :: 2", "Programming Language :: Python :: 3", "Topic :: Software Development :: Libraries :: Python Modules", "Topic :: Utilities", "Typing :: Typed"], "description": "# Google-Play-Scraper\n\n[![Code style: black](https://img.shields.io/badge/code%20style-black-000000.svg)](https://github.com/python/black)\n[![PyPI](https://img.shields.io/pypi/v/google-play-scraper.svg)](https://pypi.org/project/google-play-scraper)\n[![downloads](https://img.shields.io/pypi/dm/google-play-scraper.svg)](https://pypistats.org/packages/google-play-scraper)\n[![versions](https://img.shields.io/pypi/pyversions/google-play-scraper.svg)](https://github.com/JoMingyu/google-play-scraper)\n\nGoogle-Play-Scraper provides APIs to easily crawl the Google Play Store for Python *without any external dependencies!*\n\n## Related Projects\n### [google-play-scraper](https://github.com/facundoolano/google-play-scraper)\n> Node.js scraper to get data from Google Play\n\nI have referred a lot to the API design of this library.\n\n## Installation\n```\npip install google-play-scraper\n```\n\n## Usage\nThe country and language codes that can be included in the `lang` and `country` parameters described below depend on the [ISO 3166](https://en.wikipedia.org/wiki/List_of_ISO_3166_country_codes) and [ISO 639-1](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) standards, respectively. Therefore, we recommend using an ISO database library such as [pycountry](https://github.com/flyingcircusio/pycountry).\n\n### App Detail\n```python\nfrom google_play_scraper import app\n\nresult = app(\n    'com.nianticlabs.pokemongo',\n    lang='en', # defaults to 'en'\n    country='us' # defaults to 'us'\n)\n```\n\nResult of `print(result)`:\n\n```\n{\n    \"title\": \"Pokémon GO\",\n    \"appId\": \"com.nianticlabs.pokemongo\",\n    \"url\": \"https://play.google.com/store/apps/details?id=com.nianticlabs.pokemongo&hl=en&gl=us\",\n    \"description\": \"NEW! It’s time to interact with your Pokémon like never before—Pokémon GO has recently introduced GO Snapshot! Taking AR photos is a snap with this easy-to-use update. You’re now able to take photos of any Pokémon you have in your collection. Document your adventures by taking photos of your favorite Pokémon to share with friends or as a memento of your epic journey. \\r\\n \\r\\nJoin Trainers across the globe who are discovering Pokémon as they explore the world around them. Pokémon GO is the global gaming sensation that has been downloaded over 850 million times and named \\\"Best Mobile Game\\\" by The Game Developers Choice Awards and \\\"Best App of the Year\\\" by TechCrunch.\\r\\n\\r\\nVenusaur, Charizard, Blastoise, Pikachu, and many other Pokémon have been discovered!\\r\\nPokémon are out there, and you need to find them. As you walk around a neighborhood, your smartphone will vibrate when there’s a Pokémon nearby. Take aim and throw a Poké Ball… You’ll have to stay alert, or it might get away!\\r\\n \\r\\nSearch far and wide for Pokémon and items\\r\\nCertain Pokémon appear near their native environment—look for Water-type Pokémon by lakes and oceans. Visit PokéStops and Gyms—found at interesting places like museums, art installations, historical markers, and monuments—to stock up on Poké Balls and helpful items.\\r\\n \\r\\nCatching, hatching, evolving, and more\\r\\nAs you level up, you’ll be able to catch more-powerful Pokémon to complete your Pokédex. You can add to your collection by hatching Pokémon Eggs based on the distances you walk. Help your Pokémon evolve by catching many of the same kind. Choose a Buddy Pokémon to walk with and earn Candy that will help you make your Pokémon stronger.\\r\\n \\r\\nCompete in epic Gym battles\\r\\nYou’ll join one of three teams and battle for the ownership of Gyms with your Pokémon at your side. As your Charmander evolves to Charmeleon and then Charizard, you can battle together to defeat a Gym and assign your Pokémon to defend it against all comers. \\r\\n\\r\\nTeam up to defeat powerful Raid Bosses\\r\\nA Raid Battle is a cooperative gameplay experience that encourages you to work with up to 20 other Trainers to defeat an extremely powerful Pokémon known as the Raid Boss. If you succeed in defeating it in battle, you’ll have the chance to catch an extra powerful Pokémon of your own!\\r\\n \\r\\nIt’s time to get moving—your real-life adventures await!\\r\\n\\r\\nNotes: \\r\\n\\r\\n- This app is free-to-play and offers in-game purchases. It is optimized for smartphones, not tablets.\\r\\n- Compatible with Android devices that have 2GB RAM or more and have Android Version 4.4–7.0+ installed.\\r\\n- Compatibility is not guaranteed for devices without GPS capabilities or devices that are connected only to Wi-Fi networks.\\r\\n- Compatibility with tablet devices is not guaranteed.\\r\\n- Application may not run on certain devices even if they have compatible OS versions installed.\\r\\n- It is recommended to play while connected to a network in order to obtain accurate location information.\\r\\n- Compatibility information may be changed at any time.\\r\\n- Please visit www.PokemonGO.com for additional compatibility information. \\r\\n- Information current as of February 18, 2019\",\n    \"descriptionHTML\": \"NEW! It’s time to interact with your Pokémon like never before—Pokémon GO has recently introduced GO Snapshot! Taking AR photos is a snap with this easy-to-use update. You’re now able to take photos of any Pokémon you have in your collection. Document your adventures by taking photos of your favorite Pokémon to share with friends or as a memento of your epic journey. <br> <br>Join Trainers across the globe who are discovering Pokémon as they explore the world around them. Pokémon GO is the global gaming sensation that has been downloaded over 850 million times and named &quot;Best Mobile Game&quot; by The Game Developers Choice Awards and &quot;Best App of the Year&quot; by TechCrunch.<br><br>Venusaur, Charizard, Blastoise, Pikachu, and many other Pokémon have been discovered!<br>Pokémon are out there, and you need to find them. As you walk around a neighborhood, your smartphone will vibrate when there’s a Pokémon nearby. Take aim and throw a Poké Ball… You’ll have to stay alert, or it might get away!<br> <br>Search far and wide for Pokémon and items<br>Certain Pokémon appear near their native environment—look for Water-type Pokémon by lakes and oceans. Visit PokéStops and Gyms—found at interesting places like museums, art installations, historical markers, and monuments—to stock up on Poké Balls and helpful items.<br> <br>Catching, hatching, evolving, and more<br>As you level up, you’ll be able to catch more-powerful Pokémon to complete your Pokédex. You can add to your collection by hatching Pokémon Eggs based on the distances you walk. Help your Pokémon evolve by catching many of the same kind. Choose a Buddy Pokémon to walk with and earn Candy that will help you make your Pokémon stronger.<br> <br>Compete in epic Gym battles<br>You’ll join one of three teams and battle for the ownership of Gyms with your Pokémon at your side. As your Charmander evolves to Charmeleon and then Charizard, you can battle together to defeat a Gym and assign your Pokémon to defend it against all comers. <br><br>Team up to defeat powerful Raid Bosses<br>A Raid Battle is a cooperative gameplay experience that encourages you to work with up to 20 other Trainers to defeat an extremely powerful Pokémon known as the Raid Boss. If you succeed in defeating it in battle, you’ll have the chance to catch an extra powerful Pokémon of your own!<br> <br>It’s time to get moving—your real-life adventures await!<br><br>Notes: <br><br>- This app is free-to-play and offers in-game purchases. It is optimized for smartphones, not tablets.<br>- Compatible with Android devices that have 2GB RAM or more and have Android Version 4.4–7.0+ installed.<br>- Compatibility is not guaranteed for devices without GPS capabilities or devices that are connected only to Wi-Fi networks.<br>- Compatibility with tablet devices is not guaranteed.<br>- Application may not run on certain devices even if they have compatible OS versions installed.<br>- It is recommended to play while connected to a network in order to obtain accurate location information.<br>- Compatibility information may be changed at any time.<br>- Please visit www.PokemonGO.com for additional compatibility information. <br>- Information current as of February 18, 2019\",\n    \"summary\": \"Step outside and catch Pokémon in the real world! Collect & battle with others.\",\n    \"summaryHTML\": \"Step outside and catch Pokémon in the real world! Collect &amp; battle with others.\",\n    \"installs\": \"100,000,000+\",\n    \"minInstalls\": 100000000,\n    \"score\": 4.126332,\n    \"ratings\": 12001843,\n    \"reviews\": 4772986,\n    \"histogram\": [\n        1535599,\n        406833,\n        842775,\n        1437189,\n        7779447\n    ],\n    \"price\": 0,\n    \"free\": True,\n    \"currency\": \"USD\",\n    \"offersIAP\": True,\n    \"size\": \"94M\",\n    \"androidVersion\": \"5.0\",\n    \"androidVersionText\": \"5.0 and up\",\n    \"developer\": \"Niantic, Inc.\",\n    \"developerId\": \"Niantic,+Inc.\",\n    \"developerEmail\": \"pokemon-go-support@nianticlabs.com\",\n    \"developerWebsite\": \"http://pokemongo.nianticlabs.com\",\n    \"developerAddress\": \"One Ferry Building, Suite 200\\nSan Francisco, CA 94111\",\n    \"privacyPolicy\": \"https://nianticlabs.com/privacy/pokemongo/en\",\n    \"developerInternalID\": \"7632469272431224129\",\n    \"genre\": \"Adventure\",\n    \"genreId\": \"GAME_ADVENTURE\",\n    \"familyGenre\": None,\n    \"familyGenreId\": None,\n    \"icon\": \"https://lh3.googleusercontent.com/wPfLmWBJwsPdBhsFXc8X4QZOOvePWjoOBLFXXCwyegjRwYOuabmG5cynthlW0HDgy9s\",\n    \"headerImage\": \"https://lh3.googleusercontent.com/KgDQ-Kjb2B7_jDP-8KmQDNhAmP2lqAV_w3zArOCBL7YZnQ02Qqp4VTlgdocO-4MFk4s\",\n    \"screenshots\": [\n        \"https://lh3.googleusercontent.com/K3IEjo1_LQWSpiD99xAbcfJNXcTG7W7wf3zUkYzQVj5k7OqSkdsoO-SmcZmxvF4CWIo\",\n        \"https://lh3.googleusercontent.com/WeqKYk-_b4GyvkKAhp_AOwoQeP0X3VdiznoVaNE5Qc8Q1lh8uamv-iYWc50_FYsUDg\",\n        \"https://lh3.googleusercontent.com/WCohW4co4ql2e6QwT1KhMos-6z0yH5z7kQMr-GLdC9s1bzMI8W5Yj8hU9BWDKLCguHw\",\n        \"https://lh3.googleusercontent.com/1iRwgEuQSoT4AsSiPhFou-5eCwyLSzfnJ6A5YdW--N_EjDMTTW61bCgc9RaR9ZfcHqQ\",\n        \"https://lh3.googleusercontent.com/hUU4GGw6zTmG_5zyDvdpMeK62tqxUPbrACwsl21hJPNgzOW-WAkvNRkRMv2Hv8pAXw\",\n        \"https://lh3.googleusercontent.com/d9hOdTf9EMqQFb6NxX7vP8Hu41jul7uF_24uXgMJjNE2Vbs4uliwfUM_LDjwj7mSec0\",\n        \"https://lh3.googleusercontent.com/DB42-AV-hedxobwSeruqvBc6knupZjjBqsdPxhT9kgpsCTHtW6xpaKO1jIKB3a8PUg\",\n        \"https://lh3.googleusercontent.com/tmfbe4RhZOFGdQfXCvdQApmJRmjTBCtmabJ3nRE0zuc7FxYo97n4IxAhBYx2s13k2ZA\",\n        \"https://lh3.googleusercontent.com/-8F-a-NXGkOMoej-FIQXV5LPePWFbyj2Ql7z_xCM4MkszVfKDXYmhYmNOfJNQY0Z_w\",\n        \"https://lh3.googleusercontent.com/RVItTUG-T4r4fU3oJTae9-40VgkCCsbaBtjSDu50VzIxN4rGEkPK08FEEiLTcvBaE8yx\",\n        \"https://lh3.googleusercontent.com/mbxUU-1nEpv5HnF5OKzlFAePPQBLZtpyUEU_XqyuFmwleBit6Gsn_YEyXiPUenEwSxa6\",\n        \"https://lh3.googleusercontent.com/09qBoXVvzGazKqyJ1SPoAcbMDaYXEQLJwHwnFD__BS1-FJ8jS0pzdXN3-pEoEYTfgQ\",\n        \"https://lh3.googleusercontent.com/l1FdglZMSppao9cjUw8P5QJdF-Sb6UfAHIxGN4iJk6Mtzz7RKME5boHiEN5b3BIX7A\",\n        \"https://lh3.googleusercontent.com/bhpXUBwqKhyDSoPIdm-CLhMxsM3FWgjjnA4DzDheUea-8UvukHRZxLzbJCr7tlbIhA\"\n    ],\n    \"video\": None,\n    \"videoImage\": None,\n    \"contentRating\": \"Everyone\",\n    \"contentRatingDescription\": \"Mild Fantasy Violence\",\n    \"adSupported\": False,\n    \"released\": \"Jul 6, 2016\",\n    \"updated\": 1563814423,\n    \"version\": \"0.149.0\",\n    \"recentChanges\": \"Trainers—we need your help! Team GO Rocket is invading the world of Pokémon GO!\\r\\n\\r\\nHere’s what can you expect in this release.\\r\\n\\r\\n- New Challenges: Take on Team GO Rocket Grunts in battle!\\r\\n- Shadow Pokémon: Catch the mysterious Shadow Pokémon Team GO Rocket Grunts leave behind! Is there a way to help these Pokémon?\\r\\n- New Appraisal Tool: You can now learn even more about your Pokémon when appraising them.\\r\\n- Battle Minigames: Charged Attack gameplay includes new minigames.\",\n    \"recentChangesHTML\": \"Trainers—we need your help! Team GO Rocket is invading the world of Pokémon GO!<br><br>Here’s what can you expect in this release.<br><br>- New Challenges: Take on Team GO Rocket Grunts in battle!<br>- Shadow Pokémon: Catch the mysterious Shadow Pokémon Team GO Rocket Grunts leave behind! Is there a way to help these Pokémon?<br>- New Appraisal Tool: You can now learn even more about your Pokémon when appraising them.<br>- Battle Minigames: Charged Attack gameplay includes new minigames.\",\n    \"comments\": [\n        \"*revised. This game is horrible after this last update. I do not like the appraisal filter. There are more bugs then ever. '' *This game is getting worse and worse. I am unable to update my app. There is never a new update for me. Everyone around me has had 2- 3 updates but I have not. I've gone to their customer service for help, nothing. Their customer service is awful. Automated useless replies. Now my game is freezing. I'm dropping in raids, losing raid bosses.\",\n        \"I love the game but I'm having issues with the friends list. Error keeps saying, \\\"Failed to get friends list. Try again later.\\\" I've already uninstalled and installed the game four times. The error keeps popping up. I also can't walk my eggs. They are all in incubators and I've walked for an hour straight and it still reads 0/2.0, 0/5.0, and 0/10.0... very frustrating!\",\n        \"This game is an amazing game except for one mechanic, the 50 pokecoin per day limit. This limits you from receiving more than 50 pokecoins (The in-game secondary currency that costs real money) per day from gyms. This is a cheap tactic to manipulate you to purchase more pokecoins, I get that they have developers and animators and artists. I understand they need to pay people and make a profit on top of that, but I strongly believe the previous limit of 100 was much more reasonable.\",\n        \"For the past week, it takes about 5 minutes for the game to load up & open. Half the time it doesn't load at all for me then when I do finally get on, it freezes up constantly or closes the app all together...often when I'm in the middle of trying to catch something. There was one day where I couldn't get the game to open at all & lost my streaks! I've tried restarting my phone, uninstalling then reinstalling...nothing has helped the issues. Not too happy with this game right now 👎\",\n        \"The latest update has made it near impossible to catch the pokemon with excellent throws. I can barely make out the little circle anymore. It's like the game was catered for large screen devices like tablets. I use a S7 edge and the catch screen is a nightmare. please revert! The game is still as glitchy as ever and nothing positive has come out of it. I can live without the quick catch for android, but the extreme downsize to the catch sequence leaves a lot to be desired. Wish i can go on\",\n        \"I've been playing pokemon go for about a year now, and I gotta say, with the new update that just happened, I can not stand the new appraisal system. it just says when and where the pokemon was caught and gives you a little picture with a 3 star rating on its attack, defense, and hp. it basically rendered the add on PokeGenie useless. and even if you dont use apps like pokegenie and Calcy IV, it still doesn't tell if the pokemon will be good in battle or not\",\n        \"Great game! My only issue with pokemon go is the step count. I have attempted several times to fix this through settings and such. I have a galaxy s10 so performance isn't an issue. I've been trying to hatch a 2 meter egg for two weeks now. not sure what's up but I'd really appreciate it if my issue was fixed.\",\n        \"love the game, but I have 1 point of criticism if you want to even suggest an edit, you need to find someone who played Scanner [REDACTED] before new signups were redirected to Ingress Prime. I asked around for weeks on ingress and nobody responded, because noone plays it here.. There are stops incorrectly placed in my area and no way to even suggest a change. give players over level 30 the ability to suggest edits, and level 40 the ability to suggest new landmarks/curiousities as stops. PLEASE!\",\n        \"I don't know what happen with this game. I can't view my friends list even though I don't have any friends yet and I try to add friends in my friends list. I'm not even can view my step progress. I put on pokemon as my buddy still not counting any steps. Can you tell me what should I do.?\",\n        \"adventuer sync keeps getting turned off. any time there is an update or the game forces me to relog in. i do a lot of walking to find out half the time it doesnt count becaused they keep changing my settings. it gets aggrevating that every time i go to play have to check the settings to make sure they are how i left them. itis extremly annoying.\",\n        \"While I love the game, there are some things I wish was better. Like having a power meter to help you gage how far you will throw the pokeballs, or a way to grow and farm the berries. The bag limits are particularly frustrating for me, as I can go from \\\"You can't use this pokestop, your bag is full!\\\" to \\\"I can\\\"t catch any more pokemon I ran out of balls!\\\" In a matter of five minuets or less.\",\n        \"As someone who grew up with Pokemon, I really love this game, it'sso addictingand fun! and I love that I can play with others. Every update is more and more exciting! but I can't give it 5 stars, because 99% of my map vanished. I still have the pokestops and gyms which is a major relief lol, but except for a very small portion near my original log in point everything is just green.I've tried everything I can think of to fix it and I've never downloaded cheats, so I'm at a loss.\",\n        \"I absolutely love this game, but I think it can be better. Please make it so you can withdraw your pokemon from gyms manually, there are rarely any people that come to the gyms in my area and my pokemon are basically imprisoned in the gyms. I just want to be able to take out my pokemon from the gym, not even for the coins, just so I can switch pokemon or power up that one, is that to much to ask? Other than that, I really enjoy the game and I'll keep playing it. But please, free my pokemon.\",\n        \"After the recent update, the game is forcing me to play in AR mode. Even if I have it turned off. it will just show the pokemon in a white area. i tried reinstalling the app, it persists. AR is quite annoying and at this point its unplayable for me\",\n        \"Ok well Pokemon Go has Aided in my physical recovery from spinal surgery, my kids got me into the game,as a means to getting me out of the house and making me walk as my therapy,and it worked. I just made level 33, I'm having fun,and getting Exercise. I've done a couple of community days, and it's really neat to go out and see people of all ages out there playing and being together and having Fun,so keep it up there's a lot of Pokemon for me to still catch, and I look forward to doing it. Go 💛!\",\n        \"Love the game with all its little unexplained mysteries. It will make you spend, however. There's a suggestion I'd like to make. Could you make it possible to send friend requests through name instead of through trainer code? I've been playing this game for a week now, and although I've seen plenty of action and teamwork at Gyms and raids, I've got no friends yet. If friend requests are easier to send, you can add a block feature too, and I'm sure the game will be much more fun. Cheers!\",\n        \"I love this game, and yet I can't enjoy it right now. I am getting an error message 'friends list is unavailable' and 'field metrics are currently unavailable'. This means I cannot track my steps, hatch eggs, add friends and many other things. My girlfriend is not having issues and I am sad that I can't join in with her and have as much fun. This only started yesterday, else would have 5 stars as I really enjoy this game.\",\n        \"I love the game, but adventure sync no longer works after the last upgrade. All other game play is ok. I log a lot of km's a week and used to hatch eggs all the time and get km rewards. Now taking weeks of time with game on just to earn my distance. Otherwise would be a 5 star game.\",\n        \"As someone who never really got into Pokemon, this game is actually quit amazing. Got into it when it first came out as a way to get out and walk while staying entertained. Three years later the game has underwent many changes that have kept it fun and engaging. Really brings people tohther. If youre not already pary of the online sensation..download it.. Youll have a blast-oise!\",\n        \"This app is really cool! But if you are looking for problems then I got a few. First, is that you CAN NOT put LEGENDARY Pokemon in a gym. Second, when your Pokemon comes back from a gym and you get mony the max limet for each day is 50, which is not even enough money to buy something in the PokeStore! Third, in the clothes store the money to buy things is too expensive it costs 500 money and yes some items are FREE but seriously. Make sure to read the other comments to find more! Please fix.\",\n        \"This is a very nice game with nice graphics and system, however to me the only concern is about spoofing. I understand the point of blocking spoofing but it is sometimes unachievable for some people like me to walk all over the place to catch pokemon. I really hope that Niantic itself could support with joystick feature in a limited area for us to walk around. For example, we are able to use joystick feature to walk 3~5km around our location. That will be great!!!\",\n        \"What is going on with the GPS? It keeps asking me if driving when I'm walking. I'm a fast walker but not that fast. Also it seems to have a lot of trouble pinpointing my location. It'll have me in one spot then zoom me to another and then back again. It's also super hard to throw the balls. I'll hit the Pokemon with the ball but somehow still seem to miss. And what is up with not being able to catch a 300 cp Pokemon with a ultra ball? Really? Fix these issues and I'll give it 5 stars.\",\n        \"I like the game, but for what ever reason the game decided to not load all the way so i signed out and now i can no longer sign back in, and the game won't let me make a new account either. I have forced stop the game, cleared catch, and I even uninstalled and reinstalled the game nothing has fixed my problem. So I literally can't play the game anymore.\",\n        \"A lot better than before. not buggy like it used to be and more things to do in the game. Principal weak point of that game is there is never an event for parents after 7:30. Me or my wife love to take a walk after putting the kid to bed. When we do it, nothing happens in the game. Events and raids finish early. I think young parents would like an event once a month or 2. Forget raid hours early in the evening for us. It is not an option.\",\n        \"Disappointed. The concept is fun, and it makes finding adventures with the family easy. The issue comes with the battle style and the pokemon power levels. Battles and raids are 15 sec bursts of tapping as fast as you can, I find it kind of lame. That coupled with power levels that range from 1 to the thousands, I think even tens of thousands, really separates people who want to have fun occasionally from people who make the game their life.\",\n        \"Come on Niantic, I can't load the friends list, can't battle anyone, walking distance isnt being measured whatsoever, apparently i did 0km all of last week. Please sort these problems out, i love this game but ima have to leave it until these game-breaking bugs get fixed. If it helps, these issues are happening on my Huawei Mate 10 Pro\",\n        \"New update doesnt track distance traveled. I have lost out on 20+ km worth of my walking distance because the game simple does not work. I went about a year without playing because many features did not work. Finally returned to the game in May 2019 and the first update after my return and it seems that the same problems still persist, a lot of features/ideas yet none of them work properly.\",\n        \"I found the game of my dreams. As well as the people thatI dreamed of playing with. Its much more enjoyable with people who plays with you. But I do hope that the pokestop nomination update should be released quickly because there are a lot of places where there are only 1 gym and 1 pokestops, especially in the areas that are far from cities. I hope that this review reaches in the hearts of the game devs. Forever in support and in love with pokemons.\",\n        \"Its really fun. One thing that kind of bothers me is that you can't put legendary Pokemon in gyms that you take over. I know they are legendary but it i have noticed most of the time is that legendary pokemon, once caught, that they about as strong as any other Pokemon. it would be hilarious and awesome to see a gym full of legendary pokemon.\",\n        \"I love playing the game. Graphics are amazing, gameplay is amazing. I know it's being worked on, but I can't wait to be able to request new pokestops since I visit places that don't have any for miles. Also, the places with no stops wouldn't produce pokemon either. Being able to trade with long distance friends would be beneficial also for people with social anxiety who can't just walk up to someone and start talking to them. The way this game has grown since it started is unbelievably amazing!\",\n        \"It is such a GREAT game, but since the new update, pokemon in the wild are pretty much are all silhouettes, when you tap on them they are sometimes black squares, when you go into the pokedex half of them are also black squares and when you tap into your profile or into a pokemon that you have caught, the top part of the screen is just black. All that and it also crashed, ALOT!!! It is just unbearable.\",\n        \"I installed the game at first to get closer to my kids and exercise. I grew to love it and play it everyday. easy for all ages! the only thing I wish would be more pokestops and gyms but it's the only game that actually forces you to get up and move AND to make new friends. since starting this game I have made new friends from all over the world. we belong to different groups and we all meet up to raid. as an adult it is hard to make new friends, pokemon Go has given us a new life. come and play!\",\n        \"The screen stays on when eggs are ready to hatch, even when the phone's been upside down the entire time. I haven't had any battery issues with this new phone but I know some people aren't that fortunate. Edit: After playing for another day, I can see why people say the catch circle is too small. To those complaining about the new appraisal system, it's basically the same thing they just did the IV calculation for you. Plus you can swipe to compare pokemon side by side.\",\n        \"Just rejoined after deleting it two years ago and there have been a lot of upgrades! More Poke Stops and gyms, which is nice. However, the two-star rating is for the distance tracker and Adventure Sync. If the main point of this game is motivate people moving, then the trackers shouldn't be as off as they are. We walked at least a mile last night with the Adventure Sync on and full battery use, yet nothing was tracked in the game. Even checked this morning to see no progress added.\",\n        \"One of the best games you can get for free. The game has online currency, but is not pay to win as it is very easy for any free to play person to get currency. The game releases new updates, and pokémon so you are never board. Pokémon Go is fun to play and keeps you active at the same time. You can progress faster in the game by hatching eggs. whitch you aquire for free, and hatch by keeping active. You can play with friends and family to boost your progress all free! Pokémon Go deserves 5 stars\",\n        \"Not enough pokestops in rural areas!!! Not enough poke balls, or pokestops to get any! I live in a city with a mall and everything and still see nothing for miles! Only one poke stop and one gym at the churches, that's it! And I'm sitting in a neighborhood with a school and big park! Wizards unite has games at the park and objects popping up all over, so I've made my switch!\",\n        \"Good game but poke stops should be a little more plentiful with items and we should be able to do more things(battle, trade) with our friends even if they are not in our vicinity. Also statistically we should know more about our Pokemon instead of only relying on the CP and the uplifting words of an appraiser. Also there should be more clear cut meaning of the size of the Pokemon (XL and XS) and what it does to the Pokemon.\",\n        \"I've been playing this game for so long, I can't believe I haven't rated it yet. This is the very same game that blew up in 2016, but it's grown and refined a lot since then. The basic idea is to capture Pokémon while you're out, but you can also battle them in gyms and with other players. They also hold special events regularly for capturing special Pokémon. The game is best played with friends, but it's a fine \\\"fitness\\\" app, too. I give it a \\\"good enough to play for 3+ years\\\" out of 10.\",\n        \"Kinda lame tbh. I downloaded it for a Pokemon experience, which I do get, but time a degree. MAKE SURE you find out which teams typically operate in your area (which is extremely hard unless you know someone who uses the app), because you can end up on a bad team and never be able to experience the full fun of the game.\",\n        \"great game, but I'm really sad because when the game first came out, I had a dragonite and other good pokemon, and when I updated the game, they were ALL deleted. I was super sad to find all my good pokemon missing. plz fix that so it doesn't happen to others :(. it's still a great game though and I would reccomend getting it.\"\n    ]\n}\n```\n\n### App Reviews\n`reviews` function returns `result` with `continuation token`.\n\n- `result` : Crawling result of reviews. (list)\n- `continuation_token` : Data containing how many items were loaded, what arguments used in the current result. If you pass this value to the `continuation_token` parameter of the `reviews` function, the next items are crawled. For example, if 1000 reviews are retrieved and the returned token 'eXamplE' is passed to the reviews function, the list of reviews is retrieved from 1000 or later items.\n\n> Setting `count` too high can cause problems. Because the maximum number of reviews per page supported by Google Play is 200, it is designed to pagination and recrawl by 200 until the number of results reaches count.\n\n```python\nfrom google_play_scraper import Sort, reviews\n\nresult, continuation_token = reviews(\n    'com.fantome.penguinisle',\n    lang='en', # defaults to 'en'\n    country='us', # defaults to 'us'\n    sort=Sort.MOST_RELEVANT, # defaults to Sort.MOST_RELEVANT\n    count=3, # defaults to 100\n    filter_score_with=5 # defaults to None(means all score)\n)\n\n# If you pass `continuation_token` as an argument to the reviews function at this point,\n# it will crawl the items after 3 review items.\n\nresult, _ = reviews(\n    'com.fantome.penguinisle',\n    continuation_token=continuation_token # defaults to None(load from the beginning)\n)\n```\n\nResult of `print(result)`:\n\n```\n[\n    {\n        \"userName\": \"Alyssa Williams\",\n        \"userImage\": \"https://lh3.googleusercontent.com/-cVEHKr7mzv8/AAAAAAAAAAI/AAAAAAAAAAA/AKF05nB2r3GUkji31m0tC4ylFNiVMpmNWA/photo.jpg\",\n        \"content\": \"This is literally the best idle game I have ever played. The penguins waddle around and live their best lives in the cutest little outfits. I just unlocked the little penguins and I have been sobbing uncontrollably for ten minutes because they are so adorable. There are only two suggestions I have for this game: more of the penguin info ads. I love them. I have learned so much about all the teeny fellas. Secondly, I would like to be able to name my 'guins so I can tell them apart.\",\n        \"score\": 5,\n        \"thumbsUpCount\": 54,\n        \"reviewCreatedVersion\": \"1.16\",\n        \"at\": datetime.datetime(2020, 2, 24, 17, 19, 34),\n        \"replyContent\": \"Hello, We will gradually improve the various systems in the game to enhance the player's game experience. We have recorded your suggestions and feedback to the planner. If you have any other suggestions and ideas, please feel free to contact us at penguinisle@habby.com.Thank you for playing!\",\n        \"repliedAt\": datetime.datetime(2020, 2, 24, 18, 30, 42),\n    },\n    {\n        \"userName\": \"EasyJet 123\",\n        \"userImage\": \"https://lh3.googleusercontent.com/a-/AOh14GhE3-Fsq5KDs_kmCRGcifbNUQTOtK5DpZkJ2AiqyQ\",\n        \"content\": \"Easily my favorite game. Relaxing, with easy controls, no purchase necessary to advance... I love it. 100% recommend. I love how you can get gems continually by completing missions, and the low price of boosts are great. But how about adding new buildings like an airport, an army base, and a train station? Would be great to see these. And the building purchase price might be lowered so it's a bit easier to progress after the Igloo. Maybe...\",\n        \"score\": 5,\n        \"thumbsUpCount\": 79,\n        \"reviewCreatedVersion\": \"1.14\",\n        \"at\": datetime.datetime(2020, 2, 12, 8, 42, 41),\n        \"replyContent\": None,\n        \"repliedAt\": None,\n    },\n    {\n        \"userName\": \"Lillemann\",\n        \"userImage\": \"https://lh3.googleusercontent.com/a-/AOh14GjiVSIrx033k9HZ9Tu4BQ1iYZST0IRW8UlDCX3gdw\",\n        \"content\": \"Really good looking. And it runs super super smooth. I love the camera options when clicking the camera button. And the penguins looks absolutely awesome and I really love the limited eddition ones. That sometimes the ads are replaced with penguin facts is just awesome. I suggest that you set up some kind of leaderboard it could probobly show the players that are earning the most money per sec or something. But overall this game is a strong 10/10\",\n        \"score\": 5,\n        \"thumbsUpCount\": 2,\n        \"reviewCreatedVersion\": \"1.14\",\n        \"at\": datetime.datetime(2020, 2, 11, 18, 8, 11),\n        \"replyContent\": \"Thank you very much for your review concerning our game. We will try our best to do better,If you have any other feedback or suggestions, feel free to contact us at penguinisle@habby.com. Have a nice day!\",\n        \"repliedAt\": datetime.datetime(2020, 2, 11, 18, 53, 38),\n    },\n]\n```\n\n## Changes\nChange logs are here : [CHANGES.md](./CHANGES.md)\n\n## Contributing\nContributing guides can be found in [CONTRIBUTING.md](./CONTRIBUTING.md).", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/JoMingyu/google-play-scraper", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "google-play-scraper", "package_url": "https://pypi.org/project/google-play-scraper/", "platform": "", "project_url": "https://pypi.org/project/google-play-scraper/", "project_urls": {"Homepage": "https://github.com/JoMingyu/google-play-scraper"}, "release_url": "https://pypi.org/project/google-play-scraper/0.0.2.5/", "requires_dist": null, "requires_python": "", "summary": "Google-Play-Scraper provides APIs to easily crawl the Google Play Store for Python without any external dependencies!", "version": "0.0.2.5", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Google-Play-Scraper</h1>\n<p><a href=\"https://github.com/python/black\" rel=\"nofollow\"><img alt=\"Code style: black\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/fbfdc7754183ecf079bc71ddeabaf88f6cbc5c00/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f636f64652532307374796c652d626c61636b2d3030303030302e737667\"></a>\n<a href=\"https://pypi.org/project/google-play-scraper\" rel=\"nofollow\"><img alt=\"PyPI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8c1e9d5e6a7b9942f41d4ca33fa9b4cd9fdd8901/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f676f6f676c652d706c61792d736372617065722e737667\"></a>\n<a href=\"https://pypistats.org/packages/google-play-scraper\" rel=\"nofollow\"><img alt=\"downloads\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/f0adef46869a3116fa501d354cf0b5b3e8f2f18b/68747470733a2f2f696d672e736869656c64732e696f2f707970692f646d2f676f6f676c652d706c61792d736372617065722e737667\"></a>\n<a href=\"https://github.com/JoMingyu/google-play-scraper\" rel=\"nofollow\"><img alt=\"versions\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/354cfd2282d716cb2bd14ccc5bb64d7759ef636b/68747470733a2f2f696d672e736869656c64732e696f2f707970692f707976657273696f6e732f676f6f676c652d706c61792d736372617065722e737667\"></a></p>\n<p>Google-Play-Scraper provides APIs to easily crawl the Google Play Store for Python <em>without any external dependencies!</em></p>\n<h2>Related Projects</h2>\n<h3><a href=\"https://github.com/facundoolano/google-play-scraper\" rel=\"nofollow\">google-play-scraper</a></h3>\n<blockquote>\n<p>Node.js scraper to get data from Google Play</p>\n</blockquote>\n<p>I have referred a lot to the API design of this library.</p>\n<h2>Installation</h2>\n<pre><code>pip install google-play-scraper\n</code></pre>\n<h2>Usage</h2>\n<p>The country and language codes that can be included in the <code>lang</code> and <code>country</code> parameters described below depend on the <a href=\"https://en.wikipedia.org/wiki/List_of_ISO_3166_country_codes\" rel=\"nofollow\">ISO 3166</a> and <a href=\"https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes\" rel=\"nofollow\">ISO 639-1</a> standards, respectively. Therefore, we recommend using an ISO database library such as <a href=\"https://github.com/flyingcircusio/pycountry\" rel=\"nofollow\">pycountry</a>.</p>\n<h3>App Detail</h3>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">google_play_scraper</span> <span class=\"kn\">import</span> <span class=\"n\">app</span>\n\n<span class=\"n\">result</span> <span class=\"o\">=</span> <span class=\"n\">app</span><span class=\"p\">(</span>\n    <span class=\"s1\">'com.nianticlabs.pokemongo'</span><span class=\"p\">,</span>\n    <span class=\"n\">lang</span><span class=\"o\">=</span><span class=\"s1\">'en'</span><span class=\"p\">,</span> <span class=\"c1\"># defaults to 'en'</span>\n    <span class=\"n\">country</span><span class=\"o\">=</span><span class=\"s1\">'us'</span> <span class=\"c1\"># defaults to 'us'</span>\n<span class=\"p\">)</span>\n</pre>\n<p>Result of <code>print(result)</code>:</p>\n<pre><code>{\n    \"title\": \"Pokémon GO\",\n    \"appId\": \"com.nianticlabs.pokemongo\",\n    \"url\": \"https://play.google.com/store/apps/details?id=com.nianticlabs.pokemongo&amp;hl=en&amp;gl=us\",\n    \"description\": \"NEW! It’s time to interact with your Pokémon like never before—Pokémon GO has recently introduced GO Snapshot! Taking AR photos is a snap with this easy-to-use update. You’re now able to take photos of any Pokémon you have in your collection. Document your adventures by taking photos of your favorite Pokémon to share with friends or as a memento of your epic journey. \\r\\n \\r\\nJoin Trainers across the globe who are discovering Pokémon as they explore the world around them. Pokémon GO is the global gaming sensation that has been downloaded over 850 million times and named \\\"Best Mobile Game\\\" by The Game Developers Choice Awards and \\\"Best App of the Year\\\" by TechCrunch.\\r\\n\\r\\nVenusaur, Charizard, Blastoise, Pikachu, and many other Pokémon have been discovered!\\r\\nPokémon are out there, and you need to find them. As you walk around a neighborhood, your smartphone will vibrate when there’s a Pokémon nearby. Take aim and throw a Poké Ball… You’ll have to stay alert, or it might get away!\\r\\n \\r\\nSearch far and wide for Pokémon and items\\r\\nCertain Pokémon appear near their native environment—look for Water-type Pokémon by lakes and oceans. Visit PokéStops and Gyms—found at interesting places like museums, art installations, historical markers, and monuments—to stock up on Poké Balls and helpful items.\\r\\n \\r\\nCatching, hatching, evolving, and more\\r\\nAs you level up, you’ll be able to catch more-powerful Pokémon to complete your Pokédex. You can add to your collection by hatching Pokémon Eggs based on the distances you walk. Help your Pokémon evolve by catching many of the same kind. Choose a Buddy Pokémon to walk with and earn Candy that will help you make your Pokémon stronger.\\r\\n \\r\\nCompete in epic Gym battles\\r\\nYou’ll join one of three teams and battle for the ownership of Gyms with your Pokémon at your side. As your Charmander evolves to Charmeleon and then Charizard, you can battle together to defeat a Gym and assign your Pokémon to defend it against all comers. \\r\\n\\r\\nTeam up to defeat powerful Raid Bosses\\r\\nA Raid Battle is a cooperative gameplay experience that encourages you to work with up to 20 other Trainers to defeat an extremely powerful Pokémon known as the Raid Boss. If you succeed in defeating it in battle, you’ll have the chance to catch an extra powerful Pokémon of your own!\\r\\n \\r\\nIt’s time to get moving—your real-life adventures await!\\r\\n\\r\\nNotes: \\r\\n\\r\\n- This app is free-to-play and offers in-game purchases. It is optimized for smartphones, not tablets.\\r\\n- Compatible with Android devices that have 2GB RAM or more and have Android Version 4.4–7.0+ installed.\\r\\n- Compatibility is not guaranteed for devices without GPS capabilities or devices that are connected only to Wi-Fi networks.\\r\\n- Compatibility with tablet devices is not guaranteed.\\r\\n- Application may not run on certain devices even if they have compatible OS versions installed.\\r\\n- It is recommended to play while connected to a network in order to obtain accurate location information.\\r\\n- Compatibility information may be changed at any time.\\r\\n- Please visit www.PokemonGO.com for additional compatibility information. \\r\\n- Information current as of February 18, 2019\",\n    \"descriptionHTML\": \"NEW! It’s time to interact with your Pokémon like never before—Pokémon GO has recently introduced GO Snapshot! Taking AR photos is a snap with this easy-to-use update. You’re now able to take photos of any Pokémon you have in your collection. Document your adventures by taking photos of your favorite Pokémon to share with friends or as a memento of your epic journey. &lt;br&gt; &lt;br&gt;Join Trainers across the globe who are discovering Pokémon as they explore the world around them. Pokémon GO is the global gaming sensation that has been downloaded over 850 million times and named &amp;quot;Best Mobile Game&amp;quot; by The Game Developers Choice Awards and &amp;quot;Best App of the Year&amp;quot; by TechCrunch.&lt;br&gt;&lt;br&gt;Venusaur, Charizard, Blastoise, Pikachu, and many other Pokémon have been discovered!&lt;br&gt;Pokémon are out there, and you need to find them. As you walk around a neighborhood, your smartphone will vibrate when there’s a Pokémon nearby. Take aim and throw a Poké Ball… You’ll have to stay alert, or it might get away!&lt;br&gt; &lt;br&gt;Search far and wide for Pokémon and items&lt;br&gt;Certain Pokémon appear near their native environment—look for Water-type Pokémon by lakes and oceans. Visit PokéStops and Gyms—found at interesting places like museums, art installations, historical markers, and monuments—to stock up on Poké Balls and helpful items.&lt;br&gt; &lt;br&gt;Catching, hatching, evolving, and more&lt;br&gt;As you level up, you’ll be able to catch more-powerful Pokémon to complete your Pokédex. You can add to your collection by hatching Pokémon Eggs based on the distances you walk. Help your Pokémon evolve by catching many of the same kind. Choose a Buddy Pokémon to walk with and earn Candy that will help you make your Pokémon stronger.&lt;br&gt; &lt;br&gt;Compete in epic Gym battles&lt;br&gt;You’ll join one of three teams and battle for the ownership of Gyms with your Pokémon at your side. As your Charmander evolves to Charmeleon and then Charizard, you can battle together to defeat a Gym and assign your Pokémon to defend it against all comers. &lt;br&gt;&lt;br&gt;Team up to defeat powerful Raid Bosses&lt;br&gt;A Raid Battle is a cooperative gameplay experience that encourages you to work with up to 20 other Trainers to defeat an extremely powerful Pokémon known as the Raid Boss. If you succeed in defeating it in battle, you’ll have the chance to catch an extra powerful Pokémon of your own!&lt;br&gt; &lt;br&gt;It’s time to get moving—your real-life adventures await!&lt;br&gt;&lt;br&gt;Notes: &lt;br&gt;&lt;br&gt;- This app is free-to-play and offers in-game purchases. It is optimized for smartphones, not tablets.&lt;br&gt;- Compatible with Android devices that have 2GB RAM or more and have Android Version 4.4–7.0+ installed.&lt;br&gt;- Compatibility is not guaranteed for devices without GPS capabilities or devices that are connected only to Wi-Fi networks.&lt;br&gt;- Compatibility with tablet devices is not guaranteed.&lt;br&gt;- Application may not run on certain devices even if they have compatible OS versions installed.&lt;br&gt;- It is recommended to play while connected to a network in order to obtain accurate location information.&lt;br&gt;- Compatibility information may be changed at any time.&lt;br&gt;- Please visit www.PokemonGO.com for additional compatibility information. &lt;br&gt;- Information current as of February 18, 2019\",\n    \"summary\": \"Step outside and catch Pokémon in the real world! Collect &amp; battle with others.\",\n    \"summaryHTML\": \"Step outside and catch Pokémon in the real world! Collect &amp;amp; battle with others.\",\n    \"installs\": \"100,000,000+\",\n    \"minInstalls\": 100000000,\n    \"score\": 4.126332,\n    \"ratings\": 12001843,\n    \"reviews\": 4772986,\n    \"histogram\": [\n        1535599,\n        406833,\n        842775,\n        1437189,\n        7779447\n    ],\n    \"price\": 0,\n    \"free\": True,\n    \"currency\": \"USD\",\n    \"offersIAP\": True,\n    \"size\": \"94M\",\n    \"androidVersion\": \"5.0\",\n    \"androidVersionText\": \"5.0 and up\",\n    \"developer\": \"Niantic, Inc.\",\n    \"developerId\": \"Niantic,+Inc.\",\n    \"developerEmail\": \"pokemon-go-support@nianticlabs.com\",\n    \"developerWebsite\": \"http://pokemongo.nianticlabs.com\",\n    \"developerAddress\": \"One Ferry Building, Suite 200\\nSan Francisco, CA 94111\",\n    \"privacyPolicy\": \"https://nianticlabs.com/privacy/pokemongo/en\",\n    \"developerInternalID\": \"7632469272431224129\",\n    \"genre\": \"Adventure\",\n    \"genreId\": \"GAME_ADVENTURE\",\n    \"familyGenre\": None,\n    \"familyGenreId\": None,\n    \"icon\": \"https://lh3.googleusercontent.com/wPfLmWBJwsPdBhsFXc8X4QZOOvePWjoOBLFXXCwyegjRwYOuabmG5cynthlW0HDgy9s\",\n    \"headerImage\": \"https://lh3.googleusercontent.com/KgDQ-Kjb2B7_jDP-8KmQDNhAmP2lqAV_w3zArOCBL7YZnQ02Qqp4VTlgdocO-4MFk4s\",\n    \"screenshots\": [\n        \"https://lh3.googleusercontent.com/K3IEjo1_LQWSpiD99xAbcfJNXcTG7W7wf3zUkYzQVj5k7OqSkdsoO-SmcZmxvF4CWIo\",\n        \"https://lh3.googleusercontent.com/WeqKYk-_b4GyvkKAhp_AOwoQeP0X3VdiznoVaNE5Qc8Q1lh8uamv-iYWc50_FYsUDg\",\n        \"https://lh3.googleusercontent.com/WCohW4co4ql2e6QwT1KhMos-6z0yH5z7kQMr-GLdC9s1bzMI8W5Yj8hU9BWDKLCguHw\",\n        \"https://lh3.googleusercontent.com/1iRwgEuQSoT4AsSiPhFou-5eCwyLSzfnJ6A5YdW--N_EjDMTTW61bCgc9RaR9ZfcHqQ\",\n        \"https://lh3.googleusercontent.com/hUU4GGw6zTmG_5zyDvdpMeK62tqxUPbrACwsl21hJPNgzOW-WAkvNRkRMv2Hv8pAXw\",\n        \"https://lh3.googleusercontent.com/d9hOdTf9EMqQFb6NxX7vP8Hu41jul7uF_24uXgMJjNE2Vbs4uliwfUM_LDjwj7mSec0\",\n        \"https://lh3.googleusercontent.com/DB42-AV-hedxobwSeruqvBc6knupZjjBqsdPxhT9kgpsCTHtW6xpaKO1jIKB3a8PUg\",\n        \"https://lh3.googleusercontent.com/tmfbe4RhZOFGdQfXCvdQApmJRmjTBCtmabJ3nRE0zuc7FxYo97n4IxAhBYx2s13k2ZA\",\n        \"https://lh3.googleusercontent.com/-8F-a-NXGkOMoej-FIQXV5LPePWFbyj2Ql7z_xCM4MkszVfKDXYmhYmNOfJNQY0Z_w\",\n        \"https://lh3.googleusercontent.com/RVItTUG-T4r4fU3oJTae9-40VgkCCsbaBtjSDu50VzIxN4rGEkPK08FEEiLTcvBaE8yx\",\n        \"https://lh3.googleusercontent.com/mbxUU-1nEpv5HnF5OKzlFAePPQBLZtpyUEU_XqyuFmwleBit6Gsn_YEyXiPUenEwSxa6\",\n        \"https://lh3.googleusercontent.com/09qBoXVvzGazKqyJ1SPoAcbMDaYXEQLJwHwnFD__BS1-FJ8jS0pzdXN3-pEoEYTfgQ\",\n        \"https://lh3.googleusercontent.com/l1FdglZMSppao9cjUw8P5QJdF-Sb6UfAHIxGN4iJk6Mtzz7RKME5boHiEN5b3BIX7A\",\n        \"https://lh3.googleusercontent.com/bhpXUBwqKhyDSoPIdm-CLhMxsM3FWgjjnA4DzDheUea-8UvukHRZxLzbJCr7tlbIhA\"\n    ],\n    \"video\": None,\n    \"videoImage\": None,\n    \"contentRating\": \"Everyone\",\n    \"contentRatingDescription\": \"Mild Fantasy Violence\",\n    \"adSupported\": False,\n    \"released\": \"Jul 6, 2016\",\n    \"updated\": 1563814423,\n    \"version\": \"0.149.0\",\n    \"recentChanges\": \"Trainers—we need your help! Team GO Rocket is invading the world of Pokémon GO!\\r\\n\\r\\nHere’s what can you expect in this release.\\r\\n\\r\\n- New Challenges: Take on Team GO Rocket Grunts in battle!\\r\\n- Shadow Pokémon: Catch the mysterious Shadow Pokémon Team GO Rocket Grunts leave behind! Is there a way to help these Pokémon?\\r\\n- New Appraisal Tool: You can now learn even more about your Pokémon when appraising them.\\r\\n- Battle Minigames: Charged Attack gameplay includes new minigames.\",\n    \"recentChangesHTML\": \"Trainers—we need your help! Team GO Rocket is invading the world of Pokémon GO!&lt;br&gt;&lt;br&gt;Here’s what can you expect in this release.&lt;br&gt;&lt;br&gt;- New Challenges: Take on Team GO Rocket Grunts in battle!&lt;br&gt;- Shadow Pokémon: Catch the mysterious Shadow Pokémon Team GO Rocket Grunts leave behind! Is there a way to help these Pokémon?&lt;br&gt;- New Appraisal Tool: You can now learn even more about your Pokémon when appraising them.&lt;br&gt;- Battle Minigames: Charged Attack gameplay includes new minigames.\",\n    \"comments\": [\n        \"*revised. This game is horrible after this last update. I do not like the appraisal filter. There are more bugs then ever. '' *This game is getting worse and worse. I am unable to update my app. There is never a new update for me. Everyone around me has had 2- 3 updates but I have not. I've gone to their customer service for help, nothing. Their customer service is awful. Automated useless replies. Now my game is freezing. I'm dropping in raids, losing raid bosses.\",\n        \"I love the game but I'm having issues with the friends list. Error keeps saying, \\\"Failed to get friends list. Try again later.\\\" I've already uninstalled and installed the game four times. The error keeps popping up. I also can't walk my eggs. They are all in incubators and I've walked for an hour straight and it still reads 0/2.0, 0/5.0, and 0/10.0... very frustrating!\",\n        \"This game is an amazing game except for one mechanic, the 50 pokecoin per day limit. This limits you from receiving more than 50 pokecoins (The in-game secondary currency that costs real money) per day from gyms. This is a cheap tactic to manipulate you to purchase more pokecoins, I get that they have developers and animators and artists. I understand they need to pay people and make a profit on top of that, but I strongly believe the previous limit of 100 was much more reasonable.\",\n        \"For the past week, it takes about 5 minutes for the game to load up &amp; open. Half the time it doesn't load at all for me then when I do finally get on, it freezes up constantly or closes the app all together...often when I'm in the middle of trying to catch something. There was one day where I couldn't get the game to open at all &amp; lost my streaks! I've tried restarting my phone, uninstalling then reinstalling...nothing has helped the issues. Not too happy with this game right now 👎\",\n        \"The latest update has made it near impossible to catch the pokemon with excellent throws. I can barely make out the little circle anymore. It's like the game was catered for large screen devices like tablets. I use a S7 edge and the catch screen is a nightmare. please revert! The game is still as glitchy as ever and nothing positive has come out of it. I can live without the quick catch for android, but the extreme downsize to the catch sequence leaves a lot to be desired. Wish i can go on\",\n        \"I've been playing pokemon go for about a year now, and I gotta say, with the new update that just happened, I can not stand the new appraisal system. it just says when and where the pokemon was caught and gives you a little picture with a 3 star rating on its attack, defense, and hp. it basically rendered the add on PokeGenie useless. and even if you dont use apps like pokegenie and Calcy IV, it still doesn't tell if the pokemon will be good in battle or not\",\n        \"Great game! My only issue with pokemon go is the step count. I have attempted several times to fix this through settings and such. I have a galaxy s10 so performance isn't an issue. I've been trying to hatch a 2 meter egg for two weeks now. not sure what's up but I'd really appreciate it if my issue was fixed.\",\n        \"love the game, but I have 1 point of criticism if you want to even suggest an edit, you need to find someone who played Scanner [REDACTED] before new signups were redirected to Ingress Prime. I asked around for weeks on ingress and nobody responded, because noone plays it here.. There are stops incorrectly placed in my area and no way to even suggest a change. give players over level 30 the ability to suggest edits, and level 40 the ability to suggest new landmarks/curiousities as stops. PLEASE!\",\n        \"I don't know what happen with this game. I can't view my friends list even though I don't have any friends yet and I try to add friends in my friends list. I'm not even can view my step progress. I put on pokemon as my buddy still not counting any steps. Can you tell me what should I do.?\",\n        \"adventuer sync keeps getting turned off. any time there is an update or the game forces me to relog in. i do a lot of walking to find out half the time it doesnt count becaused they keep changing my settings. it gets aggrevating that every time i go to play have to check the settings to make sure they are how i left them. itis extremly annoying.\",\n        \"While I love the game, there are some things I wish was better. Like having a power meter to help you gage how far you will throw the pokeballs, or a way to grow and farm the berries. The bag limits are particularly frustrating for me, as I can go from \\\"You can't use this pokestop, your bag is full!\\\" to \\\"I can\\\"t catch any more pokemon I ran out of balls!\\\" In a matter of five minuets or less.\",\n        \"As someone who grew up with Pokemon, I really love this game, it'sso addictingand fun! and I love that I can play with others. Every update is more and more exciting! but I can't give it 5 stars, because 99% of my map vanished. I still have the pokestops and gyms which is a major relief lol, but except for a very small portion near my original log in point everything is just green.I've tried everything I can think of to fix it and I've never downloaded cheats, so I'm at a loss.\",\n        \"I absolutely love this game, but I think it can be better. Please make it so you can withdraw your pokemon from gyms manually, there are rarely any people that come to the gyms in my area and my pokemon are basically imprisoned in the gyms. I just want to be able to take out my pokemon from the gym, not even for the coins, just so I can switch pokemon or power up that one, is that to much to ask? Other than that, I really enjoy the game and I'll keep playing it. But please, free my pokemon.\",\n        \"After the recent update, the game is forcing me to play in AR mode. Even if I have it turned off. it will just show the pokemon in a white area. i tried reinstalling the app, it persists. AR is quite annoying and at this point its unplayable for me\",\n        \"Ok well Pokemon Go has Aided in my physical recovery from spinal surgery, my kids got me into the game,as a means to getting me out of the house and making me walk as my therapy,and it worked. I just made level 33, I'm having fun,and getting Exercise. I've done a couple of community days, and it's really neat to go out and see people of all ages out there playing and being together and having Fun,so keep it up there's a lot of Pokemon for me to still catch, and I look forward to doing it. Go 💛!\",\n        \"Love the game with all its little unexplained mysteries. It will make you spend, however. There's a suggestion I'd like to make. Could you make it possible to send friend requests through name instead of through trainer code? I've been playing this game for a week now, and although I've seen plenty of action and teamwork at Gyms and raids, I've got no friends yet. If friend requests are easier to send, you can add a block feature too, and I'm sure the game will be much more fun. Cheers!\",\n        \"I love this game, and yet I can't enjoy it right now. I am getting an error message 'friends list is unavailable' and 'field metrics are currently unavailable'. This means I cannot track my steps, hatch eggs, add friends and many other things. My girlfriend is not having issues and I am sad that I can't join in with her and have as much fun. This only started yesterday, else would have 5 stars as I really enjoy this game.\",\n        \"I love the game, but adventure sync no longer works after the last upgrade. All other game play is ok. I log a lot of km's a week and used to hatch eggs all the time and get km rewards. Now taking weeks of time with game on just to earn my distance. Otherwise would be a 5 star game.\",\n        \"As someone who never really got into Pokemon, this game is actually quit amazing. Got into it when it first came out as a way to get out and walk while staying entertained. Three years later the game has underwent many changes that have kept it fun and engaging. Really brings people tohther. If youre not already pary of the online sensation..download it.. Youll have a blast-oise!\",\n        \"This app is really cool! But if you are looking for problems then I got a few. First, is that you CAN NOT put LEGENDARY Pokemon in a gym. Second, when your Pokemon comes back from a gym and you get mony the max limet for each day is 50, which is not even enough money to buy something in the PokeStore! Third, in the clothes store the money to buy things is too expensive it costs 500 money and yes some items are FREE but seriously. Make sure to read the other comments to find more! Please fix.\",\n        \"This is a very nice game with nice graphics and system, however to me the only concern is about spoofing. I understand the point of blocking spoofing but it is sometimes unachievable for some people like me to walk all over the place to catch pokemon. I really hope that Niantic itself could support with joystick feature in a limited area for us to walk around. For example, we are able to use joystick feature to walk 3~5km around our location. That will be great!!!\",\n        \"What is going on with the GPS? It keeps asking me if driving when I'm walking. I'm a fast walker but not that fast. Also it seems to have a lot of trouble pinpointing my location. It'll have me in one spot then zoom me to another and then back again. It's also super hard to throw the balls. I'll hit the Pokemon with the ball but somehow still seem to miss. And what is up with not being able to catch a 300 cp Pokemon with a ultra ball? Really? Fix these issues and I'll give it 5 stars.\",\n        \"I like the game, but for what ever reason the game decided to not load all the way so i signed out and now i can no longer sign back in, and the game won't let me make a new account either. I have forced stop the game, cleared catch, and I even uninstalled and reinstalled the game nothing has fixed my problem. So I literally can't play the game anymore.\",\n        \"A lot better than before. not buggy like it used to be and more things to do in the game. Principal weak point of that game is there is never an event for parents after 7:30. Me or my wife love to take a walk after putting the kid to bed. When we do it, nothing happens in the game. Events and raids finish early. I think young parents would like an event once a month or 2. Forget raid hours early in the evening for us. It is not an option.\",\n        \"Disappointed. The concept is fun, and it makes finding adventures with the family easy. The issue comes with the battle style and the pokemon power levels. Battles and raids are 15 sec bursts of tapping as fast as you can, I find it kind of lame. That coupled with power levels that range from 1 to the thousands, I think even tens of thousands, really separates people who want to have fun occasionally from people who make the game their life.\",\n        \"Come on Niantic, I can't load the friends list, can't battle anyone, walking distance isnt being measured whatsoever, apparently i did 0km all of last week. Please sort these problems out, i love this game but ima have to leave it until these game-breaking bugs get fixed. If it helps, these issues are happening on my Huawei Mate 10 Pro\",\n        \"New update doesnt track distance traveled. I have lost out on 20+ km worth of my walking distance because the game simple does not work. I went about a year without playing because many features did not work. Finally returned to the game in May 2019 and the first update after my return and it seems that the same problems still persist, a lot of features/ideas yet none of them work properly.\",\n        \"I found the game of my dreams. As well as the people thatI dreamed of playing with. Its much more enjoyable with people who plays with you. But I do hope that the pokestop nomination update should be released quickly because there are a lot of places where there are only 1 gym and 1 pokestops, especially in the areas that are far from cities. I hope that this review reaches in the hearts of the game devs. Forever in support and in love with pokemons.\",\n        \"Its really fun. One thing that kind of bothers me is that you can't put legendary Pokemon in gyms that you take over. I know they are legendary but it i have noticed most of the time is that legendary pokemon, once caught, that they about as strong as any other Pokemon. it would be hilarious and awesome to see a gym full of legendary pokemon.\",\n        \"I love playing the game. Graphics are amazing, gameplay is amazing. I know it's being worked on, but I can't wait to be able to request new pokestops since I visit places that don't have any for miles. Also, the places with no stops wouldn't produce pokemon either. Being able to trade with long distance friends would be beneficial also for people with social anxiety who can't just walk up to someone and start talking to them. The way this game has grown since it started is unbelievably amazing!\",\n        \"It is such a GREAT game, but since the new update, pokemon in the wild are pretty much are all silhouettes, when you tap on them they are sometimes black squares, when you go into the pokedex half of them are also black squares and when you tap into your profile or into a pokemon that you have caught, the top part of the screen is just black. All that and it also crashed, ALOT!!! It is just unbearable.\",\n        \"I installed the game at first to get closer to my kids and exercise. I grew to love it and play it everyday. easy for all ages! the only thing I wish would be more pokestops and gyms but it's the only game that actually forces you to get up and move AND to make new friends. since starting this game I have made new friends from all over the world. we belong to different groups and we all meet up to raid. as an adult it is hard to make new friends, pokemon Go has given us a new life. come and play!\",\n        \"The screen stays on when eggs are ready to hatch, even when the phone's been upside down the entire time. I haven't had any battery issues with this new phone but I know some people aren't that fortunate. Edit: After playing for another day, I can see why people say the catch circle is too small. To those complaining about the new appraisal system, it's basically the same thing they just did the IV calculation for you. Plus you can swipe to compare pokemon side by side.\",\n        \"Just rejoined after deleting it two years ago and there have been a lot of upgrades! More Poke Stops and gyms, which is nice. However, the two-star rating is for the distance tracker and Adventure Sync. If the main point of this game is motivate people moving, then the trackers shouldn't be as off as they are. We walked at least a mile last night with the Adventure Sync on and full battery use, yet nothing was tracked in the game. Even checked this morning to see no progress added.\",\n        \"One of the best games you can get for free. The game has online currency, but is not pay to win as it is very easy for any free to play person to get currency. The game releases new updates, and pokémon so you are never board. Pokémon Go is fun to play and keeps you active at the same time. You can progress faster in the game by hatching eggs. whitch you aquire for free, and hatch by keeping active. You can play with friends and family to boost your progress all free! Pokémon Go deserves 5 stars\",\n        \"Not enough pokestops in rural areas!!! Not enough poke balls, or pokestops to get any! I live in a city with a mall and everything and still see nothing for miles! Only one poke stop and one gym at the churches, that's it! And I'm sitting in a neighborhood with a school and big park! Wizards unite has games at the park and objects popping up all over, so I've made my switch!\",\n        \"Good game but poke stops should be a little more plentiful with items and we should be able to do more things(battle, trade) with our friends even if they are not in our vicinity. Also statistically we should know more about our Pokemon instead of only relying on the CP and the uplifting words of an appraiser. Also there should be more clear cut meaning of the size of the Pokemon (XL and XS) and what it does to the Pokemon.\",\n        \"I've been playing this game for so long, I can't believe I haven't rated it yet. This is the very same game that blew up in 2016, but it's grown and refined a lot since then. The basic idea is to capture Pokémon while you're out, but you can also battle them in gyms and with other players. They also hold special events regularly for capturing special Pokémon. The game is best played with friends, but it's a fine \\\"fitness\\\" app, too. I give it a \\\"good enough to play for 3+ years\\\" out of 10.\",\n        \"Kinda lame tbh. I downloaded it for a Pokemon experience, which I do get, but time a degree. MAKE SURE you find out which teams typically operate in your area (which is extremely hard unless you know someone who uses the app), because you can end up on a bad team and never be able to experience the full fun of the game.\",\n        \"great game, but I'm really sad because when the game first came out, I had a dragonite and other good pokemon, and when I updated the game, they were ALL deleted. I was super sad to find all my good pokemon missing. plz fix that so it doesn't happen to others :(. it's still a great game though and I would reccomend getting it.\"\n    ]\n}\n</code></pre>\n<h3>App Reviews</h3>\n<p><code>reviews</code> function returns <code>result</code> with <code>continuation token</code>.</p>\n<ul>\n<li><code>result</code> : Crawling result of reviews. (list)</li>\n<li><code>continuation_token</code> : Data containing how many items were loaded, what arguments used in the current result. If you pass this value to the <code>continuation_token</code> parameter of the <code>reviews</code> function, the next items are crawled. For example, if 1000 reviews are retrieved and the returned token 'eXamplE' is passed to the reviews function, the list of reviews is retrieved from 1000 or later items.</li>\n</ul>\n<blockquote>\n<p>Setting <code>count</code> too high can cause problems. Because the maximum number of reviews per page supported by Google Play is 200, it is designed to pagination and recrawl by 200 until the number of results reaches count.</p>\n</blockquote>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">google_play_scraper</span> <span class=\"kn\">import</span> <span class=\"n\">Sort</span><span class=\"p\">,</span> <span class=\"n\">reviews</span>\n\n<span class=\"n\">result</span><span class=\"p\">,</span> <span class=\"n\">continuation_token</span> <span class=\"o\">=</span> <span class=\"n\">reviews</span><span class=\"p\">(</span>\n    <span class=\"s1\">'com.fantome.penguinisle'</span><span class=\"p\">,</span>\n    <span class=\"n\">lang</span><span class=\"o\">=</span><span class=\"s1\">'en'</span><span class=\"p\">,</span> <span class=\"c1\"># defaults to 'en'</span>\n    <span class=\"n\">country</span><span class=\"o\">=</span><span class=\"s1\">'us'</span><span class=\"p\">,</span> <span class=\"c1\"># defaults to 'us'</span>\n    <span class=\"n\">sort</span><span class=\"o\">=</span><span class=\"n\">Sort</span><span class=\"o\">.</span><span class=\"n\">MOST_RELEVANT</span><span class=\"p\">,</span> <span class=\"c1\"># defaults to Sort.MOST_RELEVANT</span>\n    <span class=\"n\">count</span><span class=\"o\">=</span><span class=\"mi\">3</span><span class=\"p\">,</span> <span class=\"c1\"># defaults to 100</span>\n    <span class=\"n\">filter_score_with</span><span class=\"o\">=</span><span class=\"mi\">5</span> <span class=\"c1\"># defaults to None(means all score)</span>\n<span class=\"p\">)</span>\n\n<span class=\"c1\"># If you pass `continuation_token` as an argument to the reviews function at this point,</span>\n<span class=\"c1\"># it will crawl the items after 3 review items.</span>\n\n<span class=\"n\">result</span><span class=\"p\">,</span> <span class=\"n\">_</span> <span class=\"o\">=</span> <span class=\"n\">reviews</span><span class=\"p\">(</span>\n    <span class=\"s1\">'com.fantome.penguinisle'</span><span class=\"p\">,</span>\n    <span class=\"n\">continuation_token</span><span class=\"o\">=</span><span class=\"n\">continuation_token</span> <span class=\"c1\"># defaults to None(load from the beginning)</span>\n<span class=\"p\">)</span>\n</pre>\n<p>Result of <code>print(result)</code>:</p>\n<pre><code>[\n    {\n        \"userName\": \"Alyssa Williams\",\n        \"userImage\": \"https://lh3.googleusercontent.com/-cVEHKr7mzv8/AAAAAAAAAAI/AAAAAAAAAAA/AKF05nB2r3GUkji31m0tC4ylFNiVMpmNWA/photo.jpg\",\n        \"content\": \"This is literally the best idle game I have ever played. The penguins waddle around and live their best lives in the cutest little outfits. I just unlocked the little penguins and I have been sobbing uncontrollably for ten minutes because they are so adorable. There are only two suggestions I have for this game: more of the penguin info ads. I love them. I have learned so much about all the teeny fellas. Secondly, I would like to be able to name my 'guins so I can tell them apart.\",\n        \"score\": 5,\n        \"thumbsUpCount\": 54,\n        \"reviewCreatedVersion\": \"1.16\",\n        \"at\": datetime.datetime(2020, 2, 24, 17, 19, 34),\n        \"replyContent\": \"Hello, We will gradually improve the various systems in the game to enhance the player's game experience. We have recorded your suggestions and feedback to the planner. If you have any other suggestions and ideas, please feel free to contact us at penguinisle@habby.com.Thank you for playing!\",\n        \"repliedAt\": datetime.datetime(2020, 2, 24, 18, 30, 42),\n    },\n    {\n        \"userName\": \"EasyJet 123\",\n        \"userImage\": \"https://lh3.googleusercontent.com/a-/AOh14GhE3-Fsq5KDs_kmCRGcifbNUQTOtK5DpZkJ2AiqyQ\",\n        \"content\": \"Easily my favorite game. Relaxing, with easy controls, no purchase necessary to advance... I love it. 100% recommend. I love how you can get gems continually by completing missions, and the low price of boosts are great. But how about adding new buildings like an airport, an army base, and a train station? Would be great to see these. And the building purchase price might be lowered so it's a bit easier to progress after the Igloo. Maybe...\",\n        \"score\": 5,\n        \"thumbsUpCount\": 79,\n        \"reviewCreatedVersion\": \"1.14\",\n        \"at\": datetime.datetime(2020, 2, 12, 8, 42, 41),\n        \"replyContent\": None,\n        \"repliedAt\": None,\n    },\n    {\n        \"userName\": \"Lillemann\",\n        \"userImage\": \"https://lh3.googleusercontent.com/a-/AOh14GjiVSIrx033k9HZ9Tu4BQ1iYZST0IRW8UlDCX3gdw\",\n        \"content\": \"Really good looking. And it runs super super smooth. I love the camera options when clicking the camera button. And the penguins looks absolutely awesome and I really love the limited eddition ones. That sometimes the ads are replaced with penguin facts is just awesome. I suggest that you set up some kind of leaderboard it could probobly show the players that are earning the most money per sec or something. But overall this game is a strong 10/10\",\n        \"score\": 5,\n        \"thumbsUpCount\": 2,\n        \"reviewCreatedVersion\": \"1.14\",\n        \"at\": datetime.datetime(2020, 2, 11, 18, 8, 11),\n        \"replyContent\": \"Thank you very much for your review concerning our game. We will try our best to do better,If you have any other feedback or suggestions, feel free to contact us at penguinisle@habby.com. Have a nice day!\",\n        \"repliedAt\": datetime.datetime(2020, 2, 11, 18, 53, 38),\n    },\n]\n</code></pre>\n<h2>Changes</h2>\n<p>Change logs are here : <a href=\"./CHANGES.md\" rel=\"nofollow\">CHANGES.md</a></p>\n<h2>Contributing</h2>\n<p>Contributing guides can be found in <a href=\"./CONTRIBUTING.md\" rel=\"nofollow\">CONTRIBUTING.md</a>.</p>\n\n          </div>"}, "last_serial": 7190528, "releases": {"0.0.1": [{"comment_text": "", "digests": {"md5": "1dd25a03aef69e4ef817f552900e0553", "sha256": "0c58e91dc3ba602d57589f49ec57ad51bcb9d2e46e5277d9458207614873788b"}, "downloads": -1, "filename": "google-play-scraper-0.0.1.tar.gz", "has_sig": false, "md5_digest": "1dd25a03aef69e4ef817f552900e0553", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3279, "upload_time": "2019-07-17T16:43:24", "upload_time_iso_8601": "2019-07-17T16:43:24.416733Z", "url": "https://files.pythonhosted.org/packages/b6/f4/c9af38b1e3de0a8c0547833dd1e5a0e340248ae3c5d6887bb832a0966dfc/google-play-scraper-0.0.1.tar.gz", "yanked": false}], "0.0.1.1": [{"comment_text": "", "digests": {"md5": "60abdafe5ba2e46697288d8a5a5b4b92", "sha256": "f8f7f8f59c33bd9cefe0dc1fa7376633718fcc29fe521b60f1af78c4183495fb"}, "downloads": -1, "filename": "google-play-scraper-0.0.1.1.tar.gz", "has_sig": false, "md5_digest": "60abdafe5ba2e46697288d8a5a5b4b92", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26496, "upload_time": "2019-07-23T14:58:51", "upload_time_iso_8601": "2019-07-23T14:58:51.185225Z", "url": "https://files.pythonhosted.org/packages/3b/44/c5aa28b23ddb81177fec531a543a9dc9ed4066aa74c400dc2cc677d6a0eb/google-play-scraper-0.0.1.1.tar.gz", "yanked": false}], "0.0.1.2": [{"comment_text": "", "digests": {"md5": "457572412ecf9c0e99c6a2596bdfa957", "sha256": "69767ccbb9429ef09da24e024b6258c1e4727112f9dbe67d7d3035f19d1424c9"}, "downloads": -1, "filename": "google-play-scraper-0.0.1.2.tar.gz", "has_sig": false, "md5_digest": "457572412ecf9c0e99c6a2596bdfa957", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26835, "upload_time": "2019-12-04T16:50:30", "upload_time_iso_8601": "2019-12-04T16:50:30.438472Z", "url": "https://files.pythonhosted.org/packages/ec/c9/9942e91a20d6484c7895b60e1b443e08197febd1f014de312aefb8d17093/google-play-scraper-0.0.1.2.tar.gz", "yanked": false}], "0.0.1.3": [{"comment_text": "", "digests": {"md5": "efc1562a961b2f8006d2491ca0f8adcf", "sha256": "e630c8310746152a8abad2c9a443c1edf974da98dbada7194cfb06dfd0a04259"}, "downloads": -1, "filename": "google-play-scraper-0.0.1.3.tar.gz", "has_sig": false, "md5_digest": "efc1562a961b2f8006d2491ca0f8adcf", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26827, "upload_time": "2019-12-04T17:11:29", "upload_time_iso_8601": "2019-12-04T17:11:29.858243Z", "url": "https://files.pythonhosted.org/packages/a8/5e/de52db9c2d330dc425f72dd11460675293990a33703760415361e4318d2e/google-play-scraper-0.0.1.3.tar.gz", "yanked": false}], "0.0.1.4": [{"comment_text": "", "digests": {"md5": "60b4edeed22c57bda8fa32bff65afbc1", "sha256": "1bafe365cbbccf002294311b15f3d14cc4d57d7099a61e2847b7ab56f8a96cfb"}, "downloads": -1, "filename": "google-play-scraper-0.0.1.4.tar.gz", "has_sig": false, "md5_digest": "60b4edeed22c57bda8fa32bff65afbc1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30825, "upload_time": "2019-12-10T08:11:32", "upload_time_iso_8601": "2019-12-10T08:11:32.206789Z", "url": "https://files.pythonhosted.org/packages/94/82/f417582756791bfa27dd1cdd342b74dcfa8566bf5e8feb18782c4629bf45/google-play-scraper-0.0.1.4.tar.gz", "yanked": false}], "0.0.1.5": [{"comment_text": "", "digests": {"md5": "77b4605aa0a97112821385691374fcd9", "sha256": "1775b78d57f4383fe5dbf51d5c7f4a462b47095584f3b0b8f4f69a73b980d2ec"}, "downloads": -1, "filename": "google-play-scraper-0.0.1.5.tar.gz", "has_sig": false, "md5_digest": "77b4605aa0a97112821385691374fcd9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 26791, "upload_time": "2019-12-10T08:53:57", "upload_time_iso_8601": "2019-12-10T08:53:57.424352Z", "url": "https://files.pythonhosted.org/packages/6c/5c/ea5bb37a4b93ba159d00a3907ed598046db4fab0f5f1c42ce5f5265e6771/google-play-scraper-0.0.1.5.tar.gz", "yanked": false}], "0.0.1.6": [{"comment_text": "", "digests": {"md5": "0029bfa1eeaadafedf06a190d03dabc3", "sha256": "b1ee13c42af0489343e81feb6e7342d1262981f7b0879c27d11096883d4c7354"}, "downloads": -1, "filename": "google-play-scraper-0.0.1.6.tar.gz", "has_sig": false, "md5_digest": "0029bfa1eeaadafedf06a190d03dabc3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 28183, "upload_time": "2019-12-16T01:27:13", "upload_time_iso_8601": "2019-12-16T01:27:13.494340Z", "url": "https://files.pythonhosted.org/packages/2b/1c/db583a3808da77201ddc4d00ef7650170b2985e91a9812edebc33a93bffd/google-play-scraper-0.0.1.6.tar.gz", "yanked": false}], "0.0.1.7": [{"comment_text": "", "digests": {"md5": "c035ed99534ee9fe504eb2176d106ff9", "sha256": "fcf71e6a184aa15f8f8f609777e00a1406ef64a49bee1702b8e76701329d7357"}, "downloads": -1, "filename": "google-play-scraper-0.0.1.7.tar.gz", "has_sig": false, "md5_digest": "c035ed99534ee9fe504eb2176d106ff9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 28524, "upload_time": "2020-02-10T02:37:47", "upload_time_iso_8601": "2020-02-10T02:37:47.379925Z", "url": "https://files.pythonhosted.org/packages/3a/21/afb571bfa2a60c0d9fdc5a791a449e3941b95bba55bce69cfbd1c20e34e3/google-play-scraper-0.0.1.7.tar.gz", "yanked": false}], "0.0.1.8": [{"comment_text": "", "digests": {"md5": "04690bda20086a45b938eff6f1662891", "sha256": "349466aab5330bb6fbd358aeeb5445f02afbbe60cedf7a5af7bf7d0cc9b41d51"}, "downloads": -1, "filename": "google-play-scraper-0.0.1.8.tar.gz", "has_sig": false, "md5_digest": "04690bda20086a45b938eff6f1662891", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 28605, "upload_time": "2020-02-10T02:51:41", "upload_time_iso_8601": "2020-02-10T02:51:41.904025Z", "url": "https://files.pythonhosted.org/packages/45/b9/bf88030b9f3a6794f1e8066eeb15c3f0db2c69ae62a55eec04ac8f1965e2/google-play-scraper-0.0.1.8.tar.gz", "yanked": false}], "0.0.2.0": [{"comment_text": "", "digests": {"md5": "dc2daffe996eb5e2091671548c336eaf", "sha256": "41b412c3f7fbf083e68ab893eb899cdbca2b49f67d99d28e078ca41c133d2a05"}, "downloads": -1, "filename": "google-play-scraper-0.0.2.0.tar.gz", "has_sig": false, "md5_digest": "dc2daffe996eb5e2091671548c336eaf", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 41895, "upload_time": "2020-02-10T18:29:57", "upload_time_iso_8601": "2020-02-10T18:29:57.508441Z", "url": "https://files.pythonhosted.org/packages/f0/c9/909a39e097dd0bb77d8641b617fd303bc571577963925b4d35106a9486c5/google-play-scraper-0.0.2.0.tar.gz", "yanked": false}], "0.0.2.1": [{"comment_text": "", "digests": {"md5": "39beab282fe174b40b41c9502dc9e796", "sha256": "f3a5e08c918038c06b83593611634ac47f434fb98f487e580fde41cb8ca1e644"}, "downloads": -1, "filename": "google-play-scraper-0.0.2.1.tar.gz", "has_sig": false, "md5_digest": "39beab282fe174b40b41c9502dc9e796", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42390, "upload_time": "2020-02-26T12:05:24", "upload_time_iso_8601": "2020-02-26T12:05:24.514121Z", "url": "https://files.pythonhosted.org/packages/38/65/7e7db7efe4197d2817197a04292874217ed692232319bf8d0eba6cb790fd/google-play-scraper-0.0.2.1.tar.gz", "yanked": false}], "0.0.2.2": [{"comment_text": "", "digests": {"md5": "de3b4836666f17624bb21abb5a429051", "sha256": "8728be614532cea6b28b580a213c0a7c2320ce63616292cc63f8f7269bbcb6c2"}, "downloads": -1, "filename": "google-play-scraper-0.0.2.2.tar.gz", "has_sig": false, "md5_digest": "de3b4836666f17624bb21abb5a429051", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42763, "upload_time": "2020-02-28T16:39:27", "upload_time_iso_8601": "2020-02-28T16:39:27.369087Z", "url": "https://files.pythonhosted.org/packages/cb/89/bc7279683a9224dc4239dc642a6cf2ce8a103d7f27a2ab69a8311d391777/google-play-scraper-0.0.2.2.tar.gz", "yanked": false}], "0.0.2.3": [{"comment_text": "", "digests": {"md5": "3a699a304961c72acf38ca8f08633396", "sha256": "ac31d72805e4416c64b3485542bff8d51ea3c50b7c278bf01b821783f7582522"}, "downloads": -1, "filename": "google-play-scraper-0.0.2.3.tar.gz", "has_sig": false, "md5_digest": "3a699a304961c72acf38ca8f08633396", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 46356, "upload_time": "2020-04-11T11:51:54", "upload_time_iso_8601": "2020-04-11T11:51:54.041826Z", "url": "https://files.pythonhosted.org/packages/11/7c/bd39372036a04a6cbf921523d671104629136964189d9a5e775c8495fc76/google-play-scraper-0.0.2.3.tar.gz", "yanked": false}], "0.0.2.4": [{"comment_text": "", "digests": {"md5": "83b7418167fc31346b717cfaf11a0473", "sha256": "51f38e8023a9637c077f8ddfd58b5505de5e6c2ece650103f38d40084b3646d8"}, "downloads": -1, "filename": "google-play-scraper-0.0.2.4.tar.gz", "has_sig": false, "md5_digest": "83b7418167fc31346b717cfaf11a0473", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 47092, "upload_time": "2020-04-30T20:09:05", "upload_time_iso_8601": "2020-04-30T20:09:05.741143Z", "url": "https://files.pythonhosted.org/packages/c8/40/92d6ce72538a26fdec7968dab42f60dab359d1f28d8589bb189968f984a4/google-play-scraper-0.0.2.4.tar.gz", "yanked": false}], "0.0.2.5": [{"comment_text": "", "digests": {"md5": "360269d478c2233c827d63fc1ca2b3bc", "sha256": "4cf9d7f3aeb39d2d3fcdb5fa970457844200b0abf5ac69a618f319ec9b19eb92"}, "downloads": -1, "filename": "google-play-scraper-0.0.2.5.tar.gz", "has_sig": false, "md5_digest": "360269d478c2233c827d63fc1ca2b3bc", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 47137, "upload_time": "2020-05-07T17:51:16", "upload_time_iso_8601": "2020-05-07T17:51:16.199724Z", "url": "https://files.pythonhosted.org/packages/54/2b/944e4fb533b939dcc787acb338f34b6a512b117dee5f8a2aef4da45d4625/google-play-scraper-0.0.2.5.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "360269d478c2233c827d63fc1ca2b3bc", "sha256": "4cf9d7f3aeb39d2d3fcdb5fa970457844200b0abf5ac69a618f319ec9b19eb92"}, "downloads": -1, "filename": "google-play-scraper-0.0.2.5.tar.gz", "has_sig": false, "md5_digest": "360269d478c2233c827d63fc1ca2b3bc", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 47137, "upload_time": "2020-05-07T17:51:16", "upload_time_iso_8601": "2020-05-07T17:51:16.199724Z", "url": "https://files.pythonhosted.org/packages/54/2b/944e4fb533b939dcc787acb338f34b6a512b117dee5f8a2aef4da45d4625/google-play-scraper-0.0.2.5.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:55:34 2020"}