{"info": {"author": "Grakn Labs", "author_email": "community@grakn.ai", "bugtrack_url": null, "classifiers": ["Intended Audience :: Developers", "Intended Audience :: Science/Research", "License :: OSI Approved :: Apache Software License", "Operating System :: OS Independent", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.6", "Topic :: Scientific/Engineering", "Topic :: Scientific/Engineering :: Artificial Intelligence", "Topic :: Scientific/Engineering :: Information Analysis", "Topic :: Software Development :: Libraries", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "# Grakn KGLIB (Knowledge Graph Library)\n\n[![CircleCI](https://circleci.com/gh/graknlabs/kglib/tree/master.svg?style=shield)](https://circleci.com/gh/graknlabs/kglib/tree/master)\n[![Slack Status](http://grakn-slackin.herokuapp.com/badge.svg)](https://grakn.ai/slack)\n[![Discussion Forum](https://img.shields.io/discourse/https/discuss.grakn.ai/topics.svg)](https://discuss.grakn.ai)\n[![Stack Overflow](https://img.shields.io/badge/stackoverflow-grakn-796de3.svg)](https://stackoverflow.com/questions/tagged/grakn)\n[![Stack Overflow](https://img.shields.io/badge/stackoverflow-graql-3dce8c.svg)](https://stackoverflow.com/questions/tagged/graql)\n\n[Grakn](https://github.com/graknlabs/grakn) lets us create Knowledge Graphs from our data. But what challenges do we encounter where querying alone won't cut it? What library can address these challenges?\n\nTo respond to these scenarios, KGLIB is the centre of all research projects conducted at Grakn Labs. In particular, its focus is on the integration of machine learning with the Grakn Knowledge Graph. More on this below, in [*Knowledge Graph Tasks*](https://github.com/graknlabs/kglib#knowledge-graph-tasks).\n\nAt present this repo contains one project: [*Knowledge Graph Convolutional Networks* (KGCNs)](https://github.com/graknlabs/kglib/tree/master/kglib/kgcn). Go there for more info on getting started with a working example.\n\n## Quickstart\n**Requirements**\n\n- Python >= 3.6\n\n- Install via pip: `pip install grakn-kglib`\n\n- The [latest release of Grakn Core](https://github.com/graknlabs/grakn/releases/latest) or [Grakn KGMS](https://dev.grakn.ai/docs/cloud-deployment/kgms) running\n\n**Run**\nTake a look at [*Knowledge Graph Convolutional Networks* (KGCNs)](https://github.com/graknlabs/kglib/tree/master/kglib/kgcn) to see a walkthrough of how to use the library.\n\n**Building from source**\n\nClone KGLIB:\n\n```\ngit clone git@github.com:graknlabs/kglib.git\n```\n\n`cd` in to the project:\n\n```\ncd kglib\n```\n\nTo build all targets can be built:\n\n```\nbazel build //...\n```\n\nTo run all tests (requires Python 3.6+): \n\n```\nbazel test //kglib/... --test_output=streamed --spawn_strategy=standalone --python_version PY3 --python_path $(which python3)\n```\n\nTo build the pip distribution (find the output in `bazel-bin`):\n\n```\nbazel build //:assemble-pip\n```\n\n## Knowledge Graph Tasks\n\nBelow is a set of tasks to be conducted over Knowledge Graphs (KGs) that we have identified from real Grakn use cases. The objective of KGLIB is to implement a portfolio of solutions for these tasks for Grakn Knowledge Graphs.\n\n- Relation Prediction (a.k.a. Link Prediction)\n- Attribute Prediction\n- Subgraph Prediction\n- Building Concept Embeddings\n- Rule Mining (a.k.a. Association Rule Learning)\n- Ontology Merging\n- Automated Knowledge Graph Creation\n- Expert Systems\n- Optimal Pattern Finding\n- System Design Automation and Configuration Automation\n- Fuzzy Pattern Matching\n- Querying and Responding via Natural Language\n\n*Many of these tasks are open research problems, thus far \"unsolved\" for the general case.*\n\nWe describe these tasks in more detail below. Where a solution is readily available in KGLIB, it is listed against the relevant task(s).\n\nWe openly invite collaboration to solve these problems! All contributions are welcome - code, issues, ideas, discussions, pointers to existing tools, and relevant datasets will all help this project evolve!\n\nIf you wish to discuss your ideas more conversationally, and to follow the development conversation, please join the [Grakn Slack](https://grakn.ai/slack), and join the #kglib channel. Alternatively, start a new topic on the [Grakn Discussion Forum](https://discuss.grakn.ai).\n\nAll of the solutions in KGLIB require that you have migrated your data into a [Grakn Core](https://github.com/graknlabs/grakn) or [Grakn KGMS](https://grakn.ai/grakn-kgms) instance. There is an [official examples repo](https://github.com/graknlabs/examples) for how to go about this, and information available on [migration in the Grakn docs](https://dev.grakn.ai/docs/examples/phone-calls-migration-python).\n\nWe identify the following categories of tasks that need to be performed over KGs: Knowledge Graph Completion, Decision-Making, and Soft Searching.\n\n### Knowledge Graph Completion\n\nHere we term any task which creates new facts for the KG as *Knowledge Graph Completion*.\n\n#### Relation Prediction (a.k.a. Link prediction)\n\nWe often want to find new connections in our Knowledge Graphs. Often, we need to understand how two concepts are connected. This is the case of **binary** Relation prediction, which all existing literature concerns itself with. Grakn is a [Hypergraph](https://en.wikipedia.org/wiki/Hypergraph), where Relations are [Hyperedges](https://en.wikipedia.org/wiki/Glossary_of_graph_theory_terms#hyperedge). Therefore, in general, the Relations we may want to predict may be **ternary** (3-way) or even **[N-ary](https://en.wikipedia.org/wiki/N-ary_group)** (N-way), which goes beyond the research we have seen in this domain.\n\nWhen predicting Relations, there are several scenarios we may have. When predicting binary Relations between the members of one set and the members of another set, we may need to  predict them as:\n\n- One-to-one\n\n- One-to-many\n\n- Many-to-many\n\n*Examples:* The problem of predicting which disease(s) a patient has is a one-to-many problem. Whereas, predicting which drugs in the KG treat which diseases is a many-to-many problem.\n\nNotice also that recommender systems are one use case of one-to-many binary Relation prediction.\n\nWe anticipate that solutions working well for the one-to-one case will also be applicable (at least to some extent) to the one-to-many case and cascade also to the many-to-many case.\n\n***In KGLIB*** [*Knowledge Graph Convolutional Networks* (KGCNs)](https://github.com/graknlabs/kglib/tree/master/kglib/kgcn) performs Relation prediction using an approach based on [Graph Networks](https://github.com/deepmind/graph_nets) from DeepMind. This can be used to predict **binary**, **ternary**, or **N-ary** relations. This is well-supported for the one-to-one case and the one-to-many case.\n\n#### Attribute Prediction\n\nWe would like to predict one or more Attributes of a Thing, which may include also prediction of whether that Attribute should even be present at all.\n\n***In KGLIB*** [*Knowledge Graph Convolutional Networks* (KGCNs)](https://github.com/graknlabs/kglib/tree/master/kglib/kgcn) can be used to directly learn Attributes for any Thing. This requires some minor additional functionality to be added (we intend to build this imminently).\n\n#### Subgraph Prediction\n\nWe can extend N-ary Relation and Attribute prediction to include Entity prediction, and in fact connected graphs of Entities, Relations, and Attributes as entire subgraphs. It may be possible to determine that such a graph is missing from an existing partially complete Knowledge Graph.\n\n#### Building Concept Embeddings\n\nEmbeddings of Things and/or Types are universally useful for performing other downstream machine learning or data science tasks. Their usefulness comes in storing the context of a Concept in the graph as a numerical vector. \nThese vectors are easy to ingest into other ML pipelines.\nThe benefit of building general-purpose embeddings is therefore to make use of them in multiple other pipelines. This reduces the expense of traversing the Knowledge Graph, since this task can be performed once and the output re-used more than once.\n\n***In KGLIB*** [*Knowledge Graph Convolutional Networks* (KGCNs)](https://github.com/graknlabs/kglib/tree/master/kglib/kgcn) can be used to build general-purpose embeddings. This requires additional functionality, since a generic loss function is required in order to train the model in an unsupervised fashion. At its simplest, this can be achieved by measuring the shortest distance across the KG between two Things. This can be achieved trivially in Grakn using [`compute path`](https://dev.grakn.ai/docs/query/compute-query#compute-the-shortest-path).\n\n#### Rule Mining (a.k.a. Association Rule Learning)\n\nKnown largely as [Association Rule Learning](https://en.wikipedia.org/wiki/Association_rule_learning) in the literature, here we refer to Horn Clause Rule Mining. The objective is to search the Knowledge Graph for new [Grakn Rules](https://dev.grakn.ai/docs/schema/rules) that may be applicable in the form of :\n```graql\nmined-rule sub rule,\nwhen {\n  [antecedent (the conditions)]\n}, then {\n  [consequent (the conclusions)]\n};\n```\n\nWe anticipate that the validity of these rules needs to be checked by hand, since once committed to the graph they are assumed to be correct and will be applied across the KG.\n\nRule mining is a very important field for KG completion. Finding and verifying rules can augment the existing knowledge at scale, since the Rule will be applied wherever the antecedent is found to be true.\n\nWe deem Rule mining a form of [inductive reasoning](https://en.wikipedia.org/wiki/Inductive_reasoning), as opposed to the [deductive reasoning](https://en.wikipedia.org/wiki/Deductive_reasoning) built in to Grakn (the method by which the induced Rules are applied).\n\n#### Ontology Merging\n\nMerging ontologies is a relatively common problem. Most often, users wish to merge their own proprietary Knowledge Graph with a public Knowledge Graph, for example [ConceptNet](http://conceptnet.io), [Gene Ontology (GO)](http://geneontology.org), [Disease Ontology (DO)](http://disease-ontology.org).\n\nGrakn's highly flexible knowledge representation features means that this isn't challenging at all if the two ontologies contain non-overlapping Entities, even if the Entities of the two KGs are interrelated.\n\nThe challenge here is to find a mapping between the structure of the two KGs. If Types or Things (Type instances) overlap between the two KGs, then they need to be merged.\n\nThis decomposes the problem to that of matching between the two KGs. Grakn's schema helps with this task, since we can use this to perform matching between the structures of the two KGs, and thereby find a mapping between them. Matching of data can be framed as either link prediction, or a comparison of graph embeddings.\n\n#### Automated Knowledge Graph Creation\n\nOften, Grakn users want to build a KG (or a subgraph of a KG) from raw data sources. This could be CSVs, SQL databases, bodies of text or information crawled on the web. \n\nData with tabular structure is best migrated to Grakn manually until this field is far more mature. This is a result of the fact that a human reader of structure can infer the meaning of the information, but with only a field name or column name to go on, automated processes will lack the context necessary to perform well. Combining data from many sources in this fashion is a core strength of Grakn, and is not hard to achieve, as per the [Grakn docs](https://dev.grakn.ai/docs/examples/phone-calls-migration-python).\n\nCreating KGs from unstructured information such as text, however, is actually achievable for this task, thanks to the rich context in the data and the wide array of open-source NLP and NLU frameworks available to use. The output of these frameworks can be ingested into a KG with ease, and semi-autonomously used to build a KG of the domain described by the unstructured data. See [this post](https://blog.grakn.ai/text-mined-knowledge-graphs-beyond-text-mining-1ff207a7d850) for more details on how to go about this. For discussions on integrating NLP and NLU with Grakn, check out the #nlp channel on the [Grakn Slack](https://grakn.ai/slack).\n\n### Decision-Making\n\nQuerying a compete knowledge graph may not be enough to inform complex of difficult decisions; we require methods specifically to help us find the right decision to make.\n\n#### Expert Systems\n\nGiven a scenario, Expert Systems automatically make decisions or prompt the best course of action.\n\nFor many applications, Expert Systems can be built entirely with the features provided by Grakn out-of-the-box. They make extensive use of deductive reasoning by utilising Grakn's Rules, where data describing the scenario is added to the KG programmatically with `insert` statements (made via one of the [Grakn Clients](https://dev.grakn.ai/docs/client-api/overview)). `match` queries can then return the right course of action given the scenario.\n\n***In KGLIB*** we need to create examples of Expert Systems, and outline any best practices for building them. This includes recommendations for when symbolic logic alone doesn't provide sufficient answers, and needs to be combined with ML.\n\n#### Optimal Pattern Finding\n\nIn general, this problem is one of finding an optimal path between two Things in a KG. This generally means taking account of a cost of traversing edges and nodes. If the cost of all traversals are equal, then [`compute path`](https://dev.grakn.ai/docs/query/compute-query#compute-the-shortest-path) will already perform this task, which is one of Grakn's built-in distributed algorithms. Here, the subgraph that can be traversed can be constrained with the `in` keyword.\n\nBeyond `compute path`, this problem concerns optimisation and is not necessarily best solved via ML methods; although it may be a candidate for an approach based on Reinforcement Learning.\n\n#### System Design Automation and Configuration Automation\n\nTypically this problem arises in engineering problems, most often in system design, where many systems need to be constructed and done so optimally according to the task they must fulfil and the constraints upon them.\nThis should be wholly or partially solvable with Grakn's automated reasoning. This task is particularly exciting, since solving it brings us closer to automating engineering design processes.\n\n***In KGLIB*** we need to build examples of how to build such methodologies, along with best practice guidance.\n\n### Soft Searching\n\n#### Fuzzy Pattern Matching\n\n[Graql](https://dev.grakn.ai/docs/query/overview) is a highly expressive language that we can use to query Grakn. Included in Graql is the ability to make ambiguous queries. In some cases however, we may want to retrieve a list of the best matches rather than an equally-weighted list of exact matches. This requires a solution that goes beyond Graql.\n\n#### Querying and Responding via Natural Language\n\nThis problem reduces to converting between natural language and [Graql](https://dev.grakn.ai/docs/query/overview). Graql is expressive and closely resembles spoken English. However, there is still a gap between natural language and Graql. Finding a bridge for this gap will allow non-technical users to ask questions of the KG in natural language, and receive answers in natural language. \nThis has wide applications, with particular rising interest in building chatbots for the web. At present, the most favourable solution architecture is to use a readily available NLU component, and translate the intentions that this component identifies into Graql.\n\n### Summary\n\nWe see that the tasks that we want to perform over Knowledge Graphs are varied. Having at our disposal  a toolbox of methods to perform these tasks is a very exciting prospect! This would be enabling across so many industries.\n\nThis is the motivation for KGLIB. We would be delighted if you would help us to progress thiw work. You can help in so many ways:\n\n- Starring the repo to let us know you like it ;)\n- Telling us which tasks are important for you\n- Highlighting tasks we have omitted\n- Getting involved with the code and contributing to the solutions that interest you!\n\nThanks for reading!", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/graknlabs/kglib", "keywords": "machine learning logical reasoning knowledege graph grakn database graph knowledgebase knowledge-engineering", "license": "Apache-2.0", "maintainer": "", "maintainer_email": "", "name": "grakn-kglib", "package_url": "https://pypi.org/project/grakn-kglib/", "platform": "", "project_url": "https://pypi.org/project/grakn-kglib/", "project_urls": {"Homepage": "https://github.com/graknlabs/kglib"}, "release_url": "https://pypi.org/project/grakn-kglib/0.2.1/", "requires_dist": null, "requires_python": "", "summary": "A Machine Learning Library for the Grakn knowledge graph.", "version": "0.2.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Grakn KGLIB (Knowledge Graph Library)</h1>\n<p><a href=\"https://circleci.com/gh/graknlabs/kglib/tree/master\" rel=\"nofollow\"><img alt=\"CircleCI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/0f9d4fd8a729668789fbdc33f312664631edd80c/68747470733a2f2f636972636c6563692e636f6d2f67682f6772616b6e6c6162732f6b676c69622f747265652f6d61737465722e7376673f7374796c653d736869656c64\"></a>\n<a href=\"https://grakn.ai/slack\" rel=\"nofollow\"><img alt=\"Slack Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2d62d5486fa791fae780a4e00c1ad6d196ae8418/687474703a2f2f6772616b6e2d736c61636b696e2e6865726f6b756170702e636f6d2f62616467652e737667\"></a>\n<a href=\"https://discuss.grakn.ai\" rel=\"nofollow\"><img alt=\"Discussion Forum\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/74cd8103c9fc2d4d263c7f1b4f52aad2797cd116/68747470733a2f2f696d672e736869656c64732e696f2f646973636f757273652f68747470732f646973637573732e6772616b6e2e61692f746f706963732e737667\"></a>\n<a href=\"https://stackoverflow.com/questions/tagged/grakn\" rel=\"nofollow\"><img alt=\"Stack Overflow\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/b73ddc0105a5d7881e80e85c2ea0c7143d748d8d/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f737461636b6f766572666c6f772d6772616b6e2d3739366465332e737667\"></a>\n<a href=\"https://stackoverflow.com/questions/tagged/graql\" rel=\"nofollow\"><img alt=\"Stack Overflow\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/be6b8f2d790956645273c8d7301da1c3a78f043b/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f737461636b6f766572666c6f772d677261716c2d3364636538632e737667\"></a></p>\n<p><a href=\"https://github.com/graknlabs/grakn\" rel=\"nofollow\">Grakn</a> lets us create Knowledge Graphs from our data. But what challenges do we encounter where querying alone won't cut it? What library can address these challenges?</p>\n<p>To respond to these scenarios, KGLIB is the centre of all research projects conducted at Grakn Labs. In particular, its focus is on the integration of machine learning with the Grakn Knowledge Graph. More on this below, in <a href=\"https://github.com/graknlabs/kglib#knowledge-graph-tasks\" rel=\"nofollow\"><em>Knowledge Graph Tasks</em></a>.</p>\n<p>At present this repo contains one project: <a href=\"https://github.com/graknlabs/kglib/tree/master/kglib/kgcn\" rel=\"nofollow\"><em>Knowledge Graph Convolutional Networks</em> (KGCNs)</a>. Go there for more info on getting started with a working example.</p>\n<h2>Quickstart</h2>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>\n<p>Python &gt;= 3.6</p>\n</li>\n<li>\n<p>Install via pip: <code>pip install grakn-kglib</code></p>\n</li>\n<li>\n<p>The <a href=\"https://github.com/graknlabs/grakn/releases/latest\" rel=\"nofollow\">latest release of Grakn Core</a> or <a href=\"https://dev.grakn.ai/docs/cloud-deployment/kgms\" rel=\"nofollow\">Grakn KGMS</a> running</p>\n</li>\n</ul>\n<p><strong>Run</strong>\nTake a look at <a href=\"https://github.com/graknlabs/kglib/tree/master/kglib/kgcn\" rel=\"nofollow\"><em>Knowledge Graph Convolutional Networks</em> (KGCNs)</a> to see a walkthrough of how to use the library.</p>\n<p><strong>Building from source</strong></p>\n<p>Clone KGLIB:</p>\n<pre><code>git clone git@github.com:graknlabs/kglib.git\n</code></pre>\n<p><code>cd</code> in to the project:</p>\n<pre><code>cd kglib\n</code></pre>\n<p>To build all targets can be built:</p>\n<pre><code>bazel build //...\n</code></pre>\n<p>To run all tests (requires Python 3.6+):</p>\n<pre><code>bazel test //kglib/... --test_output=streamed --spawn_strategy=standalone --python_version PY3 --python_path $(which python3)\n</code></pre>\n<p>To build the pip distribution (find the output in <code>bazel-bin</code>):</p>\n<pre><code>bazel build //:assemble-pip\n</code></pre>\n<h2>Knowledge Graph Tasks</h2>\n<p>Below is a set of tasks to be conducted over Knowledge Graphs (KGs) that we have identified from real Grakn use cases. The objective of KGLIB is to implement a portfolio of solutions for these tasks for Grakn Knowledge Graphs.</p>\n<ul>\n<li>Relation Prediction (a.k.a. Link Prediction)</li>\n<li>Attribute Prediction</li>\n<li>Subgraph Prediction</li>\n<li>Building Concept Embeddings</li>\n<li>Rule Mining (a.k.a. Association Rule Learning)</li>\n<li>Ontology Merging</li>\n<li>Automated Knowledge Graph Creation</li>\n<li>Expert Systems</li>\n<li>Optimal Pattern Finding</li>\n<li>System Design Automation and Configuration Automation</li>\n<li>Fuzzy Pattern Matching</li>\n<li>Querying and Responding via Natural Language</li>\n</ul>\n<p><em>Many of these tasks are open research problems, thus far \"unsolved\" for the general case.</em></p>\n<p>We describe these tasks in more detail below. Where a solution is readily available in KGLIB, it is listed against the relevant task(s).</p>\n<p>We openly invite collaboration to solve these problems! All contributions are welcome - code, issues, ideas, discussions, pointers to existing tools, and relevant datasets will all help this project evolve!</p>\n<p>If you wish to discuss your ideas more conversationally, and to follow the development conversation, please join the <a href=\"https://grakn.ai/slack\" rel=\"nofollow\">Grakn Slack</a>, and join the #kglib channel. Alternatively, start a new topic on the <a href=\"https://discuss.grakn.ai\" rel=\"nofollow\">Grakn Discussion Forum</a>.</p>\n<p>All of the solutions in KGLIB require that you have migrated your data into a <a href=\"https://github.com/graknlabs/grakn\" rel=\"nofollow\">Grakn Core</a> or <a href=\"https://grakn.ai/grakn-kgms\" rel=\"nofollow\">Grakn KGMS</a> instance. There is an <a href=\"https://github.com/graknlabs/examples\" rel=\"nofollow\">official examples repo</a> for how to go about this, and information available on <a href=\"https://dev.grakn.ai/docs/examples/phone-calls-migration-python\" rel=\"nofollow\">migration in the Grakn docs</a>.</p>\n<p>We identify the following categories of tasks that need to be performed over KGs: Knowledge Graph Completion, Decision-Making, and Soft Searching.</p>\n<h3>Knowledge Graph Completion</h3>\n<p>Here we term any task which creates new facts for the KG as <em>Knowledge Graph Completion</em>.</p>\n<h4>Relation Prediction (a.k.a. Link prediction)</h4>\n<p>We often want to find new connections in our Knowledge Graphs. Often, we need to understand how two concepts are connected. This is the case of <strong>binary</strong> Relation prediction, which all existing literature concerns itself with. Grakn is a <a href=\"https://en.wikipedia.org/wiki/Hypergraph\" rel=\"nofollow\">Hypergraph</a>, where Relations are <a href=\"https://en.wikipedia.org/wiki/Glossary_of_graph_theory_terms#hyperedge\" rel=\"nofollow\">Hyperedges</a>. Therefore, in general, the Relations we may want to predict may be <strong>ternary</strong> (3-way) or even <strong><a href=\"https://en.wikipedia.org/wiki/N-ary_group\" rel=\"nofollow\">N-ary</a></strong> (N-way), which goes beyond the research we have seen in this domain.</p>\n<p>When predicting Relations, there are several scenarios we may have. When predicting binary Relations between the members of one set and the members of another set, we may need to  predict them as:</p>\n<ul>\n<li>\n<p>One-to-one</p>\n</li>\n<li>\n<p>One-to-many</p>\n</li>\n<li>\n<p>Many-to-many</p>\n</li>\n</ul>\n<p><em>Examples:</em> The problem of predicting which disease(s) a patient has is a one-to-many problem. Whereas, predicting which drugs in the KG treat which diseases is a many-to-many problem.</p>\n<p>Notice also that recommender systems are one use case of one-to-many binary Relation prediction.</p>\n<p>We anticipate that solutions working well for the one-to-one case will also be applicable (at least to some extent) to the one-to-many case and cascade also to the many-to-many case.</p>\n<p><em><strong>In KGLIB</strong></em> <a href=\"https://github.com/graknlabs/kglib/tree/master/kglib/kgcn\" rel=\"nofollow\"><em>Knowledge Graph Convolutional Networks</em> (KGCNs)</a> performs Relation prediction using an approach based on <a href=\"https://github.com/deepmind/graph_nets\" rel=\"nofollow\">Graph Networks</a> from DeepMind. This can be used to predict <strong>binary</strong>, <strong>ternary</strong>, or <strong>N-ary</strong> relations. This is well-supported for the one-to-one case and the one-to-many case.</p>\n<h4>Attribute Prediction</h4>\n<p>We would like to predict one or more Attributes of a Thing, which may include also prediction of whether that Attribute should even be present at all.</p>\n<p><em><strong>In KGLIB</strong></em> <a href=\"https://github.com/graknlabs/kglib/tree/master/kglib/kgcn\" rel=\"nofollow\"><em>Knowledge Graph Convolutional Networks</em> (KGCNs)</a> can be used to directly learn Attributes for any Thing. This requires some minor additional functionality to be added (we intend to build this imminently).</p>\n<h4>Subgraph Prediction</h4>\n<p>We can extend N-ary Relation and Attribute prediction to include Entity prediction, and in fact connected graphs of Entities, Relations, and Attributes as entire subgraphs. It may be possible to determine that such a graph is missing from an existing partially complete Knowledge Graph.</p>\n<h4>Building Concept Embeddings</h4>\n<p>Embeddings of Things and/or Types are universally useful for performing other downstream machine learning or data science tasks. Their usefulness comes in storing the context of a Concept in the graph as a numerical vector.\nThese vectors are easy to ingest into other ML pipelines.\nThe benefit of building general-purpose embeddings is therefore to make use of them in multiple other pipelines. This reduces the expense of traversing the Knowledge Graph, since this task can be performed once and the output re-used more than once.</p>\n<p><em><strong>In KGLIB</strong></em> <a href=\"https://github.com/graknlabs/kglib/tree/master/kglib/kgcn\" rel=\"nofollow\"><em>Knowledge Graph Convolutional Networks</em> (KGCNs)</a> can be used to build general-purpose embeddings. This requires additional functionality, since a generic loss function is required in order to train the model in an unsupervised fashion. At its simplest, this can be achieved by measuring the shortest distance across the KG between two Things. This can be achieved trivially in Grakn using <a href=\"https://dev.grakn.ai/docs/query/compute-query#compute-the-shortest-path\" rel=\"nofollow\"><code>compute path</code></a>.</p>\n<h4>Rule Mining (a.k.a. Association Rule Learning)</h4>\n<p>Known largely as <a href=\"https://en.wikipedia.org/wiki/Association_rule_learning\" rel=\"nofollow\">Association Rule Learning</a> in the literature, here we refer to Horn Clause Rule Mining. The objective is to search the Knowledge Graph for new <a href=\"https://dev.grakn.ai/docs/schema/rules\" rel=\"nofollow\">Grakn Rules</a> that may be applicable in the form of :</p>\n<pre>mined-rule sub rule,\nwhen {\n  [antecedent (the conditions)]\n}, then {\n  [consequent (the conclusions)]\n};\n</pre>\n<p>We anticipate that the validity of these rules needs to be checked by hand, since once committed to the graph they are assumed to be correct and will be applied across the KG.</p>\n<p>Rule mining is a very important field for KG completion. Finding and verifying rules can augment the existing knowledge at scale, since the Rule will be applied wherever the antecedent is found to be true.</p>\n<p>We deem Rule mining a form of <a href=\"https://en.wikipedia.org/wiki/Inductive_reasoning\" rel=\"nofollow\">inductive reasoning</a>, as opposed to the <a href=\"https://en.wikipedia.org/wiki/Deductive_reasoning\" rel=\"nofollow\">deductive reasoning</a> built in to Grakn (the method by which the induced Rules are applied).</p>\n<h4>Ontology Merging</h4>\n<p>Merging ontologies is a relatively common problem. Most often, users wish to merge their own proprietary Knowledge Graph with a public Knowledge Graph, for example <a href=\"http://conceptnet.io\" rel=\"nofollow\">ConceptNet</a>, <a href=\"http://geneontology.org\" rel=\"nofollow\">Gene Ontology (GO)</a>, <a href=\"http://disease-ontology.org\" rel=\"nofollow\">Disease Ontology (DO)</a>.</p>\n<p>Grakn's highly flexible knowledge representation features means that this isn't challenging at all if the two ontologies contain non-overlapping Entities, even if the Entities of the two KGs are interrelated.</p>\n<p>The challenge here is to find a mapping between the structure of the two KGs. If Types or Things (Type instances) overlap between the two KGs, then they need to be merged.</p>\n<p>This decomposes the problem to that of matching between the two KGs. Grakn's schema helps with this task, since we can use this to perform matching between the structures of the two KGs, and thereby find a mapping between them. Matching of data can be framed as either link prediction, or a comparison of graph embeddings.</p>\n<h4>Automated Knowledge Graph Creation</h4>\n<p>Often, Grakn users want to build a KG (or a subgraph of a KG) from raw data sources. This could be CSVs, SQL databases, bodies of text or information crawled on the web.</p>\n<p>Data with tabular structure is best migrated to Grakn manually until this field is far more mature. This is a result of the fact that a human reader of structure can infer the meaning of the information, but with only a field name or column name to go on, automated processes will lack the context necessary to perform well. Combining data from many sources in this fashion is a core strength of Grakn, and is not hard to achieve, as per the <a href=\"https://dev.grakn.ai/docs/examples/phone-calls-migration-python\" rel=\"nofollow\">Grakn docs</a>.</p>\n<p>Creating KGs from unstructured information such as text, however, is actually achievable for this task, thanks to the rich context in the data and the wide array of open-source NLP and NLU frameworks available to use. The output of these frameworks can be ingested into a KG with ease, and semi-autonomously used to build a KG of the domain described by the unstructured data. See <a href=\"https://blog.grakn.ai/text-mined-knowledge-graphs-beyond-text-mining-1ff207a7d850\" rel=\"nofollow\">this post</a> for more details on how to go about this. For discussions on integrating NLP and NLU with Grakn, check out the #nlp channel on the <a href=\"https://grakn.ai/slack\" rel=\"nofollow\">Grakn Slack</a>.</p>\n<h3>Decision-Making</h3>\n<p>Querying a compete knowledge graph may not be enough to inform complex of difficult decisions; we require methods specifically to help us find the right decision to make.</p>\n<h4>Expert Systems</h4>\n<p>Given a scenario, Expert Systems automatically make decisions or prompt the best course of action.</p>\n<p>For many applications, Expert Systems can be built entirely with the features provided by Grakn out-of-the-box. They make extensive use of deductive reasoning by utilising Grakn's Rules, where data describing the scenario is added to the KG programmatically with <code>insert</code> statements (made via one of the <a href=\"https://dev.grakn.ai/docs/client-api/overview\" rel=\"nofollow\">Grakn Clients</a>). <code>match</code> queries can then return the right course of action given the scenario.</p>\n<p><em><strong>In KGLIB</strong></em> we need to create examples of Expert Systems, and outline any best practices for building them. This includes recommendations for when symbolic logic alone doesn't provide sufficient answers, and needs to be combined with ML.</p>\n<h4>Optimal Pattern Finding</h4>\n<p>In general, this problem is one of finding an optimal path between two Things in a KG. This generally means taking account of a cost of traversing edges and nodes. If the cost of all traversals are equal, then <a href=\"https://dev.grakn.ai/docs/query/compute-query#compute-the-shortest-path\" rel=\"nofollow\"><code>compute path</code></a> will already perform this task, which is one of Grakn's built-in distributed algorithms. Here, the subgraph that can be traversed can be constrained with the <code>in</code> keyword.</p>\n<p>Beyond <code>compute path</code>, this problem concerns optimisation and is not necessarily best solved via ML methods; although it may be a candidate for an approach based on Reinforcement Learning.</p>\n<h4>System Design Automation and Configuration Automation</h4>\n<p>Typically this problem arises in engineering problems, most often in system design, where many systems need to be constructed and done so optimally according to the task they must fulfil and the constraints upon them.\nThis should be wholly or partially solvable with Grakn's automated reasoning. This task is particularly exciting, since solving it brings us closer to automating engineering design processes.</p>\n<p><em><strong>In KGLIB</strong></em> we need to build examples of how to build such methodologies, along with best practice guidance.</p>\n<h3>Soft Searching</h3>\n<h4>Fuzzy Pattern Matching</h4>\n<p><a href=\"https://dev.grakn.ai/docs/query/overview\" rel=\"nofollow\">Graql</a> is a highly expressive language that we can use to query Grakn. Included in Graql is the ability to make ambiguous queries. In some cases however, we may want to retrieve a list of the best matches rather than an equally-weighted list of exact matches. This requires a solution that goes beyond Graql.</p>\n<h4>Querying and Responding via Natural Language</h4>\n<p>This problem reduces to converting between natural language and <a href=\"https://dev.grakn.ai/docs/query/overview\" rel=\"nofollow\">Graql</a>. Graql is expressive and closely resembles spoken English. However, there is still a gap between natural language and Graql. Finding a bridge for this gap will allow non-technical users to ask questions of the KG in natural language, and receive answers in natural language.\nThis has wide applications, with particular rising interest in building chatbots for the web. At present, the most favourable solution architecture is to use a readily available NLU component, and translate the intentions that this component identifies into Graql.</p>\n<h3>Summary</h3>\n<p>We see that the tasks that we want to perform over Knowledge Graphs are varied. Having at our disposal  a toolbox of methods to perform these tasks is a very exciting prospect! This would be enabling across so many industries.</p>\n<p>This is the motivation for KGLIB. We would be delighted if you would help us to progress thiw work. You can help in so many ways:</p>\n<ul>\n<li>Starring the repo to let us know you like it ;)</li>\n<li>Telling us which tasks are important for you</li>\n<li>Highlighting tasks we have omitted</li>\n<li>Getting involved with the code and contributing to the solutions that interest you!</li>\n</ul>\n<p>Thanks for reading!</p>\n\n          </div>"}, "last_serial": 6318648, "releases": {"0.1": [{"comment_text": "", "digests": {"md5": "dfbeccfa237f6169a141659326cb5d98", "sha256": "53ddeb8074075671295322af5f0f979481a7d1a221f675c53ad57f3520d82776"}, "downloads": -1, "filename": "grakn_kglib-0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "dfbeccfa237f6169a141659326cb5d98", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 69936, "upload_time": "2019-05-29T15:46:08", "upload_time_iso_8601": "2019-05-29T15:46:08.792785Z", "url": "https://files.pythonhosted.org/packages/73/99/9c3f252fba9998ea7ce5274eb0bc25c68dcc417488d9fef1e25f4005a803/grakn_kglib-0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "dd0ff834d51b0cdc7713904a8d5ccda6", "sha256": "a3da5f9ed1f88e852dab245733584b7c6407d5e96bf467eb8253f4f3ff2c47a7"}, "downloads": -1, "filename": "grakn-kglib-0.1.tar.gz", "has_sig": false, "md5_digest": "dd0ff834d51b0cdc7713904a8d5ccda6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 33928, "upload_time": "2019-05-29T15:46:10", "upload_time_iso_8601": "2019-05-29T15:46:10.575495Z", "url": "https://files.pythonhosted.org/packages/ad/59/0749479d71ada8e10e936787023331aef028d09a98b21b68dc3e01f3f80f/grakn-kglib-0.1.tar.gz", "yanked": false}], "0.1a1": [{"comment_text": "", "digests": {"md5": "c0da31667edc15e29a7bc1b8d51977ee", "sha256": "721d0283cba383fca808080bb1989105f6ef893c8862667d7d7aba24011a470f"}, "downloads": -1, "filename": "grakn_kglib-0.1a1-py3-none-any.whl", "has_sig": false, "md5_digest": "c0da31667edc15e29a7bc1b8d51977ee", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 86695, "upload_time": "2019-01-25T20:50:27", "upload_time_iso_8601": "2019-01-25T20:50:27.167895Z", "url": "https://files.pythonhosted.org/packages/b2/4e/0b145c98b0a0b1b6f74f0d889152d0d6c5a60ff4a63c80b22bd5a24c65f5/grakn_kglib-0.1a1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "17dee2332f792c720924d40f95b62547", "sha256": "3052b8bc977cc34a65feb2ed346222317b889beb11c053748722b021e9f5d902"}, "downloads": -1, "filename": "grakn-kglib-0.1a1.tar.gz", "has_sig": false, "md5_digest": "17dee2332f792c720924d40f95b62547", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 43176, "upload_time": "2019-01-25T20:50:29", "upload_time_iso_8601": "2019-01-25T20:50:29.309934Z", "url": "https://files.pythonhosted.org/packages/58/ec/dd06197ff3ad2a2b9fea58b598728921bed4f1a72b09824f87ca9a1d5801/grakn-kglib-0.1a1.tar.gz", "yanked": false}], "0.1a2": [{"comment_text": "", "digests": {"md5": "0cc03dda81461fb5e7361925e0a313f8", "sha256": "c79373631de37ee72933a3bca05184ff08ac83e92a8c26b46423dc8d92305c9a"}, "downloads": -1, "filename": "grakn_kglib-0.1a2-py3-none-any.whl", "has_sig": false, "md5_digest": "0cc03dda81461fb5e7361925e0a313f8", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 65634, "upload_time": "2019-02-05T19:17:44", "upload_time_iso_8601": "2019-02-05T19:17:44.517275Z", "url": "https://files.pythonhosted.org/packages/ad/dc/337d79f1986f03b0d833c1f1e7a556c3f3817c94559329df5e00a3da9a14/grakn_kglib-0.1a2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0cf7148a209dbc35f189debbb6cb5167", "sha256": "d8524029f28b77e324ec88dcbeed235a8d0e1138ce67c74587945598da6ef3fe"}, "downloads": -1, "filename": "grakn-kglib-0.1a2.tar.gz", "has_sig": false, "md5_digest": "0cf7148a209dbc35f189debbb6cb5167", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 33280, "upload_time": "2019-02-05T19:17:46", "upload_time_iso_8601": "2019-02-05T19:17:46.263470Z", "url": "https://files.pythonhosted.org/packages/92/ce/f96398a84f1c3ff7c81f463135f80e798eaa81d6efba7196cdc3007874b0/grakn-kglib-0.1a2.tar.gz", "yanked": false}], "0.1a3": [{"comment_text": "", "digests": {"md5": "3e6cabc2e3a8892ae253eb4622e9bd83", "sha256": "8471ea20ae05abe6ae576016c8726eea3507509dfaa56871676c62e184e776f6"}, "downloads": -1, "filename": "grakn_kglib-0.1a3-py3-none-any.whl", "has_sig": false, "md5_digest": "3e6cabc2e3a8892ae253eb4622e9bd83", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 67615, "upload_time": "2019-03-05T23:09:21", "upload_time_iso_8601": "2019-03-05T23:09:21.258880Z", "url": "https://files.pythonhosted.org/packages/09/4d/de533bb0b12eb8895bc21cde7285a885be488ff16ef16e49f24027fb4f58/grakn_kglib-0.1a3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "33065e471d432a5796d9e894ef10484c", "sha256": "7c6ea9c97902cfb0d5d4347a8f800d78e83b965ed51d4e1875d76aea87a230ba"}, "downloads": -1, "filename": "grakn-kglib-0.1a3.tar.gz", "has_sig": false, "md5_digest": "33065e471d432a5796d9e894ef10484c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 33243, "upload_time": "2019-03-05T23:09:22", "upload_time_iso_8601": "2019-03-05T23:09:22.856948Z", "url": "https://files.pythonhosted.org/packages/ab/ab/51151a531300d18cc43035122611dc338deeb0d27dacb376d8e74ac92121/grakn-kglib-0.1a3.tar.gz", "yanked": false}], "0.2": [{"comment_text": "", "digests": {"md5": "d9d901e6707e8f52f2bac3313d686833", "sha256": "02760b606adfbc4713c9b3aaa5f797dfb9b5a4e29a1143d9a4acbed8f05b0f48"}, "downloads": -1, "filename": "grakn-kglib-0.2.tar.gz", "has_sig": false, "md5_digest": "d9d901e6707e8f52f2bac3313d686833", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 86632, "upload_time": "2019-09-25T18:41:42", "upload_time_iso_8601": "2019-09-25T18:41:42.246781Z", "url": "https://files.pythonhosted.org/packages/c7/59/c829fe42d8f7d1fa8686c8e63c444cf438a9e206949207ff7a5d0397e3e3/grakn-kglib-0.2.tar.gz", "yanked": false}], "0.2.1": [{"comment_text": "", "digests": {"md5": "7a393015057abd71d22bdd2c166a5471", "sha256": "5c8d94656b4509908fbd7584f6e8fb61ceec5c4d4d44a756629dbceab78effd2"}, "downloads": -1, "filename": "grakn-kglib-0.2.1.tar.gz", "has_sig": false, "md5_digest": "7a393015057abd71d22bdd2c166a5471", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 89579, "upload_time": "2019-12-17T15:19:22", "upload_time_iso_8601": "2019-12-17T15:19:22.509695Z", "url": "https://files.pythonhosted.org/packages/ac/27/b3cbe649ab14ecbf214f1a32bbd1b870108a125b6dcf2b91f1e0f53e7771/grakn-kglib-0.2.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "7a393015057abd71d22bdd2c166a5471", "sha256": "5c8d94656b4509908fbd7584f6e8fb61ceec5c4d4d44a756629dbceab78effd2"}, "downloads": -1, "filename": "grakn-kglib-0.2.1.tar.gz", "has_sig": false, "md5_digest": "7a393015057abd71d22bdd2c166a5471", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 89579, "upload_time": "2019-12-17T15:19:22", "upload_time_iso_8601": "2019-12-17T15:19:22.509695Z", "url": "https://files.pythonhosted.org/packages/ac/27/b3cbe649ab14ecbf214f1a32bbd1b870108a125b6dcf2b91f1e0f53e7771/grakn-kglib-0.2.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:54:53 2020"}