{"info": {"author": "Christopher R. Wood", "author_email": "", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: MacOS X", "Environment :: Win32 (MS Windows)", "Environment :: X11 Applications", "Environment :: X11 Applications :: Gnome", "Environment :: X11 Applications :: GTK", "Environment :: X11 Applications :: KDE", "Environment :: X11 Applications :: Qt", "Intended Audience :: End Users/Desktop", "License :: DFSG approved", "License :: OSI Approved", "License :: OSI Approved :: GNU General Public License v3 (GPLv3)", "Natural Language :: English", "Operating System :: MacOS :: MacOS X", "Operating System :: Microsoft :: Windows", "Operating System :: Microsoft :: Windows :: Windows 10", "Operating System :: Microsoft :: Windows :: Windows 7", "Operating System :: Microsoft :: Windows :: Windows 8", "Operating System :: Microsoft :: Windows :: Windows 8.1", "Operating System :: POSIX", "Operating System :: POSIX :: Linux", "Programming Language :: Python", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3 :: Only", "Topic :: Communications :: File Sharing", "Topic :: Desktop Environment", "Topic :: Internet", "Topic :: Security", "Topic :: Security :: Cryptography", "Topic :: System :: Archiving", "Topic :: System :: Archiving :: Backup", "Topic :: System :: Archiving :: Mirroring", "Topic :: System :: Distributed Computing", "Topic :: System :: Filesystems", "Topic :: System :: Recovery Tools", "Topic :: Utilities"], "description": "========\nGridsync\n========\n\n.. image:: https://api.travis-ci.org/gridsync/gridsync.svg?branch=master\n    :target: https://travis-ci.org/gridsync/gridsync\n.. image:: https://ci.appveyor.com/api/projects/status/li99vnfax895i8oy/branch/master?svg=true\n    :target: https://ci.appveyor.com/project/crwood/gridsync\n\n\nGridsync aims to provide a cross-platform, graphical user interface for `Tahoe-LAFS`_, the Least Authority File Store. It is intended to simplify the Tahoe-LAFS installation and configuration process and ultimately provide user-friendly mechanisms for common use-cases like backing up local files, synchronizing directories between devices, and sharing files and folders with other users across all major desktop platforms (GNU/Linux, macOS, and Windows). More broadly, Gridsync aims to duplicate most of the core functionality provided by other, proprietary \"cloud\" backup and synchronization services and utilities (such as Dropbox and BitTorrent Sync) but without demanding any sacrifice of the user's privacy or freedom -- and without requiring usage or knowledge of the command line. Accordingly, Gridsync is developed with the goal in mind of making secure cloud storage freely available to everyone, without exception, without added barriers, and regardless of one's operating system choice.\n\n.. _Tahoe-LAFS: https://tahoe-lafs.org\n\n\nWhy Gridsync?\n-------------\n\nTahoe-LAFS already provides a number of highly desirable properties for secure file-storage: in addition to offering client-side encryption, it is decentralized, robust, free (as in both beer and speech), stable and mature, and written by a group of very talented developers. Unfortunately -- and despite all of its technical merits -- Tahoe-LAFS has a number of persistent usability issues which steepen its learning curve: its installation requires manual compilation from source on Windows and macOS, its configuration consists in hand-editing text files, its primary interface requires heavy command line usage, and many of its fundamental concepts (e.g., \"dircap\", \"shares\", \"servers-of-happiness\") are opaque to new users or otherwise demand additional reading of the project's extensive documentation. Accordingly, Tahoe-LAFS' userbase consists primarily in seasoned developers and system administrators; non-technical users are naturally excluded from enjoying Tahoe-LAFS's aforementioned advantages.\n\nThe Gridsync project intends to overcome some of Tahoe-LAFS's usability barriers by means of following features:\n\n* \"Batteries included\" packaging -- Gridsync bundles will include Tahoe-LAFS and all required dependencies for a frictionless installation experience; no python installation or manual compilation is required.\n* A graphical user interface for managing primary Tahoe-LAFS functionality (e.g., starting, stopping, configuring gateways) -- the user will never have to edit a text file by hand or touch the command line.\n* \"Native\" look and feel -- Gridsync uses the Qt application framework, emulating native widgets on all target platforms; the user can expect Gridsync to behave like any other desktop application.\n* Automated bi-directional file synchronization -- Gridsync will monitor local and remote directories, seamlessly storing or retrieving new versions of files as they appear (using Tahoe-LAFS' \"Magic Folder\" feature [*]_ ).\n* Status indicators -- the user will know, at a glance, the number of connected storage nodes, folder sizes and modification times, when folders are synchronizing, recently updated files, etc.\n* Desktop integration -- Gridsync can (optionally) start automatically on login and provide desktop notifications when certain operations have completed.\n* Easy sharing -- Gridsync uses the `magic-wormhole`_ library to provide human-pronounceable \"`invite codes`_\" for joining storage grids and sharing folders with other users.\n* Simple recovery -- Gridsync's \"`Recovery Key`_\" subsystem allows connections and folders to be easily restored from a single file in the event of a disaster.\n* `Tor support`_ (experimental) -- Gridsync can tunnel outgoing connections through the `Tor`_ anonymity network, concealing users' network location from storage service providers and each other.\n\n.. _magic-wormhole: http://magic-wormhole.io\n.. _invite codes: https://github.com/gridsync/gridsync/blob/master/docs/invite-codes.md\n.. _Recovery Key: https://github.com/gridsync/gridsync/blob/master/docs/recovery-keys.md\n.. _Tor support: https://github.com/gridsync/gridsync/blob/master/docs/tor-integration.md\n.. _Tor: https://torproject.org\n\n.. [*] Tahoe-LAFS' \"Magic Folder\" functionality is not (yet) fully supported on macOS or other BSD-based operating systems and is presently marked as experimental.\n\n\nScreenshots:\n------------\n\n.. image:: https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/welcome.png\n\n.. image:: https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/connecting.png\n\n.. image:: https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/dropzone.png\n\n.. image:: https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/passphrase.gif\n\n.. image:: https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/menu.png\n\n.. image:: https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/share.png\n\n.. image:: https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/notify.gif\n\n.. image:: https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/history.png\n\nInstallation and running:\n-------------------------\n\n**Stable releases:**\n\nDownloads for \"stable\" releases of Gridsync can be found on the project's `GitHub Releases page`_ and include pre-built/binary distrubitions for all three major desktop platforms that have been compiled inside dedicated virtual machines on dedicated hardware. Users wishing to install these packages are strongly urged to `verify their signatures`_ before running or, alternatively, to build/install Gridsync manually from source (see below).\n\n.. _GitHub Releases page: https://github.com/gridsync/gridsync/releases\n.. _verify their signatures: https://github.com/gridsync/gridsync/blob/master/docs/verifying-signatures.md\n\nTo install and run Gridsync on GNU/Linux (64-bit only; supporting glibc 2.17 and above -- including Debian 8+, Ubuntu 14.04+, CentOS 7+, and Fedora 29+):\n\n1. Download `Gridsync-Linux.tar.gz`_ (and `verify`_ its signature)\n2. Extract the enclosed \"Gridsync\" directory anywhere (``tar xvf Gridsync-Linux.tar.gz``)\n3. Run the contained ``gridsync`` binary\n\n.. _Gridsync-Linux.tar.gz: https://github.com/gridsync/gridsync/releases\n.. _verify: https://github.com/gridsync/gridsync/blob/master/docs/verifying-signatures.md\n\nTo install and run Gridsync on macOS (64-bit only; supporting macOS 10.12 \"Sierra\" and above):\n\n1. Download `Gridsync-macOS.dmg`_ (and `verify`_ its signature)\n2. Drag the enclosed \"Gridsync.app\" bundle anywhere (e.g., ``~/Applications``)\n3. Double-click ``Gridsync.app``\n\nUsers on older Macs can alternatively try `Gridsync-macOS-Legacy.dmg`_ (which has been tested to work on 2009-era hardware with versions of macOS as old as 10.9).\n\n.. _Gridsync-macOS.dmg: https://github.com/gridsync/gridsync/releases\n.. _verify: https://github.com/gridsync/gridsync/blob/master/docs/verifying-signatures.md\n.. _Gridsync-macOS-Legacy.dmg: https://github.com/gridsync/gridsync/releases\n\nTo install and run Gridsync on Windows (64-bit only; supporting Windows Server 2012R2, Windows 7 SP1, Windows 8.1, and Windows 10):\n\n1. Download `Gridsync-Windows-setup.exe`_ (and `verify`_ its signature)\n2. Run the executable installer and follow/complete the setup wizard\n3. Select \"Launch Gridsync\" when installation is finished\n\nAlternatively, Windows users who do not wish to use the executable installer can download and verify `Gridsync-Windows.zip`_, extract the enclosed \"Gridsync\" folder anywhere, and run `Gridsync.exe`.\n\n.. _Gridsync-Windows-setup.exe: https://github.com/gridsync/gridsync/releases\n.. _verify: https://github.com/gridsync/gridsync/blob/master/docs/verifying-signatures.md\n.. _Gridsync-Windows.zip: https://github.com/gridsync/gridsync/releases\n\n\n**From source:**\n\nBecause Tahoe-LAFS has not yet been ported to python3, and because some GNU/Linux distributions might contain especially old versions of some dependencies, it is recommended to install and run Tahoe-LAFS and Gridsync inside their own virtual environments using updated dependencies from PyPI (ideally with hashes verified).\n\nThe following series of steps (run from the top level of the Gridsync source tree) should work on most Debian-based GNU/Linux distributions:\n\n.. code-block:: shell-session\n\n    sudo apt-get install build-essential libffi-dev libssl-dev python python-dev python3 python3-dev virtualenv\n    virtualenv --python=python2 ./venv2\n    ./venv2/bin/python -m pip install --upgrade setuptools pip\n    ./venv2/bin/python -m pip install tahoe-lafs\n    virtualenv --python=python3 ./venv3\n    ./venv3/bin/python -m pip install --upgrade setuptools pip\n    ./venv3/bin/python -m pip install -r requirements/requirements-hashes.txt\n    ./venv3/bin/python -m pip install .\n    PATH=$PATH:./venv2/bin ./venv3/bin/gridsync\n\n\nUsers of other distributions and operating systems should modify the above steps as required (for example, by installing Xcode on macOS in addition to python -- or the dependencies listed at the top of `make.bat`_ in the case of Windows).\n\n.. _make.bat: https://github.com/gridsync/gridsync/blob/master/make.bat\n\nAlternatively, users can build a more portable binary distribution of Gridsync and Tahoe-LAFS (suitable for running on other machines of the same architecture) by installing the above dependencies and typing `make` in the top-level of the source tree. This will create a \"frozen\" distribution of Gridsync and all of its dependencies (including python and Tahoe-LAFS) using `PyInstaller`_, placing the resultant executable files/installers in the `dist/` subdirectory.\n\n.. _PyInstaller: http://www.pyinstaller.org/\n\n\n**Development builds:**\n\nUnsigned binary distributions (currently tracking the `master` branch) are also available from the `project buildbot's \"artifacts\" directory`_. These packages, however, should not be considered trustworthy or reliable in any way and are made available only for testing purposes by developers. Please excercise appropriate caution when using these files (ideally by downloading and running them inside a disposable virtual machine).\n\n.. _project buildbot's \"artifacts\" directory: https://buildbot.gridsync.io/artifacts/\n\n\nKnown issues and limitations:\n-----------------------------\n\nWhile Gridsync ultimately aims to provide an easy-to-use frontend for users of Tahoe-LAFS, at present, its interface only supports a very limited subset of Tahoe-LAFS's underlying features and potential use-cases (namely, it provides simplified means for joining storage grids, creating and sharing \"magic-folders,\" and receiving status updates and notifications pertaining to those processes). Accordingly, users should not (yet) expect Gridsync to provide a complete backup solution or to serve as a stand-in replacement for other tools with robust sharing and collaboration capabilities.\n\nIn addition, it should be noted that Tahoe-LAFS's \"magic-folder\" functionality itself is currently considered \"experimental\" and has a number of `known issues and limitations`_ and `open development tickets`_.\n\n.. _known issues and limitations: https://tahoe-lafs.readthedocs.io/en/tahoe-lafs-1.12.1/frontends/magic-folder.html#known-issues-and-limitations-with-magic-folder\n.. _open development tickets: https://tahoe-lafs.org/trac/tahoe-lafs/search?q=magic-folder&noquickjump=1&ticket=on\n\n\nContributing:\n-------------\n\nContributions of any sort (e.g., suggestions, criticisms, bug reports, pull requests) are welcome. Any persons interested in aiding the development of Gridsync are encouraged to do so by opening a `GitHub Issue`_ or by contacting its primary developer: `chris@gridsync.io`_\n\n.. _GitHub Issue: https://github.com/gridsync/gridsync/issues\n.. _chris@gridsync.io: mailto:chris@gridsync.io\n\n\nLicense:\n--------\n\nCopyright (C) 2015-2019  Christopher R. Wood\n\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with this program.  If not, see <http://www.gnu.org/licenses/>.\n\n\nSponsors:\n---------\n\nThe ongoing development of this project is made possible by the generous sponsorships provided by `Least Authority`_ and `UXFund`_.\n\n.. _Least Authority: https://leastauthority.com/\n.. _UXFund: https://usable.tools/uxfund.html\n\n\n", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/gridsync/gridsync", "keywords": "gridsync tahoe-lafs tahoe lafs allmydata-tahoe magic-wormhole", "license": "GPLv3", "maintainer": "", "maintainer_email": "", "name": "gridsync", "package_url": "https://pypi.org/project/gridsync/", "platform": "", "project_url": "https://pypi.org/project/gridsync/", "project_urls": {"Homepage": "https://github.com/gridsync/gridsync"}, "release_url": "https://pypi.org/project/gridsync/0.4.2/", "requires_dist": ["autobahn", "humanize", "hyperlink", "magic-wormhole", "PyNaCl (>=1.2.0)", "PyQt5", "pyyaml", "qt5reactor", "treq", "twisted[tls]", "txtorcon", "zxcvbn"], "requires_python": "", "summary": "Synchronize local directories with Tahoe-LAFS storage grids.", "version": "0.4.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <a href=\"https://travis-ci.org/gridsync/gridsync\" rel=\"nofollow\"><img alt=\"https://api.travis-ci.org/gridsync/gridsync.svg?branch=master\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/58a41d3396a3de5954cc99c65f8a56c337726833/68747470733a2f2f6170692e7472617669732d63692e6f72672f6772696473796e632f6772696473796e632e7376673f6272616e63683d6d6173746572\"></a>\n<a href=\"https://ci.appveyor.com/project/crwood/gridsync\" rel=\"nofollow\"><img alt=\"https://ci.appveyor.com/api/projects/status/li99vnfax895i8oy/branch/master?svg=true\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/bfe19168728e0f63c79b1c2590f49d7eb9955dc6/68747470733a2f2f63692e6170707665796f722e636f6d2f6170692f70726f6a656374732f7374617475732f6c693939766e66617838393569386f792f6272616e63682f6d61737465723f7376673d74727565\"></a>\n<p>Gridsync aims to provide a cross-platform, graphical user interface for <a href=\"https://tahoe-lafs.org\" rel=\"nofollow\">Tahoe-LAFS</a>, the Least Authority File Store. It is intended to simplify the Tahoe-LAFS installation and configuration process and ultimately provide user-friendly mechanisms for common use-cases like backing up local files, synchronizing directories between devices, and sharing files and folders with other users across all major desktop platforms (GNU/Linux, macOS, and Windows). More broadly, Gridsync aims to duplicate most of the core functionality provided by other, proprietary “cloud” backup and synchronization services and utilities (such as Dropbox and BitTorrent Sync) but without demanding any sacrifice of the user’s privacy or freedom – and without requiring usage or knowledge of the command line. Accordingly, Gridsync is developed with the goal in mind of making secure cloud storage freely available to everyone, without exception, without added barriers, and regardless of one’s operating system choice.</p>\n<div id=\"why-gridsync\">\n<h2>Why Gridsync?</h2>\n<p>Tahoe-LAFS already provides a number of highly desirable properties for secure file-storage: in addition to offering client-side encryption, it is decentralized, robust, free (as in both beer and speech), stable and mature, and written by a group of very talented developers. Unfortunately – and despite all of its technical merits – Tahoe-LAFS has a number of persistent usability issues which steepen its learning curve: its installation requires manual compilation from source on Windows and macOS, its configuration consists in hand-editing text files, its primary interface requires heavy command line usage, and many of its fundamental concepts (e.g., “dircap”, “shares”, “servers-of-happiness”) are opaque to new users or otherwise demand additional reading of the project’s extensive documentation. Accordingly, Tahoe-LAFS’ userbase consists primarily in seasoned developers and system administrators; non-technical users are naturally excluded from enjoying Tahoe-LAFS’s aforementioned advantages.</p>\n<p>The Gridsync project intends to overcome some of Tahoe-LAFS’s usability barriers by means of following features:</p>\n<ul>\n<li>“Batteries included” packaging – Gridsync bundles will include Tahoe-LAFS and all required dependencies for a frictionless installation experience; no python installation or manual compilation is required.</li>\n<li>A graphical user interface for managing primary Tahoe-LAFS functionality (e.g., starting, stopping, configuring gateways) – the user will never have to edit a text file by hand or touch the command line.</li>\n<li>“Native” look and feel – Gridsync uses the Qt application framework, emulating native widgets on all target platforms; the user can expect Gridsync to behave like any other desktop application.</li>\n<li>Automated bi-directional file synchronization – Gridsync will monitor local and remote directories, seamlessly storing or retrieving new versions of files as they appear (using Tahoe-LAFS’ “Magic Folder” feature <a href=\"#id2\" id=\"id1\" rel=\"nofollow\">[*]</a> ).</li>\n<li>Status indicators – the user will know, at a glance, the number of connected storage nodes, folder sizes and modification times, when folders are synchronizing, recently updated files, etc.</li>\n<li>Desktop integration – Gridsync can (optionally) start automatically on login and provide desktop notifications when certain operations have completed.</li>\n<li>Easy sharing – Gridsync uses the <a href=\"http://magic-wormhole.io\" rel=\"nofollow\">magic-wormhole</a> library to provide human-pronounceable “<a href=\"https://github.com/gridsync/gridsync/blob/master/docs/invite-codes.md\" rel=\"nofollow\">invite codes</a>” for joining storage grids and sharing folders with other users.</li>\n<li>Simple recovery – Gridsync’s “<a href=\"https://github.com/gridsync/gridsync/blob/master/docs/recovery-keys.md\" rel=\"nofollow\">Recovery Key</a>” subsystem allows connections and folders to be easily restored from a single file in the event of a disaster.</li>\n<li><a href=\"https://github.com/gridsync/gridsync/blob/master/docs/tor-integration.md\" rel=\"nofollow\">Tor support</a> (experimental) – Gridsync can tunnel outgoing connections through the <a href=\"https://torproject.org\" rel=\"nofollow\">Tor</a> anonymity network, concealing users’ network location from storage service providers and each other.</li>\n</ul>\n<table id=\"id2\">\n<col><col>\n<tbody>\n<tr><td><a href=\"#id1\" rel=\"nofollow\">[*]</a></td><td>Tahoe-LAFS’ “Magic Folder” functionality is not (yet) fully supported on macOS or other BSD-based operating systems and is presently marked as experimental.</td></tr>\n</tbody>\n</table>\n</div>\n<div id=\"screenshots\">\n<h2>Screenshots:</h2>\n<img alt=\"https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/welcome.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/63eee27f5ac3f8e98080ba2cf5a5e1ddb0fb4ac9/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f6772696473796e632f6772696473796e632f6d61737465722f696d616765732f73637265656e73686f74732f77656c636f6d652e706e67\">\n<img alt=\"https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/connecting.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/ef0540af9180cd0fc2cbc98c6164758b7c1b3627/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f6772696473796e632f6772696473796e632f6d61737465722f696d616765732f73637265656e73686f74732f636f6e6e656374696e672e706e67\">\n<img alt=\"https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/dropzone.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/1902cbd5123669a8be55ad0ce7609fc76923d201/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f6772696473796e632f6772696473796e632f6d61737465722f696d616765732f73637265656e73686f74732f64726f707a6f6e652e706e67\">\n<img alt=\"https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/passphrase.gif\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/36c31cad3461aef3afd9c2a02b5b465716efe19b/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f6772696473796e632f6772696473796e632f6d61737465722f696d616765732f73637265656e73686f74732f706173737068726173652e676966\">\n<img alt=\"https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/menu.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/783cbaf577c1c2f46d805e0f1acab1307cc96477/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f6772696473796e632f6772696473796e632f6d61737465722f696d616765732f73637265656e73686f74732f6d656e752e706e67\">\n<img alt=\"https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/share.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/dedfa52afeaf82d292676a7f42a94061a7ddfbfd/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f6772696473796e632f6772696473796e632f6d61737465722f696d616765732f73637265656e73686f74732f73686172652e706e67\">\n<img alt=\"https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/notify.gif\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/d29e21267e97e24c116b7a1ea980483ad0c5d089/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f6772696473796e632f6772696473796e632f6d61737465722f696d616765732f73637265656e73686f74732f6e6f746966792e676966\">\n<img alt=\"https://raw.githubusercontent.com/gridsync/gridsync/master/images/screenshots/history.png\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/bb1ca15680dfda538723dfa51c00cebb635470b5/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f6772696473796e632f6772696473796e632f6d61737465722f696d616765732f73637265656e73686f74732f686973746f72792e706e67\">\n</div>\n<div id=\"installation-and-running\">\n<h2>Installation and running:</h2>\n<p><strong>Stable releases:</strong></p>\n<p>Downloads for “stable” releases of Gridsync can be found on the project’s <a href=\"https://github.com/gridsync/gridsync/releases\" rel=\"nofollow\">GitHub Releases page</a> and include pre-built/binary distrubitions for all three major desktop platforms that have been compiled inside dedicated virtual machines on dedicated hardware. Users wishing to install these packages are strongly urged to <a href=\"https://github.com/gridsync/gridsync/blob/master/docs/verifying-signatures.md\" rel=\"nofollow\">verify their signatures</a> before running or, alternatively, to build/install Gridsync manually from source (see below).</p>\n<p>To install and run Gridsync on GNU/Linux (64-bit only; supporting glibc 2.17 and above – including Debian 8+, Ubuntu 14.04+, CentOS 7+, and Fedora 29+):</p>\n<ol>\n<li>Download <a href=\"https://github.com/gridsync/gridsync/releases\" rel=\"nofollow\">Gridsync-Linux.tar.gz</a> (and <a href=\"https://github.com/gridsync/gridsync/blob/master/docs/verifying-signatures.md\" rel=\"nofollow\">verify</a> its signature)</li>\n<li>Extract the enclosed “Gridsync” directory anywhere (<tt>tar xvf <span class=\"pre\">Gridsync-Linux.tar.gz</span></tt>)</li>\n<li>Run the contained <tt>gridsync</tt> binary</li>\n</ol>\n<p>To install and run Gridsync on macOS (64-bit only; supporting macOS 10.12 “Sierra” and above):</p>\n<ol>\n<li>Download <a href=\"https://github.com/gridsync/gridsync/releases\" rel=\"nofollow\">Gridsync-macOS.dmg</a> (and <a href=\"https://github.com/gridsync/gridsync/blob/master/docs/verifying-signatures.md\" rel=\"nofollow\">verify</a> its signature)</li>\n<li>Drag the enclosed “Gridsync.app” bundle anywhere (e.g., <tt>~/Applications</tt>)</li>\n<li>Double-click <tt>Gridsync.app</tt></li>\n</ol>\n<p>Users on older Macs can alternatively try <a href=\"https://github.com/gridsync/gridsync/releases\" rel=\"nofollow\">Gridsync-macOS-Legacy.dmg</a> (which has been tested to work on 2009-era hardware with versions of macOS as old as 10.9).</p>\n<p>To install and run Gridsync on Windows (64-bit only; supporting Windows Server 2012R2, Windows 7 SP1, Windows 8.1, and Windows 10):</p>\n<ol>\n<li>Download <a href=\"https://github.com/gridsync/gridsync/releases\" rel=\"nofollow\">Gridsync-Windows-setup.exe</a> (and <a href=\"https://github.com/gridsync/gridsync/blob/master/docs/verifying-signatures.md\" rel=\"nofollow\">verify</a> its signature)</li>\n<li>Run the executable installer and follow/complete the setup wizard</li>\n<li>Select “Launch Gridsync” when installation is finished</li>\n</ol>\n<p>Alternatively, Windows users who do not wish to use the executable installer can download and verify <a href=\"https://github.com/gridsync/gridsync/releases\" rel=\"nofollow\">Gridsync-Windows.zip</a>, extract the enclosed “Gridsync” folder anywhere, and run <cite>Gridsync.exe</cite>.</p>\n<p><strong>From source:</strong></p>\n<p>Because Tahoe-LAFS has not yet been ported to python3, and because some GNU/Linux distributions might contain especially old versions of some dependencies, it is recommended to install and run Tahoe-LAFS and Gridsync inside their own virtual environments using updated dependencies from PyPI (ideally with hashes verified).</p>\n<p>The following series of steps (run from the top level of the Gridsync source tree) should work on most Debian-based GNU/Linux distributions:</p>\n<pre><span class=\"go\">sudo apt-get install build-essential libffi-dev libssl-dev python python-dev python3 python3-dev virtualenv\nvirtualenv --python=python2 ./venv2\n./venv2/bin/python -m pip install --upgrade setuptools pip\n./venv2/bin/python -m pip install tahoe-lafs\nvirtualenv --python=python3 ./venv3\n./venv3/bin/python -m pip install --upgrade setuptools pip\n./venv3/bin/python -m pip install -r requirements/requirements-hashes.txt\n./venv3/bin/python -m pip install .\nPATH=$PATH:./venv2/bin ./venv3/bin/gridsync</span>\n</pre>\n<p>Users of other distributions and operating systems should modify the above steps as required (for example, by installing Xcode on macOS in addition to python – or the dependencies listed at the top of <a href=\"https://github.com/gridsync/gridsync/blob/master/make.bat\" rel=\"nofollow\">make.bat</a> in the case of Windows).</p>\n<p>Alternatively, users can build a more portable binary distribution of Gridsync and Tahoe-LAFS (suitable for running on other machines of the same architecture) by installing the above dependencies and typing <cite>make</cite> in the top-level of the source tree. This will create a “frozen” distribution of Gridsync and all of its dependencies (including python and Tahoe-LAFS) using <a href=\"http://www.pyinstaller.org/\" rel=\"nofollow\">PyInstaller</a>, placing the resultant executable files/installers in the <cite>dist/</cite> subdirectory.</p>\n<p><strong>Development builds:</strong></p>\n<p>Unsigned binary distributions (currently tracking the <cite>master</cite> branch) are also available from the <a href=\"https://buildbot.gridsync.io/artifacts/\" rel=\"nofollow\">project buildbot’s “artifacts” directory</a>. These packages, however, should not be considered trustworthy or reliable in any way and are made available only for testing purposes by developers. Please excercise appropriate caution when using these files (ideally by downloading and running them inside a disposable virtual machine).</p>\n</div>\n<div id=\"known-issues-and-limitations\">\n<h2>Known issues and limitations:</h2>\n<p>While Gridsync ultimately aims to provide an easy-to-use frontend for users of Tahoe-LAFS, at present, its interface only supports a very limited subset of Tahoe-LAFS’s underlying features and potential use-cases (namely, it provides simplified means for joining storage grids, creating and sharing “magic-folders,” and receiving status updates and notifications pertaining to those processes). Accordingly, users should not (yet) expect Gridsync to provide a complete backup solution or to serve as a stand-in replacement for other tools with robust sharing and collaboration capabilities.</p>\n<p>In addition, it should be noted that Tahoe-LAFS’s “magic-folder” functionality itself is currently considered “experimental” and has a number of <a href=\"https://tahoe-lafs.readthedocs.io/en/tahoe-lafs-1.12.1/frontends/magic-folder.html#known-issues-and-limitations-with-magic-folder\" rel=\"nofollow\">known issues and limitations</a> and <a href=\"https://tahoe-lafs.org/trac/tahoe-lafs/search?q=magic-folder&amp;noquickjump=1&amp;ticket=on\" rel=\"nofollow\">open development tickets</a>.</p>\n</div>\n<div id=\"contributing\">\n<h2>Contributing:</h2>\n<p>Contributions of any sort (e.g., suggestions, criticisms, bug reports, pull requests) are welcome. Any persons interested in aiding the development of Gridsync are encouraged to do so by opening a <a href=\"https://github.com/gridsync/gridsync/issues\" rel=\"nofollow\">GitHub Issue</a> or by contacting its primary developer: <a href=\"mailto:chris%40gridsync.io\">chris<span>@</span>gridsync<span>.</span>io</a></p>\n</div>\n<div id=\"license\">\n<h2>License:</h2>\n<p>Copyright (C) 2015-2019  Christopher R. Wood</p>\n<p>This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.</p>\n<p>This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.</p>\n<p>You should have received a copy of the GNU General Public License along with this program.  If not, see &lt;<a href=\"http://www.gnu.org/licenses/\" rel=\"nofollow\">http://www.gnu.org/licenses/</a>&gt;.</p>\n</div>\n<div id=\"sponsors\">\n<h2>Sponsors:</h2>\n<p>The ongoing development of this project is made possible by the generous sponsorships provided by <a href=\"https://leastauthority.com/\" rel=\"nofollow\">Least Authority</a> and <a href=\"https://usable.tools/uxfund.html\" rel=\"nofollow\">UXFund</a>.</p>\n</div>\n\n          </div>"}, "last_serial": 5108066, "releases": {"0.3.2": [{"comment_text": "", "digests": {"md5": "3bb17caee8c970ba032588eb7798bd30", "sha256": "907a7de88c79f4228f40536b327dcc95de85831e8900b6759bb502c5a3feaf9f"}, "downloads": -1, "filename": "gridsync-0.3.2-py3-none-any.whl", "has_sig": false, "md5_digest": "3bb17caee8c970ba032588eb7798bd30", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 522948, "upload_time": "2018-04-17T20:12:43", "upload_time_iso_8601": "2018-04-17T20:12:43.083373Z", "url": "https://files.pythonhosted.org/packages/15/ea/f4e949d7d750a826112f4060259e4a6cebf012388f36f44ddc1350014606/gridsync-0.3.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "06ff0270a37cd911efff71eb68369c34", "sha256": "d40493fd2ccd72b5a12f1be8c91c8e7050d7adee53026ece76396feb77f137ff"}, "downloads": -1, "filename": "gridsync-0.3.2.tar.gz", "has_sig": false, "md5_digest": "06ff0270a37cd911efff71eb68369c34", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 511524, "upload_time": "2018-04-17T20:12:45", "upload_time_iso_8601": "2018-04-17T20:12:45.363654Z", "url": "https://files.pythonhosted.org/packages/4b/1a/a0922b211ea731fc2077664f82d483c3625c593a1dba284e71ad4e86eaf4/gridsync-0.3.2.tar.gz", "yanked": false}], "0.4.0": [{"comment_text": "", "digests": {"md5": "e917ea238fa5fd0a7211e4e246e14679", "sha256": "b06f660bf924008bd2d9f9c1496eb753fe4261df542befaea0f87492b9356212"}, "downloads": -1, "filename": "gridsync-0.4.0-py3-none-any.whl", "has_sig": false, "md5_digest": "e917ea238fa5fd0a7211e4e246e14679", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 591872, "upload_time": "2019-01-12T05:06:58", "upload_time_iso_8601": "2019-01-12T05:06:58.420794Z", "url": "https://files.pythonhosted.org/packages/f8/d9/582e34b5bccddd40e10ee6642590c51e8104f0735eb5099ba91cf65b5ecb/gridsync-0.4.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "68cb943c9fc50c95b047fb84db02bde3", "sha256": "95e99b943f628750f640a5e2a370179de77a8897d63e3270b3985b37a01eadec"}, "downloads": -1, "filename": "gridsync-0.4.0.tar.gz", "has_sig": false, "md5_digest": "68cb943c9fc50c95b047fb84db02bde3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 566541, "upload_time": "2019-01-12T05:07:00", "upload_time_iso_8601": "2019-01-12T05:07:00.509130Z", "url": "https://files.pythonhosted.org/packages/93/f1/f11b7b84562bd3c6ba3a50b80152d0775cf73065999b0d6b1776ab097d92/gridsync-0.4.0.tar.gz", "yanked": false}], "0.4.1": [{"comment_text": "", "digests": {"md5": "7645225d290269a963266bffa57414d4", "sha256": "6c9c7c269e7e37c76a5c6d7893f1ba06fd8285a1987a656c4b8d07a6b310e537"}, "downloads": -1, "filename": "gridsync-0.4.1-py3-none-any.whl", "has_sig": false, "md5_digest": "7645225d290269a963266bffa57414d4", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 690249, "upload_time": "2019-03-13T03:10:17", "upload_time_iso_8601": "2019-03-13T03:10:17.640040Z", "url": "https://files.pythonhosted.org/packages/96/3c/ed86c0162e2f8e077349d34235511e0dc2f660fd938e47c7987f32557ef0/gridsync-0.4.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "576275d0bbd5f68107583182e39d7c3a", "sha256": "1608e10f9d60c98c0e83c01956720accf65a471d2417a7aa6fe3449bfbd5f81e"}, "downloads": -1, "filename": "gridsync-0.4.1.tar.gz", "has_sig": false, "md5_digest": "576275d0bbd5f68107583182e39d7c3a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 664368, "upload_time": "2019-03-13T03:10:19", "upload_time_iso_8601": "2019-03-13T03:10:19.848870Z", "url": "https://files.pythonhosted.org/packages/db/5b/f5868a4b2991f4cf3d7e9903690e88e0490fac8e2713c94fbf298d8fcc9d/gridsync-0.4.1.tar.gz", "yanked": false}], "0.4.2": [{"comment_text": "", "digests": {"md5": "2486e659e49c9f94fdbce7260698b160", "sha256": "9ee8cb729fadf2d23300aa6ef57d14518479216dfd8e6e33cad2d5c7ede4bcbe"}, "downloads": -1, "filename": "gridsync-0.4.2-py3-none-any.whl", "has_sig": false, "md5_digest": "2486e659e49c9f94fdbce7260698b160", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 704097, "upload_time": "2019-04-06T19:13:23", "upload_time_iso_8601": "2019-04-06T19:13:23.137446Z", "url": "https://files.pythonhosted.org/packages/a1/0d/b1a2e039b6fd36a4b89837820e853f6504a2670f474321d07c4cc886b1d5/gridsync-0.4.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6e18c4d5e6734741855353ea93897cc7", "sha256": "0b5cf5cd450cd06777bbc96e7e72db74e3e28a3e775b83f684b8372da3786dbf"}, "downloads": -1, "filename": "gridsync-0.4.2.tar.gz", "has_sig": false, "md5_digest": "6e18c4d5e6734741855353ea93897cc7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 676765, "upload_time": "2019-04-06T19:13:25", "upload_time_iso_8601": "2019-04-06T19:13:25.706012Z", "url": "https://files.pythonhosted.org/packages/64/f0/7eb1ef53fd459bdfdff48b3e67b2e083d1b0f23be430d39cf74dedba4dc6/gridsync-0.4.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "2486e659e49c9f94fdbce7260698b160", "sha256": "9ee8cb729fadf2d23300aa6ef57d14518479216dfd8e6e33cad2d5c7ede4bcbe"}, "downloads": -1, "filename": "gridsync-0.4.2-py3-none-any.whl", "has_sig": false, "md5_digest": "2486e659e49c9f94fdbce7260698b160", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 704097, "upload_time": "2019-04-06T19:13:23", "upload_time_iso_8601": "2019-04-06T19:13:23.137446Z", "url": "https://files.pythonhosted.org/packages/a1/0d/b1a2e039b6fd36a4b89837820e853f6504a2670f474321d07c4cc886b1d5/gridsync-0.4.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6e18c4d5e6734741855353ea93897cc7", "sha256": "0b5cf5cd450cd06777bbc96e7e72db74e3e28a3e775b83f684b8372da3786dbf"}, "downloads": -1, "filename": "gridsync-0.4.2.tar.gz", "has_sig": false, "md5_digest": "6e18c4d5e6734741855353ea93897cc7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 676765, "upload_time": "2019-04-06T19:13:25", "upload_time_iso_8601": "2019-04-06T19:13:25.706012Z", "url": "https://files.pythonhosted.org/packages/64/f0/7eb1ef53fd459bdfdff48b3e67b2e083d1b0f23be430d39cf74dedba4dc6/gridsync-0.4.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:54:13 2020"}