{"info": {"author": "Dean Stevens, GripQA", "author_email": "support@grip.qa", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Intended Audience :: End Users/Desktop", "License :: OSI Approved :: Apache Software License", "Natural Language :: English", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 3.4", "Topic :: Office/Business", "Topic :: Utilities"], "description": "grip-attendance.py\n=========================\n\nIntroduction / Description\n----------------------\n\nGrip QA's grip-attendance.py tool allows you to easily track and report on\nthe attendance at your event.\n\nThe program matches individuals from the actual attendee report to the\nindividuals who registered for your event. It generates a new list, based on\nthe registration list, that shows which registrants attended the event,\nwhich ones did not attend and which attendees did not register (assuming\nthat you allow un-registered individuals to participate in your events.\n\nWe've generally used this tool for tracking the engagement with our\nwebcasts, but it should be applicable to any event that provides you with a\nregistration list and an attendee list, both in CSV format.\n\nCommand Line Usage\n----------------------\n\nUSAGE:  grip-attendance.py reg_list.csv attend_list.csv [config_file.cfg]\n   or:  grip-attendance.py -[Hh][elp]\n   or:  grip-attendance.py -[Gg][en] new_config_file.cfg\n\nHelp Text\n----------------------\n\nFor normal operation, you must provide the relative pathnames for, at\nleast the two input data files (.csv):\n    <reg_list.csv> - CSV file with registration data.\n    <attend_list.csv> - CSV file containing actual attendee data.\n\nOptionally, you can also provide the path for a configuration file\n(.cfg). If you choose not to explicitly specify a config file, the\nprogram will look for the fixed default config file: \"attendance.cfg\",\nin the current working directory. If no default config file is\navailable, the program uses pre-defined default values.\n\nThe attendance file generated will have the same base name as the the\nregistration list file, with \"_attendance\" appended to the basename (if\nthe registration file name is \"reg_list.csv\", the attendance report will\nbe named \"reg_list_attendance.csv\")\n\n- -[Hh][elp] - \"-H\" (in either case), optionally followed by \"elp\" (-help)\nwill result in this message being displayed.\n\n- -[Gg][en] - \"-G\" (in either case), optionally followed by \"en\"\naccompanied by a mandatory pathname (-gen config-path.cfg) will cause\nthe program to generate a template config file that you can customize\nfor your registration and attendee list formats.\nThe configuration file provides a way to customize the execution of the\nprogram. The current version focuses on providing a way to identify the\nfield names in your data to the program.\n\nConfiguration File\n----------------------\n\nWe've made an attempt to provide reasonable defaults, but we recognize\nthat these will not apply to all situations, if the defaults don't work\nfor you, the configuration file will be your friend\n\nIn addition to the built-in defaults, there are two methods for you to\nspecify configuration information. You can create a file called\nattendance.cfg and place it in the directory that you'll be working in.\nThis is probably a good mechanism if you're generally working in a\nsingle directory and if your input data files have stable column\nheadings. You can also specify a configuration file pathname on the\ncommand line.\n\nThere are two user \"Sections\" in the configuration file that you should\nbe aware of: [REGISTRANTS] and [ATTENDEES], the former specifies field\nnames for the registration data file, while the latter gives field names\nfor the actual attendee data file (there's actually a third [DEFAULT]\nsection, but you should really understand how configuration files are\ninterpreted before you mess with it.\n\nThe most straight forward way to get a new configuration file is to run\nthis script as:\n\n    grip-attendance.py -Gen new_config_file.cfg\n\nwhere \"new_config_file.cfg\" is the pathname for the generated configuration\nfile. This will create a new configuration file with all of the default values\nfilled in for each section. Customization is then a simple matter of \nchanging the values on the right hand side of the = sign.\n\nSome things to note about configuration file values - these are all\ndriven by the environment's configuration processing capabilities:\n\n- Upper/Lower case is important\n\n- Changes made to a section will only apply to processing of that\nsection's corresponding data file\n\n- Don't use quotes unless absolutely necessary to support trailing\nblanks in field names (I don't know why some systems generate field\nnames with trailing blanks, but they do). Spaces between words are fine,\nso values with intra-word blank spaces do not require quotes. If you use\nquotes, the quotes get included in the value string.\n\nIf you absolutely\nhave to use quotes, for the trailing blanks, make use of the following\ndirectives in the config file (if you're using single quotes'). These allow\nthe program to trim the quotes, while maintaining the trailing blanks:\n\n    TRIM_QUOTES = yes\n    QUOTE_CHAR = '\n\n\nInstallation\n----------------------\n\nGrip Attendance currently supports [Python 3.x](https://www.python.org/downloads/).\n\nWe recommend installing with pip, which should be bundled with Python3.\nHowever, if it's missing, pip can be installed from\n[pip](https://pip.pypa.io/en/latest/).\n\nThe most straightforward install, if Python3 is your default environment is:\n\n    pip install grip-attendance\n\nIf you have multiple versions of Python on your machine, the above will use\nyour default Python version. If your default is not set to Python3, you might\nwant to try:\n\n    pip3 install grip-attendance\n\nAnother alternative is to try:\n\n    python3 -m pip install grip-attendance\n\nIf you're upgrading:\n\n    python3 -m pip install --upgrade grip-attendance\n\nThis will install the `grip-attendance` executable on your search path,\nexcept for some MS-Windows installations.\n\nFor MS-Windows, I had to manually add:\n\n    ;C:\\Python34;C:\\Python34\\Scripts;\n\nto the PATH environment variable (before the corresponding entries for\nPython27) to get pip to work correctly.\n\nIf you don't have pip, you can install the program  manually by cloning\nthe code and running the install script:\n\n    git clone git@github.com:GripQA/grip-attendance.git\n    cd grip-attendance\n    python setup.py install\n\nOf course, you can always simply grab the 'grip-attendance.py' file (see\nbelow for a discussion of downloading single files from GitHub) and\nplace it in a directory that's on your search path.\n\nImportant Files\n----------------------\n\nMany of the files in the repo are related to infrastructure and supporting\nthe pip distribution. The important files are:\n\n- grip-attendance.py - the program file\n- grip_registration.csv - sample event registration list\n- grip_attendees.csv - sample event attendee list\n- grip_sample.cfg - sample configuration file to support the above lists\n- README.md & README.txt - two versions of the README, one for GitHub and one\nfor easier reading in a local repo.\n- LICENSE - text of the Apache License used for this project\n\nIf you're downloading the program with pip, the repo URL is:\n\n    https://github.com/GripQA/grip-attendance\n\nThe above mentioned files can be downloaded as part of a clone, or individual\nfiles can be downloaded by following the instructions at:\nhttp://stackoverflow.com/a/13593430/3363628  Note that different browsers and\noperating systems may have different methods for downloading single files.\n\nSupport\n----------------------\n\nIf you have any questions, problems, or suggestions, please submit an issue at\nhttps://github.com/GripQA/grip-attendance/issues or contact us at support@grip.qa.\n\nLicense & Copyright\n----------------------\n\nCopyright 2015 Grip QA\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n    http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.", "description_content_type": null, "docs_url": null, "download_url": "https://github.com/GripQA/grip-attendance/tarball/0.5", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/GripQA/grip-attendance", "keywords": "attendance,webinar,meetings,registration,attendee", "license": "UNKNOWN", "maintainer": null, "maintainer_email": null, "name": "grip-attendance", "package_url": "https://pypi.org/project/grip-attendance/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/grip-attendance/", "project_urls": {"Download": "https://github.com/GripQA/grip-attendance/tarball/0.5", "Homepage": "https://github.com/GripQA/grip-attendance"}, "release_url": "https://pypi.org/project/grip-attendance/0.5/", "requires_dist": null, "requires_python": null, "summary": "Program to generate an attendance report for an event", "version": "0.5", "yanked": false, "html_description": "<div class=\"project-description\">\n            grip-attendance.py<br>=========================<br><br>Introduction / Description<br>----------------------<br><br>Grip QA's grip-attendance.py tool allows you to easily track and report on<br>the attendance at your event.<br><br>The program matches individuals from the actual attendee report to the<br>individuals who registered for your event. It generates a new list, based on<br>the registration list, that shows which registrants attended the event,<br>which ones did not attend and which attendees did not register (assuming<br>that you allow un-registered individuals to participate in your events.<br><br>We've generally used this tool for tracking the engagement with our<br>webcasts, but it should be applicable to any event that provides you with a<br>registration list and an attendee list, both in CSV format.<br><br>Command Line Usage<br>----------------------<br><br>USAGE:  grip-attendance.py reg_list.csv attend_list.csv [config_file.cfg]<br>   or:  grip-attendance.py -[Hh][elp]<br>   or:  grip-attendance.py -[Gg][en] new_config_file.cfg<br><br>Help Text<br>----------------------<br><br>For normal operation, you must provide the relative pathnames for, at<br>least the two input data files (.csv):<br>    &lt;reg_list.csv&gt; - CSV file with registration data.<br>    &lt;attend_list.csv&gt; - CSV file containing actual attendee data.<br><br>Optionally, you can also provide the path for a configuration file<br>(.cfg). If you choose not to explicitly specify a config file, the<br>program will look for the fixed default config file: \"attendance.cfg\",<br>in the current working directory. If no default config file is<br>available, the program uses pre-defined default values.<br><br>The attendance file generated will have the same base name as the the<br>registration list file, with \"_attendance\" appended to the basename (if<br>the registration file name is \"reg_list.csv\", the attendance report will<br>be named \"reg_list_attendance.csv\")<br><br>- -[Hh][elp] - \"-H\" (in either case), optionally followed by \"elp\" (-help)<br>will result in this message being displayed.<br><br>- -[Gg][en] - \"-G\" (in either case), optionally followed by \"en\"<br>accompanied by a mandatory pathname (-gen config-path.cfg) will cause<br>the program to generate a template config file that you can customize<br>for your registration and attendee list formats.<br>The configuration file provides a way to customize the execution of the<br>program. The current version focuses on providing a way to identify the<br>field names in your data to the program.<br><br>Configuration File<br>----------------------<br><br>We've made an attempt to provide reasonable defaults, but we recognize<br>that these will not apply to all situations, if the defaults don't work<br>for you, the configuration file will be your friend<br><br>In addition to the built-in defaults, there are two methods for you to<br>specify configuration information. You can create a file called<br>attendance.cfg and place it in the directory that you'll be working in.<br>This is probably a good mechanism if you're generally working in a<br>single directory and if your input data files have stable column<br>headings. You can also specify a configuration file pathname on the<br>command line.<br><br>There are two user \"Sections\" in the configuration file that you should<br>be aware of: [REGISTRANTS] and [ATTENDEES], the former specifies field<br>names for the registration data file, while the latter gives field names<br>for the actual attendee data file (there's actually a third [DEFAULT]<br>section, but you should really understand how configuration files are<br>interpreted before you mess with it.<br><br>The most straight forward way to get a new configuration file is to run<br>this script as:<br><br>    grip-attendance.py -Gen new_config_file.cfg<br><br>where \"new_config_file.cfg\" is the pathname for the generated configuration<br>file. This will create a new configuration file with all of the default values<br>filled in for each section. Customization is then a simple matter of <br>changing the values on the right hand side of the = sign.<br><br>Some things to note about configuration file values - these are all<br>driven by the environment's configuration processing capabilities:<br><br>- Upper/Lower case is important<br><br>- Changes made to a section will only apply to processing of that<br>section's corresponding data file<br><br>- Don't use quotes unless absolutely necessary to support trailing<br>blanks in field names (I don't know why some systems generate field<br>names with trailing blanks, but they do). Spaces between words are fine,<br>so values with intra-word blank spaces do not require quotes. If you use<br>quotes, the quotes get included in the value string.<br><br>If you absolutely<br>have to use quotes, for the trailing blanks, make use of the following<br>directives in the config file (if you're using single quotes'). These allow<br>the program to trim the quotes, while maintaining the trailing blanks:<br><br>    TRIM_QUOTES = yes<br>    QUOTE_CHAR = '<br><br><br>Installation<br>----------------------<br><br>Grip Attendance currently supports [Python 3.x](https://www.python.org/downloads/).<br><br>We recommend installing with pip, which should be bundled with Python3.<br>However, if it's missing, pip can be installed from<br>[pip](https://pip.pypa.io/en/latest/).<br><br>The most straightforward install, if Python3 is your default environment is:<br><br>    pip install grip-attendance<br><br>If you have multiple versions of Python on your machine, the above will use<br>your default Python version. If your default is not set to Python3, you might<br>want to try:<br><br>    pip3 install grip-attendance<br><br>Another alternative is to try:<br><br>    python3 -m pip install grip-attendance<br><br>If you're upgrading:<br><br>    python3 -m pip install --upgrade grip-attendance<br><br>This will install the `grip-attendance` executable on your search path,<br>except for some MS-Windows installations.<br><br>For MS-Windows, I had to manually add:<br><br>    ;C:\\Python34;C:\\Python34\\Scripts;<br><br>to the PATH environment variable (before the corresponding entries for<br>Python27) to get pip to work correctly.<br><br>If you don't have pip, you can install the program  manually by cloning<br>the code and running the install script:<br><br>    git clone git@github.com:GripQA/grip-attendance.git<br>    cd grip-attendance<br>    python setup.py install<br><br>Of course, you can always simply grab the 'grip-attendance.py' file (see<br>below for a discussion of downloading single files from GitHub) and<br>place it in a directory that's on your search path.<br><br>Important Files<br>----------------------<br><br>Many of the files in the repo are related to infrastructure and supporting<br>the pip distribution. The important files are:<br><br>- grip-attendance.py - the program file<br>- grip_registration.csv - sample event registration list<br>- grip_attendees.csv - sample event attendee list<br>- grip_sample.cfg - sample configuration file to support the above lists<br>- README.md &amp; README.txt - two versions of the README, one for GitHub and one<br>for easier reading in a local repo.<br>- LICENSE - text of the Apache License used for this project<br><br>If you're downloading the program with pip, the repo URL is:<br><br>    https://github.com/GripQA/grip-attendance<br><br>The above mentioned files can be downloaded as part of a clone, or individual<br>files can be downloaded by following the instructions at:<br>http://stackoverflow.com/a/13593430/3363628  Note that different browsers and<br>operating systems may have different methods for downloading single files.<br><br>Support<br>----------------------<br><br>If you have any questions, problems, or suggestions, please submit an issue at<br>https://github.com/GripQA/grip-attendance/issues or contact us at support@grip.qa.<br><br>License &amp; Copyright<br>----------------------<br><br>Copyright 2015 Grip QA<br><br>Licensed under the Apache License, Version 2.0 (the \"License\");<br>you may not use this file except in compliance with the License.<br>You may obtain a copy of the License at<br><br>    http://www.apache.org/licenses/LICENSE-2.0<br><br>Unless required by applicable law or agreed to in writing, software<br>distributed under the License is distributed on an \"AS IS\" BASIS,<br>WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.<br>See the License for the specific language governing permissions and<br>limitations under the License.\n          </div>"}, "last_serial": 1653702, "releases": {"0.5": [{"comment_text": "", "digests": {"md5": "04963f4c9190de166c213ba0a75a6a27", "sha256": "fe7364646efe362f9c195d121a5eaac4a4f7b2b40e60b580571eefa9b657723a"}, "downloads": -1, "filename": "grip-attendance-0.5.tar.gz", "has_sig": false, "md5_digest": "04963f4c9190de166c213ba0a75a6a27", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12354, "upload_time": "2015-07-28T17:20:58", "upload_time_iso_8601": "2015-07-28T17:20:58.945976Z", "url": "https://files.pythonhosted.org/packages/30/23/74c4cb0cf4e3749946e86f58ea4d2813525ee3c6a59be025ca7eae6bef2e/grip-attendance-0.5.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "04963f4c9190de166c213ba0a75a6a27", "sha256": "fe7364646efe362f9c195d121a5eaac4a4f7b2b40e60b580571eefa9b657723a"}, "downloads": -1, "filename": "grip-attendance-0.5.tar.gz", "has_sig": false, "md5_digest": "04963f4c9190de166c213ba0a75a6a27", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12354, "upload_time": "2015-07-28T17:20:58", "upload_time_iso_8601": "2015-07-28T17:20:58.945976Z", "url": "https://files.pythonhosted.org/packages/30/23/74c4cb0cf4e3749946e86f58ea4d2813525ee3c6a59be025ca7eae6bef2e/grip-attendance-0.5.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:54:10 2020"}