{"info": {"author": "Justin L. Lanfranchi", "author_email": "jll1062@phys.psu.edu", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License"], "description": "# i3cols\n\nConvert IceCube i3 files to columnar Numpy arrays &amp; operate on them.\n\n## Installation\n\n```\npip install i3cols\n```\n\nif using Python from CVMFS, the above will fail; you must use\n\n```\npip install --user i3cols\n```\n\nand then the installed binary will be located at, e.g., `$HOME/.local/bin/i3cols`; add `$HOME/.local/bin` to your `PATH` to avoid having to type that full path every time (but reset your `PATH` if you switch out of CVMFS)\n\ni3cols has two major pieces: i3 file data extraction and subsequent operations on the extracted data. If all you need to do is the former, and e.g. CVMFS-based Python is having problems installing Numba, you can get away with installing enum34 manually and then using `--no-deps` flag to `pip` such that Numba is not installed:\n\n```\npip install --user enum34\npip install --user --no-deps i3cols\n```\n\n### For developers, or to get the very latest\n\nClone the repository and then perform an editable (`pip install -e`) installation:\n\n```\ngit clone git@github.com:jllanfranchi/i3cols.git\npip install -e ./i3cols\n```\n\n## Examples\n\n### Extracting data from I3 files\n\nAll command-line examples assume you are using BASH; adapt as necessary for your favorite shell.\n\nExtract a few items from all Monte Carlo run 160000 files (nutau GENIE simulation performed for oscNext), concatenating into single column per item:\n\n```bash\nfind /data/ana/LE/oscNext/pass2/genie/level7_v01.04/160000/ -name \"oscNext*.i3*\" | \\\n    i3cols extr_sep \\\n        --keys I3EventHeader I3MCTree I3MCWeightDict '*pulses*' \\\n        --index-and-concatenate-by subrun \\\n        --procs 20 \\\n        --outdir /data/user/jlanfranchi/columnar/genie/level7_v01.04/160000\n        --tempdir /scratch/jlanfranchi\n```\n\nThe above extracts each file within the `160000` directory separately into a sub-directory created in the `--tempdir`. Like columns are concatenated and the final result is placed in `--outdir`. Note that each file is interpreted as a subrun, as is the convention used for oscNext Monte Carlo simulation files. There will be an array called `subrun__categ_index.npy` created within the `--outdir` that identifies where each subrun's events are in the concatenated arrays. Note that the files input to the command are sorted by their subrun prior to being concatenated.\n\nThe `'*pulses*'` is glob-expanded (like `ls *` at the command line) and glob patterns match insensitive to case (while named keys are case-sensitive). You can also specify a file path to `--keys` that contains `\\n`-separated key names and/or glob expressions (and/or other key files paths if you really want to get carried away)\n\nIf you completed the above and realize you also want the `I3GENIEResultDict`, then you can re-run the above but just specify that key (although specifying the above keys in addition to `I3GENIEResultDict` and not specifying the `--overwrite` flag should be no different, as already-extracted items will not be re-extracted). This process should then be much faster:\n\n```bash\nfind /data/ana/LE/oscNext/pass2/genie/level7_v01.04/160000/ -name \"oscNext*.i3*\" | \\\n    i3cols extr_sep \\\n        --keys I3GENIEResultDict \\\n        --index-and-concatenate-by subrun \\\n        --procs 20 \\\n        --outdir /data/user/jlanfranchi/columnar/genie/level7_v01.04/160000\n        --tempdir /scratch/jlanfranchi\n```\n\nExtract all keys from IC86.11 season except any key with the word \"pulses\" in it (glob patterns are matched ignoring case). All subrun files for a given run are combined transparently into one and then all runs are combined in the end into monolithic columns, with a `run__categ_index.npy` created in `outdir` that indexes the columns by run:\n\n```bash\ni3cols extr_season \\\n    --exclude-keys '*pulses*' \\\n    --index-and-concatenate \\\n    --gcd /tmp/i3/data/level7_v01.04/IC86.11/ \\\n    --outdir /tmp/columnar/data/level7_v01.04/IC86.11 \\\n    --compress \\\n    --procs 20 \\\n    /data/ana/LE/oscNext/pass2/data/level7_v01.04/IC86.11\n```\n\nMore notes on the above examples:\n\n* You can specify paths for extraction directly in the command (the last example), or you can pipe the paths to the function (the first two examples). The former is simple for specifying one or a few paths, but UNIX command lines are limited in total length, so the latter can be the only way to successfully pass all paths to i3cols.\n* Optional compression of the resulting _column directories_ (a _column directory_ is a directory named after an item in the i3 frames, containing 1 or more `.npy` array files) can be performed after the extraction. The column directory is replaced with a `.npz` file. Memory mapping is not possible with `.npz` files, but significant compression ratios are often achievable.\n* Extraction is performed in parallel where possible if `--procs` is provided with an argument > 1.\n\n\n### Working with the extracted data\n\nExtracted data is output to Numpy arrays, possibly with structured Numpy dtypes.\n\n```python\nimport numba\n\nfrom i3cols import cols, phys\n\n@numba.njit(fastmath=True, error_model=\"numpy\")\ndef get_tau_info(data, index):\n    \"\"\"Return indices of events which exhibit nutau regeneration and return a\n    dict of decay products of primary nutau.\n    \"\"\"\n\n    tau_regen_evt_indices = numba.typed.List()\n    tau_decay_products = numba.typed.Dict()\n    for evt_idx, index_ in enumerate(index):\n        flat_particles = data[index_[\"start\"] : index_[\"stop\"]]\n        for flat_particle in flat_particles:\n            if flat_particle[\"level\"] == 0:\n                if flat_particle[\"particle\"][\"pdg_encoding\"] not in phys.NUTAUS:\n                    break\n            else:\n                pdg = flat_particle[\"particle\"][\"pdg_encoding\"]\n                if flat_particle[\"level\"] == 1:\n                    if pdg not in tau_decay_products:\n                        tau_decay_products[pdg] = 0\n                    tau_decay_products[pdg] += 1\n                if pdg in phys.NUTAUS:\n                    tau_regen_evt_indices.append(evt_idx)\n    return tau_regen_evt_indices, tau_decay_products\n\n\n# Load just the I3MCTree (regardless of presence other columns), memory-mapped \narrays, category_indexes = cols.load(\"/tmp/columnar/genie/level7_v01.04/160000\", keys=\"I3MCTree\", mmap=True)\n\n# Look at the first event's \"flattened\" I3MCTree\ni3mct_data = arrays[\"I3MCTree\"][\"data\"]\ni3mct_idx = arrays[\"I3MCTree\"][\"index\"]\nevt0_i3mct = i3mct_data[slice(*i3mct_idx[0])]\nprint(evt0_i3mct)\n\n# Get the info!\ntau_regen_evt_indices, tau_decay_products = get_tau_info_nb(**arrays[\"I3MCTree\"])\n```\n\n\n## Motivation\n\nIceCube .i3 files are formulated for arbitrary event-by-event processing of \"events.\" The information that comprises an \"event\" can span multiple frames in the file, and the file must be read and written sequentially like linear tape storage (i.e., processing requires a finite state machine). This is well-suited to \"online\" and \"real-time\" processing of events.\n\nAdditionally, the IceTray, which is meant to read, process, and produce .i3 files, can process multiple files but is unwaware of file boundaries, despite the fundamental role that \"number of files\" plays in normalizing IceCube Monte Carlo simulation data.\n\nBeyond collecting data, performing event splitting, and real-time algorithms, analysis often is most efficient and straightforward to work with specific features of events atomically: i.e., in a columnar fashion.\n\nTwo existing options are writing data to ROOT files and HDF5 files. The former requires a learning curve of its own outside of Python/Numpy, though possibly through projects like [Uproot](https://github.com/scikit-hep/uproot), such files could be more practical to use for Python-based analysis. HDF5 files suffer from the inability to be manipulated in parallel from Python and present an unessential layer of complexity around what we actually want and use: Numpy arrays of data.\n\n**i3cols** allows working with IceCube data in columnar fashion without added complexity of libraries beyond Numpy, and both the columnar nature and the simplicity of the data representation allows more straightforward as well as new and novel ways of interacting with data which should be more natural and efficient for many common use-cases in Python/Numpy:\n\n\n### Basics\n\n1. Apply numpy operations directly to data arrays\n2. Extract data columns to pass to machine learning tools directly or at most with simple indexing; e.g., to extract the azimuthal direction of all particles: `particles[\"dir\"][\"azimuth\"]`.\n3. Memory mapping allows chunked operations and arbitrary reading and/or writing to the same arrays from multiple processes (just make sure the processes don't try to write to the same elements).\n4. New levels of processing entail adding new columns, without the need to duplicate all data that came before. This has the disadvantage that cuts that remove the vast majority of events result in columns that have the same number of rows as the pre-cut. However, the advantage to working this way is that it is trivial to go back to the lowest-level of processing and also to inspect how the cuts affect all variables contained at any level of processing. (A future goal is to also accommodate efficiently storing a subset of rows by creating a \"sub-scalar\" column that only contains rows where its or another column's \"valid\" array is True.)\n5. Numpy arrays with structured dtypes can be passed directly to Numba for efficient looping with similar performance to compiled C++ code, as Numba is just-in-time (JIT)-compiled to machine code.\n6. There is no dependency upon IceCube software once data has been extracted. This can be seen as a positive (portability) and a negative (IceCube software has been developed, in part, to perform analysis tasks).\n7. If you think of a new item you want to extract from the source i3 files after already performing an extraction, it is _much_ faster and the process only yields the new column (rather than an entirely new file, as is the case with HDF5 extraction).\n8. Basic operations like transferring specific frame items can be achieved with simple UNIX utilities (`cp`, `rsync`, etc.)\n9. A future goal is to implement versioning with each column that is either explicitly accessible (if desired) or transparent (if desired) to users, such that different processing versions can live side-by-side without affecting one another.\n\n\n### Flattening hierarchies for fast analysis without losing hierarchies\n\n1. Source i3 files are invisible to analysis, if you want (the fact that data came from hundreds of thousands of small i3 files does not slow down analysis or grind cluster storage to a halt). If the concatenated arrays are too large to fit into memory, you can operate on arrays in arbitrary chunks of events and/or work directly on the data on disk via Numpy's built-in memory mapping (which is transparent to Numpy operations).\n2. Source i3 files can be explicitly known to analysis if you want (via the Numpy arrays called in i3cols \"category indexes\").\n3. Flattened data structures allow efficient operations on them. E.g., looking at all pulses is trivial without needing to traverse a hierarchy. But information about the hierarchy is preserved, so operating in that manner is still possible (and still very fast with Numpy and/or Numba).\n\n### Data storage\n\nThere are two kinds of data currently supported:\n\n1. **Scalar data**: One item per event. This includes arbitrarily complex dtypes, including a vector of N of a thing. The only requirement is that every event must also have exactly N of those things. This requires a _data_ array which has one entry per event. \n2. **Vector data**: Zero, one, or more of an item per event. E.g., pulses. This requires both _data_ and _index_ arrays. The index array has one entry per event which indicates the _start_ and _stop_ indices of that event's data. Meanwhile, _data_ can be arbitrarily long.\n\nTo accomodate arbitrary missing or invalid data, there can be an optional _valid_ array alongside the other arrays.\n\nOne **column** consists of the container (either a directory or `.npz` file) and the set of the above arrays it contains. The directory version of this looks on disk like, for example for _InIcePulses_ (which is vector data) with a valid array:\n```\nInIcePulses/\n  |\n  +-- data.npy\n  |\n  +-- valid.npy\n  |\n  +-- index.npy\n```\nIf the above is compressed, it becomes a single `.npz `file: `InIcePulses.npz`. Within the file, the arrays can be accessed via their names \"data\", \"valid\", and/or \"index\". Here, we load all arrays that are present into a dictionary:\n```python\nwith np.load(\"InIcePulses.npz\") as npz:\n    array_d = {name: npz.get(name, None) for name in [\"data\", \"valid\", \"index\"]}\n```\nNote there is a convenience function to do this (and load any category indices) for a single item or for an entire directory, transparent to compression: `arrays, category_indexes = i3cols.cols.load(dirpath)`.\n\n#### Unsupported (or awkwardly supported) data types\n\n1. **Mixture of types**: Scalar data where the item in one event has one type while another event (for that same item) has another type; similarly for vector data where dtype changes either within or across events. E.g., if the datatype contains a different-length-per-event vector as one field within the type (while all other parts of the type are constant-length). This can be accommodated (to varying degrees of inefficiency) by creating a type that contains all fields and just _one_ of the vector type, and then duplicating the fields that remain constant for every value in the vector.\n2. **Many-fewer-than-1 valid item per event**: Suppose you start with simulation of N events and subsequently cut 90% of the simulated events. Operating on and storing all arrays dependent on that cut still uses arrays of length N, when only 10% of the data is valid. This is slower computationally and inefficient in terms of storage in memory and on disk.\n3. **Metadata**: Currently, there is no way to handle this within the scope of i3cols. This is a TOOD item in the future. At least hints--if not complete information--should be stored so that generated columns can be re-generated in the future. Also, things like units of the contained data are valuable to keep with each column. Also there might be useful metadata to keep in the directory-of-columns. And all of this metadata should be kept around when columns are concatenated.\n\n## See Also\n\nThe **i3cols** project was developed independently of but with the [Awkward Array project](https://github.com/scikit-hep/awkward-1.0) in mind. It is an eventual goal that the extraction of arrays and other IceCube-specific things from this project can remain, while the backend storage and manipulation of arrays can be done using that project.\n\nA lower-level library to store data in memory (all data types null-able), [Apache Arrow](https://arrow.apache.org/) and its [Feather file format](https://arrow.apache.org/docs/python/feather.html) for storing on disk could be useful, where the Awkward Array project has been developed with this library in mind as well.\n\nFinally, within IceCube software, the **tableio** module might be adaptable to produce similar output, and if i3cols can include metadata alongside the written arrays, that project has the ability to emit units and other useful metadata. For now, to prove the concept, the extraction part of i3cols is very straightforward (just not \"automatic\") as written, but utilizing tableio should be strongly considered in the future.\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/jllanfranchi/i3cols", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "i3cols", "package_url": "https://pypi.org/project/i3cols/", "platform": "", "project_url": "https://pypi.org/project/i3cols/", "project_urls": {"Homepage": "https://github.com/jllanfranchi/i3cols"}, "release_url": "https://pypi.org/project/i3cols/0.1.4/", "requires_dist": ["numba (>=0.45)"], "requires_python": ">=2.7", "summary": "Numpy columnar storage for IceCube data", "version": "0.1.4", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>i3cols</h1>\n<p>Convert IceCube i3 files to columnar Numpy arrays &amp; operate on them.</p>\n<h2>Installation</h2>\n<pre><code>pip install i3cols\n</code></pre>\n<p>if using Python from CVMFS, the above will fail; you must use</p>\n<pre><code>pip install --user i3cols\n</code></pre>\n<p>and then the installed binary will be located at, e.g., <code>$HOME/.local/bin/i3cols</code>; add <code>$HOME/.local/bin</code> to your <code>PATH</code> to avoid having to type that full path every time (but reset your <code>PATH</code> if you switch out of CVMFS)</p>\n<p>i3cols has two major pieces: i3 file data extraction and subsequent operations on the extracted data. If all you need to do is the former, and e.g. CVMFS-based Python is having problems installing Numba, you can get away with installing enum34 manually and then using <code>--no-deps</code> flag to <code>pip</code> such that Numba is not installed:</p>\n<pre><code>pip install --user enum34\npip install --user --no-deps i3cols\n</code></pre>\n<h3>For developers, or to get the very latest</h3>\n<p>Clone the repository and then perform an editable (<code>pip install -e</code>) installation:</p>\n<pre><code>git clone git@github.com:jllanfranchi/i3cols.git\npip install -e ./i3cols\n</code></pre>\n<h2>Examples</h2>\n<h3>Extracting data from I3 files</h3>\n<p>All command-line examples assume you are using BASH; adapt as necessary for your favorite shell.</p>\n<p>Extract a few items from all Monte Carlo run 160000 files (nutau GENIE simulation performed for oscNext), concatenating into single column per item:</p>\n<pre>find /data/ana/LE/oscNext/pass2/genie/level7_v01.04/160000/ -name <span class=\"s2\">\"oscNext*.i3*\"</span> <span class=\"p\">|</span> <span class=\"se\">\\</span>\n    i3cols extr_sep <span class=\"se\">\\</span>\n        --keys I3EventHeader I3MCTree I3MCWeightDict <span class=\"s1\">'*pulses*'</span> <span class=\"se\">\\</span>\n        --index-and-concatenate-by subrun <span class=\"se\">\\</span>\n        --procs <span class=\"m\">20</span> <span class=\"se\">\\</span>\n        --outdir /data/user/jlanfranchi/columnar/genie/level7_v01.04/160000\n        --tempdir /scratch/jlanfranchi\n</pre>\n<p>The above extracts each file within the <code>160000</code> directory separately into a sub-directory created in the <code>--tempdir</code>. Like columns are concatenated and the final result is placed in <code>--outdir</code>. Note that each file is interpreted as a subrun, as is the convention used for oscNext Monte Carlo simulation files. There will be an array called <code>subrun__categ_index.npy</code> created within the <code>--outdir</code> that identifies where each subrun's events are in the concatenated arrays. Note that the files input to the command are sorted by their subrun prior to being concatenated.</p>\n<p>The <code>'*pulses*'</code> is glob-expanded (like <code>ls *</code> at the command line) and glob patterns match insensitive to case (while named keys are case-sensitive). You can also specify a file path to <code>--keys</code> that contains <code>\\n</code>-separated key names and/or glob expressions (and/or other key files paths if you really want to get carried away)</p>\n<p>If you completed the above and realize you also want the <code>I3GENIEResultDict</code>, then you can re-run the above but just specify that key (although specifying the above keys in addition to <code>I3GENIEResultDict</code> and not specifying the <code>--overwrite</code> flag should be no different, as already-extracted items will not be re-extracted). This process should then be much faster:</p>\n<pre>find /data/ana/LE/oscNext/pass2/genie/level7_v01.04/160000/ -name <span class=\"s2\">\"oscNext*.i3*\"</span> <span class=\"p\">|</span> <span class=\"se\">\\</span>\n    i3cols extr_sep <span class=\"se\">\\</span>\n        --keys I3GENIEResultDict <span class=\"se\">\\</span>\n        --index-and-concatenate-by subrun <span class=\"se\">\\</span>\n        --procs <span class=\"m\">20</span> <span class=\"se\">\\</span>\n        --outdir /data/user/jlanfranchi/columnar/genie/level7_v01.04/160000\n        --tempdir /scratch/jlanfranchi\n</pre>\n<p>Extract all keys from IC86.11 season except any key with the word \"pulses\" in it (glob patterns are matched ignoring case). All subrun files for a given run are combined transparently into one and then all runs are combined in the end into monolithic columns, with a <code>run__categ_index.npy</code> created in <code>outdir</code> that indexes the columns by run:</p>\n<pre>i3cols extr_season <span class=\"se\">\\</span>\n    --exclude-keys <span class=\"s1\">'*pulses*'</span> <span class=\"se\">\\</span>\n    --index-and-concatenate <span class=\"se\">\\</span>\n    --gcd /tmp/i3/data/level7_v01.04/IC86.11/ <span class=\"se\">\\</span>\n    --outdir /tmp/columnar/data/level7_v01.04/IC86.11 <span class=\"se\">\\</span>\n    --compress <span class=\"se\">\\</span>\n    --procs <span class=\"m\">20</span> <span class=\"se\">\\</span>\n    /data/ana/LE/oscNext/pass2/data/level7_v01.04/IC86.11\n</pre>\n<p>More notes on the above examples:</p>\n<ul>\n<li>You can specify paths for extraction directly in the command (the last example), or you can pipe the paths to the function (the first two examples). The former is simple for specifying one or a few paths, but UNIX command lines are limited in total length, so the latter can be the only way to successfully pass all paths to i3cols.</li>\n<li>Optional compression of the resulting <em>column directories</em> (a <em>column directory</em> is a directory named after an item in the i3 frames, containing 1 or more <code>.npy</code> array files) can be performed after the extraction. The column directory is replaced with a <code>.npz</code> file. Memory mapping is not possible with <code>.npz</code> files, but significant compression ratios are often achievable.</li>\n<li>Extraction is performed in parallel where possible if <code>--procs</code> is provided with an argument &gt; 1.</li>\n</ul>\n<h3>Working with the extracted data</h3>\n<p>Extracted data is output to Numpy arrays, possibly with structured Numpy dtypes.</p>\n<pre><span class=\"kn\">import</span> <span class=\"nn\">numba</span>\n\n<span class=\"kn\">from</span> <span class=\"nn\">i3cols</span> <span class=\"kn\">import</span> <span class=\"n\">cols</span><span class=\"p\">,</span> <span class=\"n\">phys</span>\n\n<span class=\"nd\">@numba</span><span class=\"o\">.</span><span class=\"n\">njit</span><span class=\"p\">(</span><span class=\"n\">fastmath</span><span class=\"o\">=</span><span class=\"kc\">True</span><span class=\"p\">,</span> <span class=\"n\">error_model</span><span class=\"o\">=</span><span class=\"s2\">\"numpy\"</span><span class=\"p\">)</span>\n<span class=\"k\">def</span> <span class=\"nf\">get_tau_info</span><span class=\"p\">(</span><span class=\"n\">data</span><span class=\"p\">,</span> <span class=\"n\">index</span><span class=\"p\">):</span>\n    <span class=\"sd\">\"\"\"Return indices of events which exhibit nutau regeneration and return a</span>\n<span class=\"sd\">    dict of decay products of primary nutau.</span>\n<span class=\"sd\">    \"\"\"</span>\n\n    <span class=\"n\">tau_regen_evt_indices</span> <span class=\"o\">=</span> <span class=\"n\">numba</span><span class=\"o\">.</span><span class=\"n\">typed</span><span class=\"o\">.</span><span class=\"n\">List</span><span class=\"p\">()</span>\n    <span class=\"n\">tau_decay_products</span> <span class=\"o\">=</span> <span class=\"n\">numba</span><span class=\"o\">.</span><span class=\"n\">typed</span><span class=\"o\">.</span><span class=\"n\">Dict</span><span class=\"p\">()</span>\n    <span class=\"k\">for</span> <span class=\"n\">evt_idx</span><span class=\"p\">,</span> <span class=\"n\">index_</span> <span class=\"ow\">in</span> <span class=\"nb\">enumerate</span><span class=\"p\">(</span><span class=\"n\">index</span><span class=\"p\">):</span>\n        <span class=\"n\">flat_particles</span> <span class=\"o\">=</span> <span class=\"n\">data</span><span class=\"p\">[</span><span class=\"n\">index_</span><span class=\"p\">[</span><span class=\"s2\">\"start\"</span><span class=\"p\">]</span> <span class=\"p\">:</span> <span class=\"n\">index_</span><span class=\"p\">[</span><span class=\"s2\">\"stop\"</span><span class=\"p\">]]</span>\n        <span class=\"k\">for</span> <span class=\"n\">flat_particle</span> <span class=\"ow\">in</span> <span class=\"n\">flat_particles</span><span class=\"p\">:</span>\n            <span class=\"k\">if</span> <span class=\"n\">flat_particle</span><span class=\"p\">[</span><span class=\"s2\">\"level\"</span><span class=\"p\">]</span> <span class=\"o\">==</span> <span class=\"mi\">0</span><span class=\"p\">:</span>\n                <span class=\"k\">if</span> <span class=\"n\">flat_particle</span><span class=\"p\">[</span><span class=\"s2\">\"particle\"</span><span class=\"p\">][</span><span class=\"s2\">\"pdg_encoding\"</span><span class=\"p\">]</span> <span class=\"ow\">not</span> <span class=\"ow\">in</span> <span class=\"n\">phys</span><span class=\"o\">.</span><span class=\"n\">NUTAUS</span><span class=\"p\">:</span>\n                    <span class=\"k\">break</span>\n            <span class=\"k\">else</span><span class=\"p\">:</span>\n                <span class=\"n\">pdg</span> <span class=\"o\">=</span> <span class=\"n\">flat_particle</span><span class=\"p\">[</span><span class=\"s2\">\"particle\"</span><span class=\"p\">][</span><span class=\"s2\">\"pdg_encoding\"</span><span class=\"p\">]</span>\n                <span class=\"k\">if</span> <span class=\"n\">flat_particle</span><span class=\"p\">[</span><span class=\"s2\">\"level\"</span><span class=\"p\">]</span> <span class=\"o\">==</span> <span class=\"mi\">1</span><span class=\"p\">:</span>\n                    <span class=\"k\">if</span> <span class=\"n\">pdg</span> <span class=\"ow\">not</span> <span class=\"ow\">in</span> <span class=\"n\">tau_decay_products</span><span class=\"p\">:</span>\n                        <span class=\"n\">tau_decay_products</span><span class=\"p\">[</span><span class=\"n\">pdg</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"mi\">0</span>\n                    <span class=\"n\">tau_decay_products</span><span class=\"p\">[</span><span class=\"n\">pdg</span><span class=\"p\">]</span> <span class=\"o\">+=</span> <span class=\"mi\">1</span>\n                <span class=\"k\">if</span> <span class=\"n\">pdg</span> <span class=\"ow\">in</span> <span class=\"n\">phys</span><span class=\"o\">.</span><span class=\"n\">NUTAUS</span><span class=\"p\">:</span>\n                    <span class=\"n\">tau_regen_evt_indices</span><span class=\"o\">.</span><span class=\"n\">append</span><span class=\"p\">(</span><span class=\"n\">evt_idx</span><span class=\"p\">)</span>\n    <span class=\"k\">return</span> <span class=\"n\">tau_regen_evt_indices</span><span class=\"p\">,</span> <span class=\"n\">tau_decay_products</span>\n\n\n<span class=\"c1\"># Load just the I3MCTree (regardless of presence other columns), memory-mapped </span>\n<span class=\"n\">arrays</span><span class=\"p\">,</span> <span class=\"n\">category_indexes</span> <span class=\"o\">=</span> <span class=\"n\">cols</span><span class=\"o\">.</span><span class=\"n\">load</span><span class=\"p\">(</span><span class=\"s2\">\"/tmp/columnar/genie/level7_v01.04/160000\"</span><span class=\"p\">,</span> <span class=\"n\">keys</span><span class=\"o\">=</span><span class=\"s2\">\"I3MCTree\"</span><span class=\"p\">,</span> <span class=\"n\">mmap</span><span class=\"o\">=</span><span class=\"kc\">True</span><span class=\"p\">)</span>\n\n<span class=\"c1\"># Look at the first event's \"flattened\" I3MCTree</span>\n<span class=\"n\">i3mct_data</span> <span class=\"o\">=</span> <span class=\"n\">arrays</span><span class=\"p\">[</span><span class=\"s2\">\"I3MCTree\"</span><span class=\"p\">][</span><span class=\"s2\">\"data\"</span><span class=\"p\">]</span>\n<span class=\"n\">i3mct_idx</span> <span class=\"o\">=</span> <span class=\"n\">arrays</span><span class=\"p\">[</span><span class=\"s2\">\"I3MCTree\"</span><span class=\"p\">][</span><span class=\"s2\">\"index\"</span><span class=\"p\">]</span>\n<span class=\"n\">evt0_i3mct</span> <span class=\"o\">=</span> <span class=\"n\">i3mct_data</span><span class=\"p\">[</span><span class=\"nb\">slice</span><span class=\"p\">(</span><span class=\"o\">*</span><span class=\"n\">i3mct_idx</span><span class=\"p\">[</span><span class=\"mi\">0</span><span class=\"p\">])]</span>\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">evt0_i3mct</span><span class=\"p\">)</span>\n\n<span class=\"c1\"># Get the info!</span>\n<span class=\"n\">tau_regen_evt_indices</span><span class=\"p\">,</span> <span class=\"n\">tau_decay_products</span> <span class=\"o\">=</span> <span class=\"n\">get_tau_info_nb</span><span class=\"p\">(</span><span class=\"o\">**</span><span class=\"n\">arrays</span><span class=\"p\">[</span><span class=\"s2\">\"I3MCTree\"</span><span class=\"p\">])</span>\n</pre>\n<h2>Motivation</h2>\n<p>IceCube .i3 files are formulated for arbitrary event-by-event processing of \"events.\" The information that comprises an \"event\" can span multiple frames in the file, and the file must be read and written sequentially like linear tape storage (i.e., processing requires a finite state machine). This is well-suited to \"online\" and \"real-time\" processing of events.</p>\n<p>Additionally, the IceTray, which is meant to read, process, and produce .i3 files, can process multiple files but is unwaware of file boundaries, despite the fundamental role that \"number of files\" plays in normalizing IceCube Monte Carlo simulation data.</p>\n<p>Beyond collecting data, performing event splitting, and real-time algorithms, analysis often is most efficient and straightforward to work with specific features of events atomically: i.e., in a columnar fashion.</p>\n<p>Two existing options are writing data to ROOT files and HDF5 files. The former requires a learning curve of its own outside of Python/Numpy, though possibly through projects like <a href=\"https://github.com/scikit-hep/uproot\" rel=\"nofollow\">Uproot</a>, such files could be more practical to use for Python-based analysis. HDF5 files suffer from the inability to be manipulated in parallel from Python and present an unessential layer of complexity around what we actually want and use: Numpy arrays of data.</p>\n<p><strong>i3cols</strong> allows working with IceCube data in columnar fashion without added complexity of libraries beyond Numpy, and both the columnar nature and the simplicity of the data representation allows more straightforward as well as new and novel ways of interacting with data which should be more natural and efficient for many common use-cases in Python/Numpy:</p>\n<h3>Basics</h3>\n<ol>\n<li>Apply numpy operations directly to data arrays</li>\n<li>Extract data columns to pass to machine learning tools directly or at most with simple indexing; e.g., to extract the azimuthal direction of all particles: <code>particles[\"dir\"][\"azimuth\"]</code>.</li>\n<li>Memory mapping allows chunked operations and arbitrary reading and/or writing to the same arrays from multiple processes (just make sure the processes don't try to write to the same elements).</li>\n<li>New levels of processing entail adding new columns, without the need to duplicate all data that came before. This has the disadvantage that cuts that remove the vast majority of events result in columns that have the same number of rows as the pre-cut. However, the advantage to working this way is that it is trivial to go back to the lowest-level of processing and also to inspect how the cuts affect all variables contained at any level of processing. (A future goal is to also accommodate efficiently storing a subset of rows by creating a \"sub-scalar\" column that only contains rows where its or another column's \"valid\" array is True.)</li>\n<li>Numpy arrays with structured dtypes can be passed directly to Numba for efficient looping with similar performance to compiled C++ code, as Numba is just-in-time (JIT)-compiled to machine code.</li>\n<li>There is no dependency upon IceCube software once data has been extracted. This can be seen as a positive (portability) and a negative (IceCube software has been developed, in part, to perform analysis tasks).</li>\n<li>If you think of a new item you want to extract from the source i3 files after already performing an extraction, it is <em>much</em> faster and the process only yields the new column (rather than an entirely new file, as is the case with HDF5 extraction).</li>\n<li>Basic operations like transferring specific frame items can be achieved with simple UNIX utilities (<code>cp</code>, <code>rsync</code>, etc.)</li>\n<li>A future goal is to implement versioning with each column that is either explicitly accessible (if desired) or transparent (if desired) to users, such that different processing versions can live side-by-side without affecting one another.</li>\n</ol>\n<h3>Flattening hierarchies for fast analysis without losing hierarchies</h3>\n<ol>\n<li>Source i3 files are invisible to analysis, if you want (the fact that data came from hundreds of thousands of small i3 files does not slow down analysis or grind cluster storage to a halt). If the concatenated arrays are too large to fit into memory, you can operate on arrays in arbitrary chunks of events and/or work directly on the data on disk via Numpy's built-in memory mapping (which is transparent to Numpy operations).</li>\n<li>Source i3 files can be explicitly known to analysis if you want (via the Numpy arrays called in i3cols \"category indexes\").</li>\n<li>Flattened data structures allow efficient operations on them. E.g., looking at all pulses is trivial without needing to traverse a hierarchy. But information about the hierarchy is preserved, so operating in that manner is still possible (and still very fast with Numpy and/or Numba).</li>\n</ol>\n<h3>Data storage</h3>\n<p>There are two kinds of data currently supported:</p>\n<ol>\n<li><strong>Scalar data</strong>: One item per event. This includes arbitrarily complex dtypes, including a vector of N of a thing. The only requirement is that every event must also have exactly N of those things. This requires a <em>data</em> array which has one entry per event.</li>\n<li><strong>Vector data</strong>: Zero, one, or more of an item per event. E.g., pulses. This requires both <em>data</em> and <em>index</em> arrays. The index array has one entry per event which indicates the <em>start</em> and <em>stop</em> indices of that event's data. Meanwhile, <em>data</em> can be arbitrarily long.</li>\n</ol>\n<p>To accomodate arbitrary missing or invalid data, there can be an optional <em>valid</em> array alongside the other arrays.</p>\n<p>One <strong>column</strong> consists of the container (either a directory or <code>.npz</code> file) and the set of the above arrays it contains. The directory version of this looks on disk like, for example for <em>InIcePulses</em> (which is vector data) with a valid array:</p>\n<pre><code>InIcePulses/\n  |\n  +-- data.npy\n  |\n  +-- valid.npy\n  |\n  +-- index.npy\n</code></pre>\n<p>If the above is compressed, it becomes a single <code>.npz</code>file: <code>InIcePulses.npz</code>. Within the file, the arrays can be accessed via their names \"data\", \"valid\", and/or \"index\". Here, we load all arrays that are present into a dictionary:</p>\n<pre><span class=\"k\">with</span> <span class=\"n\">np</span><span class=\"o\">.</span><span class=\"n\">load</span><span class=\"p\">(</span><span class=\"s2\">\"InIcePulses.npz\"</span><span class=\"p\">)</span> <span class=\"k\">as</span> <span class=\"n\">npz</span><span class=\"p\">:</span>\n    <span class=\"n\">array_d</span> <span class=\"o\">=</span> <span class=\"p\">{</span><span class=\"n\">name</span><span class=\"p\">:</span> <span class=\"n\">npz</span><span class=\"o\">.</span><span class=\"n\">get</span><span class=\"p\">(</span><span class=\"n\">name</span><span class=\"p\">,</span> <span class=\"kc\">None</span><span class=\"p\">)</span> <span class=\"k\">for</span> <span class=\"n\">name</span> <span class=\"ow\">in</span> <span class=\"p\">[</span><span class=\"s2\">\"data\"</span><span class=\"p\">,</span> <span class=\"s2\">\"valid\"</span><span class=\"p\">,</span> <span class=\"s2\">\"index\"</span><span class=\"p\">]}</span>\n</pre>\n<p>Note there is a convenience function to do this (and load any category indices) for a single item or for an entire directory, transparent to compression: <code>arrays, category_indexes = i3cols.cols.load(dirpath)</code>.</p>\n<h4>Unsupported (or awkwardly supported) data types</h4>\n<ol>\n<li><strong>Mixture of types</strong>: Scalar data where the item in one event has one type while another event (for that same item) has another type; similarly for vector data where dtype changes either within or across events. E.g., if the datatype contains a different-length-per-event vector as one field within the type (while all other parts of the type are constant-length). This can be accommodated (to varying degrees of inefficiency) by creating a type that contains all fields and just <em>one</em> of the vector type, and then duplicating the fields that remain constant for every value in the vector.</li>\n<li><strong>Many-fewer-than-1 valid item per event</strong>: Suppose you start with simulation of N events and subsequently cut 90% of the simulated events. Operating on and storing all arrays dependent on that cut still uses arrays of length N, when only 10% of the data is valid. This is slower computationally and inefficient in terms of storage in memory and on disk.</li>\n<li><strong>Metadata</strong>: Currently, there is no way to handle this within the scope of i3cols. This is a TOOD item in the future. At least hints--if not complete information--should be stored so that generated columns can be re-generated in the future. Also, things like units of the contained data are valuable to keep with each column. Also there might be useful metadata to keep in the directory-of-columns. And all of this metadata should be kept around when columns are concatenated.</li>\n</ol>\n<h2>See Also</h2>\n<p>The <strong>i3cols</strong> project was developed independently of but with the <a href=\"https://github.com/scikit-hep/awkward-1.0\" rel=\"nofollow\">Awkward Array project</a> in mind. It is an eventual goal that the extraction of arrays and other IceCube-specific things from this project can remain, while the backend storage and manipulation of arrays can be done using that project.</p>\n<p>A lower-level library to store data in memory (all data types null-able), <a href=\"https://arrow.apache.org/\" rel=\"nofollow\">Apache Arrow</a> and its <a href=\"https://arrow.apache.org/docs/python/feather.html\" rel=\"nofollow\">Feather file format</a> for storing on disk could be useful, where the Awkward Array project has been developed with this library in mind as well.</p>\n<p>Finally, within IceCube software, the <strong>tableio</strong> module might be adaptable to produce similar output, and if i3cols can include metadata alongside the written arrays, that project has the ability to emit units and other useful metadata. For now, to prove the concept, the extraction part of i3cols is very straightforward (just not \"automatic\") as written, but utilizing tableio should be strongly considered in the future.</p>\n\n          </div>"}, "last_serial": 7121647, "releases": {"0.1.3": [{"comment_text": "", "digests": {"md5": "db4dbefdc60aa365e6c85a516fbab00d", "sha256": "14721c86dbbcec9257cbbbba10d16d4563bec9dcf700b114013b0c7cef705eb1"}, "downloads": -1, "filename": "i3cols-0.1.3-py3-none-any.whl", "has_sig": false, "md5_digest": "db4dbefdc60aa365e6c85a516fbab00d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=2.7", "size": 59737, "upload_time": "2020-04-14T16:45:14", "upload_time_iso_8601": "2020-04-14T16:45:14.429583Z", "url": "https://files.pythonhosted.org/packages/db/82/e98285d7e2d381ba49b6182739442f2b4b39d8823163d8b3c25f0e009e2f/i3cols-0.1.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "44f8802b0db68557110281e8bd9835c2", "sha256": "a27f5775ff352630d2b2020ac1946f81843f34af736970cb3dff7f6f786c787e"}, "downloads": -1, "filename": "i3cols-0.1.3.tar.gz", "has_sig": false, "md5_digest": "44f8802b0db68557110281e8bd9835c2", "packagetype": "sdist", "python_version": "source", "requires_python": ">=2.7", "size": 62861, "upload_time": "2020-04-14T16:45:16", "upload_time_iso_8601": "2020-04-14T16:45:16.252383Z", "url": "https://files.pythonhosted.org/packages/47/04/b8f0791a5eb29fb25544ee6c5de3fc9f46199bd086dedb837192a8fe638f/i3cols-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "43e964058c0c3b52f643bed96cf11886", "sha256": "e5c857048023a74b5b961d66c0cfe1b4501460a07bb08f0e4d298d783077ec77"}, "downloads": -1, "filename": "i3cols-0.1.4-py3-none-any.whl", "has_sig": false, "md5_digest": "43e964058c0c3b52f643bed96cf11886", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=2.7", "size": 72835, "upload_time": "2020-04-28T16:49:28", "upload_time_iso_8601": "2020-04-28T16:49:28.134938Z", "url": "https://files.pythonhosted.org/packages/04/91/afa87d3bf3a4b60c30801563dfea38e035faa85da43f7507c2365736e449/i3cols-0.1.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "afb258189aa31f5f53870851e01f1efb", "sha256": "85920d5f9c011f2678b0703de423c2236aa18cf1b2f577931af3042757aecd2c"}, "downloads": -1, "filename": "i3cols-0.1.4.tar.gz", "has_sig": false, "md5_digest": "afb258189aa31f5f53870851e01f1efb", "packagetype": "sdist", "python_version": "source", "requires_python": ">=2.7", "size": 74513, "upload_time": "2020-04-28T16:49:29", "upload_time_iso_8601": "2020-04-28T16:49:29.589329Z", "url": "https://files.pythonhosted.org/packages/1e/76/4e9a1c91e2cb33db1a78d5dac35381072fff473e87d919d6d7b0403d75be/i3cols-0.1.4.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "43e964058c0c3b52f643bed96cf11886", "sha256": "e5c857048023a74b5b961d66c0cfe1b4501460a07bb08f0e4d298d783077ec77"}, "downloads": -1, "filename": "i3cols-0.1.4-py3-none-any.whl", "has_sig": false, "md5_digest": "43e964058c0c3b52f643bed96cf11886", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=2.7", "size": 72835, "upload_time": "2020-04-28T16:49:28", "upload_time_iso_8601": "2020-04-28T16:49:28.134938Z", "url": "https://files.pythonhosted.org/packages/04/91/afa87d3bf3a4b60c30801563dfea38e035faa85da43f7507c2365736e449/i3cols-0.1.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "afb258189aa31f5f53870851e01f1efb", "sha256": "85920d5f9c011f2678b0703de423c2236aa18cf1b2f577931af3042757aecd2c"}, "downloads": -1, "filename": "i3cols-0.1.4.tar.gz", "has_sig": false, "md5_digest": "afb258189aa31f5f53870851e01f1efb", "packagetype": "sdist", "python_version": "source", "requires_python": ">=2.7", "size": 74513, "upload_time": "2020-04-28T16:49:29", "upload_time_iso_8601": "2020-04-28T16:49:29.589329Z", "url": "https://files.pythonhosted.org/packages/1e/76/4e9a1c91e2cb33db1a78d5dac35381072fff473e87d919d6d7b0403d75be/i3cols-0.1.4.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:49:22 2020"}