{"info": {"author": "Tim Savannah", "author_email": "kata198@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "License :: OSI Approved :: GNU Lesser General Public License v2 (LGPLv2)", "Programming Language :: Python", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Topic :: Database :: Front-Ends", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "IndexedRedis\n============\n\nA redis-backed very very fast ORM-style framework that supports indexes. It performs searches with O(1) efficency!\n\nYou can store and fetch native python types (lists, objects, strings, integers, etc.).\n\nIndexedRedis supports both \"equals\" and \"not-equals\" operators for comparison. It also provides full atomic support for replacing entire datasets (based on model), which is useful for providing a fast frontend for SQL. In that use-case, a task that runs on an interval would fetch/calculate datasets from the SQL backend, and do an atomic replace on the datasets the front-end would query.\n\n\nIndexedRedis since 6.0.0 also provides support for Foreign references ( like a foreign key one-to-many, many-to-one, or many-to-many relationship in SQL ) which allow you to directly convert your SQL models into Redis models for vastly improved performance.\n\n\nFurther client-side filtering (like greater-than, contains, etc) is available after the data has been fetched (see \"Filter Results\" below)\n\nMy tests have shown that for using equivalent models between flask/mysql and IndexedRedis, a 600% - 1200% performance increase occurs, yet if you design your storage directly as IndexedRedis models, you are able to achieve much higher gains.\n\nIt is compatible with python 2.7 and python 3. It has been tested with python 2.7, 3.4, 3.5, 3.6.\n\n\n5.0 Status\n----------\n\nVersion 5.0.0 will be somewhat **backwards incompatible with previous versions** by removing some old legacy stuff, improving a lot of existing things, and changing some behaviour.\n\nYou can get an overview of the steps needed to convert your code with the conversion guide, found at https://github.com/kata198/indexedredis/blob/5.0branch/CONVERTING_TO_5.0.0\n\nFull details of changes, as well as enhancements and bug fixes omitted from the conversion guide can be found in the 5.0.0 Changelog: https://github.com/kata198/indexedredis/blob/5.0branch/Changelog\n\n\nAutomatic and Native Types\n--------------------------\n\nSince 4.0, IndexedRedis supports defining fields which will automatically be converted to/from native python types (such as int, float, datetime), as well as anything that can be represented with json (dicts, lists) or objects that support pickling. You just provide the type in its native format, and all the conversion happens behind the scenes. When fetched, the object returned also contains fields in their native types.\n\nIndexedRedis also supports more advanced features such as automatically pickling/unpickling fields, compression/decompression, base64 encoding/decoding, and even defining your own custom field types through a standard interface.\n\nSee \"Advanced Fields\" section below for more information.\n\n\nAPI Reference\n-------------\n\nMany, but not all methods and types are convered in this document.\n\nFor full pydoc reference, see:\n\nhttps://pythonhosted.org/indexedredis/\n\nor\n\nhttp://htmlpreview.github.io/?https://github.com/kata198/IndexedRedis/blob/master/doc/IndexedRedis.html?_cache_vers=1\n\n**Below is a quick highlight/overview:**\n\n\nIndexedRedisModel\n-----------------\n\nThis is the type you should extend to define your model.\n\n\n**Example Model:**\n\n        class Song(IndexedRedisModel):\n\n                FIELDS = [ \\\\\n\n                        IRField('artist'),\n\n                        IRField('title'),\n\n                        IRField('album'),\n\n                        IRField('track_number', valueType=int), # Convert automatically to/from int\n\n                        IRField('duration', defaultValue='0:00'),\n\n                        IRField('releaseDate', valueType=datetime.datetime),  # Convert automatically to/from datetime\n\n                        IRField('description'),\n\n                        IRField('copyright'),\n\n                        IRRawField('mp3_data'), # Don't try to encode/decode data\n\n                        IRCompressedField('thumbnail', compressMode='gzip'),      # Compress this field in storage using \"gzip\" compression\n\n            IRField('tags', valueType=list),\n\n            # \"lyrics\" will be a utf-8 unicode value on the object, and will be compressed/decompressed to/from storage\n            IRFieldChain('lyrics', [ IRUnicodeField(encoding='utf-8'), IRCompressedField() ], defaultValue='No lyrics found' ),\n\n                ]\n\n\n                INDEXED_FIELDS = [ \\\\\n                                        'artist',\n\n                                        'title',\n\n                                        'track_number',\n\n                ]\n\n                KEY_NAME = 'Songs'\n\n\n**Model Attributes:**\n\n\n*FIELDS* - REQUIRED. A list of string or IRField objects (or their subclasses) which name the fields that can be used for storage. (see \"Advanced Fields\" section below)\n\n         Example: [IRField('name'), IRField('description'), IRField('model'), IRFixedPointField('Price', 2), IRField('timestamp', valueType=datetime), IRField('remainingStock', valueType=int)]\n\n\n*INDEXED_FIELDS* - A list of strings containing the names of fields that will be indexed. Can only filter on indexed fields. Adds insert/delete time. The names listed here must match the name of a field given in FIELDS.\n\n         Example: ['Name', 'model']\n\n\n*KEY_NAME* - REQUIRED. A unique name name that represents this model. Think of it like a table name.\n\n         Example: 'StoreItems'\n\n\n*REDIS_CONNECTION_PARAMS* - OPTIONAL -  provides the arguments to pass into \"redis.Redis\", to construct a redis object. Here you can define overrides per-model from the default connection params.\n\nSince 5.0.0, define this field ONLY for this model to use an alternate connection than the default. You no longer need to set this on every model.\n\nSee \"Connecting To Redis\" section below for more info.\n\nIf not defined or empty, the default params will be used. If any fields are present, they will override the inherited default connection params.\n\n         Example: {'host' : '192.168.1.1'}\n\n\nAdvanced Fields\n---------------\n\nIndexedRedis since version 4.0 allows you to pass elements of type IRField (extends str) in the FIELDS element.\n\nSince 5.0.0, all fields must extend IRField in some way. Those that do not will generate a deprecated warning, and the field will be converted to an IRClassicField (same as IRField, but defaults to empty string instead of irNull).\n\n\nDoing so allows you to specify certain properties about the field.\n\n\nExample:\n\n        FIELDS = [ IRField('name'), IRField('age', valueType=int), IRField('birthday', valueType=datetime.datetime) ]\n\n**Field Name**\n\nThe first argument is the string of the field name.\n\n**Type**\n\nYou can have a value automatically converted to a certain type on IRField (or use one of the several extending fields)\n\nby passing that type as \"valueType\". (e.x.  IRField('age', valueType=int))\n\nIf you use \"bool\", the values 0 and case insensitive string 'false' will result in False, and 1 or 'true' will result in True.\n\nWhen using floats, consider using IRFixedPointField, which supports indexing and the same representation regardless of platform (unlike \"float\").\n\nfloats to work cross-platform. Use a fixed point number as the string type ( like myFixedPoint = '%2.5f' %( 10.12345 ) )\n\nIRField supports \"valueType\", most other field types deal with a specific type and thus don't have such a parameter.\n\n**NULL Values**\n\nNull values are represented by a static singleton, called \"irNull\" (of type IRNullType).\n\nFor all types except IRClassicField (which has a default of empty string) the default (when unset) value of the field is irNull. This can be changed by passing \"defaultValue=somethingElse\" to the IRField constructor.\n\nirNull does not equal empty string, or anything except another irNull. This is to destinguish say, no int assigned vs int(0)\n\nYou can check a typed field against the \"irNull\" variable found in the IndexedRedis or IndexedRedis.fields.\n\ne.x.\n\n        from IndexedRedis import irNull\n\n..\n\n\n        # Can be used directly in the model filtering\n        notDangerFive = MyModel.objects.filter(dangerLevel__ne=irNull).filter(dangerLevel__ne=5).all()\n\n        # or in results, through Queryable List. Or direct comparison (not shown)\n        myResults = MyModel.objects.filter(something='value').all()\n\n        notDangerFive = myResults.filter(dangerLevel__ne=irNull).filter(dangerLevel__ne=5)\n\n\n**defaultValue**\n\nAll fields (except IRClassicField) support a parameter, given when constructing the IRField object, \"defaultValue\".\n\nFor all fields (except IRClassicField), the value of this parameter defaults to \"irNull\" (see below). For an IRClassicField, the default remains empty string and cannot be changed (to be compatible with plain-string fields pre-5.0.0).\n\n\n**Advanced Types**\n\nThe following are the possible field types, for use within the FIELDS array, and can be imported like \"from IndexedRedis.fields import NAME\":\n\n\n**IRField** - Standard field, takes a name and a \"valueType\", which is a native python type, or any type you create which implements \\_\\_new\\_\\_, taking a signle argument and returning the object. See IndexedRedis/fields/FieldValueTypes for example of how datetime and json are implemented.\n\nWhen no valueType is defined, str/unicode is the type (same as pre-4.0), and default encoding is used (see set/getDefaultIREncoding functions)\n\nIndexable unless type is a json type or float (use IRFixedPointField to index on floats)\n\n\n**IRBase64Field** - Converts to and from Base64.\n\nIndexable.\n\n\n**IRCompressedField** - Automatically compresses before storage and decompresses after retrieval. Argument \"compressMode\" currently supports \"zlib\" (default), \"bz2\", or \"lzma\".\n\nIndexable.\n\n\n**IRFixedPointField** - A floating-point with a fixed number of decimal places. This type supports indexing using floats, whereas IRField(...valueType=float) does not, as different platforms have different accuracies, roundings, etc. Takes a parameter, decimalPlaces (default 5), to define the precision after the decimal point.\n\nIndexable.\n\n\n**IRPickleField** - Automaticly pickles the given object before storage, and unpickles after fetch.\n\nNot indexable because different representation between python2 and 3, and potentially system-dependent changes repr\n\n\n**IRUnicodeField** - Field that takes a parameter, \"encoding\", to define an encoding to use for this field. Use this to support fields with arbitrary encodings, as IRField will use the default encoding for strings.\n\nIndexable\n\n\n**IRBytesField** - Field that forces the data to be \"bytes\", python2 and python3 compatible. If you need python3 only, you can use IRField(valueType=bytes). For no encoding/decoding at all, see IRRawField\n\nIndexable\n\n\n**IRClassicField** - Field that imitates the behaviour of a plain-string entry in FIELDS pre-5.0.0. This field has a default of empty string, and is always encoded/decoded using the defaultIREncoding\n\nIndexable\n\n\n**IRRawField** - Field that is not converted in any, to or from Redis. On fetch this will always be \"bytes\" type (or str in python2). On python3 this is very similar to IRField(...valueType=None), but python2 needs this to store binary data without running into encoding issues.\n\nNot indexable - No decoding\n\n\n**IRForeignLinkField** - Field that provides reference to a different model ( think \"foreign key\" in SQL ). Use this to reference other models from your model. This field links to a single foreign object, or irNull.\n\nTakes the linked model as the \"foreignKey\" argument.\n\n\nsee \"Foreign Links\" section for more info.\n\nIndexable\n\n\n**IRForeignMultiLinkField** - Field that provides reference to a different model ( think \"foreign key\" in SQL) ). Use this to reference multiple other models from your model. This model links to one or more foreign objects, or irNull.\n\nTakes the linked model as the \"foreignKey\" argument.\n\n\nsee \"Foreign Links\" section for more info.\n\nIndexable. Note, filter must contain the full list (either pks, objs, or combination thereof). A \"contains item\"-style filter must be performed client-side.\n\n\n**IRFieldChain** - Chains multiple field types together. Use this, for example, to compress the base64-representation of a value, or to compress utf-16 data. See section below for more details.\n\nIndexable if all chained fields are indexable.\n\n\n**Chaining Multiple Types**\n\n\n\"Chaining\" allows you to apply multiple types on a single field. Say, for example, that you have some utf-16 data that you want to be compressed for storage:\n\nExample:\n\n\n        FIELDS = [ \\\n\n        ...\n\n                IRFieldChain( 'longData', [ IRUnicodeField(encoding='utf-16'), IRCompressedField() ] )\n\n        ]\n\n\nAn IRFieldChain works similar to a regular IRField, the first parameter is the field name, it has an optional \"defaultValue\" parameter.\n\nThe difference is that the second parameter, *chainedFields*, takes a list of other field types.\n\nWhen storing, the value is passed through each type in this list, left-to-right.\n\nWhen fetched, the value retrieved is passed backwards through these chainedFields, right-to-left.\n\nThe output of the leftmost (first) element is what defines the type of data that will be found on the object when accessed.\n\nSo in the above example, \"myObj.longData\" would be a utf-16 string. When going to the database, that utf-16 string will be decoded and then compressed for storage. When fetched, it will be decompressed and then converted back into utf-16.\n\n\nYou can specify a defaultValue on an IRFieldChain by providing \"defaultValue=X\" as an argument to the constructor. If you provide \"defaultValue\" on any of the fields in the chain list, however, it will be ignored.\n\n\n**Hash-Lookups (performance)**\n\n\nIf you want to index/search on very large strings/bytes (such as maybe a genome), IndexedRedis supports hashing the key, i.e. the value will be stored as the value itself, but the key reference used for lookup will be a hash of that string.\n\nThis increases performance, saves network traffic, and shrinks storage requirements.\n\n\nTo do this, set the \"hashIndex\" attribute of an IRField to True.\n\n        FIELDS = [ \\\\\n\n        ...\n\n                IRField ( 'genomeStr', hashIndex=True )\n\n        ]\n\nand that's it! Filter and fetch and all operations remain the same (i.e. you just use the value directly, same as if \"hashIndex\" was False), but behind-the-scenes the lookups will all be done with the MD5 hash of the value.\n\n\n**Converting existing models to/from hashed indexes**\n\n\nIndexedRedis provides helper methods to automatically convert existing unhashed keys to hashed, and also hashed keys back to unhashed.\n\nTo do this, change your IndexedRedisModel accordingly, and then call (for a model class named MyModel):\n\n        MyModel.objects.compat_convertHashedIndexes()\n\nThis will delete both the hashed and non-hashed key-value for any IRField which supports the \"hashIndex\" property.\nIf you just call \"reindex\" and you've changed the property \"hashIndex\" on any field, you'll be left with lingering key-values.\n\nThis function, by default (fetchAll=True) will fetch all records of this paticular model, and operate on them one-by-one. This is more efficient, but if memory constraints are an issue, you can pass fetchAll=False, which will fetch one object, convert indexes, save, then fetch next object. This is slower, but uses less memory.\n\nNOTHING should be using the models while this function is being called (it doesn't make sense anyway to change schema whilst using it).\n\n\nConnecting to Redis\n-------------------\n\nYour connection to Redis should be defined by calling \"setDefaultRedisConnectionParams\" with a dict of { 'host' : 'hostname', 'port' : 6379, 'db' : 0 }.\n\nThe default connection will connect to host at 127.0.0.1, port at 6379, and db at 0. If you don't define any of these fields explicitly, those values will be used for the respective field.\n\n\nThese default params will be used for all models, UNLESS you define REDIS\\_CONNECTION\\_PARAMS on a model to something non-empty, then that model will inherit the default connection parameters, overriding any values with those defined on the model.\n\nIf you need the same model to connect to different Redis instances, you can call \"MyModel.connectAlt\" (where MyModel is your model class) and pass a dict of alternate connection parameters. That function will return a copy of the class that will use the alternate provided connection.\n\n\nModel Validation\n----------------\n\nThe model will be validated the first time an object of that type is instantiated. If there is something invalid in how it is defined, an \"InvalidModelException\" will be raised.\n\n\nUsage\n-----\n\nUsage is very similar to Django or Flask.\n\n**Query:**\n\nCalling .filter or .filterInline builds a query/filter set. Use one of the *Fetch* methods described below to execute a query.\n\n        objects = SomeModel.objects.filter(param1=val).filter(param2=val).all()\n\nSupported fetch types from the database are equals and not-equals. To use a not-equals expression, append \"\\_\\_ne\" to the end of the field name.\n\n        objects = SomeModel.objects.filter(param1=val, param2\\_\\_ne=val2).all()\n\nAll filters are applied on the redis server using hash lookups. All filters of the same type (equals or not equals) are applied in one command to Redis. So applying filters, **no matter how many filters**, is one to two commands total.\n\n\n**Filter Results / client-side filtering:**\n\nThe results from the .all operation is a [QueryableList](https://pypi.python.org/pypi/QueryableList) of all matched objects. The type of each object is the same as the model. You can use a QueryableList same as a normal list, but it can be more powerful than that:\n\nOnce you have fetched the results from Redis, the QueryableList allows you to perform further client-side filtering using any means that QueryableList supports (e.x. gt, contains, in).\n\n\nExample:\n\n        mathTeachers = People.objects.filter(job='Math Teacher').all()\n\n        experiencedMathTeachers = mathTeachers.filter(experienceYears__gte=10) # Get math teachers with greater than or equal to 10 years experience\n\n        cheeseLovingMathTeachers = matchTeachers.filter(likes__splitcontains=(' ', 'cheese')) # Check a space-separated list field, 'likes', and see if it contains 'cheese'\n\n\nSee https://github.com/kata198/QueryableList for more information.\n\n\n\n**Save:**\n\n        obj = SomeModel(field1='value', field2='value')\n        obj.save()\n\n**Delete Using Filters:**\n\n        SomeModel.objects.filter(name='Bad Man').delete()\n\n**Delete Individual Objects:**\n\n        obj.delete()\n\n**Atomic Dataset Replacement:**\n\nThere is also a powerful method called \"reset\" which will **atomically** replace all elements belonging to a model. This is useful for cache-replacement, etc.\n\n        lst = [SomeModel(...), SomeModel(..)]\n\n        SomeModel.reset(lst)\n\nFor example, you could have a SQL backend and a cron job that does complex queries (or just fetches the same models) and does an atomic replace every 5 minutes to get massive performance boosts in your application.\n\n\nFilter objects by SomeModel.objects.filter(key=val, key2=val2) and get objects with .all\n\nExample: SomeModel.objects.filter(name='Tim', colour='purple').filter(number=5).all()\n\n**Get Primary Key:**\n\nSometimes you may want to reference an individual object, via a foreign-key relationship or just to retrieve faster / unique rather than filtering.\n\nEvery object saved has a unique primary key (unique per the model) which can be retrieved by the \"getPk\" method. You can then use this value on exists, get, getMultiple, etc methods.\n\n\n**Fetch Functions**:\n\nBuilding filtersets do not actually fetch any data until one of these are called (see API for a complete list). All of these functions act on current filterset.\n\nExample: matchingObjects = SomeModel.objects.filter(...).all()\n\n        all    - Return all objects matching this filter\n\n        allOnlyFields - Takes a list of fields and only fetches those fields, using current filterset\n\n    allByAge - Return the objects matching this filter, in order from oldest to newest\n\n        delete - Delete objects matching this filter\n\n        count  - Get the count of objects matching this filter\n\n        first  - Get the oldest record with current filters\n\n        last   - Get the newest record with current filters\n\n        random - Get a random element with current filters\n\n        getPrimaryKeys - Gets primary keys associated with current filters\n\n\n**Filter Functions**\n\nThese functions add filters to the current set. \"filter\" returns a copy, \"filterInline\" acts on that object.\n\n        filter - Add additional filters, returning a copy of the filter object (moreFiltered = filtered.filter(key2=val2))\n\n        filterInline - Add additional filters to current filter object.\n\n\n**Global Fetch functions**\n\nThese functions are available on SomeModel.objects and don't use any filters (they get specific objects):\n\n        get - Get a single object by pk\n\n        getMultiple - Get multiple objects by a list of pks\n\n        exists - Tests the existance of an object under a given pk\n\n\n**Model Functions**\n\nActual objects contain methods including:\n\n        save   - Save this object (create if not exist, otherwise update)\n\n        delete - Delete this object\n\n        getUpdatedFields - See changes since last fetch\n\n\n**Update Index**\n\nAs your model changes, you may need to add a field to the INDEXED\\_FIELDS array. If this was an already existing field, you can reindex the models by doing:\n\n        MyModel.objects.reindex()\n\n\nIf, however, you change a field type of an indexable field, you should use the \"reset\" method.\n\n        MyModel.objects.reset( MyModel.objects.all() )\n\n\n**Connecting to multiple Redis instances**\n\nYou may want to use the same model on multiple Redis instances. To do so, use the .connectAlt method on IndexedRedisModel.\n\n        AltConnectionMyModel = MyModel.connectAlt({'host' : 'althost', 'db' : 4})\n\nThe \"connectAlt\" method takes a dict of Redis connection params, and returns a copy of the Model which will point to the alternate Redis.\n\nYou use AltConnectionMyModel just as you would use MyModel.\n\n\nClient-Side Filtering/Methods\n-----------------------------\n\nAfter you retrieve a bunch of objects from redis (by calling .all(), for example), you get an IRQueryableList of the fetched objects.\n\nThis is a smart list, which wraps QueryableList (https://github.com/kata198/QueryableList) and thus allows further filtering using a multitude of more advanced filtering (contains, case-insensitive comparisons, split-filters, etc). See the QueryableList docs for all the available operations.\n\nThese operations will act on the objects AFTER FETCH, but are useful because sometimes you need to filter beyond simple equals or not equals, which are the current limits of the Redis backend.\n\nYou can chain like:\n\n        # Fetch from Redis all objects where field1 is equal to \"something\".\n\n        #  Then, client side, filter where csvData is not null AND when split by comma contains \"someItem\" as an element.\n\n        #  Then, still client side, filter where ( status is in \"pending\" or \"saved\" ) OR lastUpdated is less-than or equal to 700 seconds ago.\n\n        #    (Keep in mind to make sure lastUpdated is an IRField(..valueType=int) or float, else you'll be comparing string)\n\n\n        myObjects = MyModel.objects.filter(field1='something').all().filter(csvData__isnull=False, csvData__splitcontains=(\",\" , \"someItem\")).filterOr(status__in=('pending', 'saved'), lastUpdated__lte(time.time() - 700))\n\n\nSome other methods on an IRQueryableList are:\n\n        * **getModel** - Return the model associated with these objects\n\n        * **delete** - Delete all the objects in this list.\n\n                NOTE: It is more efficent to do\n\n                        MyModel.objects.filter(...).delete()\n\n                Than to do:\n\n                        MyModel.objects.filter(...).all().delete()\n\n                because the latter actually fetches the full objects, then deletes them, whereas the first just deletes the matched items.\n\n                However, sometimes you may want to do additional filtering client-side before deleting, and this supports that.\n\n        * **save** - Save all the objects in this list. If these are all existing objects, then only the fields which changed since fetch will be updated.\n\n        * **reload** - Reloads all the objects in this list, inline. This will fetch the most current data from Redis, and apply them on top of the items.\n\n                The return of this function will be a list with the same indexes as the IRQueryableList. The items will be either a KeyError exception (if the item was deleted on the Redis-side), or a dict of fields that were updated, key as the field name, and value as a tuple of (old value, new value)\n\n        * **refetch** - Fetch again all the objects in this list, and return as a new IRQueryableList. Note, this does NOT perform the filter again, but fetches each of the items based on its internal primary key\n\n\nForeign Links\n-------------\n\nSince IndexedRedis 6.0.0, you can reference instances of models from another model. These are similar to \"foreign keys\" in SQL world.\n\nTwo field types provide this functionality:\n\nIRForeignLinkField - Links to a single instance of another model. This takes as a value irNull (for no linked object), a primary key of an object, or an object itself. Resolution is always to the object itself.\n\nIRForeignMultiLinkField - Links to multiple instances of another model. Unlike in SQL, IndexedRedis can directly do this with a field without the need for an intermediate table. This takes a value irNull (for no linked objects), or a list containing a mixture of primary keys and/or objects. Resolution is a list of referenced objects.\n\n\n**Assigning Reference**\n\nYou can assign either an object which matches the provided foreignModel type associated with the field, or a pk.\n\nSo, if you have an entry in FIELDS like:\n\n        IRForeignLinkField( 'other', foreignModel=OtherModel)\n\n\nthen you can assign a reference like:\n\n        myOtherModel = OtherModel( ... )\n\n        myObj.other = myOtherModel   # If using an IRForeignMultiLinkField, this should be a list instead.\n\nOR\n\n        myOtherModel = OtherModel.objects.filter ( ... ).first()\n\n        myObj.other = myOtherModel.getPk()\n\n\n**Fetching Reference**\n\nBy default, when fetching your model, the primary key(s) of any foreign relation's are fetched along with it.\n\nThe foreign objects themselves are fetched on-access, so if you do:\n\n        myObj = MyModel.objects.filter ( ... ).all()[0] # myObj fetches ONLY the primary key of OtherModel\n\n        otherModel = myObj.other  # At this point (on-access), the entire OtherModel is fetched (using the primary key)\n\n\nThis is the recommended behaviour, as you'll save some time and memory on every objected fetched that you may not need to use.\n\nAlso, if your application doesn't use locking and multiple things could be touching the referenced model, there's much less chance of accidently overwriting or using a stale instance if you fetch on-access instead of at fetch time.\n\nIf, however, you'd like to fetch the foreign link's in the same transaction as your model (and any foreign links on the link, etc. i.e. fetch everything associated) you can pass *cascadeFetch=True* to any of the fetch functions ( like all, first, last, allOnlyFields, etc. ). This will result in complete resolution at fetch time, instead of access-time.\n\n**Removing Reference**\n\nA reference to an IRForeignLinkField can be removed by setting the field value to \"irNull\". So, for example,\n\n        myObj.other = irNull\n\nwill remove the reference.\n\nFor an IRForeignMultiLinkField, you can remove ALL references by setting the field to \"irNull\". You can remove individual references by assinging the field value to a list minus the objects/pks you do not want to include.\n\nNOTE: You MUST assign it this list. You cannot fetch the list, remove an entry, and save an object. You must do it like:\n\n        myRefs = myObj.others\n\n        myRefs.remove( objToRemove ) # or splice, or del\n\n        myObj.others = myRefs  # you MUST assign the property. Just changing the list result from earlier will have no effect.\n\n        myObj.save()\n\n\n**Cascading**\n\nFor several operations ( related to fetching, saving, checking if changes, comparing values ) there are two modes to consider.\n\nThe first is non-cascading. This will cause the operations to ONLY deal with the object-at-hand, including references to foreign objects, but not on the objects themselves.\n\nThe second is cascading. This will cause the operations to cascade, in that they will deal with the object-at-hand, any foreign objects, any of their foreign objects, etc.\n\n\nFor fetch methods ( like .all ) there is a parameter, *cascadeFetch*, default False, which will cause all objects to be resolved at once in a single transaction, instead of the default on-access.\n\n\nFor save methods ( like .save ) there is a parameter, *cascadeSave*, default True, which will cause any unsaved foreign objects to also be saved. This means if you attach an unsaved object via an IRForeignLinkField, and call .save(cascadeSave=True) on the parent, BOTH will be inserted. Also, if you have any changes on a referenced object, and call .save(cascadeSave=True), those changes will be saved.\n\nIf you explicitly call myOBj.save(cascadeSave=False), then only \"myObj\" is saved. If you assigned reference to a foreign object which has been saved (and thus has a primary key), that primary key will be linked. If you assign reference to a foreign object which has NOT been saved, you will NOT have a link. You will need to explicitly save the child first. Also, if a child foreign object has changed values, they will not be saved along with \"myOBj\" when cascadeSave=False.\n\n\nFor the reload function, there is a parameter, *cascadeObjects*, default True. This will control whether any foreign models which have local changes will be reloaded. If True, any foreign model at any level with local changes will be reloaded (and reflected in the return vlaue). If False, only the pk field is checked.\n\n\nFor comparison functions ( hasSameValues, hasUnsavedChanges, getUpdatedFields ) there is a parameter, *cascadeObjects*, default False, which will cause any foreign link objects  ( and any links those objects may contain, etc. ) to be included in the results.\n\nFor example, consider the following:\n\n        myObj = MyModel.objects.first()\n\n        myObj2 = myObj\n\n        myObj.other.someKey = 'someValue'\n\n\nCalling hasSameValues with cascadeObjects=False will return True, as both objects have the same values on the directly referenced object. cascadeObjects=True will, however, return False.\n\nSame with hasUnsavedChanges.\n\ngetUpdatedFields with cascadeObjects=False will return an empty dict, because the pk to \"other\" has not changed. However, with cascadeObjects=True, you will have the key \"other\" in the results, mapped to the value of   ( myObj.other before change, myObj.other after change).\n\n\nKeep in mind though, changing the foreign object reference itself IS considered a change on the main object. So, for example:\n\n        myObj = MyModel.objects.first()\n\n        myObj2 = myObj\n\n        myObj.other = OtherModel.objects.filter( ... ).first()  # Changing where \"other\" points\n\nIn the above example, hasSameValues, hasUnsavedChanges, and getUpdatedFields with cascadeObjects=False will all show a change in \"other\" because the pk associated with \"myObj\" has changed.\n\n\n\nSorting\n-------\n\nAfter fetching results, you can sort them by calling .sort_by on the IRQueryableList.\n\nExample:\n\n        myObjs = MyModel.objects.filter(blah='something').all().sort_by('startDate')\n\n\n\nEncodings\n---------\n\nIndexedRedis will use by default your system default encoding (sys.getdefaultencoding), unless it is ascii in which case it will default to utf-8.\n\nYou may change this via IndexedRedis.setDefaultIREncoding.\n\nTo get the current default encoding, use IndexedRedis.getDefaultIREncoding\n\n\nTo use a different encoding on a per-field basis, use IRUnicodeField or IRBytesField which both take an \"encoding\" parameter when constructing, which allows you to have your data follow that encoding.\n\n\nChanges\n-------\n\nSee https://raw.githubusercontent.com/kata198/indexedredis/master/Changelog\n\nExamples\n--------\n\n\nSee https://raw.githubusercontent.com/kata198/indexedredis/master/example.py\n\nAlso check out\n\nhttps://github.com/kata198/indexedredis/tree/master/tests\n\nfor various standalone and unit tests which will show various usage patterns\n\nContact Me\n----------\n\nPlease e-mail me with any questions, bugs, or even just to tell me that you're using it! kata198@gmail.com", "description_content_type": null, "docs_url": "https://pythonhosted.org/indexedredis/", "download_url": null, "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/kata198/indexedredis", "keywords": "redis,IndexedRedis,SQL,nosql,orm,fast,python,filter,index,model", "license": "LGPLv2", "maintainer": null, "maintainer_email": null, "name": "indexedredis", "package_url": "https://pypi.org/project/indexedredis/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/indexedredis/", "project_urls": {"Homepage": "https://github.com/kata198/indexedredis"}, "release_url": "https://pypi.org/project/indexedredis/6.0.3/", "requires_dist": null, "requires_python": null, "summary": "A super-fast ORM backed by Redis, supporting models and indexes with O(1) searches, and support for storing native/complex types and objects", "version": "6.0.3", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>A redis-backed very very fast ORM-style framework that supports indexes. It performs searches with O(1) efficency!</p>\n<p>You can store and fetch native python types (lists, objects, strings, integers, etc.).</p>\n<p>IndexedRedis supports both “equals” and “not-equals” operators for comparison. It also provides full atomic support for replacing entire datasets (based on model), which is useful for providing a fast frontend for SQL. In that use-case, a task that runs on an interval would fetch/calculate datasets from the SQL backend, and do an atomic replace on the datasets the front-end would query.</p>\n<p>IndexedRedis since 6.0.0 also provides support for Foreign references ( like a foreign key one-to-many, many-to-one, or many-to-many relationship in SQL ) which allow you to directly convert your SQL models into Redis models for vastly improved performance.</p>\n<p>Further client-side filtering (like greater-than, contains, etc) is available after the data has been fetched (see “Filter Results” below)</p>\n<p>My tests have shown that for using equivalent models between flask/mysql and IndexedRedis, a 600% - 1200% performance increase occurs, yet if you design your storage directly as IndexedRedis models, you are able to achieve much higher gains.</p>\n<p>It is compatible with python 2.7 and python 3. It has been tested with python 2.7, 3.4, 3.5, 3.6.</p>\n<div id=\"status\">\n<h2>5.0 Status</h2>\n<p>Version 5.0.0 will be somewhat <strong>backwards incompatible with previous versions</strong> by removing some old legacy stuff, improving a lot of existing things, and changing some behaviour.</p>\n<p>You can get an overview of the steps needed to convert your code with the conversion guide, found at <a href=\"https://github.com/kata198/indexedredis/blob/5.0branch/CONVERTING_TO_5.0.0\" rel=\"nofollow\">https://github.com/kata198/indexedredis/blob/5.0branch/CONVERTING_TO_5.0.0</a></p>\n<p>Full details of changes, as well as enhancements and bug fixes omitted from the conversion guide can be found in the 5.0.0 Changelog: <a href=\"https://github.com/kata198/indexedredis/blob/5.0branch/Changelog\" rel=\"nofollow\">https://github.com/kata198/indexedredis/blob/5.0branch/Changelog</a></p>\n</div>\n<div id=\"automatic-and-native-types\">\n<h2>Automatic and Native Types</h2>\n<p>Since 4.0, IndexedRedis supports defining fields which will automatically be converted to/from native python types (such as int, float, datetime), as well as anything that can be represented with json (dicts, lists) or objects that support pickling. You just provide the type in its native format, and all the conversion happens behind the scenes. When fetched, the object returned also contains fields in their native types.</p>\n<p>IndexedRedis also supports more advanced features such as automatically pickling/unpickling fields, compression/decompression, base64 encoding/decoding, and even defining your own custom field types through a standard interface.</p>\n<p>See “Advanced Fields” section below for more information.</p>\n</div>\n<div id=\"api-reference\">\n<h2>API Reference</h2>\n<p>Many, but not all methods and types are convered in this document.</p>\n<p>For full pydoc reference, see:</p>\n<p><a href=\"https://pythonhosted.org/indexedredis/\" rel=\"nofollow\">https://pythonhosted.org/indexedredis/</a></p>\n<p>or</p>\n<p><a href=\"http://htmlpreview.github.io/?https://github.com/kata198/IndexedRedis/blob/master/doc/IndexedRedis.html\" rel=\"nofollow\">http://htmlpreview.github.io/?https://github.com/kata198/IndexedRedis/blob/master/doc/IndexedRedis.html</a>?_cache_vers=1</p>\n<p><strong>Below is a quick highlight/overview:</strong></p>\n</div>\n<div id=\"indexedredismodel\">\n<h2>IndexedRedisModel</h2>\n<p>This is the type you should extend to define your model.</p>\n<p><strong>Example Model:</strong></p>\n<blockquote>\n<p>class Song(IndexedRedisModel):</p>\n<blockquote>\n<blockquote>\n<p>FIELDS = [ \\</p>\n<blockquote>\n<p>IRField(‘artist’),</p>\n<p>IRField(‘title’),</p>\n<p>IRField(‘album’),</p>\n<p>IRField(‘track_number’, valueType=int), # Convert automatically to/from int</p>\n<p>IRField(‘duration’, defaultValue=’0:00’),</p>\n<p>IRField(‘releaseDate’, valueType=datetime.datetime),  # Convert automatically to/from datetime</p>\n<p>IRField(‘description’),</p>\n<p>IRField(‘copyright’),</p>\n<p>IRRawField(‘mp3_data’), # Don’t try to encode/decode data</p>\n<p>IRCompressedField(‘thumbnail’, compressMode=’gzip’),      # Compress this field in storage using “gzip” compression</p>\n</blockquote>\n</blockquote>\n<p>IRField(‘tags’, valueType=list),</p>\n<p># “lyrics” will be a utf-8 unicode value on the object, and will be compressed/decompressed to/from storage\nIRFieldChain(‘lyrics’, [ IRUnicodeField(encoding=’utf-8’), IRCompressedField() ], defaultValue=’No lyrics found’ ),</p>\n<blockquote>\n<p>]</p>\n<dl>\n<dt>INDEXED_FIELDS = [ \\</dt>\n<dd><p>‘artist’,</p>\n<p>‘title’,</p>\n<p>‘track_number’,</p>\n</dd>\n</dl>\n<p>]</p>\n<p>KEY_NAME = ‘Songs’</p>\n</blockquote>\n</blockquote>\n</blockquote>\n<p><strong>Model Attributes:</strong></p>\n<p><em>FIELDS</em> - REQUIRED. A list of string or IRField objects (or their subclasses) which name the fields that can be used for storage. (see “Advanced Fields” section below)</p>\n<blockquote>\nExample: [IRField(‘name’), IRField(‘description’), IRField(‘model’), IRFixedPointField(‘Price’, 2), IRField(‘timestamp’, valueType=datetime), IRField(‘remainingStock’, valueType=int)]</blockquote>\n<p><em>INDEXED_FIELDS</em> - A list of strings containing the names of fields that will be indexed. Can only filter on indexed fields. Adds insert/delete time. The names listed here must match the name of a field given in FIELDS.</p>\n<blockquote>\nExample: [‘Name’, ‘model’]</blockquote>\n<p><em>KEY_NAME</em> - REQUIRED. A unique name name that represents this model. Think of it like a table name.</p>\n<blockquote>\nExample: ‘StoreItems’</blockquote>\n<p><em>REDIS_CONNECTION_PARAMS</em> - OPTIONAL -  provides the arguments to pass into “redis.Redis”, to construct a redis object. Here you can define overrides per-model from the default connection params.</p>\n<p>Since 5.0.0, define this field ONLY for this model to use an alternate connection than the default. You no longer need to set this on every model.</p>\n<p>See “Connecting To Redis” section below for more info.</p>\n<p>If not defined or empty, the default params will be used. If any fields are present, they will override the inherited default connection params.</p>\n<blockquote>\nExample: {‘host’ : ‘192.168.1.1’}</blockquote>\n</div>\n<div id=\"advanced-fields\">\n<h2>Advanced Fields</h2>\n<p>IndexedRedis since version 4.0 allows you to pass elements of type IRField (extends str) in the FIELDS element.</p>\n<p>Since 5.0.0, all fields must extend IRField in some way. Those that do not will generate a deprecated warning, and the field will be converted to an IRClassicField (same as IRField, but defaults to empty string instead of irNull).</p>\n<p>Doing so allows you to specify certain properties about the field.</p>\n<p>Example:</p>\n<blockquote>\nFIELDS = [ IRField(‘name’), IRField(‘age’, valueType=int), IRField(‘birthday’, valueType=datetime.datetime) ]</blockquote>\n<p><strong>Field Name</strong></p>\n<p>The first argument is the string of the field name.</p>\n<p><strong>Type</strong></p>\n<p>You can have a value automatically converted to a certain type on IRField (or use one of the several extending fields)</p>\n<p>by passing that type as “valueType”. (e.x.  IRField(‘age’, valueType=int))</p>\n<p>If you use “bool”, the values 0 and case insensitive string ‘false’ will result in False, and 1 or ‘true’ will result in True.</p>\n<p>When using floats, consider using IRFixedPointField, which supports indexing and the same representation regardless of platform (unlike “float”).</p>\n<p>floats to work cross-platform. Use a fixed point number as the string type ( like myFixedPoint = ‘%2.5f’ %( 10.12345 ) )</p>\n<p>IRField supports “valueType”, most other field types deal with a specific type and thus don’t have such a parameter.</p>\n<p><strong>NULL Values</strong></p>\n<p>Null values are represented by a static singleton, called “irNull” (of type IRNullType).</p>\n<p>For all types except IRClassicField (which has a default of empty string) the default (when unset) value of the field is irNull. This can be changed by passing “defaultValue=somethingElse” to the IRField constructor.</p>\n<p>irNull does not equal empty string, or anything except another irNull. This is to destinguish say, no int assigned vs int(0)</p>\n<p>You can check a typed field against the “irNull” variable found in the IndexedRedis or IndexedRedis.fields.</p>\n<p>e.x.</p>\n<blockquote>\nfrom IndexedRedis import irNull</blockquote>\n<blockquote>\n<p># Can be used directly in the model filtering\nnotDangerFive = MyModel.objects.filter(dangerLevel__ne=irNull).filter(dangerLevel__ne=5).all()</p>\n<p># or in results, through Queryable List. Or direct comparison (not shown)\nmyResults = MyModel.objects.filter(something=’value’).all()</p>\n<p>notDangerFive = myResults.filter(dangerLevel__ne=irNull).filter(dangerLevel__ne=5)</p>\n</blockquote>\n<p><strong>defaultValue</strong></p>\n<p>All fields (except IRClassicField) support a parameter, given when constructing the IRField object, “defaultValue”.</p>\n<p>For all fields (except IRClassicField), the value of this parameter defaults to “irNull” (see below). For an IRClassicField, the default remains empty string and cannot be changed (to be compatible with plain-string fields pre-5.0.0).</p>\n<p><strong>Advanced Types</strong></p>\n<p>The following are the possible field types, for use within the FIELDS array, and can be imported like “from IndexedRedis.fields import NAME”:</p>\n<p><strong>IRField</strong> - Standard field, takes a name and a “valueType”, which is a native python type, or any type you create which implements __new__, taking a signle argument and returning the object. See IndexedRedis/fields/FieldValueTypes for example of how datetime and json are implemented.</p>\n<p>When no valueType is defined, str/unicode is the type (same as pre-4.0), and default encoding is used (see set/getDefaultIREncoding functions)</p>\n<p>Indexable unless type is a json type or float (use IRFixedPointField to index on floats)</p>\n<p><strong>IRBase64Field</strong> - Converts to and from Base64.</p>\n<p>Indexable.</p>\n<p><strong>IRCompressedField</strong> - Automatically compresses before storage and decompresses after retrieval. Argument “compressMode” currently supports “zlib” (default), “bz2”, or “lzma”.</p>\n<p>Indexable.</p>\n<p><strong>IRFixedPointField</strong> - A floating-point with a fixed number of decimal places. This type supports indexing using floats, whereas IRField(…valueType=float) does not, as different platforms have different accuracies, roundings, etc. Takes a parameter, decimalPlaces (default 5), to define the precision after the decimal point.</p>\n<p>Indexable.</p>\n<p><strong>IRPickleField</strong> - Automaticly pickles the given object before storage, and unpickles after fetch.</p>\n<p>Not indexable because different representation between python2 and 3, and potentially system-dependent changes repr</p>\n<p><strong>IRUnicodeField</strong> - Field that takes a parameter, “encoding”, to define an encoding to use for this field. Use this to support fields with arbitrary encodings, as IRField will use the default encoding for strings.</p>\n<p>Indexable</p>\n<p><strong>IRBytesField</strong> - Field that forces the data to be “bytes”, python2 and python3 compatible. If you need python3 only, you can use IRField(valueType=bytes). For no encoding/decoding at all, see IRRawField</p>\n<p>Indexable</p>\n<p><strong>IRClassicField</strong> - Field that imitates the behaviour of a plain-string entry in FIELDS pre-5.0.0. This field has a default of empty string, and is always encoded/decoded using the defaultIREncoding</p>\n<p>Indexable</p>\n<p><strong>IRRawField</strong> - Field that is not converted in any, to or from Redis. On fetch this will always be “bytes” type (or str in python2). On python3 this is very similar to IRField(…valueType=None), but python2 needs this to store binary data without running into encoding issues.</p>\n<p>Not indexable - No decoding</p>\n<p><strong>IRForeignLinkField</strong> - Field that provides reference to a different model ( think “foreign key” in SQL ). Use this to reference other models from your model. This field links to a single foreign object, or irNull.</p>\n<p>Takes the linked model as the “foreignKey” argument.</p>\n<p>see “Foreign Links” section for more info.</p>\n<p>Indexable</p>\n<p><strong>IRForeignMultiLinkField</strong> - Field that provides reference to a different model ( think “foreign key” in SQL) ). Use this to reference multiple other models from your model. This model links to one or more foreign objects, or irNull.</p>\n<p>Takes the linked model as the “foreignKey” argument.</p>\n<p>see “Foreign Links” section for more info.</p>\n<p>Indexable. Note, filter must contain the full list (either pks, objs, or combination thereof). A “contains item”-style filter must be performed client-side.</p>\n<p><strong>IRFieldChain</strong> - Chains multiple field types together. Use this, for example, to compress the base64-representation of a value, or to compress utf-16 data. See section below for more details.</p>\n<p>Indexable if all chained fields are indexable.</p>\n<p><strong>Chaining Multiple Types</strong></p>\n<p>“Chaining” allows you to apply multiple types on a single field. Say, for example, that you have some utf-16 data that you want to be compressed for storage:</p>\n<p>Example:</p>\n<blockquote>\n<p>FIELDS = [ </p>\n<p>…</p>\n<blockquote>\nIRFieldChain( ‘longData’, [ IRUnicodeField(encoding=’utf-16’), IRCompressedField() ] )</blockquote>\n<p>]</p>\n</blockquote>\n<p>An IRFieldChain works similar to a regular IRField, the first parameter is the field name, it has an optional “defaultValue” parameter.</p>\n<p>The difference is that the second parameter, <em>chainedFields</em>, takes a list of other field types.</p>\n<p>When storing, the value is passed through each type in this list, left-to-right.</p>\n<p>When fetched, the value retrieved is passed backwards through these chainedFields, right-to-left.</p>\n<p>The output of the leftmost (first) element is what defines the type of data that will be found on the object when accessed.</p>\n<p>So in the above example, “myObj.longData” would be a utf-16 string. When going to the database, that utf-16 string will be decoded and then compressed for storage. When fetched, it will be decompressed and then converted back into utf-16.</p>\n<p>You can specify a defaultValue on an IRFieldChain by providing “defaultValue=X” as an argument to the constructor. If you provide “defaultValue” on any of the fields in the chain list, however, it will be ignored.</p>\n<p><strong>Hash-Lookups (performance)</strong></p>\n<p>If you want to index/search on very large strings/bytes (such as maybe a genome), IndexedRedis supports hashing the key, i.e. the value will be stored as the value itself, but the key reference used for lookup will be a hash of that string.</p>\n<p>This increases performance, saves network traffic, and shrinks storage requirements.</p>\n<p>To do this, set the “hashIndex” attribute of an IRField to True.</p>\n<blockquote>\n<p>FIELDS = [ \\</p>\n<p>…</p>\n<blockquote>\nIRField ( ‘genomeStr’, hashIndex=True )</blockquote>\n<p>]</p>\n</blockquote>\n<p>and that’s it! Filter and fetch and all operations remain the same (i.e. you just use the value directly, same as if “hashIndex” was False), but behind-the-scenes the lookups will all be done with the MD5 hash of the value.</p>\n<p><strong>Converting existing models to/from hashed indexes</strong></p>\n<p>IndexedRedis provides helper methods to automatically convert existing unhashed keys to hashed, and also hashed keys back to unhashed.</p>\n<p>To do this, change your IndexedRedisModel accordingly, and then call (for a model class named MyModel):</p>\n<blockquote>\nMyModel.objects.compat_convertHashedIndexes()</blockquote>\n<p>This will delete both the hashed and non-hashed key-value for any IRField which supports the “hashIndex” property.\nIf you just call “reindex” and you’ve changed the property “hashIndex” on any field, you’ll be left with lingering key-values.</p>\n<p>This function, by default (fetchAll=True) will fetch all records of this paticular model, and operate on them one-by-one. This is more efficient, but if memory constraints are an issue, you can pass fetchAll=False, which will fetch one object, convert indexes, save, then fetch next object. This is slower, but uses less memory.</p>\n<p>NOTHING should be using the models while this function is being called (it doesn’t make sense anyway to change schema whilst using it).</p>\n</div>\n<div id=\"connecting-to-redis\">\n<h2>Connecting to Redis</h2>\n<p>Your connection to Redis should be defined by calling “setDefaultRedisConnectionParams” with a dict of { ‘host’ : ‘hostname’, ‘port’ : 6379, ‘db’ : 0 }.</p>\n<p>The default connection will connect to host at 127.0.0.1, port at 6379, and db at 0. If you don’t define any of these fields explicitly, those values will be used for the respective field.</p>\n<p>These default params will be used for all models, UNLESS you define REDIS_CONNECTION_PARAMS on a model to something non-empty, then that model will inherit the default connection parameters, overriding any values with those defined on the model.</p>\n<p>If you need the same model to connect to different Redis instances, you can call “MyModel.connectAlt” (where MyModel is your model class) and pass a dict of alternate connection parameters. That function will return a copy of the class that will use the alternate provided connection.</p>\n</div>\n<div id=\"model-validation\">\n<h2>Model Validation</h2>\n<p>The model will be validated the first time an object of that type is instantiated. If there is something invalid in how it is defined, an “InvalidModelException” will be raised.</p>\n</div>\n<div id=\"usage\">\n<h2>Usage</h2>\n<p>Usage is very similar to Django or Flask.</p>\n<p><strong>Query:</strong></p>\n<p>Calling .filter or .filterInline builds a query/filter set. Use one of the <em>Fetch</em> methods described below to execute a query.</p>\n<blockquote>\nobjects = SomeModel.objects.filter(param1=val).filter(param2=val).all()</blockquote>\n<p>Supported fetch types from the database are equals and not-equals. To use a not-equals expression, append “__ne” to the end of the field name.</p>\n<blockquote>\nobjects = SomeModel.objects.filter(param1=val, param2__ne=val2).all()</blockquote>\n<p>All filters are applied on the redis server using hash lookups. All filters of the same type (equals or not equals) are applied in one command to Redis. So applying filters, <strong>no matter how many filters</strong>, is one to two commands total.</p>\n<p><strong>Filter Results / client-side filtering:</strong></p>\n<p>The results from the .all operation is a [QueryableList](<a href=\"https://pypi.python.org/pypi/QueryableList\" rel=\"nofollow\">https://pypi.python.org/pypi/QueryableList</a>) of all matched objects. The type of each object is the same as the model. You can use a QueryableList same as a normal list, but it can be more powerful than that:</p>\n<p>Once you have fetched the results from Redis, the QueryableList allows you to perform further client-side filtering using any means that QueryableList supports (e.x. gt, contains, in).</p>\n<p>Example:</p>\n<blockquote>\n<p>mathTeachers = People.objects.filter(job=’Math Teacher’).all()</p>\n<p>experiencedMathTeachers = mathTeachers.filter(experienceYears__gte=10) # Get math teachers with greater than or equal to 10 years experience</p>\n<p>cheeseLovingMathTeachers = matchTeachers.filter(likes__splitcontains=(‘ ‘, ‘cheese’)) # Check a space-separated list field, ‘likes’, and see if it contains ‘cheese’</p>\n</blockquote>\n<p>See <a href=\"https://github.com/kata198/QueryableList\" rel=\"nofollow\">https://github.com/kata198/QueryableList</a> for more information.</p>\n<p><strong>Save:</strong></p>\n<blockquote>\nobj = SomeModel(field1=’value’, field2=’value’)\nobj.save()</blockquote>\n<p><strong>Delete Using Filters:</strong></p>\n<blockquote>\nSomeModel.objects.filter(name=’Bad Man’).delete()</blockquote>\n<p><strong>Delete Individual Objects:</strong></p>\n<blockquote>\nobj.delete()</blockquote>\n<p><strong>Atomic Dataset Replacement:</strong></p>\n<p>There is also a powerful method called “reset” which will <strong>atomically</strong> replace all elements belonging to a model. This is useful for cache-replacement, etc.</p>\n<blockquote>\n<p>lst = [SomeModel(…), SomeModel(..)]</p>\n<p>SomeModel.reset(lst)</p>\n</blockquote>\n<p>For example, you could have a SQL backend and a cron job that does complex queries (or just fetches the same models) and does an atomic replace every 5 minutes to get massive performance boosts in your application.</p>\n<p>Filter objects by SomeModel.objects.filter(key=val, key2=val2) and get objects with .all</p>\n<p>Example: SomeModel.objects.filter(name=’Tim’, colour=’purple’).filter(number=5).all()</p>\n<p><strong>Get Primary Key:</strong></p>\n<p>Sometimes you may want to reference an individual object, via a foreign-key relationship or just to retrieve faster / unique rather than filtering.</p>\n<p>Every object saved has a unique primary key (unique per the model) which can be retrieved by the “getPk” method. You can then use this value on exists, get, getMultiple, etc methods.</p>\n<p><strong>Fetch Functions</strong>:</p>\n<p>Building filtersets do not actually fetch any data until one of these are called (see API for a complete list). All of these functions act on current filterset.</p>\n<p>Example: matchingObjects = SomeModel.objects.filter(…).all()</p>\n<blockquote>\n<blockquote>\n<p>all    - Return all objects matching this filter</p>\n<p>allOnlyFields - Takes a list of fields and only fetches those fields, using current filterset</p>\n</blockquote>\n<p>allByAge - Return the objects matching this filter, in order from oldest to newest</p>\n<blockquote>\n<p>delete - Delete objects matching this filter</p>\n<p>count  - Get the count of objects matching this filter</p>\n<p>first  - Get the oldest record with current filters</p>\n<p>last   - Get the newest record with current filters</p>\n<p>random - Get a random element with current filters</p>\n<p>getPrimaryKeys - Gets primary keys associated with current filters</p>\n</blockquote>\n</blockquote>\n<p><strong>Filter Functions</strong></p>\n<p>These functions add filters to the current set. “filter” returns a copy, “filterInline” acts on that object.</p>\n<blockquote>\n<p>filter - Add additional filters, returning a copy of the filter object (moreFiltered = filtered.filter(key2=val2))</p>\n<p>filterInline - Add additional filters to current filter object.</p>\n</blockquote>\n<p><strong>Global Fetch functions</strong></p>\n<p>These functions are available on SomeModel.objects and don’t use any filters (they get specific objects):</p>\n<blockquote>\n<p>get - Get a single object by pk</p>\n<p>getMultiple - Get multiple objects by a list of pks</p>\n<p>exists - Tests the existance of an object under a given pk</p>\n</blockquote>\n<p><strong>Model Functions</strong></p>\n<p>Actual objects contain methods including:</p>\n<blockquote>\n<p>save   - Save this object (create if not exist, otherwise update)</p>\n<p>delete - Delete this object</p>\n<p>getUpdatedFields - See changes since last fetch</p>\n</blockquote>\n<p><strong>Update Index</strong></p>\n<p>As your model changes, you may need to add a field to the INDEXED_FIELDS array. If this was an already existing field, you can reindex the models by doing:</p>\n<blockquote>\nMyModel.objects.reindex()</blockquote>\n<p>If, however, you change a field type of an indexable field, you should use the “reset” method.</p>\n<blockquote>\nMyModel.objects.reset( MyModel.objects.all() )</blockquote>\n<p><strong>Connecting to multiple Redis instances</strong></p>\n<p>You may want to use the same model on multiple Redis instances. To do so, use the .connectAlt method on IndexedRedisModel.</p>\n<blockquote>\nAltConnectionMyModel = MyModel.connectAlt({‘host’ : ‘althost’, ‘db’ : 4})</blockquote>\n<p>The “connectAlt” method takes a dict of Redis connection params, and returns a copy of the Model which will point to the alternate Redis.</p>\n<p>You use AltConnectionMyModel just as you would use MyModel.</p>\n</div>\n<div id=\"client-side-filtering-methods\">\n<h2>Client-Side Filtering/Methods</h2>\n<p>After you retrieve a bunch of objects from redis (by calling .all(), for example), you get an IRQueryableList of the fetched objects.</p>\n<p>This is a smart list, which wraps QueryableList (<a href=\"https://github.com/kata198/QueryableList\" rel=\"nofollow\">https://github.com/kata198/QueryableList</a>) and thus allows further filtering using a multitude of more advanced filtering (contains, case-insensitive comparisons, split-filters, etc). See the QueryableList docs for all the available operations.</p>\n<p>These operations will act on the objects AFTER FETCH, but are useful because sometimes you need to filter beyond simple equals or not equals, which are the current limits of the Redis backend.</p>\n<p>You can chain like:</p>\n<blockquote>\n<p># Fetch from Redis all objects where field1 is equal to “something”.</p>\n<p>#  Then, client side, filter where csvData is not null AND when split by comma contains “someItem” as an element.</p>\n<p>#  Then, still client side, filter where ( status is in “pending” or “saved” ) OR lastUpdated is less-than or equal to 700 seconds ago.</p>\n<p>#    (Keep in mind to make sure lastUpdated is an IRField(..valueType=int) or float, else you’ll be comparing string)</p>\n<p>myObjects = MyModel.objects.filter(field1=’something’).all().filter(csvData__isnull=False, csvData__splitcontains=(“,” , “someItem”)).filterOr(status__in=(‘pending’, ‘saved’), lastUpdated__lte(time.time() - 700))</p>\n</blockquote>\n<p>Some other methods on an IRQueryableList are:</p>\n<blockquote>\n<ul>\n<li><p><strong>getModel</strong> - Return the model associated with these objects</p>\n</li>\n<li><p><strong>delete</strong> - Delete all the objects in this list.</p>\n<blockquote>\n<p>NOTE: It is more efficent to do</p>\n<blockquote>\n<p>MyModel.objects.filter(…).delete()</p>\n</blockquote>\n<p>Than to do:</p>\n<blockquote>\n<p>MyModel.objects.filter(…).all().delete()</p>\n</blockquote>\n<p>because the latter actually fetches the full objects, then deletes them, whereas the first just deletes the matched items.</p>\n<p>However, sometimes you may want to do additional filtering client-side before deleting, and this supports that.</p>\n</blockquote>\n</li>\n<li><p><strong>save</strong> - Save all the objects in this list. If these are all existing objects, then only the fields which changed since fetch will be updated.</p>\n</li>\n<li><p><strong>reload</strong> - Reloads all the objects in this list, inline. This will fetch the most current data from Redis, and apply them on top of the items.</p>\n<blockquote>\n<p>The return of this function will be a list with the same indexes as the IRQueryableList. The items will be either a KeyError exception (if the item was deleted on the Redis-side), or a dict of fields that were updated, key as the field name, and value as a tuple of (old value, new value)</p>\n</blockquote>\n</li>\n<li><p><strong>refetch</strong> - Fetch again all the objects in this list, and return as a new IRQueryableList. Note, this does NOT perform the filter again, but fetches each of the items based on its internal primary key</p>\n</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"foreign-links\">\n<h2>Foreign Links</h2>\n<p>Since IndexedRedis 6.0.0, you can reference instances of models from another model. These are similar to “foreign keys” in SQL world.</p>\n<p>Two field types provide this functionality:</p>\n<p>IRForeignLinkField - Links to a single instance of another model. This takes as a value irNull (for no linked object), a primary key of an object, or an object itself. Resolution is always to the object itself.</p>\n<p>IRForeignMultiLinkField - Links to multiple instances of another model. Unlike in SQL, IndexedRedis can directly do this with a field without the need for an intermediate table. This takes a value irNull (for no linked objects), or a list containing a mixture of primary keys and/or objects. Resolution is a list of referenced objects.</p>\n<p><strong>Assigning Reference</strong></p>\n<p>You can assign either an object which matches the provided foreignModel type associated with the field, or a pk.</p>\n<p>So, if you have an entry in FIELDS like:</p>\n<blockquote>\nIRForeignLinkField( ‘other’, foreignModel=OtherModel)</blockquote>\n<p>then you can assign a reference like:</p>\n<blockquote>\n<p>myOtherModel = OtherModel( … )</p>\n<p>myObj.other = myOtherModel   # If using an IRForeignMultiLinkField, this should be a list instead.</p>\n</blockquote>\n<p>OR</p>\n<blockquote>\n<p>myOtherModel = OtherModel.objects.filter ( … ).first()</p>\n<p>myObj.other = myOtherModel.getPk()</p>\n</blockquote>\n<p><strong>Fetching Reference</strong></p>\n<p>By default, when fetching your model, the primary key(s) of any foreign relation’s are fetched along with it.</p>\n<p>The foreign objects themselves are fetched on-access, so if you do:</p>\n<blockquote>\n<p>myObj = MyModel.objects.filter ( … ).all()[0] # myObj fetches ONLY the primary key of OtherModel</p>\n<p>otherModel = myObj.other  # At this point (on-access), the entire OtherModel is fetched (using the primary key)</p>\n</blockquote>\n<p>This is the recommended behaviour, as you’ll save some time and memory on every objected fetched that you may not need to use.</p>\n<p>Also, if your application doesn’t use locking and multiple things could be touching the referenced model, there’s much less chance of accidently overwriting or using a stale instance if you fetch on-access instead of at fetch time.</p>\n<p>If, however, you’d like to fetch the foreign link’s in the same transaction as your model (and any foreign links on the link, etc. i.e. fetch everything associated) you can pass <em>cascadeFetch=True</em> to any of the fetch functions ( like all, first, last, allOnlyFields, etc. ). This will result in complete resolution at fetch time, instead of access-time.</p>\n<p><strong>Removing Reference</strong></p>\n<p>A reference to an IRForeignLinkField can be removed by setting the field value to “irNull”. So, for example,</p>\n<blockquote>\nmyObj.other = irNull</blockquote>\n<p>will remove the reference.</p>\n<p>For an IRForeignMultiLinkField, you can remove ALL references by setting the field to “irNull”. You can remove individual references by assinging the field value to a list minus the objects/pks you do not want to include.</p>\n<p>NOTE: You MUST assign it this list. You cannot fetch the list, remove an entry, and save an object. You must do it like:</p>\n<blockquote>\n<p>myRefs = myObj.others</p>\n<p>myRefs.remove( objToRemove ) # or splice, or del</p>\n<p>myObj.others = myRefs  # you MUST assign the property. Just changing the list result from earlier will have no effect.</p>\n<p>myObj.save()</p>\n</blockquote>\n<p><strong>Cascading</strong></p>\n<p>For several operations ( related to fetching, saving, checking if changes, comparing values ) there are two modes to consider.</p>\n<p>The first is non-cascading. This will cause the operations to ONLY deal with the object-at-hand, including references to foreign objects, but not on the objects themselves.</p>\n<p>The second is cascading. This will cause the operations to cascade, in that they will deal with the object-at-hand, any foreign objects, any of their foreign objects, etc.</p>\n<p>For fetch methods ( like .all ) there is a parameter, <em>cascadeFetch</em>, default False, which will cause all objects to be resolved at once in a single transaction, instead of the default on-access.</p>\n<p>For save methods ( like .save ) there is a parameter, <em>cascadeSave</em>, default True, which will cause any unsaved foreign objects to also be saved. This means if you attach an unsaved object via an IRForeignLinkField, and call .save(cascadeSave=True) on the parent, BOTH will be inserted. Also, if you have any changes on a referenced object, and call .save(cascadeSave=True), those changes will be saved.</p>\n<p>If you explicitly call myOBj.save(cascadeSave=False), then only “myObj” is saved. If you assigned reference to a foreign object which has been saved (and thus has a primary key), that primary key will be linked. If you assign reference to a foreign object which has NOT been saved, you will NOT have a link. You will need to explicitly save the child first. Also, if a child foreign object has changed values, they will not be saved along with “myOBj” when cascadeSave=False.</p>\n<p>For the reload function, there is a parameter, <em>cascadeObjects</em>, default True. This will control whether any foreign models which have local changes will be reloaded. If True, any foreign model at any level with local changes will be reloaded (and reflected in the return vlaue). If False, only the pk field is checked.</p>\n<p>For comparison functions ( hasSameValues, hasUnsavedChanges, getUpdatedFields ) there is a parameter, <em>cascadeObjects</em>, default False, which will cause any foreign link objects  ( and any links those objects may contain, etc. ) to be included in the results.</p>\n<p>For example, consider the following:</p>\n<blockquote>\n<p>myObj = MyModel.objects.first()</p>\n<p>myObj2 = myObj</p>\n<p>myObj.other.someKey = ‘someValue’</p>\n</blockquote>\n<p>Calling hasSameValues with cascadeObjects=False will return True, as both objects have the same values on the directly referenced object. cascadeObjects=True will, however, return False.</p>\n<p>Same with hasUnsavedChanges.</p>\n<p>getUpdatedFields with cascadeObjects=False will return an empty dict, because the pk to “other” has not changed. However, with cascadeObjects=True, you will have the key “other” in the results, mapped to the value of   ( myObj.other before change, myObj.other after change).</p>\n<p>Keep in mind though, changing the foreign object reference itself IS considered a change on the main object. So, for example:</p>\n<blockquote>\n<p>myObj = MyModel.objects.first()</p>\n<p>myObj2 = myObj</p>\n<p>myObj.other = OtherModel.objects.filter( … ).first()  # Changing where “other” points</p>\n</blockquote>\n<p>In the above example, hasSameValues, hasUnsavedChanges, and getUpdatedFields with cascadeObjects=False will all show a change in “other” because the pk associated with “myObj” has changed.</p>\n</div>\n<div id=\"sorting\">\n<h2>Sorting</h2>\n<p>After fetching results, you can sort them by calling .sort_by on the IRQueryableList.</p>\n<p>Example:</p>\n<blockquote>\nmyObjs = MyModel.objects.filter(blah=’something’).all().sort_by(‘startDate’)</blockquote>\n</div>\n<div id=\"encodings\">\n<h2>Encodings</h2>\n<p>IndexedRedis will use by default your system default encoding (sys.getdefaultencoding), unless it is ascii in which case it will default to utf-8.</p>\n<p>You may change this via IndexedRedis.setDefaultIREncoding.</p>\n<p>To get the current default encoding, use IndexedRedis.getDefaultIREncoding</p>\n<p>To use a different encoding on a per-field basis, use IRUnicodeField or IRBytesField which both take an “encoding” parameter when constructing, which allows you to have your data follow that encoding.</p>\n</div>\n<div id=\"changes\">\n<h2>Changes</h2>\n<p>See <a href=\"https://raw.githubusercontent.com/kata198/indexedredis/master/Changelog\" rel=\"nofollow\">https://raw.githubusercontent.com/kata198/indexedredis/master/Changelog</a></p>\n</div>\n<div id=\"examples\">\n<h2>Examples</h2>\n<p>See <a href=\"https://raw.githubusercontent.com/kata198/indexedredis/master/example.py\" rel=\"nofollow\">https://raw.githubusercontent.com/kata198/indexedredis/master/example.py</a></p>\n<p>Also check out</p>\n<p><a href=\"https://github.com/kata198/indexedredis/tree/master/tests\" rel=\"nofollow\">https://github.com/kata198/indexedredis/tree/master/tests</a></p>\n<p>for various standalone and unit tests which will show various usage patterns</p>\n</div>\n<div id=\"contact-me\">\n<h2>Contact Me</h2>\n<p>Please e-mail me with any questions, bugs, or even just to tell me that you’re using it! <a href=\"mailto:kata198%40gmail.com\">kata198<span>@</span>gmail<span>.</span>com</a></p>\n</div>\n\n          </div>"}, "last_serial": 2894936, "releases": {"3.0.0": [{"comment_text": "", "digests": {"md5": "36a66c181bb48a81532a068002917c51", "sha256": "7df50f17a342865b361c23d2decac9a38f5c7ebf4f1e7647f890d203bb0cb21d"}, "downloads": -1, "filename": "indexedredis-3.0.0.tar.gz", "has_sig": false, "md5_digest": "36a66c181bb48a81532a068002917c51", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 44617, "upload_time": "2016-01-12T20:03:09", "upload_time_iso_8601": "2016-01-12T20:03:09.916002Z", "url": "https://files.pythonhosted.org/packages/f9/8f/e951f80c39f4e1205faab9e547c2db053c9e73aa22b9a926f65023424d8b/indexedredis-3.0.0.tar.gz", "yanked": false}], "3.0.1": [{"comment_text": "", "digests": {"md5": "b3ca86b0e56e64f2a0e39f037f507f3b", "sha256": "c740fabb5685529b1b41982ac910512b5284ff10fdd7bdbbe90ebbe9252adf85"}, "downloads": -1, "filename": "indexedredis-3.0.1.tar.gz", "has_sig": false, "md5_digest": "b3ca86b0e56e64f2a0e39f037f507f3b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 45727, "upload_time": "2016-04-12T02:14:00", "upload_time_iso_8601": "2016-04-12T02:14:00.330485Z", "url": "https://files.pythonhosted.org/packages/60/09/320d5153aef6ced871fac2e355388f108916506a9974dfefa05451c6763b/indexedredis-3.0.1.tar.gz", "yanked": false}], "3.0.2": [{"comment_text": "", "digests": {"md5": "b739cad09d8d529bccd1161045f5a58c", "sha256": "1b08bbd22c05d68f8129a4b1df23bb2f3ee3aac36d3aaca8c34e9f39baa811eb"}, "downloads": -1, "filename": "indexedredis-3.0.2.tar.gz", "has_sig": false, "md5_digest": "b739cad09d8d529bccd1161045f5a58c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 45816, "upload_time": "2016-04-12T03:05:47", "upload_time_iso_8601": "2016-04-12T03:05:47.659615Z", "url": "https://files.pythonhosted.org/packages/5e/a0/0d665b07a91f39cff8ee5b141f8c26a0d3dd9a6a3ed6765055991d2a220d/indexedredis-3.0.2.tar.gz", "yanked": false}], "3.0.3": [{"comment_text": "", "digests": {"md5": "de9359c954a24cb3f1aad347e4454df3", "sha256": "c3b8d5ea47c4b8b80321e384b184e138eb73c3b737b6b05ea05b998ec4e8df77"}, "downloads": -1, "filename": "indexedredis-3.0.3.tar.gz", "has_sig": false, "md5_digest": "de9359c954a24cb3f1aad347e4454df3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 45821, "upload_time": "2016-04-12T03:13:32", "upload_time_iso_8601": "2016-04-12T03:13:32.017742Z", "url": "https://files.pythonhosted.org/packages/1b/24/7debf37fc3523ae03f92acd824099dee35d7772a61059fa0604340f9e87e/indexedredis-3.0.3.tar.gz", "yanked": false}], "3.1.0": [{"comment_text": "", "digests": {"md5": "d987b798e6d3001d96f58b8d09ce26fc", "sha256": "c4f6f2ad90f3045198828cbfe3f06526f3ee05a92c1d23a915f5d7ccb76b13ea"}, "downloads": -1, "filename": "indexedredis-3.1.0.tar.gz", "has_sig": false, "md5_digest": "d987b798e6d3001d96f58b8d09ce26fc", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 46107, "upload_time": "2016-04-15T19:24:08", "upload_time_iso_8601": "2016-04-15T19:24:08.264932Z", "url": "https://files.pythonhosted.org/packages/f0/11/ed17d2bb7701840052f337953cfa1052b805ee3e13ddf4024eeab42d319b/indexedredis-3.1.0.tar.gz", "yanked": false}], "3.1.1": [{"comment_text": "", "digests": {"md5": "136a9175470056bc7db35bff020c7979", "sha256": "d9170fb2d80b6c53aada78a068e8faa654424da10dd299e0f41455ae6f4696ce"}, "downloads": -1, "filename": "indexedredis-3.1.1.tar.gz", "has_sig": false, "md5_digest": "136a9175470056bc7db35bff020c7979", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 46103, "upload_time": "2016-04-15T19:31:29", "upload_time_iso_8601": "2016-04-15T19:31:29.980575Z", "url": "https://files.pythonhosted.org/packages/72/06/b0aa8faa10b33a45ff0bc9bf060bbb4a8102ea7740ac897d14778986a401/indexedredis-3.1.1.tar.gz", "yanked": false}], "4.0.0": [{"comment_text": "", "digests": {"md5": "548237335432b9623ba3b9e595e5272a", "sha256": "a00ff2c343a80bfffcc9a252a04c0ef26cf2ca156fa05411761ceb2712c86f44"}, "downloads": -1, "filename": "indexedredis-4.0.0.tar.gz", "has_sig": false, "md5_digest": "548237335432b9623ba3b9e595e5272a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 92297, "upload_time": "2016-11-18T05:48:30", "upload_time_iso_8601": "2016-11-18T05:48:30.554928Z", "url": "https://files.pythonhosted.org/packages/29/17/cb204aa5459b07ff285e29467cb220c0bf86e9d62f639d325687472fe643/indexedredis-4.0.0.tar.gz", "yanked": false}], "4.0.1": [{"comment_text": "", "digests": {"md5": "ae45b36fbe0c8dca5c6ad774ea449acd", "sha256": "e93e4ba450e71e588937c6ccc27eafb02cb20034e539e5236719aa6814f861c6"}, "downloads": -1, "filename": "indexedredis-4.0.1.tar.gz", "has_sig": false, "md5_digest": "ae45b36fbe0c8dca5c6ad774ea449acd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 75777, "upload_time": "2016-11-18T05:54:19", "upload_time_iso_8601": "2016-11-18T05:54:19.673601Z", "url": "https://files.pythonhosted.org/packages/2b/ba/630d53325e31d29dd71261967325543edb90ac7955b505ea1b07034c3e89/indexedredis-4.0.1.tar.gz", "yanked": false}], "4.0.2": [{"comment_text": "", "digests": {"md5": "a46743f933ef873064cae41e5b63c6ab", "sha256": "292495905f42494057c00c78ea343e363861ec6c4bd4d5c4a559a1145f181465"}, "downloads": -1, "filename": "indexedredis-4.0.2.tar.gz", "has_sig": false, "md5_digest": "a46743f933ef873064cae41e5b63c6ab", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 75744, "upload_time": "2016-11-18T06:03:12", "upload_time_iso_8601": "2016-11-18T06:03:12.153372Z", "url": "https://files.pythonhosted.org/packages/a2/21/b101b6da131bd5c7a9cbd286bec9dd6372c076e590e66051cc2412d772ac/indexedredis-4.0.2.tar.gz", "yanked": false}], "4.1.0": [{"comment_text": "", "digests": {"md5": "6070f5606ecf2fdd91d55bed01af61db", "sha256": "496ab3348dee0e553a3279a30a5293c2b561643ba569e12bdae8fcfcdb8781fa"}, "downloads": -1, "filename": "indexedredis-4.1.0.tar.gz", "has_sig": false, "md5_digest": "6070f5606ecf2fdd91d55bed01af61db", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 78229, "upload_time": "2017-01-09T20:41:31", "upload_time_iso_8601": "2017-01-09T20:41:31.981582Z", "url": "https://files.pythonhosted.org/packages/0b/69/b35b4c4ebde3ce8e482dbe5a8d0e7399d8ceb4d24cb5cc62759de4692d0a/indexedredis-4.1.0.tar.gz", "yanked": false}], "4.1.1": [{"comment_text": "", "digests": {"md5": "1d5338855f666883ef82d6d2bc90cd5f", "sha256": "4bffcae044687900baecb7d338b4b759bf724f21a0420435c3dfeec66aaa7982"}, "downloads": -1, "filename": "indexedredis-4.1.1.tar.gz", "has_sig": false, "md5_digest": "1d5338855f666883ef82d6d2bc90cd5f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 93934, "upload_time": "2017-04-13T02:36:21", "upload_time_iso_8601": "2017-04-13T02:36:21.335433Z", "url": "https://files.pythonhosted.org/packages/49/5e/d885b6bf715b0099d5d2c3eaba65c47500da7782b90beb58d5a17449eb75/indexedredis-4.1.1.tar.gz", "yanked": false}], "4.1.2": [{"comment_text": "", "digests": {"md5": "fc5afcf892100a427959d1f268797921", "sha256": "b1a91e090ff68f83eb084a1979a13bf1a9cd9acb80bb34d723815747869fe2b8"}, "downloads": -1, "filename": "indexedredis-4.1.2.tar.gz", "has_sig": false, "md5_digest": "fc5afcf892100a427959d1f268797921", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 94158, "upload_time": "2017-04-13T03:10:30", "upload_time_iso_8601": "2017-04-13T03:10:30.384046Z", "url": "https://files.pythonhosted.org/packages/2a/51/4944c09b95c323d6ca8e72b35feb6ebc003b7951e9e68c9582ee4854fe7b/indexedredis-4.1.2.tar.gz", "yanked": false}], "4.1.4": [{"comment_text": "", "digests": {"md5": "4e893694c6b16ea4bc88980ba166f9e0", "sha256": "9ea8cb44a4f9b11ebe18ec3d053ea748f39f21aa2a1c866c825302db1e1aea98"}, "downloads": -1, "filename": "indexedredis-4.1.4.tar.gz", "has_sig": false, "md5_digest": "4e893694c6b16ea4bc88980ba166f9e0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 99156, "upload_time": "2017-04-16T02:56:54", "upload_time_iso_8601": "2017-04-16T02:56:54.954295Z", "url": "https://files.pythonhosted.org/packages/8c/62/f8f4102470e22b8dddefe7827ac797879ca60331c827acba090a6fa0fbea/indexedredis-4.1.4.tar.gz", "yanked": false}], "5.0.0": [{"comment_text": "", "digests": {"md5": "39a0f7fdbc8ce3f2569f5a0337597159", "sha256": "a342f2e15f4d63bdd75d98b0a7e68ecb3ec9184841b36866cf4f406bda8f2be6"}, "downloads": -1, "filename": "indexedredis-5.0.0.tar.gz", "has_sig": false, "md5_digest": "39a0f7fdbc8ce3f2569f5a0337597159", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 154658, "upload_time": "2017-05-01T23:30:14", "upload_time_iso_8601": "2017-05-01T23:30:14.153188Z", "url": "https://files.pythonhosted.org/packages/c3/c0/41cf327a0d065eb3aec1cb1551a62be05bb12b3a822e318fe7d0e2c28d5a/indexedredis-5.0.0.tar.gz", "yanked": false}], "5.0.1": [{"comment_text": "", "digests": {"md5": "82f93b84d27d09135113374c9f143c82", "sha256": "407380dd699a04d1f112b7a644586a6aa3db1d5356592df7d1a222339ed787d2"}, "downloads": -1, "filename": "indexedredis-5.0.1.tar.gz", "has_sig": false, "md5_digest": "82f93b84d27d09135113374c9f143c82", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 151589, "upload_time": "2017-05-01T23:40:47", "upload_time_iso_8601": "2017-05-01T23:40:47.487428Z", "url": "https://files.pythonhosted.org/packages/c1/37/ad0a92d625bc2234884ab9f40dfe3fc4e764bf411506919bc22208c17739/indexedredis-5.0.1.tar.gz", "yanked": false}], "5.0.2": [{"comment_text": "", "digests": {"md5": "79f5e7a4ae848715bd23c00e63fe9cad", "sha256": "23e23cbc6f9285ad423a583bbd9a9ab78f32cc79175705fa3af15baf8a093b9e"}, "downloads": -1, "filename": "indexedredis-5.0.2.tar.gz", "has_sig": false, "md5_digest": "79f5e7a4ae848715bd23c00e63fe9cad", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 185359, "upload_time": "2017-05-13T19:17:44", "upload_time_iso_8601": "2017-05-13T19:17:44.689425Z", "url": "https://files.pythonhosted.org/packages/82/a2/e3981028fa3f5dd850c673ccfc7a8d7095cfc8b8ff45886b801208991a4e/indexedredis-5.0.2.tar.gz", "yanked": false}], "6.0.0": [{"comment_text": "", "digests": {"md5": "05926ab7cc53ff0a94325fffe0b256b8", "sha256": "ce6e743c7f05f4095a7709342432535bde99536f198775789e2f1f72d7279f29"}, "downloads": -1, "filename": "indexedredis-6.0.0.tar.gz", "has_sig": false, "md5_digest": "05926ab7cc53ff0a94325fffe0b256b8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 236045, "upload_time": "2017-05-17T03:00:51", "upload_time_iso_8601": "2017-05-17T03:00:51.983732Z", "url": "https://files.pythonhosted.org/packages/46/61/fa84859c6b19fa67f12ced63036bd2fe9e8fd10f381d5d7db99a79fe45a5/indexedredis-6.0.0.tar.gz", "yanked": false}], "6.0.2": [{"comment_text": "", "digests": {"md5": "400f86c775a3fc1856b65632ab3645e9", "sha256": "715cb3b852699b6e18eace7a809a35ec1ad04f7486bd24c50dbecfef7894dd84"}, "downloads": -1, "filename": "indexedredis-6.0.2.tar.gz", "has_sig": false, "md5_digest": "400f86c775a3fc1856b65632ab3645e9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 237217, "upload_time": "2017-05-17T13:35:53", "upload_time_iso_8601": "2017-05-17T13:35:53.434257Z", "url": "https://files.pythonhosted.org/packages/c3/ea/5680e2036241fcfa41be11a0ed8195894f8bba0f6f0bb57d502d48633858/indexedredis-6.0.2.tar.gz", "yanked": false}], "6.0.3": [{"comment_text": "", "digests": {"md5": "a527960ef9f0f8f088a12e58d1ec4040", "sha256": "34cfcd17e4b84b10630565040405d4ed04b3e50fe6e82aa94fb14aa5a2b4ddf6"}, "downloads": -1, "filename": "indexedredis-6.0.3.tar.gz", "has_sig": false, "md5_digest": "a527960ef9f0f8f088a12e58d1ec4040", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 198880, "upload_time": "2017-05-24T03:58:32", "upload_time_iso_8601": "2017-05-24T03:58:32.869410Z", "url": "https://files.pythonhosted.org/packages/8c/95/9a7de4b9f68dbbcdf04519041dcf8133948f4e6591cf1a33cc41cbd9d55c/indexedredis-6.0.3.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "a527960ef9f0f8f088a12e58d1ec4040", "sha256": "34cfcd17e4b84b10630565040405d4ed04b3e50fe6e82aa94fb14aa5a2b4ddf6"}, "downloads": -1, "filename": "indexedredis-6.0.3.tar.gz", "has_sig": false, "md5_digest": "a527960ef9f0f8f088a12e58d1ec4040", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 198880, "upload_time": "2017-05-24T03:58:32", "upload_time_iso_8601": "2017-05-24T03:58:32.869410Z", "url": "https://files.pythonhosted.org/packages/8c/95/9a7de4b9f68dbbcdf04519041dcf8133948f4e6591cf1a33cc41cbd9d55c/indexedredis-6.0.3.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:56:20 2020"}