{"info": {"author": "John Carr", "author_email": "john.carr@isotoma.com", "bugtrack_url": null, "classifiers": ["Framework :: Buildout", "Intended Audience :: System Administrators", "License :: OSI Approved :: Zope Public License", "Operating System :: POSIX"], "description": "Introduction\n============\n\nThis is a temporary fork of plone.recipe.zope2instance that has slightly\ntweaked exit code handling. Unless you need this, we suggest using the\nupstream recipe.\n\nThis recipe creates and configures a Zope 2 instance in parts. It also\ninstalls a control script, which is like zopectl, in the bin/ directory.\nThe name of the control script is the the name of the part in buildout.\n\nYou can use it with a part like this::\n\n  [instance]\n  recipe = isotoma.recipe.zope2instance\n  zope2-location = /path/to/zope2/install\n  user = admin:admin\n  http-address = 8080\n  eggs = ${buildout:eggs} my.package\n  products = ${buildout:directory}/products\n  zcml = my.package\n\nOptions\n-------\n\nzope2-location\n  The path where Zope 2 is installed. If you are also using the\n  plone.recipe.zope2install recipe, and you have that configured as a part\n  called 'zope2' prior to the zope2instance part, you can use ${zope2:location}\n  for this parameter.\n\nzope-conf\n  A relative or absolute path to a zope.conf file. If this is not given, a\n  zope.conf will be generated based on the the options below.\n\nrepozo\n  The path to the repozo.py backup script. A wrapper for this will be\n  generated in bin/repozo, which sets up the appropriate environment for\n  running this. Defaults to \"${zope2-location}/utilities/ZODBTools/repozo.py\".\n  Set this to an empty value if you do not want this script to be generated.\n\nThe following options all affect the generated zope.conf:\n\nproducts\n  A list of paths where Zope 2 products are installed. The first path takes\n  precedence in case the same product is found in more than one directory.\n\nsite-zcml\n  If you want a custom site.zcml file, put its content here. If this option is\n  used the zcml and zcml-additional options are ignored.\n\nzcml\n  Install ZCML slugs for the packages listed, separated by whitespace. You\n  can specify the type of slug by appending '-' and the type of slug you want\n  to create.  The valid types are configure, overrides and meta. Some\n  examples: my.package-overrides my.package-meta\n\nzcml-additional\n  Extra ZCML statements that should be included in the generated site.zcml\n  file.\n\nextra-paths\n  A list of paths where additional python packages are installed. The paths\n  are searched in the given order after all egg and products paths.\n\ndefault-zpublisher-encoding\n  This controls what character set is used to encode unicode data that reaches\n  ZPublisher without any other specified encoding. This defaults to 'utf-8'.\n\ndebug-mode\n  Set to 'on' to turn on debug mode in Zope. Defaults to 'off'.\n\nverbose-security\n  Set to 'on' to turn on verbose security (and switch to the Python security\n  implementation). Defaults to 'off' (and the C security implementation).\n\neffective-user\n  The name of the effective user for the Zope process. Defaults to not setting\n  an effective user.\n\nip-address\n  The default IP address on which Zope's various server protocol\n  implementations will listen for requests. If this is unset, Zope will listen\n  on all IP addresses supported by the machine. This directive can be\n  overridden on a per-server basis in the servers section. Defaults to not\n  setting an ip-address.\n\nport-base\n  Offset applied to the port numbers used for ZServer configurations. For\n  example, if the http-server port is 8080 and the port-base is 1000, the HTTP\n  server will listen on port 9080. This makes it easy to change the complete\n  set of ports used by a Zope server process. Zope defaults to 0.\n\nhttp-address\n  Give a port for the HTTP server. Defaults to 8080.\n\nhttp-fast-listen\n  Set to off to defer opening of the HTTP socket until the end of the Zope\n  startup phase. Defaults to on. Note: This option requires Zope >= 2.11.\n\nftp-address\n  Give a port for the FTP server. This enables the FTP server.\n\nwebdav-address\n  Give a port for the WebDAV server.  This enables the WebDAV server\n\nwebdav-force-connection-close\n  Valid options are off and on. Defaults to off\n\nicp-address\n  Give a port for the ICP server. This enables the ICP server.\n\nclient-home\n  Sets the clienthome for the generated instance.\n  Defaults to ${buildout:directory}/var/<name of the section>.\n\nvar\n  Used to configure the base directory for all things going into var.\n  Defaults to ${buildout:directory}/var.\n\nevent-log\n  The filename of the event log. Defaults to var/log/${partname}.log\n\nevent-log-custom\n  A custom section for the eventlog, to be able to use another\n  event logger than `logfile`\n\nevent-log-level\n  Set the level of the console output for the event log. Level may be any of\n  CRITICAL, ERROR, WARN, INFO, DEBUG, or ALL. Defaults to INFO.\n\nz2-log\n  The filename for the Z2 access log. Defaults to var/log/${partname}-Z2.log.\n\nz2-log-level\n  Set the log level for the access log. Level may be any of CRITICAL, ERROR,\n  WARN, INFO, DEBUG, or ALL. Defaults to WARN.\n\naccess-log-custom\n  Like `event-log-custom`, a custom section for the access logger, to be able\n  to use another event logger than `logfile`.\n\nfile-storage\n  The filename where the ZODB data file will be stored.\n  Defaults to var/filestorage/Data.fs.\n\ndemo-storage\n  If 'on' it enables the demostorage. It is not compatible with blob-storage\n  and rel-storage.\n\nblob-storage\n  The name of the directory where the ZODB blob data will be stored.\n\nrel-storage\n  Allows to set a RelStorage instead of a FileStorage.\n\n  Contains settings separated by newlines, with these values:\n\n  - type: any database type supported (postgresql, oracle, mysql)\n  - RelStorage specific keys, like `cache-servers` and `poll-interval`\n  - all other keys are passed on to the database-specific RelStorage adapter.\n\n  Example::\n\n    rel-storage =\n      type oracle\n      dsn (DESCRIPTION=(ADDRESS=(HOST=s01))(CONNECT_DATA=(SERVICE_NAME=d01)))\n      user tarek\n      password secret\n\nzeo-client\n  Set to 'on' to make this instance a ZEO client. In this case, setting the\n  zeo-address option is required, and the file-storage option has no effect.\n  To set up a ZEO server, you can use the plone.recipe.zope2zeoserver recipe.\n  Defaults to 'off'.\n\nshared-blob\n  If 'zeo-client' is set to 'on' and 'blob-storage' is set to a directory that\n  is shared between this instance and the ZEO server (as configured by the\n  'blob-dir' setting on zeo.conf, then setting 'shared-blob' to 'on' causes\n  this instance not to stream the blob file through the ZEO connection, but\n  just to send the information of the file location to the ZEO server.\n\nzeo-address\n  Set the address of the ZEO server. Defaults to 8100.\n\nzeo-client-name\n  Set the name of the ZEO client. Defaults to the name of the part. If a false\n  value is provided no zeo-client-name will be set.\n\nzeo-client-cache-size\n  Set the size of the ZEO client cache. Defaults to '30MB'.\n\nzeo-client-client\n  Set the persistent cache name that is used to construct the cache\n  filenames. Persistent cache files are disabled by default.\n\nzeo-storage\n  Set the storage number of the ZEO storage. Defaults to '1'.\n\nzeo-var\n  Used in the zeo storage snippets to configure the zeo var folder.\n  Defaults to $INSTANCE_HOME/var.\n\nzeo-username\n  Enable ZEO authentication and use the given username when accessing the\n  ZEO server. It is obligatory to also specify a zeo-password.\n\nzeo-password\n  Password to use when connecting to a ZEO server with authentication\n  enabled.\n\nzeo-realm\n  Authentication realm to use when authentication with a ZEO server. Defaults\n  to 'ZEO'.\n\nzodb-cache-size\n  Set the ZODB cache size, i.e. the number of objects which the ZODB cache\n  will try to hold. Defaults to 5000.\n\nzodb-cache-size-bytes\n  Set the ZODB cache sizes in bytes. Requires ZODB 3.9 or later.\n\nzserver-threads\n  Specify the number of threads that Zope's ZServer web server will use to\n  service requests. You shouldn't change this unless you know what you are\n  doing. Zope's default is 4.\n\nzodb-temporary-storage\n  If given Zope's default temporary storage definition will be replaced by\n  the lines of this parameter.\n\nenvironment-vars\n  Define arbitrary key-value pairs for use as environment variables during\n  Zope's run cycle.\n\n  Example::\n\n    environment-vars =\n      TZ US/Eastern\n      TMP /var/tmp\n      DISABLE_PTS True\n\nzope-conf-additional\n  Give additional lines to zope.conf. Make sure you indent any lines after\n  the one with the parameter.\n\n  Example::\n\n    zope-conf-additional =\n      locale fr_FR\n      http-realm Slipknot\n\nrelative-paths\n  Set this to `true` to make the generated scripts use relative\n  paths. You can also enable this in the `[buildout]` section.\n\nno-shell\n  The traditional way to run Zope is by using shell scripts. These in\n  turn start-up a Python process with the right settings. By setting\n  this option to true (default false) these shell scripts will not be\n  used. In this case the recipe will directly start the Python\n  process.\n\n\nChangelog\n=========\n\n3.6 (2009-10-11)\n----------------\n\n- Expanded the RelStorage options, including keep-history and replica-conf.\n  [hathawsh]\n\n3.5 (2009-09-05)\n----------------\n\n- Added support for relative-paths in the script generation.\n  [jvloothuis]\n\n- When `zope-conf` is set the config file will be directly loaded from that\n  location (it previously created a stub zope.conf which included it).\n  [jvloothuis]\n\n- Added an option to avoid using the normal shell scripts for starting Zope.\n  This makes it possible to avoid the hard-coded paths in these scripts.\n  [jvloothuis]\n\n- Allow the blob-dir parameter in RelStorage configurations.\n  [hathawsh]\n\n3.4 (2009-08-12)\n----------------\n\n- Support in line with fix for LP#407916.\n  [gotcha]\n\n- Changed the 'mkzopeinstance' call respect the 'bin-directory' option.\n  [esteele]\n\n- Removed the `zope2-egg` option and the simple startup script from the recipe.\n  We assume that we have an egg distribution if `zope2-location` is not set.\n  [hannosch]\n\n- Merged the `davisagli-eggified-zope` branch into the trunk.\n  [hannosch]\n\n- Add a new icp-address option. This is useful for environments where\n  e.g. squid is used to front a Zope/ZEO cluster. See\n  http://www.zope.org/Members/htrd/icp/intro\n  [neaj]\n\n3.3 - 2009-07-07\n----------------\n\n- Add handling for RelStorage options.\n  [elro]\n\n- Reinstall scripts on update which appears to be good recipe practice.\n  [stefan]\n\n3.2 - 2009-04-02\n----------------\n\n- Add a new zcml-additional option. This is useful for environments where\n  non-code configuration (such as database connection details for\n  ore.contentmirror) are managed through zcml.\n  [wichert]\n\n3.1 (2009-03-15)\n----------------\n\n- The 2.9 fix for spaces caused a problem using debug (bug 337740)\n  due to the way do_debug passed the \"-i\" command line argument\n  to get_startup_cmd.\n  [smcmahon]\n\n3.0 (2009-02-27)\n----------------\n\n- The 2.9 fix for the instance run command was itself broken and\n  would fail on anything except Windows.\n  [smcmahon]\n\n- Changed the `zope2-egg` option to omit any kind of instance creation for\n  now. The mkzopeinstance script relies on being able to import Zope2, which\n  is not available when buildout runs.\n  [hannosch]\n\n2.9 (2009-02-26)\n----------------\n\n- The instance run command was vulnerable to spaces in pathnames, and\n  needed some extra quoting for win32.\n  [smcmahon]\n\n- Check for existence of windows scripts before patching them. Some\n  Linux distributions of Zope2 don't have these files.\n  [smcmahon]\n\n- Delegate commands to ``win32serviceutil.HandleCommand()`` on win32,\n  instead of starting the interpreter through ``os.system()``. Should\n  shave off a couple seconds from overall time taken to process those\n  commands.\n  [sidnei]\n\n- Compute ``serviceClassString`` ourselves, since we are calling this\n  as a module and not directly as ``__main__``, otherwise the service\n  won't be installed correctly.\n  [sidnei]\n\n2.8 (2008-12-05)\n----------------\n\n- Add more tests for ZEO client with blob and demo storages.\n  Still no test on 'shared-blob-dir' option.\n  [encolpe]\n\n- Always use 'r'-style strings for passing script and configuration\n  filenames (eg: on 'instance run <script>').\n  [sidnei]\n\n- Add a demo-storage option and tests.\n  [encolpe]\n\n- Add a first test for blob-storage.\n  [encolpe]\n\n2.7 (2008-11-18)\n----------------\n\n- Added a `zope2-egg` option and an accompanying simple startup script for\n  use with an eggified Zope2.\n  [hannosch]\n\n- Do not fail with a Zope2 egg checkout.\n  [hannosch]\n\n- Normalize first argument to os.spawnl. It can get really upset\n  otherwise (dll import failure on a relocatable python install).\n  [sidnei]\n\n- Use same quoting as on 'do_foreground' for servicescript\n  usage. Fixes problems with installing the buildout-based Plone\n  installer for Windows on a path with spaces.\n  [sidnei]\n\n- Ensure that do_foreground leaves self.options.program arguments as it\n  found them.  This makes it possible to use 'fg' and 'debug' more than\n  once within the same control session.\n  [klm]\n\n2.6 (2008-10-22)\n----------------\n\n- Normalize, absolutize and lowercase-ize (is that a word?) paths\n  before comparing, to avoid problems with relative filenames and\n  different drive letter case on Windows.\n  [sidnei]\n\n2.5 (2008-09-22)\n----------------\n\n- Add support for zodb-cache-size-bytes from ZODB 3.9 and later.\n  [wichert]\n\n\n2.4 (2008-07-15)\n----------------\n\n- Introduced zope.conf variables \"INSTANCEHOME\" and \"CLIENTHOME\".\n  Its very very helpful in cluster setups with zope-conf-additional\n  sections (buildout lacks to reference the current section).\n  [jensens]\n\n- Made test command compatible with zope.testing 3.6.\n  [hannosch]\n\n2.3.1 (2008-06-10)\n------------------\n\n- No code changes. Released to fix the 2.3 release which put .egg files in\n  the wild.\n  [hannosch]\n\n2.3 (2008-06-06)\n----------------\n\n- Need to actually pass in deprecation-warnings, otherwise we get a\n  KeyError.\n  [sidnei]\n\n- Fix another place where the directory name needed to be escaped to\n  avoid problems with spaces.\n  [sidnei]\n\n- Don't try to delete location if it does not exist.\n  [sidnei]\n\n2.2 (2008-06-06)\n----------------\n\n- Added `deprecation-warnings` option that allows turning the option\n  to disable deprecation warnings on or off. You can provide the value\n  `error` to it, and every deprecation warning will be turned into an\n  exception.\n  [sidnei]\n\n- Fix copy and paste error that caused a failure on changing\n  runzope.bat to call servicewrapper.py.\n  [sidnei]\n\n- Escape 'executable' argument before passing it to os.spawnl, in\n  order to make it work on Windows when the executable name has spaces\n  on it.\n  [sidnei]\n\n- Added `http-fast-listen` option. Use of this option requires Zope >= 2.11.\n  [stefan]\n\n2.1 (2008-06-05)\n----------------\n\n- Fixed a test problem on Windows, where explicit closing of files is required.\n  [hannosch]\n\n- Call `servicewrapper.py` from `runzope.bat` instead of setting\n  `PYTHONPATH` and calling `Zope2/Startup/run.py`. That way we set\n  sys.path from inside Python code and avoid exceeding the maximum\n  environment variable limit.\n  [sidnei]\n\n- Allow to use an alternative temporary storage, by specifying the new\n  `zodb-temporary-storage` option.\n  [jensens]\n\n- Added `environment-vars` option to set environment variables. Changed\n  the zope-conf-additional example code to something that isn't covered by\n  the recipe.\n  [claytron]\n\n2.0 (2008-05-29)\n----------------\n\n- Do not use system but exec when starting Zope. This makes it possible for\n  process management tools to properly manage Zope processes.\n  [wichert]\n\n- Added `site-zcml` option\n  Added tests\n  [mustapha]\n\n- Add support for ZEO authentication. Note that this does not work with any\n  released Zope or ZODB version at this moment. See\n  http://mail.zope.org/pipermail/zope/2005-October/161951.html for required\n  patches.\n  [wichert]\n\n- Added FTP and WebDAV options\n  [claytron]\n\n- Allow rel-storage to be an empty string, meaning 'do not use relstorage'.\n  This allows an extending buildout configuration to disable relstorage again.\n  [mj]\n\n1.9 (2008-04-15)\n----------------\n\n- Fix rel-storage parsing for options with spaces. Note that split() or\n  split(None) already strips the string.\n  [mj]\n\n1.8 (2008-04-05)\n----------------\n\n- Fixed a Win32 problem in which the presence of Python string escapes in the\n  path to zope.conf (e.g., d:\\botest\\parts\\instance\\etc\\zope.conf would escape\n  the \\b). This showed up when using the 'run', 'debug' or 'adduser' commands.\n  This fixes #211416.\n  [smcmahon]\n\n- Added `console` command to the instance script, which is equivalent to fg but\n  does not implicitly turn on debug mode but respects the zope.conf setting.\n  [hannosch]\n\n1.7 (2008-03-31)\n----------------\n\n- Added new client-home option and let it default to a subfolder of the\n  buildout-wide var folder with a subfolder of the name of the section.\n  [hannosch]\n\n- Added limited support for running tests under Zope <= 2.8.\n  [hannosch]\n\n1.6 (2008-03-27)\n----------------\n\n- Fixed runzope script generation for Zope 2.8.\n  [hannosch]\n\n- Cleaned up \"./bin/instance test\" option handling.\n  [stefan]\n\n- Removed generator expressions as these aren't supported in < py2.4, which is\n  used by zope 2.7/8.\n  [duffyd]\n\n1.5 (2008-02-29)\n----------------\n\n- Added `access-log-custom` option to be able to use another event logger\n  than the file one for the access logger.\n  [tarek]\n\n- Fix instance generation to work on Windows with blanks in the path name.\n  This closes #188023.\n  [hannosch, gotti]\n\n- Added 'zeo-client-client' option which results in 'client <value>' inside\n  <zeoclient>.\n  [timte, hannosch]\n\n- Made relstorage handling more generic, so it now supports any RelStorage\n  adapter, including Oracle (which was broken).\n  [mj]\n\n1.4 (2008-02-23)\n----------------\n\n- Fix typo in event log parameter name (from \"z-log\" to \"z2-log\"), to comply\n  with the documentation. This closes #190943.\n  [kdeldycke]\n\n- Create pid and lock file folders if they don't exist.\n  [kdeldycke]\n\n- Remove hard-coded log level and use the event_log_level parameter to set it\n  dynamically. This closes #190994.\n  [kdeldycke]\n\n- Added a test environment, using zc.buildout.testing, and a doctest that\n  tries the recipe.\n  [tarek]\n\n- Added an `event-log-custom` option\n  [tarek]\n\n- Added example for the zope-conf-additional option. This closes #185539.\n  [klm, hannosch]\n\n- Added `rel-storage` option to be able to wire Zope to RelStorage\n  (postgresql/oracle) instead of a FileStorage database.\n  [tarek]\n\n1.3\n---\n\n- For each entry in recipe-specified 'extra-paths' line, add a 'path' line\n  to the instance and Zope client zope.conf files.\n  [klm]\n\n1.2\n---\n\n- Added the boolean `shared-blob` option, defaulting to `no`. If all of\n  `zeo-client`, `blob-storage` and `shared-blob` options are set,\n  the instance will assume the blob directory set by `blob-storage` is shared\n  with the server instead of streaming 'blob' files through the ZEO connection.\n  [rochael]\n\n- Changed `ctl.do_foreground()` (which is invoked by the `fg` command\n  line argument) start Zope in debug mode to emulate the behavior of\n  `zopectl fg`. This required a little special WIN32 code to make\n  sure it would work in both `*nix` and Windows.\n  [smcmahon]\n\n- Added `var` option, which is used to configure the base directory for all\n  the things going into var.\n  [hannosch]\n\n- Added `zeo-var` option, which is used in the zeo storage snippets to\n  configure the zeo var folder.\n  [hannosch]\n\n- Merged rochael-blobsupport branch. Added support for ZODB 3.8 blob storage\n  configuration for ZEO clients. This references\n  https://bugs.launchpad.net/collective.buildout/+bug/179113.\n  [rochael, hannosch]\n\n- Added `zeo-client-name` option. Defaults to the name of the ZEO client.\n  [hannosch]\n\n1.1\n---\n\n- Small documentation update. Added link to the bugtracker.\n  [hannosch]\n\n- Changed default of zope.conf option 'default-zpublisher-encoding' to 'utf-8'\n  instead of Zope's default value of 'iso-8859-15'.\n\n- Have PID file's location default to '${buildout:directory}/var/${name}.pid'.\n  Keeping the PID file in $INSTANCE_HOME gives trouble when buildout rebuilds\n  the part.\n  [nouri, mustapha]\n\n1.0\n---\n\n- Increased 'zodb_cache_size' default value to 5000, which is more likely a\n  better default these days.\n  [hannosch]\n\n- Added support for 'extra-paths' as in 'zc.recipe.egg'; this is useful when\n  using regular python packages for which no eggs are available (yet), i.e.\n  with 'plone.recipe.distros'.\n  [witsch]\n\n- Added zeo-storage option (merge branch ree-add-zeo-storage-option).\n  [ree]\n\n- Avoid doubled entries to eggs specified in the buildout in 'sys.path':\n  the working set ('ws') gets passed again when installing the script\n  ('bin/instance'), but it is not also added to 'extra_paths'.\n  [witsch]\n\n- Patching 'PYTHONPATH' in the Zope startup skripts should insert all\n  additional paths (to eggs) __before__ 'SOFTWARE_HOME', because otherwise\n  (newer) egg versions of components from the standard Zope distribution\n  (i.e. stuff that lives in 'lib/python') cannot be used.\n  [witsch]\n\n- Changed the option to suppress deprecation warnings to \"--nowarn\" or\n  '--nowarning\" to be consistent with \"zopectl test\".\n  [witsch]\n\n- Added option \"-w\" to allow the test runner to suppress deprecation warnings,\n  so it's easier to spot failing tests...\n  [witsch]\n\n- Updated import for Zope 2.7 (and below) compatibility.\n  [duffyd]\n\n- Merging -r51966:52659 claytron-zopeconfoptions branch to trunk.\n  [claytron]\n\n- Made the config snippet prettier while still getting the resulting\n  indentation right.\n  [witsch]\n\n0.9\n---\n\n- Added support for zodb 3.8's \"<blobstorage>\" directive.\n  [witsch]\n\n- Added a script name arg before callint zope.testing.testrunner.run.\n  zope.testing.testrunner:1772, get_options removes the first arg from\n  the list of arguments expecting a script name there. Was causing\n  \"bin/instance test\" to behave improperly.\n  [rossp]\n\n0.8\n---\n\n- Use bin if present falling back to utilities. This makes it possible to use\n  a Zope version installed from a tarball and not compiled inplace.\n  [rossp]\n\n0.7\n---\n\n- Found the problem with strange environment variables.\n  [hannosch]\n\n- Fixed documentation bug, the cache size is respected by non-zeo instance as\n  well.\n  [hannosch]\n\n0.6\n---\n\n- J1m actually read the docs ;)\n  [hannosch]\n\n- Attempt to fix the sometimes insane number of tests which are found by the\n  test runner.\n  [hannosch]\n\n0.5\n---\n\n- Added an option to set the effective-user.\n  [optilude]\n\n0.4\n---\n\n- Generate a bin/repozo script to perform backups using repozo.py (and\n  set up the appropriate pythonpath for this to work).\n  [optilude]\n\n- Document options properly, and add the ability to specify a zope.conf\n  file explicitly rather than having one generated from a template.\n  [optilude]\n\n0.3\n---\n\n- Finally found a way to provide the Zope Windows service with the right\n  environment. We need a new wrapper script, which sets up the PYTHONPATH.\n  [hannosch]\n\n- Make it possible to configure the name of the zopectl script using the\n  control-script option in the [instance] section.\n  [wichert]\n\n0.2\n---\n\n- Extend support for zcml slugs to include Zope 2.9.\n  [dunny]\n\n- Added support for making a ZEO-client.\n  [regebro]\n\n0.1\n---\n\n- Initial implementation.\n  [hannosch]", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://pypi.python.org/pypi/isotoma.recipe.zope2instance", "keywords": "buildout cron", "license": "Apache Software License", "maintainer": null, "maintainer_email": null, "name": "isotoma.recipe.zope2instance", "package_url": "https://pypi.org/project/isotoma.recipe.zope2instance/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/isotoma.recipe.zope2instance/", "project_urls": {"Download": "UNKNOWN", "Homepage": "http://pypi.python.org/pypi/isotoma.recipe.zope2instance"}, "release_url": "https://pypi.org/project/isotoma.recipe.zope2instance/0.0.6/", "requires_dist": null, "requires_python": null, "summary": "Buildout recipes for create zope2instances", "version": "0.0.6", "yanked": false, "html_description": "<div class=\"project-description\">\n            <div id=\"introduction\">\n<h2>Introduction</h2>\n<p>This is a temporary fork of plone.recipe.zope2instance that has slightly\ntweaked exit code handling. Unless you need this, we suggest using the\nupstream recipe.</p>\n<p>This recipe creates and configures a Zope 2 instance in parts. It also\ninstalls a control script, which is like zopectl, in the bin/ directory.\nThe name of the control script is the the name of the part in buildout.</p>\n<p>You can use it with a part like this:</p>\n<pre>[instance]\nrecipe = isotoma.recipe.zope2instance\nzope2-location = /path/to/zope2/install\nuser = admin:admin\nhttp-address = 8080\neggs = ${buildout:eggs} my.package\nproducts = ${buildout:directory}/products\nzcml = my.package\n</pre>\n<div id=\"options\">\n<h3>Options</h3>\n<dl>\n<dt>zope2-location</dt>\n<dd>The path where Zope 2 is installed. If you are also using the\nplone.recipe.zope2install recipe, and you have that configured as a part\ncalled ‘zope2’ prior to the zope2instance part, you can use ${zope2:location}\nfor this parameter.</dd>\n<dt>zope-conf</dt>\n<dd>A relative or absolute path to a zope.conf file. If this is not given, a\nzope.conf will be generated based on the the options below.</dd>\n<dt>repozo</dt>\n<dd>The path to the repozo.py backup script. A wrapper for this will be\ngenerated in bin/repozo, which sets up the appropriate environment for\nrunning this. Defaults to “${zope2-location}/utilities/ZODBTools/repozo.py”.\nSet this to an empty value if you do not want this script to be generated.</dd>\n</dl>\n<p>The following options all affect the generated zope.conf:</p>\n<dl>\n<dt>products</dt>\n<dd>A list of paths where Zope 2 products are installed. The first path takes\nprecedence in case the same product is found in more than one directory.</dd>\n<dt>site-zcml</dt>\n<dd>If you want a custom site.zcml file, put its content here. If this option is\nused the zcml and zcml-additional options are ignored.</dd>\n<dt>zcml</dt>\n<dd>Install ZCML slugs for the packages listed, separated by whitespace. You\ncan specify the type of slug by appending ‘-‘ and the type of slug you want\nto create.  The valid types are configure, overrides and meta. Some\nexamples: my.package-overrides my.package-meta</dd>\n<dt>zcml-additional</dt>\n<dd>Extra ZCML statements that should be included in the generated site.zcml\nfile.</dd>\n<dt>extra-paths</dt>\n<dd>A list of paths where additional python packages are installed. The paths\nare searched in the given order after all egg and products paths.</dd>\n<dt>default-zpublisher-encoding</dt>\n<dd>This controls what character set is used to encode unicode data that reaches\nZPublisher without any other specified encoding. This defaults to ‘utf-8’.</dd>\n<dt>debug-mode</dt>\n<dd>Set to ‘on’ to turn on debug mode in Zope. Defaults to ‘off’.</dd>\n<dt>verbose-security</dt>\n<dd>Set to ‘on’ to turn on verbose security (and switch to the Python security\nimplementation). Defaults to ‘off’ (and the C security implementation).</dd>\n<dt>effective-user</dt>\n<dd>The name of the effective user for the Zope process. Defaults to not setting\nan effective user.</dd>\n<dt>ip-address</dt>\n<dd>The default IP address on which Zope’s various server protocol\nimplementations will listen for requests. If this is unset, Zope will listen\non all IP addresses supported by the machine. This directive can be\noverridden on a per-server basis in the servers section. Defaults to not\nsetting an ip-address.</dd>\n<dt>port-base</dt>\n<dd>Offset applied to the port numbers used for ZServer configurations. For\nexample, if the http-server port is 8080 and the port-base is 1000, the HTTP\nserver will listen on port 9080. This makes it easy to change the complete\nset of ports used by a Zope server process. Zope defaults to 0.</dd>\n<dt>http-address</dt>\n<dd>Give a port for the HTTP server. Defaults to 8080.</dd>\n<dt>http-fast-listen</dt>\n<dd>Set to off to defer opening of the HTTP socket until the end of the Zope\nstartup phase. Defaults to on. Note: This option requires Zope &gt;= 2.11.</dd>\n<dt>ftp-address</dt>\n<dd>Give a port for the FTP server. This enables the FTP server.</dd>\n<dt>webdav-address</dt>\n<dd>Give a port for the WebDAV server.  This enables the WebDAV server</dd>\n<dt>webdav-force-connection-close</dt>\n<dd>Valid options are off and on. Defaults to off</dd>\n<dt>icp-address</dt>\n<dd>Give a port for the ICP server. This enables the ICP server.</dd>\n<dt>client-home</dt>\n<dd>Sets the clienthome for the generated instance.\nDefaults to ${buildout:directory}/var/&lt;name of the section&gt;.</dd>\n<dt>var</dt>\n<dd>Used to configure the base directory for all things going into var.\nDefaults to ${buildout:directory}/var.</dd>\n<dt>event-log</dt>\n<dd>The filename of the event log. Defaults to var/log/${partname}.log</dd>\n<dt>event-log-custom</dt>\n<dd>A custom section for the eventlog, to be able to use another\nevent logger than <cite>logfile</cite></dd>\n<dt>event-log-level</dt>\n<dd>Set the level of the console output for the event log. Level may be any of\nCRITICAL, ERROR, WARN, INFO, DEBUG, or ALL. Defaults to INFO.</dd>\n<dt>z2-log</dt>\n<dd>The filename for the Z2 access log. Defaults to var/log/${partname}-Z2.log.</dd>\n<dt>z2-log-level</dt>\n<dd>Set the log level for the access log. Level may be any of CRITICAL, ERROR,\nWARN, INFO, DEBUG, or ALL. Defaults to WARN.</dd>\n<dt>access-log-custom</dt>\n<dd>Like <cite>event-log-custom</cite>, a custom section for the access logger, to be able\nto use another event logger than <cite>logfile</cite>.</dd>\n<dt>file-storage</dt>\n<dd>The filename where the ZODB data file will be stored.\nDefaults to var/filestorage/Data.fs.</dd>\n<dt>demo-storage</dt>\n<dd>If ‘on’ it enables the demostorage. It is not compatible with blob-storage\nand rel-storage.</dd>\n<dt>blob-storage</dt>\n<dd>The name of the directory where the ZODB blob data will be stored.</dd>\n<dt>rel-storage</dt>\n<dd><p>Allows to set a RelStorage instead of a FileStorage.</p>\n<p>Contains settings separated by newlines, with these values:</p>\n<ul>\n<li>type: any database type supported (postgresql, oracle, mysql)</li>\n<li>RelStorage specific keys, like <cite>cache-servers</cite> and <cite>poll-interval</cite></li>\n<li>all other keys are passed on to the database-specific RelStorage adapter.</li>\n</ul>\n<p>Example:</p>\n<pre>rel-storage =\n  type oracle\n  dsn (DESCRIPTION=(ADDRESS=(HOST=s01))(CONNECT_DATA=(SERVICE_NAME=d01)))\n  user tarek\n  password secret\n</pre>\n</dd>\n<dt>zeo-client</dt>\n<dd>Set to ‘on’ to make this instance a ZEO client. In this case, setting the\nzeo-address option is required, and the file-storage option has no effect.\nTo set up a ZEO server, you can use the plone.recipe.zope2zeoserver recipe.\nDefaults to ‘off’.</dd>\n<dt>shared-blob</dt>\n<dd>If ‘zeo-client’ is set to ‘on’ and ‘blob-storage’ is set to a directory that\nis shared between this instance and the ZEO server (as configured by the\n‘blob-dir’ setting on zeo.conf, then setting ‘shared-blob’ to ‘on’ causes\nthis instance not to stream the blob file through the ZEO connection, but\njust to send the information of the file location to the ZEO server.</dd>\n<dt>zeo-address</dt>\n<dd>Set the address of the ZEO server. Defaults to 8100.</dd>\n<dt>zeo-client-name</dt>\n<dd>Set the name of the ZEO client. Defaults to the name of the part. If a false\nvalue is provided no zeo-client-name will be set.</dd>\n<dt>zeo-client-cache-size</dt>\n<dd>Set the size of the ZEO client cache. Defaults to ‘30MB’.</dd>\n<dt>zeo-client-client</dt>\n<dd>Set the persistent cache name that is used to construct the cache\nfilenames. Persistent cache files are disabled by default.</dd>\n<dt>zeo-storage</dt>\n<dd>Set the storage number of the ZEO storage. Defaults to ‘1’.</dd>\n<dt>zeo-var</dt>\n<dd>Used in the zeo storage snippets to configure the zeo var folder.\nDefaults to $INSTANCE_HOME/var.</dd>\n<dt>zeo-username</dt>\n<dd>Enable ZEO authentication and use the given username when accessing the\nZEO server. It is obligatory to also specify a zeo-password.</dd>\n<dt>zeo-password</dt>\n<dd>Password to use when connecting to a ZEO server with authentication\nenabled.</dd>\n<dt>zeo-realm</dt>\n<dd>Authentication realm to use when authentication with a ZEO server. Defaults\nto ‘ZEO’.</dd>\n<dt>zodb-cache-size</dt>\n<dd>Set the ZODB cache size, i.e. the number of objects which the ZODB cache\nwill try to hold. Defaults to 5000.</dd>\n<dt>zodb-cache-size-bytes</dt>\n<dd>Set the ZODB cache sizes in bytes. Requires ZODB 3.9 or later.</dd>\n<dt>zserver-threads</dt>\n<dd>Specify the number of threads that Zope’s ZServer web server will use to\nservice requests. You shouldn’t change this unless you know what you are\ndoing. Zope’s default is 4.</dd>\n<dt>zodb-temporary-storage</dt>\n<dd>If given Zope’s default temporary storage definition will be replaced by\nthe lines of this parameter.</dd>\n<dt>environment-vars</dt>\n<dd><p>Define arbitrary key-value pairs for use as environment variables during\nZope’s run cycle.</p>\n<p>Example:</p>\n<pre>environment-vars =\n  TZ US/Eastern\n  TMP /var/tmp\n  DISABLE_PTS True\n</pre>\n</dd>\n<dt>zope-conf-additional</dt>\n<dd><p>Give additional lines to zope.conf. Make sure you indent any lines after\nthe one with the parameter.</p>\n<p>Example:</p>\n<pre>zope-conf-additional =\n  locale fr_FR\n  http-realm Slipknot\n</pre>\n</dd>\n<dt>relative-paths</dt>\n<dd>Set this to <cite>true</cite> to make the generated scripts use relative\npaths. You can also enable this in the <cite>[buildout]</cite> section.</dd>\n<dt>no-shell</dt>\n<dd>The traditional way to run Zope is by using shell scripts. These in\nturn start-up a Python process with the right settings. By setting\nthis option to true (default false) these shell scripts will not be\nused. In this case the recipe will directly start the Python\nprocess.</dd>\n</dl>\n</div>\n</div>\n<div id=\"changelog\">\n<h2>Changelog</h2>\n<div id=\"id1\">\n<h3>3.6 (2009-10-11)</h3>\n<ul>\n<li>Expanded the RelStorage options, including keep-history and replica-conf.\n[hathawsh]</li>\n</ul>\n</div>\n<div id=\"id2\">\n<h3>3.5 (2009-09-05)</h3>\n<ul>\n<li>Added support for relative-paths in the script generation.\n[jvloothuis]</li>\n<li>When <cite>zope-conf</cite> is set the config file will be directly loaded from that\nlocation (it previously created a stub zope.conf which included it).\n[jvloothuis]</li>\n<li>Added an option to avoid using the normal shell scripts for starting Zope.\nThis makes it possible to avoid the hard-coded paths in these scripts.\n[jvloothuis]</li>\n<li>Allow the blob-dir parameter in RelStorage configurations.\n[hathawsh]</li>\n</ul>\n</div>\n<div id=\"id3\">\n<h3>3.4 (2009-08-12)</h3>\n<ul>\n<li>Support in line with fix for LP#407916.\n[gotcha]</li>\n<li>Changed the ‘mkzopeinstance’ call respect the ‘bin-directory’ option.\n[esteele]</li>\n<li>Removed the <cite>zope2-egg</cite> option and the simple startup script from the recipe.\nWe assume that we have an egg distribution if <cite>zope2-location</cite> is not set.\n[hannosch]</li>\n<li>Merged the <cite>davisagli-eggified-zope</cite> branch into the trunk.\n[hannosch]</li>\n<li>Add a new icp-address option. This is useful for environments where\ne.g. squid is used to front a Zope/ZEO cluster. See\n<a href=\"http://www.zope.org/Members/htrd/icp/intro\" rel=\"nofollow\">http://www.zope.org/Members/htrd/icp/intro</a>\n[neaj]</li>\n</ul>\n</div>\n<div id=\"id4\">\n<h3>3.3 - 2009-07-07</h3>\n<ul>\n<li>Add handling for RelStorage options.\n[elro]</li>\n<li>Reinstall scripts on update which appears to be good recipe practice.\n[stefan]</li>\n</ul>\n</div>\n<div id=\"id5\">\n<h3>3.2 - 2009-04-02</h3>\n<ul>\n<li>Add a new zcml-additional option. This is useful for environments where\nnon-code configuration (such as database connection details for\nore.contentmirror) are managed through zcml.\n[wichert]</li>\n</ul>\n</div>\n<div id=\"id6\">\n<h3>3.1 (2009-03-15)</h3>\n<ul>\n<li>The 2.9 fix for spaces caused a problem using debug (bug 337740)\ndue to the way do_debug passed the “-i” command line argument\nto get_startup_cmd.\n[smcmahon]</li>\n</ul>\n</div>\n<div id=\"id7\">\n<h3>3.0 (2009-02-27)</h3>\n<ul>\n<li>The 2.9 fix for the instance run command was itself broken and\nwould fail on anything except Windows.\n[smcmahon]</li>\n<li>Changed the <cite>zope2-egg</cite> option to omit any kind of instance creation for\nnow. The mkzopeinstance script relies on being able to import Zope2, which\nis not available when buildout runs.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id8\">\n<h3>2.9 (2009-02-26)</h3>\n<ul>\n<li>The instance run command was vulnerable to spaces in pathnames, and\nneeded some extra quoting for win32.\n[smcmahon]</li>\n<li>Check for existence of windows scripts before patching them. Some\nLinux distributions of Zope2 don’t have these files.\n[smcmahon]</li>\n<li>Delegate commands to <tt>win32serviceutil.HandleCommand()</tt> on win32,\ninstead of starting the interpreter through <tt>os.system()</tt>. Should\nshave off a couple seconds from overall time taken to process those\ncommands.\n[sidnei]</li>\n<li>Compute <tt>serviceClassString</tt> ourselves, since we are calling this\nas a module and not directly as <tt>__main__</tt>, otherwise the service\nwon’t be installed correctly.\n[sidnei]</li>\n</ul>\n</div>\n<div id=\"id9\">\n<h3>2.8 (2008-12-05)</h3>\n<ul>\n<li>Add more tests for ZEO client with blob and demo storages.\nStill no test on ‘shared-blob-dir’ option.\n[encolpe]</li>\n<li>Always use ‘r’-style strings for passing script and configuration\nfilenames (eg: on ‘instance run &lt;script&gt;’).\n[sidnei]</li>\n<li>Add a demo-storage option and tests.\n[encolpe]</li>\n<li>Add a first test for blob-storage.\n[encolpe]</li>\n</ul>\n</div>\n<div id=\"id10\">\n<h3>2.7 (2008-11-18)</h3>\n<ul>\n<li>Added a <cite>zope2-egg</cite> option and an accompanying simple startup script for\nuse with an eggified Zope2.\n[hannosch]</li>\n<li>Do not fail with a Zope2 egg checkout.\n[hannosch]</li>\n<li>Normalize first argument to os.spawnl. It can get really upset\notherwise (dll import failure on a relocatable python install).\n[sidnei]</li>\n<li>Use same quoting as on ‘do_foreground’ for servicescript\nusage. Fixes problems with installing the buildout-based Plone\ninstaller for Windows on a path with spaces.\n[sidnei]</li>\n<li>Ensure that do_foreground leaves self.options.program arguments as it\nfound them.  This makes it possible to use ‘fg’ and ‘debug’ more than\nonce within the same control session.\n[klm]</li>\n</ul>\n</div>\n<div id=\"id11\">\n<h3>2.6 (2008-10-22)</h3>\n<ul>\n<li>Normalize, absolutize and lowercase-ize (is that a word?) paths\nbefore comparing, to avoid problems with relative filenames and\ndifferent drive letter case on Windows.\n[sidnei]</li>\n</ul>\n</div>\n<div id=\"id12\">\n<h3>2.5 (2008-09-22)</h3>\n<ul>\n<li>Add support for zodb-cache-size-bytes from ZODB 3.9 and later.\n[wichert]</li>\n</ul>\n</div>\n<div id=\"id13\">\n<h3>2.4 (2008-07-15)</h3>\n<ul>\n<li>Introduced zope.conf variables “INSTANCEHOME” and “CLIENTHOME”.\nIts very very helpful in cluster setups with zope-conf-additional\nsections (buildout lacks to reference the current section).\n[jensens]</li>\n<li>Made test command compatible with zope.testing 3.6.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id14\">\n<h3>2.3.1 (2008-06-10)</h3>\n<ul>\n<li>No code changes. Released to fix the 2.3 release which put .egg files in\nthe wild.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id15\">\n<h3>2.3 (2008-06-06)</h3>\n<ul>\n<li>Need to actually pass in deprecation-warnings, otherwise we get a\nKeyError.\n[sidnei]</li>\n<li>Fix another place where the directory name needed to be escaped to\navoid problems with spaces.\n[sidnei]</li>\n<li>Don’t try to delete location if it does not exist.\n[sidnei]</li>\n</ul>\n</div>\n<div id=\"id16\">\n<h3>2.2 (2008-06-06)</h3>\n<ul>\n<li>Added <cite>deprecation-warnings</cite> option that allows turning the option\nto disable deprecation warnings on or off. You can provide the value\n<cite>error</cite> to it, and every deprecation warning will be turned into an\nexception.\n[sidnei]</li>\n<li>Fix copy and paste error that caused a failure on changing\nrunzope.bat to call servicewrapper.py.\n[sidnei]</li>\n<li>Escape ‘executable’ argument before passing it to os.spawnl, in\norder to make it work on Windows when the executable name has spaces\non it.\n[sidnei]</li>\n<li>Added <cite>http-fast-listen</cite> option. Use of this option requires Zope &gt;= 2.11.\n[stefan]</li>\n</ul>\n</div>\n<div id=\"id17\">\n<h3>2.1 (2008-06-05)</h3>\n<ul>\n<li>Fixed a test problem on Windows, where explicit closing of files is required.\n[hannosch]</li>\n<li>Call <cite>servicewrapper.py</cite> from <cite>runzope.bat</cite> instead of setting\n<cite>PYTHONPATH</cite> and calling <cite>Zope2/Startup/run.py</cite>. That way we set\nsys.path from inside Python code and avoid exceeding the maximum\nenvironment variable limit.\n[sidnei]</li>\n<li>Allow to use an alternative temporary storage, by specifying the new\n<cite>zodb-temporary-storage</cite> option.\n[jensens]</li>\n<li>Added <cite>environment-vars</cite> option to set environment variables. Changed\nthe zope-conf-additional example code to something that isn’t covered by\nthe recipe.\n[claytron]</li>\n</ul>\n</div>\n<div id=\"id18\">\n<h3>2.0 (2008-05-29)</h3>\n<ul>\n<li>Do not use system but exec when starting Zope. This makes it possible for\nprocess management tools to properly manage Zope processes.\n[wichert]</li>\n<li>Added <cite>site-zcml</cite> option\nAdded tests\n[mustapha]</li>\n<li>Add support for ZEO authentication. Note that this does not work with any\nreleased Zope or ZODB version at this moment. See\n<a href=\"http://mail.zope.org/pipermail/zope/2005-October/161951.html\" rel=\"nofollow\">http://mail.zope.org/pipermail/zope/2005-October/161951.html</a> for required\npatches.\n[wichert]</li>\n<li>Added FTP and WebDAV options\n[claytron]</li>\n<li>Allow rel-storage to be an empty string, meaning ‘do not use relstorage’.\nThis allows an extending buildout configuration to disable relstorage again.\n[mj]</li>\n</ul>\n</div>\n<div id=\"id19\">\n<h3>1.9 (2008-04-15)</h3>\n<ul>\n<li>Fix rel-storage parsing for options with spaces. Note that split() or\nsplit(None) already strips the string.\n[mj]</li>\n</ul>\n</div>\n<div id=\"id20\">\n<h3>1.8 (2008-04-05)</h3>\n<ul>\n<li>Fixed a Win32 problem in which the presence of Python string escapes in the\npath to zope.conf (e.g., d:botestpartsinstanceetczope.conf would escape\nthe b). This showed up when using the ‘run’, ‘debug’ or ‘adduser’ commands.\nThis fixes #211416.\n[smcmahon]</li>\n<li>Added <cite>console</cite> command to the instance script, which is equivalent to fg but\ndoes not implicitly turn on debug mode but respects the zope.conf setting.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id21\">\n<h3>1.7 (2008-03-31)</h3>\n<ul>\n<li>Added new client-home option and let it default to a subfolder of the\nbuildout-wide var folder with a subfolder of the name of the section.\n[hannosch]</li>\n<li>Added limited support for running tests under Zope &lt;= 2.8.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id22\">\n<h3>1.6 (2008-03-27)</h3>\n<ul>\n<li>Fixed runzope script generation for Zope 2.8.\n[hannosch]</li>\n<li>Cleaned up “./bin/instance test” option handling.\n[stefan]</li>\n<li>Removed generator expressions as these aren’t supported in &lt; py2.4, which is\nused by zope 2.7/8.\n[duffyd]</li>\n</ul>\n</div>\n<div id=\"id23\">\n<h3>1.5 (2008-02-29)</h3>\n<ul>\n<li>Added <cite>access-log-custom</cite> option to be able to use another event logger\nthan the file one for the access logger.\n[tarek]</li>\n<li>Fix instance generation to work on Windows with blanks in the path name.\nThis closes #188023.\n[hannosch, gotti]</li>\n<li>Added ‘zeo-client-client’ option which results in ‘client &lt;value&gt;’ inside\n&lt;zeoclient&gt;.\n[timte, hannosch]</li>\n<li>Made relstorage handling more generic, so it now supports any RelStorage\nadapter, including Oracle (which was broken).\n[mj]</li>\n</ul>\n</div>\n<div id=\"id24\">\n<h3>1.4 (2008-02-23)</h3>\n<ul>\n<li>Fix typo in event log parameter name (from “z-log” to “z2-log”), to comply\nwith the documentation. This closes #190943.\n[kdeldycke]</li>\n<li>Create pid and lock file folders if they don’t exist.\n[kdeldycke]</li>\n<li>Remove hard-coded log level and use the event_log_level parameter to set it\ndynamically. This closes #190994.\n[kdeldycke]</li>\n<li>Added a test environment, using zc.buildout.testing, and a doctest that\ntries the recipe.\n[tarek]</li>\n<li>Added an <cite>event-log-custom</cite> option\n[tarek]</li>\n<li>Added example for the zope-conf-additional option. This closes #185539.\n[klm, hannosch]</li>\n<li>Added <cite>rel-storage</cite> option to be able to wire Zope to RelStorage\n(postgresql/oracle) instead of a FileStorage database.\n[tarek]</li>\n</ul>\n</div>\n<div id=\"id25\">\n<h3>1.3</h3>\n<ul>\n<li>For each entry in recipe-specified ‘extra-paths’ line, add a ‘path’ line\nto the instance and Zope client zope.conf files.\n[klm]</li>\n</ul>\n</div>\n<div id=\"id26\">\n<h3>1.2</h3>\n<ul>\n<li>Added the boolean <cite>shared-blob</cite> option, defaulting to <cite>no</cite>. If all of\n<cite>zeo-client</cite>, <cite>blob-storage</cite> and <cite>shared-blob</cite> options are set,\nthe instance will assume the blob directory set by <cite>blob-storage</cite> is shared\nwith the server instead of streaming ‘blob’ files through the ZEO connection.\n[rochael]</li>\n<li>Changed <cite>ctl.do_foreground()</cite> (which is invoked by the <cite>fg</cite> command\nline argument) start Zope in debug mode to emulate the behavior of\n<cite>zopectl fg</cite>. This required a little special WIN32 code to make\nsure it would work in both <cite>*nix</cite> and Windows.\n[smcmahon]</li>\n<li>Added <cite>var</cite> option, which is used to configure the base directory for all\nthe things going into var.\n[hannosch]</li>\n<li>Added <cite>zeo-var</cite> option, which is used in the zeo storage snippets to\nconfigure the zeo var folder.\n[hannosch]</li>\n<li>Merged rochael-blobsupport branch. Added support for ZODB 3.8 blob storage\nconfiguration for ZEO clients. This references\n<a href=\"https://bugs.launchpad.net/collective.buildout/+bug/179113\" rel=\"nofollow\">https://bugs.launchpad.net/collective.buildout/+bug/179113</a>.\n[rochael, hannosch]</li>\n<li>Added <cite>zeo-client-name</cite> option. Defaults to the name of the ZEO client.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id27\">\n<h3>1.1</h3>\n<ul>\n<li>Small documentation update. Added link to the bugtracker.\n[hannosch]</li>\n<li>Changed default of zope.conf option ‘default-zpublisher-encoding’ to ‘utf-8’\ninstead of Zope’s default value of ‘iso-8859-15’.</li>\n<li>Have PID file’s location default to ‘${buildout:directory}/var/${name}.pid’.\nKeeping the PID file in $INSTANCE_HOME gives trouble when buildout rebuilds\nthe part.\n[nouri, mustapha]</li>\n</ul>\n</div>\n<div id=\"id28\">\n<h3>1.0</h3>\n<ul>\n<li>Increased ‘zodb_cache_size’ default value to 5000, which is more likely a\nbetter default these days.\n[hannosch]</li>\n<li>Added support for ‘extra-paths’ as in ‘zc.recipe.egg’; this is useful when\nusing regular python packages for which no eggs are available (yet), i.e.\nwith ‘plone.recipe.distros’.\n[witsch]</li>\n<li>Added zeo-storage option (merge branch ree-add-zeo-storage-option).\n[ree]</li>\n<li>Avoid doubled entries to eggs specified in the buildout in ‘sys.path’:\nthe working set (‘ws’) gets passed again when installing the script\n(‘bin/instance’), but it is not also added to ‘extra_paths’.\n[witsch]</li>\n<li>Patching ‘PYTHONPATH’ in the Zope startup skripts should insert all\nadditional paths (to eggs) __before__ ‘SOFTWARE_HOME’, because otherwise\n(newer) egg versions of components from the standard Zope distribution\n(i.e. stuff that lives in ‘lib/python’) cannot be used.\n[witsch]</li>\n<li>Changed the option to suppress deprecation warnings to “–nowarn” or\n‘–nowarning” to be consistent with “zopectl test”.\n[witsch]</li>\n<li>Added option “-w” to allow the test runner to suppress deprecation warnings,\nso it’s easier to spot failing tests…\n[witsch]</li>\n<li>Updated import for Zope 2.7 (and below) compatibility.\n[duffyd]</li>\n<li>Merging -r51966:52659 claytron-zopeconfoptions branch to trunk.\n[claytron]</li>\n<li>Made the config snippet prettier while still getting the resulting\nindentation right.\n[witsch]</li>\n</ul>\n</div>\n<div id=\"id29\">\n<h3>0.9</h3>\n<ul>\n<li>Added support for zodb 3.8’s “&lt;blobstorage&gt;” directive.\n[witsch]</li>\n<li>Added a script name arg before callint zope.testing.testrunner.run.\nzope.testing.testrunner:1772, get_options removes the first arg from\nthe list of arguments expecting a script name there. Was causing\n“bin/instance test” to behave improperly.\n[rossp]</li>\n</ul>\n</div>\n<div id=\"id30\">\n<h3>0.8</h3>\n<ul>\n<li>Use bin if present falling back to utilities. This makes it possible to use\na Zope version installed from a tarball and not compiled inplace.\n[rossp]</li>\n</ul>\n</div>\n<div id=\"id31\">\n<h3>0.7</h3>\n<ul>\n<li>Found the problem with strange environment variables.\n[hannosch]</li>\n<li>Fixed documentation bug, the cache size is respected by non-zeo instance as\nwell.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id32\">\n<h3>0.6</h3>\n<ul>\n<li>J1m actually read the docs ;)\n[hannosch]</li>\n<li>Attempt to fix the sometimes insane number of tests which are found by the\ntest runner.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id33\">\n<h3>0.5</h3>\n<ul>\n<li>Added an option to set the effective-user.\n[optilude]</li>\n</ul>\n</div>\n<div id=\"id34\">\n<h3>0.4</h3>\n<ul>\n<li>Generate a bin/repozo script to perform backups using repozo.py (and\nset up the appropriate pythonpath for this to work).\n[optilude]</li>\n<li>Document options properly, and add the ability to specify a zope.conf\nfile explicitly rather than having one generated from a template.\n[optilude]</li>\n</ul>\n</div>\n<div id=\"id35\">\n<h3>0.3</h3>\n<ul>\n<li>Finally found a way to provide the Zope Windows service with the right\nenvironment. We need a new wrapper script, which sets up the PYTHONPATH.\n[hannosch]</li>\n<li>Make it possible to configure the name of the zopectl script using the\ncontrol-script option in the [instance] section.\n[wichert]</li>\n</ul>\n</div>\n<div id=\"id36\">\n<h3>0.2</h3>\n<ul>\n<li>Extend support for zcml slugs to include Zope 2.9.\n[dunny]</li>\n<li>Added support for making a ZEO-client.\n[regebro]</li>\n</ul>\n</div>\n<div id=\"id37\">\n<h3>0.1</h3>\n<ul>\n<li>Initial implementation.\n[hannosch]</li>\n</ul>\n</div>\n</div>\n\n          </div>"}, "last_serial": 793496, "releases": {"0.0.1": [{"comment_text": "", "digests": {"md5": "2dbd86c628189eb8fa1d5347a2846013", "sha256": "447c36de12bbf9d98eaa1a4a2d43abde199d117eecb844f32a0da7fc12e377ed"}, "downloads": -1, "filename": "isotoma.recipe.zope2instance-0.0.1.tar.gz", "has_sig": false, "md5_digest": "2dbd86c628189eb8fa1d5347a2846013", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 32297, "upload_time": "2010-05-25T15:38:38", "upload_time_iso_8601": "2010-05-25T15:38:38.905153Z", "url": "https://files.pythonhosted.org/packages/cc/cb/a1457283c5b7eab7945484fd9e1538fec6004f8242dc7bd931d1e6ffe682/isotoma.recipe.zope2instance-0.0.1.tar.gz", "yanked": false}], "0.0.2": [{"comment_text": "", "digests": {"md5": "eeafbbba45bd4b1f4fbf161bed5a4d0a", "sha256": "b6dff19feab75ced11f3adc34ce7d90ae3c0f5dbe78e79fe6ad93dee20a4266f"}, "downloads": -1, "filename": "isotoma.recipe.zope2instance-0.0.2.tar.gz", "has_sig": false, "md5_digest": "eeafbbba45bd4b1f4fbf161bed5a4d0a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 38374, "upload_time": "2010-05-25T16:04:53", "upload_time_iso_8601": "2010-05-25T16:04:53.154685Z", "url": "https://files.pythonhosted.org/packages/bf/45/327ce6c22fcbccca267fee544a19bf5cc0febb95bfdaabcbc7bd0760891c/isotoma.recipe.zope2instance-0.0.2.tar.gz", "yanked": false}], "0.0.3": [{"comment_text": "", "digests": {"md5": "fe5969cadf4a9f175f2093c91a779102", "sha256": "303d70ef20947a744374e8b7af9ae3424241c1ce3951b8e5201b339c420edfa3"}, "downloads": -1, "filename": "isotoma.recipe.zope2instance-0.0.3.zip", "has_sig": false, "md5_digest": "fe5969cadf4a9f175f2093c91a779102", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 50069, "upload_time": "2010-12-21T13:10:13", "upload_time_iso_8601": "2010-12-21T13:10:13.812087Z", "url": "https://files.pythonhosted.org/packages/3f/55/4598f6ce9e649bfb81967875413b7b9c945ae4438303453162d9701ad7cc/isotoma.recipe.zope2instance-0.0.3.zip", "yanked": false}], "0.0.4": [{"comment_text": "", "digests": {"md5": "42e17414afbeb0a65fdb1df288fc33ea", "sha256": "94279b7d5604fe51fa2c595356d9844a3ea4030ede01cbe1eb394c52d6e79f4d"}, "downloads": -1, "filename": "isotoma.recipe.zope2instance-0.0.4.tar.gz", "has_sig": false, "md5_digest": "42e17414afbeb0a65fdb1df288fc33ea", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 36947, "upload_time": "2012-10-05T12:58:51", "upload_time_iso_8601": "2012-10-05T12:58:51.870387Z", "url": "https://files.pythonhosted.org/packages/1b/00/a8ee3bd133a552f8183f95c448337ccb4f2c1bfa40bb294f6dc6f498997f/isotoma.recipe.zope2instance-0.0.4.tar.gz", "yanked": false}], "0.0.5": [{"comment_text": "", "digests": {"md5": "14679ca371e495dd6b77cdbe05b2086a", "sha256": "131f1c877e5c434a0721568be4dc488ef397bab8ebab0e0e4d772d46223e33a0"}, "downloads": -1, "filename": "isotoma.recipe.zope2instance-0.0.5.tar.gz", "has_sig": false, "md5_digest": "14679ca371e495dd6b77cdbe05b2086a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 36956, "upload_time": "2012-10-05T16:37:32", "upload_time_iso_8601": "2012-10-05T16:37:32.396307Z", "url": "https://files.pythonhosted.org/packages/87/f9/d7d85265c9ed9f01cb948f8a1614a1be45bd7674758772f4e56d5cbac2ea/isotoma.recipe.zope2instance-0.0.5.tar.gz", "yanked": false}], "0.0.6": [{"comment_text": "", "digests": {"md5": "8325d116a30b36f9c769ad65e39e488b", "sha256": "63ce1757fe43febacad167705d0a08accfd1e8884f06449fae7359ff17362530"}, "downloads": -1, "filename": "isotoma.recipe.zope2instance-0.0.6.tar.gz", "has_sig": false, "md5_digest": "8325d116a30b36f9c769ad65e39e488b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 36961, "upload_time": "2012-10-05T16:39:36", "upload_time_iso_8601": "2012-10-05T16:39:36.896235Z", "url": "https://files.pythonhosted.org/packages/6c/45/388065d1544c0215da6c96b06427920d99e8fd5d1736de37e38e0d270627/isotoma.recipe.zope2instance-0.0.6.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "8325d116a30b36f9c769ad65e39e488b", "sha256": "63ce1757fe43febacad167705d0a08accfd1e8884f06449fae7359ff17362530"}, "downloads": -1, "filename": "isotoma.recipe.zope2instance-0.0.6.tar.gz", "has_sig": false, "md5_digest": "8325d116a30b36f9c769ad65e39e488b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 36961, "upload_time": "2012-10-05T16:39:36", "upload_time_iso_8601": "2012-10-05T16:39:36.896235Z", "url": "https://files.pythonhosted.org/packages/6c/45/388065d1544c0215da6c96b06427920d99e8fd5d1736de37e38e0d270627/isotoma.recipe.zope2instance-0.0.6.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:53:56 2020"}