{"info": {"author": "Peter Bengtsson", "author_email": "mail@peterbe.com", "bugtrack_url": null, "classifiers": ["Framework :: Zope2", "Programming Language :: Python"], "description": "IssueTrackerProduct\n===================\n\nIssueTrackerProduct is a bug/issue tracker for Zope2.\n\nThis project started in around 2001 and was originally called\nSiteTracker. The suffix \"Product\" comes from the fact that to external\nplugins added to Zope2 projects where placed in the \"Product\" directory.\n\n\nChangelog\n=========\n\n0.14.2 (unreleased)\n-------------------\n\n- Nothing changed yet.\n\n\n0.14.1 (2013-07-21)\n-------------------\n\n- Eggify product [sureshvv]\n\n- Display time in user's TZ [sureshvv]\n\n0.13.1 (2013-01-01)\n-------------------\n\n    Bug fixed. Rare condition of sorting filtered issues could cause a\n    TypeError.\n\n0.13.0 (2013-01-01)\n-------------------\n\n    Bug fixed. Saved filter cookies were saved with just the ID of the\n    issuetracker instance which could cause conflicts on different\n    issuetrackers under the same ID.\n\n    Bug fixed. Issue duplication check with brackets or quotation\n    marks could cause a ParseError due to ZCatalog search.\n\n    New feature. Ability to edit actual time per followup if you're\n    manager or author.\n\n    Bug fixed. Thread default actual_time_hours to 0.0 so you can use\n    the ZMI property sheet to update it.\n\n    New feature. Greatly optimized how getModifyTimestamp is done on\n    the whole IssueTracker.\n\n    Bug fixed. Adding followups on out-of-date trackers without the\n    'threaddate' DateIndex is now not failing with an error.\n\n    New feature. Full issue activity report if you enable \"Actual time\n    per follow up\"\n\n    Bug fixed. Follow ups weren't indexed properly when created. Had\n    to Update Everything to update monthly summary report.\n\n    New feature. All whitespace optimized .css and .js files are put\n    into subdirectory called `.autogenerated`.\n\n0.12.0 (2013-01-01)\n-------------------\n\n    New feature. All CSS and JS that was served as DTML now served as\n    plain files.\n\n    New feature. Urgency of an issue included in the subject line of\n    notifications.\n\n    Bug fixed. Badly raised UnicodeDecodeError on parsing emails in.\n\n    Bug fixed. Finding and making links to issues with IDs higher than\n    the current number of digits used for IDs not matches.\n\n    New feature. Can enable so that 'Always notify' means it sends\n    notifications on all followups and not just new issues.\n\n    New feature. Followup duplicates are only duplicates if they have\n    the same name and content and was posted within 5 minutes. (Thanks\n    Radim)\n\n    New feature. Mobile web XHTML version which is lighter and more\n    optimized CSS margins.\n\n    Bug fixed. Possible KeyErrors raised on deleting session keys when\n    running Zope in a cluster.\n\n    Bug fixed. CSS corrected so body of issue text gets the same font\n    as the rest of the page.\n\n    New feature. Ability to override which email addresses to notify\n    on a followup.\n\n0.11.0 (2013-01-01)\n-------------------\n\n    Bug fixed. Saved filters that refer to objects that no longer\n    exist could cause an error on the filter option.\n\n    New feature. Monthly summary report\n\n    New feature. By default ID is shown with title on new Issue\n    Tracker instances.\n\n    Bug fixed. Page AddIssue now security protected with the same\n    permission as for submitting issues.\n\n    New feature. Made IssueTrackerProduct work in Zope 2.12. (Thanks\n    Suresh V)\n\n    New feature. Now possible to filter by assignees.\n\n    New feature. Home page list of recent issues is much optimized by\n    using the catalog to search by 'modifydate'.\n\n    Bug fixed. Editing urgency and type on submitted issues could\n    cause UnicodeDecodeError.\n\n    New feature. Added Markdown as a display format option if installed.\n    To enable, just install markdown on the python path.\n\n    Bug fixed. Previewing an issue with chosen sections that are\n    non-ASCII caused a UnicodeDecodeError.\n\n    New feature. DEFAULT_ENCODE_EMAILDISPLAY is disabled by default in\n    new trackers. Issuetrackers are rarely public.\n\n    Bug fixed. Custom checkbox boolean fields whose values were True\n    appeared as a unchecked checkbox on editing details (Real#0893)\n\n\n    Bug fixed. Custom checkbox boolean fields whose values were False\n    didn't show up issue details.\n\n    Bug fixed. Inability to set the defaultsections Thanks Jean\n    (Real#0880)\n\n    Bug fixed. Emails encoded in unicode-1-1-utf-7 encoded as utf-7\n\n    Bug fixed. Email in body parsed correctly into Unicode.\n\n    New feature. Clairvoyant Javascript optimized with JSON.\n\n    New feature. Menu icons in a CSS Sprite for much faster loading.\n\n    Bug fixed. Manually reset ID counters could cause excessive\n    recursion when generiting IDs. (Real#0659) Thanks Nicholas\n\n    Bug fixed. Inability to change password if user folder is\n    configured to encrypt stored passwords. (Real#0823) Thanks Greg\n\n    New feature. Inbound emails with header \"X-Autoreply yes\" are\n    ignored (Real#0855). Thanks Nicholas\n\n    New feature. Loading the \"Delete issue\" form is done in AJAX if\n    Javascript is enabled.\n\n    Bug fixed. Unicode options for the Default sections. (Real#0672)\n\n    New feature. Which list you were at is remembered when visiting an\n    issue even after reloading the issue page. Not just for searches.\n\n    New feature. Made DEFAULT_INCLUDE_DESCRIPTION_IN_NOTIFICATIONS\n    default to True so that by default the issue description is shown\n    in the email notifications.\n\n    Bug fixed. Emails in with a subject line containing the word\n    'General' without a section option called that failed.\n\n    New feature. Upgraded to latest version of jQuery 1.3.2.\n\n    New feature. Added UnicodeSplitter to be able to properly index\n    and search Unicode text.\n\n0.10.3 (2013-01-01)\n-------------------\n\n    Bug fixed. Fixed dispatcher() so that it doesn't break on deleted\n    issues.\n\n    Bug fixed. CMF member can be None without breaking. (Real#0811)\n\n    New feature. Issue ID is included in the subject line of email-in\n    receipts if set up to show ID with the title. Real#0797\n\n    New feature. Select custom fields become multiple-selects when used\n    as a filter. Real#0784, Real#0762\n\n    Bug fixed. Loaded filter options in AJAX now with stopped client\n    cache. Real#0782, Thanks Jack.\n\n    Bug fixed. File attachments of followups weren't immediately\n    indexed.\n\n    Bug fixed. Sometimes followup objects weren't index properly by\n    path. This was not a problem when the catalog was only used for\n    searching but now it's used to count issues too.\n\n    New feature. Detail changes to issues are recorded and shown on\n    the issue page.\n\n    New feature. If you upload a file whose exact name is a method or\n    a template the IssueTrackerProduct itself the files get\n    automatically renamed.\n\n    New feature. Search smarter by not doing a wildcard search on\n    titles unless not found exactly anywhere else.\n\n    Bug fixed. Static file's from misc_ set an incorrect header called\n    Cache-Length.\n\n    New feature. Assignee name shown in rich list on List Issues.\n    (Real#0757)\n\n    New feature. Document title is changing when a clarvoyant message\n    appears on followups.\n\n    New feature. Assignee is including in the CSV export from List\n    Issues. (Real#0764)\n\n    Bug fixed. Always notify could accidentally send emails to people\n    not necessarily in the always notify list but with the same first\n    name of the full name.\n\n0.10.2 (2013-01-01)\n-------------------\n\n    Bug fixed. Fix to make it work in Zope 2.11 with content_types\n    being deprecated. Real#0759, Thanks Pat Heffernan.\n\n    Bug fixed. Javascript shortcuts not working when writing a\n    non-quick followup (e.g. completing an issue)\n\n    Bug fixed. Email address allowed non-ascii characters.\n\n    Bug fixed. Javascript keyboard shortcuts not loaded correctly on\n    adding issue.\n\n0.10.1 (2013-01-01)\n-------------------\n\n    Bug fixed. Sometimes it was not possible to complete a followup\n    draft since the action was incorrectly set to \"Add Followup\" not\n    \"AddFollowup\".\n\n    New feature. Much performance improved home page now since\n    CountStatuses() now uses the catalog instead. Must press Update\n    Everything button.\n\n    New feature. Only the firstname is show in the menu when logged in.\n\n    New feature. Upgraded to the latest jQuery 1.2.6 and removed\n    jquery-latest.pack.js\n\n    Bug fixed. Reloading Add Issue form with multiple select custom\n    fields selected would cause a TypeError. Thanks Nicolas.\n\n    Bug fixed. IssueTracker User Folder allowed to save non-unicode\n    full names.\n\n    Bug fixed. Uncataloging saved filters before the saved filters\n    catalog had been set up could cause an AttributeError.\n\n    Bug fixed. Custom fields in filters where nothing is an option\n    could cause the filter to filter out all issues.\n\n    Bug fixed. Filtering on custom fields that are lines or ulines\n    would give a ugly filtername that looks like a repr of a python\n    list or tuple.\n\n    Bug fixed. Custom field selects with forced values overrides the\n    list of options.\n\n    Bug fixed. Fixed a bug where some saved followup drafts weren't\n    saved as Unicode.\n\n    Bug fixed. Custom field type validity check failed on values that\n    were already lists or tuples and don't need to be converted to a\n    list.\n\n    Bug fixed. Custom fields that were \"ulines\" or \"lines\" and\n    multiple=\"multiple\" would become nested lists until flattened.\n\n    New feature. Any filtering done by spider bots are not\n    persistently saved.\n\n0.10.0 (2013-01-01)\n-------------------\n\n    New feature. Custom fields!\n\n0.9.3 (2013-01-01)\n-------------------\n\n    Bug fixed. Loading a saved draft followup that didn't have an\n    action would raise an error.\n\n    Bug fixed. Loading filter options in Konquerer would load the AJAX\n    request 3 times for one click.\n\n    Bug fixed. Saved filters container was never imploded even if the\n    container had more saved filters in it than allowed.\n\n    Bug fixed. Saving filters when only the fromname is known would\n    raise an UnmatchableError.\n\n    Bug fixed. NameError when checking for emails in and nothing to\n    download. Thanks Luciano (Real#0743)\n\n\n0.9.2 (2013-01-01)\n-------------------\n\n    Bug fixed. When accepting multipart emails and html2safehtml is\n    not installed the default part to keep is now the text/plain part.\n\n    Bug fixed. Loading a saved draft followup that didn't have an\n    action would raise an error.\n\n    Bug fixed. Loading filter options in Konquerer would load the AJAX\n    request 3 times for one click.\n\n    Bug fixed. Saved filters container was never imploded even if the\n    container had more saved filters in it than allowed.\n\n    Bug fixed. Saving filters when only the fromname is known would\n    raise an UnmatchableError.\n\n0.9.1 (2013-01-01)\n-------------------\n\n    Bug fixed. Saved cookies with where only the name is known could\n    cause an error on the /User page.\n\n    Bug fixed. Delete issue form did not work.\n\n0.9.0 (2013-01-01)\n-------------------\n\n    New feature. If you pass the spambot prevention test it's\n    remembered in a cookie for the next 60 days rather than just for\n    the session.\n\n    New feature. When you've added an issue the URL it redirects to no\n    longer ends with ?NewIssues=Submitted. Cleaner URLs.\n\n    New feature. Really long URLs in the text that extend beyond the\n    box it's in is truncated shorter.\n\n    Bug fixed. Having statuses containing unicode characters could\n    break the statistics page. Thanks Rene Bonvin. (Real#0735)\n\n    New feature. Basic statistics is not private by default from now\n    on. You can still make it private from the Advanced Properties page.\n\n    New feature. Statuses can now be configured to contain unicode\n    characters.\n\n    New feature. The persistent list of saved filters is now indexed\n    with a separate ZCatalog to vastly speed up lookups of old saved\n    filters.\n\n    Bug fixed. Saved filters containing unicode characters could cause\n    a UnicodeDecodeError.\n\n    Bug fixed. Unicode characters in a filtered name would show\n    incorrectly when loading the filter options.\n\n    Bug fixed. Having statuses containing unicode characters could\n    break the statistics page. Thanks Rene Bonvin. (Real#0735)\n\n    New feature. Basic statistics is not private by default from now\n    on. You can still make it private from the Advanced Properties page.\n\n    New feature. Statuses can now be configured to contain unicode\n    characters.\n\n    New feature. The persistent list of saved filters is now indexed\n    with a separate ZCatalog to vastly speed up lookups of old saved\n    filters.\n\n    Bug fixed. Saved filters containing unicode characters could cause\n    a UnicodeDecodeError.\n\n    Bug fixed. Unicode characters in a filtered name would show\n    incorrectly when loading the filter options.\n\n    Bug fixed. Search on title with wildcards (e.g. *keyword* matching\n    'subkeywords') only if no other title searches matched.\n\n    Bug fixed. Emails with tabs in header values were before\n    incorrectly stripped of this whitespace causing the set of headers\n    to be shortened. Thanks Jesse Perry\n\n    Bug fixed. getIssueObjects() would break with KeyError if a\n    reference to a join-in issuetracker (see bottom of Advanced\n    properties) is broken.\n\n    Bug fixed. Reassigned issues didn't say \"assigned\" on the List\n    Issues. Thanks NiBar (Real#0711)\n\n    New feature. Added new method called getReportIssues() that takes\n    the id of the report as an only parameter and it returns all the\n    issues that report would find.\n\n    New feature. Search result highlighting can be switched off with a\n    Javascript-created link similar to Gmail.\n\n    Bug fixed. Encoded email address in a autorefresh are re-encoded.\n\n    Bug fixed. Possible UnicodeDecodeError if using normal acl_users\n    user folder with a unicode fromname.\n\n    New feature. File attachments initially hidden and covered with a\n    Javascript opener.\n\n    New feature. Change assignment form expands automatically on focus.\n\n    Bug fixed. Filter switcher (\"Do only show\"/\"Do not show\") had a\n    Javascript error on a missing variable called 'label'.\n\n    New feature. Ability to disable \"Show them all\" as a batching\n    option. Very useful when there are many issues because showing this\n    page will slow your Zope down.\n\n    Bug fixed. Name hidden wasn't hidden on home page.\n\n    New feature. List of issues on home page periodically refreshed\n    with AJAX.\n\n    Bug fixed. Download of dodgy emails without a To. part now skipped\n    (Real#0700, thanks Jesse Perry)\n\n    New feature. File attachment links have a rel=\"nofollow\" now.\n\n    New feature. Ability to hook up pre- and post scripts that are\n    called before and after issues are submitted.\n    http.//www.issuetrackerproduct.com/Documentation/How-Tos/pre-post-SubmitIssue\n\n    Bug fixed. Confidential issues could be seen by logged in people\n    by changing their email address to an email address of someone else.\n    (Real#0696, thanks NiBar)\n\n    Bug fixed. Keyboard shortcut for comparing issues changed from 'c'\n    to 'g'+'d' since the 'c' cause interference with Ctrl-C for copying.\n    (Real#0697, thanks Jesse Perry)\n\n    New feature. Skipped notifications when not dispatching on submit.\n    Means that if you let a cronjob send the notifications instead of\n    immediately sending them, some notifications are cancelled if the\n    people who are email have already followed up. (Real#0686)\n\n    Bug fixed. rss.xml and rdf.xml weren't protected by the View\n    permission. (Real#0695, thanks Jesse Perry)\n\n    Bug fixed. Changed default encoding from \"utf8\" to \"utf-8\" to make\n    sure older IEs gets it right.\n\n    Bug fixed. Header in CSV file for \"ID\" replaced by \"Issue ID\"\n    (Real#0687)\n\n    Bug fixed. Clairvoyant AJAX checks' interval increases now slowly as\n    the page gets older.\n\n    Bug fixed. Issues were uncataloged twice when deleting causing a\n    harmless extra message in the event log.\n\n0.8.3 (2013-01-01)\n-------------------\n\n    Bug fixed. Clairvoyant javascript alert on followups would repeat\n    the same message over and over (almost blinking).\n\n    New feature. Name and email is saved in a cookie when working on a\n    draft if the name/email isn't already set.\n\n    Change. If in DEBUG mode (environment variable\n    DEBUG_ISSUETRACKERPRODUCT) emails are printed to stdout\n\n0.8.2 (2013-01-01)\n-------------------\n\n    Bug fixed. Error on duplicate in on second followups in issues.\n    Real#0665 and Real#0666\n\n0.8.1 (2013-01-01)\n-------------------\n\n    Bug fixed. The clarvoyent AJAX feature would show if someone is\n    working a different issue to the one you're looking at.\n\n0.8.0 (2013-01-01)\n-------------------\n\n    New feature. Ability to compare issues (experimental). Only works\n    when using keyboard shortcuts. Key. c\n\n    New feature. Now you can assign an issue to anybody even after\n    it's been created and even if it didn't already have an assignment.\n    Real#0299, Real#0188, Real#0081\n\n    Bug fixed. Sending assignment emails from a user with non-ASCII\n    name would cause an UnicodeDecodeError.\n\n    New feature. Uses jQuery 1.2.1\n\n    Bug fixed. Cancelling a go-to-issue keyboard command caused a\n    Javascript error.\n\n    New feature. Upgraded to addhrefs 0.9.3\n\n    Bug fixed. preParseEmailString would sometimes barf on unicode\n    strings for translation.\n\n    Bug fixed. UnicodeDecodeError wasn't raised properly in processing\n    inbound email reply and formatflowed_decode() was called with wrong\n    parameter. Thanks Robert Leftwich (Real#0642)\n\n    Bug fixed. When you reply via email to an issue, no notification\n    was sent to those involved in the issue. Thanks Robert Leftwich.\n    (Real#0413)\n\n    New feature. When you reach the last line in any textarea input\n    (eg. on adding a new issue) the textarea box automatically expands\n    to add a few extra blank lines.\n\n    New feature. Expires header set to all static content and set much\n    further into the future for better HTTP caching.\n\n    New feature. The Tell-a-friend and Subscribe-to-changes has been\n    moved down below the issue threads.\n\n    Bug fixed. Fixed possible XSS hole. Name and email checking now\n    done when adding issues and followups.\n\n    Bug fixed. Emails in unicode (non-ascii) characters could lead to\n    email notifications being sent out incorrectly.\n\n    New feature. The autorefresh interval starts on 3 seconds interval\n    and increases the interval length by 30% each time it incurs.\n    http.//www.issuetrackerproduct.com/News/autorefresh-intervals/\n\n    Bug fixed. multiple drafts were created sometimes.\n\n    New feature. fromname, title and description of issues and\n    followups are now stored as unicode! The default encoding is utf8.\n\n    New feature. If you run Python 2.4 on your Zope you can configure\n    the POP3 to use SSL. Thanks Shane Graber\n\n    New feature. Possible to disable the 'Tell a friend' feature for\n    anonymous users (eg. spambots for example). Thanks Fred Damberger\n\n0.7.3 (2013-01-01)\n-------------------\n\n    Bug fixed. .svn and CVS folders could be created when you Update\n    Everything.\n\n    New feature. New version of addhrefs.py version 0.9.2.\n\n    New feature. QuickAddIssue now shows the spambot prevention if\n    switched on. Real#0343\n\n    Bug fixed. Redirecting out on duplicate status change would cause\n    a TypeError. This happens when two people simultaneuously for\n    example Take an issue.\n\n    Bug fixed. Change user details didn't work when you're not logged\n    in as a CMF user.\n\n    Bug fixed. ShowIssueData template mixed up ShowIssueURLOption with\n    ShowConfidentialOption. Thanks Peter Eddy. Real#0332\n\n    Bug fixed. Edit notifyable error. Real#0320\n\n    New feature. Ability to enable a spambot prevention technique to\n    assert that posters are humans.\n    (see Properties->Advanced->Enable spambot prevention)\n\n    Bug fixed. When using IssueTrackerProduct on top of Plone the\n    authenticated member was selected incorrectly. Thanks Greg Baker\n    (Real#0315)\n\n    Bug fixed. get_cookie() typo should have been self.get_cookie().\n    Thanks Greg Baker (Real#0312)\n\n    Bug fixed. Javascript autorefresh didn't work with URLs ending in\n    'index_html'. Thanks Maheshg Real#0298\n\n    Bug fixed. Odd emails with ISO-8859 encoding that aren't really\n    ISO-8859 encoded could cause a TypeError. Thanks Mirco Attocchi\n    Real#0300.\n\n    Bug fixed. POP3 email parsing could fail if email didn't have a\n    message-id.\n\n    New feature. \"Select all\" button on the Spam protection page.\n\n    Bug fixed. Bug in saving of spam keywords on duplicate keywords\n    across combinations fixed.\n\n    Bug fixed. Not possible to change an issues Confidential status\n    through the \"change details\" form even if Confidential option was\n    enabled. Real#0281\n\n0.7.2 (2013-01-01)\n-------------------\n\n    Bug fixed. Nasty bug in name/email gets blanked on issue\n    submission even the issuetracker remembers the users name as part\n    of the instance persistency. Thanks Rakesh, Ramy, Pradeep Real#0268\n\n    Bug fixed. getPreviewTitle() on followups could get potentially\n    confused if you tried to put on hold.\n\n    New feature. Spam protection built in. Click Management tab, Spam\n    protection to configure the spam keywords. Only applicable to\n    public issuetrackers really.\n\n    Bug fixed. ACL accounts where the username == full name couldn't\n    be sent to in the Always notify property. Thanks Ed Leafe Real#0266\n\n    Bug fixed. ValueError in pop3 checking with mismatched case in the\n    subjectline. Thanks Eric Real#0265\n\n    New feature. Ability to control wether to reveal the new issue URL\n    of issues created via inbound email. Instead of the issue's URL it\n    shows the ID like #0001. (Thanks Bob Gimlich Real#0263)\n\n    Bug fixed. Emailed in issues with signature had incorrect\n    linebreaks in HTML looking like this. <br\\s\\*/>\n\n    New feature. The URL option on Add Issue is now by default\n    switched off (available on Properties, Advanced) on all new\n    instances.\n\n    New feature. Now you can control the menu items through the\n    Properties tab. Follow the \"Configure the menu\" link.\n\n    Bug fixed. When renaming an issuetracker, ACL users defined within\n    and used in issues, threads and assignments got link broken. Now a\n    new function called _renameOldPaths() takes care of this.\n\n    Bug fixed. The CSV export includes titles of join-in issuetrackers\n    like on List Issues. (thanks Kosmas Real#0249)\n\n    New feature. You can search a comma separated list of issue ids in\n    serveral suitable formats like '#0123, 124, 0125, #126'.\n\n0.7.1 (2013-01-01)\n-------------------\n\n    Bug fixed. Searching and finding exactly one matched issue yielded\n    a TypeError about len() that happens just before the redirect to the\n    issue.\n\n    Bug fixed. getNextActionIssues() got confused when ACL logged in\n    users had submitted their last replies to issues via email and\n    included it wrongly.\n\n    Bug fixed. timeSince() could return \"2 weeks and 0 days\" when it\n    should just be \"2 weeks\".\n\n    Bug fixed. Id with title in <title> tag (Real#0236)\n\n    Bug fixed. Badly formatted email replies that don't use > but\n    split the new and old text with \"-----Original Message------\" can\n    now be splitted correctly.\n\n0.7.0 (2013-01-01)\n-------------------\n\n    New feature. \"drafts\" folder is (if possible) created as\n    BTreeFolder2 (Real#0228)\n\n    Bug fixed. Automatic refresh in Opera 8.51 fixed.\n\n    Bug fixed. Some of the fancy javascript stuff didn't work in IE5\n    and IE5.5 but now they at least don't give any error messages.\n\n    New feature. It is now possible to switch off the Tell a Friend\n    feature from the Show Issue page. (Real#0219)\n\n    Bug fixed. Followups could be autosaved even if they didn't have\n    any text. (Real#0220)\n\n    Bug fixed. Failed email sendouts failed on the error catching\n    because of a typo.\n\n    New feature. 'Your next action issues' list on homepage. Disabled by\n    default but can be enabled on the user settings page.\n\n    Bug fixed. Searching and finding only one issue when filters are\n    on is now more careful. (Real#0072)\n\n    New feature. When you set up accepting emails for a POP3 account\n    you can also blacklist certain email address like '\\*@hotmail.com'.\n    You can also whitelist exceptions to the blacklist patterns.\n\n    New feature. Being able to change issues once added is now\n    governed by a permission called 'Change Issue Tracker Issues'.\n\n    New feature. You can now reply to issue notifications sent out\n    from an issuetracker if the sitemaster email address is one of the\n    accepting emails in the POP3 setup. This makes it possible to\n    completely discuss an issue without even using a web browser.\n    Parsing of the replies is best done with Formatflowed installed.\n\n    New feature. POP3 inbound email feature now prevents duplicates\n    and it is now possible to use this without deleting emails from\n    the server.\n\n    Bug fixed. Typo for 'remember_savedfilter_persistently' cookie key\n    reference which caused excessive LOG() messages.\n\n    New feature. Autosave for followups enabled. Autosaving is now\n    only done when focus is on the subject or description/comment.\n\n    New feature. Ability to specify Estimated time and Actual time as\n    attributes on an issue. See Advanced Properties tab if interested.\n\n    New feature. A much improved searchterm-highlighter that doesn't\n    highlight words like 'a' when their inside a word like th*A*t.\n\n    New feature. New Advanced option that disallows adding issues with\n    a potentially duplicate subject/title.\n\n    New feature. keyboardshortcuts.js which allows you to use the\n    keyboard to navigate. Enabled only if selected on the User page.\n\n0.6.13 (2013-01-01)\n-------------------\n\n    New feature. Which used filter used is only remembered in one\n    session, if you're a Issue User you can set it to remember this\n    persistently. Thanks Jan Kokoska for the push (Real#0186)\n\n    Bug fixed. Applying a filter when inside the Complete List page\n    would redirect back to List Issues. Thanks Benjamin Higgins\n    (Real#1087)\n\n    Bug fixed. It was not possible to change the \"URL\" for an issue\n    when using the little \"change details\" form on the issue display.\n\n    New feature. CleanOldSavedFilters() (part of Update Everything)\n    can now tidy up the amount of saved filters stored inside an\n    issuetracker. Needed as part of fixing Real#0183.\n\n    Bug fixed. Subscription form caused invalid XHTML. (Thanks John J\n    Lee)\n\n    Bug fixed. If you had a Zope object called Reports somewhere in\n    the acquisition path, you could get an AttributeError. getScripts\n    on the Home page. Thanks David Snowsill (Real#0180)\n\n    Bug fixed. Statistics page didn't work with a completely new\n    issuetracker instance. Thanks Tim Sparkes.\n\n    Bug fixed. User page now usable with old Konqueror (Real#0158)\n\n    Bug fixed. CSV export notates issue IDs with # so that\n    Excel/oocalc doesn't try to make the issue ID into an integer.\n\n    New feature. Introduced new js-core.js javascript page for general\n    functions that all pages can use. (beware those who have\n    StandardHeader.zpt checked out!)\n\n    Bug fixed. CSS is now alos cached with the more modern\n    'Cache-Control' header thanks to advise from Dieter Maurer.\n\n    Bug fixed. When running a report the batching links didn't work Real#0172\n\n    New feature. Every time you run a report it remembers globally how\n    many issues where found.\n\n    Bug fixed. The homepage could say that an issue was from Today or\n    Yesterday because it mathematically was so by arithmatic but did not\n    take midnight into account to show what really was Today and\n    Yesterday.\n\n0.6.12 (2013-01-01)\n-------------------\n\n    New feature. Header background and issue header background gets a\n    gradient shade instead of single coloured.\n\n    Bug fixed. When moving to storage in a BTreeFolder the internal ID\n    counter was lost and counting of issues was done where there are\n    longer any issues resulting in odd issue IDs. (thanks Jason Powers\n    Real#0167)\n\n    New feature. \"Recently added issues\" and \"Recently visited issues\"\n    have been merged into one list \"Recent issues\".\n\n    Bug fixed. Instances using a SecureMailHost had to see the To. and\n    From. headers repeated inside the email body.\n\n    New feature. File attachments to issues or followups contain\n    illegal characters are stripped to valid ids (Real#0169)\n\n    New feature. Long filenames are truncated when shown in the\n    issuedescription. Before they could overlap the other info.\n\n    New feature. An M$ Outlook inspired homepage listing of the latest\n    changes in issues that replaces the list of \"5 latest issues\".\n\n    New feature. If you use a Secure MailHost, the secureSend()\n    function is used instead to send emails.\n\n    Bug fixed. Revisiting saved thread drafts didn't work.\n\n    Bug fixed. If 'self.subscribers' in Issue objects were tuples,\n    they are now automatically converted to lists.\n    (thanks Oldrich Auda, Real#0163)\n\n    Bug fixed. User.zpt wasn't checkoutable with CheckoutableTemplates\n    (thanks Kosmas Chatzimichalis)\n\n    New feature. Adding issues is bound to a different permission name\n    \"Add Issue Tracker Issues\". It used to \"View\". This affects those\n    who use the \"Issue Tracker Manager\" and \"Issue Tracker User\" roles.\n\n    New feature. Mentions of other issues with a hash like #0150\n    becomes a hyperlink. (Real#0150)\n\n    Bug fixed. 'remember-filterlogic' request variable was only\n    considered for whether to session store the filterlogic, not the\n    filtervaluer.\n\n    Bug fixed. getEmailFromnameCombos() didn't fetch fromname and\n    email correctly thus disabling POP3 reading.\n\n    Bug fixed. fromname and email is saved additionally again when\n    you're logged in as Issue User Folder user.\n\n    Bug fixed. 'svn.//' or 'ssh+svn.//' URLs were shown  with a 'http.//'\n    first prefixed. (Real#0154)\n\n0.6.11 (2013-01-01)\n-------------------\n\n    New feature. Experimental Upgrade tab inside the Management tab.\n\n    Bug fixed. The migration for Zope 2.8.0 on the ZCatalog wasn't\n    backwardscompatible. The migration script is now wrapped in a if\n    statement so that it's only run if it exists.\n\n    New feature. Press Update Everything to make sure all issues and\n    threads have the latest name and email if users are defined in a\n    Issue User Folder.\n\n    Bug fixed. _getOthers() was still using self.email instead of\n    self.getEmail() on issues which meant trouble if the submitter of\n    the issue would be a Issue User Folder submitter with no previously\n    submitted issues.\n\n    New feature. From Advanced Properties you can set scores for each\n    status and calculate a guesstimate overall status progress.\n\n    Bug fixed. When adding an issue, request variables are now only\n    taken from REQUEST.form which avoids any cookies or session\n    variables. (Thanks Eric Bressler Real#0152)\n\n    Bug fixed. All references to REQUEST.AUTHENTICATED_USER gone.\n    (Real#0057)\n\n    Bug fixed. Password reminders could not find SecureMailHost\n    mailhost objects to send emails via when outside an issuetracker.\n\n    Bug fixed. Bug reporting and error handling used the old address\n    to the Real issuetracker. Now it's using real.issuetrackerproduct.com.\n\n    Bug fixed. Spam detection on inbound emails are now also checked\n    on lowercase header keys which can be the case on some servers.\n\n    Bug fixed. Fixed potential bug where default_display_format\n    attribute isn't set on the class instance (Real#0129)\n\n    Bug fixed. Now works with Zope 2.8.0 (Real#0108, Real#0136,\n    Real#0120). Make sure you press the \"Update Everything\" button\n    after installation.\n\n    New feature. By default Save Drafts is now set to True.\n\n    Bug fixed. Bad optimization of ListIssues|CompleteList could\n    result in AJAX for showing/hiding filter options didn't work.\n\n    Bug fixed. getFromname and getEmail in Issue class could get KeyError\n    if a user has been moved.\n\n    New feature. All sourcecode cleaned up with Pyflakes\n    (http.//divmod.org/projects/pyflakes)\n\n    Bug fixed. The \"Allow issue attribute change\" property now\n    actually does something. You can now post-submission change the\n    issue attributes such as section and urgency.\n\n0.6.10 (2013-01-01)\n-------------------\n\n    Bug fixed. addissue.js had a malformed line which caused incorrect\n    Javascript code if you use slimmer 0.1.16 which could result in\n    autosaving not working on the Add Issue page.\n\n    New feature. Statistics got a barchart on issues by status.\n\n    New feature. Drafts are cleaned up on issue submission unless a\n    draft_issue_id is available. (Real#0126)\n\n    Bug fixed. \"Notify the others\" on followup form only listed names\n    with a valid email address. (Real#0123)\n\n    Bug fixed. RSS feed sort order is now the same as the of the Home\n    page. (Real#0124)\n\n    Bug fixed. RSS feed escaped with CDATA instead of both that and\n    HTML quoted. (Real#0125)\n\n0.6.9 (2013-01-01)\n-------------------\n\n    Bug fixed. If no name or email on the issue and the user, it\n    would say that you're already subscribing to an issue. (Thanks\n    Benjamin Higgins Real#0113)\n\n    New feature. Deleting drafts from the Add Issue page is done with\n    AJAX.\n\n    New feature. if you want to use a Secure Mail Host instead of the\n    default Mail Host, it is now recognized as 'SecureMailHost' but\n    'MailHost' still takes precedence.\n\n    Bug fixed. Which type of List Issues was remembered but not used\n    if you were logged in as Issue User. (Thanks Marcus Scotti, Real#0110)\n\n    Bug fixed. Filter on fromname didn't work due to a bug in a\n    regular expression. (Thanks Fred Damberger, Real#0103)\n\n    Bug fixed. getEmail() and getName() would raise an\n    error if the acl_users (if applicable) folder can't be found, which\n    might be the case when importing an issuetracker.\n\n    Bug fixed. DeployStandards checked folder existance with\n    acquisition.\n\n    New feature. If AJAX works the filter options are loaded with AJAX\n    otherwise loaded as a new page request (on the List Issues or\n    Complete List).\n\n    New feature. When you search on multiple words, an alternative\n    search link appears that puts \"or\" between all words. (Real#0102)\n\n    New feature. export.csv makes it possible to download all issues in\n    one single CSV file. If you enabled 'CSV export link' in the\n    Advanced properties you can export the current set to CSV.\n\n    Bug fixed. Assignment form no longer shown on Complete List\n    (Real#0101)\n\n    Bug fixed. The first saved draft wouldn't pop up again on Add\n    Issue. Real#0079 became reproducable and fixed.\n\n    New feature. AddIssue and QuickAddIssue is autosaving drafts now with AJAX.\n\n    New feature. Inbound emails with header X-Spambayes-Classification=spam\n    is automatically deleted and not uploaded.\n\n    New feature. Option to enforce a different stylesshet\n    http.//www.issuetrackerproduct.com/Documentation/How-Tos/forced-stylesheet\n\n    Bug fixed. Assigned, Added, followups etc. on the User tab were\n    sorted such old ones were shown first in the list. Reversed that.\n    (Real#0078)\n\n    New feature. If an error occurs the an error log file is only\n    created if the error type is *not* in zope's error_log object\n    on Zope2.7. (Real#0077)\n\n    New feature. Which list you want to use is now stored in a cookie\n    rather than a session.\n\n0.6.8 (2013-01-01)\n-------------------\n\n    Bug fixed. Emails couldn't be sent out if you had converted to\n    storing all issues in a BTreeFolder2. So if you were using that,\n    this fix will renable email dispatch for probably several unsent\n    emails.\n\n    New feature. Mention who added the issue on always notify messages\n    (Real#0086)\n\n    Bug fixed. Password reminder for Issue User Folder (Real#0025)\n\n    Bug fixed. The 'subscribers' can no longer be set when\n    instanciating the IssueTrackerIssue class. This solves Real#0033.\n\n    New feature. When showing the issue it shows the age next to the\n    date it was submitted, like on the List Issues.\n\n0.6.7 (2013-01-01)\n-------------------\n\n    Bug fixed. It was not possible to create a Issue User Folder.\n    Thanks Jeff for Real#0073.\n\n    Bug fixed. The default sort order is now 'issuedate' and not\n    modification date which was not recommended.\n\n    Bug fixed. Who you choose with Tell-a-Friend is no longer\n    remembered in a cookie. Can't remember why it was even doing it\n    before.\n\n    New feature. It is now possible to change the assignments if\n    you're the one it's assigned to (Real#0045)\n\n    Bug fixed. You couldn't use the View permission toggle because of\n    a typo caused by legacy code. Thank you Goeldi (Real#0068)\n\n    Bug fixed. Added SendInboundEmailConfirm_script.py back until a\n    more grand solution has been found.\n\n0.6.6 (2013-01-01)\n-------------------\n\n    New feature. Added firstname filtering as mentioned in Real#0065\n\n    New feature. If subscription option on, when you look at an issue\n    that you're already involved in, you do not get the option to\n    subscribe since you're already implicitily a subscriber. (Real#0047)\n\n    New feature. Filter settings you make are remembered persistently.\n    They are stored with a (hopefully) descriptive english title. You\n    can at any time select a previously used filter and apply it again.\n\n    Bug fixed. Successfully telling a friend will no longer show the\n    more options form again.\n\n    New feature. Have fixed all source code to consistently use 4\n    spaces for tabs. Before there was mix which could cause problems\n    for other people except the author who uses jed (which doesn't\n    care about the difference)\n\n    New feature. AddIssue now has well defined tabindexes.\n\n    Bug fixed. Finally Real#0014 has been solved thanks to Petter\n    Warnsberg of Swede Ltd. It's called the \"Holly hack\" and we\n    managed to reproduce it and see how it started to not blank out\n    the followup box.\n\n    New feature. Lists on the User page are now shortened with an option\n    to show all.\n\n    New feature. If you assign an issue to someone who is also on the\n    'always notify' list it used to send out two emails. One about the\n    new issue and one about the assignment. Not it only sends the\n    assignment one. (Real#0026)\n\n    New feature. Link to Add Issue on Quick Add Issue takes what you\n    started writing with you to Add Issue. Thanks Jan (Real#0054)\n\n    New feature. Printing issues (and consequently CompleteList) now\n    looks much better with all the forms and navs hidden.\n\n    Bug fixed. If you use \"Tell a Friend with more options\" and change\n    the default message, the default message was still what was sent.\n\n    Bug fixed. Issue threads and notification objects' ids are now\n    incremented sanely. Before it was 1,3,5,7,... now it's 1,2,3,4,...\n\n    New feature. NotYetRecent not in the URL when issue added (Real#0048)\n\n    New feature. \"Images in menu\" and \"Can add new sections\" now part of\n    the Properties Wizard.\n\n    Bug fixed. If the display format is StructuredText and the text is\n    just a number (eg. a telephone number) it *was* converted to a\n    numbered list. UPDATE. this introduce a new bug that is now fixed.\n\n    Bug fixed. If you tried to upload an image that doesn't exist it\n    would return hard error when it tried to create a thumbnail.\n\n    Bug fixed. New issues weren't saved to the BTreeFolder2 if you had\n    set to use one.\n\n    Bug fixed. Fixed the hard ParseError on stopword searches (Real#0024)\n\n    New feature. If you have lots of issues you can now change the issue\n    tracker to store all issues in a BTreeFolder2 container instead.\n    This changes the URLs but if you accidently use a stale URL it will\n    redirect you to the correct new issue URL.\n\n    New feature. Issues are now movable in the ZMI. (Real#0030)\n\n    New feature. Much improved Properties tab that uses web standards\n    and Javascript. Degrades perfectly.\n    See http.//www.issuetrackerproduct.com/News/improved-properties-tab\n\n    Bug fixed. Lots of tidying up of the XHTML to make tidy happier.\n\n    Bug fixed. Fixed bug in relative_url() due to new feature below.\n\n    Bug fixed. Displaying issues without the \"Encode email links\" option\n    on would cause a problem with addhrefs version 0.6\n    (Thank you Jan Real#0034)\n\n    New feature. discovery of absolute_url_path() replaces custom\n    method.\n\n    New feature. Ids are shown on the *left* of titles now (Real#0032)\n    (if you enable showing ids with the title)\n\n    Bug fixed. Email addresses found inside an issue or a followup\n    text is also encoded if that option is on.\n    (http.//www.peterbe.com/plog/add-hrefs-III)\n\n    New feature. Option for Issue Users to enable keyboard shortcuts.\n\n    Bug fixed. Due to a typo in getFilterValue() filters weren't saved\n    in the SESSION so if you go anywhere else the filter options were\n    forgotten.\n\n    Bug fixed. Filters on lists from the user tab now work. Real#0010\n\n    Bug fixed. Home page looked dodgy with no issues but Recent search\n    history. Real#0002\n\n    Bug fixed. Use of builtin False caused bombing out NameError for\n    people who use Python2.1. (Also fixed some SyntaxWarnings for\n    Python2.1) This fixes Real#0028. Thanks Stephan Goeldi.\n\n0.6.5 (2013-01-01)\n-------------------\n\n    Bug fixed. Pressing the Update Everything button twice caused a\n    CatalogError because it tried to add certain indexes twice.\n\n0.6.4 (2013-01-01)\n-------------------\n\n    Bug fixed. When writing a followup to an issue in the form at the\n    bottom of the page and change your mind to use another action the\n    text you've written is remembered. (Real#0020)\n\n    New feature. New (advanced) option to show the issue Id next to the\n    title of the issue in all displays. (asked for by Brent Skinner)\n\n    New feature. If your search term is an issue id prefixed with a #\n    it goes immediately to that issue without searching inside titles\n    or descriptions.\n\n    Bug fixed. POP3 management page could say that you need to have a\n    folder called 'pop3' when it was not necessary (Real#0023)\n\n    Bug fixed. Menu lost focus on Add Issue when you pressed the Save\n    draft button.\n\n    Bug fixed. Some hex encoded characters didn't show up correctly in\n    the User template and shortening them went wrong in the Add Issue\n    drafts list (if you have one).\n\n    New feature. Previewing a followup or an issue now shows properly\n    which people will be notified once it's submitted.\n\n    New feature. User tab now has a list for all issues you are\n    subscribed to.\n\n    New feature. Issues and threads are now indexed in the ZCatalog\n    with the ZCTextIndex instead to give much better search results\n    when searching for issues. It's faster and more advanced.\n    (Press the Update Everything button to activate it)\n\n    New feature. Using a search term which is a section, status, type,\n    urgency, fromname or email will make a special filter-link appear\n    under the search box.\n\n    New feature. _searchCatalog() is now more careful to not fetch\n    thread objects that don't exist. (thanks Mark Thomas, Real#0018)\n\n    New feature. Great speed optimization to ListIssues and CompleteList.\n\n    Bug fixed. Resaving the cookie with draft issues now makes sure\n    there's no stale drafts in the cookie.\n\n    New feature. Compact and Rich lists in ListIssues. Default is Rich\n    which is the good old list but if you click Compact you get a\n    compacter list. See bottom of ListIssues page.\n\n    New feature. People who can log in as Issue Users to an IssueTracker\n    that is publically available can enable auto-login which means\n    they're taken passed the login page when they come back.\n\n    Bug fixed. Cookies expiration is again stored with proper RFC822\n    format.\n\n    Bug fixed. Fixed some issues with the tell_a_friend feature\n    for issue users where their name wasn't found.\n\n    New feature. Check in SubmitIssue() prevents duplicates. Same\n    happens for new followups.\n\n    Bug fixed. Fixed some filtering links from the Statistics page.\n\n    New feature. Now you can specify Issue User Folder usernames\n    in the Always notify property too.\n\n    New feature. Added a standard_error_message with user-friendly\n    error messages and directions for bug reporting.\n\n0.6.3 (2013-01-01)\n-------------------\n\n    Bug fixed. CheckoutableTemplates was made a requirement for\n    IssueTrackerProduct to start. Caused broken objects for people\n    without CheckoutableTemplates.\n\n    Bug fixed. HTML escaped in displayBriefTitle() used in Recent\n    History and Home page but HEX HTML entities preserved.\n\n0.6.2 (2013-01-01)\n-------------------\n\n    Bug fixed. Made ValidEmailAddress() return True for foo'bar@some.com\n\n    Bug fixed. Typo in IssueUserFolder made it impossible change\n    'must_change_password'.\n\n    Bug fixed. Improvements to feature about new sections (see below)\n\n    Bug fixed. Improved how a Issue User saves display_format\n\n    New feature. New option for making it possible to add new sections\n    to an issuetracker when adding a new issue. (feature disabled by\n    default. see Properties tab)\n\n    New feature. Implemented a much faster unique() function.\n\n    Bug fixed. sendReturnErrorEmail() had a typo bug. (thanks Bart\n    Cortooms)\n\n    Bug fixed. _alwaysNotifyMessage() now gets the title of an issue\n    via the getTitle() method.\n\n    Bug fixed. Filtering links from the home page used the wrong\n    approach. Instead of showing the selected status it showed\n    everything else. Thanks Simon Lucy\n\n    Bug fixed. AcceptingEmail class inherited a whole module, not a\n    class. This caused problems with its attributes and methods.\n\n    Bug fixed. If 'slimmer' is installed, the Management, Properties and\n    POP3 tabs would turn black. This happened because\n    TemplateAdder.py had a bug where the 'optimize' parameter was\n    incorrectly remember.\n\n    Bug fixed. generateID() could raise a ValueError in Python2.1 if and\n    when the prefix is an empty string.\n\n    New feature. Option to disable XHTML optimization (if being applied)\n    with environment variable OPTIMIZE_ISSUETRACKERPRODUCT\n\n    Bug fixed. StandardHeader template could not be checked out even\n    though it was defined as a CheckoutableTemplate.\n\n    Bug fixed. Saving listlike properties through the Properties tab\n    would not filter duplicates.\n\n    New feature. this_package_home defined in IssueTracker class to\n    filter out templates when using showCheckoutableTemplates.\n\n0.6.1 (2013-01-01)\n-------------------\n\n    New feature. Installed addhrefs.py version 0.5.\n\n    New feature. Option in Properties tab to make default sort order by\n    modification- or by creation date. Also implemented in Properties\n    Wizard.\n\n    Bug fixed. Finding one issue when searching did not take the\n    searchterm with it so no highlighting.\n\n    Bug fixed. When initiating the ZCatalog, the 'title' TextIndex was\n    not attached to the Vocabulary which prevented wildcard searches on\n    the title.\n\n    Bug fixed. Previewing follow ups shows who will be notified but if\n    someone in that list has left their email blank they are now\n    ignored.\n\n    Bug fixed. Statistics could raise an UnboundLocalError in certain\n    sitautions.\n\n    Bug fixed. Assigning an issue to oneself does not check the little\n    checkbox about notifications that appears.\n\n    New feature. Installed the new addhrefs module\n    (see http.//www.peterbe.com/plog/add-hrefs-II)\n\n    Bug fixed. Using getRolesInContext(self) instead of getRoles() to\n    take extra care for local roles. (Thanks Danny W. Adair, Asterisk Ltd)\n\n    Bug fixed. Quick Add Issue could sometimes ask for Email when you\n    are logged in as a Issue User.\n\n    Bug fixed. If you delete an issue user the assignment as shown in\n    ShowIssueData will no longer raise an error.\n\n    Bug fixed. UnboundLocalError in dispatcher() caused notifications about\n    followups not to be sent out.\n\n    Bug fixed. If you forgot the subject line in a new issue, the REQUEST object\n    was not passed back to AddIssueTemplate properly.\n\n    Bug fixed. sendAlwaysNotify() is now wrapped with a nice try.except. catcher\n\n    Bug fixed. Displayformat for Issue Users sometimes forgotten.\n\n    Bug fixed. Switching on Issue Assignment was not backwardcompatible\n    with old instances.\n\n    Bug fixed. Was not compatible to Python 2.1 in HighlightQ().\n\n0.6.0 (2013-01-01)\n-------------------\n\n    Bug fixed. Assignees get notified with an email if not selected otherwise.\n\n    Bug fixed. It is now possible to specify a notifyable groupname as an\n    always notify. Will be very useful for teams that should all get\n    notified of an added issue.\n\n    New feature. You can now specify (in Properties tab) the signature to be\n    used for the email sendouts.\n\n    New feature. New option in properties makes it possible to have little\n    icons to go with the items on the menu bar. See Properties tab.\n\n    New feature. When logged in (standard ACL User or IssueTrackerUser) you\n    now get a page with all your related issues and followups.\n\n    New feature. An internal counter keeps track of what numerical increment\n    to use when generating the next Id for an issue or a follow up.\n    This works like sequences in PostgreSQL and prevents reappearing URLs\n    when issues have been deleted.\n\n    New feature. title tag now reflects what page you're on.\n\n    Bug fixed. JPEG file attachments uploaded when using Internet Explorer used\n    a non-standard content-type. (Thanks Melvin Jacobson)\n\n    Bug fixed. File attachments that aren't file attachments can not be\n    uploaded. Before one could manually write anything in the file attachment\n    input box and it would be treated as a file. (Thanks Melvin Jacobson)\n\n    New feature. Much improved information page about StructuredText with\n    simple quick examples.\n\n    New feature. Temporarily uploaded file attachments are now stored inside\n    the issue tracker instance instead of the global /temp_folder which should\n    do away with some low level persistency errors in Zope2.7.x.\n\n    New feature. A button on the Management tab (ZMI) that updates everything\n    that deploys standards, updates the ZCatalog, assures all objects have\n    the correct attributes and clears temporary uploaded file attachments.\n\n    New feature. A new and improved Properties Wizard.\n\n    New feature. When showing issues, the urgency is explicitly styled if\n    anything else than 'normal'. E.g. 'critical' is shown in bold and red.\n\n    New feature. Whenever you add an issue, the selected sections you chose\n    become more \"popular\" since their position in the list of options is moved\n    up one notch.\n\n    New feature. File attachments that are images are uploaded now with\n    a little thumbnail if PIL is installed.\n\n    New feature. Added a RSS 1.0 feed as the default feed. The 0.91 feed\n    can still be reached on /rss-0.91.xml.\n\n    Bug fixed. Certain strictly Management pages weren't secured for Zope\n    managers only. Now they are.\n\n    Bug fixed. When you update the catalog manually from the Management tab\n    it logged lots of ERROR(200) messages which were not necessary and should\n    now not appear anymore.\n\n    New feature. ListIssues changed in layout and now also shows the first\n    couple of words from the issue description.\n\n    Bug fixed. Since Zope 2.5.x, when you add a ZCatalog it does not\n    automatically create a Vocabulary. Added that to InitZCatalog().\n\n    New feature. Improved the use of Recent history so the page templates\n    will now show them without having to create a Batch object. This will\n    decrease rendering time.\n\n    New feature. If you search an click a found issue, '?=' is not passed\n    in the URL but still works the same. More convenient for copy-and-paste\n    URLs without the search argument.\n\n    New feature. All templates are now interfaced as CheckoutableTemplates\n    (see http.//zope.org/Members/peterbe/CheckoutableTemplates)\n    This means that any IssueTrackerProduct instance's templates can easily\n    be customized without having to change any sourcecode and makes it\n    possible to install upgrades.\n\n    New feature. Almost all occurances of absolute URLs in the generated\n    HTML has been replaced by relative ones. This makes the resulting\n    HTML slightly smaller in size.\n\n    New feature. ListIssues and CompleteList is now much faster\n    if you are not doing a search. It was before doing a search on\n    nothing instead of using objectValues(). Great speed improvement.\n\n    New feature. POP3Account now has a configurable port number.\n\n    Bug fixed. POP3 was not working in Zope270 due to a bad class import.\n\n0.5.2 (2013-01-01)\n-------------------\n\n    Bug fixed. Added View security on RSS feed.\n\n    Bug fixed. Removed the use of the variable 'yield' since this is now a\n    reserved keyword in Python 2.3.x\n\n    New feature. If you're logged in to Zope, your fromname and email\n    is stored so that if you loose your cookie but log in the same the\n    fromname and email is still there.\n\n    Bug fixed. preParseEmailString() in IssueTrackerUtils() could return None\n    when expecting list, now it returns [] in this case. Affected POP3.\n\n    Bug fixed. Email and followup action shown separatly now on\n    \"5 Latest Issues\".\n\n    Bug fixed. Sometimes the \"Notify the others\" on followup showed\n    incorrect results.\n\n    Bug fixed. Subscribers aren't automatically added to all next issues.\n\n    New feature. List Issues now shows what last happened in every\n    issue.\n\n    New feature. \"5 Latest Issues\" shows who posted the last followup.\n\n    New feature. If the submitter is in Always notify, he is not getting\n    the Always notify email.\n\n0.5.1 (2013-01-01)\n-------------------\n\n    Bug fixed. AddIssue and QuickAddIssue wasn't properly implemented\n    with the ClassSecurityInfo() which would cause a \"unauthorized\"\n    error without login prompt if a parent object has the View\n    permission switched off.\n\n    Bug fixed. The accesskeys previously implemented didn't work\n    properly in Internet Explorer so I took it off until I know\n    more about adding accesskeys.\n\n    New feature. Accesskeys to the main tabs. Try for example. ALT + h\n\n    New feature. There is now a 'Show Always notify status' option\n    if you want to display which Always notify that have been notified.\n    Very useful to the \"issue adder\" if uncertain who gets to know\n    about the added issue. Default is off. See Advanced properties.\n\n    New feature. If you call rss.xml?show=all then it also shows\n    threads/follow ups are items with \"Followup to.\" added to the\n    title of the issue.\n\n    Bug fixed. rss.xml did not sort on 'issuedate' but on default\n    sortorder which could become confusing.\n\n    Bug fixed. When using your own statuses and the first one is not\n    'open', you would get an error when trying to add an issue when\n    not running as manager.\n\n    Bug fixed. When creating an issuetracker instance and using the\n    Properties Wizard some default boolean values were incorrectly\n    saved.\n\n    Bug fixed. Creation of emails was buggy because of spelling\n    misstake. It read '\\r\\b' when it should have been '\\r\\n'.\n\n    Bug fixed. Dodgy emails wheren't ignored properly. Now they are.\n\n    Bug fixed. \"(mail@peterbe.com) bla bla\" was converted to.\n    \"<a href=\"mailto.(mail@peterbe.com)\">(mail@peterbe.com)</a> bla bl\"\n    but now that is fixed.\n\n0.5.0b (2013-01-01)\n-------------------\n\n    New feature. When viewing an issue, the Add followup etc. buttons\n    is only shown at the top. At the bottom is a minial version of\n    the Add Followup form.\n\n    New feature. Now statuses are no longer hardcoded.\n    See the Properties tab where each line is a state,action combo\n    of statuses. Looking at the existing list it should be obvious\n    how it works.\n\n    New feature. Download button and the Confidential & Hide me\n    options are now by default hidden.\n\n    New feature. JavaScript encoded email hyperlinks. Idea taken from\n    http.//www.zope.org/Members/jmeile/email%20encoder\n    A new property has been introduced for this. See bottom of\n    Properties tab. This is **recommended** for public instances.\n\n    New feature. A simple Statistics page. It's linked from the Home\n    page if you're logged in as Manager or if you have switched of the\n    Private Statistics property.\n\n    New feature. Inbound emails now get a confirmation message sent\n    back. This is optional and for it to work you need to redeploy\n    standards to get the SendInboundEmailConfirm_script\n\n    Bug fixed. Accepting email objects can not be created if the\n    email address is already used as an always-notify to prevent\n    notifications becoming inbound email.\n\n    Bug fixed. Dodgy email attachments are now ignored thanks to an\n    added try & except statement.\n\n    New feature. When you upgrade the product some new properties\n    might have been introduced but not instanciated for. Visit the\n    Management tab and see the All properties header.\n\n    New feature. Inbound email via POP3. You can now set up one or\n    more POP3 accounts each with one or more email addresses that are\n    dedicated to sniff for emails sent to it that is converted to\n    issues.\n    It depends on the email package from http.//mimelib.sourceforge.net/\n    and if you want to strip HTML formatted emails you are advised to\n    install Strip-o-Gram from http.//www.zope.org/Members/chrisw/StripOGram\n    For this to work you are expected to set up some sort of cron job\n    to periodically check for new email.\n\n    Bug fixed. Lines that start with a URL or an email address turned\n    to e.g. c<a href=\"mailto.opyright@dot.com\">opyright@dot.com</a>.\n    Now that has been fixed.\n\n    Bug fixed. Removing several groups in the Notifyable groups now\n    works. Thank you Wolfgang Reinelt.\n\n    Bug fixed. Adding and removing other properties now work.\n\n    Bug fixed. Open option available when issue already Open.\n    (was because it tested if 'Open'=='open')\n\n    New feature. Added createIssueObject() method so that you'll be\n    able to create issue objects other than via the web.\n\n    New feature. Added Subscription to issues. See Properties tab to\n    enable this.\n\n    Bug fixed. Searching for name or email was before assumed AND,\n    but now it assumes OR.\n\n    New feature. File attachements to followups. See Properties tab.\n\n    Bug fixed. Improved getRoot() even more since last bug fix was\n    not sufficient.\n\n    Bug fixed. When pressing the Delete button you no longer get a\n    Javascript error.\n\n    Bug fixed. Improved getRoot() when using Virtual Hosts\n\n    Bug fixed. When pressing 'Save Changes' in the Properties tab the\n    page was returned completely blank. Now it \"redirects\" back to the\n    Properties tab as expected.\n\n    Bug fixed. ShowIssueData and the 'change these attributes' action\n    link was misspelled. Now fixed.\n\n    Gave up on the ReportLab module. CompleteList will have to suffice\n    for now.\n\n    Bug fixed. UpdateCatalog() now clears the catalog before it\n    reindexes all objects.\n\n    New feature. added showURL2Issue() which concatenates too\n    long URLs in ShowIssueData.\n\n    Bug fixed. Search highlight does now not mess with tags.\n    Try searching for 'strong' or 'p'. Before it looked odd.\n\n    Bug fixed. Latest issues on homepage is now latest issues.\n    Before it used cookie sortorders.\n\n0.4.9b (2013-01-01)\n-------------------\n\n    Improved \"5 latest issues\" to indicate followups.\n\n    Improved wording in batchlinks.\n\n    Improved search results so that it applies sorting based on the\n    actual search.\n\n    New feature. Comments searchable. Together with this, see the Management\n    tab for the new Update Catalog button which you'll need to press.\n\n0.4.9a (2013-01-01)\n-------------------\n\n    Bug fixed. Searching the catalog with Zope2.6.1b1\n\n    New feature. Added Properties Wizard for when you create an instance.\n    Can be reached from the Properties tab too.\n\n    New feature. Added favicon.ico object.\n\n    Improved look of the StandardHeader and standards.css\n    This requires redeployment.\n\n    Bug fixed. Always notify crashed if no always_notify.\n\n    New feature. Complete batch alternative \"Show them all\".\n\n    Bug fixed. filteroptions now stored in session.\n\n    New feature. Hidable filter options.\n\n    New feature. Sortorder settings stored in cookie now.\n\n    New feature. CompleteList page, shows all of issues and their comments.\n\n    Improved addhrefs() to ignore ending brackets, dots, commas and semicolon.\n\n    Improved manage_editIssueTrackerProperties() to use __dict__ instead of exec\n\n    New feature. cache prevent based on a property called 'Stop cache'\n    Requires that you redeploy StandardLook.\n\n    Bug fixed. ListIssues now has security settings like it's supposed to have.\n\n    New feature. If you set 'Allow issue attribute change' in Properties\n    managers can change the properties of an issue once it's been submitted.\n    Thanks Robert Allyn for suggesting this.\n\n    Bug fixed. 'Notify others' option was ignored whilst you're\n    previewing a followup.\n\n    Bug fixed. how always_notifys are sent out.\n    Thanks Robert Allyn for noticing this.\n\n    New feature. to Management called ReplaceEmail.\n\n0.4.8a (2013-01-01)\n-------------------\n\n    Added HREFs to URLs in text.\n\n    Fixed so that anonymous users could preview followups.\n\n    Bug fixes when UpdateCatalog() has been invoked.\n\n    Made getRecentHistory() careful with deleted issues.\n\n    Fixed some bug where instance variable name_cookiekey was used.\n\n0.4.7b (2013-01-01)\n-------------------\n\n    Removed gif [action]buttons and used CSS instead. (faster loading)\n\n    Added always_notify property so that you can have people that get emails\n    silently about all new issues added. This works together with Notifyables.\n\n    Made it possible to search by Issue id. Type in an issue id and it takes\n    you there.\n\n    Made emailstring cookies be per instance but fromname and email is across\n    all instances.\n\n    Added \"Your Recent History\" feature. It's \"cacheconfusion\" is debatable\n    still.\n\n    Changed the searching so that when searching the title attributes is\n    wrapped with two wildcards on both sides.\n    Will now find \"This is the title...\" when searching for \"itl\".\n\n    Added preview when adding a followup.\n\n    Fixed bug in \"Complete redeployment\"\n\n    Now you can Send2Friends from any issue and not only newly added ones.\n    (requires you to redeploy SendIssue2Friends_script)\n\n    Added link to document about Structured Text.\n\n    Fixed little bug in SendIssue2Friends_script so it saves email address\n    even if emails fail to send.\n\n    Removed lots of redundant code. Especially from IssueTrackerUtils.\n\n    Created the Issue Tracker Notifyable Container folderish object so that\n    many instances can share the same notifyables.\n\n    Made notifyable groups a class with 'Issue Tracker Notifyable Group'\n    objects instead of just a list property.\n\n    Separated out the notifyables stuff to IssueTrackerNotifyables.py.\n\n    Created IssueTrackerConstants.py module for better software design.\n\n    Usability improvments to Add Issue, Quick Add Issue and Management.\n\n0.4.6a (2013-01-01)\n-------------------\n\n    File attachments feature (see properties to turn it on).\n\n    Nice and cachable URLs now used for sortorder, reverse and batchsizing.\n    ListIssues/sortorder-sections/reverse-1/start-12\n    ...instead of...\n    ListIssues?sortorder=sections&reverse=1&start=12\n\n    Improved AddIssue, QuickAddIssue and AddFollowup so that it sets\n    focus in the first field of the input first automatically.\n    (requires StandardLook object refreshed)\n\n    Modified generateID() to generate more sensible ids independent\n    of their location in space.\n\n    Minor improvements to the dispatcher.html object in standards.\n\n    Fixed the tabs for IssueNotifications.\n\n    Fixed the tabs for IssueThreads.\n\n0.4.5b (2013-01-01)\n-------------------\n\n    Fixed some major bugs for sending out emails. You must now redeploy the\n    dispatcher.html object.\n\n    Added search feature. Queried word is highlighted case insensitivly.\n\n\n0.4.4b (2013-01-01)\n-------------------\n\n    What makes an IssueTracker manager is now stored in 'manager_roles'\n    property.\n\n    Emailstrings on new issues for multipmail is now saved in a cookie.\n    You need to Redeploy the SendIssue2Friends_script object (i.e. delete\n    it and visit the Management tab and press \"Deploy and preserve existing\")\n\n    Fixed a typo that broke the batching of lots of issues. Twice.\n\n0.4.4a (2013-01-01)\n-------------------\n\n    Added sendEmail() method and changed SendIssue2Friends_script.py correspondingly.\n\n    Added the filter options at the bottom of ListIssues (for evaluation)\n\n0.4.3 (2013-01-01)\n-------------------\n\n    Started making the ZClass product a python product\n\n-------------------------\nIssueTrackerMassContainer\n-------------------------\n\n0.2.0 (2013-01-01)\n-------------------\n\n    New feature. Massive performance boost by using ZCatalog better\n    for fetching all recent issues and avoiding a python sort on no\n    more than 15 issues at a time. \n\n0.1.1 (2013-01-01)\n-------------------\n\n    New feature. Show 20 items on the dashboard instead of 15\n    \n    New feature. The ability to ignore trackers and other\n    masscontainers is removed. It brings little value and much\n    confusion.\n    \n    New feature. Odd/Even columns coloured like inside\n    IssueTrackerProduct.\n    \n    Bug fixed. The continual lookup could sometimes keep adding the\n    same new issue(s) to the dashboard due to a difference between\n    the client-side (Javascipt) datetime and the server-side (Zope)\n\n0.1.0 (2013-01-01)\n-------------------\n\n    New feature. Thanks to optimization the dashboard AJAX refresh\n    interval can go down to \n\n    New feature. Even more optimized dashboard and even more memory\n    efficient not most importantly, not broken like version 0.0.12 was.\n    \n0.0.12 (2013-01-01)\n-------------------\n\n    New feature. Further improvements from 0.0.11. Now, with a cache\n    you get the nice effect every time you reload the activity page.\n    \n0.0.11 (2013-01-01)\n-------------------\n\n    New feature. Massive optimization success. See \n    http.//www.peterbe.com/plog/massive-improvement-on-sorting-a-fat-list\n\n0.0.10 (2013-01-01)\n-------------------\n\n    New feature. Masscontainer only counts issues, not join-in issues\n    in trackers that have this defined.\n\n0.0.9 (2013-01-01)\n-------------------\n\n    New feature. Activity AJAX just gets the new issues since last\n    AJAX call.\n\n0.0.8 (2013-01-01)\n-------------------\n\n    * major change to structure *\n    \n0.0.7 (2013-01-01)\n-------------------\n\n    Bug fixed. Made it compatible with zope 2.8\n    \n0.0.6 (2013-01-01)\n-------------------\n\n    Bug fixed. Use of issue.getEmail() instead of issue.email\n    (getEmail() is better)\n    \n0.0.5 (2013-01-01)\n-------------------\n\n    Bug fixed. defaults for use_native_header and use_native_footer\n    \n0.0.4 (2013-01-01)\n-------------------\n\n    New feature. findCorrectURL() can be called from\n    standard_error_message to find alternative URLs on 404s.\n\n    New feature. Changed the default automate script to be more\n    up-to-date\n\n0.0.3 (2013-01-01)\n-------------------\n\n    New feature. Option for disabling native headers as well as footers.\n    \n    Bug fixed. Corrected CSS to colorize thread changes.\n    \n0.0.3 (2013-01-01)\n-------------------\n\n    Bug fixed. The Masscontainer didn't properly listen to the \n    Security settings from Zope. Now it does, so if you disable\n    acquiring the View permission, then authentication is invoked.\n\n    New feature. RSS links to all issuetrackers\n\n0.0.2a (2013-01-01)\n-------------------\n\n    New feature. DeployStandards() which creates automate script.\n\n0.0.1a (2013-01-01)\n-------------------\n\n    First release", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/sureshvv/IsssueTrackerProduct", "keywords": "Zope tracker issue bug", "license": "GPL", "maintainer": null, "maintainer_email": null, "name": "IssueTrackerProduct", "package_url": "https://pypi.org/project/IssueTrackerProduct/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/IssueTrackerProduct/", "project_urls": {"Download": "UNKNOWN", "Homepage": "https://github.com/sureshvv/IsssueTrackerProduct"}, "release_url": "https://pypi.org/project/IssueTrackerProduct/0.14.3/", "requires_dist": null, "requires_python": null, "summary": "Bug/issue tracker for Zope2.", "version": "0.14.3", "yanked": false, "html_description": "<div class=\"project-description\">\n            IssueTrackerProduct<br>===================<br><br>IssueTrackerProduct is a bug/issue tracker for Zope2.<br><br>This project started in around 2001 and was originally called<br>SiteTracker. The suffix \"Product\" comes from the fact that to external<br>plugins added to Zope2 projects where placed in the \"Product\" directory.<br><br><br>Changelog<br>=========<br><br>0.14.2 (unreleased)<br>-------------------<br><br>- Nothing changed yet.<br><br><br>0.14.1 (2013-07-21)<br>-------------------<br><br>- Eggify product [sureshvv]<br><br>- Display time in user's TZ [sureshvv]<br><br>0.13.1 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Rare condition of sorting filtered issues could cause a<br>    TypeError.<br><br>0.13.0 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Saved filter cookies were saved with just the ID of the<br>    issuetracker instance which could cause conflicts on different<br>    issuetrackers under the same ID.<br><br>    Bug fixed. Issue duplication check with brackets or quotation<br>    marks could cause a ParseError due to ZCatalog search.<br><br>    New feature. Ability to edit actual time per followup if you're<br>    manager or author.<br><br>    Bug fixed. Thread default actual_time_hours to 0.0 so you can use<br>    the ZMI property sheet to update it.<br><br>    New feature. Greatly optimized how getModifyTimestamp is done on<br>    the whole IssueTracker.<br><br>    Bug fixed. Adding followups on out-of-date trackers without the<br>    'threaddate' DateIndex is now not failing with an error.<br><br>    New feature. Full issue activity report if you enable \"Actual time<br>    per follow up\"<br><br>    Bug fixed. Follow ups weren't indexed properly when created. Had<br>    to Update Everything to update monthly summary report.<br><br>    New feature. All whitespace optimized .css and .js files are put<br>    into subdirectory called `.autogenerated`.<br><br>0.12.0 (2013-01-01)<br>-------------------<br><br>    New feature. All CSS and JS that was served as DTML now served as<br>    plain files.<br><br>    New feature. Urgency of an issue included in the subject line of<br>    notifications.<br><br>    Bug fixed. Badly raised UnicodeDecodeError on parsing emails in.<br><br>    Bug fixed. Finding and making links to issues with IDs higher than<br>    the current number of digits used for IDs not matches.<br><br>    New feature. Can enable so that 'Always notify' means it sends<br>    notifications on all followups and not just new issues.<br><br>    New feature. Followup duplicates are only duplicates if they have<br>    the same name and content and was posted within 5 minutes. (Thanks<br>    Radim)<br><br>    New feature. Mobile web XHTML version which is lighter and more<br>    optimized CSS margins.<br><br>    Bug fixed. Possible KeyErrors raised on deleting session keys when<br>    running Zope in a cluster.<br><br>    Bug fixed. CSS corrected so body of issue text gets the same font<br>    as the rest of the page.<br><br>    New feature. Ability to override which email addresses to notify<br>    on a followup.<br><br>0.11.0 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Saved filters that refer to objects that no longer<br>    exist could cause an error on the filter option.<br><br>    New feature. Monthly summary report<br><br>    New feature. By default ID is shown with title on new Issue<br>    Tracker instances.<br><br>    Bug fixed. Page AddIssue now security protected with the same<br>    permission as for submitting issues.<br><br>    New feature. Made IssueTrackerProduct work in Zope 2.12. (Thanks<br>    Suresh V)<br><br>    New feature. Now possible to filter by assignees.<br><br>    New feature. Home page list of recent issues is much optimized by<br>    using the catalog to search by 'modifydate'.<br><br>    Bug fixed. Editing urgency and type on submitted issues could<br>    cause UnicodeDecodeError.<br><br>    New feature. Added Markdown as a display format option if installed.<br>    To enable, just install markdown on the python path.<br><br>    Bug fixed. Previewing an issue with chosen sections that are<br>    non-ASCII caused a UnicodeDecodeError.<br><br>    New feature. DEFAULT_ENCODE_EMAILDISPLAY is disabled by default in<br>    new trackers. Issuetrackers are rarely public.<br><br>    Bug fixed. Custom checkbox boolean fields whose values were True<br>    appeared as a unchecked checkbox on editing details (Real#0893)<br><br><br>    Bug fixed. Custom checkbox boolean fields whose values were False<br>    didn't show up issue details.<br><br>    Bug fixed. Inability to set the defaultsections Thanks Jean<br>    (Real#0880)<br><br>    Bug fixed. Emails encoded in unicode-1-1-utf-7 encoded as utf-7<br><br>    Bug fixed. Email in body parsed correctly into Unicode.<br><br>    New feature. Clairvoyant Javascript optimized with JSON.<br><br>    New feature. Menu icons in a CSS Sprite for much faster loading.<br><br>    Bug fixed. Manually reset ID counters could cause excessive<br>    recursion when generiting IDs. (Real#0659) Thanks Nicholas<br><br>    Bug fixed. Inability to change password if user folder is<br>    configured to encrypt stored passwords. (Real#0823) Thanks Greg<br><br>    New feature. Inbound emails with header \"X-Autoreply yes\" are<br>    ignored (Real#0855). Thanks Nicholas<br><br>    New feature. Loading the \"Delete issue\" form is done in AJAX if<br>    Javascript is enabled.<br><br>    Bug fixed. Unicode options for the Default sections. (Real#0672)<br><br>    New feature. Which list you were at is remembered when visiting an<br>    issue even after reloading the issue page. Not just for searches.<br><br>    New feature. Made DEFAULT_INCLUDE_DESCRIPTION_IN_NOTIFICATIONS<br>    default to True so that by default the issue description is shown<br>    in the email notifications.<br><br>    Bug fixed. Emails in with a subject line containing the word<br>    'General' without a section option called that failed.<br><br>    New feature. Upgraded to latest version of jQuery 1.3.2.<br><br>    New feature. Added UnicodeSplitter to be able to properly index<br>    and search Unicode text.<br><br>0.10.3 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Fixed dispatcher() so that it doesn't break on deleted<br>    issues.<br><br>    Bug fixed. CMF member can be None without breaking. (Real#0811)<br><br>    New feature. Issue ID is included in the subject line of email-in<br>    receipts if set up to show ID with the title. Real#0797<br><br>    New feature. Select custom fields become multiple-selects when used<br>    as a filter. Real#0784, Real#0762<br><br>    Bug fixed. Loaded filter options in AJAX now with stopped client<br>    cache. Real#0782, Thanks Jack.<br><br>    Bug fixed. File attachments of followups weren't immediately<br>    indexed.<br><br>    Bug fixed. Sometimes followup objects weren't index properly by<br>    path. This was not a problem when the catalog was only used for<br>    searching but now it's used to count issues too.<br><br>    New feature. Detail changes to issues are recorded and shown on<br>    the issue page.<br><br>    New feature. If you upload a file whose exact name is a method or<br>    a template the IssueTrackerProduct itself the files get<br>    automatically renamed.<br><br>    New feature. Search smarter by not doing a wildcard search on<br>    titles unless not found exactly anywhere else.<br><br>    Bug fixed. Static file's from misc_ set an incorrect header called<br>    Cache-Length.<br><br>    New feature. Assignee name shown in rich list on List Issues.<br>    (Real#0757)<br><br>    New feature. Document title is changing when a clarvoyant message<br>    appears on followups.<br><br>    New feature. Assignee is including in the CSV export from List<br>    Issues. (Real#0764)<br><br>    Bug fixed. Always notify could accidentally send emails to people<br>    not necessarily in the always notify list but with the same first<br>    name of the full name.<br><br>0.10.2 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Fix to make it work in Zope 2.11 with content_types<br>    being deprecated. Real#0759, Thanks Pat Heffernan.<br><br>    Bug fixed. Javascript shortcuts not working when writing a<br>    non-quick followup (e.g. completing an issue)<br><br>    Bug fixed. Email address allowed non-ascii characters.<br><br>    Bug fixed. Javascript keyboard shortcuts not loaded correctly on<br>    adding issue.<br><br>0.10.1 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Sometimes it was not possible to complete a followup<br>    draft since the action was incorrectly set to \"Add Followup\" not<br>    \"AddFollowup\".<br><br>    New feature. Much performance improved home page now since<br>    CountStatuses() now uses the catalog instead. Must press Update<br>    Everything button.<br><br>    New feature. Only the firstname is show in the menu when logged in.<br><br>    New feature. Upgraded to the latest jQuery 1.2.6 and removed<br>    jquery-latest.pack.js<br><br>    Bug fixed. Reloading Add Issue form with multiple select custom<br>    fields selected would cause a TypeError. Thanks Nicolas.<br><br>    Bug fixed. IssueTracker User Folder allowed to save non-unicode<br>    full names.<br><br>    Bug fixed. Uncataloging saved filters before the saved filters<br>    catalog had been set up could cause an AttributeError.<br><br>    Bug fixed. Custom fields in filters where nothing is an option<br>    could cause the filter to filter out all issues.<br><br>    Bug fixed. Filtering on custom fields that are lines or ulines<br>    would give a ugly filtername that looks like a repr of a python<br>    list or tuple.<br><br>    Bug fixed. Custom field selects with forced values overrides the<br>    list of options.<br><br>    Bug fixed. Fixed a bug where some saved followup drafts weren't<br>    saved as Unicode.<br><br>    Bug fixed. Custom field type validity check failed on values that<br>    were already lists or tuples and don't need to be converted to a<br>    list.<br><br>    Bug fixed. Custom fields that were \"ulines\" or \"lines\" and<br>    multiple=\"multiple\" would become nested lists until flattened.<br><br>    New feature. Any filtering done by spider bots are not<br>    persistently saved.<br><br>0.10.0 (2013-01-01)<br>-------------------<br><br>    New feature. Custom fields!<br><br>0.9.3 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Loading a saved draft followup that didn't have an<br>    action would raise an error.<br><br>    Bug fixed. Loading filter options in Konquerer would load the AJAX<br>    request 3 times for one click.<br><br>    Bug fixed. Saved filters container was never imploded even if the<br>    container had more saved filters in it than allowed.<br><br>    Bug fixed. Saving filters when only the fromname is known would<br>    raise an UnmatchableError.<br><br>    Bug fixed. NameError when checking for emails in and nothing to<br>    download. Thanks Luciano (Real#0743)<br><br><br>0.9.2 (2013-01-01)<br>-------------------<br><br>    Bug fixed. When accepting multipart emails and html2safehtml is<br>    not installed the default part to keep is now the text/plain part.<br><br>    Bug fixed. Loading a saved draft followup that didn't have an<br>    action would raise an error.<br><br>    Bug fixed. Loading filter options in Konquerer would load the AJAX<br>    request 3 times for one click.<br><br>    Bug fixed. Saved filters container was never imploded even if the<br>    container had more saved filters in it than allowed.<br><br>    Bug fixed. Saving filters when only the fromname is known would<br>    raise an UnmatchableError.<br><br>0.9.1 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Saved cookies with where only the name is known could<br>    cause an error on the /User page.<br><br>    Bug fixed. Delete issue form did not work.<br><br>0.9.0 (2013-01-01)<br>-------------------<br><br>    New feature. If you pass the spambot prevention test it's<br>    remembered in a cookie for the next 60 days rather than just for<br>    the session.<br><br>    New feature. When you've added an issue the URL it redirects to no<br>    longer ends with ?NewIssues=Submitted. Cleaner URLs.<br><br>    New feature. Really long URLs in the text that extend beyond the<br>    box it's in is truncated shorter.<br><br>    Bug fixed. Having statuses containing unicode characters could<br>    break the statistics page. Thanks Rene Bonvin. (Real#0735)<br><br>    New feature. Basic statistics is not private by default from now<br>    on. You can still make it private from the Advanced Properties page.<br><br>    New feature. Statuses can now be configured to contain unicode<br>    characters.<br><br>    New feature. The persistent list of saved filters is now indexed<br>    with a separate ZCatalog to vastly speed up lookups of old saved<br>    filters.<br><br>    Bug fixed. Saved filters containing unicode characters could cause<br>    a UnicodeDecodeError.<br><br>    Bug fixed. Unicode characters in a filtered name would show<br>    incorrectly when loading the filter options.<br><br>    Bug fixed. Having statuses containing unicode characters could<br>    break the statistics page. Thanks Rene Bonvin. (Real#0735)<br><br>    New feature. Basic statistics is not private by default from now<br>    on. You can still make it private from the Advanced Properties page.<br><br>    New feature. Statuses can now be configured to contain unicode<br>    characters.<br><br>    New feature. The persistent list of saved filters is now indexed<br>    with a separate ZCatalog to vastly speed up lookups of old saved<br>    filters.<br><br>    Bug fixed. Saved filters containing unicode characters could cause<br>    a UnicodeDecodeError.<br><br>    Bug fixed. Unicode characters in a filtered name would show<br>    incorrectly when loading the filter options.<br><br>    Bug fixed. Search on title with wildcards (e.g. *keyword* matching<br>    'subkeywords') only if no other title searches matched.<br><br>    Bug fixed. Emails with tabs in header values were before<br>    incorrectly stripped of this whitespace causing the set of headers<br>    to be shortened. Thanks Jesse Perry<br><br>    Bug fixed. getIssueObjects() would break with KeyError if a<br>    reference to a join-in issuetracker (see bottom of Advanced<br>    properties) is broken.<br><br>    Bug fixed. Reassigned issues didn't say \"assigned\" on the List<br>    Issues. Thanks NiBar (Real#0711)<br><br>    New feature. Added new method called getReportIssues() that takes<br>    the id of the report as an only parameter and it returns all the<br>    issues that report would find.<br><br>    New feature. Search result highlighting can be switched off with a<br>    Javascript-created link similar to Gmail.<br><br>    Bug fixed. Encoded email address in a autorefresh are re-encoded.<br><br>    Bug fixed. Possible UnicodeDecodeError if using normal acl_users<br>    user folder with a unicode fromname.<br><br>    New feature. File attachments initially hidden and covered with a<br>    Javascript opener.<br><br>    New feature. Change assignment form expands automatically on focus.<br><br>    Bug fixed. Filter switcher (\"Do only show\"/\"Do not show\") had a<br>    Javascript error on a missing variable called 'label'.<br><br>    New feature. Ability to disable \"Show them all\" as a batching<br>    option. Very useful when there are many issues because showing this<br>    page will slow your Zope down.<br><br>    Bug fixed. Name hidden wasn't hidden on home page.<br><br>    New feature. List of issues on home page periodically refreshed<br>    with AJAX.<br><br>    Bug fixed. Download of dodgy emails without a To. part now skipped<br>    (Real#0700, thanks Jesse Perry)<br><br>    New feature. File attachment links have a rel=\"nofollow\" now.<br><br>    New feature. Ability to hook up pre- and post scripts that are<br>    called before and after issues are submitted.<br>    http.//www.issuetrackerproduct.com/Documentation/How-Tos/pre-post-SubmitIssue<br><br>    Bug fixed. Confidential issues could be seen by logged in people<br>    by changing their email address to an email address of someone else.<br>    (Real#0696, thanks NiBar)<br><br>    Bug fixed. Keyboard shortcut for comparing issues changed from 'c'<br>    to 'g'+'d' since the 'c' cause interference with Ctrl-C for copying.<br>    (Real#0697, thanks Jesse Perry)<br><br>    New feature. Skipped notifications when not dispatching on submit.<br>    Means that if you let a cronjob send the notifications instead of<br>    immediately sending them, some notifications are cancelled if the<br>    people who are email have already followed up. (Real#0686)<br><br>    Bug fixed. rss.xml and rdf.xml weren't protected by the View<br>    permission. (Real#0695, thanks Jesse Perry)<br><br>    Bug fixed. Changed default encoding from \"utf8\" to \"utf-8\" to make<br>    sure older IEs gets it right.<br><br>    Bug fixed. Header in CSV file for \"ID\" replaced by \"Issue ID\"<br>    (Real#0687)<br><br>    Bug fixed. Clairvoyant AJAX checks' interval increases now slowly as<br>    the page gets older.<br><br>    Bug fixed. Issues were uncataloged twice when deleting causing a<br>    harmless extra message in the event log.<br><br>0.8.3 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Clairvoyant javascript alert on followups would repeat<br>    the same message over and over (almost blinking).<br><br>    New feature. Name and email is saved in a cookie when working on a<br>    draft if the name/email isn't already set.<br><br>    Change. If in DEBUG mode (environment variable<br>    DEBUG_ISSUETRACKERPRODUCT) emails are printed to stdout<br><br>0.8.2 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Error on duplicate in on second followups in issues.<br>    Real#0665 and Real#0666<br><br>0.8.1 (2013-01-01)<br>-------------------<br><br>    Bug fixed. The clarvoyent AJAX feature would show if someone is<br>    working a different issue to the one you're looking at.<br><br>0.8.0 (2013-01-01)<br>-------------------<br><br>    New feature. Ability to compare issues (experimental). Only works<br>    when using keyboard shortcuts. Key. c<br><br>    New feature. Now you can assign an issue to anybody even after<br>    it's been created and even if it didn't already have an assignment.<br>    Real#0299, Real#0188, Real#0081<br><br>    Bug fixed. Sending assignment emails from a user with non-ASCII<br>    name would cause an UnicodeDecodeError.<br><br>    New feature. Uses jQuery 1.2.1<br><br>    Bug fixed. Cancelling a go-to-issue keyboard command caused a<br>    Javascript error.<br><br>    New feature. Upgraded to addhrefs 0.9.3<br><br>    Bug fixed. preParseEmailString would sometimes barf on unicode<br>    strings for translation.<br><br>    Bug fixed. UnicodeDecodeError wasn't raised properly in processing<br>    inbound email reply and formatflowed_decode() was called with wrong<br>    parameter. Thanks Robert Leftwich (Real#0642)<br><br>    Bug fixed. When you reply via email to an issue, no notification<br>    was sent to those involved in the issue. Thanks Robert Leftwich.<br>    (Real#0413)<br><br>    New feature. When you reach the last line in any textarea input<br>    (eg. on adding a new issue) the textarea box automatically expands<br>    to add a few extra blank lines.<br><br>    New feature. Expires header set to all static content and set much<br>    further into the future for better HTTP caching.<br><br>    New feature. The Tell-a-friend and Subscribe-to-changes has been<br>    moved down below the issue threads.<br><br>    Bug fixed. Fixed possible XSS hole. Name and email checking now<br>    done when adding issues and followups.<br><br>    Bug fixed. Emails in unicode (non-ascii) characters could lead to<br>    email notifications being sent out incorrectly.<br><br>    New feature. The autorefresh interval starts on 3 seconds interval<br>    and increases the interval length by 30% each time it incurs.<br>    http.//www.issuetrackerproduct.com/News/autorefresh-intervals/<br><br>    Bug fixed. multiple drafts were created sometimes.<br><br>    New feature. fromname, title and description of issues and<br>    followups are now stored as unicode! The default encoding is utf8.<br><br>    New feature. If you run Python 2.4 on your Zope you can configure<br>    the POP3 to use SSL. Thanks Shane Graber<br><br>    New feature. Possible to disable the 'Tell a friend' feature for<br>    anonymous users (eg. spambots for example). Thanks Fred Damberger<br><br>0.7.3 (2013-01-01)<br>-------------------<br><br>    Bug fixed. .svn and CVS folders could be created when you Update<br>    Everything.<br><br>    New feature. New version of addhrefs.py version 0.9.2.<br><br>    New feature. QuickAddIssue now shows the spambot prevention if<br>    switched on. Real#0343<br><br>    Bug fixed. Redirecting out on duplicate status change would cause<br>    a TypeError. This happens when two people simultaneuously for<br>    example Take an issue.<br><br>    Bug fixed. Change user details didn't work when you're not logged<br>    in as a CMF user.<br><br>    Bug fixed. ShowIssueData template mixed up ShowIssueURLOption with<br>    ShowConfidentialOption. Thanks Peter Eddy. Real#0332<br><br>    Bug fixed. Edit notifyable error. Real#0320<br><br>    New feature. Ability to enable a spambot prevention technique to<br>    assert that posters are humans.<br>    (see Properties-&gt;Advanced-&gt;Enable spambot prevention)<br><br>    Bug fixed. When using IssueTrackerProduct on top of Plone the<br>    authenticated member was selected incorrectly. Thanks Greg Baker<br>    (Real#0315)<br><br>    Bug fixed. get_cookie() typo should have been self.get_cookie().<br>    Thanks Greg Baker (Real#0312)<br><br>    Bug fixed. Javascript autorefresh didn't work with URLs ending in<br>    'index_html'. Thanks Maheshg Real#0298<br><br>    Bug fixed. Odd emails with ISO-8859 encoding that aren't really<br>    ISO-8859 encoded could cause a TypeError. Thanks Mirco Attocchi<br>    Real#0300.<br><br>    Bug fixed. POP3 email parsing could fail if email didn't have a<br>    message-id.<br><br>    New feature. \"Select all\" button on the Spam protection page.<br><br>    Bug fixed. Bug in saving of spam keywords on duplicate keywords<br>    across combinations fixed.<br><br>    Bug fixed. Not possible to change an issues Confidential status<br>    through the \"change details\" form even if Confidential option was<br>    enabled. Real#0281<br><br>0.7.2 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Nasty bug in name/email gets blanked on issue<br>    submission even the issuetracker remembers the users name as part<br>    of the instance persistency. Thanks Rakesh, Ramy, Pradeep Real#0268<br><br>    Bug fixed. getPreviewTitle() on followups could get potentially<br>    confused if you tried to put on hold.<br><br>    New feature. Spam protection built in. Click Management tab, Spam<br>    protection to configure the spam keywords. Only applicable to<br>    public issuetrackers really.<br><br>    Bug fixed. ACL accounts where the username == full name couldn't<br>    be sent to in the Always notify property. Thanks Ed Leafe Real#0266<br><br>    Bug fixed. ValueError in pop3 checking with mismatched case in the<br>    subjectline. Thanks Eric Real#0265<br><br>    New feature. Ability to control wether to reveal the new issue URL<br>    of issues created via inbound email. Instead of the issue's URL it<br>    shows the ID like #0001. (Thanks Bob Gimlich Real#0263)<br><br>    Bug fixed. Emailed in issues with signature had incorrect<br>    linebreaks in HTML looking like this. &lt;br\\s\\*/&gt;<br><br>    New feature. The URL option on Add Issue is now by default<br>    switched off (available on Properties, Advanced) on all new<br>    instances.<br><br>    New feature. Now you can control the menu items through the<br>    Properties tab. Follow the \"Configure the menu\" link.<br><br>    Bug fixed. When renaming an issuetracker, ACL users defined within<br>    and used in issues, threads and assignments got link broken. Now a<br>    new function called _renameOldPaths() takes care of this.<br><br>    Bug fixed. The CSV export includes titles of join-in issuetrackers<br>    like on List Issues. (thanks Kosmas Real#0249)<br><br>    New feature. You can search a comma separated list of issue ids in<br>    serveral suitable formats like '#0123, 124, 0125, #126'.<br><br>0.7.1 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Searching and finding exactly one matched issue yielded<br>    a TypeError about len() that happens just before the redirect to the<br>    issue.<br><br>    Bug fixed. getNextActionIssues() got confused when ACL logged in<br>    users had submitted their last replies to issues via email and<br>    included it wrongly.<br><br>    Bug fixed. timeSince() could return \"2 weeks and 0 days\" when it<br>    should just be \"2 weeks\".<br><br>    Bug fixed. Id with title in &lt;title&gt; tag (Real#0236)<br><br>    Bug fixed. Badly formatted email replies that don't use &gt; but<br>    split the new and old text with \"-----Original Message------\" can<br>    now be splitted correctly.<br><br>0.7.0 (2013-01-01)<br>-------------------<br><br>    New feature. \"drafts\" folder is (if possible) created as<br>    BTreeFolder2 (Real#0228)<br><br>    Bug fixed. Automatic refresh in Opera 8.51 fixed.<br><br>    Bug fixed. Some of the fancy javascript stuff didn't work in IE5<br>    and IE5.5 but now they at least don't give any error messages.<br><br>    New feature. It is now possible to switch off the Tell a Friend<br>    feature from the Show Issue page. (Real#0219)<br><br>    Bug fixed. Followups could be autosaved even if they didn't have<br>    any text. (Real#0220)<br><br>    Bug fixed. Failed email sendouts failed on the error catching<br>    because of a typo.<br><br>    New feature. 'Your next action issues' list on homepage. Disabled by<br>    default but can be enabled on the user settings page.<br><br>    Bug fixed. Searching and finding only one issue when filters are<br>    on is now more careful. (Real#0072)<br><br>    New feature. When you set up accepting emails for a POP3 account<br>    you can also blacklist certain email address like '\\*@hotmail.com'.<br>    You can also whitelist exceptions to the blacklist patterns.<br><br>    New feature. Being able to change issues once added is now<br>    governed by a permission called 'Change Issue Tracker Issues'.<br><br>    New feature. You can now reply to issue notifications sent out<br>    from an issuetracker if the sitemaster email address is one of the<br>    accepting emails in the POP3 setup. This makes it possible to<br>    completely discuss an issue without even using a web browser.<br>    Parsing of the replies is best done with Formatflowed installed.<br><br>    New feature. POP3 inbound email feature now prevents duplicates<br>    and it is now possible to use this without deleting emails from<br>    the server.<br><br>    Bug fixed. Typo for 'remember_savedfilter_persistently' cookie key<br>    reference which caused excessive LOG() messages.<br><br>    New feature. Autosave for followups enabled. Autosaving is now<br>    only done when focus is on the subject or description/comment.<br><br>    New feature. Ability to specify Estimated time and Actual time as<br>    attributes on an issue. See Advanced Properties tab if interested.<br><br>    New feature. A much improved searchterm-highlighter that doesn't<br>    highlight words like 'a' when their inside a word like th*A*t.<br><br>    New feature. New Advanced option that disallows adding issues with<br>    a potentially duplicate subject/title.<br><br>    New feature. keyboardshortcuts.js which allows you to use the<br>    keyboard to navigate. Enabled only if selected on the User page.<br><br>0.6.13 (2013-01-01)<br>-------------------<br><br>    New feature. Which used filter used is only remembered in one<br>    session, if you're a Issue User you can set it to remember this<br>    persistently. Thanks Jan Kokoska for the push (Real#0186)<br><br>    Bug fixed. Applying a filter when inside the Complete List page<br>    would redirect back to List Issues. Thanks Benjamin Higgins<br>    (Real#1087)<br><br>    Bug fixed. It was not possible to change the \"URL\" for an issue<br>    when using the little \"change details\" form on the issue display.<br><br>    New feature. CleanOldSavedFilters() (part of Update Everything)<br>    can now tidy up the amount of saved filters stored inside an<br>    issuetracker. Needed as part of fixing Real#0183.<br><br>    Bug fixed. Subscription form caused invalid XHTML. (Thanks John J<br>    Lee)<br><br>    Bug fixed. If you had a Zope object called Reports somewhere in<br>    the acquisition path, you could get an AttributeError. getScripts<br>    on the Home page. Thanks David Snowsill (Real#0180)<br><br>    Bug fixed. Statistics page didn't work with a completely new<br>    issuetracker instance. Thanks Tim Sparkes.<br><br>    Bug fixed. User page now usable with old Konqueror (Real#0158)<br><br>    Bug fixed. CSV export notates issue IDs with # so that<br>    Excel/oocalc doesn't try to make the issue ID into an integer.<br><br>    New feature. Introduced new js-core.js javascript page for general<br>    functions that all pages can use. (beware those who have<br>    StandardHeader.zpt checked out!)<br><br>    Bug fixed. CSS is now alos cached with the more modern<br>    'Cache-Control' header thanks to advise from Dieter Maurer.<br><br>    Bug fixed. When running a report the batching links didn't work Real#0172<br><br>    New feature. Every time you run a report it remembers globally how<br>    many issues where found.<br><br>    Bug fixed. The homepage could say that an issue was from Today or<br>    Yesterday because it mathematically was so by arithmatic but did not<br>    take midnight into account to show what really was Today and<br>    Yesterday.<br><br>0.6.12 (2013-01-01)<br>-------------------<br><br>    New feature. Header background and issue header background gets a<br>    gradient shade instead of single coloured.<br><br>    Bug fixed. When moving to storage in a BTreeFolder the internal ID<br>    counter was lost and counting of issues was done where there are<br>    longer any issues resulting in odd issue IDs. (thanks Jason Powers<br>    Real#0167)<br><br>    New feature. \"Recently added issues\" and \"Recently visited issues\"<br>    have been merged into one list \"Recent issues\".<br><br>    Bug fixed. Instances using a SecureMailHost had to see the To. and<br>    From. headers repeated inside the email body.<br><br>    New feature. File attachments to issues or followups contain<br>    illegal characters are stripped to valid ids (Real#0169)<br><br>    New feature. Long filenames are truncated when shown in the<br>    issuedescription. Before they could overlap the other info.<br><br>    New feature. An M$ Outlook inspired homepage listing of the latest<br>    changes in issues that replaces the list of \"5 latest issues\".<br><br>    New feature. If you use a Secure MailHost, the secureSend()<br>    function is used instead to send emails.<br><br>    Bug fixed. Revisiting saved thread drafts didn't work.<br><br>    Bug fixed. If 'self.subscribers' in Issue objects were tuples,<br>    they are now automatically converted to lists.<br>    (thanks Oldrich Auda, Real#0163)<br><br>    Bug fixed. User.zpt wasn't checkoutable with CheckoutableTemplates<br>    (thanks Kosmas Chatzimichalis)<br><br>    New feature. Adding issues is bound to a different permission name<br>    \"Add Issue Tracker Issues\". It used to \"View\". This affects those<br>    who use the \"Issue Tracker Manager\" and \"Issue Tracker User\" roles.<br><br>    New feature. Mentions of other issues with a hash like #0150<br>    becomes a hyperlink. (Real#0150)<br><br>    Bug fixed. 'remember-filterlogic' request variable was only<br>    considered for whether to session store the filterlogic, not the<br>    filtervaluer.<br><br>    Bug fixed. getEmailFromnameCombos() didn't fetch fromname and<br>    email correctly thus disabling POP3 reading.<br><br>    Bug fixed. fromname and email is saved additionally again when<br>    you're logged in as Issue User Folder user.<br><br>    Bug fixed. 'svn.//' or 'ssh+svn.//' URLs were shown  with a 'http.//'<br>    first prefixed. (Real#0154)<br><br>0.6.11 (2013-01-01)<br>-------------------<br><br>    New feature. Experimental Upgrade tab inside the Management tab.<br><br>    Bug fixed. The migration for Zope 2.8.0 on the ZCatalog wasn't<br>    backwardscompatible. The migration script is now wrapped in a if<br>    statement so that it's only run if it exists.<br><br>    New feature. Press Update Everything to make sure all issues and<br>    threads have the latest name and email if users are defined in a<br>    Issue User Folder.<br><br>    Bug fixed. _getOthers() was still using self.email instead of<br>    self.getEmail() on issues which meant trouble if the submitter of<br>    the issue would be a Issue User Folder submitter with no previously<br>    submitted issues.<br><br>    New feature. From Advanced Properties you can set scores for each<br>    status and calculate a guesstimate overall status progress.<br><br>    Bug fixed. When adding an issue, request variables are now only<br>    taken from REQUEST.form which avoids any cookies or session<br>    variables. (Thanks Eric Bressler Real#0152)<br><br>    Bug fixed. All references to REQUEST.AUTHENTICATED_USER gone.<br>    (Real#0057)<br><br>    Bug fixed. Password reminders could not find SecureMailHost<br>    mailhost objects to send emails via when outside an issuetracker.<br><br>    Bug fixed. Bug reporting and error handling used the old address<br>    to the Real issuetracker. Now it's using real.issuetrackerproduct.com.<br><br>    Bug fixed. Spam detection on inbound emails are now also checked<br>    on lowercase header keys which can be the case on some servers.<br><br>    Bug fixed. Fixed potential bug where default_display_format<br>    attribute isn't set on the class instance (Real#0129)<br><br>    Bug fixed. Now works with Zope 2.8.0 (Real#0108, Real#0136,<br>    Real#0120). Make sure you press the \"Update Everything\" button<br>    after installation.<br><br>    New feature. By default Save Drafts is now set to True.<br><br>    Bug fixed. Bad optimization of ListIssues|CompleteList could<br>    result in AJAX for showing/hiding filter options didn't work.<br><br>    Bug fixed. getFromname and getEmail in Issue class could get KeyError<br>    if a user has been moved.<br><br>    New feature. All sourcecode cleaned up with Pyflakes<br>    (http.//divmod.org/projects/pyflakes)<br><br>    Bug fixed. The \"Allow issue attribute change\" property now<br>    actually does something. You can now post-submission change the<br>    issue attributes such as section and urgency.<br><br>0.6.10 (2013-01-01)<br>-------------------<br><br>    Bug fixed. addissue.js had a malformed line which caused incorrect<br>    Javascript code if you use slimmer 0.1.16 which could result in<br>    autosaving not working on the Add Issue page.<br><br>    New feature. Statistics got a barchart on issues by status.<br><br>    New feature. Drafts are cleaned up on issue submission unless a<br>    draft_issue_id is available. (Real#0126)<br><br>    Bug fixed. \"Notify the others\" on followup form only listed names<br>    with a valid email address. (Real#0123)<br><br>    Bug fixed. RSS feed sort order is now the same as the of the Home<br>    page. (Real#0124)<br><br>    Bug fixed. RSS feed escaped with CDATA instead of both that and<br>    HTML quoted. (Real#0125)<br><br>0.6.9 (2013-01-01)<br>-------------------<br><br>    Bug fixed. If no name or email on the issue and the user, it<br>    would say that you're already subscribing to an issue. (Thanks<br>    Benjamin Higgins Real#0113)<br><br>    New feature. Deleting drafts from the Add Issue page is done with<br>    AJAX.<br><br>    New feature. if you want to use a Secure Mail Host instead of the<br>    default Mail Host, it is now recognized as 'SecureMailHost' but<br>    'MailHost' still takes precedence.<br><br>    Bug fixed. Which type of List Issues was remembered but not used<br>    if you were logged in as Issue User. (Thanks Marcus Scotti, Real#0110)<br><br>    Bug fixed. Filter on fromname didn't work due to a bug in a<br>    regular expression. (Thanks Fred Damberger, Real#0103)<br><br>    Bug fixed. getEmail() and getName() would raise an<br>    error if the acl_users (if applicable) folder can't be found, which<br>    might be the case when importing an issuetracker.<br><br>    Bug fixed. DeployStandards checked folder existance with<br>    acquisition.<br><br>    New feature. If AJAX works the filter options are loaded with AJAX<br>    otherwise loaded as a new page request (on the List Issues or<br>    Complete List).<br><br>    New feature. When you search on multiple words, an alternative<br>    search link appears that puts \"or\" between all words. (Real#0102)<br><br>    New feature. export.csv makes it possible to download all issues in<br>    one single CSV file. If you enabled 'CSV export link' in the<br>    Advanced properties you can export the current set to CSV.<br><br>    Bug fixed. Assignment form no longer shown on Complete List<br>    (Real#0101)<br><br>    Bug fixed. The first saved draft wouldn't pop up again on Add<br>    Issue. Real#0079 became reproducable and fixed.<br><br>    New feature. AddIssue and QuickAddIssue is autosaving drafts now with AJAX.<br><br>    New feature. Inbound emails with header X-Spambayes-Classification=spam<br>    is automatically deleted and not uploaded.<br><br>    New feature. Option to enforce a different stylesshet<br>    http.//www.issuetrackerproduct.com/Documentation/How-Tos/forced-stylesheet<br><br>    Bug fixed. Assigned, Added, followups etc. on the User tab were<br>    sorted such old ones were shown first in the list. Reversed that.<br>    (Real#0078)<br><br>    New feature. If an error occurs the an error log file is only<br>    created if the error type is *not* in zope's error_log object<br>    on Zope2.7. (Real#0077)<br><br>    New feature. Which list you want to use is now stored in a cookie<br>    rather than a session.<br><br>0.6.8 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Emails couldn't be sent out if you had converted to<br>    storing all issues in a BTreeFolder2. So if you were using that,<br>    this fix will renable email dispatch for probably several unsent<br>    emails.<br><br>    New feature. Mention who added the issue on always notify messages<br>    (Real#0086)<br><br>    Bug fixed. Password reminder for Issue User Folder (Real#0025)<br><br>    Bug fixed. The 'subscribers' can no longer be set when<br>    instanciating the IssueTrackerIssue class. This solves Real#0033.<br><br>    New feature. When showing the issue it shows the age next to the<br>    date it was submitted, like on the List Issues.<br><br>0.6.7 (2013-01-01)<br>-------------------<br><br>    Bug fixed. It was not possible to create a Issue User Folder.<br>    Thanks Jeff for Real#0073.<br><br>    Bug fixed. The default sort order is now 'issuedate' and not<br>    modification date which was not recommended.<br><br>    Bug fixed. Who you choose with Tell-a-Friend is no longer<br>    remembered in a cookie. Can't remember why it was even doing it<br>    before.<br><br>    New feature. It is now possible to change the assignments if<br>    you're the one it's assigned to (Real#0045)<br><br>    Bug fixed. You couldn't use the View permission toggle because of<br>    a typo caused by legacy code. Thank you Goeldi (Real#0068)<br><br>    Bug fixed. Added SendInboundEmailConfirm_script.py back until a<br>    more grand solution has been found.<br><br>0.6.6 (2013-01-01)<br>-------------------<br><br>    New feature. Added firstname filtering as mentioned in Real#0065<br><br>    New feature. If subscription option on, when you look at an issue<br>    that you're already involved in, you do not get the option to<br>    subscribe since you're already implicitily a subscriber. (Real#0047)<br><br>    New feature. Filter settings you make are remembered persistently.<br>    They are stored with a (hopefully) descriptive english title. You<br>    can at any time select a previously used filter and apply it again.<br><br>    Bug fixed. Successfully telling a friend will no longer show the<br>    more options form again.<br><br>    New feature. Have fixed all source code to consistently use 4<br>    spaces for tabs. Before there was mix which could cause problems<br>    for other people except the author who uses jed (which doesn't<br>    care about the difference)<br><br>    New feature. AddIssue now has well defined tabindexes.<br><br>    Bug fixed. Finally Real#0014 has been solved thanks to Petter<br>    Warnsberg of Swede Ltd. It's called the \"Holly hack\" and we<br>    managed to reproduce it and see how it started to not blank out<br>    the followup box.<br><br>    New feature. Lists on the User page are now shortened with an option<br>    to show all.<br><br>    New feature. If you assign an issue to someone who is also on the<br>    'always notify' list it used to send out two emails. One about the<br>    new issue and one about the assignment. Not it only sends the<br>    assignment one. (Real#0026)<br><br>    New feature. Link to Add Issue on Quick Add Issue takes what you<br>    started writing with you to Add Issue. Thanks Jan (Real#0054)<br><br>    New feature. Printing issues (and consequently CompleteList) now<br>    looks much better with all the forms and navs hidden.<br><br>    Bug fixed. If you use \"Tell a Friend with more options\" and change<br>    the default message, the default message was still what was sent.<br><br>    Bug fixed. Issue threads and notification objects' ids are now<br>    incremented sanely. Before it was 1,3,5,7,... now it's 1,2,3,4,...<br><br>    New feature. NotYetRecent not in the URL when issue added (Real#0048)<br><br>    New feature. \"Images in menu\" and \"Can add new sections\" now part of<br>    the Properties Wizard.<br><br>    Bug fixed. If the display format is StructuredText and the text is<br>    just a number (eg. a telephone number) it *was* converted to a<br>    numbered list. UPDATE. this introduce a new bug that is now fixed.<br><br>    Bug fixed. If you tried to upload an image that doesn't exist it<br>    would return hard error when it tried to create a thumbnail.<br><br>    Bug fixed. New issues weren't saved to the BTreeFolder2 if you had<br>    set to use one.<br><br>    Bug fixed. Fixed the hard ParseError on stopword searches (Real#0024)<br><br>    New feature. If you have lots of issues you can now change the issue<br>    tracker to store all issues in a BTreeFolder2 container instead.<br>    This changes the URLs but if you accidently use a stale URL it will<br>    redirect you to the correct new issue URL.<br><br>    New feature. Issues are now movable in the ZMI. (Real#0030)<br><br>    New feature. Much improved Properties tab that uses web standards<br>    and Javascript. Degrades perfectly.<br>    See http.//www.issuetrackerproduct.com/News/improved-properties-tab<br><br>    Bug fixed. Lots of tidying up of the XHTML to make tidy happier.<br><br>    Bug fixed. Fixed bug in relative_url() due to new feature below.<br><br>    Bug fixed. Displaying issues without the \"Encode email links\" option<br>    on would cause a problem with addhrefs version 0.6<br>    (Thank you Jan Real#0034)<br><br>    New feature. discovery of absolute_url_path() replaces custom<br>    method.<br><br>    New feature. Ids are shown on the *left* of titles now (Real#0032)<br>    (if you enable showing ids with the title)<br><br>    Bug fixed. Email addresses found inside an issue or a followup<br>    text is also encoded if that option is on.<br>    (http.//www.peterbe.com/plog/add-hrefs-III)<br><br>    New feature. Option for Issue Users to enable keyboard shortcuts.<br><br>    Bug fixed. Due to a typo in getFilterValue() filters weren't saved<br>    in the SESSION so if you go anywhere else the filter options were<br>    forgotten.<br><br>    Bug fixed. Filters on lists from the user tab now work. Real#0010<br><br>    Bug fixed. Home page looked dodgy with no issues but Recent search<br>    history. Real#0002<br><br>    Bug fixed. Use of builtin False caused bombing out NameError for<br>    people who use Python2.1. (Also fixed some SyntaxWarnings for<br>    Python2.1) This fixes Real#0028. Thanks Stephan Goeldi.<br><br>0.6.5 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Pressing the Update Everything button twice caused a<br>    CatalogError because it tried to add certain indexes twice.<br><br>0.6.4 (2013-01-01)<br>-------------------<br><br>    Bug fixed. When writing a followup to an issue in the form at the<br>    bottom of the page and change your mind to use another action the<br>    text you've written is remembered. (Real#0020)<br><br>    New feature. New (advanced) option to show the issue Id next to the<br>    title of the issue in all displays. (asked for by Brent Skinner)<br><br>    New feature. If your search term is an issue id prefixed with a #<br>    it goes immediately to that issue without searching inside titles<br>    or descriptions.<br><br>    Bug fixed. POP3 management page could say that you need to have a<br>    folder called 'pop3' when it was not necessary (Real#0023)<br><br>    Bug fixed. Menu lost focus on Add Issue when you pressed the Save<br>    draft button.<br><br>    Bug fixed. Some hex encoded characters didn't show up correctly in<br>    the User template and shortening them went wrong in the Add Issue<br>    drafts list (if you have one).<br><br>    New feature. Previewing a followup or an issue now shows properly<br>    which people will be notified once it's submitted.<br><br>    New feature. User tab now has a list for all issues you are<br>    subscribed to.<br><br>    New feature. Issues and threads are now indexed in the ZCatalog<br>    with the ZCTextIndex instead to give much better search results<br>    when searching for issues. It's faster and more advanced.<br>    (Press the Update Everything button to activate it)<br><br>    New feature. Using a search term which is a section, status, type,<br>    urgency, fromname or email will make a special filter-link appear<br>    under the search box.<br><br>    New feature. _searchCatalog() is now more careful to not fetch<br>    thread objects that don't exist. (thanks Mark Thomas, Real#0018)<br><br>    New feature. Great speed optimization to ListIssues and CompleteList.<br><br>    Bug fixed. Resaving the cookie with draft issues now makes sure<br>    there's no stale drafts in the cookie.<br><br>    New feature. Compact and Rich lists in ListIssues. Default is Rich<br>    which is the good old list but if you click Compact you get a<br>    compacter list. See bottom of ListIssues page.<br><br>    New feature. People who can log in as Issue Users to an IssueTracker<br>    that is publically available can enable auto-login which means<br>    they're taken passed the login page when they come back.<br><br>    Bug fixed. Cookies expiration is again stored with proper RFC822<br>    format.<br><br>    Bug fixed. Fixed some issues with the tell_a_friend feature<br>    for issue users where their name wasn't found.<br><br>    New feature. Check in SubmitIssue() prevents duplicates. Same<br>    happens for new followups.<br><br>    Bug fixed. Fixed some filtering links from the Statistics page.<br><br>    New feature. Now you can specify Issue User Folder usernames<br>    in the Always notify property too.<br><br>    New feature. Added a standard_error_message with user-friendly<br>    error messages and directions for bug reporting.<br><br>0.6.3 (2013-01-01)<br>-------------------<br><br>    Bug fixed. CheckoutableTemplates was made a requirement for<br>    IssueTrackerProduct to start. Caused broken objects for people<br>    without CheckoutableTemplates.<br><br>    Bug fixed. HTML escaped in displayBriefTitle() used in Recent<br>    History and Home page but HEX HTML entities preserved.<br><br>0.6.2 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Made ValidEmailAddress() return True for foo'bar@some.com<br><br>    Bug fixed. Typo in IssueUserFolder made it impossible change<br>    'must_change_password'.<br><br>    Bug fixed. Improvements to feature about new sections (see below)<br><br>    Bug fixed. Improved how a Issue User saves display_format<br><br>    New feature. New option for making it possible to add new sections<br>    to an issuetracker when adding a new issue. (feature disabled by<br>    default. see Properties tab)<br><br>    New feature. Implemented a much faster unique() function.<br><br>    Bug fixed. sendReturnErrorEmail() had a typo bug. (thanks Bart<br>    Cortooms)<br><br>    Bug fixed. _alwaysNotifyMessage() now gets the title of an issue<br>    via the getTitle() method.<br><br>    Bug fixed. Filtering links from the home page used the wrong<br>    approach. Instead of showing the selected status it showed<br>    everything else. Thanks Simon Lucy<br><br>    Bug fixed. AcceptingEmail class inherited a whole module, not a<br>    class. This caused problems with its attributes and methods.<br><br>    Bug fixed. If 'slimmer' is installed, the Management, Properties and<br>    POP3 tabs would turn black. This happened because<br>    TemplateAdder.py had a bug where the 'optimize' parameter was<br>    incorrectly remember.<br><br>    Bug fixed. generateID() could raise a ValueError in Python2.1 if and<br>    when the prefix is an empty string.<br><br>    New feature. Option to disable XHTML optimization (if being applied)<br>    with environment variable OPTIMIZE_ISSUETRACKERPRODUCT<br><br>    Bug fixed. StandardHeader template could not be checked out even<br>    though it was defined as a CheckoutableTemplate.<br><br>    Bug fixed. Saving listlike properties through the Properties tab<br>    would not filter duplicates.<br><br>    New feature. this_package_home defined in IssueTracker class to<br>    filter out templates when using showCheckoutableTemplates.<br><br>0.6.1 (2013-01-01)<br>-------------------<br><br>    New feature. Installed addhrefs.py version 0.5.<br><br>    New feature. Option in Properties tab to make default sort order by<br>    modification- or by creation date. Also implemented in Properties<br>    Wizard.<br><br>    Bug fixed. Finding one issue when searching did not take the<br>    searchterm with it so no highlighting.<br><br>    Bug fixed. When initiating the ZCatalog, the 'title' TextIndex was<br>    not attached to the Vocabulary which prevented wildcard searches on<br>    the title.<br><br>    Bug fixed. Previewing follow ups shows who will be notified but if<br>    someone in that list has left their email blank they are now<br>    ignored.<br><br>    Bug fixed. Statistics could raise an UnboundLocalError in certain<br>    sitautions.<br><br>    Bug fixed. Assigning an issue to oneself does not check the little<br>    checkbox about notifications that appears.<br><br>    New feature. Installed the new addhrefs module<br>    (see http.//www.peterbe.com/plog/add-hrefs-II)<br><br>    Bug fixed. Using getRolesInContext(self) instead of getRoles() to<br>    take extra care for local roles. (Thanks Danny W. Adair, Asterisk Ltd)<br><br>    Bug fixed. Quick Add Issue could sometimes ask for Email when you<br>    are logged in as a Issue User.<br><br>    Bug fixed. If you delete an issue user the assignment as shown in<br>    ShowIssueData will no longer raise an error.<br><br>    Bug fixed. UnboundLocalError in dispatcher() caused notifications about<br>    followups not to be sent out.<br><br>    Bug fixed. If you forgot the subject line in a new issue, the REQUEST object<br>    was not passed back to AddIssueTemplate properly.<br><br>    Bug fixed. sendAlwaysNotify() is now wrapped with a nice try.except. catcher<br><br>    Bug fixed. Displayformat for Issue Users sometimes forgotten.<br><br>    Bug fixed. Switching on Issue Assignment was not backwardcompatible<br>    with old instances.<br><br>    Bug fixed. Was not compatible to Python 2.1 in HighlightQ().<br><br>0.6.0 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Assignees get notified with an email if not selected otherwise.<br><br>    Bug fixed. It is now possible to specify a notifyable groupname as an<br>    always notify. Will be very useful for teams that should all get<br>    notified of an added issue.<br><br>    New feature. You can now specify (in Properties tab) the signature to be<br>    used for the email sendouts.<br><br>    New feature. New option in properties makes it possible to have little<br>    icons to go with the items on the menu bar. See Properties tab.<br><br>    New feature. When logged in (standard ACL User or IssueTrackerUser) you<br>    now get a page with all your related issues and followups.<br><br>    New feature. An internal counter keeps track of what numerical increment<br>    to use when generating the next Id for an issue or a follow up.<br>    This works like sequences in PostgreSQL and prevents reappearing URLs<br>    when issues have been deleted.<br><br>    New feature. title tag now reflects what page you're on.<br><br>    Bug fixed. JPEG file attachments uploaded when using Internet Explorer used<br>    a non-standard content-type. (Thanks Melvin Jacobson)<br><br>    Bug fixed. File attachments that aren't file attachments can not be<br>    uploaded. Before one could manually write anything in the file attachment<br>    input box and it would be treated as a file. (Thanks Melvin Jacobson)<br><br>    New feature. Much improved information page about StructuredText with<br>    simple quick examples.<br><br>    New feature. Temporarily uploaded file attachments are now stored inside<br>    the issue tracker instance instead of the global /temp_folder which should<br>    do away with some low level persistency errors in Zope2.7.x.<br><br>    New feature. A button on the Management tab (ZMI) that updates everything<br>    that deploys standards, updates the ZCatalog, assures all objects have<br>    the correct attributes and clears temporary uploaded file attachments.<br><br>    New feature. A new and improved Properties Wizard.<br><br>    New feature. When showing issues, the urgency is explicitly styled if<br>    anything else than 'normal'. E.g. 'critical' is shown in bold and red.<br><br>    New feature. Whenever you add an issue, the selected sections you chose<br>    become more \"popular\" since their position in the list of options is moved<br>    up one notch.<br><br>    New feature. File attachments that are images are uploaded now with<br>    a little thumbnail if PIL is installed.<br><br>    New feature. Added a RSS 1.0 feed as the default feed. The 0.91 feed<br>    can still be reached on /rss-0.91.xml.<br><br>    Bug fixed. Certain strictly Management pages weren't secured for Zope<br>    managers only. Now they are.<br><br>    Bug fixed. When you update the catalog manually from the Management tab<br>    it logged lots of ERROR(200) messages which were not necessary and should<br>    now not appear anymore.<br><br>    New feature. ListIssues changed in layout and now also shows the first<br>    couple of words from the issue description.<br><br>    Bug fixed. Since Zope 2.5.x, when you add a ZCatalog it does not<br>    automatically create a Vocabulary. Added that to InitZCatalog().<br><br>    New feature. Improved the use of Recent history so the page templates<br>    will now show them without having to create a Batch object. This will<br>    decrease rendering time.<br><br>    New feature. If you search an click a found issue, '?=' is not passed<br>    in the URL but still works the same. More convenient for copy-and-paste<br>    URLs without the search argument.<br><br>    New feature. All templates are now interfaced as CheckoutableTemplates<br>    (see http.//zope.org/Members/peterbe/CheckoutableTemplates)<br>    This means that any IssueTrackerProduct instance's templates can easily<br>    be customized without having to change any sourcecode and makes it<br>    possible to install upgrades.<br><br>    New feature. Almost all occurances of absolute URLs in the generated<br>    HTML has been replaced by relative ones. This makes the resulting<br>    HTML slightly smaller in size.<br><br>    New feature. ListIssues and CompleteList is now much faster<br>    if you are not doing a search. It was before doing a search on<br>    nothing instead of using objectValues(). Great speed improvement.<br><br>    New feature. POP3Account now has a configurable port number.<br><br>    Bug fixed. POP3 was not working in Zope270 due to a bad class import.<br><br>0.5.2 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Added View security on RSS feed.<br><br>    Bug fixed. Removed the use of the variable 'yield' since this is now a<br>    reserved keyword in Python 2.3.x<br><br>    New feature. If you're logged in to Zope, your fromname and email<br>    is stored so that if you loose your cookie but log in the same the<br>    fromname and email is still there.<br><br>    Bug fixed. preParseEmailString() in IssueTrackerUtils() could return None<br>    when expecting list, now it returns [] in this case. Affected POP3.<br><br>    Bug fixed. Email and followup action shown separatly now on<br>    \"5 Latest Issues\".<br><br>    Bug fixed. Sometimes the \"Notify the others\" on followup showed<br>    incorrect results.<br><br>    Bug fixed. Subscribers aren't automatically added to all next issues.<br><br>    New feature. List Issues now shows what last happened in every<br>    issue.<br><br>    New feature. \"5 Latest Issues\" shows who posted the last followup.<br><br>    New feature. If the submitter is in Always notify, he is not getting<br>    the Always notify email.<br><br>0.5.1 (2013-01-01)<br>-------------------<br><br>    Bug fixed. AddIssue and QuickAddIssue wasn't properly implemented<br>    with the ClassSecurityInfo() which would cause a \"unauthorized\"<br>    error without login prompt if a parent object has the View<br>    permission switched off.<br><br>    Bug fixed. The accesskeys previously implemented didn't work<br>    properly in Internet Explorer so I took it off until I know<br>    more about adding accesskeys.<br><br>    New feature. Accesskeys to the main tabs. Try for example. ALT + h<br><br>    New feature. There is now a 'Show Always notify status' option<br>    if you want to display which Always notify that have been notified.<br>    Very useful to the \"issue adder\" if uncertain who gets to know<br>    about the added issue. Default is off. See Advanced properties.<br><br>    New feature. If you call rss.xml?show=all then it also shows<br>    threads/follow ups are items with \"Followup to.\" added to the<br>    title of the issue.<br><br>    Bug fixed. rss.xml did not sort on 'issuedate' but on default<br>    sortorder which could become confusing.<br><br>    Bug fixed. When using your own statuses and the first one is not<br>    'open', you would get an error when trying to add an issue when<br>    not running as manager.<br><br>    Bug fixed. When creating an issuetracker instance and using the<br>    Properties Wizard some default boolean values were incorrectly<br>    saved.<br><br>    Bug fixed. Creation of emails was buggy because of spelling<br>    misstake. It read '\\r\\b' when it should have been '\\r\\n'.<br><br>    Bug fixed. Dodgy emails wheren't ignored properly. Now they are.<br><br>    Bug fixed. \"(mail@peterbe.com) bla bla\" was converted to.<br>    \"&lt;a href=\"mailto.(mail@peterbe.com)\"&gt;(mail@peterbe.com)&lt;/a&gt; bla bl\"<br>    but now that is fixed.<br><br>0.5.0b (2013-01-01)<br>-------------------<br><br>    New feature. When viewing an issue, the Add followup etc. buttons<br>    is only shown at the top. At the bottom is a minial version of<br>    the Add Followup form.<br><br>    New feature. Now statuses are no longer hardcoded.<br>    See the Properties tab where each line is a state,action combo<br>    of statuses. Looking at the existing list it should be obvious<br>    how it works.<br><br>    New feature. Download button and the Confidential &amp; Hide me<br>    options are now by default hidden.<br><br>    New feature. JavaScript encoded email hyperlinks. Idea taken from<br>    http.//www.zope.org/Members/jmeile/email%20encoder<br>    A new property has been introduced for this. See bottom of<br>    Properties tab. This is **recommended** for public instances.<br><br>    New feature. A simple Statistics page. It's linked from the Home<br>    page if you're logged in as Manager or if you have switched of the<br>    Private Statistics property.<br><br>    New feature. Inbound emails now get a confirmation message sent<br>    back. This is optional and for it to work you need to redeploy<br>    standards to get the SendInboundEmailConfirm_script<br><br>    Bug fixed. Accepting email objects can not be created if the<br>    email address is already used as an always-notify to prevent<br>    notifications becoming inbound email.<br><br>    Bug fixed. Dodgy email attachments are now ignored thanks to an<br>    added try &amp; except statement.<br><br>    New feature. When you upgrade the product some new properties<br>    might have been introduced but not instanciated for. Visit the<br>    Management tab and see the All properties header.<br><br>    New feature. Inbound email via POP3. You can now set up one or<br>    more POP3 accounts each with one or more email addresses that are<br>    dedicated to sniff for emails sent to it that is converted to<br>    issues.<br>    It depends on the email package from http.//mimelib.sourceforge.net/<br>    and if you want to strip HTML formatted emails you are advised to<br>    install Strip-o-Gram from http.//www.zope.org/Members/chrisw/StripOGram<br>    For this to work you are expected to set up some sort of cron job<br>    to periodically check for new email.<br><br>    Bug fixed. Lines that start with a URL or an email address turned<br>    to e.g. c&lt;a href=\"mailto.opyright@dot.com\"&gt;opyright@dot.com&lt;/a&gt;.<br>    Now that has been fixed.<br><br>    Bug fixed. Removing several groups in the Notifyable groups now<br>    works. Thank you Wolfgang Reinelt.<br><br>    Bug fixed. Adding and removing other properties now work.<br><br>    Bug fixed. Open option available when issue already Open.<br>    (was because it tested if 'Open'=='open')<br><br>    New feature. Added createIssueObject() method so that you'll be<br>    able to create issue objects other than via the web.<br><br>    New feature. Added Subscription to issues. See Properties tab to<br>    enable this.<br><br>    Bug fixed. Searching for name or email was before assumed AND,<br>    but now it assumes OR.<br><br>    New feature. File attachements to followups. See Properties tab.<br><br>    Bug fixed. Improved getRoot() even more since last bug fix was<br>    not sufficient.<br><br>    Bug fixed. When pressing the Delete button you no longer get a<br>    Javascript error.<br><br>    Bug fixed. Improved getRoot() when using Virtual Hosts<br><br>    Bug fixed. When pressing 'Save Changes' in the Properties tab the<br>    page was returned completely blank. Now it \"redirects\" back to the<br>    Properties tab as expected.<br><br>    Bug fixed. ShowIssueData and the 'change these attributes' action<br>    link was misspelled. Now fixed.<br><br>    Gave up on the ReportLab module. CompleteList will have to suffice<br>    for now.<br><br>    Bug fixed. UpdateCatalog() now clears the catalog before it<br>    reindexes all objects.<br><br>    New feature. added showURL2Issue() which concatenates too<br>    long URLs in ShowIssueData.<br><br>    Bug fixed. Search highlight does now not mess with tags.<br>    Try searching for 'strong' or 'p'. Before it looked odd.<br><br>    Bug fixed. Latest issues on homepage is now latest issues.<br>    Before it used cookie sortorders.<br><br>0.4.9b (2013-01-01)<br>-------------------<br><br>    Improved \"5 latest issues\" to indicate followups.<br><br>    Improved wording in batchlinks.<br><br>    Improved search results so that it applies sorting based on the<br>    actual search.<br><br>    New feature. Comments searchable. Together with this, see the Management<br>    tab for the new Update Catalog button which you'll need to press.<br><br>0.4.9a (2013-01-01)<br>-------------------<br><br>    Bug fixed. Searching the catalog with Zope2.6.1b1<br><br>    New feature. Added Properties Wizard for when you create an instance.<br>    Can be reached from the Properties tab too.<br><br>    New feature. Added favicon.ico object.<br><br>    Improved look of the StandardHeader and standards.css<br>    This requires redeployment.<br><br>    Bug fixed. Always notify crashed if no always_notify.<br><br>    New feature. Complete batch alternative \"Show them all\".<br><br>    Bug fixed. filteroptions now stored in session.<br><br>    New feature. Hidable filter options.<br><br>    New feature. Sortorder settings stored in cookie now.<br><br>    New feature. CompleteList page, shows all of issues and their comments.<br><br>    Improved addhrefs() to ignore ending brackets, dots, commas and semicolon.<br><br>    Improved manage_editIssueTrackerProperties() to use __dict__ instead of exec<br><br>    New feature. cache prevent based on a property called 'Stop cache'<br>    Requires that you redeploy StandardLook.<br><br>    Bug fixed. ListIssues now has security settings like it's supposed to have.<br><br>    New feature. If you set 'Allow issue attribute change' in Properties<br>    managers can change the properties of an issue once it's been submitted.<br>    Thanks Robert Allyn for suggesting this.<br><br>    Bug fixed. 'Notify others' option was ignored whilst you're<br>    previewing a followup.<br><br>    Bug fixed. how always_notifys are sent out.<br>    Thanks Robert Allyn for noticing this.<br><br>    New feature. to Management called ReplaceEmail.<br><br>0.4.8a (2013-01-01)<br>-------------------<br><br>    Added HREFs to URLs in text.<br><br>    Fixed so that anonymous users could preview followups.<br><br>    Bug fixes when UpdateCatalog() has been invoked.<br><br>    Made getRecentHistory() careful with deleted issues.<br><br>    Fixed some bug where instance variable name_cookiekey was used.<br><br>0.4.7b (2013-01-01)<br>-------------------<br><br>    Removed gif [action]buttons and used CSS instead. (faster loading)<br><br>    Added always_notify property so that you can have people that get emails<br>    silently about all new issues added. This works together with Notifyables.<br><br>    Made it possible to search by Issue id. Type in an issue id and it takes<br>    you there.<br><br>    Made emailstring cookies be per instance but fromname and email is across<br>    all instances.<br><br>    Added \"Your Recent History\" feature. It's \"cacheconfusion\" is debatable<br>    still.<br><br>    Changed the searching so that when searching the title attributes is<br>    wrapped with two wildcards on both sides.<br>    Will now find \"This is the title...\" when searching for \"itl\".<br><br>    Added preview when adding a followup.<br><br>    Fixed bug in \"Complete redeployment\"<br><br>    Now you can Send2Friends from any issue and not only newly added ones.<br>    (requires you to redeploy SendIssue2Friends_script)<br><br>    Added link to document about Structured Text.<br><br>    Fixed little bug in SendIssue2Friends_script so it saves email address<br>    even if emails fail to send.<br><br>    Removed lots of redundant code. Especially from IssueTrackerUtils.<br><br>    Created the Issue Tracker Notifyable Container folderish object so that<br>    many instances can share the same notifyables.<br><br>    Made notifyable groups a class with 'Issue Tracker Notifyable Group'<br>    objects instead of just a list property.<br><br>    Separated out the notifyables stuff to IssueTrackerNotifyables.py.<br><br>    Created IssueTrackerConstants.py module for better software design.<br><br>    Usability improvments to Add Issue, Quick Add Issue and Management.<br><br>0.4.6a (2013-01-01)<br>-------------------<br><br>    File attachments feature (see properties to turn it on).<br><br>    Nice and cachable URLs now used for sortorder, reverse and batchsizing.<br>    ListIssues/sortorder-sections/reverse-1/start-12<br>    ...instead of...<br>    ListIssues?sortorder=sections&amp;reverse=1&amp;start=12<br><br>    Improved AddIssue, QuickAddIssue and AddFollowup so that it sets<br>    focus in the first field of the input first automatically.<br>    (requires StandardLook object refreshed)<br><br>    Modified generateID() to generate more sensible ids independent<br>    of their location in space.<br><br>    Minor improvements to the dispatcher.html object in standards.<br><br>    Fixed the tabs for IssueNotifications.<br><br>    Fixed the tabs for IssueThreads.<br><br>0.4.5b (2013-01-01)<br>-------------------<br><br>    Fixed some major bugs for sending out emails. You must now redeploy the<br>    dispatcher.html object.<br><br>    Added search feature. Queried word is highlighted case insensitivly.<br><br><br>0.4.4b (2013-01-01)<br>-------------------<br><br>    What makes an IssueTracker manager is now stored in 'manager_roles'<br>    property.<br><br>    Emailstrings on new issues for multipmail is now saved in a cookie.<br>    You need to Redeploy the SendIssue2Friends_script object (i.e. delete<br>    it and visit the Management tab and press \"Deploy and preserve existing\")<br><br>    Fixed a typo that broke the batching of lots of issues. Twice.<br><br>0.4.4a (2013-01-01)<br>-------------------<br><br>    Added sendEmail() method and changed SendIssue2Friends_script.py correspondingly.<br><br>    Added the filter options at the bottom of ListIssues (for evaluation)<br><br>0.4.3 (2013-01-01)<br>-------------------<br><br>    Started making the ZClass product a python product<br><br>-------------------------<br>IssueTrackerMassContainer<br>-------------------------<br><br>0.2.0 (2013-01-01)<br>-------------------<br><br>    New feature. Massive performance boost by using ZCatalog better<br>    for fetching all recent issues and avoiding a python sort on no<br>    more than 15 issues at a time. <br><br>0.1.1 (2013-01-01)<br>-------------------<br><br>    New feature. Show 20 items on the dashboard instead of 15<br>    <br>    New feature. The ability to ignore trackers and other<br>    masscontainers is removed. It brings little value and much<br>    confusion.<br>    <br>    New feature. Odd/Even columns coloured like inside<br>    IssueTrackerProduct.<br>    <br>    Bug fixed. The continual lookup could sometimes keep adding the<br>    same new issue(s) to the dashboard due to a difference between<br>    the client-side (Javascipt) datetime and the server-side (Zope)<br><br>0.1.0 (2013-01-01)<br>-------------------<br><br>    New feature. Thanks to optimization the dashboard AJAX refresh<br>    interval can go down to <br><br>    New feature. Even more optimized dashboard and even more memory<br>    efficient not most importantly, not broken like version 0.0.12 was.<br>    <br>0.0.12 (2013-01-01)<br>-------------------<br><br>    New feature. Further improvements from 0.0.11. Now, with a cache<br>    you get the nice effect every time you reload the activity page.<br>    <br>0.0.11 (2013-01-01)<br>-------------------<br><br>    New feature. Massive optimization success. See <br>    http.//www.peterbe.com/plog/massive-improvement-on-sorting-a-fat-list<br><br>0.0.10 (2013-01-01)<br>-------------------<br><br>    New feature. Masscontainer only counts issues, not join-in issues<br>    in trackers that have this defined.<br><br>0.0.9 (2013-01-01)<br>-------------------<br><br>    New feature. Activity AJAX just gets the new issues since last<br>    AJAX call.<br><br>0.0.8 (2013-01-01)<br>-------------------<br><br>    * major change to structure *<br>    <br>0.0.7 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Made it compatible with zope 2.8<br>    <br>0.0.6 (2013-01-01)<br>-------------------<br><br>    Bug fixed. Use of issue.getEmail() instead of issue.email<br>    (getEmail() is better)<br>    <br>0.0.5 (2013-01-01)<br>-------------------<br><br>    Bug fixed. defaults for use_native_header and use_native_footer<br>    <br>0.0.4 (2013-01-01)<br>-------------------<br><br>    New feature. findCorrectURL() can be called from<br>    standard_error_message to find alternative URLs on 404s.<br><br>    New feature. Changed the default automate script to be more<br>    up-to-date<br><br>0.0.3 (2013-01-01)<br>-------------------<br><br>    New feature. Option for disabling native headers as well as footers.<br>    <br>    Bug fixed. Corrected CSS to colorize thread changes.<br>    <br>0.0.3 (2013-01-01)<br>-------------------<br><br>    Bug fixed. The Masscontainer didn't properly listen to the <br>    Security settings from Zope. Now it does, so if you disable<br>    acquiring the View permission, then authentication is invoked.<br><br>    New feature. RSS links to all issuetrackers<br><br>0.0.2a (2013-01-01)<br>-------------------<br><br>    New feature. DeployStandards() which creates automate script.<br><br>0.0.1a (2013-01-01)<br>-------------------<br><br>    First release\n          </div>"}, "last_serial": 821609, "releases": {"0.14.2": [{"comment_text": "", "digests": {"md5": "036df06cd2475569028c4c602ea21bc3", "sha256": "8f924c6ccd801ba79c568556b79827b36537bb555f7cd4c36ea4456612f85fe6"}, "downloads": -1, "filename": "IssueTrackerProduct-0.14.2.zip", "has_sig": false, "md5_digest": "036df06cd2475569028c4c602ea21bc3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1407823, "upload_time": "2013-07-21T18:29:48", "upload_time_iso_8601": "2013-07-21T18:29:48.908652Z", "url": "https://files.pythonhosted.org/packages/d3/2f/5aaebbe3b90dbce4e5045ca1f1b6499ceaef6dcb4334f3393777b362ee9e/IssueTrackerProduct-0.14.2.zip", "yanked": false}], "0.14.2.dev0": [{"comment_text": "", "digests": {"md5": "b1c940bcfce9763c4a128884c6089803", "sha256": "616f7de4db06b32f8e2a495392d77dc58dda08268f542a916b0a15d19b6918f2"}, "downloads": -1, "filename": "IssueTrackerProduct-0.14.2.dev0.zip", "has_sig": false, "md5_digest": "b1c940bcfce9763c4a128884c6089803", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1411918, "upload_time": "2013-07-21T18:11:48", "upload_time_iso_8601": "2013-07-21T18:11:48.032948Z", "url": "https://files.pythonhosted.org/packages/b0/22/6b23b283297737ff37471a99d8567f0be4494d76d6a4b00b5bae56644805/IssueTrackerProduct-0.14.2.dev0.zip", "yanked": false}], "0.14.3": []}, "urls": [], "timestamp": "Fri May  8 00:53:53 2020"}