{"info": {"author": "Greg Albrecht", "author_email": "oss@undef.net", "bugtrack_url": null, "classifiers": [], "description": "JEB: Just Enough Blog\n\nA minimal 'blog' generation utility. Transforms markdown and jinja templates into something like http://ampledata.org/\n\n.. image:: https://secure.travis-ci.org/ampledata/jeb.png?branch=develop\n        :target: https://secure.travis-ci.org/ampledata/jeb\n\nSource\n======\nGithub: https://github.com/ampledata/jeb\n\nAuthor\n======\nGreg Albrecht <mailto:oss@undef.net>\n\nCopyright\n=========\nCopyright 2017 Greg Albrecht\n\nLicense\n=======\nCreative Commons Attribution 3.0 Unported License\n", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/ampledata/jeb", "keywords": "", "license": "THE WORK (AS DEFINED BELOW) IS PROVIDED UNDER THE TERMS OF THIS CREATIVE COMMONS PUBLIC LICENSE (\"CCPL\" OR \"LICENSE\"). THE WORK IS PROTECTED BY COPYRIGHT AND/OR OTHER APPLICABLE LAW. ANY USE OF THE WORK OTHER THAN AS AUTHORIZED UNDER THIS LICENSE OR COPYRIGHT LAW IS PROHIBITED.\n\nBY EXERCISING ANY RIGHTS TO THE WORK PROVIDED HERE, YOU ACCEPT AND AGREE TO BE BOUND BY THE TERMS OF THIS LICENSE. TO THE EXTENT THIS LICENSE MAY BE CONSIDERED TO BE A CONTRACT, THE LICENSOR GRANTS YOU THE RIGHTS CONTAINED HERE IN CONSIDERATION OF YOUR ACCEPTANCE OF SUCH TERMS AND CONDITIONS.\n\n1. Definitions\n\n\"Collective Work\" means a work, such as a periodical issue, anthology or encyclopedia, in which the Work in its entirety in unmodified form, along with one or more other contributions, constituting separate and independent works in themselves, are assembled into a collective whole. A work that constitutes a Collective Work will not be considered a Derivative Work (as defined below) for the purposes of this License.\n\"Derivative Work\" means a work based upon the Work or upon the Work and other pre-existing works, such as a translation, musical arrangement, dramatization, fictionalization, motion picture version, sound recording, art reproduction, abridgment, condensation, or any other form in which the Work may be recast, transformed, or adapted, except that a work that constitutes a Collective Work will not be considered a Derivative Work for the purpose of this License. For the avoidance of doubt, where the Work is a musical composition or sound recording, the synchronization of the Work in timed-relation with a moving image (\"synching\") will be considered a Derivative Work for the purpose of this License.\n\"Licensor\" means the individual, individuals, entity or entities that offers the Work under the terms of this License.\n\"Original Author\" means the individual, individuals, entity or entities who created the Work.\n\"Work\" means the copyrightable work of authorship offered under the terms of this License.\n\"You\" means an individual or entity exercising rights under this License who has not previously violated the terms of this License with respect to the Work, or who has received express permission from the Licensor to exercise rights under this License despite a previous violation.\n2. Fair Use Rights. Nothing in this license is intended to reduce, limit, or restrict any rights arising from fair use, first sale or other limitations on the exclusive rights of the copyright owner under copyright law or other applicable laws.\n\n3. License Grant. Subject to the terms and conditions of this License, Licensor hereby grants You a worldwide, royalty-free, non-exclusive, perpetual (for the duration of the applicable copyright) license to exercise the rights in the Work as stated below:\n\nto reproduce the Work, to incorporate the Work into one or more Collective Works, and to reproduce the Work as incorporated in the Collective Works;\nto create and reproduce Derivative Works provided that any such Derivative Work, including any translation in any medium, takes reasonable steps to clearly label, demarcate or otherwise identify that changes were made to the original Work. For example, a translation could be marked \"The original work was translated from English to Spanish,\" or a modification could indicate \"The original work has been modified.\";;\nto distribute copies or phonorecords of, display publicly, perform publicly, and perform publicly by means of a digital audio transmission the Work including as incorporated in Collective Works;\nto distribute copies or phonorecords of, display publicly, perform publicly, and perform publicly by means of a digital audio transmission Derivative Works.\nFor the avoidance of doubt, where the Work is a musical composition:\n\nPerformance Royalties Under Blanket Licenses. Licensor waives the exclusive right to collect, whether individually or, in the event that Licensor is a member of a performance rights society (e.g. ASCAP, BMI, SESAC), via that society, royalties for the public performance or public digital performance (e.g. webcast) of the Work.\nMechanical Rights and Statutory Royalties. Licensor waives the exclusive right to collect, whether individually or via a music rights agency or designated agent (e.g. Harry Fox Agency), royalties for any phonorecord You create from the Work (\"cover version\") and distribute, subject to the compulsory license created by 17 USC Section 115 of the US Copyright Act (or the equivalent in other jurisdictions).\nWebcasting Rights and Statutory Royalties. For the avoidance of doubt, where the Work is a sound recording, Licensor waives the exclusive right to collect, whether individually or via a performance-rights society (e.g. SoundExchange), royalties for the public digital performance (e.g. webcast) of the Work, subject to the compulsory license created by 17 USC Section 114 of the US Copyright Act (or the equivalent in other jurisdictions).\nThe above rights may be exercised in all media and formats whether now known or hereafter devised. The above rights include the right to make such modifications as are technically necessary to exercise the rights in other media and formats. All rights not expressly granted by Licensor are hereby reserved.\n\n4. Restrictions. The license granted in Section 3 above is expressly made subject to and limited by the following restrictions:\n\nYou may distribute, publicly display, publicly perform, or publicly digitally perform the Work only under the terms of this License, and You must include a copy of, or the Uniform Resource Identifier for, this License with every copy or phonorecord of the Work You distribute, publicly display, publicly perform, or publicly digitally perform. You may not offer or impose any terms on the Work that restrict the terms of this License or the ability of a recipient of the Work to exercise the rights granted to that recipient under the terms of the License. You may not sublicense the Work. You must keep intact all notices that refer to this License and to the disclaimer of warranties. When You distribute, publicly display, publicly perform, or publicly digitally perform the Work, You may not impose any technological measures on the Work that restrict the ability of a recipient of the Work from You to exercise the rights granted to that recipient under the terms of the License. This Section 4(a) applies to the Work as incorporated in a Collective Work, but this does not require the Collective Work apart from the Work itself to be made subject to the terms of this License. If You create a Collective Work, upon notice from any Licensor You must, to the extent practicable, remove from the Collective Work any credit as required by Section 4(b), as requested. If You create a Derivative Work, upon notice from any Licensor You must, to the extent practicable, remove from the Derivative Work any credit as required by Section 4(b), as requested.\nIf You distribute, publicly display, publicly perform, or publicly digitally perform the Work (as defined in Section 1 above) or any Derivative Works (as defined in Section 1 above) or Collective Works (as defined in Section 1 above), You must, unless a request has been made pursuant to Section 4(a), keep intact all copyright notices for the Work and provide, reasonable to the medium or means You are utilizing: (i) the name of the Original Author (or pseudonym, if applicable) if supplied, and/or (ii) if the Original Author and/or Licensor designate another party or parties (e.g. a sponsor institute, publishing entity, journal) for attribution (\"Attribution Parties\") in Licensor's copyright notice, terms of service or by other reasonable means, the name of such party or parties; the title of the Work if supplied; to the extent reasonably practicable, the Uniform Resource Identifier, if any, that Licensor specifies to be associated with the Work, unless such URI does not refer to the copyright notice or licensing information for the Work; and, consistent with Section 3(b) in the case of a Derivative Work, a credit identifying the use of the Work in the Derivative Work (e.g., \"French translation of the Work by Original Author,\" or \"Screenplay based on original Work by Original Author\"). The credit required by this Section 4(b) may be implemented in any reasonable manner; provided, however, that in the case of a Derivative Work or Collective Work, at a minimum such credit will appear, if a credit for all contributing authors of the Derivative Work or Collective Work appears, then as part of these credits and in a manner at least as prominent as the credits for the other contributing authors. For the avoidance of doubt, You may only use the credit required by this Section for the purpose of attribution in the manner set out above and, by exercising Your rights under this License, You may not implicitly or explicitly assert or imply any connection with, sponsorship or endorsement by the Original Author, Licensor and/or Attribution Parties, as appropriate, of You or Your use of the Work, without the separate, express prior written permission of the Original Author, Licensor and/or Attribution Parties.\n5. Representations, Warranties and Disclaimer\n\nUNLESS OTHERWISE MUTUALLY AGREED TO BY THE PARTIES IN WRITING, LICENSOR OFFERS THE WORK AS-IS AND ONLY TO THE EXTENT OF ANY RIGHTS HELD IN THE LICENSED WORK BY THE LICENSOR. THE LICENSOR MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND CONCERNING THE WORK, EXPRESS, IMPLIED, STATUTORY OR OTHERWISE, INCLUDING, WITHOUT LIMITATION, WARRANTIES OF TITLE, MARKETABILITY, MERCHANTIBILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT, OR THE ABSENCE OF LATENT OR OTHER DEFECTS, ACCURACY, OR THE PRESENCE OF ABSENCE OF ERRORS, WHETHER OR NOT DISCOVERABLE. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO SUCH EXCLUSION MAY NOT APPLY TO YOU.\n\n6. Limitation on Liability. EXCEPT TO THE EXTENT REQUIRED BY APPLICABLE LAW, IN NO EVENT WILL LICENSOR BE LIABLE TO YOU ON ANY LEGAL THEORY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE OR EXEMPLARY DAMAGES ARISING OUT OF THIS LICENSE OR THE USE OF THE WORK, EVEN IF LICENSOR HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. Termination\n\nThis License and the rights granted hereunder will terminate automatically upon any breach by You of the terms of this License. Individuals or entities who have received Derivative Works (as defined in Section 1 above) or Collective Works (as defined in Section 1 above) from You under this License, however, will not have their licenses terminated provided such individuals or entities remain in full compliance with those licenses. Sections 1, 2, 5, 6, 7, and 8 will survive any termination of this License.\nSubject to the above terms and conditions, the license granted here is perpetual (for the duration of the applicable copyright in the Work). Notwithstanding the above, Licensor reserves the right to release the Work under different license terms or to stop distributing the Work at any time; provided, however that any such election will not serve to withdraw this License (or any other license that has been, or is required to be, granted under the terms of this License), and this License will continue in full force and effect unless terminated as stated above.\n8. Miscellaneous\n\nEach time You distribute or publicly digitally perform the Work (as defined in Section 1 above) or a Collective Work (as defined in Section 1 above), the Licensor offers to the recipient a license to the Work on the same terms and conditions as the license granted to You under this License.\nEach time You distribute or publicly digitally perform a Derivative Work, Licensor offers to the recipient a license to the original Work on the same terms and conditions as the license granted to You under this License.\nIf any provision of this License is invalid or unenforceable under applicable law, it shall not affect the validity or enforceability of the remainder of the terms of this License, and without further action by the parties to this agreement, such provision shall be reformed to the minimum extent necessary to make such provision valid and enforceable.\nNo term or provision of this License shall be deemed waived and no breach consented to unless such waiver or consent shall be in writing and signed by the party to be charged with such waiver or consent.\nThis License constitutes the entire agreement between the parties with respect to the Work licensed here. There are no understandings, agreements or representations with respect to the Work not specified here. Licensor shall not be bound by any additional provisions that may appear in any communication from You. This License may not be modified without the mutual written agreement of the Licensor and You.", "maintainer": "", "maintainer_email": "", "name": "jeb", "package_url": "https://pypi.org/project/jeb/", "platform": "", "project_url": "https://pypi.org/project/jeb/", "project_urls": {"Homepage": "https://github.com/ampledata/jeb"}, "release_url": "https://pypi.org/project/jeb/2.0.0/", "requires_dist": null, "requires_python": "", "summary": "JEB: Just Enough Blog", "version": "2.0.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>JEB: Just Enough Blog</p>\n<p>A minimal ‘blog’ generation utility. Transforms markdown and jinja templates into something like <a href=\"http://ampledata.org/\" rel=\"nofollow\">http://ampledata.org/</a></p>\n<a href=\"https://secure.travis-ci.org/ampledata/jeb\" rel=\"nofollow\"><img alt=\"https://secure.travis-ci.org/ampledata/jeb.png?branch=develop\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/6f97cb1ae85988a5b76d193f0f89ac435dd3b9e4/68747470733a2f2f7365637572652e7472617669732d63692e6f72672f616d706c65646174612f6a65622e706e673f6272616e63683d646576656c6f70\"></a>\n<div id=\"source\">\n<h2>Source</h2>\n<p>Github: <a href=\"https://github.com/ampledata/jeb\" rel=\"nofollow\">https://github.com/ampledata/jeb</a></p>\n</div>\n<div id=\"author\">\n<h2>Author</h2>\n<p>Greg Albrecht &lt;<a href=\"mailto:oss%40undef.net\">mailto:oss<span>@</span>undef<span>.</span>net</a>&gt;</p>\n</div>\n<div id=\"copyright\">\n<h2>Copyright</h2>\n<p>Copyright 2017 Greg Albrecht</p>\n</div>\n<div id=\"license\">\n<h2>License</h2>\n<p>Creative Commons Attribution 3.0 Unported License</p>\n</div>\n\n          </div>"}, "last_serial": 2995876, "releases": {"1.1.0": [{"comment_text": "", "digests": {"md5": "d3b6ae9fe8567cf86dcdd3de20f7399c", "sha256": "07db8b0880e97263e5fc68aa5ecdc22dbd2ff31260e73adf1e5294ac4a0f9ef7"}, "downloads": -1, "filename": "jeb-1.1.0.tar.gz", "has_sig": false, "md5_digest": "d3b6ae9fe8567cf86dcdd3de20f7399c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 7286, "upload_time": "2013-09-24T00:16:23", "upload_time_iso_8601": "2013-09-24T00:16:23.566561Z", "url": "https://files.pythonhosted.org/packages/38/f6/41160e9467f968ba25c432c1b267bfa89e8237c1a8929f5a5f806c1c3748/jeb-1.1.0.tar.gz", "yanked": false}], "1.1.1": [{"comment_text": "", "digests": {"md5": "419807cf0571cac8279cb904f573a9af", "sha256": "9008ecee393b38fe88c1dd54d6bb9e4f47b63e4b026215393447196f2f5e19c2"}, "downloads": -1, "filename": "jeb-1.1.1.tar.gz", "has_sig": false, "md5_digest": "419807cf0571cac8279cb904f573a9af", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 7792, "upload_time": "2013-09-24T00:21:18", "upload_time_iso_8601": "2013-09-24T00:21:18.680941Z", "url": "https://files.pythonhosted.org/packages/96/4a/12cc5ccc0a3a2ecacd02af7c205c9c6871875ce2e96675dd24143e081a0c/jeb-1.1.1.tar.gz", "yanked": false}], "2.0.0": [{"comment_text": "", "digests": {"md5": "549c1e4974c1584eae64abf2fdc10a76", "sha256": "ccc154e73fa1552af5468876d7c55f1b3af46a6e05bb886d575245ddcdb0bfe3"}, "downloads": -1, "filename": "jeb-2.0.0.tar.gz", "has_sig": false, "md5_digest": "549c1e4974c1584eae64abf2fdc10a76", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 7746, "upload_time": "2017-07-03T06:12:02", "upload_time_iso_8601": "2017-07-03T06:12:02.765797Z", "url": "https://files.pythonhosted.org/packages/4b/9f/197d187a226f80801029dc90ce9ae513cbc42b7df71e11ca774e080d16c8/jeb-2.0.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "549c1e4974c1584eae64abf2fdc10a76", "sha256": "ccc154e73fa1552af5468876d7c55f1b3af46a6e05bb886d575245ddcdb0bfe3"}, "downloads": -1, "filename": "jeb-2.0.0.tar.gz", "has_sig": false, "md5_digest": "549c1e4974c1584eae64abf2fdc10a76", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 7746, "upload_time": "2017-07-03T06:12:02", "upload_time_iso_8601": "2017-07-03T06:12:02.765797Z", "url": "https://files.pythonhosted.org/packages/4b/9f/197d187a226f80801029dc90ce9ae513cbc42b7df71e11ca774e080d16c8/jeb-2.0.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:52:56 2020"}