{"info": {"author": "David Lesieur", "author_email": "kerko@whiskyechobravo.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Environment :: Web Environment", "Framework :: Flask", "Intended Audience :: Developers", "Intended Audience :: Education", "Intended Audience :: Science/Research", "License :: OSI Approved :: GNU General Public License v3 (GPLv3)", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3.8", "Programming Language :: Python :: 3 :: Only", "Topic :: Database :: Front-Ends", "Topic :: Education", "Topic :: Internet :: WWW/HTTP :: Dynamic Content", "Topic :: Internet :: WWW/HTTP :: Indexing/Search", "Topic :: Scientific/Engineering", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "[![License](https://img.shields.io/pypi/l/kerko)][Kerko]\n[![Version](https://img.shields.io/pypi/v/kerko?color=informational)][Kerko_pypi]\n\n# Kerko\n\n[Kerko] is a web application component for the [Flask] framework that provides a\nuser-friendly search and browsing interface for sharing a bibliography managed\nwith the [Zotero] reference manager.\n\n\n## How it works\n\nKerko does not provide any tools for managing bibliographic records. Instead, a\nwell-established reference management software, Zotero, is used for that\npurpose. The [Zotero desktop application][Zotero_desktop] provides powerful\ntools to individuals or teams for managing bibliographic data, which it stores\nin the cloud on zotero.org. Kerko can be configured to automatically synchronize\nits search index from zotero.org on a regular basis, ensuring that visitors get\nan up-to-date bibliography even if it is changing frequently. When users\ninteract with the Kerko application component, Kerko gets all its data from its\nown search index; it is only at indexing time that Kerko contacts zotero.org.\n\nThe combination of Kerko and Zotero gives you the best of both worlds: a\nuser-friendly interface for end-users of the bibliography, and a powerful\nbibliographic reference management tool for working on the bibliography's\ncontent.\n\nKerko is implemented in [Python] as a Flask [blueprint][Flask_blueprint] and, as\nsuch, cannot do much unless it is incorporated into a Flask application. A\nsample application is available, [KerkoApp], which anyone with basic\nrequirements could deploy directly on a web server. It is expected, however,\nthat Kerko will usually be integrated into a larger application, either derived\nfrom KerkoApp or custom-built to specific needs. The Kerko-powered bibliography\nmight be just one section of a larger website.\n\n\n## Demo site\n\nA [demo site][KerkoApp_demo] is available for you to try. You may also view the\n[Zotero library][Zotero_demo] that contains the source data for the demo site.\n\n\n## Features\n\nThe following features are implemented in Kerko:\n\n* Faceted search interface: allows exploration of the bibliography both in\n  search mode and in browsing mode, potentially suiting different user needs,\n  behaviors and abilities. For example, users with a prior idea of the topic or\n  expected results are able to enter keywords or a more complex query in a\n  search field, while those who wish to become familiar with the content of the\n  bibliography or discover new topics may choose to navigate along the proposed\n  facets, to narrow or broaden their search. Since both modes are integrated\n  into a single interface, it is possible to combine them.\n* Keyword search features:\n  * Boolean operators:\n    * `AND`: matches items that contain all specified terms. This is the default\n      relation between terms when no operator is specified, e.g., `a b` is the\n      same as `a AND b`.\n    * `OR`: matches items that contain any of the specified terms, e.g., `a OR\n      b`.\n    * `NOT`: excludes items that match the term, e.g., `NOT a`.\n    * Boolean operators must be specified in uppercase and may be translated in\n      other languages.\n  * Logical grouping (with parentheses), e.g., `(a OR b) AND c`.\n  * Sequence of words (with double quotes), e.g., `\"a b c\"`. The default\n    difference between word positions is 1, meaning that an item will match if\n    it contains the words next to each other, but a different maximum distance\n    may be selected (with the tilde character), e.g. `\"web search\"~2` allows up\n    to 1 word between `web` and `search`, meaning it could match `web site\n    search` as well as `web search`.\n  * Term boosting (with the caret), e.g., `faceted^2 search browsing^0.5`\n    specifies that `faceted` is twice as important as `search` when computing\n    the relevance score of results, while `browsing` is half as important.\n    Boosting may be applied to a logical grouping, e.g., `(a b)^3 c`.\n  * Keyword search is case-insentitive, accents are folded, and punctuation is\n    ignored. To further improve recall (albeit at the cost of precision),\n    stemming is also performed on terms from most text fields, e.g., title,\n    abstract, notes. Stemming relieves the user from having to specify all\n    variants of a word when searching, e.g., terms such as `search`, `searches`,\n    and `searching` all return the same results. The [Snowball] algorithm is\n    used for that purpose.\n  * Field search: users may target all fields, author/contributor fields only,\n    or titles only. Applications may provide additional choices.\n* Faceted browsing: allows filtering by topic (Zotero tag), by resource type\n  (Zotero item type), by publication year. Moreover, an application may define\n  facets modeled on collections and subcollections; in such case, any collection\n  can be represented as a facet, and each subcollection as a value within that\n  facet. By taking advantage of Zotero's ability to assign any given item to\n  multiple collections, a faceted classification scheme can be modeled\n  (including hierarchies within facets).\n* Relevance scoring: provided by the [Whoosh] library and based on the [BM25F]\n  algorithm, which determines how important a term is to a document in the\n  context of the whole collection of documents, while taking into account its\n  relation to document structure (in this regard most fields are neutral, but\n  the score is boosted when a term appears in specific fields, e.g., DOI, ISBN,\n  ISSN, title, author/contributor). Any keyword search asks the question \"how\n  well does this document match this query clause?\", which requires calculating\n  a relevance score for each document. Filtering with facets, on the other hand,\n  has no effect on the score because it asks \"does this document match this\n  query clause?\", which leads to a yes or no answer.\n* Sort options: by relevance score (only applicable with keyword search), by\n  publication date, by author, by title.\n* Citation styles: any from the [Zotero Style Repository][Zotero_styles], or\n  custom stylesheet defined in the [Citation Style Language][CSL] (stylesheet\n  must be accessible by URL).\n* Language support: the default user interface is in English, but [some\n  translations][Kerko_translations] are provided. Additional translations may be\n  created using gettext-compatible tools; see the **Translating Kerko** section\n  below. Also to consider: [locales supported by Zotero][Zotero_locales] (which\n  provides the names of fields, item types and author types displayed by Kerko),\n  and languages supported by Whoosh (which provides the search capabilities):\n  ar, da, nl, en, fi, fr, de, hu, it, no, pt, ro, ru, es, sv, tr.\n* Responsive design: the simple default implementation works on large monitors\n  as well as on small screens. It is based on [Bootstrap].\n* Customizable front-end: applications may partly or fully replace the default\n  templates, scripts and stylesheets with their own.\n* Semantic markup: users may easily import citations into their own reference\n  manager software, either from search results pages or individual bibliographic\n  record pages, both of which embed bibliographic metadata (using the [OpenURL\n  COinS][COinS] model). Zotero Connector, for example, will automatically detect\n  the metadata present in the page, but similar behavior applies to [many other\n  reference management software][COinS_clients] as well.\n* Exporting: users may export individual citations as well as complete\n  bibliographies corresponding to search results. By default, download links are\n  provided for the RIS and BibTeX formats, but applications may be configured to\n  export [any format supported by the Zotero API][Zotero_export].\n* Printing: stylesheets are provided for printing individual bibliographic\n  records as well as lists of search results. When printing search results, all\n  results get printed (not just the current page of results).\n* Notes and attachments: notes and file attachments are synchronized from\n  zotero.org and made available to users of the bibliography. Regular\n  expressions may be used to include or exclude notes or attachments from the\n  bibliography based on their tags.\n* Modularity: although a [standalone application][KerkoApp] is available, Kerko\n  is designed not as a standalone application, but to be part of a larger Flask\n  application.\n\n\n## Requirements\n\nKerko requires Python 3.6 or later.\n\n\n### Dependencies\n\nThe following packages will be automatically installed when installing Kerko:\n\n* [Babel]: utilities for internationalization and localization.\n* [Bootstrap-Flask]: helper for integrating [Bootstrap].\n* [environs]: helper for separating configuration from code.\n* [Flask]: web application framework.\n* [Flask-BabelEx]: allows Kerko to provide its own translations, at the blueprint level.\n* [Flask-WTF]: simple integration of Flask and WTForms.\n* [Jinja2]: template engine.\n* [Pyzotero]: Python client for the Zotero API.\n* [Werkzeug]: WSGI web application library (also required by Flask).\n* [Whoosh]: pure Python full-text indexing and searching library.\n* [WTForms]: web forms validation and rendering library.\n\nThe following front-end resources are loaded from CDNs by Kerko's default\ntemplates (but could be completely removed or replaced by your application):\n\n* [Bootstrap]: front-end component library for web applications.\n* [FontAwesome]: beautiful open source icons.\n* [jQuery]: JavaScript library (required by Bootstrap).\n* [Popper.js]: JavaScript library for handling tooltips, popovers, etc. (used by Bootstrap).\n\n\n## Getting started\n\nThis section only applies if you intend to integrate Kerko into your own\napplication. If you are more interested into the standalone KerkoApp\napplication, please refer to its [installation instructions][KerkoApp].\n\nWe'll assume that you have some familiarity with Flask and suggest steps for\nbuilding a minimal app, let's call it `hello_kerko.py`, to get you started.\n\n1. The first step is to install Kerko. As with any Python library, it is highly\n   recommended to install Kerko within a [virtualenv].\n\n   Once the virtualenv is set and active, use the following command:\n\n   ```bash\n   pip install kerko\n   ```\n\n\n2. In `hello_kerko.py`, configure variables required by Kerko and create your\n   `app` object, as in the example below:\n\n   ```python\n   from flask import Flask\n   from kerko.composer import Composer\n\n   app = Flask(__name__)\n   app.config['SECRET_KEY'] = '_5#y2L\"F4Q8z\\n\\xec]/'  # Replace this value.\n   app.config['KERKO_ZOTERO_API_KEY'] = 'xxxxxxxxxxxxxxxxxxxxxxxx'  # Replace this value.\n   app.config['KERKO_ZOTERO_LIBRARY_ID'] = '9999999'  # Replace this value.\n   app.config['KERKO_ZOTERO_LIBRARY_TYPE'] = 'group'  # Replace this value if necessary.\n   app.config['KERKO_COMPOSER'] = Composer()\n   ```\n\n   * `SECRET_KEY`: This variable is required for generating secure tokens in web\n     forms. It should have a secure, random value and it really has to be\n     secret. It is usually set in an environment variable rather than in Python\n     code, to make sure it never ends up in a code repository. But here we're\n     taking the minimal route and thus are cutting some corners!\n   * `KERKO_ZOTERO_API_KEY`, `KERKO_ZOTERO_LIBRARY_ID` and\n     `KERKO_ZOTERO_LIBRARY_TYPE`: These variables are required for Kerko to be\n     able to access your Zotero library. See the **Configuration variables**\n     section for details on how to properly set these variables.\n   * `KERKO_COMPOSER`: This variable specifies key elements needed by Kerko,\n     e.g., fields for display and search, facets for filtering. These are\n     defined by instanciating the `Composer` class. Your application may\n     manipulate the resulting object at configuration time to add, remove or\n     alter fields, facets, sort options, search scopes, citation download\n     formats, or badges. See the **Kerko Recipes** section for some examples.\n\n\n3. Also configure the Flask-BabelEx and Bootstrap-Flask extensions:\n\n   ```python\n   from flask_babelex import Babel\n   from flask_bootstrap import Bootstrap\n\n   babel = Babel(app)\n   bootstrap = Bootstrap(app)\n   ```\n\n   See the respective docs of [Flask-BabelEx][Flask-BabelEx_documentation] and\n   [Bootstrap-Flask][Bootstrap-Flask_documentation] for more details.\n\n\n4. Instanciate the Kerko blueprint and register it in your app:\n\n   ```python\n   from kerko import blueprint as kerko_blueprint\n\n   app.register_blueprint(kerko_blueprint, url_prefix='/bibliography')\n   ```\n\n   The `url_prefix` argument defines the base path for every URL provided by\n   Kerko.\n\n\n5. In the same directory as `hello_kerko.py` with your virtualenv active, run\n   the following shell commands:\n\n   ```bash\n   export FLASK_APP=hello_kerko.py\n   flask kerko sync\n   ```\n\n   Kerko will retrieve your bibliographic data from zotero.org. If you have a\n   large bibliography or large attachments, this may take a while (and there is\n   no progress indicator). In production use, that command is usually added to\n   the crontab file for regular execution (with enough time between executions\n   for each to complete before the next one starts).\n\n   To list all commands provided by Kerko:\n\n   ```bash\n   flask kerko --help\n   ```\n\n6. Run your application:\n\n   ```bash\n   flask run\n   ```\n\n7. Open http://127.0.0.1:5000/bibliography/ in your browser and explore the\n   bibliography.\n\nYou have just built a really minimal application for Kerko. Check [KerkoApp] for\na slightly more complete example.\n\n\n## Configuration variables\n\nThe variables below are required and have no default values:\n\n* `KERKO_COMPOSER`: An instance of the `kerko.composer.Composer` class.\n* `KERKO_ZOTERO_API_KEY`: The API key associated to the library on zotero.org.\n  You have to [create that key](https://www.zotero.org/settings/keys/new).\n* `KERKO_ZOTERO_LIBRARY_ID`: Your personal _userID_ for API calls, as given\n  [on zotero.org](https://www.zotero.org/settings/keys) (you must be logged-in\n  on zotero.org).\n* `KERKO_ZOTERO_LIBRARY_TYPE`: The type of library on zotero.org (either\n  `'user'` for your main personal library, or `'group'` for a group library).\n\nAny of the following variables may be added to your configuration if you wish to\noverride their default value:\n\n* `KERKO_CSL_STYLE`: The citation style to use for formatted references. Can be\n  either the file name (without the `.csl` extension) of one of the styles in the\n  [Zotero Styles Repository][Zotero_styles] (e.g., `apa`) or the URL of a remote\n  CSL file. Defaults to `'apa'`.\n* `KERKO_DATA_DIR`: The directory where to store the search index and the file\n  attachments. Defaults to `data/kerko`. Subdirectories `index` and\n  `attachments` will be created if they don't already exist.\n* `KERKO_DOWNLOAD_CITATIONS_LINK`: Provide a citation download button on search\n  results pages. Defaults to `True`.\n* `KERKO_DOWNLOAD_CITATIONS_MAX_COUNT`: Limit over which the citation download\n  button should be hidden from search results pages. Defaults to `0` (i.e. no\n  limit).\n* `KERKO_FACET_COLLAPSING`: Allow collapsible facets. Defaults to `False`.\n* `KERKO_PAGE_LEN`: The number of search results per page. Defaults to `20`.\n* `KERKO_PAGER_LINKS`: Number of pages to show in the pager (not counting the\n  current page). Defaults to `8`.\n* `KERKO_PRINT_ITEM_LINK`: Provide a print button on item pages. Defaults to\n  `False`.\n* `KERKO_PRINT_CITATIONS_LINK`: Provide a print button on search results\n  pages. Defaults to `False`.\n* `KERKO_PRINT_CITATIONS_MAX_COUNT`: Limit over which the print button should\n  be hidden from search results pages. Defaults to `0` (i.e. no limit).\n* `KERKO_RESULTS_ABSTRACT`: Show abstracts in search result pages. Defaults to\n  `False`.\n* `KERKO_RESULTS_FIELDS`: List of item fields to retrieve for use in search\n  results pages (i.e. in the `KERKO_TEMPLATE_SEARCH` template). Values are keys\n  identifying fields or facets assigned to the `kerko.composer.Composer`\n  instance. Defaults to `['id', 'bib', 'coins']`. Note that `'data'` gets added\n  to the list if `KERKO_RESULTS_ABSTRACT` is `True`, as well as any field that\n  is required by badges.\n* `KERKO_TEMPLATE_SEARCH`: Name of the Jinja2 template to render for the search\n  page with list of results. Defaults to `kerko/search.html.jinja2`.\n* `KERKO_TEMPLATE_SEARCH_ITEM`: Name of the Jinja2 template to render for the\n  search page with a single bibliographic record. Defaults to\n  `kerko/search-item.html.jinja2`.\n* `KERKO_TEMPLATE_ITEM`: Name of the Jinja2 template to render for the\n  bibliographic record view. Defaults to `kerko/item.html.jinja2`.\n* `KERKO_TEMPLATE_LAYOUT`: Name of the Jinja2 template that is extended by the\n  search, search-item, and item templates. Defaults to `kerko/layout.html.jinja2`.\n* `KERKO_TEMPLATE_BASE`: Name of the Jinja2 template that is extended by the\n  layout template. Defaults to `kerko/base.html.jinja2`.\n* `KERKO_TITLE`: The title to display in web pages. Defaults to `'Kerko'`.\n* `KERKO_ZOTERO_BATCH_SIZE`: Number of items to request on each call to the\n  Zotero API. Defaults to `100` (which is the maximum currently allowed by the\n  API).\n* `KERKO_ZOTERO_MAX_ATTEMPTS`: Maximum number of tries after the Zotero API\n  has returned an error or not responded during indexing. Defaults to `10`.\n* `KERKO_ZOTERO_WAIT`: Time to wait (in seconds) between failed attempts to\n  call the Zotero API. Defaults to `120`.\n* Localization-related variables:\n  * `BABEL_DEFAULT_LOCALE`: The default language of the user interface. Defaults\n    to `'en'`. Your application may set this variable and/or implement a locale\n    selector function to override it (see the [Flask-BabelEx\n    documentation][Flask-BabelEx_documentation]).\n  * `KERKO_USE_TRANSLATIONS`: Use translations provided by the Kerko package.\n    Defaults to `True`. When this is set to `False`, translations may be\n    provided by the application's own translation catalog.\n  * `KERKO_WHOOSH_LANGUAGE`: The language of search requests. Defaults to\n    `'en'`. You may refer to Whoosh's source to get the list of supported\n    languages (`whoosh.lang.languages`) and the list of languages that support\n    stemming (`whoosh.lang.has_stemmer()`).\n  * `KERKO_ZOTERO_LOCALE`: The locale to use with Zotero API calls. This\n    dictates the locale of Zotero item types, field names, creator types and\n    citations. Defaults to `'en-US'`. Supported locales are listed at\n    https://api.zotero.org/schema, under \"locales\".\n* Development/test-related variables:\n  * `KERKO_ZOTERO_START`: Skip items, start at the specified position. Defaults\n    to `0`. Useful only for development/tests.\n  * `KERKO_ZOTERO_END`: Load items from Zotero until the specified position.\n    Defaults to `0` (no limit). Useful only for development/tests.\n\n\n## Kerko Recipes\n\nTODO\n\n\n## Known limitations\n\n* The system can probably handle relatively large bibliographies (it has been\n  tested so far with ~15k entries), but the number of distinct facet values has\n  more impact on response times. For the best response times, it is recommended\n  to limit the number of distinct facet values to a few hundreds.\n* Kerko can only manage a single bibliography per application.\n* Although Kerko might be integrated in a multilingual web application were the\n  visitor may select a language, Zotero does not provide a way to manage tags or\n  collections in multiple languages. Thus, there is no easy way for Kerko to\n  provide those names in the user's language.\n* Whoosh does not provide much out-of-the-box support for non-Western languages.\n  Therefore, search might not work very well with such languages.\n* No other referencement management tool than Zotero may serve as a back-end for\n  Kerko.\n\n\n## Design choices\n\n* Do not build a back-end. Let Zotero act as the \"content management\" system.\n* Allow Kerko to integrate into richer web applications.\n* Only implement in Kerko features that are related to the exploration of a\n  bibliography. Let other parts of the web application handle all other\n  features that might be needed.\n* Use a lightweight framework (Flask) to avoid carrying many features that are\n  not needed.\n* Use pure Python dependencies to keep installation and deployment simple. Hence\n  the use of Whoosh for search, for example, instead of Elasticsearch or Solr.\n* Use a classic architecture for the front-end. Keep it simple and avoid asset\n  management. Some will want to replace the front-end anyway.\n\n\n## Translating Kerko\n\nKerko can be translated using Babel's [setuptools\nintegration](http://babel.pocoo.org/en/latest/setup.html).\n\nThe following commands should be executed from the directory that contains\n`setup.py`, and the appropriate [virtualenv] must have been activated\nbeforehand.\n\nCreate or update the PO template (POT) file:\n\n```bash\npython setup.py extract_messages\n```\n\nCreate a new PO file (for a new locale) based on the POT file. Replace\n`YOUR_LOCALE` with the appropriate language code, e.g., `de`, `es`, `fr`:\n\n```bash\npython setup.py init_catalog --locale YOUR_LOCALE\n```\n\nUpdate an existing PO file based on the POT file:\n\n```bash\npython setup.py update_catalog --locale YOUR_LOCALE\n```\n\nCompile MO files:\n\n```bash\npython setup.py compile_catalog\n```\n\nYou are welcome to contribute your translation. See the **Submitting a\ntranslation** section.\n\n\n## Contributing\n\n### Reporting issues\n\nIssues may be submitted on [Kerko's issue tracker][Kerko_issues]. Please\nconsider the following guidelines:\n\n* Make sure that the same issue has not already been reported or fixed in the\n  repository.\n* Describe what you expected to happen.\n* If possible, include a minimal reproducible example to help others identify\n  the issue.\n* Describe what actually happened. Include the full traceback if there was an\n  exception.\n\n\n### Submitting code changes\n\nPull requests may be submitted against [Kerko's repository][Kerko]. Please\nconsider the following guidelines:\n\n* Use [Yapf](https://github.com/google/yapf) to autoformat your code (with\n  option `--style='{based_on_style: facebook, column_limit: 100}'`). Many\n  editors provide Yapf integration.\n* Include a string like \"Fixes #123\" in your commit message (where 123 is the\n  issue you fixed). See [Closing issues using\n  keywords](https://help.github.com/en/articles/closing-issues-using-keywords).\n* If a Jinja2 template represents a page fragment or a collection of macros,\n  prefix its file name with the underscore character.\n\n\n### Submitting a translation\n\nSome guidelines:\n\n* The PO file encoding must be UTF-8.\n* The header of the PO file must be filled out appropriately.\n* All messages of the PO file must be translated.\n\nPlease submit your translation as a pull request against [Kerko's\nrepository][Kerko], or by [e-mail][Kerko_email], with the PO file included as an\nattachment (**do not** copy the PO file's content into an e-mail's body, since\nthat could introduce formatting or encoding issues).\n\n\n### Supporting the project\n\nNurturing an open source project such as Kerko, following up on issues and\nhelping others in working with the system is a lot of work, but hiring the\noriginal developers of Kerko can do a lot in ensuring continued support and\ndevelopment of the project.\n\nIf you need professionnal support related to Kerko, have requirements not\ncurrently implemented in Kerko, want to make sure that some Kerko issue\nimportant to you gets resolved, or if you just like our work and would like to\nhire us for an unrelated project, please [e-mail us][Kerko_email].\n\n\n## Project background\n\nKerko was inspired by two prior projects:\n\n* [Bibliographie sur l’histoire de\n  Montréal](https://bibliomontreal.uqam.ca/bibliographie/), developed in 2014 by\n  David Lesieur and Patrick Fournier, of Whisky Echo Bravo, for the [Laboratoire\n  d'histoire et de patrimoine de Montréal](https://lhpm.uqam.ca/) (Université du\n  Québec à Montréal, Canada).\n* [Bibliography on English-speaking Quebec](http://quescren.concordia.ca/),\n  developed in 2017 by David Lesieur, for the [Quebec English-Speaking\n  Communities Research Network\n  (QUESCREN)](https://www.concordia.ca/artsci/scpa/quescren.html) (Concordia\n  University, Canada).\n\nLater on, it became clear that other organizations needed a similar solution.\nHowever, software from the prior projects had to be rewritten so it could more\neasily be configured for different bibliographies from organizations with\ndifferent needs. That led to Kerko, whose development was made possible through\nthe following project:\n\n* [Bibliographie francophone sur l'archivistique](https://bibliopiaf.ebsi.umontreal.ca/),\n  funded by the\n  [Association internationale des archives francophones (AIAF)](http://www.aiaf.org/)\n  and hosted by the\n  [École de bibliothéconomie et des sciences de l’information (EBSI)](https://ebsi.umontreal.ca/)\n  (Université de Montréal, Canada).\n\n\n### Etymology\n\nThe name _Zotero_ reportedly derives from the Albanian word _zotëroj_, which\nmeans \"to learn something extremely well, that is to master or acquire a skill\nin learning\" (Source: [Etymology of Zotero](http://ideophone.org/zotero-etymology/)).\n\nThe name _Kerko_ is a nod to Zotero as it takes a similar etymological route: it\nderives from the Albanian word _kërkoj_, which means \"to ask, to request, to\nseek, to look for, to demand, to search\" and seems fit to describe a search\ntool.\n\n\n## Powered by Kerko\n\nThe following online bibliographies are powered by Kerko:\n\n* [Bibliographie francophone sur l'archivistique](https://bibliopiaf.ebsi.umontreal.ca/)\n\nIf you wish to add your Kerko-powered online bibliography to this list, please\n[e-mail us][Kerko_email] or submit a pull request.\n\n\n[Babel]: https://pypi.org/project/Babel/\n[BM25F]: https://en.wikipedia.org/wiki/Okapi_BM25\n[Bootstrap]: https://getbootstrap.com/\n[Bootstrap-Flask]: https://pypi.org/project/Bootstrap-Flask/\n[Bootstrap-Flask_documentation]: https://bootstrap-flask.readthedocs.io/en/latest/basic.html\n[COinS]: https://en.wikipedia.org/wiki/COinS\n[COinS_clients]: https://en.wikipedia.org/wiki/COinS#Client_tools\n[CSL]: https://citationstyles.org/\n[environs]: https://pypi.org/project/environs/\n[Flask]: https://pypi.org/project/Flask/\n[Flask_blueprint]: https://flask.palletsprojects.com/en/1.1.x/blueprints/\n[Flask-BabelEx]: https://pypi.org/project/Flask-BabelEx/\n[Flask-BabelEx_documentation]: https://pythonhosted.org/Flask-BabelEx/\n[Flask-WTF]: https://pypi.org/project/Flask-WTF/\n[FontAwesome]: https://fontawesome.com/icons\n[Jinja2]: https://pypi.org/project/Jinja2/\n[jQuery]: https://jquery.com/\n[Kerko]: https://github.com/whiskyechobravo/kerko\n[Kerko_email]: mailto:kerko@whiskyechobravo.com\n[Kerko_issues]: https://github.com/whiskyechobravo/kerko/issues\n[Kerko_pypi]: https://pypi.org/project/Kerko/\n[Kerko_translations]: https://github.com/whiskyechobravo/kerko/tree/master/kerko/translations\n[KerkoApp]: https://github.com/whiskyechobravo/kerkoapp\n[KerkoApp_demo]: https://demo.kerko.whiskyechobravo.com\n[Popper.js]: https://popper.js.org/\n[Python]: https://www.python.org/\n[Pyzotero]: https://pypi.org/project/Pyzotero/\n[Snowball]: https://snowballstem.org/\n[virtualenv]: https://virtualenv.pypa.io/en/latest/\n[Werkzeug]: https://pypi.org/project/Werkzeug/\n[Whisky_Echo_Bravo]: https://whiskyechobravo.com\n[Whoosh]: https://pypi.org/project/Whoosh/\n[WTForms]: https://pypi.org/project/WTForms/\n[Zotero]: https://www.zotero.org/\n[Zotero_demo]: https://www.zotero.org/groups/2348869/kerko_demo/items\n[Zotero_desktop]: https://www.zotero.org/download/\n[Zotero_export]: https://www.zotero.org/support/dev/web_api/v3/basics#export_formats\n[Zotero_locales]: https://github.com/citation-style-language/locales\n[Zotero_styles]: https://www.zotero.org/styles/\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/whiskyechobravo/kerko", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "Kerko", "package_url": "https://pypi.org/project/Kerko/", "platform": "", "project_url": "https://pypi.org/project/Kerko/", "project_urls": {"Code": "https://github.com/whiskyechobravo/kerko", "Documentation": "https://github.com/whiskyechobravo/kerko", "Homepage": "https://github.com/whiskyechobravo/kerko", "Issue tracker": "https://github.com/whiskyechobravo/kerko/issues"}, "release_url": "https://pypi.org/project/Kerko/0.5/", "requires_dist": ["Babel (>=2.6.0)", "Bootstrap-Flask (>=1.0.10)", "environs (>=5.0.0)", "Flask (>=1.0.2)", "Flask-BabelEx (>=0.9.3)", "Flask-WTF (>=0.14.2)", "Jinja2 (>=2.10.1)", "Pyzotero (>=1.4.1)", "Werkzeug (>=0.15.3)", "Whoosh (>=2.7.4)", "wrapt (>=1.10.0)", "WTForms (>=2.2)"], "requires_python": ">=3.6", "summary": "A Flask blueprint that provides a faceted search interface for bibliographies based on Zotero.", "version": "0.5", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><a href=\"https://github.com/whiskyechobravo/kerko\" rel=\"nofollow\"><img alt=\"License\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/5d04fb04395f2c3712256ef428b058d173bfcf7a/68747470733a2f2f696d672e736869656c64732e696f2f707970692f6c2f6b65726b6f\"></a>\n<a href=\"https://pypi.org/project/Kerko/\" rel=\"nofollow\"><img alt=\"Version\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/9b510d656638e72b59336c535aa5ac90ffb17ac1/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f6b65726b6f3f636f6c6f723d696e666f726d6174696f6e616c\"></a></p>\n<h1>Kerko</h1>\n<p><a href=\"https://github.com/whiskyechobravo/kerko\" rel=\"nofollow\">Kerko</a> is a web application component for the <a href=\"https://pypi.org/project/Flask/\" rel=\"nofollow\">Flask</a> framework that provides a\nuser-friendly search and browsing interface for sharing a bibliography managed\nwith the <a href=\"https://www.zotero.org/\" rel=\"nofollow\">Zotero</a> reference manager.</p>\n<h2>How it works</h2>\n<p>Kerko does not provide any tools for managing bibliographic records. Instead, a\nwell-established reference management software, Zotero, is used for that\npurpose. The <a href=\"https://www.zotero.org/download/\" rel=\"nofollow\">Zotero desktop application</a> provides powerful\ntools to individuals or teams for managing bibliographic data, which it stores\nin the cloud on zotero.org. Kerko can be configured to automatically synchronize\nits search index from zotero.org on a regular basis, ensuring that visitors get\nan up-to-date bibliography even if it is changing frequently. When users\ninteract with the Kerko application component, Kerko gets all its data from its\nown search index; it is only at indexing time that Kerko contacts zotero.org.</p>\n<p>The combination of Kerko and Zotero gives you the best of both worlds: a\nuser-friendly interface for end-users of the bibliography, and a powerful\nbibliographic reference management tool for working on the bibliography's\ncontent.</p>\n<p>Kerko is implemented in <a href=\"https://www.python.org/\" rel=\"nofollow\">Python</a> as a Flask <a href=\"https://flask.palletsprojects.com/en/1.1.x/blueprints/\" rel=\"nofollow\">blueprint</a> and, as\nsuch, cannot do much unless it is incorporated into a Flask application. A\nsample application is available, <a href=\"https://github.com/whiskyechobravo/kerkoapp\" rel=\"nofollow\">KerkoApp</a>, which anyone with basic\nrequirements could deploy directly on a web server. It is expected, however,\nthat Kerko will usually be integrated into a larger application, either derived\nfrom KerkoApp or custom-built to specific needs. The Kerko-powered bibliography\nmight be just one section of a larger website.</p>\n<h2>Demo site</h2>\n<p>A <a href=\"https://demo.kerko.whiskyechobravo.com\" rel=\"nofollow\">demo site</a> is available for you to try. You may also view the\n<a href=\"https://www.zotero.org/groups/2348869/kerko_demo/items\" rel=\"nofollow\">Zotero library</a> that contains the source data for the demo site.</p>\n<h2>Features</h2>\n<p>The following features are implemented in Kerko:</p>\n<ul>\n<li>Faceted search interface: allows exploration of the bibliography both in\nsearch mode and in browsing mode, potentially suiting different user needs,\nbehaviors and abilities. For example, users with a prior idea of the topic or\nexpected results are able to enter keywords or a more complex query in a\nsearch field, while those who wish to become familiar with the content of the\nbibliography or discover new topics may choose to navigate along the proposed\nfacets, to narrow or broaden their search. Since both modes are integrated\ninto a single interface, it is possible to combine them.</li>\n<li>Keyword search features:\n<ul>\n<li>Boolean operators:\n<ul>\n<li><code>AND</code>: matches items that contain all specified terms. This is the default\nrelation between terms when no operator is specified, e.g., <code>a b</code> is the\nsame as <code>a AND b</code>.</li>\n<li><code>OR</code>: matches items that contain any of the specified terms, e.g., <code>a OR b</code>.</li>\n<li><code>NOT</code>: excludes items that match the term, e.g., <code>NOT a</code>.</li>\n<li>Boolean operators must be specified in uppercase and may be translated in\nother languages.</li>\n</ul>\n</li>\n<li>Logical grouping (with parentheses), e.g., <code>(a OR b) AND c</code>.</li>\n<li>Sequence of words (with double quotes), e.g., <code>\"a b c\"</code>. The default\ndifference between word positions is 1, meaning that an item will match if\nit contains the words next to each other, but a different maximum distance\nmay be selected (with the tilde character), e.g. <code>\"web search\"~2</code> allows up\nto 1 word between <code>web</code> and <code>search</code>, meaning it could match <code>web site search</code> as well as <code>web search</code>.</li>\n<li>Term boosting (with the caret), e.g., <code>faceted^2 search browsing^0.5</code>\nspecifies that <code>faceted</code> is twice as important as <code>search</code> when computing\nthe relevance score of results, while <code>browsing</code> is half as important.\nBoosting may be applied to a logical grouping, e.g., <code>(a b)^3 c</code>.</li>\n<li>Keyword search is case-insentitive, accents are folded, and punctuation is\nignored. To further improve recall (albeit at the cost of precision),\nstemming is also performed on terms from most text fields, e.g., title,\nabstract, notes. Stemming relieves the user from having to specify all\nvariants of a word when searching, e.g., terms such as <code>search</code>, <code>searches</code>,\nand <code>searching</code> all return the same results. The <a href=\"https://snowballstem.org/\" rel=\"nofollow\">Snowball</a> algorithm is\nused for that purpose.</li>\n<li>Field search: users may target all fields, author/contributor fields only,\nor titles only. Applications may provide additional choices.</li>\n</ul>\n</li>\n<li>Faceted browsing: allows filtering by topic (Zotero tag), by resource type\n(Zotero item type), by publication year. Moreover, an application may define\nfacets modeled on collections and subcollections; in such case, any collection\ncan be represented as a facet, and each subcollection as a value within that\nfacet. By taking advantage of Zotero's ability to assign any given item to\nmultiple collections, a faceted classification scheme can be modeled\n(including hierarchies within facets).</li>\n<li>Relevance scoring: provided by the <a href=\"https://pypi.org/project/Whoosh/\" rel=\"nofollow\">Whoosh</a> library and based on the <a href=\"https://en.wikipedia.org/wiki/Okapi_BM25\" rel=\"nofollow\">BM25F</a>\nalgorithm, which determines how important a term is to a document in the\ncontext of the whole collection of documents, while taking into account its\nrelation to document structure (in this regard most fields are neutral, but\nthe score is boosted when a term appears in specific fields, e.g., DOI, ISBN,\nISSN, title, author/contributor). Any keyword search asks the question \"how\nwell does this document match this query clause?\", which requires calculating\na relevance score for each document. Filtering with facets, on the other hand,\nhas no effect on the score because it asks \"does this document match this\nquery clause?\", which leads to a yes or no answer.</li>\n<li>Sort options: by relevance score (only applicable with keyword search), by\npublication date, by author, by title.</li>\n<li>Citation styles: any from the <a href=\"https://www.zotero.org/styles/\" rel=\"nofollow\">Zotero Style Repository</a>, or\ncustom stylesheet defined in the <a href=\"https://citationstyles.org/\" rel=\"nofollow\">Citation Style Language</a> (stylesheet\nmust be accessible by URL).</li>\n<li>Language support: the default user interface is in English, but <a href=\"https://github.com/whiskyechobravo/kerko/tree/master/kerko/translations\" rel=\"nofollow\">some\ntranslations</a> are provided. Additional translations may be\ncreated using gettext-compatible tools; see the <strong>Translating Kerko</strong> section\nbelow. Also to consider: <a href=\"https://github.com/citation-style-language/locales\" rel=\"nofollow\">locales supported by Zotero</a> (which\nprovides the names of fields, item types and author types displayed by Kerko),\nand languages supported by Whoosh (which provides the search capabilities):\nar, da, nl, en, fi, fr, de, hu, it, no, pt, ro, ru, es, sv, tr.</li>\n<li>Responsive design: the simple default implementation works on large monitors\nas well as on small screens. It is based on <a href=\"https://getbootstrap.com/\" rel=\"nofollow\">Bootstrap</a>.</li>\n<li>Customizable front-end: applications may partly or fully replace the default\ntemplates, scripts and stylesheets with their own.</li>\n<li>Semantic markup: users may easily import citations into their own reference\nmanager software, either from search results pages or individual bibliographic\nrecord pages, both of which embed bibliographic metadata (using the <a href=\"https://en.wikipedia.org/wiki/COinS\" rel=\"nofollow\">OpenURL\nCOinS</a> model). Zotero Connector, for example, will automatically detect\nthe metadata present in the page, but similar behavior applies to <a href=\"https://en.wikipedia.org/wiki/COinS#Client_tools\" rel=\"nofollow\">many other\nreference management software</a> as well.</li>\n<li>Exporting: users may export individual citations as well as complete\nbibliographies corresponding to search results. By default, download links are\nprovided for the RIS and BibTeX formats, but applications may be configured to\nexport <a href=\"https://www.zotero.org/support/dev/web_api/v3/basics#export_formats\" rel=\"nofollow\">any format supported by the Zotero API</a>.</li>\n<li>Printing: stylesheets are provided for printing individual bibliographic\nrecords as well as lists of search results. When printing search results, all\nresults get printed (not just the current page of results).</li>\n<li>Notes and attachments: notes and file attachments are synchronized from\nzotero.org and made available to users of the bibliography. Regular\nexpressions may be used to include or exclude notes or attachments from the\nbibliography based on their tags.</li>\n<li>Modularity: although a <a href=\"https://github.com/whiskyechobravo/kerkoapp\" rel=\"nofollow\">standalone application</a> is available, Kerko\nis designed not as a standalone application, but to be part of a larger Flask\napplication.</li>\n</ul>\n<h2>Requirements</h2>\n<p>Kerko requires Python 3.6 or later.</p>\n<h3>Dependencies</h3>\n<p>The following packages will be automatically installed when installing Kerko:</p>\n<ul>\n<li><a href=\"https://pypi.org/project/Babel/\" rel=\"nofollow\">Babel</a>: utilities for internationalization and localization.</li>\n<li><a href=\"https://pypi.org/project/Bootstrap-Flask/\" rel=\"nofollow\">Bootstrap-Flask</a>: helper for integrating <a href=\"https://getbootstrap.com/\" rel=\"nofollow\">Bootstrap</a>.</li>\n<li><a href=\"https://pypi.org/project/environs/\" rel=\"nofollow\">environs</a>: helper for separating configuration from code.</li>\n<li><a href=\"https://pypi.org/project/Flask/\" rel=\"nofollow\">Flask</a>: web application framework.</li>\n<li><a href=\"https://pypi.org/project/Flask-BabelEx/\" rel=\"nofollow\">Flask-BabelEx</a>: allows Kerko to provide its own translations, at the blueprint level.</li>\n<li><a href=\"https://pypi.org/project/Flask-WTF/\" rel=\"nofollow\">Flask-WTF</a>: simple integration of Flask and WTForms.</li>\n<li><a href=\"https://pypi.org/project/Jinja2/\" rel=\"nofollow\">Jinja2</a>: template engine.</li>\n<li><a href=\"https://pypi.org/project/Pyzotero/\" rel=\"nofollow\">Pyzotero</a>: Python client for the Zotero API.</li>\n<li><a href=\"https://pypi.org/project/Werkzeug/\" rel=\"nofollow\">Werkzeug</a>: WSGI web application library (also required by Flask).</li>\n<li><a href=\"https://pypi.org/project/Whoosh/\" rel=\"nofollow\">Whoosh</a>: pure Python full-text indexing and searching library.</li>\n<li><a href=\"https://pypi.org/project/WTForms/\" rel=\"nofollow\">WTForms</a>: web forms validation and rendering library.</li>\n</ul>\n<p>The following front-end resources are loaded from CDNs by Kerko's default\ntemplates (but could be completely removed or replaced by your application):</p>\n<ul>\n<li><a href=\"https://getbootstrap.com/\" rel=\"nofollow\">Bootstrap</a>: front-end component library for web applications.</li>\n<li><a href=\"https://fontawesome.com/icons\" rel=\"nofollow\">FontAwesome</a>: beautiful open source icons.</li>\n<li><a href=\"https://jquery.com/\" rel=\"nofollow\">jQuery</a>: JavaScript library (required by Bootstrap).</li>\n<li><a href=\"https://popper.js.org/\" rel=\"nofollow\">Popper.js</a>: JavaScript library for handling tooltips, popovers, etc. (used by Bootstrap).</li>\n</ul>\n<h2>Getting started</h2>\n<p>This section only applies if you intend to integrate Kerko into your own\napplication. If you are more interested into the standalone KerkoApp\napplication, please refer to its <a href=\"https://github.com/whiskyechobravo/kerkoapp\" rel=\"nofollow\">installation instructions</a>.</p>\n<p>We'll assume that you have some familiarity with Flask and suggest steps for\nbuilding a minimal app, let's call it <code>hello_kerko.py</code>, to get you started.</p>\n<ol>\n<li>\n<p>The first step is to install Kerko. As with any Python library, it is highly\nrecommended to install Kerko within a <a href=\"https://virtualenv.pypa.io/en/latest/\" rel=\"nofollow\">virtualenv</a>.</p>\n<p>Once the virtualenv is set and active, use the following command:</p>\n<pre>pip install kerko\n</pre>\n</li>\n<li>\n<p>In <code>hello_kerko.py</code>, configure variables required by Kerko and create your\n<code>app</code> object, as in the example below:</p>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">flask</span> <span class=\"kn\">import</span> <span class=\"n\">Flask</span>\n<span class=\"kn\">from</span> <span class=\"nn\">kerko.composer</span> <span class=\"kn\">import</span> <span class=\"n\">Composer</span>\n\n<span class=\"n\">app</span> <span class=\"o\">=</span> <span class=\"n\">Flask</span><span class=\"p\">(</span><span class=\"vm\">__name__</span><span class=\"p\">)</span>\n<span class=\"n\">app</span><span class=\"o\">.</span><span class=\"n\">config</span><span class=\"p\">[</span><span class=\"s1\">'SECRET_KEY'</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"s1\">'_5#y2L\"F4Q8z</span><span class=\"se\">\\n\\xec</span><span class=\"s1\">]/'</span>  <span class=\"c1\"># Replace this value.</span>\n<span class=\"n\">app</span><span class=\"o\">.</span><span class=\"n\">config</span><span class=\"p\">[</span><span class=\"s1\">'KERKO_ZOTERO_API_KEY'</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"s1\">'xxxxxxxxxxxxxxxxxxxxxxxx'</span>  <span class=\"c1\"># Replace this value.</span>\n<span class=\"n\">app</span><span class=\"o\">.</span><span class=\"n\">config</span><span class=\"p\">[</span><span class=\"s1\">'KERKO_ZOTERO_LIBRARY_ID'</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"s1\">'9999999'</span>  <span class=\"c1\"># Replace this value.</span>\n<span class=\"n\">app</span><span class=\"o\">.</span><span class=\"n\">config</span><span class=\"p\">[</span><span class=\"s1\">'KERKO_ZOTERO_LIBRARY_TYPE'</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"s1\">'group'</span>  <span class=\"c1\"># Replace this value if necessary.</span>\n<span class=\"n\">app</span><span class=\"o\">.</span><span class=\"n\">config</span><span class=\"p\">[</span><span class=\"s1\">'KERKO_COMPOSER'</span><span class=\"p\">]</span> <span class=\"o\">=</span> <span class=\"n\">Composer</span><span class=\"p\">()</span>\n</pre>\n<ul>\n<li><code>SECRET_KEY</code>: This variable is required for generating secure tokens in web\nforms. It should have a secure, random value and it really has to be\nsecret. It is usually set in an environment variable rather than in Python\ncode, to make sure it never ends up in a code repository. But here we're\ntaking the minimal route and thus are cutting some corners!</li>\n<li><code>KERKO_ZOTERO_API_KEY</code>, <code>KERKO_ZOTERO_LIBRARY_ID</code> and\n<code>KERKO_ZOTERO_LIBRARY_TYPE</code>: These variables are required for Kerko to be\nable to access your Zotero library. See the <strong>Configuration variables</strong>\nsection for details on how to properly set these variables.</li>\n<li><code>KERKO_COMPOSER</code>: This variable specifies key elements needed by Kerko,\ne.g., fields for display and search, facets for filtering. These are\ndefined by instanciating the <code>Composer</code> class. Your application may\nmanipulate the resulting object at configuration time to add, remove or\nalter fields, facets, sort options, search scopes, citation download\nformats, or badges. See the <strong>Kerko Recipes</strong> section for some examples.</li>\n</ul>\n</li>\n<li>\n<p>Also configure the Flask-BabelEx and Bootstrap-Flask extensions:</p>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">flask_babelex</span> <span class=\"kn\">import</span> <span class=\"n\">Babel</span>\n<span class=\"kn\">from</span> <span class=\"nn\">flask_bootstrap</span> <span class=\"kn\">import</span> <span class=\"n\">Bootstrap</span>\n\n<span class=\"n\">babel</span> <span class=\"o\">=</span> <span class=\"n\">Babel</span><span class=\"p\">(</span><span class=\"n\">app</span><span class=\"p\">)</span>\n<span class=\"n\">bootstrap</span> <span class=\"o\">=</span> <span class=\"n\">Bootstrap</span><span class=\"p\">(</span><span class=\"n\">app</span><span class=\"p\">)</span>\n</pre>\n<p>See the respective docs of <a href=\"https://pythonhosted.org/Flask-BabelEx/\" rel=\"nofollow\">Flask-BabelEx</a> and\n<a href=\"https://bootstrap-flask.readthedocs.io/en/latest/basic.html\" rel=\"nofollow\">Bootstrap-Flask</a> for more details.</p>\n</li>\n<li>\n<p>Instanciate the Kerko blueprint and register it in your app:</p>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">kerko</span> <span class=\"kn\">import</span> <span class=\"n\">blueprint</span> <span class=\"k\">as</span> <span class=\"n\">kerko_blueprint</span>\n\n<span class=\"n\">app</span><span class=\"o\">.</span><span class=\"n\">register_blueprint</span><span class=\"p\">(</span><span class=\"n\">kerko_blueprint</span><span class=\"p\">,</span> <span class=\"n\">url_prefix</span><span class=\"o\">=</span><span class=\"s1\">'/bibliography'</span><span class=\"p\">)</span>\n</pre>\n<p>The <code>url_prefix</code> argument defines the base path for every URL provided by\nKerko.</p>\n</li>\n<li>\n<p>In the same directory as <code>hello_kerko.py</code> with your virtualenv active, run\nthe following shell commands:</p>\n<pre><span class=\"nb\">export</span> <span class=\"nv\">FLASK_APP</span><span class=\"o\">=</span>hello_kerko.py\nflask kerko sync\n</pre>\n<p>Kerko will retrieve your bibliographic data from zotero.org. If you have a\nlarge bibliography or large attachments, this may take a while (and there is\nno progress indicator). In production use, that command is usually added to\nthe crontab file for regular execution (with enough time between executions\nfor each to complete before the next one starts).</p>\n<p>To list all commands provided by Kerko:</p>\n<pre>flask kerko --help\n</pre>\n</li>\n<li>\n<p>Run your application:</p>\n<pre>flask run\n</pre>\n</li>\n<li>\n<p>Open <a href=\"http://127.0.0.1:5000/bibliography/\" rel=\"nofollow\">http://127.0.0.1:5000/bibliography/</a> in your browser and explore the\nbibliography.</p>\n</li>\n</ol>\n<p>You have just built a really minimal application for Kerko. Check <a href=\"https://github.com/whiskyechobravo/kerkoapp\" rel=\"nofollow\">KerkoApp</a> for\na slightly more complete example.</p>\n<h2>Configuration variables</h2>\n<p>The variables below are required and have no default values:</p>\n<ul>\n<li><code>KERKO_COMPOSER</code>: An instance of the <code>kerko.composer.Composer</code> class.</li>\n<li><code>KERKO_ZOTERO_API_KEY</code>: The API key associated to the library on zotero.org.\nYou have to <a href=\"https://www.zotero.org/settings/keys/new\" rel=\"nofollow\">create that key</a>.</li>\n<li><code>KERKO_ZOTERO_LIBRARY_ID</code>: Your personal <em>userID</em> for API calls, as given\n<a href=\"https://www.zotero.org/settings/keys\" rel=\"nofollow\">on zotero.org</a> (you must be logged-in\non zotero.org).</li>\n<li><code>KERKO_ZOTERO_LIBRARY_TYPE</code>: The type of library on zotero.org (either\n<code>'user'</code> for your main personal library, or <code>'group'</code> for a group library).</li>\n</ul>\n<p>Any of the following variables may be added to your configuration if you wish to\noverride their default value:</p>\n<ul>\n<li><code>KERKO_CSL_STYLE</code>: The citation style to use for formatted references. Can be\neither the file name (without the <code>.csl</code> extension) of one of the styles in the\n<a href=\"https://www.zotero.org/styles/\" rel=\"nofollow\">Zotero Styles Repository</a> (e.g., <code>apa</code>) or the URL of a remote\nCSL file. Defaults to <code>'apa'</code>.</li>\n<li><code>KERKO_DATA_DIR</code>: The directory where to store the search index and the file\nattachments. Defaults to <code>data/kerko</code>. Subdirectories <code>index</code> and\n<code>attachments</code> will be created if they don't already exist.</li>\n<li><code>KERKO_DOWNLOAD_CITATIONS_LINK</code>: Provide a citation download button on search\nresults pages. Defaults to <code>True</code>.</li>\n<li><code>KERKO_DOWNLOAD_CITATIONS_MAX_COUNT</code>: Limit over which the citation download\nbutton should be hidden from search results pages. Defaults to <code>0</code> (i.e. no\nlimit).</li>\n<li><code>KERKO_FACET_COLLAPSING</code>: Allow collapsible facets. Defaults to <code>False</code>.</li>\n<li><code>KERKO_PAGE_LEN</code>: The number of search results per page. Defaults to <code>20</code>.</li>\n<li><code>KERKO_PAGER_LINKS</code>: Number of pages to show in the pager (not counting the\ncurrent page). Defaults to <code>8</code>.</li>\n<li><code>KERKO_PRINT_ITEM_LINK</code>: Provide a print button on item pages. Defaults to\n<code>False</code>.</li>\n<li><code>KERKO_PRINT_CITATIONS_LINK</code>: Provide a print button on search results\npages. Defaults to <code>False</code>.</li>\n<li><code>KERKO_PRINT_CITATIONS_MAX_COUNT</code>: Limit over which the print button should\nbe hidden from search results pages. Defaults to <code>0</code> (i.e. no limit).</li>\n<li><code>KERKO_RESULTS_ABSTRACT</code>: Show abstracts in search result pages. Defaults to\n<code>False</code>.</li>\n<li><code>KERKO_RESULTS_FIELDS</code>: List of item fields to retrieve for use in search\nresults pages (i.e. in the <code>KERKO_TEMPLATE_SEARCH</code> template). Values are keys\nidentifying fields or facets assigned to the <code>kerko.composer.Composer</code>\ninstance. Defaults to <code>['id', 'bib', 'coins']</code>. Note that <code>'data'</code> gets added\nto the list if <code>KERKO_RESULTS_ABSTRACT</code> is <code>True</code>, as well as any field that\nis required by badges.</li>\n<li><code>KERKO_TEMPLATE_SEARCH</code>: Name of the Jinja2 template to render for the search\npage with list of results. Defaults to <code>kerko/search.html.jinja2</code>.</li>\n<li><code>KERKO_TEMPLATE_SEARCH_ITEM</code>: Name of the Jinja2 template to render for the\nsearch page with a single bibliographic record. Defaults to\n<code>kerko/search-item.html.jinja2</code>.</li>\n<li><code>KERKO_TEMPLATE_ITEM</code>: Name of the Jinja2 template to render for the\nbibliographic record view. Defaults to <code>kerko/item.html.jinja2</code>.</li>\n<li><code>KERKO_TEMPLATE_LAYOUT</code>: Name of the Jinja2 template that is extended by the\nsearch, search-item, and item templates. Defaults to <code>kerko/layout.html.jinja2</code>.</li>\n<li><code>KERKO_TEMPLATE_BASE</code>: Name of the Jinja2 template that is extended by the\nlayout template. Defaults to <code>kerko/base.html.jinja2</code>.</li>\n<li><code>KERKO_TITLE</code>: The title to display in web pages. Defaults to <code>'Kerko'</code>.</li>\n<li><code>KERKO_ZOTERO_BATCH_SIZE</code>: Number of items to request on each call to the\nZotero API. Defaults to <code>100</code> (which is the maximum currently allowed by the\nAPI).</li>\n<li><code>KERKO_ZOTERO_MAX_ATTEMPTS</code>: Maximum number of tries after the Zotero API\nhas returned an error or not responded during indexing. Defaults to <code>10</code>.</li>\n<li><code>KERKO_ZOTERO_WAIT</code>: Time to wait (in seconds) between failed attempts to\ncall the Zotero API. Defaults to <code>120</code>.</li>\n<li>Localization-related variables:\n<ul>\n<li><code>BABEL_DEFAULT_LOCALE</code>: The default language of the user interface. Defaults\nto <code>'en'</code>. Your application may set this variable and/or implement a locale\nselector function to override it (see the <a href=\"https://pythonhosted.org/Flask-BabelEx/\" rel=\"nofollow\">Flask-BabelEx\ndocumentation</a>).</li>\n<li><code>KERKO_USE_TRANSLATIONS</code>: Use translations provided by the Kerko package.\nDefaults to <code>True</code>. When this is set to <code>False</code>, translations may be\nprovided by the application's own translation catalog.</li>\n<li><code>KERKO_WHOOSH_LANGUAGE</code>: The language of search requests. Defaults to\n<code>'en'</code>. You may refer to Whoosh's source to get the list of supported\nlanguages (<code>whoosh.lang.languages</code>) and the list of languages that support\nstemming (<code>whoosh.lang.has_stemmer()</code>).</li>\n<li><code>KERKO_ZOTERO_LOCALE</code>: The locale to use with Zotero API calls. This\ndictates the locale of Zotero item types, field names, creator types and\ncitations. Defaults to <code>'en-US'</code>. Supported locales are listed at\n<a href=\"https://api.zotero.org/schema\" rel=\"nofollow\">https://api.zotero.org/schema</a>, under \"locales\".</li>\n</ul>\n</li>\n<li>Development/test-related variables:\n<ul>\n<li><code>KERKO_ZOTERO_START</code>: Skip items, start at the specified position. Defaults\nto <code>0</code>. Useful only for development/tests.</li>\n<li><code>KERKO_ZOTERO_END</code>: Load items from Zotero until the specified position.\nDefaults to <code>0</code> (no limit). Useful only for development/tests.</li>\n</ul>\n</li>\n</ul>\n<h2>Kerko Recipes</h2>\n<p>TODO</p>\n<h2>Known limitations</h2>\n<ul>\n<li>The system can probably handle relatively large bibliographies (it has been\ntested so far with ~15k entries), but the number of distinct facet values has\nmore impact on response times. For the best response times, it is recommended\nto limit the number of distinct facet values to a few hundreds.</li>\n<li>Kerko can only manage a single bibliography per application.</li>\n<li>Although Kerko might be integrated in a multilingual web application were the\nvisitor may select a language, Zotero does not provide a way to manage tags or\ncollections in multiple languages. Thus, there is no easy way for Kerko to\nprovide those names in the user's language.</li>\n<li>Whoosh does not provide much out-of-the-box support for non-Western languages.\nTherefore, search might not work very well with such languages.</li>\n<li>No other referencement management tool than Zotero may serve as a back-end for\nKerko.</li>\n</ul>\n<h2>Design choices</h2>\n<ul>\n<li>Do not build a back-end. Let Zotero act as the \"content management\" system.</li>\n<li>Allow Kerko to integrate into richer web applications.</li>\n<li>Only implement in Kerko features that are related to the exploration of a\nbibliography. Let other parts of the web application handle all other\nfeatures that might be needed.</li>\n<li>Use a lightweight framework (Flask) to avoid carrying many features that are\nnot needed.</li>\n<li>Use pure Python dependencies to keep installation and deployment simple. Hence\nthe use of Whoosh for search, for example, instead of Elasticsearch or Solr.</li>\n<li>Use a classic architecture for the front-end. Keep it simple and avoid asset\nmanagement. Some will want to replace the front-end anyway.</li>\n</ul>\n<h2>Translating Kerko</h2>\n<p>Kerko can be translated using Babel's <a href=\"http://babel.pocoo.org/en/latest/setup.html\" rel=\"nofollow\">setuptools\nintegration</a>.</p>\n<p>The following commands should be executed from the directory that contains\n<code>setup.py</code>, and the appropriate <a href=\"https://virtualenv.pypa.io/en/latest/\" rel=\"nofollow\">virtualenv</a> must have been activated\nbeforehand.</p>\n<p>Create or update the PO template (POT) file:</p>\n<pre>python setup.py extract_messages\n</pre>\n<p>Create a new PO file (for a new locale) based on the POT file. Replace\n<code>YOUR_LOCALE</code> with the appropriate language code, e.g., <code>de</code>, <code>es</code>, <code>fr</code>:</p>\n<pre>python setup.py init_catalog --locale YOUR_LOCALE\n</pre>\n<p>Update an existing PO file based on the POT file:</p>\n<pre>python setup.py update_catalog --locale YOUR_LOCALE\n</pre>\n<p>Compile MO files:</p>\n<pre>python setup.py compile_catalog\n</pre>\n<p>You are welcome to contribute your translation. See the <strong>Submitting a\ntranslation</strong> section.</p>\n<h2>Contributing</h2>\n<h3>Reporting issues</h3>\n<p>Issues may be submitted on <a href=\"https://github.com/whiskyechobravo/kerko/issues\" rel=\"nofollow\">Kerko's issue tracker</a>. Please\nconsider the following guidelines:</p>\n<ul>\n<li>Make sure that the same issue has not already been reported or fixed in the\nrepository.</li>\n<li>Describe what you expected to happen.</li>\n<li>If possible, include a minimal reproducible example to help others identify\nthe issue.</li>\n<li>Describe what actually happened. Include the full traceback if there was an\nexception.</li>\n</ul>\n<h3>Submitting code changes</h3>\n<p>Pull requests may be submitted against <a href=\"https://github.com/whiskyechobravo/kerko\" rel=\"nofollow\">Kerko's repository</a>. Please\nconsider the following guidelines:</p>\n<ul>\n<li>Use <a href=\"https://github.com/google/yapf\" rel=\"nofollow\">Yapf</a> to autoformat your code (with\noption <code>--style='{based_on_style: facebook, column_limit: 100}'</code>). Many\neditors provide Yapf integration.</li>\n<li>Include a string like \"Fixes #123\" in your commit message (where 123 is the\nissue you fixed). See <a href=\"https://help.github.com/en/articles/closing-issues-using-keywords\" rel=\"nofollow\">Closing issues using\nkeywords</a>.</li>\n<li>If a Jinja2 template represents a page fragment or a collection of macros,\nprefix its file name with the underscore character.</li>\n</ul>\n<h3>Submitting a translation</h3>\n<p>Some guidelines:</p>\n<ul>\n<li>The PO file encoding must be UTF-8.</li>\n<li>The header of the PO file must be filled out appropriately.</li>\n<li>All messages of the PO file must be translated.</li>\n</ul>\n<p>Please submit your translation as a pull request against <a href=\"https://github.com/whiskyechobravo/kerko\" rel=\"nofollow\">Kerko's\nrepository</a>, or by <a href=\"mailto:kerko@whiskyechobravo.com\">e-mail</a>, with the PO file included as an\nattachment (<strong>do not</strong> copy the PO file's content into an e-mail's body, since\nthat could introduce formatting or encoding issues).</p>\n<h3>Supporting the project</h3>\n<p>Nurturing an open source project such as Kerko, following up on issues and\nhelping others in working with the system is a lot of work, but hiring the\noriginal developers of Kerko can do a lot in ensuring continued support and\ndevelopment of the project.</p>\n<p>If you need professionnal support related to Kerko, have requirements not\ncurrently implemented in Kerko, want to make sure that some Kerko issue\nimportant to you gets resolved, or if you just like our work and would like to\nhire us for an unrelated project, please <a href=\"mailto:kerko@whiskyechobravo.com\">e-mail us</a>.</p>\n<h2>Project background</h2>\n<p>Kerko was inspired by two prior projects:</p>\n<ul>\n<li><a href=\"https://bibliomontreal.uqam.ca/bibliographie/\" rel=\"nofollow\">Bibliographie sur l’histoire de\nMontréal</a>, developed in 2014 by\nDavid Lesieur and Patrick Fournier, of Whisky Echo Bravo, for the <a href=\"https://lhpm.uqam.ca/\" rel=\"nofollow\">Laboratoire\nd'histoire et de patrimoine de Montréal</a> (Université du\nQuébec à Montréal, Canada).</li>\n<li><a href=\"http://quescren.concordia.ca/\" rel=\"nofollow\">Bibliography on English-speaking Quebec</a>,\ndeveloped in 2017 by David Lesieur, for the <a href=\"https://www.concordia.ca/artsci/scpa/quescren.html\" rel=\"nofollow\">Quebec English-Speaking\nCommunities Research Network\n(QUESCREN)</a> (Concordia\nUniversity, Canada).</li>\n</ul>\n<p>Later on, it became clear that other organizations needed a similar solution.\nHowever, software from the prior projects had to be rewritten so it could more\neasily be configured for different bibliographies from organizations with\ndifferent needs. That led to Kerko, whose development was made possible through\nthe following project:</p>\n<ul>\n<li><a href=\"https://bibliopiaf.ebsi.umontreal.ca/\" rel=\"nofollow\">Bibliographie francophone sur l'archivistique</a>,\nfunded by the\n<a href=\"http://www.aiaf.org/\" rel=\"nofollow\">Association internationale des archives francophones (AIAF)</a>\nand hosted by the\n<a href=\"https://ebsi.umontreal.ca/\" rel=\"nofollow\">École de bibliothéconomie et des sciences de l’information (EBSI)</a>\n(Université de Montréal, Canada).</li>\n</ul>\n<h3>Etymology</h3>\n<p>The name <em>Zotero</em> reportedly derives from the Albanian word <em>zotëroj</em>, which\nmeans \"to learn something extremely well, that is to master or acquire a skill\nin learning\" (Source: <a href=\"http://ideophone.org/zotero-etymology/\" rel=\"nofollow\">Etymology of Zotero</a>).</p>\n<p>The name <em>Kerko</em> is a nod to Zotero as it takes a similar etymological route: it\nderives from the Albanian word <em>kërkoj</em>, which means \"to ask, to request, to\nseek, to look for, to demand, to search\" and seems fit to describe a search\ntool.</p>\n<h2>Powered by Kerko</h2>\n<p>The following online bibliographies are powered by Kerko:</p>\n<ul>\n<li><a href=\"https://bibliopiaf.ebsi.umontreal.ca/\" rel=\"nofollow\">Bibliographie francophone sur l'archivistique</a></li>\n</ul>\n<p>If you wish to add your Kerko-powered online bibliography to this list, please\n<a href=\"mailto:kerko@whiskyechobravo.com\">e-mail us</a> or submit a pull request.</p>\n\n          </div>"}, "last_serial": 6162691, "releases": {"0.3": [{"comment_text": "", "digests": {"md5": "baae3624f5349f636cdc99e7db0d3a1a", "sha256": "7fa9c45d894c597aa347fd27dd515c22a64472ad693d884582999b7ab1922557"}, "downloads": -1, "filename": "Kerko-0.3-py3-none-any.whl", "has_sig": false, "md5_digest": "baae3624f5349f636cdc99e7db0d3a1a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 74895, "upload_time": "2019-07-29T22:10:32", "upload_time_iso_8601": "2019-07-29T22:10:32.810782Z", "url": "https://files.pythonhosted.org/packages/55/83/c9007c3d1bd0ee878c98dfa1964ada08ff4c73dab14b5c999c24d9f859b0/Kerko-0.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "dfa99dce2c917efc564aeccdb9c57fea", "sha256": "f191d0f55cd903122ba2c56dd34f37fa63110aba803760dba83ad82cc240a603"}, "downloads": -1, "filename": "Kerko-0.3.tar.gz", "has_sig": false, "md5_digest": "dfa99dce2c917efc564aeccdb9c57fea", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 72691, "upload_time": "2019-07-29T22:10:34", "upload_time_iso_8601": "2019-07-29T22:10:34.702299Z", "url": "https://files.pythonhosted.org/packages/52/2b/9c328cf83e25e535f27c9d5fa5e6b489c323c202ff8f27ffc550e4e4b8a2/Kerko-0.3.tar.gz", "yanked": false}], "0.3a0": [{"comment_text": "", "digests": {"md5": "f56681ca6707980585d0d1642c25c610", "sha256": "520c4ec55433ed248abbf2ca38fffb14f1e3f4024267a1e01beae80a85f5cf2a"}, "downloads": -1, "filename": "Kerko-0.3a0-py3-none-any.whl", "has_sig": false, "md5_digest": "f56681ca6707980585d0d1642c25c610", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 69266, "upload_time": "2019-07-16T22:40:49", "upload_time_iso_8601": "2019-07-16T22:40:49.396068Z", "url": "https://files.pythonhosted.org/packages/c7/9a/f9a892c0a9905fea652ce22ef81bc5919a6ebc9c7ec7d43a48a3537b64df/Kerko-0.3a0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1f7e215f7e8364e3e9f7ae80e9f0141b", "sha256": "9ae0cf48a684d353bb8c2e531bf792ebba49e76b9e1f9c8dc29f63f39f432d51"}, "downloads": -1, "filename": "Kerko-0.3a0.tar.gz", "has_sig": false, "md5_digest": "1f7e215f7e8364e3e9f7ae80e9f0141b", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 62781, "upload_time": "2019-07-16T22:40:52", "upload_time_iso_8601": "2019-07-16T22:40:52.297327Z", "url": "https://files.pythonhosted.org/packages/58/e5/b6a009335823a52071679fd9b0e28e8db2d8a9a6af17b70c5794889d62c3/Kerko-0.3a0.tar.gz", "yanked": false}], "0.3a1": [{"comment_text": "", "digests": {"md5": "364523d81670c2192d841a0704772bcc", "sha256": "678605c2a9f361a5c63dcdf2ed9fc31e1d1f1c4c42038d176156405beda88f27"}, "downloads": -1, "filename": "Kerko-0.3a1-py3-none-any.whl", "has_sig": false, "md5_digest": "364523d81670c2192d841a0704772bcc", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 69549, "upload_time": "2019-07-17T19:58:13", "upload_time_iso_8601": "2019-07-17T19:58:13.341944Z", "url": "https://files.pythonhosted.org/packages/05/85/3856d1dc608270414b494f513e04771acdc717f0dadcf49d400745d4e166/Kerko-0.3a1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a3131cfd75859aa3fd96038ebb903690", "sha256": "56067dec9d4f9dca9ed9a3c29b0c09f5f57da79ea81b9d5df34165bcaa895f28"}, "downloads": -1, "filename": "Kerko-0.3a1.tar.gz", "has_sig": false, "md5_digest": "a3131cfd75859aa3fd96038ebb903690", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 63107, "upload_time": "2019-07-17T19:58:14", "upload_time_iso_8601": "2019-07-17T19:58:14.983969Z", "url": "https://files.pythonhosted.org/packages/6c/63/25f306599bc950badc82775c84ab725820c5d7b5c529cfa66f561c7e2fe0/Kerko-0.3a1.tar.gz", "yanked": false}], "0.4": [{"comment_text": "", "digests": {"md5": "64cddc474675c1a52c4805caf35a4abc", "sha256": "59e24cd444b050c49c6826f0762b83fc430dd7c8fcc3929f8c1c90d0020978f2"}, "downloads": -1, "filename": "Kerko-0.4-py3-none-any.whl", "has_sig": false, "md5_digest": "64cddc474675c1a52c4805caf35a4abc", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 76014, "upload_time": "2019-09-28T19:54:00", "upload_time_iso_8601": "2019-09-28T19:54:00.393759Z", "url": "https://files.pythonhosted.org/packages/1b/39/eef237ecc8315cfe00395b851433dee58d01b5b4cf1c1d2d4928ebcd2caf/Kerko-0.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "301b717f314dadbb8f38380f6a9189ab", "sha256": "cad16fccfc20e87394a45f33f2c689939d99f139baf9c3672bc2775eb8ba3314"}, "downloads": -1, "filename": "Kerko-0.4.tar.gz", "has_sig": false, "md5_digest": "301b717f314dadbb8f38380f6a9189ab", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 78412, "upload_time": "2019-09-28T19:54:02", "upload_time_iso_8601": "2019-09-28T19:54:02.432962Z", "url": "https://files.pythonhosted.org/packages/99/0b/9512c36696f9509638b0106a828e0736cd75c06cdf0f2d89d717b6381ee1/Kerko-0.4.tar.gz", "yanked": false}], "0.5": [{"comment_text": "", "digests": {"md5": "02d7aeeef6b1e0a7439e51334d9faba9", "sha256": "b6296fee7c41d39594a2399ac520286de673e47ea7b50674b368890fa56a4b96"}, "downloads": -1, "filename": "Kerko-0.5-py3-none-any.whl", "has_sig": false, "md5_digest": "02d7aeeef6b1e0a7439e51334d9faba9", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 96616, "upload_time": "2019-11-19T15:54:20", "upload_time_iso_8601": "2019-11-19T15:54:20.697333Z", "url": "https://files.pythonhosted.org/packages/bb/80/5eb403ecd308066d98277d6b5dabea7ec9fa62cfb10c0b002d588008f320/Kerko-0.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "c03be111b093c2f9fbc2b728d7f85f6a", "sha256": "0175bd6657bc44766721461cd6f62aab441b5638d41fd77b58585817bb4c267e"}, "downloads": -1, "filename": "Kerko-0.5.tar.gz", "has_sig": false, "md5_digest": "c03be111b093c2f9fbc2b728d7f85f6a", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 98564, "upload_time": "2019-11-19T15:54:22", "upload_time_iso_8601": "2019-11-19T15:54:22.592922Z", "url": "https://files.pythonhosted.org/packages/fa/b7/d230f4e5a8ae00bdc151276380f8ac21ec9abd0a1111fedbb8b25fdb5e31/Kerko-0.5.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "02d7aeeef6b1e0a7439e51334d9faba9", "sha256": "b6296fee7c41d39594a2399ac520286de673e47ea7b50674b368890fa56a4b96"}, "downloads": -1, "filename": "Kerko-0.5-py3-none-any.whl", "has_sig": false, "md5_digest": "02d7aeeef6b1e0a7439e51334d9faba9", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 96616, "upload_time": "2019-11-19T15:54:20", "upload_time_iso_8601": "2019-11-19T15:54:20.697333Z", "url": "https://files.pythonhosted.org/packages/bb/80/5eb403ecd308066d98277d6b5dabea7ec9fa62cfb10c0b002d588008f320/Kerko-0.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "c03be111b093c2f9fbc2b728d7f85f6a", "sha256": "0175bd6657bc44766721461cd6f62aab441b5638d41fd77b58585817bb4c267e"}, "downloads": -1, "filename": "Kerko-0.5.tar.gz", "has_sig": false, "md5_digest": "c03be111b093c2f9fbc2b728d7f85f6a", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 98564, "upload_time": "2019-11-19T15:54:22", "upload_time_iso_8601": "2019-11-19T15:54:22.592922Z", "url": "https://files.pythonhosted.org/packages/fa/b7/d230f4e5a8ae00bdc151276380f8ac21ec9abd0a1111fedbb8b25fdb5e31/Kerko-0.5.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:50:06 2020"}