{"info": {"author": "Miguel Simoes", "author_email": "miguelrsimoes@yahoo.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Environment :: Console", "License :: OSI Approved :: GNU General Public License v3 (GPLv3)", "Operating System :: POSIX :: Linux", "Programming Language :: Python :: 3.6", "Topic :: System :: Archiving :: Backup", "Topic :: Utilities"], "description": "# Overview\n\n_lnsync_ provides unidirectional sync-by-rename of locally mounted directories, with support for hard links, without copying or deleting file data. To compare files, files hashes are computed and stored in a local database. Using these file hashes, _lnsync_ also provides other functions, such as finding duplicate files.\n\nThis tool allows arbitrary file renaming and moving in the source file tree to be quickly replicated in the target without copying any file data. It may used as a preprocessing step for other sync tools, such as _rsync_.\n\n## Hard Link Support\n\nOn many file systems (e.g. ext3/4, NTFS, btrfs), a file may be reached via multiple file paths, which function as aliases. A new path created for an existing file is a _hard link_, but all such aliases are on an equal footing, so each may be called a hard link. Removing the last hardlink to a file means deleting that file.\n\nIf both hard links are created or removed in the source (without deleting files), and the target supports hard linking, then _lnsync_ can create and removing hardlinks as required on the target when syncing. As before, this is done without copying or deleting file data.\n\n##  Syncing\n\nWhen you rename/move in the source file tree, _lnsync_  makes a best-effort to sync the target by only renaming files and generally creating/removing hard links on the target, without deleting or copying any file data. Empty directories on the target which do not exist on the source are also removed.\n\nFile content is compared using xxHash (a fast, non-cryptographic hash function). Hash values are stored in a single-file database at the top-level directory of each file tree. The hash value database is a single file at the top directory of processed trees, with basename matching `lnsync-[0-9]+.db`. (Only one such file should exist there.) These files are ignored by all _lnsync_ operations, and care should be taken not to sync them with other tools.\n\nFile modification times are used to detect stale hash values and are not synced. File ownership and permissions are ignored: files which cannot be read are skipped.\n\n## File Searching\n\nUsing file content hashes, _lnsync_ can also find duplicate files (like _fdupes_), and more generally find files according to the which file trees they appear on, compare file trees, and check for changes/bitrot.\n\n## Offline File Trees\n\n_lnsync_ can save the structure of a file tree under a local directory and save it in a single-file database. These offline file trees can be used in most _lnsync_ commands in place of an local directory, even as the source in a sync command.\n\n# Alternative Sync Solutions for Linux\n\nSome of the many tools for syncing with rename detection:\n\n- There are patches for _rsync_ (see --detect-renamed) that provide renaming on the target, relying on file size and modification time, for matching files in nearby directories. _rsync_ can preserve hard links and sync with remote rsync instances.\n\n- [rclone](https://rclone.org/) provides sync-by-rename for local as well as an amazing array of remote clients. It allows caching file hashes, after some configuration. However, it does not preserve hard links.\n\n- [unison](https://www.cis.upenn.edu/~bcpierce/unison/) and [bsync](https://github.com/dooblem/bsync) provide network syncing with rename detection, but do not preserve hard links.\n\n- _git_ itself identifies and stores files by content, and has been adapted for syncing.\n\n- Support in modern file systems (e.g. btrfs) for snapshots may be adapted for syncing.\n\nIn addition to syncing, _lnsync_ allows using the file hash database to search for files according to a variety of criteria.\n\n# Installation and Quickstart\n\n## Installing\n\nInstall the latest version from the PyPI repository with `pip install -U lnsync`.\n\nOr clone the repo with `git clone https://github.com/mrsimoes/lnsync.git` and run `python setup.py install`.\n\n## Examples\n\nIf you have your photo archive at `/home/you/Photos` and your backup is at `/mnt/disk/Photos`, run `lnsync sync -n /home/you/Photos /mnt/disk/Photos` for a dry-run, to see which sync operations would be performed. To sync, ommit the `-n` switch.\n\nYou will notice that two database files are created, one at the source and another at the backup directory. File hashes are cmoputed as needed and then stored in these files. The database filenames includes a random suffix to avoid accidental overwriting when syncing with a tool other than _lsync_.\n\nTo quickly obtain an _rsync_ command that will complete syncing, skipping `lnsync` database files, run `lnsync rsync /home/you/Photos /mnt/disk/Photos`. To also run this command, use the `-x` switch. Make sure the `rsync` options provided by this command are suitable for you.\n\nFinally, to check the target is in-sync by recursively comparing it to source, run `lnsync cmp /home/you/Photos /mnt/disk/Photos`.\n\nTo find duplicate files on the Photos directory, run `lnsync fdupes /home/you/Photos`. Use `-z` to compare by size only. Use `-H` to count different hardlinks to the same file as distinct files. If this option is not given, for each multiple-linked with other duplicates, a path is arbitrarily picked and printed.\n\nTo find all files in Photos which are not in the backup (under any name): `lnsync onfirstonly /home/you/Photos /mnt/disk/Photos`. \n\nTo sync the subdir `/home/you/Photos/Best` to your digital picture frame, using the database hashes at `/home/you/Photos`: `lnsync sync /home/you/Photos/Best --root=/home/you/Photos /mnt/eframe/`.\n\n# Command Reference\nAll _lnsync_ commands are `lnsync [<global-options>] <command> [<cmd-options>] [<cmd-parameters>]`.\n\n## Syncing\n- `lnsync sync [options] <source> <target>` syncs a target dir from a source dir (or offline tree).\n\n - First, target files are matched to source files. Each matched target file is associated to a single source file. If either file system supports hardlinks, a file may have multiple pathnames. _lnsync_ will not complain if the match is not unique or some files are not matched on either source and/or target.\n\n - For each matched target file, its pathnames are made to match those of the corresponding source file, by renaming, deleting, or creating hardlinks. New intermediate subdirectories are created as needed on the target and directories which become empty on the target are removed.\n\n - `-z` Match files by size only. In this case, hash databases are not created or updated.\n\n - `-M=<size>` Excludes all files larger than <size>, which may be given in human form, e.g. `10k`, `2.1M`, `3G`.\n\n - `-n` Dry-run, just show which operations would be performed.\n\n - `--exclude=<glob_pattern>` Exclude source files and directories by glob pattern. Patterns are interpreted similarly to `rsync --exclude=<glob_pattern> source/ target`, but with `*` matching across slashes and no `**` pattern. This option may be repeated, with each `--exclude` option affecting all file trees. An initial slash anchors the pattern to the file tree root. A trailing slash means the pattern applies only to directories. There is a corresponding `--include`. Some commands accept `--exclude-once=<pattern>` and `--include-once=<pattern>`, which apply only to the next file tree following the switch and gain precedence over global patterns.\n\nTo sum up, a file or directory is excluded if it matches an `exclude` pattern before matching any `include` pattern.\n\n- `lnsync rsync [options] <tree> <dir> [rsync-options]` Prints an _rsync_ command that would sync target dir from source, skipping _lnsync_ database files. Source may be a dir or an offline tree. Check the default _rsync_ options provided are what you want. To also run the _rsync_ command, use the `-x` switch.\n\n## Creating, Updating, and Accessing the Hash Database\n- `lnsync update <dir>` Update the hash database, creating a new database if none exists, and rehashing all new files and those with a changed modification time (mtime). Accepts `--exclude=<pattern>` options.\n- `lnsync update <dir>` Update the hash database, creating a new database if none exists, and rehashing all new files and those with a changed modification time (mtime). Accepts `--exclude=<pattern>` options.\n- `lnsync rehash <dir> [<relpath>]+` Force rehashing files specified by paths relative to the root `dir`.\n- `lnsync subdir <dir> <relsubdir>` Update the database at `relsubdir` using any hash value already present in the hash database for `dir`.\n- `lnsync mkoffline <dir> <outputfile>` Update database at `dir` and create corresponding offline database at `outputfile`.\n- `lnsync cleandb <dir>` Remove outdated entries and re-compact the database.\n- `lnsync lookup <tree> [<relpath>+]` Returns (either from db or by recomputing) the hash value for the files, where `tree` may be a a directory or an offline tree.\n\n## Finding Files\n\n- `lnsync cmp <tree1> <tree2>` Recursively compares two file trees. Compares files at each path, does not compare the hard link structure. Accepts `--exclude=<pattern>` options.\n- `lnsync fdupes [-h] [<tree>]+` Find files duplicated anywhere on the given trees.\n- `lnsync onall [<tree>]+`, `lnsync onfirstonly [<tree>]+`, `lnsync onlastonly [<tree>]+` Find files as advertised. Some options: `-M` prunes by maximum size; `-0` prunes empty files; `-1` prints each group of files in a single line, separated by spaces and with escaped backslashes and spaces, like `fdupes`; `-s` sorts output by size. Use `-H` to consider multiple links to the same file as distinct files; if this option is not used, print a single, arbitrarily picked path for each multiple-linked file found to satisfy the condition of the command.\n\n- `lnsync check [<tree>] [<path>]*` Recompute hashes for given files and compare to the hash stored in the database, to check for changes/bitrot.\n\n## Configuration files\n\nAn INI-style configuration file is searched at `./lnsync.cfg` and `~/.lnsync.cfg`, in that order. In its `DEFAULT` section, default values may be set there for command-line options `sort`, `hardlinks`, `sameline`, `dbprefix`, `bysize`, `maxsize`, `skipempty`, `dry_run`. Each section whose name matches a directory (resp. file) may contain `exclude` and `include` options whose values are space-separated patterns applied to taht online (resp. offline) file tree, after command-line exclude/include patterns. The `DEFAULT` section may also contain similar `exclude` and `include` options, applying to all trees after all other exclude/include patterns.\n\n# Origin, Status, and Future Development\n\nThis package started as a Python learning project. I've found it useful enough to polish for publication, but as with any work in progress, it should be used with adequate caution.\n\nFeedback, suggestions, comments, and corrections are very welcome.\n\nYou can support this project with bitcoin at [17HS828pkQMiXZGy7UNbA49TYCz7LAQ2ze](bitcoin:17HS828pkQMiXZGy7UNbA49TYCz7LAQ2ze?amount=.001).\n\nThis program comes with ABSOLUTELY NO WARRANTY. This is free software, and you are welcome to redistribute it under certain conditions. See the GNU General Public Licence v3 for details.\n\n\n## Caveats and Limitations\n- Works only on locally mounted directories, no support whatsoever for remote servers.\n- Depends on mtime to detect file content changes.\n- If source files A, B, C (with pairwise distinct contents) are renamed on target in a cycle to C, A, B, sync is currently not supported.\n- Only readable files and readable+accessible directories are read. Other files and dirs, as well as symlinks, pipes, special devices are ignored.\n- Minimal support for case-insensitive but case-preserving file systems like vfat: if a target file name differs from source match in case only, target is not updated.\n- Supports Linux only.\n\n## Possible Improvements\n- Make `--include` and `--exclude` patterns more compatible with `rsync`.\n- Extend `cmp` to take hard links into account.\n- Filenames are NOT converted to Unicode. To allow using offline database across systems, conversion is required.\n- Detect renamed directories to obtain a more compact sync schedule.\n- Use multiple CPUs to hash files in parallel.\n- Support partial hashes for quicker comparison of same-size files.\n- Further optimize the sync algorithm, though it has been working well in practice.\n- Support for checking for duplicates by actual content, not just hash.\n- Update target mtimes from source.\n- Allow more output sorting options, e.g. by name or mtime.\n\n## Release Notes\n\n- Version 0.4.0\n - Drop Python 2 compatibility.\n - Add config files.\n - Bug fixes.\n- Version 0.3.8\n - Less hashing on `onfirstonly`.\n - Sort file search output by size.\n - Adjusted user output levels.\n- Version 0.3.7\n - Bug fix on reading offline trees.\n - Change output levels and some messages.\n- Version 0.3.6\n-- New: --include and --include-once options.\n - Bug fix: wrong exit code.\n- Version 0.3.5\n - Bug fix: not excluding dirs in offline mode.\n - Version 0.3.3\n - Python 3 support.\n- Version 0.3.2\n - New --root option to allow reading and updating a root tree database when querying subtrees.\n- Version 0.3.0\n - Exclude files by glob pattern in sync and other commands.\n - Better terminal output.\n - Major code overhaul.\n- Version 0.1.9\n - Improved sync algorithm.\n - Remove directories left empty after sync.\n- Version 0.1\n - Initial version.", "description_content_type": "text/markdown", "docs_url": null, "download_url": "https://github.com/mrsimoes/lnsync/archive/v0.4.0.tar.gz", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/mrsimoes/lnsync", "keywords": "sync rsync fast rename backup links hardlinks fdupes", "license": "GNU General Public License v3", "maintainer": "", "maintainer_email": "", "name": "lnsync", "package_url": "https://pypi.org/project/lnsync/", "platform": "", "project_url": "https://pypi.org/project/lnsync/", "project_urls": {"Download": "https://github.com/mrsimoes/lnsync/archive/v0.4.0.tar.gz", "Homepage": "https://github.com/mrsimoes/lnsync"}, "release_url": "https://pypi.org/project/lnsync/0.4.0/", "requires_dist": null, "requires_python": "", "summary": "Sync-by-rename local directories with hard link support, fast fdupes, and more.", "version": "0.4.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Overview</h1>\n<p><em>lnsync</em> provides unidirectional sync-by-rename of locally mounted directories, with support for hard links, without copying or deleting file data. To compare files, files hashes are computed and stored in a local database. Using these file hashes, <em>lnsync</em> also provides other functions, such as finding duplicate files.</p>\n<p>This tool allows arbitrary file renaming and moving in the source file tree to be quickly replicated in the target without copying any file data. It may used as a preprocessing step for other sync tools, such as <em>rsync</em>.</p>\n<h2>Hard Link Support</h2>\n<p>On many file systems (e.g. ext3/4, NTFS, btrfs), a file may be reached via multiple file paths, which function as aliases. A new path created for an existing file is a <em>hard link</em>, but all such aliases are on an equal footing, so each may be called a hard link. Removing the last hardlink to a file means deleting that file.</p>\n<p>If both hard links are created or removed in the source (without deleting files), and the target supports hard linking, then <em>lnsync</em> can create and removing hardlinks as required on the target when syncing. As before, this is done without copying or deleting file data.</p>\n<h2>Syncing</h2>\n<p>When you rename/move in the source file tree, <em>lnsync</em>  makes a best-effort to sync the target by only renaming files and generally creating/removing hard links on the target, without deleting or copying any file data. Empty directories on the target which do not exist on the source are also removed.</p>\n<p>File content is compared using xxHash (a fast, non-cryptographic hash function). Hash values are stored in a single-file database at the top-level directory of each file tree. The hash value database is a single file at the top directory of processed trees, with basename matching <code>lnsync-[0-9]+.db</code>. (Only one such file should exist there.) These files are ignored by all <em>lnsync</em> operations, and care should be taken not to sync them with other tools.</p>\n<p>File modification times are used to detect stale hash values and are not synced. File ownership and permissions are ignored: files which cannot be read are skipped.</p>\n<h2>File Searching</h2>\n<p>Using file content hashes, <em>lnsync</em> can also find duplicate files (like <em>fdupes</em>), and more generally find files according to the which file trees they appear on, compare file trees, and check for changes/bitrot.</p>\n<h2>Offline File Trees</h2>\n<p><em>lnsync</em> can save the structure of a file tree under a local directory and save it in a single-file database. These offline file trees can be used in most <em>lnsync</em> commands in place of an local directory, even as the source in a sync command.</p>\n<h1>Alternative Sync Solutions for Linux</h1>\n<p>Some of the many tools for syncing with rename detection:</p>\n<ul>\n<li>\n<p>There are patches for <em>rsync</em> (see --detect-renamed) that provide renaming on the target, relying on file size and modification time, for matching files in nearby directories. <em>rsync</em> can preserve hard links and sync with remote rsync instances.</p>\n</li>\n<li>\n<p><a href=\"https://rclone.org/\" rel=\"nofollow\">rclone</a> provides sync-by-rename for local as well as an amazing array of remote clients. It allows caching file hashes, after some configuration. However, it does not preserve hard links.</p>\n</li>\n<li>\n<p><a href=\"https://www.cis.upenn.edu/%7Ebcpierce/unison/\" rel=\"nofollow\">unison</a> and <a href=\"https://github.com/dooblem/bsync\" rel=\"nofollow\">bsync</a> provide network syncing with rename detection, but do not preserve hard links.</p>\n</li>\n<li>\n<p><em>git</em> itself identifies and stores files by content, and has been adapted for syncing.</p>\n</li>\n<li>\n<p>Support in modern file systems (e.g. btrfs) for snapshots may be adapted for syncing.</p>\n</li>\n</ul>\n<p>In addition to syncing, <em>lnsync</em> allows using the file hash database to search for files according to a variety of criteria.</p>\n<h1>Installation and Quickstart</h1>\n<h2>Installing</h2>\n<p>Install the latest version from the PyPI repository with <code>pip install -U lnsync</code>.</p>\n<p>Or clone the repo with <code>git clone https://github.com/mrsimoes/lnsync.git</code> and run <code>python setup.py install</code>.</p>\n<h2>Examples</h2>\n<p>If you have your photo archive at <code>/home/you/Photos</code> and your backup is at <code>/mnt/disk/Photos</code>, run <code>lnsync sync -n /home/you/Photos /mnt/disk/Photos</code> for a dry-run, to see which sync operations would be performed. To sync, ommit the <code>-n</code> switch.</p>\n<p>You will notice that two database files are created, one at the source and another at the backup directory. File hashes are cmoputed as needed and then stored in these files. The database filenames includes a random suffix to avoid accidental overwriting when syncing with a tool other than <em>lsync</em>.</p>\n<p>To quickly obtain an <em>rsync</em> command that will complete syncing, skipping <code>lnsync</code> database files, run <code>lnsync rsync /home/you/Photos /mnt/disk/Photos</code>. To also run this command, use the <code>-x</code> switch. Make sure the <code>rsync</code> options provided by this command are suitable for you.</p>\n<p>Finally, to check the target is in-sync by recursively comparing it to source, run <code>lnsync cmp /home/you/Photos /mnt/disk/Photos</code>.</p>\n<p>To find duplicate files on the Photos directory, run <code>lnsync fdupes /home/you/Photos</code>. Use <code>-z</code> to compare by size only. Use <code>-H</code> to count different hardlinks to the same file as distinct files. If this option is not given, for each multiple-linked with other duplicates, a path is arbitrarily picked and printed.</p>\n<p>To find all files in Photos which are not in the backup (under any name): <code>lnsync onfirstonly /home/you/Photos /mnt/disk/Photos</code>.</p>\n<p>To sync the subdir <code>/home/you/Photos/Best</code> to your digital picture frame, using the database hashes at <code>/home/you/Photos</code>: <code>lnsync sync /home/you/Photos/Best --root=/home/you/Photos /mnt/eframe/</code>.</p>\n<h1>Command Reference</h1>\n<p>All <em>lnsync</em> commands are <code>lnsync [&lt;global-options&gt;] &lt;command&gt; [&lt;cmd-options&gt;] [&lt;cmd-parameters&gt;]</code>.</p>\n<h2>Syncing</h2>\n<ul>\n<li>\n<p><code>lnsync sync [options] &lt;source&gt; &lt;target&gt;</code> syncs a target dir from a source dir (or offline tree).</p>\n</li>\n<li>\n<p>First, target files are matched to source files. Each matched target file is associated to a single source file. If either file system supports hardlinks, a file may have multiple pathnames. <em>lnsync</em> will not complain if the match is not unique or some files are not matched on either source and/or target.</p>\n</li>\n<li>\n<p>For each matched target file, its pathnames are made to match those of the corresponding source file, by renaming, deleting, or creating hardlinks. New intermediate subdirectories are created as needed on the target and directories which become empty on the target are removed.</p>\n</li>\n<li>\n<p><code>-z</code> Match files by size only. In this case, hash databases are not created or updated.</p>\n</li>\n<li>\n<p><code>-M=&lt;size&gt;</code> Excludes all files larger than &lt;size&gt;, which may be given in human form, e.g. <code>10k</code>, <code>2.1M</code>, <code>3G</code>.</p>\n</li>\n<li>\n<p><code>-n</code> Dry-run, just show which operations would be performed.</p>\n</li>\n<li>\n<p><code>--exclude=&lt;glob_pattern&gt;</code> Exclude source files and directories by glob pattern. Patterns are interpreted similarly to <code>rsync --exclude=&lt;glob_pattern&gt; source/ target</code>, but with <code>*</code> matching across slashes and no <code>**</code> pattern. This option may be repeated, with each <code>--exclude</code> option affecting all file trees. An initial slash anchors the pattern to the file tree root. A trailing slash means the pattern applies only to directories. There is a corresponding <code>--include</code>. Some commands accept <code>--exclude-once=&lt;pattern&gt;</code> and <code>--include-once=&lt;pattern&gt;</code>, which apply only to the next file tree following the switch and gain precedence over global patterns.</p>\n</li>\n</ul>\n<p>To sum up, a file or directory is excluded if it matches an <code>exclude</code> pattern before matching any <code>include</code> pattern.</p>\n<ul>\n<li><code>lnsync rsync [options] &lt;tree&gt; &lt;dir&gt; [rsync-options]</code> Prints an <em>rsync</em> command that would sync target dir from source, skipping <em>lnsync</em> database files. Source may be a dir or an offline tree. Check the default <em>rsync</em> options provided are what you want. To also run the <em>rsync</em> command, use the <code>-x</code> switch.</li>\n</ul>\n<h2>Creating, Updating, and Accessing the Hash Database</h2>\n<ul>\n<li><code>lnsync update &lt;dir&gt;</code> Update the hash database, creating a new database if none exists, and rehashing all new files and those with a changed modification time (mtime). Accepts <code>--exclude=&lt;pattern&gt;</code> options.</li>\n<li><code>lnsync update &lt;dir&gt;</code> Update the hash database, creating a new database if none exists, and rehashing all new files and those with a changed modification time (mtime). Accepts <code>--exclude=&lt;pattern&gt;</code> options.</li>\n<li><code>lnsync rehash &lt;dir&gt; [&lt;relpath&gt;]+</code> Force rehashing files specified by paths relative to the root <code>dir</code>.</li>\n<li><code>lnsync subdir &lt;dir&gt; &lt;relsubdir&gt;</code> Update the database at <code>relsubdir</code> using any hash value already present in the hash database for <code>dir</code>.</li>\n<li><code>lnsync mkoffline &lt;dir&gt; &lt;outputfile&gt;</code> Update database at <code>dir</code> and create corresponding offline database at <code>outputfile</code>.</li>\n<li><code>lnsync cleandb &lt;dir&gt;</code> Remove outdated entries and re-compact the database.</li>\n<li><code>lnsync lookup &lt;tree&gt; [&lt;relpath&gt;+]</code> Returns (either from db or by recomputing) the hash value for the files, where <code>tree</code> may be a a directory or an offline tree.</li>\n</ul>\n<h2>Finding Files</h2>\n<ul>\n<li>\n<p><code>lnsync cmp &lt;tree1&gt; &lt;tree2&gt;</code> Recursively compares two file trees. Compares files at each path, does not compare the hard link structure. Accepts <code>--exclude=&lt;pattern&gt;</code> options.</p>\n</li>\n<li>\n<p><code>lnsync fdupes [-h] [&lt;tree&gt;]+</code> Find files duplicated anywhere on the given trees.</p>\n</li>\n<li>\n<p><code>lnsync onall [&lt;tree&gt;]+</code>, <code>lnsync onfirstonly [&lt;tree&gt;]+</code>, <code>lnsync onlastonly [&lt;tree&gt;]+</code> Find files as advertised. Some options: <code>-M</code> prunes by maximum size; <code>-0</code> prunes empty files; <code>-1</code> prints each group of files in a single line, separated by spaces and with escaped backslashes and spaces, like <code>fdupes</code>; <code>-s</code> sorts output by size. Use <code>-H</code> to consider multiple links to the same file as distinct files; if this option is not used, print a single, arbitrarily picked path for each multiple-linked file found to satisfy the condition of the command.</p>\n</li>\n<li>\n<p><code>lnsync check [&lt;tree&gt;] [&lt;path&gt;]*</code> Recompute hashes for given files and compare to the hash stored in the database, to check for changes/bitrot.</p>\n</li>\n</ul>\n<h2>Configuration files</h2>\n<p>An INI-style configuration file is searched at <code>./lnsync.cfg</code> and <code>~/.lnsync.cfg</code>, in that order. In its <code>DEFAULT</code> section, default values may be set there for command-line options <code>sort</code>, <code>hardlinks</code>, <code>sameline</code>, <code>dbprefix</code>, <code>bysize</code>, <code>maxsize</code>, <code>skipempty</code>, <code>dry_run</code>. Each section whose name matches a directory (resp. file) may contain <code>exclude</code> and <code>include</code> options whose values are space-separated patterns applied to taht online (resp. offline) file tree, after command-line exclude/include patterns. The <code>DEFAULT</code> section may also contain similar <code>exclude</code> and <code>include</code> options, applying to all trees after all other exclude/include patterns.</p>\n<h1>Origin, Status, and Future Development</h1>\n<p>This package started as a Python learning project. I've found it useful enough to polish for publication, but as with any work in progress, it should be used with adequate caution.</p>\n<p>Feedback, suggestions, comments, and corrections are very welcome.</p>\n<p>You can support this project with bitcoin at <a>17HS828pkQMiXZGy7UNbA49TYCz7LAQ2ze</a>.</p>\n<p>This program comes with ABSOLUTELY NO WARRANTY. This is free software, and you are welcome to redistribute it under certain conditions. See the GNU General Public Licence v3 for details.</p>\n<h2>Caveats and Limitations</h2>\n<ul>\n<li>Works only on locally mounted directories, no support whatsoever for remote servers.</li>\n<li>Depends on mtime to detect file content changes.</li>\n<li>If source files A, B, C (with pairwise distinct contents) are renamed on target in a cycle to C, A, B, sync is currently not supported.</li>\n<li>Only readable files and readable+accessible directories are read. Other files and dirs, as well as symlinks, pipes, special devices are ignored.</li>\n<li>Minimal support for case-insensitive but case-preserving file systems like vfat: if a target file name differs from source match in case only, target is not updated.</li>\n<li>Supports Linux only.</li>\n</ul>\n<h2>Possible Improvements</h2>\n<ul>\n<li>Make <code>--include</code> and <code>--exclude</code> patterns more compatible with <code>rsync</code>.</li>\n<li>Extend <code>cmp</code> to take hard links into account.</li>\n<li>Filenames are NOT converted to Unicode. To allow using offline database across systems, conversion is required.</li>\n<li>Detect renamed directories to obtain a more compact sync schedule.</li>\n<li>Use multiple CPUs to hash files in parallel.</li>\n<li>Support partial hashes for quicker comparison of same-size files.</li>\n<li>Further optimize the sync algorithm, though it has been working well in practice.</li>\n<li>Support for checking for duplicates by actual content, not just hash.</li>\n<li>Update target mtimes from source.</li>\n<li>Allow more output sorting options, e.g. by name or mtime.</li>\n</ul>\n<h2>Release Notes</h2>\n<ul>\n<li>Version 0.4.0</li>\n<li>Drop Python 2 compatibility.</li>\n<li>Add config files.</li>\n<li>Bug fixes.</li>\n<li>Version 0.3.8</li>\n<li>Less hashing on <code>onfirstonly</code>.</li>\n<li>Sort file search output by size.</li>\n<li>Adjusted user output levels.</li>\n<li>Version 0.3.7</li>\n<li>Bug fix on reading offline trees.</li>\n<li>Change output levels and some messages.</li>\n<li>Version 0.3.6\n-- New: --include and --include-once options.</li>\n<li>Bug fix: wrong exit code.</li>\n<li>Version 0.3.5</li>\n<li>Bug fix: not excluding dirs in offline mode.</li>\n<li>Version 0.3.3</li>\n<li>Python 3 support.</li>\n<li>Version 0.3.2</li>\n<li>New --root option to allow reading and updating a root tree database when querying subtrees.</li>\n<li>Version 0.3.0</li>\n<li>Exclude files by glob pattern in sync and other commands.</li>\n<li>Better terminal output.</li>\n<li>Major code overhaul.</li>\n<li>Version 0.1.9</li>\n<li>Improved sync algorithm.</li>\n<li>Remove directories left empty after sync.</li>\n<li>Version 0.1</li>\n<li>Initial version.</li>\n</ul>\n\n          </div>"}, "last_serial": 6542275, "releases": {"0.1.9": [{"comment_text": "", "digests": {"md5": "9bbc6510837ffddede008fe2d98a760f", "sha256": "b23586739c9ed60b743cac8faa5b00478d67abd42fa2a390578e31e52c3ae1c8"}, "downloads": -1, "filename": "lnsync-0.1.9.tar.gz", "has_sig": false, "md5_digest": "9bbc6510837ffddede008fe2d98a760f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 39628, "upload_time": "2019-01-05T10:10:59", "upload_time_iso_8601": "2019-01-05T10:10:59.575211Z", "url": "https://files.pythonhosted.org/packages/be/fa/3fca2907c55109fe99e5bf0a36dfb9977515b2f46746aaeeb3879f93dd3a/lnsync-0.1.9.tar.gz", "yanked": false}], "0.3.1": [{"comment_text": "", "digests": {"md5": "e2f4546abb25ea5fd904ca97ab0fefc5", "sha256": "7777bc26dd0312276ff25baf14d8f42fd379ab23f2548f88aeeaa757b9c0e768"}, "downloads": -1, "filename": "lnsync-0.3.1-py2-none-any.whl", "has_sig": false, "md5_digest": "e2f4546abb25ea5fd904ca97ab0fefc5", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 71267, "upload_time": "2019-06-14T08:17:57", "upload_time_iso_8601": "2019-06-14T08:17:57.709099Z", "url": "https://files.pythonhosted.org/packages/86/51/04ea0c2ece83bee0b39fa54827ddcdb8eece1b3c9252cc31a055a006c784/lnsync-0.3.1-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6d03b33558a4b8b5c05e29d8599912a5", "sha256": "65f1fc76d5f504f8704b3ef3a65d2d503dcc5dcf6b364f306b4296aa009d8260"}, "downloads": -1, "filename": "lnsync-0.3.1.tar.gz", "has_sig": false, "md5_digest": "6d03b33558a4b8b5c05e29d8599912a5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 49003, "upload_time": "2019-06-14T08:18:00", "upload_time_iso_8601": "2019-06-14T08:18:00.176255Z", "url": "https://files.pythonhosted.org/packages/74/fe/f7709b6ff31d432c4018a882a4cc3759f198f6e53b1fd385d0041759a4ac/lnsync-0.3.1.tar.gz", "yanked": false}], "0.3.1.post3": [{"comment_text": "", "digests": {"md5": "f40312823fe80ecb32ede130fda8ce3b", "sha256": "994eff4797718bac0c6fb7ca6c8c4f8e5f242895c4b476d92d93b4eeb639b457"}, "downloads": -1, "filename": "lnsync-0.3.1.post3.tar.gz", "has_sig": false, "md5_digest": "f40312823fe80ecb32ede130fda8ce3b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 49329, "upload_time": "2019-06-17T19:32:30", "upload_time_iso_8601": "2019-06-17T19:32:30.672341Z", "url": "https://files.pythonhosted.org/packages/a6/65/acdbc2ef3159032ad4feabe4957c75f2e4aed0c1f4d9e3b3d9433b202d19/lnsync-0.3.1.post3.tar.gz", "yanked": false}], "0.3.3": [{"comment_text": "", "digests": {"md5": "ddbfa2be72107f308b9b7ca4fad28b08", "sha256": "8b0c280808d27da987afe8bfa5cf3f849a3f5f7a668db7575b6481a739e110a6"}, "downloads": -1, "filename": "lnsync-0.3.3.tar.gz", "has_sig": false, "md5_digest": "ddbfa2be72107f308b9b7ca4fad28b08", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 57092, "upload_time": "2019-07-08T17:20:06", "upload_time_iso_8601": "2019-07-08T17:20:06.226495Z", "url": "https://files.pythonhosted.org/packages/62/b8/11c2fbdd4fd7efaf8c5a07dda89a7e95356d95496270e3cd99cabe96ac8b/lnsync-0.3.3.tar.gz", "yanked": false}], "0.3.4": [{"comment_text": "", "digests": {"md5": "989b83fe2a2efc55e743c0b9472cff02", "sha256": "b0588077d6edb826b094febf22eb7c319af7c7d810a58c2c3c1a30f5490842f7"}, "downloads": -1, "filename": "lnsync-0.3.4.tar.gz", "has_sig": false, "md5_digest": "989b83fe2a2efc55e743c0b9472cff02", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 57564, "upload_time": "2019-07-21T13:39:20", "upload_time_iso_8601": "2019-07-21T13:39:20.851256Z", "url": "https://files.pythonhosted.org/packages/61/e1/bb0c74dcc5354bcf36510dad24183170e0870adc333f1bb26e2632bcefbf/lnsync-0.3.4.tar.gz", "yanked": false}], "0.3.5": [{"comment_text": "", "digests": {"md5": "5654fdbd3c3f6598cd6b6a7ea045a52a", "sha256": "5051b4d37f411b0ff78106bea539e8c9f9e8bd172803853918d7201b2c6746e3"}, "downloads": -1, "filename": "lnsync-0.3.5.tar.gz", "has_sig": false, "md5_digest": "5654fdbd3c3f6598cd6b6a7ea045a52a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58073, "upload_time": "2019-08-06T13:18:10", "upload_time_iso_8601": "2019-08-06T13:18:10.627269Z", "url": "https://files.pythonhosted.org/packages/cb/4b/c2ff9e40945b87b8f646b6289aae0a466dba70d1db6d3c471530fad38692/lnsync-0.3.5.tar.gz", "yanked": false}], "0.3.6": [{"comment_text": "", "digests": {"md5": "42a87a16b4da376188ede38c246648d3", "sha256": "c6dc73b1d142edae83dcb5fb0b07e16cdb0b21b26a1b77631753a1c672d0387c"}, "downloads": -1, "filename": "lnsync-0.3.6.tar.gz", "has_sig": false, "md5_digest": "42a87a16b4da376188ede38c246648d3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 59374, "upload_time": "2019-08-14T11:29:42", "upload_time_iso_8601": "2019-08-14T11:29:42.685853Z", "url": "https://files.pythonhosted.org/packages/b9/d7/dad68920fd6bf9ad51d23d5de1aa7d8b61774f5c697bee90b1329f1b58e7/lnsync-0.3.6.tar.gz", "yanked": false}], "0.3.7": [{"comment_text": "", "digests": {"md5": "9c00517eee8193615179a2d98a0592c4", "sha256": "85f189ab71b6131cced85a1a49430ed3a8d8e626582afd88b6c198482b09ab98"}, "downloads": -1, "filename": "lnsync-0.3.7.tar.gz", "has_sig": false, "md5_digest": "9c00517eee8193615179a2d98a0592c4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 59987, "upload_time": "2019-08-23T18:41:03", "upload_time_iso_8601": "2019-08-23T18:41:03.867885Z", "url": "https://files.pythonhosted.org/packages/d3/e1/e06c739ee4d642c1c33918c1475184c0fac191134339c0a448cd7f815497/lnsync-0.3.7.tar.gz", "yanked": false}], "0.3.8": [{"comment_text": "", "digests": {"md5": "d2e2ae76c94c29fd0f835f716cc3c81d", "sha256": "337ddbfd8ae5aba3c16304fc3c14036fe3bd9ebd245a82dfcaf45d511c88df4b"}, "downloads": -1, "filename": "lnsync-0.3.8.tar.gz", "has_sig": false, "md5_digest": "d2e2ae76c94c29fd0f835f716cc3c81d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 60350, "upload_time": "2019-09-12T10:11:58", "upload_time_iso_8601": "2019-09-12T10:11:58.854778Z", "url": "https://files.pythonhosted.org/packages/86/91/8f59dd16688edeadeb89109698877683d1ba28777f2ba56d11d9c2296ab6/lnsync-0.3.8.tar.gz", "yanked": false}], "0.3.9": [{"comment_text": "", "digests": {"md5": "673f2208777d48502f97ff0b14ea4364", "sha256": "f0e033838cee642c79b03f15b4b4104299b97f0e568bfbc082c1ec30a0857132"}, "downloads": -1, "filename": "lnsync-0.3.9.tar.gz", "has_sig": false, "md5_digest": "673f2208777d48502f97ff0b14ea4364", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 61722, "upload_time": "2020-01-29T21:04:06", "upload_time_iso_8601": "2020-01-29T21:04:06.720731Z", "url": "https://files.pythonhosted.org/packages/92/85/d692102c5819f6f7a4f908f734b21ae51bae752e19e7ee0469c05cc35291/lnsync-0.3.9.tar.gz", "yanked": false}], "0.4.0": [{"comment_text": "", "digests": {"md5": "50351f808437818b67fffcc75944e190", "sha256": "5a65d59f8bd8e5092ee27752acc7edfeebc98c14b7e0fba8c933fdd38b907fe1"}, "downloads": -1, "filename": "lnsync-0.4.0.tar.gz", "has_sig": false, "md5_digest": "50351f808437818b67fffcc75944e190", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 64211, "upload_time": "2020-01-30T09:18:30", "upload_time_iso_8601": "2020-01-30T09:18:30.935859Z", "url": "https://files.pythonhosted.org/packages/6a/8a/7fcb6ea79b2f7074c3fcaa8430157697b40428de5f1a0a455c2f82c7a7aa/lnsync-0.4.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "50351f808437818b67fffcc75944e190", "sha256": "5a65d59f8bd8e5092ee27752acc7edfeebc98c14b7e0fba8c933fdd38b907fe1"}, "downloads": -1, "filename": "lnsync-0.4.0.tar.gz", "has_sig": false, "md5_digest": "50351f808437818b67fffcc75944e190", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 64211, "upload_time": "2020-01-30T09:18:30", "upload_time_iso_8601": "2020-01-30T09:18:30.935859Z", "url": "https://files.pythonhosted.org/packages/6a/8a/7fcb6ea79b2f7074c3fcaa8430157697b40428de5f1a0a455c2f82c7a7aa/lnsync-0.4.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:44:42 2020"}