{"info": {"author": "Tao Liu", "author_email": "vladimir.liu@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Environment :: Console", "Intended Audience :: Developers", "Intended Audience :: Science/Research", "License :: OSI Approved :: BSD License", "Operating System :: MacOS :: MacOS X", "Operating System :: POSIX", "Programming Language :: Cython", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3.8", "Topic :: Scientific/Engineering :: Bio-Informatics"], "description": "# MACS: Model-based Analysis for ChIP-Seq\n\n![Status](https://img.shields.io/pypi/status/macs2.svg) [![License](https://img.shields.io/github/license/taoliu/MACS)](https://github.com/taoliu/MACS/blob/master/LICENSE) ![Programming languages](https://img.shields.io/github/languages/top/taoliu/MACS) ![Commit activity](https://img.shields.io/github/commit-activity/m/taoliu/MACS) [![TravisCI Build Status](https://img.shields.io/travis/com/taoliu/MACS/master)](https://travis-ci.com/taoliu/MACS)\n\n[![PyPI download](https://img.shields.io/pypi/dm/macs2?label=pypi%20downloads)](https://pypistats.org/packages/macs2) [![Bioconda download](https://img.shields.io/conda/dn/bioconda/macs2?label=bioconda%20downloads)](https://anaconda.org/bioconda/macs2)\n\nLatest Release:\n* Github: [![Github Release](https://img.shields.io/github/v/release/taoliu/MACS)](https://github.com/taoliu/MACS/releases)\n* PyPI: [![PyPI Release](https://img.shields.io/pypi/v/macs2.svg) ![PyPI Python Version](https://img.shields.io/pypi/pyversions/MACS2) ![PyPI Format](https://img.shields.io/pypi/format/macs2)](https://pypi.org/project/macs2/)\n* Bioconda: [![Bioconda Release](https://img.shields.io/conda/v/bioconda/macs2) ![Bioconda Platform](https://img.shields.io/conda/pn/bioconda/macs2)](https://anaconda.org/bioconda/macs2)\n* Debian Med: [![Debian Stable](https://img.shields.io/debian/v/macs/stable?label=debian%20stable)](https://packages.debian.org/stable/macs) [![Debian Unstable](https://img.shields.io/debian/v/macs/sid?label=debian%20sid)](https://packages.debian.org/sid/macs)\n\n## Introduction\n\nWith the improvement of sequencing techniques, chromatin\nimmunoprecipitation followed by high throughput sequencing (ChIP-Seq)\nis getting popular to study genome-wide protein-DNA interactions. To\naddress the lack of powerful ChIP-Seq analysis method, we presented\nthe **M**odel-based **A**nalysis of **C**hIP-**S**eq (MACS), for\nidentifying transcript factor binding sites. MACS captures the\ninfluence of genome complexity to evaluate the significance of\nenriched ChIP regions and MACS improves the spatial resolution of\nbinding sites through combining the information of both sequencing tag\nposition and orientation. MACS can be easily used for ChIP-Seq data\nalone, or with a control sample with the increase of\nspecificity. Moreover, as a general peak-caller, MACS can also be\napplied to any \"DNA enrichment assays\" if the question to be asked is\nsimply: *where we can find significant reads coverage than the random\nbackground*.\n\n## Recent Changes for MACS (2.2.7.1)\n\n### 2.2.7.1\n\t* hotfix: \n\n\tAdd 'wheel' and 'pip' to pyproject.toml so that `pip install` can \n\twork.\n\n\n### 2.2.7\n\t* Bugs fixed\n\n\t1) MACS2 has been tested on multiple architectures to make sure it\n\tcan successfully generate consistent results. Currently the\n\tsupported architectures are: AMD64, ARM64, i386, PPC64LE, and\n\tS390X. Thanks to @mr-c, @junaruga, and @tillea! Related to issue\n\t#340, #349, #351, and #359; to PR #348, #350, #360, #361, #367,\n\tand #370. The lesson is that if the project is built on Cython and\n\tis aimed at memory efficiency, we should specifically define all\n\tint/float types in pyx files such as int8_t or uint32_t using\n\teither libc or numpy (c version) instead of relying on Cython\n\ttypes such as short, long, double.\n\n\t2) MACS2 setup script will check numpy and install numpy if\n\tnecessary. PR #378, issue #364\n\n\t3) `bdgbroadcall` command will correctly add the score column (5th\n\tcolumn). The score (5th) column contains 10 times of the average\n\tscore in the broad region. PR #373, issue #362\n\n\t4) The missing test on `bdgopt` subcommand has been added. PR #363\n\n\t5) The obsolete option `--ratio` from `callpeak` subcommand has\n\tbeen removed. PR #369, issue #366\n\n\t6) Fixed the incorrect description in README on the 'maximum\n\tlength of broad region is 4 times of d' to 'maximum gap for\n\tmerging broad regions is 4 times of tag size by default'. PR #380,\n\tissue #365.\n\n\t* Other\n\n\t1) CODE OF CONDUCT document has been added to MACS2 github\n\trepository. PR #358\n\n### 2.2.6\n\t* New Features \n\n\t1) Speed up MACS2. Some programming tricks and code cleanup. The \n\tfilter_dup function replaces separate_dups. The later one was \n\timplemented for potentially putting back duplicate reads in \n\tcertain downstream analysis. However such analysis hasn't been \n\timplemented. Optimize speed of writing bedGraph files. Optimize \n\tBAM and BAMPE parsing with pointer casting instead of python \n\tunpack. \n\n\t2) The comment lines in the headers of BED or SAM files will be\n\tcorrectly skipped. However, MACS2 won't check comment lines in the\n\tmiddle of the file.\n\n\t* Bugs fixed \n\n\t1) Cutoff-analysis in callpeak command. #341\n\t\n\t2) Issues related to SAMParser and three ELAND Parsers are\n\tfixed. #347\n\t\n\t* Other \n\n\t1) cmdlinetest script in test/ folder has been updated to: 1. test \n\tcutoff-analysis with callpeak cmd; 2. output the 2 lines before \n\tand after the error or warning message during tests; 3. output \n\tonly the first 10 lines if the difference between test result and \n\tstandard result can be found; 4. prockreport monitor CPU time and \n\tmemory usage in 1 sec interval -- a bit more accurate.\n\t\n\t2) Python3.5 support is removed. Now MACS2 requires Python>=3.6.\n\n## Install\n\nPlease check the file 'INSTALL.md' in the distribution.\n\n## Usage\n\n```\nmacs2 [-h] [--version]\n    {callpeak,bdgpeakcall,bdgbroadcall,bdgcmp,bdgopt,cmbreps,bdgdiff,filterdup,predictd,pileup,randsample,refinepeak}\n```\n\nExample for regular peak calling: `macs2 callpeak -t ChIP.bam -c\nControl.bam -f BAM -g hs -n test -B -q 0.01`\n\nExample for broad peak calling: `macs2 callpeak -t ChIP.bam -c\nControl.bam --broad -g hs --broad-cutoff 0.1`\n\nThere are twelve functions available in MAC2S serving as sub-commands.\n\nSubcommand | Description\n-----------|----------\n`callpeak` | Main MACS2 Function to call peaks from alignment results.\n`bdgpeakcall` | Call peaks from bedGraph output.\n`bdgbroadcall` | Call broad peaks from bedGraph output.\n`bdgcmp` | Comparing two signal tracks in bedGraph format.\n`bdgopt` | Operate the score column of bedGraph file.\n`cmbreps` | Combine BEDGraphs of scores from replicates.\n`bdgdiff` | Differential peak detection based on paired four bedGraph files.\n`filterdup` | Remove duplicate reads, then save in BED/BEDPE format.\n`predictd` | Predict d or fragment size from alignment results.\n`pileup` | Pileup aligned reads (single-end) or fragments (paired-end)\n`randsample` | Randomly choose a number/percentage of total reads.\n`refinepeak` | Take raw reads alignment, refine peak summits.\n\nWe only cover `callpeak` subcommand in this document. Please use\n`macs2 COMMAND -h` to see the detail description for each option of\neach subcommand.\n\n### Call peaks\n\nThis is the main function in MACS2. It can be invoked by `macs2\ncallpeak` . If you type this command with `-h`, you will see a full\ndescription of command-line options. Here we only list the essentials.\n\n#### Essential Options\n\n##### `-t`/`--treatment FILENAME`\n\nThis is the only REQUIRED parameter for MACS. The file can be in any\nsupported format -- see detail in the `--format` option. If you have\nmore than one alignment file, you can specify them as `-t A B C`. MACS\nwill pool up all these files together.\n\n##### `-c`/`--control`\n\nThe control, genomic input or mock IP data file. Please follow the\nsame direction as for `-t`/`--treatment`.\n\n##### `-n`/`--name`\n\nThe name string of the experiment. MACS will use this string NAME to\ncreate output files like `NAME_peaks.xls`, `NAME_negative_peaks.xls`,\n`NAME_peaks.bed` , `NAME_summits.bed`, `NAME_model.r` and so on. So\nplease avoid any confliction between these filenames and your existing\nfiles.\n\n##### `--outdir`\n\nMACS2 will save all output files into the specified folder for this\noption. A new folder will be created if necessary.\n\n##### `-f`/`--format FORMAT`\n\nFormat of tag file can be `ELAND`, `BED`, `ELANDMULTI`, `ELANDEXPORT`,\n`SAM`, `BAM`, `BOWTIE`, `BAMPE`, or `BEDPE`. Default is `AUTO` which\nwill allow MACS to decide the format automatically. `AUTO` is also\nuseful when you combine different formats of files. Note that MACS\ncan't detect `BAMPE` or `BEDPE` format with `AUTO`, and you have to\nimplicitly specify the format for `BAMPE` and `BEDPE`.\n\nNowadays, the most common formats are `BED` or `BAM` (including\n`BEDPE` and `BAMPE`). Our recommendation is to convert your data to\n`BED` or `BAM` first.\n\nAlso, MACS2 can detect and read gzipped file. For example, `.bed.gz`\nfile can be directly used without being uncompressed with `--format\nBED`.\n\nHere are detailed explanation of the recommanded formats:\n\n###### `BED`\n\nThe BED format can be found at [UCSC genome browser\nwebsite](http://genome.ucsc.edu/FAQ/FAQformat#format1).\n\nThe essential columns in BED format input are the 1st column\n`chromosome name`, the 2nd `start position`, the 3rd `end position`,\nand the 6th, `strand`.\n\nNote that, for `BED` format, the 6th column of strand information is\nrequired by MACS. And please pay attention that the coordinates in BED\nformat are zero-based and half-open. See more detail at\n[UCSC site](http://genome.ucsc.edu/FAQ/FAQtracks#tracks1).\n\n###### `BAM`/`SAM`\n\nIf the format is `BAM`/`SAM`, please check the definition in\n(http://samtools.sourceforge.net/samtools.shtml).  If the `BAM` file is\ngenerated for paired-end data, MACS will only keep the left mate(5'\nend) tag. However, when format `BAMPE` is specified, MACS will use the\nreal fragments inferred from alignment results for reads pileup.\n\n###### `BEDPE` or `BAMPE`\n\nA special mode will be triggered while the format is specified as\n`BAMPE` or `BEDPE`. In this way, MACS2 will process the `BAM` or `BED`\nfiles as paired-end data. Instead of building a bimodal distribution\nof plus and minus strand reads to predict fragment size, MACS2 will\nuse actual insert sizes of pairs of reads to build fragment pileup.\n\nThe `BAMPE` format is just a `BAM` format containing paired-end alignment\ninformation, such as those from `BWA` or `BOWTIE`.\n\nThe `BEDPE` format is a simplified and more flexible `BED` format,\nwhich only contains the first three columns defining the chromosome\nname, left and right position of the fragment from Paired-end\nsequencing. Please note, this is NOT the same format used by\n`BEDTOOLS`, and the `BEDTOOLS` version of `BEDPE` is actually not in a\nstandard `BED` format. You can use MACS2 subcommand `randsample` to\nconvert a `BAM` file containing paired-end information to a `BEDPE`\nformat file:\n\n```\nmacs2 randsample -i the_BAMPE_file.bam -f BAMPE -p 100 -o the_BEDPE_file.bed\n```\n\n##### `-g`/`--gsize`\n\nPLEASE assign this parameter to fit your needs!\n\nIt's the mappable genome size or effective genome size which is\ndefined as the genome size which can be sequenced. Because of the\nrepetitive features on the chromosomes, the actual mappable genome\nsize will be smaller than the original size, about 90% or 70% of the\ngenome size. The default *hs* -- 2.7e9 is recommended for human\ngenome. Here are all precompiled parameters for effective genome size:\n\n * hs: 2.7e9\n * mm: 1.87e9\n * ce: 9e7\n * dm: 1.2e8\n\nUsers may want to use k-mer tools to simulate mapping of Xbps long\nreads to target genome, and to find the ideal effective genome\nsize. However, usually by taking away the simple repeats and Ns from\nthe total genome, one can get an approximate number of effective\ngenome size. A slight difference in the number won't cause a big\ndifference of peak calls, because this number is used to estimate a\ngenome-wide noise level which is usually the least significant one\ncompared with the *local biases* modeled by MACS.\n\n##### `-s`/`--tsize`\n\nThe size of sequencing tags. If you don't specify it, MACS will try to\nuse the first 10 sequences from your input treatment file to determine\nthe tag size. Specifying it will override the automatically determined\ntag size.\n\n##### `-q`/`--qvalue`\n\nThe q-value (minimum FDR) cutoff to call significant regions. Default\nis 0.05. For broad marks, you can try 0.05 as the cutoff. Q-values are\ncalculated from p-values using the Benjamini-Hochberg procedure.\n\n##### `-p`/`--pvalue`\n\nThe p-value cutoff. If `-p` is specified, MACS2 will use p-value instead\nof q-value.\n\n##### `--min-length`, `--max-gap`\n\nThese two options can be used to fine-tune the peak calling behavior\nby specifying the minimum length of a called peak and the maximum\nallowed a gap between two nearby regions to be merged. In other words,\na called peak has to be longer than `min-length`, and if the distance\nbetween two nearby peaks is smaller than `max-gap` then they will be\nmerged as one. If they are not set, MACS2 will set the DEFAULT value\nfor `min-length` as the predicted fragment size `d`, and the DEFAULT\nvalue for `max-gap` as the detected read length. Note, if you set a\n`min-length` value smaller than the fragment size, it may have NO\neffect on the result. For broad peak calling with `--broad` option\nset, the DEFAULT `max-gap` for merging nearby stronger peaks will be\nthe same as narrow peak calling, and 4 times of the `max-gap` will be\nused to merge nearby weaker (broad) peaks. You can also use\n`--cutoff-analysis` option with the default setting, and check the\ncolumn `avelpeak` under different cutoff values to decide a reasonable\n`min-length` value.\n\n##### `--nolambda`\n\nWith this flag on, MACS will use the background lambda as local\nlambda. This means MACS will not consider the local bias at peak\ncandidate regions.\n\n##### `--slocal`, `--llocal`\n\nThese two parameters control which two levels of regions will be\nchecked around the peak regions to calculate the maximum lambda as\nlocal lambda. By default, MACS considers 1000bp for small local\nregion(`--slocal`), and 10000bps for large local region(`--llocal`)\nwhich captures the bias from a long-range effect like an open\nchromatin domain. You can tweak these according to your\nproject. Remember that if the region is set too small, a sharp spike\nin the input data may kill a significant peak.\n\n##### `--nomodel`\n\nWhile on, MACS will bypass building the shifting model.\n\n##### `--extsize`\n\nWhile `--nomodel` is set, MACS uses this parameter to extend reads in\n5'->3' direction to fix-sized fragments. For example, if the size of\nthe binding region for your transcription factor is 200 bp, and you\nwant to bypass the model building by MACS, this parameter can be set\nas 200. This option is only valid when `--nomodel` is set or when MACS\nfails to build model and `--fix-bimodal` is on.\n\n##### `--shift`\n\nNote, this is NOT the legacy `--shiftsize` option which is replaced by\n`--extsize`! You can set an arbitrary shift in bp here. Please Use\ndiscretion while setting it other than the default value (0). When\n`--nomodel` is set, MACS will use this value to move cutting ends (5')\nthen apply `--extsize` from 5' to 3' direction to extend them to\nfragments. When this value is negative, ends will be moved toward\n3'->5' direction, otherwise 5'->3' direction. Recommended to keep it\nas default 0 for ChIP-Seq datasets, or -1 * half of *EXTSIZE* together\nwith `--extsize` option for detecting enriched cutting loci such as\ncertain DNAseI-Seq datasets. Note, you can't set values other than 0\nif the format is BAMPE or BEDPE for paired-end data. The default is 0.\n\nHere are some examples for combining `--shift` and `--extsize`:\n\n1. To find enriched cutting sites such as some DNAse-Seq datasets. In\nthis case, all 5' ends of sequenced reads should be extended in both\ndirections to smooth the pileup signals. If the wanted smoothing\nwindow is 200bps, then use `--nomodel --shift -100 --extsize 200`.\n\n2. For certain nucleosome-seq data, we need to pile up the centers of\nnucleosomes using a half-nucleosome size for wavelet analysis\n(e.g. NPS algorithm). Since the DNA wrapped on nucleosome is about\n147bps, this option can be used: `--nomodel --shift 37 --extsize 73`.\n\n##### `--keep-dup`\n\nIt controls the MACS behavior towards duplicate tags at the exact same\nlocation -- the same coordination and the same strand. The default\n`auto` option makes MACS calculate the maximum tags at the exact same\nlocation based on binomial distribution using 1e-5 as p-value cutoff;\nand the `all` option keeps every tag.  If an integer is given, at most\nthis number of tags will be kept at the same location. The default is\nto keep one tag at the same location. Default: 1\n\n##### `--broad`\n\nWhen this flag is on, MACS will try to composite broad regions in\nBED12 ( a gene-model-like format ) by putting nearby highly enriched\nregions into a broad region with loose cutoff. The broad region is\ncontrolled by another cutoff through `--broad-cutoff`. Please note\nthat, the `max-gap` value for merging nearby weaker/broad peaks is 4\ntimes of `max-gap` for merging nearby stronger peaks. The later one\ncan be controlled by `--max-gap` option, and by default it is the\naverage fragment/insertion length in the PE data. DEFAULT: False\n\n##### `--broad-cutoff`\n\nCutoff for the broad region. This option is not available unless\n`--broad` is set. If `-p` is set, this is a p-value cutoff, otherwise,\nit's a q-value cutoff.  DEFAULT: 0.1\n\n##### `--scale-to <large|small>`\n\nWhen set to `large`, linearly scale the smaller dataset to the same\ndepth as the larger dataset. By default or being set as `small`, the\nlarger dataset will be scaled towards the smaller dataset. Beware, to\nscale up small data would cause more false positives.\n\n##### `-B`/`--bdg`\n\nIf this flag is on, MACS will store the fragment pileup, control\nlambda in bedGraph files. The bedGraph files will be stored in the\ncurrent directory named `NAME_treat_pileup.bdg` for treatment data,\n`NAME_control_lambda.bdg` for local lambda values from control.\n\n##### `--call-summits`\n\nMACS will now reanalyze the shape of signal profile (p or q-score\ndepending on the cutoff setting) to deconvolve subpeaks within each\npeak called from the general procedure. It's highly recommended to\ndetect adjacent binding events. While used, the output subpeaks of a\nbig peak region will have the same peak boundaries, and different\nscores and peak summit positions.\n\n##### `--buffer-size`\n\nMACS uses a buffer size for incrementally increasing internal array\nsize to store reads alignment information for each chromosome or\ncontig. To increase the buffer size, MACS can run faster but will\nwaste more memory if certain chromosome/contig only has very few\nreads. In most cases, the default value 100000 works fine. However, if\nthere are a large number of chromosomes/contigs in your alignment and\nreads per chromosome/contigs are few, it's recommended to specify a\nsmaller buffer size in order to decrease memory usage (but it will\ntake longer time to read alignment files). Minimum memory requested\nfor reading an alignment file is about # of CHROMOSOME * BUFFER_SIZE *\n8 Bytes. DEFAULT: 100000\n\n#### Output files\n\n1. `NAME_peaks.xls` is a tabular file which contains information about\n   called peaks. You can open it in excel and sort/filter using excel\n   functions. Information include:\n   \n    - chromosome name\n    - start position of peak\n    - end position of peak\n    - length of peak region\n    - absolute peak summit position\n    - pileup height at peak summit\n    - -log10(pvalue) for the peak summit (e.g. pvalue =1e-10, then\n      this value should be 10)\n    - fold enrichment for this peak summit against random Poisson\n      distribution with local lambda,\n    - -log10(qvalue) at peak summit\n   \n   Coordinates in XLS is 1-based which is different from BED\n   format. When `--broad` is enabled for broad peak calling, the\n   pileup, p-value, q-value, and fold change in the XLS file will be\n   the mean value across the entire peak region, since peak summit\n   won't be called in broad peak calling mode.\n\n2. `NAME_peaks.narrowPeak` is BED6+4 format file which contains the\n   peak locations together with peak summit, p-value, and q-value. You\n   can load it to the UCSC genome browser. Definition of some specific\n   columns are:\n   \n   - 5th: integer score for display. It's calculated as\n     `int(-10*log10pvalue)` or `int(-10*log10qvalue)` depending on\n     whether `-p` (pvalue) or `-q` (qvalue) is used as score\n     cutoff. Please note that currently this value might be out of the\n     [0-1000] range defined in [UCSC ENCODE narrowPeak\n     format](https://genome.ucsc.edu/FAQ/FAQformat.html#format12). You\n     can let the value saturated at 1000 (i.e. p/q-value = 10^-100) by\n     using the following 1-liner awk: `awk -v OFS=\"\\t\"\n     '{$5=$5>1000?1000:$5} {print}' NAME_peaks.narrowPeak`\n   - 7th: fold-change at peak summit\n   - 8th: -log10pvalue at peak summit\n   - 9th: -log10qvalue at peak summit\n   - 10th: relative summit position to peak start\n   \n   The file can be loaded directly to the UCSC genome browser. Remove\n   the beginning track line if you want to analyze it by other tools.\n\n3. `NAME_summits.bed` is in BED format, which contains the peak\n   summits locations for every peak. The 5th column in this file is\n   the same as what is in the `narrowPeak` file. If you want to find\n   the motifs at the binding sites, this file is recommended. The file\n   can be loaded directly to the UCSC genome browser. Remove the\n   beginning track line if you want to analyze it by other tools.\n\n4. `NAME_peaks.broadPeak` is in BED6+3 format which is similar to\n   `narrowPeak` file, except for missing the 10th column for\n   annotating peak summits. This file and the `gappedPeak` file will\n   only be available when `--broad` is enabled. Since in the broad\n   peak calling mode, the peak summit won't be called, the values in\n   the 5th, and 7-9th columns are the mean value across all positions\n   in the peak region. Refer to `narrowPeak` if you want to fix the\n   value issue in the 5th column.\n\n5. `NAME_peaks.gappedPeak` is in BED12+3 format which contains both\n   the broad region and narrow peaks. The 5th column is the score for\n   showing grey levels on the UCSC browser as in `narrowPeak`. The 7th\n   is the start of the first narrow peak in the region, and the 8th\n   column is the end. The 9th column should be RGB color key, however,\n   we keep 0 here to use the default color, so change it if you\n   want. The 10th column tells how many blocks including the starting\n   1bp and ending 1bp of broad regions. The 11th column shows the\n   length of each block and 12th for the start of each block. 13th:\n   fold-change, 14th: *-log10pvalue*, 15th: *-log10qvalue*. The file can\n   be loaded directly to the UCSC genome browser. Refer to\n   `narrowPeak` if you want to fix the value issue in the 5th column.\n\n6. `NAME_model.r` is an R script which you can use to produce a PDF\n   image of the model based on your data. Load it to R by:\n\n   `$ Rscript NAME_model.r`\n\n   Then a pdf file `NAME_model.pdf` will be generated in your current\n   directory. Note, R is required to draw this figure.\n\n7. The `NAME_treat_pileup.bdg` and `NAME_control_lambda.bdg` files are\n   in bedGraph format which can be imported to the UCSC genome browser\n   or be converted into even smaller bigWig files. The\n   `NAME_treat_pielup.bdg` contains the pileup signals (normalized\n   according to `--scale-to` option) from ChIP/treatment sample. The\n   `NAME_control_lambda.bdg` contains local biases estimated for each\n   genomic location from the control sample, or from treatment sample\n   when the control sample is absent. The subcommand `bdgcmp` can be\n   used to compare these two files and make a bedGraph file of scores\n   such as p-value, q-value, log-likelihood, and log fold changes.\n\n## Other useful links\n\n * [Cistrome](http://cistrome.org/ap/)\n * [bedTools](http://code.google.com/p/bedtools/)\n * [UCSC toolkits](http://hgdownload.cse.ucsc.edu/admin/exe/)\n\n## Tips of fine-tuning peak calling\n\nThere are several subcommands within MACSv2 package to fine-tune or\ncustomize your analysis:\n\n1. `bdgcmp` can be used on `*_treat_pileup.bdg` and\n   `*_control_lambda.bdg` or bedGraph files from other resources to\n   calculate the score track.\n\n2. `bdgpeakcall` can be used on `*_treat_pvalue.bdg` or the file\n   generated from bdgcmp or bedGraph file from other resources to call\n   peaks with given cutoff, maximum-gap between nearby mergeable peaks\n   and a minimum length of peak. bdgbroadcall works similarly to\n   bdgpeakcall, however, it will output `_broad_peaks.bed` in BED12\n   format.\n\n3. Differential calling tool -- `bdgdiff`, can be used on 4 bedGraph\n   files which are scores between treatment 1 and control 1, treatment\n   2 and control 2, treatment 1 and treatment 2, treatment 2 and\n   treatment 1. It will output consistent and unique sites according\n   to parameter settings for minimum length, the maximum gap and\n   cutoff.\n\n4. You can combine subcommands to do a step-by-step peak calling. Read\n   detail at [MACS2\n   wikipage](https://github.com/taoliu/MACS/wiki/Advanced%3A-Call-peaks-using-MACS2-subcommands)", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://github.com/taoliu/MACS/", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "MACS2", "package_url": "https://pypi.org/project/MACS2/", "platform": "", "project_url": "https://pypi.org/project/MACS2/", "project_urls": {"Homepage": "http://github.com/taoliu/MACS/"}, "release_url": "https://pypi.org/project/MACS2/2.2.7.1/", "requires_dist": null, "requires_python": ">=3.6", "summary": "Model Based Analysis for ChIP-Seq data", "version": "2.2.7.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>MACS: Model-based Analysis for ChIP-Seq</h1>\n<p><img alt=\"Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/0be0dde0d6edc44495ae2deb4635fe595f7e5310/68747470733a2f2f696d672e736869656c64732e696f2f707970692f7374617475732f6d616373322e737667\"> <a href=\"https://github.com/taoliu/MACS/blob/master/LICENSE\" rel=\"nofollow\"><img alt=\"License\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/f354b6ded5805eef4ea2cfae5852671fba8c7b1b/68747470733a2f2f696d672e736869656c64732e696f2f6769746875622f6c6963656e73652f74616f6c69752f4d414353\"></a> <img alt=\"Programming languages\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/bea93d9287cbaaf2f751b1504a8e8f544de78548/68747470733a2f2f696d672e736869656c64732e696f2f6769746875622f6c616e6775616765732f746f702f74616f6c69752f4d414353\"> <img alt=\"Commit activity\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/670817841eddc2de3fb23455482dc9a6b06a1440/68747470733a2f2f696d672e736869656c64732e696f2f6769746875622f636f6d6d69742d61637469766974792f6d2f74616f6c69752f4d414353\"> <a href=\"https://travis-ci.com/taoliu/MACS\" rel=\"nofollow\"><img alt=\"TravisCI Build Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8ecf5ab347150bf976d148e5e40dc5108c7da22d/68747470733a2f2f696d672e736869656c64732e696f2f7472617669732f636f6d2f74616f6c69752f4d4143532f6d6173746572\"></a></p>\n<p><a href=\"https://pypistats.org/packages/macs2\" rel=\"nofollow\"><img alt=\"PyPI download\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/fca5d27e7beceef03ea3cd5605ada9af727cd5fd/68747470733a2f2f696d672e736869656c64732e696f2f707970692f646d2f6d616373323f6c6162656c3d70797069253230646f776e6c6f616473\"></a> <a href=\"https://anaconda.org/bioconda/macs2\" rel=\"nofollow\"><img alt=\"Bioconda download\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/ba8d7cd7f75175a8acb3dc6c6b8e82f1c152dd33/68747470733a2f2f696d672e736869656c64732e696f2f636f6e64612f646e2f62696f636f6e64612f6d616373323f6c6162656c3d62696f636f6e6461253230646f776e6c6f616473\"></a></p>\n<p>Latest Release:</p>\n<ul>\n<li>Github: <a href=\"https://github.com/taoliu/MACS/releases\" rel=\"nofollow\"><img alt=\"Github Release\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/0f83735d0b9483c4125ee10e7598809756f6150b/68747470733a2f2f696d672e736869656c64732e696f2f6769746875622f762f72656c656173652f74616f6c69752f4d414353\"></a></li>\n<li>PyPI: <a href=\"https://pypi.org/project/macs2/\" rel=\"nofollow\"><img alt=\"PyPI Release\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/b31443b4fb8ede8465a5736d33b0d9252a9258d0/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f6d616373322e737667\"> <img alt=\"PyPI Python Version\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/9676cdf2d0319bb15058743eda111cf1bda7bb59/68747470733a2f2f696d672e736869656c64732e696f2f707970692f707976657273696f6e732f4d41435332\"> <img alt=\"PyPI Format\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/be5fe4ee0b71be3bfca14ada4c710989e38bef0b/68747470733a2f2f696d672e736869656c64732e696f2f707970692f666f726d61742f6d61637332\"></a></li>\n<li>Bioconda: <a href=\"https://anaconda.org/bioconda/macs2\" rel=\"nofollow\"><img alt=\"Bioconda Release\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/42dd36087ca5a3867384cd1e8565a2f11b701609/68747470733a2f2f696d672e736869656c64732e696f2f636f6e64612f762f62696f636f6e64612f6d61637332\"> <img alt=\"Bioconda Platform\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/4128671bbc8de8def7c08f4b361a8ce185eed7a5/68747470733a2f2f696d672e736869656c64732e696f2f636f6e64612f706e2f62696f636f6e64612f6d61637332\"></a></li>\n<li>Debian Med: <a href=\"https://packages.debian.org/stable/macs\" rel=\"nofollow\"><img alt=\"Debian Stable\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/882aa9593e9e1590e6c4306de8d4fa537c2814a0/68747470733a2f2f696d672e736869656c64732e696f2f64656269616e2f762f6d6163732f737461626c653f6c6162656c3d64656269616e253230737461626c65\"></a> <a href=\"https://packages.debian.org/sid/macs\" rel=\"nofollow\"><img alt=\"Debian Unstable\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/a36e17d18162605014b1c98a6ddb83ea229fb31d/68747470733a2f2f696d672e736869656c64732e696f2f64656269616e2f762f6d6163732f7369643f6c6162656c3d64656269616e253230736964\"></a></li>\n</ul>\n<h2>Introduction</h2>\n<p>With the improvement of sequencing techniques, chromatin\nimmunoprecipitation followed by high throughput sequencing (ChIP-Seq)\nis getting popular to study genome-wide protein-DNA interactions. To\naddress the lack of powerful ChIP-Seq analysis method, we presented\nthe <strong>M</strong>odel-based <strong>A</strong>nalysis of <strong>C</strong>hIP-<strong>S</strong>eq (MACS), for\nidentifying transcript factor binding sites. MACS captures the\ninfluence of genome complexity to evaluate the significance of\nenriched ChIP regions and MACS improves the spatial resolution of\nbinding sites through combining the information of both sequencing tag\nposition and orientation. MACS can be easily used for ChIP-Seq data\nalone, or with a control sample with the increase of\nspecificity. Moreover, as a general peak-caller, MACS can also be\napplied to any \"DNA enrichment assays\" if the question to be asked is\nsimply: <em>where we can find significant reads coverage than the random\nbackground</em>.</p>\n<h2>Recent Changes for MACS (2.2.7.1)</h2>\n<h3>2.2.7.1</h3>\n<pre><code>* hotfix: \n\nAdd 'wheel' and 'pip' to pyproject.toml so that `pip install` can \nwork.\n</code></pre>\n<h3>2.2.7</h3>\n<pre><code>* Bugs fixed\n\n1) MACS2 has been tested on multiple architectures to make sure it\ncan successfully generate consistent results. Currently the\nsupported architectures are: AMD64, ARM64, i386, PPC64LE, and\nS390X. Thanks to @mr-c, @junaruga, and @tillea! Related to issue\n#340, #349, #351, and #359; to PR #348, #350, #360, #361, #367,\nand #370. The lesson is that if the project is built on Cython and\nis aimed at memory efficiency, we should specifically define all\nint/float types in pyx files such as int8_t or uint32_t using\neither libc or numpy (c version) instead of relying on Cython\ntypes such as short, long, double.\n\n2) MACS2 setup script will check numpy and install numpy if\nnecessary. PR #378, issue #364\n\n3) `bdgbroadcall` command will correctly add the score column (5th\ncolumn). The score (5th) column contains 10 times of the average\nscore in the broad region. PR #373, issue #362\n\n4) The missing test on `bdgopt` subcommand has been added. PR #363\n\n5) The obsolete option `--ratio` from `callpeak` subcommand has\nbeen removed. PR #369, issue #366\n\n6) Fixed the incorrect description in README on the 'maximum\nlength of broad region is 4 times of d' to 'maximum gap for\nmerging broad regions is 4 times of tag size by default'. PR #380,\nissue #365.\n\n* Other\n\n1) CODE OF CONDUCT document has been added to MACS2 github\nrepository. PR #358\n</code></pre>\n<h3>2.2.6</h3>\n<pre><code>* New Features \n\n1) Speed up MACS2. Some programming tricks and code cleanup. The \nfilter_dup function replaces separate_dups. The later one was \nimplemented for potentially putting back duplicate reads in \ncertain downstream analysis. However such analysis hasn't been \nimplemented. Optimize speed of writing bedGraph files. Optimize \nBAM and BAMPE parsing with pointer casting instead of python \nunpack. \n\n2) The comment lines in the headers of BED or SAM files will be\ncorrectly skipped. However, MACS2 won't check comment lines in the\nmiddle of the file.\n\n* Bugs fixed \n\n1) Cutoff-analysis in callpeak command. #341\n\n2) Issues related to SAMParser and three ELAND Parsers are\nfixed. #347\n\n* Other \n\n1) cmdlinetest script in test/ folder has been updated to: 1. test \ncutoff-analysis with callpeak cmd; 2. output the 2 lines before \nand after the error or warning message during tests; 3. output \nonly the first 10 lines if the difference between test result and \nstandard result can be found; 4. prockreport monitor CPU time and \nmemory usage in 1 sec interval -- a bit more accurate.\n\n2) Python3.5 support is removed. Now MACS2 requires Python&gt;=3.6.\n</code></pre>\n<h2>Install</h2>\n<p>Please check the file 'INSTALL.md' in the distribution.</p>\n<h2>Usage</h2>\n<pre><code>macs2 [-h] [--version]\n    {callpeak,bdgpeakcall,bdgbroadcall,bdgcmp,bdgopt,cmbreps,bdgdiff,filterdup,predictd,pileup,randsample,refinepeak}\n</code></pre>\n<p>Example for regular peak calling: <code>macs2 callpeak -t ChIP.bam -c Control.bam -f BAM -g hs -n test -B -q 0.01</code></p>\n<p>Example for broad peak calling: <code>macs2 callpeak -t ChIP.bam -c Control.bam --broad -g hs --broad-cutoff 0.1</code></p>\n<p>There are twelve functions available in MAC2S serving as sub-commands.</p>\n<table>\n<thead>\n<tr>\n<th>Subcommand</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>callpeak</code></td>\n<td>Main MACS2 Function to call peaks from alignment results.</td>\n</tr>\n<tr>\n<td><code>bdgpeakcall</code></td>\n<td>Call peaks from bedGraph output.</td>\n</tr>\n<tr>\n<td><code>bdgbroadcall</code></td>\n<td>Call broad peaks from bedGraph output.</td>\n</tr>\n<tr>\n<td><code>bdgcmp</code></td>\n<td>Comparing two signal tracks in bedGraph format.</td>\n</tr>\n<tr>\n<td><code>bdgopt</code></td>\n<td>Operate the score column of bedGraph file.</td>\n</tr>\n<tr>\n<td><code>cmbreps</code></td>\n<td>Combine BEDGraphs of scores from replicates.</td>\n</tr>\n<tr>\n<td><code>bdgdiff</code></td>\n<td>Differential peak detection based on paired four bedGraph files.</td>\n</tr>\n<tr>\n<td><code>filterdup</code></td>\n<td>Remove duplicate reads, then save in BED/BEDPE format.</td>\n</tr>\n<tr>\n<td><code>predictd</code></td>\n<td>Predict d or fragment size from alignment results.</td>\n</tr>\n<tr>\n<td><code>pileup</code></td>\n<td>Pileup aligned reads (single-end) or fragments (paired-end)</td>\n</tr>\n<tr>\n<td><code>randsample</code></td>\n<td>Randomly choose a number/percentage of total reads.</td>\n</tr>\n<tr>\n<td><code>refinepeak</code></td>\n<td>Take raw reads alignment, refine peak summits.</td>\n</tr></tbody></table>\n<p>We only cover <code>callpeak</code> subcommand in this document. Please use\n<code>macs2 COMMAND -h</code> to see the detail description for each option of\neach subcommand.</p>\n<h3>Call peaks</h3>\n<p>This is the main function in MACS2. It can be invoked by <code>macs2 callpeak</code> . If you type this command with <code>-h</code>, you will see a full\ndescription of command-line options. Here we only list the essentials.</p>\n<h4>Essential Options</h4>\n<h5><code>-t</code>/<code>--treatment FILENAME</code></h5>\n<p>This is the only REQUIRED parameter for MACS. The file can be in any\nsupported format -- see detail in the <code>--format</code> option. If you have\nmore than one alignment file, you can specify them as <code>-t A B C</code>. MACS\nwill pool up all these files together.</p>\n<h5><code>-c</code>/<code>--control</code></h5>\n<p>The control, genomic input or mock IP data file. Please follow the\nsame direction as for <code>-t</code>/<code>--treatment</code>.</p>\n<h5><code>-n</code>/<code>--name</code></h5>\n<p>The name string of the experiment. MACS will use this string NAME to\ncreate output files like <code>NAME_peaks.xls</code>, <code>NAME_negative_peaks.xls</code>,\n<code>NAME_peaks.bed</code> , <code>NAME_summits.bed</code>, <code>NAME_model.r</code> and so on. So\nplease avoid any confliction between these filenames and your existing\nfiles.</p>\n<h5><code>--outdir</code></h5>\n<p>MACS2 will save all output files into the specified folder for this\noption. A new folder will be created if necessary.</p>\n<h5><code>-f</code>/<code>--format FORMAT</code></h5>\n<p>Format of tag file can be <code>ELAND</code>, <code>BED</code>, <code>ELANDMULTI</code>, <code>ELANDEXPORT</code>,\n<code>SAM</code>, <code>BAM</code>, <code>BOWTIE</code>, <code>BAMPE</code>, or <code>BEDPE</code>. Default is <code>AUTO</code> which\nwill allow MACS to decide the format automatically. <code>AUTO</code> is also\nuseful when you combine different formats of files. Note that MACS\ncan't detect <code>BAMPE</code> or <code>BEDPE</code> format with <code>AUTO</code>, and you have to\nimplicitly specify the format for <code>BAMPE</code> and <code>BEDPE</code>.</p>\n<p>Nowadays, the most common formats are <code>BED</code> or <code>BAM</code> (including\n<code>BEDPE</code> and <code>BAMPE</code>). Our recommendation is to convert your data to\n<code>BED</code> or <code>BAM</code> first.</p>\n<p>Also, MACS2 can detect and read gzipped file. For example, <code>.bed.gz</code>\nfile can be directly used without being uncompressed with <code>--format BED</code>.</p>\n<p>Here are detailed explanation of the recommanded formats:</p>\n<h6><code>BED</code></h6>\n<p>The BED format can be found at <a href=\"http://genome.ucsc.edu/FAQ/FAQformat#format1\" rel=\"nofollow\">UCSC genome browser\nwebsite</a>.</p>\n<p>The essential columns in BED format input are the 1st column\n<code>chromosome name</code>, the 2nd <code>start position</code>, the 3rd <code>end position</code>,\nand the 6th, <code>strand</code>.</p>\n<p>Note that, for <code>BED</code> format, the 6th column of strand information is\nrequired by MACS. And please pay attention that the coordinates in BED\nformat are zero-based and half-open. See more detail at\n<a href=\"http://genome.ucsc.edu/FAQ/FAQtracks#tracks1\" rel=\"nofollow\">UCSC site</a>.</p>\n<h6><code>BAM</code>/<code>SAM</code></h6>\n<p>If the format is <code>BAM</code>/<code>SAM</code>, please check the definition in\n(<a href=\"http://samtools.sourceforge.net/samtools.shtml\" rel=\"nofollow\">http://samtools.sourceforge.net/samtools.shtml</a>).  If the <code>BAM</code> file is\ngenerated for paired-end data, MACS will only keep the left mate(5'\nend) tag. However, when format <code>BAMPE</code> is specified, MACS will use the\nreal fragments inferred from alignment results for reads pileup.</p>\n<h6><code>BEDPE</code> or <code>BAMPE</code></h6>\n<p>A special mode will be triggered while the format is specified as\n<code>BAMPE</code> or <code>BEDPE</code>. In this way, MACS2 will process the <code>BAM</code> or <code>BED</code>\nfiles as paired-end data. Instead of building a bimodal distribution\nof plus and minus strand reads to predict fragment size, MACS2 will\nuse actual insert sizes of pairs of reads to build fragment pileup.</p>\n<p>The <code>BAMPE</code> format is just a <code>BAM</code> format containing paired-end alignment\ninformation, such as those from <code>BWA</code> or <code>BOWTIE</code>.</p>\n<p>The <code>BEDPE</code> format is a simplified and more flexible <code>BED</code> format,\nwhich only contains the first three columns defining the chromosome\nname, left and right position of the fragment from Paired-end\nsequencing. Please note, this is NOT the same format used by\n<code>BEDTOOLS</code>, and the <code>BEDTOOLS</code> version of <code>BEDPE</code> is actually not in a\nstandard <code>BED</code> format. You can use MACS2 subcommand <code>randsample</code> to\nconvert a <code>BAM</code> file containing paired-end information to a <code>BEDPE</code>\nformat file:</p>\n<pre><code>macs2 randsample -i the_BAMPE_file.bam -f BAMPE -p 100 -o the_BEDPE_file.bed\n</code></pre>\n<h5><code>-g</code>/<code>--gsize</code></h5>\n<p>PLEASE assign this parameter to fit your needs!</p>\n<p>It's the mappable genome size or effective genome size which is\ndefined as the genome size which can be sequenced. Because of the\nrepetitive features on the chromosomes, the actual mappable genome\nsize will be smaller than the original size, about 90% or 70% of the\ngenome size. The default <em>hs</em> -- 2.7e9 is recommended for human\ngenome. Here are all precompiled parameters for effective genome size:</p>\n<ul>\n<li>hs: 2.7e9</li>\n<li>mm: 1.87e9</li>\n<li>ce: 9e7</li>\n<li>dm: 1.2e8</li>\n</ul>\n<p>Users may want to use k-mer tools to simulate mapping of Xbps long\nreads to target genome, and to find the ideal effective genome\nsize. However, usually by taking away the simple repeats and Ns from\nthe total genome, one can get an approximate number of effective\ngenome size. A slight difference in the number won't cause a big\ndifference of peak calls, because this number is used to estimate a\ngenome-wide noise level which is usually the least significant one\ncompared with the <em>local biases</em> modeled by MACS.</p>\n<h5><code>-s</code>/<code>--tsize</code></h5>\n<p>The size of sequencing tags. If you don't specify it, MACS will try to\nuse the first 10 sequences from your input treatment file to determine\nthe tag size. Specifying it will override the automatically determined\ntag size.</p>\n<h5><code>-q</code>/<code>--qvalue</code></h5>\n<p>The q-value (minimum FDR) cutoff to call significant regions. Default\nis 0.05. For broad marks, you can try 0.05 as the cutoff. Q-values are\ncalculated from p-values using the Benjamini-Hochberg procedure.</p>\n<h5><code>-p</code>/<code>--pvalue</code></h5>\n<p>The p-value cutoff. If <code>-p</code> is specified, MACS2 will use p-value instead\nof q-value.</p>\n<h5><code>--min-length</code>, <code>--max-gap</code></h5>\n<p>These two options can be used to fine-tune the peak calling behavior\nby specifying the minimum length of a called peak and the maximum\nallowed a gap between two nearby regions to be merged. In other words,\na called peak has to be longer than <code>min-length</code>, and if the distance\nbetween two nearby peaks is smaller than <code>max-gap</code> then they will be\nmerged as one. If they are not set, MACS2 will set the DEFAULT value\nfor <code>min-length</code> as the predicted fragment size <code>d</code>, and the DEFAULT\nvalue for <code>max-gap</code> as the detected read length. Note, if you set a\n<code>min-length</code> value smaller than the fragment size, it may have NO\neffect on the result. For broad peak calling with <code>--broad</code> option\nset, the DEFAULT <code>max-gap</code> for merging nearby stronger peaks will be\nthe same as narrow peak calling, and 4 times of the <code>max-gap</code> will be\nused to merge nearby weaker (broad) peaks. You can also use\n<code>--cutoff-analysis</code> option with the default setting, and check the\ncolumn <code>avelpeak</code> under different cutoff values to decide a reasonable\n<code>min-length</code> value.</p>\n<h5><code>--nolambda</code></h5>\n<p>With this flag on, MACS will use the background lambda as local\nlambda. This means MACS will not consider the local bias at peak\ncandidate regions.</p>\n<h5><code>--slocal</code>, <code>--llocal</code></h5>\n<p>These two parameters control which two levels of regions will be\nchecked around the peak regions to calculate the maximum lambda as\nlocal lambda. By default, MACS considers 1000bp for small local\nregion(<code>--slocal</code>), and 10000bps for large local region(<code>--llocal</code>)\nwhich captures the bias from a long-range effect like an open\nchromatin domain. You can tweak these according to your\nproject. Remember that if the region is set too small, a sharp spike\nin the input data may kill a significant peak.</p>\n<h5><code>--nomodel</code></h5>\n<p>While on, MACS will bypass building the shifting model.</p>\n<h5><code>--extsize</code></h5>\n<p>While <code>--nomodel</code> is set, MACS uses this parameter to extend reads in\n5'-&gt;3' direction to fix-sized fragments. For example, if the size of\nthe binding region for your transcription factor is 200 bp, and you\nwant to bypass the model building by MACS, this parameter can be set\nas 200. This option is only valid when <code>--nomodel</code> is set or when MACS\nfails to build model and <code>--fix-bimodal</code> is on.</p>\n<h5><code>--shift</code></h5>\n<p>Note, this is NOT the legacy <code>--shiftsize</code> option which is replaced by\n<code>--extsize</code>! You can set an arbitrary shift in bp here. Please Use\ndiscretion while setting it other than the default value (0). When\n<code>--nomodel</code> is set, MACS will use this value to move cutting ends (5')\nthen apply <code>--extsize</code> from 5' to 3' direction to extend them to\nfragments. When this value is negative, ends will be moved toward\n3'-&gt;5' direction, otherwise 5'-&gt;3' direction. Recommended to keep it\nas default 0 for ChIP-Seq datasets, or -1 * half of <em>EXTSIZE</em> together\nwith <code>--extsize</code> option for detecting enriched cutting loci such as\ncertain DNAseI-Seq datasets. Note, you can't set values other than 0\nif the format is BAMPE or BEDPE for paired-end data. The default is 0.</p>\n<p>Here are some examples for combining <code>--shift</code> and <code>--extsize</code>:</p>\n<ol>\n<li>\n<p>To find enriched cutting sites such as some DNAse-Seq datasets. In\nthis case, all 5' ends of sequenced reads should be extended in both\ndirections to smooth the pileup signals. If the wanted smoothing\nwindow is 200bps, then use <code>--nomodel --shift -100 --extsize 200</code>.</p>\n</li>\n<li>\n<p>For certain nucleosome-seq data, we need to pile up the centers of\nnucleosomes using a half-nucleosome size for wavelet analysis\n(e.g. NPS algorithm). Since the DNA wrapped on nucleosome is about\n147bps, this option can be used: <code>--nomodel --shift 37 --extsize 73</code>.</p>\n</li>\n</ol>\n<h5><code>--keep-dup</code></h5>\n<p>It controls the MACS behavior towards duplicate tags at the exact same\nlocation -- the same coordination and the same strand. The default\n<code>auto</code> option makes MACS calculate the maximum tags at the exact same\nlocation based on binomial distribution using 1e-5 as p-value cutoff;\nand the <code>all</code> option keeps every tag.  If an integer is given, at most\nthis number of tags will be kept at the same location. The default is\nto keep one tag at the same location. Default: 1</p>\n<h5><code>--broad</code></h5>\n<p>When this flag is on, MACS will try to composite broad regions in\nBED12 ( a gene-model-like format ) by putting nearby highly enriched\nregions into a broad region with loose cutoff. The broad region is\ncontrolled by another cutoff through <code>--broad-cutoff</code>. Please note\nthat, the <code>max-gap</code> value for merging nearby weaker/broad peaks is 4\ntimes of <code>max-gap</code> for merging nearby stronger peaks. The later one\ncan be controlled by <code>--max-gap</code> option, and by default it is the\naverage fragment/insertion length in the PE data. DEFAULT: False</p>\n<h5><code>--broad-cutoff</code></h5>\n<p>Cutoff for the broad region. This option is not available unless\n<code>--broad</code> is set. If <code>-p</code> is set, this is a p-value cutoff, otherwise,\nit's a q-value cutoff.  DEFAULT: 0.1</p>\n<h5><code>--scale-to &lt;large|small&gt;</code></h5>\n<p>When set to <code>large</code>, linearly scale the smaller dataset to the same\ndepth as the larger dataset. By default or being set as <code>small</code>, the\nlarger dataset will be scaled towards the smaller dataset. Beware, to\nscale up small data would cause more false positives.</p>\n<h5><code>-B</code>/<code>--bdg</code></h5>\n<p>If this flag is on, MACS will store the fragment pileup, control\nlambda in bedGraph files. The bedGraph files will be stored in the\ncurrent directory named <code>NAME_treat_pileup.bdg</code> for treatment data,\n<code>NAME_control_lambda.bdg</code> for local lambda values from control.</p>\n<h5><code>--call-summits</code></h5>\n<p>MACS will now reanalyze the shape of signal profile (p or q-score\ndepending on the cutoff setting) to deconvolve subpeaks within each\npeak called from the general procedure. It's highly recommended to\ndetect adjacent binding events. While used, the output subpeaks of a\nbig peak region will have the same peak boundaries, and different\nscores and peak summit positions.</p>\n<h5><code>--buffer-size</code></h5>\n<p>MACS uses a buffer size for incrementally increasing internal array\nsize to store reads alignment information for each chromosome or\ncontig. To increase the buffer size, MACS can run faster but will\nwaste more memory if certain chromosome/contig only has very few\nreads. In most cases, the default value 100000 works fine. However, if\nthere are a large number of chromosomes/contigs in your alignment and\nreads per chromosome/contigs are few, it's recommended to specify a\nsmaller buffer size in order to decrease memory usage (but it will\ntake longer time to read alignment files). Minimum memory requested\nfor reading an alignment file is about # of CHROMOSOME * BUFFER_SIZE *\n8 Bytes. DEFAULT: 100000</p>\n<h4>Output files</h4>\n<ol>\n<li>\n<p><code>NAME_peaks.xls</code> is a tabular file which contains information about\ncalled peaks. You can open it in excel and sort/filter using excel\nfunctions. Information include:</p>\n<ul>\n<li>chromosome name</li>\n<li>start position of peak</li>\n<li>end position of peak</li>\n<li>length of peak region</li>\n<li>absolute peak summit position</li>\n<li>pileup height at peak summit</li>\n<li>-log10(pvalue) for the peak summit (e.g. pvalue =1e-10, then\nthis value should be 10)</li>\n<li>fold enrichment for this peak summit against random Poisson\ndistribution with local lambda,</li>\n<li>-log10(qvalue) at peak summit</li>\n</ul>\n<p>Coordinates in XLS is 1-based which is different from BED\nformat. When <code>--broad</code> is enabled for broad peak calling, the\npileup, p-value, q-value, and fold change in the XLS file will be\nthe mean value across the entire peak region, since peak summit\nwon't be called in broad peak calling mode.</p>\n</li>\n<li>\n<p><code>NAME_peaks.narrowPeak</code> is BED6+4 format file which contains the\npeak locations together with peak summit, p-value, and q-value. You\ncan load it to the UCSC genome browser. Definition of some specific\ncolumns are:</p>\n<ul>\n<li>5th: integer score for display. It's calculated as\n<code>int(-10*log10pvalue)</code> or <code>int(-10*log10qvalue)</code> depending on\nwhether <code>-p</code> (pvalue) or <code>-q</code> (qvalue) is used as score\ncutoff. Please note that currently this value might be out of the\n[0-1000] range defined in <a href=\"https://genome.ucsc.edu/FAQ/FAQformat.html#format12\" rel=\"nofollow\">UCSC ENCODE narrowPeak\nformat</a>. You\ncan let the value saturated at 1000 (i.e. p/q-value = 10^-100) by\nusing the following 1-liner awk: <code>awk -v OFS=\"\\t\" '{$5=$5&gt;1000?1000:$5} {print}' NAME_peaks.narrowPeak</code></li>\n<li>7th: fold-change at peak summit</li>\n<li>8th: -log10pvalue at peak summit</li>\n<li>9th: -log10qvalue at peak summit</li>\n<li>10th: relative summit position to peak start</li>\n</ul>\n<p>The file can be loaded directly to the UCSC genome browser. Remove\nthe beginning track line if you want to analyze it by other tools.</p>\n</li>\n<li>\n<p><code>NAME_summits.bed</code> is in BED format, which contains the peak\nsummits locations for every peak. The 5th column in this file is\nthe same as what is in the <code>narrowPeak</code> file. If you want to find\nthe motifs at the binding sites, this file is recommended. The file\ncan be loaded directly to the UCSC genome browser. Remove the\nbeginning track line if you want to analyze it by other tools.</p>\n</li>\n<li>\n<p><code>NAME_peaks.broadPeak</code> is in BED6+3 format which is similar to\n<code>narrowPeak</code> file, except for missing the 10th column for\nannotating peak summits. This file and the <code>gappedPeak</code> file will\nonly be available when <code>--broad</code> is enabled. Since in the broad\npeak calling mode, the peak summit won't be called, the values in\nthe 5th, and 7-9th columns are the mean value across all positions\nin the peak region. Refer to <code>narrowPeak</code> if you want to fix the\nvalue issue in the 5th column.</p>\n</li>\n<li>\n<p><code>NAME_peaks.gappedPeak</code> is in BED12+3 format which contains both\nthe broad region and narrow peaks. The 5th column is the score for\nshowing grey levels on the UCSC browser as in <code>narrowPeak</code>. The 7th\nis the start of the first narrow peak in the region, and the 8th\ncolumn is the end. The 9th column should be RGB color key, however,\nwe keep 0 here to use the default color, so change it if you\nwant. The 10th column tells how many blocks including the starting\n1bp and ending 1bp of broad regions. The 11th column shows the\nlength of each block and 12th for the start of each block. 13th:\nfold-change, 14th: <em>-log10pvalue</em>, 15th: <em>-log10qvalue</em>. The file can\nbe loaded directly to the UCSC genome browser. Refer to\n<code>narrowPeak</code> if you want to fix the value issue in the 5th column.</p>\n</li>\n<li>\n<p><code>NAME_model.r</code> is an R script which you can use to produce a PDF\nimage of the model based on your data. Load it to R by:</p>\n<p><code>$ Rscript NAME_model.r</code></p>\n<p>Then a pdf file <code>NAME_model.pdf</code> will be generated in your current\ndirectory. Note, R is required to draw this figure.</p>\n</li>\n<li>\n<p>The <code>NAME_treat_pileup.bdg</code> and <code>NAME_control_lambda.bdg</code> files are\nin bedGraph format which can be imported to the UCSC genome browser\nor be converted into even smaller bigWig files. The\n<code>NAME_treat_pielup.bdg</code> contains the pileup signals (normalized\naccording to <code>--scale-to</code> option) from ChIP/treatment sample. The\n<code>NAME_control_lambda.bdg</code> contains local biases estimated for each\ngenomic location from the control sample, or from treatment sample\nwhen the control sample is absent. The subcommand <code>bdgcmp</code> can be\nused to compare these two files and make a bedGraph file of scores\nsuch as p-value, q-value, log-likelihood, and log fold changes.</p>\n</li>\n</ol>\n<h2>Other useful links</h2>\n<ul>\n<li><a href=\"http://cistrome.org/ap/\" rel=\"nofollow\">Cistrome</a></li>\n<li><a href=\"http://code.google.com/p/bedtools/\" rel=\"nofollow\">bedTools</a></li>\n<li><a href=\"http://hgdownload.cse.ucsc.edu/admin/exe/\" rel=\"nofollow\">UCSC toolkits</a></li>\n</ul>\n<h2>Tips of fine-tuning peak calling</h2>\n<p>There are several subcommands within MACSv2 package to fine-tune or\ncustomize your analysis:</p>\n<ol>\n<li>\n<p><code>bdgcmp</code> can be used on <code>*_treat_pileup.bdg</code> and\n<code>*_control_lambda.bdg</code> or bedGraph files from other resources to\ncalculate the score track.</p>\n</li>\n<li>\n<p><code>bdgpeakcall</code> can be used on <code>*_treat_pvalue.bdg</code> or the file\ngenerated from bdgcmp or bedGraph file from other resources to call\npeaks with given cutoff, maximum-gap between nearby mergeable peaks\nand a minimum length of peak. bdgbroadcall works similarly to\nbdgpeakcall, however, it will output <code>_broad_peaks.bed</code> in BED12\nformat.</p>\n</li>\n<li>\n<p>Differential calling tool -- <code>bdgdiff</code>, can be used on 4 bedGraph\nfiles which are scores between treatment 1 and control 1, treatment\n2 and control 2, treatment 1 and treatment 2, treatment 2 and\ntreatment 1. It will output consistent and unique sites according\nto parameter settings for minimum length, the maximum gap and\ncutoff.</p>\n</li>\n<li>\n<p>You can combine subcommands to do a step-by-step peak calling. Read\ndetail at <a href=\"https://github.com/taoliu/MACS/wiki/Advanced%3A-Call-peaks-using-MACS2-subcommands\" rel=\"nofollow\">MACS2\nwikipage</a></p>\n</li>\n</ol>\n\n          </div>"}, "last_serial": 7002241, "releases": {"2.0.10.07022012": [{"comment_text": "", "digests": {"md5": "fb00939e3df2e7b1bddc5a25424668f4", "sha256": "94b873eff9673c3d8ff1328f325ce5d17d6b9165034eb5b9454a4bd9f076063a"}, "downloads": -1, "filename": "MACS2-2.0.10.07022012.tar.gz", "has_sig": true, "md5_digest": "fb00939e3df2e7b1bddc5a25424668f4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1300028, "upload_time": "2012-07-02T23:59:10", "upload_time_iso_8601": "2012-07-02T23:59:10.353802Z", "url": "https://files.pythonhosted.org/packages/97/eb/16ab1371acf41cfcd8b034d4155150c1684ae10273a8a8942c9f7f1192b0/MACS2-2.0.10.07022012.tar.gz", "yanked": false}], "2.0.10.07032012": [{"comment_text": "", "digests": {"md5": "45abbafb9d1d891b05c77c42d7d81f3f", "sha256": "798e2d3886b07ff9d63d75a14d765820b3ca321b52e94403155e4e710e974647"}, "downloads": -1, "filename": "MACS2-2.0.10.07032012.tar.gz", "has_sig": false, "md5_digest": "45abbafb9d1d891b05c77c42d7d81f3f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1263481, "upload_time": "2012-07-03T21:12:50", "upload_time_iso_8601": "2012-07-03T21:12:50.183373Z", "url": "https://files.pythonhosted.org/packages/8f/ec/d516281c1dbcf986e87a85a7531bfd5fab7e9dcb8be447c6bfc061004436/MACS2-2.0.10.07032012.tar.gz", "yanked": false}], "2.0.10.07132012": [{"comment_text": "", "digests": {"md5": "7cec7f629b3633ff2cf221a2feeb153a", "sha256": "9c7c004c63e5a3c272ad25df34dcdecdc9991d02ad363910f2f4310bd5091f89"}, "downloads": -1, "filename": "MACS2-2.0.10.07132012.tar.gz", "has_sig": true, "md5_digest": "7cec7f629b3633ff2cf221a2feeb153a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1295440, "upload_time": "2012-07-13T15:46:00", "upload_time_iso_8601": "2012-07-13T15:46:00.557898Z", "url": "https://files.pythonhosted.org/packages/5c/3d/b5f84a98527a4c781c4d6c35c5fede1fc56822f72ce18d216f961cf38970/MACS2-2.0.10.07132012.tar.gz", "yanked": false}], "2.0.10.08012012": [{"comment_text": "", "digests": {"md5": "14ffc909763f9979d7910fc053a55ff2", "sha256": "61325ec77b58458a2dfd83cf037b60847135fc3f25cea5676af320ee6b7676a6"}, "downloads": -1, "filename": "MACS2-2.0.10.08012012.tar.gz", "has_sig": true, "md5_digest": "14ffc909763f9979d7910fc053a55ff2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1326863, "upload_time": "2012-08-02T14:08:56", "upload_time_iso_8601": "2012-08-02T14:08:56.929983Z", "url": "https://files.pythonhosted.org/packages/f0/04/3715985363054f94ec518d8b14ece55c97fef57d468c8073a25cd92b9fe1/MACS2-2.0.10.08012012.tar.gz", "yanked": false}], "2.0.10.09132012": [{"comment_text": "", "digests": {"md5": "c0ff701a885ec214a6aada32e0d7a38d", "sha256": "3b59b0f3434e5b0633259bdccd7c7dec5552ecc2e6c810d732c64bfe118f2e82"}, "downloads": -1, "filename": "MACS2-2.0.10.09132012.tar.gz", "has_sig": true, "md5_digest": "c0ff701a885ec214a6aada32e0d7a38d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1275347, "upload_time": "2012-09-14T10:22:10", "upload_time_iso_8601": "2012-09-14T10:22:10.981949Z", "url": "https://files.pythonhosted.org/packages/55/16/11b3344cb893a91e453352fe91d7626bb7404f375db73a7492c505e8f3ce/MACS2-2.0.10.09132012.tar.gz", "yanked": false}], "2.0.10.20130306": [{"comment_text": "", "digests": {"md5": "4c8e8f137a65f71993ad5ad16de357e4", "sha256": "64f3cbdaf5d4ce69af9aa72cc27cc6fba11955f1a5dcd298547fe7a9da14b513"}, "downloads": -1, "filename": "MACS2-2.0.10.20130306.tar.gz", "has_sig": false, "md5_digest": "4c8e8f137a65f71993ad5ad16de357e4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1527131, "upload_time": "2013-03-05T22:16:08", "upload_time_iso_8601": "2013-03-05T22:16:08.368349Z", "url": "https://files.pythonhosted.org/packages/b5/7c/5d90977998cc1ea09e2d92dfebd414825eca94787cb24676b279d122df0a/MACS2-2.0.10.20130306.tar.gz", "yanked": false}], "2.0.10.20130419": [{"comment_text": "", "digests": {"md5": "a52dda333525f25eeccf268843edb09b", "sha256": "253367825bf1f37c5a5743b98e81e27cc8c15d3e05761cd0fec695d6fb9b47e9"}, "downloads": -1, "filename": "MACS2-2.0.10.20130419.tar.gz", "has_sig": false, "md5_digest": "a52dda333525f25eeccf268843edb09b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1671698, "upload_time": "2013-04-19T20:01:56", "upload_time_iso_8601": "2013-04-19T20:01:56.796625Z", "url": "https://files.pythonhosted.org/packages/22/93/2be46e1bf7d227be9d04f5342b13cb1ccf6af5a78e59b9b6add0b1c21cc2/MACS2-2.0.10.20130419.tar.gz", "yanked": false}], "2.0.10.20130501": [{"comment_text": "", "digests": {"md5": "675f96ca31d3bd07138b690bc479c5de", "sha256": "5c7332d4082c0813ec364208ab3837039afc39867e8429b91d81eaae595dee52"}, "downloads": -1, "filename": "MACS2-2.0.10.20130501.tar.gz", "has_sig": false, "md5_digest": "675f96ca31d3bd07138b690bc479c5de", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1674236, "upload_time": "2013-05-01T21:24:05", "upload_time_iso_8601": "2013-05-01T21:24:05.077725Z", "url": "https://files.pythonhosted.org/packages/71/ca/e1862ad6272b7874ee5573f6db0683be403e1bfa74b3d885ac1b70d250ba/MACS2-2.0.10.20130501.tar.gz", "yanked": false}], "2.0.10.20130522": [{"comment_text": "", "digests": {"md5": "d0894f0dd0324095692153cbc1610ee5", "sha256": "e6c0c22282961d02f418a7b9b880b197bf99ee1dffecf766d8f5e809e3fe058a"}, "downloads": -1, "filename": "MACS2-2.0.10.20130522.tar.gz", "has_sig": true, "md5_digest": "d0894f0dd0324095692153cbc1610ee5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1675208, "upload_time": "2013-05-22T21:49:19", "upload_time_iso_8601": "2013-05-22T21:49:19.005165Z", "url": "https://files.pythonhosted.org/packages/ad/c2/49a67a1df86db77c97cd035db0ac72a2bb7c42e25815cd8d7c18d61fc95f/MACS2-2.0.10.20130522.tar.gz", "yanked": false}], "2.0.10.20130528": [{"comment_text": "", "digests": {"md5": "fa22cb8c47edf59883c1e19bd153e3a3", "sha256": "d2dc851f3a5bfcdcd3c55ac047d3706f33e20a5aa3889be638a5e25a2c7de6ce"}, "downloads": -1, "filename": "MACS2-2.0.10.20130528.tar.gz", "has_sig": true, "md5_digest": "fa22cb8c47edf59883c1e19bd153e3a3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1678801, "upload_time": "2013-05-28T04:29:24", "upload_time_iso_8601": "2013-05-28T04:29:24.627895Z", "url": "https://files.pythonhosted.org/packages/cb/bb/c4459d8ee4177fa42ce46ab4b71906f590da423136013ab7797b8d997750/MACS2-2.0.10.20130528.tar.gz", "yanked": false}], "2.0.10.20130710": [], "2.0.10.20130712": [{"comment_text": "", "digests": {"md5": "63f9c35a3a4d82b2bbf5fc35c12ffb5f", "sha256": "d1b1e6d7689e98cbc00063a67104b52b99fd40585c358b1fd31aa66d31c947e9"}, "downloads": -1, "filename": "MACS2-2.0.10.20130712.tar.gz", "has_sig": true, "md5_digest": "63f9c35a3a4d82b2bbf5fc35c12ffb5f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1633234, "upload_time": "2013-07-12T20:27:40", "upload_time_iso_8601": "2013-07-12T20:27:40.477586Z", "url": "https://files.pythonhosted.org/packages/2c/23/ce1c463950b8827993b7881d0d80f2516bf4d70eda7538a37b00fbae38c8/MACS2-2.0.10.20130712.tar.gz", "yanked": false}], "2.0.10.20130713": [{"comment_text": "", "digests": {"md5": "2a2763f123d10cc3ae9d22866035334e", "sha256": "cba92777908e0a321bd4efb1c48edd0734cca6011e0873d1531e0782db332c03"}, "downloads": -1, "filename": "MACS2-2.0.10.20130713.tar.gz", "has_sig": false, "md5_digest": "2a2763f123d10cc3ae9d22866035334e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1633494, "upload_time": "2013-07-13T21:47:54", "upload_time_iso_8601": "2013-07-13T21:47:54.741267Z", "url": "https://files.pythonhosted.org/packages/24/5a/c56ce76bb5cb341e8461c80b08822287404c9f1d8778d58f518fd8d7458b/MACS2-2.0.10.20130713.tar.gz", "yanked": false}], "2.0.10.20130731": [{"comment_text": "", "digests": {"md5": "aa0c5e7635f15fef02566e7b8d72dc5d", "sha256": "4c47c772c27f55ed8d4d41d69ae59e02947e2ce0cd27bf9dbb1534e411257205"}, "downloads": -1, "filename": "MACS2-2.0.10.20130731.tar.gz", "has_sig": true, "md5_digest": "aa0c5e7635f15fef02566e7b8d72dc5d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1616496, "upload_time": "2013-07-31T21:19:29", "upload_time_iso_8601": "2013-07-31T21:19:29.579880Z", "url": "https://files.pythonhosted.org/packages/72/dd/ea5c9a26b9aab78e1761d2224f660b000e81dc77ebdb7745fbd88b5c370c/MACS2-2.0.10.20130731.tar.gz", "yanked": false}], "2.0.10.20130915": [{"comment_text": "", "digests": {"md5": "9af7e511adbd3cc8d0aadcfa8f05753f", "sha256": "d7fc9aef8ad9a016f83594ef94b66057bf14db6120464aa147b579c964219694"}, "downloads": -1, "filename": "MACS2-2.0.10.20130915.tar.gz", "has_sig": true, "md5_digest": "9af7e511adbd3cc8d0aadcfa8f05753f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1716562, "upload_time": "2013-09-16T04:25:48", "upload_time_iso_8601": "2013-09-16T04:25:48.057751Z", "url": "https://files.pythonhosted.org/packages/77/e6/a9359886dfe8efad681ef344d7ad296c29f6dcb10319767e28ba5edecce8/MACS2-2.0.10.20130915.tar.gz", "yanked": false}], "2.0.10.20130915.1": [{"comment_text": "", "digests": {"md5": "87e35cfaf8dced28ae05a4b378cc933c", "sha256": "4d407c5c68df446af9a391cc459b26eea5ad34e1a24fd3dbfbbabc7867baa8e8"}, "downloads": -1, "filename": "MACS2-2.0.10.20130915.1.tar.gz", "has_sig": true, "md5_digest": "87e35cfaf8dced28ae05a4b378cc933c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1716578, "upload_time": "2013-10-18T17:36:36", "upload_time_iso_8601": "2013-10-18T17:36:36.378983Z", "url": "https://files.pythonhosted.org/packages/0a/e0/6f67146cf48667f081dcfcc748db6bd050978b4a671923382ec39f5aa397/MACS2-2.0.10.20130915.1.tar.gz", "yanked": false}], "2.0.10.20131028": [{"comment_text": "", "digests": {"md5": "f594ff1c781b65c3d5aee021f486a924", "sha256": "dcf33eb9246bec532b16917ac589650765d9f7e887c9a60f61b77a874bdbf782"}, "downloads": -1, "filename": "MACS2-2.0.10.20131028.tar.gz", "has_sig": true, "md5_digest": "f594ff1c781b65c3d5aee021f486a924", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1678764, "upload_time": "2013-10-28T17:49:57", "upload_time_iso_8601": "2013-10-28T17:49:57.021054Z", "url": "https://files.pythonhosted.org/packages/e9/be/1ea67c6fe686c316b872095aaea06f5b7333028a9634ef5729ff67ab9f60/MACS2-2.0.10.20131028.tar.gz", "yanked": false}], "2.0.10.20131216": [{"comment_text": "", "digests": {"md5": "930bfb0711ca289ce56cf7943d838120", "sha256": "94eae03db7f0ff205d0a43396d1b9cc2d0a4a7e87d2fccc6b0a9de7fb7ac55d0"}, "downloads": -1, "filename": "MACS2-2.0.10.20131216.tar.gz", "has_sig": true, "md5_digest": "930bfb0711ca289ce56cf7943d838120", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1679498, "upload_time": "2013-12-16T22:08:25", "upload_time_iso_8601": "2013-12-16T22:08:25.255868Z", "url": "https://files.pythonhosted.org/packages/5b/6c/97baee507d9b8c6d8b85b58de519b711e63834a3149cd11dea5b5992c0dc/MACS2-2.0.10.20131216.tar.gz", "yanked": false}], "2.1.0.20140616": [{"comment_text": "", "digests": {"md5": "ad105b9ad25bc2eedc78c38d54cf76e8", "sha256": "c68a58d3cb6861d7535feee591819853e43c1d252f15abcbb11ce2ad0c8f9586"}, "downloads": -1, "filename": "MACS2-2.1.0.20140616.tar.gz", "has_sig": true, "md5_digest": "ad105b9ad25bc2eedc78c38d54cf76e8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1463830, "upload_time": "2014-06-17T21:10:58", "upload_time_iso_8601": "2014-06-17T21:10:58.484475Z", "url": "https://files.pythonhosted.org/packages/19/95/b29a5a5c2d367d0224d500d99272e81f88beb32519f55f0bfe6bf214c59e/MACS2-2.1.0.20140616.tar.gz", "yanked": false}], "2.1.0.20150420": [{"comment_text": "", "digests": {"md5": "8d4de2f6fb66049e48aee27da8ef62a6", "sha256": "5c651eff72f0c2376fbe843e55e593b1062451cff29185f24792bbda6db2fdfe"}, "downloads": -1, "filename": "MACS2-2.1.0.20150420.1.tar.gz", "has_sig": true, "md5_digest": "8d4de2f6fb66049e48aee27da8ef62a6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1622106, "upload_time": "2015-04-20T19:59:51", "upload_time_iso_8601": "2015-04-20T19:59:51.773605Z", "url": "https://files.pythonhosted.org/packages/9d/29/5b124ca66b50887481d3a4b49496d6e6e507a7138a749ed5695b64c5b836/MACS2-2.1.0.20150420.1.tar.gz", "yanked": false}], "2.1.0.20150731": [{"comment_text": "", "digests": {"md5": "026a210b967e28e10e220d61744c82f0", "sha256": "5c87df78a89b15b2c3c8be54ce8216e3e0e28ffd1025d437697102016a64db8b"}, "downloads": -1, "filename": "MACS2-2.1.0.20150731.tar.gz", "has_sig": true, "md5_digest": "026a210b967e28e10e220d61744c82f0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1625059, "upload_time": "2015-07-31T18:56:51", "upload_time_iso_8601": "2015-07-31T18:56:51.199805Z", "url": "https://files.pythonhosted.org/packages/fe/f8/bfab8659c4ff13aba6cd9589b8b3db2c36336305fd32f315b644ab4588e7/MACS2-2.1.0.20150731.tar.gz", "yanked": false}], "2.1.0.20151222": [{"comment_text": "", "digests": {"md5": "fac0ba7aa45313077fc6ba3846babb3b", "sha256": "a52337a5a3d57073ad6ceb6d55c08664d82551d2533ab5383d98c11ccd6750e4"}, "downloads": -1, "filename": "MACS2-2.1.0.20151222.tar.gz", "has_sig": false, "md5_digest": "fac0ba7aa45313077fc6ba3846babb3b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1624971, "upload_time": "2015-12-22T21:25:10", "upload_time_iso_8601": "2015-12-22T21:25:10.143250Z", "url": "https://files.pythonhosted.org/packages/c7/95/17a3caa3c71ebee26c5153086c1d1693f7ffe94f7cca0f44d309d277ca02/MACS2-2.1.0.20151222.tar.gz", "yanked": false}], "2.1.1.20160226": [{"comment_text": "", "digests": {"md5": "e03fa04db52ec793dcc57a1d51f7c1e2", "sha256": "413c903cc9649cee7089f9adb5bdab5705b31536ca00d01addefe96e5e315a35"}, "downloads": -1, "filename": "MACS2-2.1.1.20160226.tar.gz", "has_sig": true, "md5_digest": "e03fa04db52ec793dcc57a1d51f7c1e2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1616613, "upload_time": "2016-02-26T15:58:10", "upload_time_iso_8601": "2016-02-26T15:58:10.195672Z", "url": "https://files.pythonhosted.org/packages/0f/e9/60761f3df0634a50a96531fdb00f45dd3a6f3aa2509fb722eb2a665faf35/MACS2-2.1.1.20160226.tar.gz", "yanked": false}], "2.1.1.20160309": [{"comment_text": "", "digests": {"md5": "1cc2fab44b232992060c7ab592bf43fa", "sha256": "2008ba838f83f34f8e0fddefe2a3a0159f4a740707c68058f815b31ddad53d26"}, "downloads": -1, "filename": "MACS2-2.1.1.20160309.tar.gz", "has_sig": true, "md5_digest": "1cc2fab44b232992060c7ab592bf43fa", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1627509, "upload_time": "2016-03-09T20:32:17", "upload_time_iso_8601": "2016-03-09T20:32:17.941058Z", "url": "https://files.pythonhosted.org/packages/9f/99/a8ac96b357f6b0a6f559fe0f5a81bcae12b98579551620ce07c5183aee2c/MACS2-2.1.1.20160309.tar.gz", "yanked": false}], "2.1.2": [{"comment_text": "", "digests": {"md5": "0d466e887cb29fade7c1557409673a5f", "sha256": "6ee9381bda61bacf65e2e31bde267cbcd61a1304457f8a00a0eb7632dd12419b"}, "downloads": -1, "filename": "MACS2-2.1.2.1.tar.gz", "has_sig": false, "md5_digest": "0d466e887cb29fade7c1557409673a5f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1590175, "upload_time": "2018-10-18T04:22:07", "upload_time_iso_8601": "2018-10-18T04:22:07.800072Z", "url": "https://files.pythonhosted.org/packages/5e/32/0108a85d9a91c18413e8492bea631725cdbc20b45970ef63e8d0020ef2da/MACS2-2.1.2.1.tar.gz", "yanked": false}], "2.1.3": [{"comment_text": "", "digests": {"md5": "b2fc83a7df84adb9ec1a3f85735d0788", "sha256": "9129549b9e0fa0b73d8d0c9f0703fa8020b4f1ac6dcf47cede27c34089987e34"}, "downloads": -1, "filename": "MACS2-2.1.3.tar.gz", "has_sig": false, "md5_digest": "b2fc83a7df84adb9ec1a3f85735d0788", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 178488, "upload_time": "2019-09-20T16:52:29", "upload_time_iso_8601": "2019-09-20T16:52:29.808058Z", "url": "https://files.pythonhosted.org/packages/6f/a3/b1e4e3764bd534a5011e84ab1f572ddab3c454d83ee80eca6e74276eeea9/MACS2-2.1.3.tar.gz", "yanked": false}], "2.1.3.1": [{"comment_text": "", "digests": {"md5": "b2bdd58df92a0538a1f5b41c222a9ea6", "sha256": "224c3982df412afc34eae3e73303ca41745c7b21584e2a613e62e52fa84f89e8"}, "downloads": -1, "filename": "MACS2-2.1.3.1.tar.gz", "has_sig": false, "md5_digest": "b2bdd58df92a0538a1f5b41c222a9ea6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 178505, "upload_time": "2019-09-20T17:41:43", "upload_time_iso_8601": "2019-09-20T17:41:43.236314Z", "url": "https://files.pythonhosted.org/packages/0b/8f/9193fd341bf6a1db636a75ac1e514a1ad537f17014bb0b4f128d3ce388d8/MACS2-2.1.3.1.tar.gz", "yanked": false}], "2.1.3.2": [{"comment_text": "", "digests": {"md5": "9b8712eebc326909c86fddb23b4f6fd0", "sha256": "4efd298e9ed7b689c07cef57e0dfc55b3e95359dee28903ce5f183926baab875"}, "downloads": -1, "filename": "MACS2-2.1.3.2.tar.gz", "has_sig": false, "md5_digest": "9b8712eebc326909c86fddb23b4f6fd0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1843828, "upload_time": "2019-09-20T18:18:34", "upload_time_iso_8601": "2019-09-20T18:18:34.329739Z", "url": "https://files.pythonhosted.org/packages/35/23/a86785997b32c5d309555eb1ca2c4ef20c823c64f4318eb96a2ed56eae2d/MACS2-2.1.3.2.tar.gz", "yanked": false}], "2.1.3.3": [{"comment_text": "", "digests": {"md5": "442fbdc27b98f5c4a1a6896401b86200", "sha256": "00959e523f45ed92b8429f55944eca6984623ac008d7cdb488c3ffe59c21984a"}, "downloads": -1, "filename": "MACS2-2.1.3.3.tar.gz", "has_sig": false, "md5_digest": "442fbdc27b98f5c4a1a6896401b86200", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1843790, "upload_time": "2019-09-20T20:01:06", "upload_time_iso_8601": "2019-09-20T20:01:06.860227Z", "url": "https://files.pythonhosted.org/packages/e9/7d/5e24cf24c048548371fc1892fc9a4261ac92cc31ec7ed99552c73c727e9e/MACS2-2.1.3.3.tar.gz", "yanked": false}], "2.1.4": [{"comment_text": "", "digests": {"md5": "b00daa1386df604e8116b9e1681e25f4", "sha256": "e4966d001914320829ab859c7bc8e92c6410aa7bdbddfd00b7625e9a0fb15c97"}, "downloads": -1, "filename": "MACS2-2.1.4.tar.gz", "has_sig": false, "md5_digest": "b00daa1386df604e8116b9e1681e25f4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1840829, "upload_time": "2019-09-30T21:57:32", "upload_time_iso_8601": "2019-09-30T21:57:32.757722Z", "url": "https://files.pythonhosted.org/packages/3e/0f/9e34f46341cb0ab5ea67421666ef86c9678fbea1ac9455c716474cd19350/MACS2-2.1.4.tar.gz", "yanked": false}], "2.2.4": [{"comment_text": "", "digests": {"md5": "e61cc35ad0fafc7e1beac3639815dc24", "sha256": "b131aadc8f5fd94bec35308b821e1f7585def788d2e7c756fc8cac402ffee25b"}, "downloads": -1, "filename": "MACS2-2.2.4.tar.gz", "has_sig": false, "md5_digest": "e61cc35ad0fafc7e1beac3639815dc24", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2058348, "upload_time": "2019-10-03T18:38:37", "upload_time_iso_8601": "2019-10-03T18:38:37.635954Z", "url": "https://files.pythonhosted.org/packages/72/70/8b55d06b660d1546b359eb67ad84d775cb82de6f50fde2a7c2438fbd9971/MACS2-2.2.4.tar.gz", "yanked": false}], "2.2.5": [{"comment_text": "", "digests": {"md5": "bb3f8edda4295965b5b257bb223720c5", "sha256": "a3d8c5885e3e2cb6ffd46fe292841f7d74fdbaaf549105c77e48a2b96e479741"}, "downloads": -1, "filename": "MACS2-2.2.5.tar.gz", "has_sig": false, "md5_digest": "bb3f8edda4295965b5b257bb223720c5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2036627, "upload_time": "2019-10-31T15:45:07", "upload_time_iso_8601": "2019-10-31T15:45:07.440469Z", "url": "https://files.pythonhosted.org/packages/b7/49/f784c2bba2c885760d022d200955178759573f0b46a12519811a6d85ceac/MACS2-2.2.5.tar.gz", "yanked": false}], "2.2.6": [{"comment_text": "", "digests": {"md5": "19ac14a4e1577d1c6d6a23ec85c02248", "sha256": "ca9e43f8cf15312ace9afa0a9bf67e8072227376235b7b0f18dd2dcac17dea42"}, "downloads": -1, "filename": "MACS2-2.2.6.tar.gz", "has_sig": false, "md5_digest": "19ac14a4e1577d1c6d6a23ec85c02248", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2044541, "upload_time": "2019-12-12T21:08:20", "upload_time_iso_8601": "2019-12-12T21:08:20.632711Z", "url": "https://files.pythonhosted.org/packages/21/0f/972b44c84d85e37d816beae88aa5ddad606bd757630d77dc2f558900a6ce/MACS2-2.2.6.tar.gz", "yanked": false}], "2.2.7": [{"comment_text": "", "digests": {"md5": "d5cc37589a5714f8f690b4c346bf76e6", "sha256": "acb0fff44c620cf9c81c5db3c60c8b3e7ef3f67f230ef5b02ea0d89f00a34556"}, "downloads": -1, "filename": "MACS2-2.2.7.tar.gz", "has_sig": false, "md5_digest": "d5cc37589a5714f8f690b4c346bf76e6", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 2057582, "upload_time": "2020-04-11T23:20:03", "upload_time_iso_8601": "2020-04-11T23:20:03.516756Z", "url": "https://files.pythonhosted.org/packages/99/39/bf773ca90536809eddf670062fd113e3155099c4b6f802a501fc0163da9d/MACS2-2.2.7.tar.gz", "yanked": false}], "2.2.7.1": [{"comment_text": "", "digests": {"md5": "cfdac500a0d4f51e24864364e0025738", "sha256": "ad2ca69bdd02a8942a68aae23133289b5c16ba382bcbe20c39fabf3948929de5"}, "downloads": -1, "filename": "MACS2-2.2.7.1.tar.gz", "has_sig": false, "md5_digest": "cfdac500a0d4f51e24864364e0025738", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 2057839, "upload_time": "2020-04-12T00:19:54", "upload_time_iso_8601": "2020-04-12T00:19:54.198795Z", "url": "https://files.pythonhosted.org/packages/e2/61/85d30ecdd34525113e28cb0c5a9f393f93578165f8d848be5925c0208dfb/MACS2-2.2.7.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "cfdac500a0d4f51e24864364e0025738", "sha256": "ad2ca69bdd02a8942a68aae23133289b5c16ba382bcbe20c39fabf3948929de5"}, "downloads": -1, "filename": "MACS2-2.2.7.1.tar.gz", "has_sig": false, "md5_digest": "cfdac500a0d4f51e24864364e0025738", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 2057839, "upload_time": "2020-04-12T00:19:54", "upload_time_iso_8601": "2020-04-12T00:19:54.198795Z", "url": "https://files.pythonhosted.org/packages/e2/61/85d30ecdd34525113e28cb0c5a9f393f93578165f8d848be5925c0208dfb/MACS2-2.2.7.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:42:16 2020"}