{"info": {"author": "Roberto Rosario", "author_email": "roberto.rosario@mayan-edms.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Environment :: Web Environment", "Framework :: Django", "Intended Audience :: Developers", "Intended Audience :: Education", "Intended Audience :: Information Technology", "License :: OSI Approved :: Apache Software License", "Natural Language :: English", "Programming Language :: Python", "Programming Language :: Python :: 2.7", "Topic :: Communications :: File Sharing", "Topic :: Internet :: WWW/HTTP", "Topic :: Internet :: WWW/HTTP :: WSGI :: Application"], "description": "|pypi| |builds| |coverage| |python| |license|\n\n\nMayan EDMS NG is a modern fork of Mayan EDMS focused on stability,\nperfomance and new features.\n\n.. image:: https://gitlab.com/mayan-edms-ng/mayan-edms-ng/raw/master/docs/_static/mayan-pyramid.png\n    :align: center\n    :width: 200\n    :height: 200\n\nMayan EDMS is a document management system. Its main purpose is to store,\nintrospect, and categorize files, with a strong emphasis on preserving the\ncontextual and business information of documents. It can also OCR, preview,\nlabel, sign, send, and receive thoses files. Other features of interest\nare its workflow system, role based access control, and REST API.\n\n.. image:: https://gitlab.com/mayan-edms-ng/mayan-edms-ng/raw/master/docs/_static/overview.gif\n    :align: center\n    :width: 200\n\nThe easiest way to use Mayan EDMS is by using the official Docker_ image.\nMake sure Docker is properly installed and working before attempting to install\nMayan EDMS.\n\nFor the complete set of installation, configuration, upgrade, and backup\ninstructions visit the Mayan EDMS Docker Hub page at:\nhttps://hub.docker.com/r/mayanedmsng/mayanedmsng/\n\n.. _Docker: https://www.docker.com/\n\nHardware requirements\n\n- 2 Gigabytes of RAM (1 Gigabyte if OCR is turned off).\n- Multiple core CPU (64 bit, faster than 1 GHz recommended).\n\n\nImportant links\n\n- `Homepage <http://www.mayan-edms.com>`__\n- `Videos <https://www.youtube.com/channel/UCJOOXHP1MJ9lVA7d8ZTlHPw>`__\n- `Documentation <http://mayan.readthedocs.io/en/stable/>`__\n- `Paid support <http://www.mayan-edms.com/providers/>`__\n- `Roadmap <https://gitlab.com/mayan-edms-ng/mayan-edms-ng/wikis/roadmap>`__\n- `Contributing <https://gitlab.com/mayan-edms-ng/mayan-edms-ng/blob/master/CONTRIBUTING.md>`__\n- `Community forum <https://groups.google.com/forum/#!forum/mayan-edms>`__\n- `Community forum archive <http://mayan-edms.1003.x6.nabble.com/>`__\n- `Source code, issues, bugs <https://gitlab.com/mayan-edms-ng/mayan-edms-ng>`__\n- `Plug-ins, other related projects <https://gitlab.com/mayan-edms-ng/>`__\n- `Translations <https://www.transifex.com/rosarior/mayan-edms/>`__\n\n\n\n.. |pypi| image:: http://img.shields.io/pypi/v/mayan-edms-ng.svg\n   :target: http://badge.fury.io/py/mayan-edms-ng\n.. |builds| image:: https://gitlab.com/mayan-edms-ng/mayan-edms-ng/badges/master/build.svg\n   :target: https://gitlab.com/mayan-edms-ng/mayan-edms-ng/pipelines\n.. |coverage| image:: https://codecov.io/gitlab/mayan-edms-ng/mayan-edms-ng/coverage.svg?branch=master\n   :target: https://codecov.io/gitlab/mayan-edms-ng/mayan-edms-ng?branch=master\n.. |python| image:: https://img.shields.io/pypi/pyversions/mayan-edms-ng.svg\n.. |license| image:: https://img.shields.io/pypi/l/mayan-edms-ng.svg?style=flat\n\n\n3.0.2 (2018-03-22)\n==================\n- Fix event and document states apps migration depedencies.\n- Add the \"to=\" keyword argument to all ForeignKey, ManayToMany and OneToOne Fields.\n\n3.0.1 (2018-03-22)\n==================\n- Remove squashed migrations. This Django feature is not yet ready for\n  production use.\n- Fix \"check for update\" feature.\n- Add Makefile target to check the format of the README.rst file.\n- Fix carousel item height issues.\n- Place the page number summary at the bottom of the carousel pages.\n\n3.0 (2018-03-19)\n================\n- Fix permission filtering when performing document page searching.\n- Fix cabinet detail view pagination.\n- Update project to work with Django 1.11.11.\n- Fix deprecations in preparation for Django 2.0.\n- Improve permission handling in the workflow app.\n- The checkedout detail view permission is now required for the checked out document detail API view.\n- Switch to a resource and service based API from previous app based one.\n- Add missing services for the checkout API.\n- Fix existing checkout APIs.\n- Update API vies and serializers for the latest Django REST framework version. Replace DRF Swagger with DRF-YASG.\n- Update to the latest version of Pillow, django-activity-stream, django-compressor, django-cors-headers,\n  django-formtools, django-qsstats-magic, django-stronghold, django-suit, furl, graphviz, pyocr,\n  python-dateutil, python-magic, pytz, sh.\n- Update to the latest version the packages for building, development, documentation and testing.\n- Add statistics script to produce a report of the views, APIs and test for each app.\n- Merge base64 filename patch from Cornelius Ludmann.\n- SearchModel retrun interface changed. The class no longer returns the result_set value. Use the queryset returned instead.\n- Squash migrations for apps: acls(1-2), checkouts(1-2), converter(1-12), django_gpg(1-6),\n  document_parsing(1-2), document_states(1-2), dynamic_search(1-3), motd(1-5), permissions(1-3),\n  sources(1-16).\n- Update to Font Awesome 5.\n- Turn Mayan EDMS into a single page app.\n- Split base.js into mayan_app.js, mayan_image.js, partial_navigation.js.\n- Add a HOME_VIEW setting. Use it for the default view to be loaded.\n- Fix bug in document page view. Was storing the URL and the querystring as a single url variable.\n- Use history.back instead of history.go(-1).\n- Don't use the previous variable when canceling a form action. Form now use only javascript's history.back().\n- Add template and modal to display server side errors.\n- Remove the unused scrollable_content internal feature.\n- Remove unused animate.css package.\n- Add page loading indicator.\n- Add periodic AJAX workers to update the value of the notifications link.\n- Add notification count inside a badge on the notification link.\n- Add the MERC specifying javascript library usage.\n- Documents without at least a version are not scanned for duplicates.\n- Use a SHA256 hex digest of the secret key at the name of the lockfile. This makes the generation of the name repeatable while unique between installations.\n- Squashed apps migrations.\n- Convert document thumbnails, preview, image preview and staging files to template base widgets.\n- Unify all document widgets.\n- Display resolution settings are now specified as width and height and not a single resolution value.\n- Printed pages are now full width.\n- Move the invalid document markup to a separate HTML template.\n- Update to Fancybox 3.\n- Update to jQuery 3.3.1\n- Move transfomations to their own module.\n- Split documents.tests.test_views into base.py, test_deleted_document_views.py,\n  test_document_page_views.py, test_document_type_views.py, test_document_version_views.py,\n  test_document_views.py, test_duplicated_document_views.py\n- Sort smart links by label.\n- Rename the internal name of the document type permissions namespace. Existing permissions will need to be updated.\n- Add support for OR type searches. Use the \"OR\" string between the terms. Example: term1 OR term2.\n- Removed redundant permissions checks.\n- Move the page count display to the top of the image.\n- Unify the way to gather the project's metadata. Use mayan.__XX__ and a new common tag named {% project_information '' %}\n- Update logo.\n- Return to the same source view after uploading a document.\n- Add new WizardStep class to decouple the wizard step configuration.\n- Add support for deregister upload wizard steps.\n- Add wizard step to insert the document being uploaded to a cabinet.\n- Fix documentation formatting.\n- Add upload wizard step chapte.\n- Improve and add additional diagrams.\n- Change documenation theme to rtd.\n\n2.8 (2018-02-27)\n================\n- Rename the role groups link label from \"Members\" to \"Groups\".\n- Rename the group users link label from \"Members\" to \"Users\".\n- Don't show full document version label in the heading of the document\n  version list view.\n- Show the number of pages of a document and of document versions in\n  the document list view and document versions list views respectively.\n- Display a document version's thumbnail before other attributes.\n- User Django's provided form for setting an users password.\n  This change allows displaying the current password policies\n  and validation.\n- Add method to modify a group's role membership from the group's\n  view.\n- Rename the group user count column label from \"Members\" to \"Users\".\n- Backport support for global and object event notification.\n  GitLab issue #262.\n- Remove Vagrant section of the document. Anything related to\n  Vagrant has been move into its own repository at:\n  https://gitlab.com/mayan-edms/mayan-edms-vagrant\n- Add view to show list of events performed by an user.\n- Allow filtering an event list by clicking on the user column.\n- Display a proper message in the document type metadata type relationship\n  view when there are no metadata types exist.\n- Improved styling and interaction of the multiple object action form.\n- Add checkbox to allow selecting all item in the item list view.\n- Rename project to Mayan EDMS NG.\n\n2.7.3 (2017-09-11)\n==================\n- Fix task manager queue list view. Thanks to LeVon Smoker for\n  the report.\n- Fix resolved link class URL mangling when the keep_query argument is\n  used. Thanks to Nick Douma (LordGaav) for the report and diagnostic\n  information. Fixes source navigation on the document upload wizard.\n\n2.7.2 (2017-09-06)\n==================\n- Fix new mailer creation view. GitLab issue #431.\n  Thanks to Robert Schöftner (@robert.schoeftner) for the\n  report and the solution.\n- Consolidate intial document created event and the first\n  document properties edited events. Preserve the user that\n  initially creates the document. GitLab issue #433. Thanks\n  to Jesaja Everling (@jeverling) for the report.\n- Sort the list of root cabinets. Thanks to Thomas Plotkowiak\n  for the request.\n- Sort the list of a document's cabinets.\n- Display a document's cabinet list in italics. GitLab issue #435.\n  Thanks to LeVon Smoker for the request.\n- Install mock by default to allow easier testing of deployed\n  instances.\n\n2.7.1 (2017-09-03)\n==================\n- Support unicode in URL querystring. GitLab issue #423.\n  Thanks to Gustavo Teixeira (@gsteixei) for the find.\n- Import errors during initialization are only ignored\n  if they are cause by a missing local.py. Thanks to\n  MacRobb Simpson for the report and solution.\n- Make sure the local.py created used unicode for strings\n  by default. GitLab issue #424. Thanks to Gustavo Teixeira\n  (@gsteixei) for the find.\n\n2.7 (2017-08-30)\n================\n- Add workaround for PDF with IndirectObject as the\n  rotation value. GitHub #261.\n- Add ACL list link with icon and use it for the document facet menu.\n- Fix mailing app permissions labels.\n- Add ACLs link and ACLs permissions to the mailer profile model.\n- Improve mailer URL regex.\n- Add ordering support to the SourceColumn class. GitLab issue #417.\n- Shows the cabinets in the document list. GitLab #417 @corneliusludmann\n- Add workaround for pycountry versions without the bibliographical key.\n  GitHub issue #250.\n- Skip UUID migration on Oracle backends. GitHub issue #251.\n- Allow changing the output format, DPI of the pdftoppm command, and\n  the output format of the converter via the CONVERTER_GRAPHICS_BACKEND_CONFIG\n  setting. GitHub issues #256 #257 GitLab issue #416.\n- Add support for workflow triggers.\n- Add support for workflow actions.\n- Add support for rendering workflows.\n- Add support for unbinding sub menus.\n- Fix mailing profile test view.\n- Disregard the last 3 dots that mark the end of the YAML document.\n- Add support for multiple dashboards.\n- Add support for removing dashboard widgets.\n- Convert document version view to item list view.\n- Add support for browsing individual document versions.\n- Add support for dropdown menus to the item list view template.\n- Add support for preserving the file extenstion when downloading a document\n  version. GitLab #415.\n- Split OCR app into OCR and parsing.\n- Remove Folders app.\n- Use the literal 'System' instead of the target name when\n  the action user in unknown.\n- Remove the view to submit all document for OCR.\n- When changing document types, don't delete the old metadata that is\n  also found in the new document type. GitLab issue #421.\n- Add tag attach and tag remove events.\n- Change the permission needed to attach and remove tags.\n- Add HTTP POST workflow state action.\n- Add access control grant workflow state action.\n- Beta Python 3 support.\n\n2.6.4 (2017-07-26)\n==================\n- Add missing replacements of reverse to resolve_url.\n\n2.6.3 (2017-07-25)\n==================\n- Add makefile target to launch a PostgreSQL container.\n- Use resolve_url instead of redirect to resolve the post login URL.\n- Make the intialsetup and performupgrade management tasks work\n  with signals to allow customization from 3rd party apps.\n- PEP8 cleanups.\n- Add tag_ids keyword argument to the Source.handle_upload\n  model method. GitLab issue #413.\n- Add overflow wrapping so wrap long titles in Firefox too.\n- Makes Roles searchable. GitLab issue #402.\n- Add line numbers to the debug and production loggers.\n  Add date and time to the production logger.\n- Add support for generating setup.py from a template. GitLab\n  #149 #200.\n- Add fade in animation to document images.\n\n2.6.2 (2017-07-19)\n==================\n- Fix deprecation warning to prepare upgrade to Django 1.11 and 2.0.\n- Fix document page zoom.\n- Add support to run tests against a MySQL, Postgres or Oracle container.\n- Improve tag widget customization by moving the markup to its own template.\n- Fix document page widget appearance in the document page list view.\n- Make document version order deterministic.\n- Allow total page number instrospection of encrypted PDF with non ASCII user properties. GitLab issue #411.\n- Oracle database compatibility update in the cabinets app. GitHub #258.\n\n2.6.1 (2017-07-18)\n==================\n- Fix issue when editing or removing metadata from multiple documents.\n\n2.6 (2017-07-18)\n================\n- Fix HTML mark up in window title. GitLab #397.\n- Add support for emailing documents to a recipient list. GitLab #396.\n- Backport metadata widget changes from @Macrobb. GitLab #377.\n- Make users and group searchable.\n- Add support for logging errors during in production mode.\n  Add COMMON_PRODUCTION_ERROR_LOG_PATH to control path of log file.\n  Defaults to mayan/error.log.\n- Add support logging request exceptions.\n- Add document list item view.\n- Sort setting by namespace label and by global name second.\n- Sort indexes by label.\n- Fix cabinets permission and access control checking.\n- The permission to add or remove documents to cabinets now applies to documents too.\n- Equalize dashboard widgets heights.\n- Switch the order of the DEFAULT_AUTHENTICATION_CLASSES of DRF. GitLab #400.\n- Backport document's version list view permission.\n- Improve code to unbind menu entries.\n- Renamed the document type permission namespace from \"Document setup\" to \"Document types\".\n- Add support for granting the document type edit, document type delete, and document type view\n  permissions to individual document type instances.\n- Improved tests by testing for accesses.\n- Increase the size of the mailing profile label field to 128 characters.\n\n2.5.2 (2017-07-08)\n==================\n- Improve new document creation signal handling.\n  Fixes issue with duplicate scanning at upload.\n\n2.5.1 (2017-07-08)\n==================\n- Update release target due to changes in PyPI.\n\n2.5 (2017-07-07)\n================\n- Add view to download a document's OCR text. GitLab #215\n- Add user configurable mailer. GitLab #286.\n- Use Toasts library for screen messages.\n- Reduce verbosity of some debug messages.\n- Add new lineart transformation.\n- Fix SANE source resolution field.\n- About and Profile menu reorganization.\n- PDF compatibility improvements.\n- Office document coversion improvements.\n- New metadata type setup UI.\n- Duplicated document scan support.\n- \"Remember me\" login support.\n- Forgotten password restore via email.\n- Document cache disabling.\n- Translation improvements.\n- Image loading improvements.\n- Lower Javascript memory utilization.\n- HTML reponsive layout improvements.\n- Make document deletion a background task.\n- Unicode handling improvements.\n- Python3 compatilibyt improvements.\n- New screen messages using Toastr.\n\n2.4 (2017-06-23)\n================\n- Add Django-mathfilters.\n- Improve render of documents with no pages.\n- Add SANE scanner document source.\n- Added PDF orientation detection. GitLab issue #387.\n- Fix repeated permission list API URL. GitLab issue #389.\n- Fix role creation API endpoint not returning id. GitLab issue #390.\n- Make tags, metadata types and cabinets searchable via the dynamic search API. GitLab issue #344.\n- Add support for updating configuration options from environment variables.\n- Add purgelocks management command. GitLab issue #221.\n- Fix index rebuilding for multi value first levels. GitLab issue #391.\n- Truncate views titles via the APPEARANCE_MAXIMUM_TITLE_LENGTH setting. GitLab issue #217.\n- Add background task manager app. GitLab issue #132.\n- Add link to show a document's OCR errors. GitLab issue #291.\n\n2.3 (2017-06-08)\n================\n- Allow for bigger indexing expression templates.\n- Auto select checkbox when updating metadata values. GitLab issue #371.\n- Added support for passing the options allow-other and allow-root to the\n  FUSE index mirror. GitLab issue #385\n- Add support for check for the latest released version of Mayan from the\n  About menu.\n- Support for rebuilding specific indexes. GitLab issue #372.\n- Rewrite document indexing code to be faster and use less locking.\n- Use a predefined file path for the file lock.\n- Catch documents with not document version when displaying their thumbnails.\n- Document page navigation fix when using Mayan as a sub URL app.\n- Add support for indexing on workflow state changes.\n- Add search model list API endpoint.\n\n2.2 (2017-04-26)\n================\n- Remove the installation app (GitLab #301).\n- Add support for document page search\n- Remove recent searches feature\n- Remove dependency on the django-filetransfer library\n- Fix height calculation in resize transformation\n- Improve upgrade instructions\n- New image caching pipeline\n- New drop down menus for the documents, folders and tags app as well as for\n  the user links.\n- New Dashboard view\n- Moved licenses to their own module in every app\n- Update project to work with Django 1.10.4.\n- Tags are alphabetically ordered by label (GitLab #342).\n- Stop loading theme fonts from the web (GitLab #343).\n- Add support for attaching multiple tags (GitLab #307).\n- Integrate the Cabinets app.\n\n2.1.11 (2017-03-14)\n===================\n- Added a quick rename serializer to the document type API serializer.\n- Added per document type, workflow list API view.\n- Mayan EDMS was adopted a version 1.1 of the Linux Foundation Developer Certificate of Origin.\n- Added the detail url of a permission in the permission serializer.\n- Added endpoints for the ACL app API.\n- Implemented document workflows transition ACLs. GitLab issue #321.\n- Add document comments API endpoints. GitHub issue #249.\n- Add support for overriding the Celery class.\n- Changed the document upload view in source app to not use the HTTP referer\n  URL blindly, but instead recompose the URL using known view name. Needed\n  when integrating Mayan EDMS into other app via using iframes.\n- Addes size field to the document version serializer.\n- Removed the serializer from the deleted document restore API endpoint.\n- Added support for adding or editing document types to smart links via the\n  API.\n\n2.1.10 (2017-02-13)\n===================\n- Update Makefile to use twine for releases.\n- Add Makefile target to make test releases.\n\n2.1.9 (2017-02-13)\n==================\n- Update make file to Workaround long standing pypa wheel bug #99\n\n2.1.8 (2017-02-12)\n==================\n- Fixes in the trashed document API endpoints.\n- Improved tags API PUT and PATCH endpoints.\n- Bulk document adding when creating and editing tags.\n- The version of django-mptt is preserved in case mayan-cabinets is installed.\n- Add Django GPG API endpoints for singing keys.\n- Add API endpoints for the document states (workflows) app.\n- Add API endpoints for the messsage of the day (MOTD) app.\n- Add Smart link API endpoints.\n- Add writable versions of the Document and Document Type serializers (GitLab issues #348 and #349).\n- Close GitLab issue #310 \"Metadata's lookup with chinese messages when new document\"\n\n2.1.7 (2017-02-01)\n==================\n- Improved user management API endpoints.\n- Improved permissions API endpoints.\n- Improvements in the API tests of a few apps.\n- Addition Content type list API view to the common app.\n- Add API endpoints to the events app.\n- Enable the parser and validation fields of the metadata serializer.\n\n2.1.6 (2016-11-23)\n==================\n- Fix variable name typo in the rotation transformation class.\n- Update translations\n\n2.1.5 (2016-11-08)\n==================\n- Backport resize transformation math operation fix (GitLab #319).\n- Update Pillow to 3.1.2 (Security fix).\n- Backport zoom transformation performance improvement (GitLab #334).\n- Backport trash can navigation link resolution fix (GitLab #331).\n- Improve documentation regarding the use of GPG version 1 (GitLab #333).\n- Fix ACL create view HTML response type. (GitLab #335).\n- Expland staging folder and watch folder explanation.\n\n2.1.4 (2016-10-28)\n==================\n- Add missing link to the 2.1.3 release notes in the index file.\n- Improve TempfileCheckMixin.\n- Fix statistics namespace list display view.\n- Fix events list display view.\n- Update required Django version to 1.8.15.\n- Update required python-gnupg version to 0.3.9.\n- Improved orphaned temporary files test mixin.\n- Re-enable and improve GitLab CI MySQL testing.\n- Improved GPG handling.\n- New GPG backend system.\n- Minor documentation updates.\n\n2.1.3 (2016-06-29)\n==================\n- Add help message when initialsetup migration phase fails. Relates to GitLab issue #296.\n- Start using self.setdout instead of print as per documentation.\n- Fix GitLab issue #295, \"When editing a user the top bar jumps to the name of the user\".\n- Normalize handling of temporary file and directory creation.\n- Fix GitLab issue #309, \"Temp files quickly filling-up my /tmp (1GB tmpfs)\".\n- Explicitly check for residual temporary files in tests.\n- Add missing temporary file cleanup for office documents.\n- Fix file descriptor leak in the document signature download test.\n\n2.1.2 (2016-05-20)\n==================\n- Sort document languages and user profile locale language lists. GitLab issue #292.\n- Fix metadata lookup for {{ users }} and {{ group }}. Fixes GitLab #290.\n- Add Makefile for common development tasks\n\n2.1.1 (2016-05-17)\n==================\n- Fix navigation issue that make it impossible to add new sources. GitLab issue #288.\n- The Tesseract OCR backend now reports if the requested language file is missing. GitLab issue #289.\n- Ensure the automatic default index is created after the default document type.\n\n2.1 (2016-05-14)\n================\n- Upgrade to use Django 1.8.13. Issue #246.\n- Upgrade requirements.\n- Remove remaining references to Django's User model. GitLab issue #225\n- Rename 'Content' search box to 'OCR'.\n- Remove included login required middleware using django-stronghold instead (http://mikegrouchy.com/django-stronghold/).\n- Improve generation of success and error messages for class based views.\n- Remove ownership concept from folders.\n- Replace strip_spaces middleware with the spaceless template tag. GitLab issue #255\n- Deselect the update checkbox for optional metadata by default.\n- Silence all Django 1.8 model import warnings.\n- Implement per document type document creation permission. Closes GitLab issue #232.\n- Add icons to the document face menu links.\n- Increase icon to text spacing to 3px.\n- Make document type delete time period optional.\n- Fixed date locale handling in document properties, checkout and user detail views.\n- Add new permission: checkout details view.\n- Add HTML5 upload widget. Issue #162.\n- Add Message of the Day app. Issue #222\n- Update Document model's uuid field to use Django's native UUIDField class.\n- Add new split view index navigation\n- Newly uploaded documents appear in the Recent document list of the user.\n- Document indexes now have ACL support.\n- Remove the document index setup permission.\n- Status messages now display the object class on which they operate not just the word \"Object\".\n- More tests added.\n- Handle unicode filenames in staging folders.\n- Add staging file deletion permission.\n- New document_signature_view permission.\n- Add support for signing documents.\n- Instead of multiple keyservers only one keyserver is now supported.\n- Replace document type selection widget with an opened selection list.\n- Add mailing documentation chapter.\n- Add roadmap documentation chapter.\n- API updates.\n\n\n2.0.2 (2016-02-09)\n==================\n- Install testing dependencies when installing development dependencies.\n- Fix GitLab issue #250 \"Empty optional lookup metadata trigger validation error\".\n- Fix OCR API test.\n- Move metadata form value validation to .clean() method.\n- Only extract validation error messages from ValidationError exception instances.\n- Don't store empty metadata value if the update checkbox is not checked.\n- Add 2 second delay to document version tests to workaround MySQL limitation.\n- Strip HTML tags from the browser title.\n- Remove Docker and Docker Compose files.\n\n\n2.0.1 (2016-01-22)\n==================\n- Fix GitLab issue #243, \"System allows a user to skip entering values for a required metadata field while uploading a new document\"\n- Fix GitLab issue #245, \"Add multiple metadata not possible\"\n- Updated Vagrantfile to provision a production box too.\n\n\n2.0 (2015-12-04)\n================\n- New source homepage: https://gitlab.com/mayan-edms/mayan-edms\n- Update to Django 1.7\n- New Bootstrap Frontend UI\n- Easier theming and rebranding\n- Improved page navigation interface\n- Menu reorganization\n- Removal of famfam icon set\n- Improved document preview generation\n- Document submission for OCR changed to POST\n- New YAML based settings system\n- Removal of auto admin creation as separate app\n- Removal of dependencies\n- ACL system refactor\n- Object access control inheritance\n- Removal of anonymous user support\n- Metadata validators refactor\n- Trash can support\n- Retention policies\n- Support for sharing indexes as FUSE filesystems\n- Clickable preview images titles\n- Removal of eval\n- Smarter OCR, per page parsing or OCR fallback\n- Improve failure tolerance (not all Operational Errors are critical now)\n- RGB tags\n- Default document type and default document source\n- Link unbinding\n- Statistics refactor\n- Apps merge\n- New signals\n- Test improvements\n- Indexes recalculation after document creation too\n- Upgrade command\n- OCR data moved to ocr app from documents app\n- New internal document creation workflow return a document stub\n- Auto console debug logging during development and info during production\n- New class based and menu based navigation system\n- New class based transformations\n- Usage of Font Awesome icons set\n- Management command to remove obsolete permissions: `purgepermissions`\n- Normalization of 'title' and 'name' fields to 'label'\n- Improved API, now at version 1\n- Invert page title/project name order in browser title\n- Django's class based views pagination\n- Reduction of text strings\n- Removal of the CombinedSource class\n- Removal of default class ACLs\n- Removal of the ImageMagick and GraphicsMagick converter backends\n- Remove support for applying roles to new users automatically\n- Removal of the DOCUMENT_RESTRICTIONS_OVERRIDE permission\n- Removed the page_label field\n\n\n1.1.1 (2015-05-21)\n==================\n\n- Update to Django 1.6.11\n- Fix make_dist.sh script\n- Add test for issue #163\n- Activate tests for the sources app\n- Removal of the registration app\n- New simplified official project description\n- Improvements to the index admin interface\n- Removal of installation statistics gathering\n- Remove unused folder tag\n- Fix usage of ugettext to ugettext_lazy\n- Increase size of the lock name field\n- New style documentation\n\n\n1.1 (2015-02-10)\n================\n- Uses Celery for background tasks\n- Removal of the splash screen\n- Adds a home view with common function buttons\n- Support for sending and receiving documents via email\n- Removed custom logging app in favor of django-actvity-stream\n- Adds watch folders\n- Includes Vagrant file for unified development and testing environments\n- Per user locale profile (language and timezone)\n- Includes news document workflow app\n- Optional and required metadata types\n- Improved testings. Automated tests against SQLite, MySQL, PostgreSQL\n- Many new REST API endpoints added\n- Simplified text messages\n- Improved method for custom settings\n- Addition of CORS support to the REST API\n- Per document language setting instead of per installation language setting\n- Metadata validation and parsing support\n- Start of code updates towards Python 3 support\n- Simplified UI\n- Stable PDF previews generation\n- More technical documentation\n\n\n1.0 (2014-08-27)\n================\n- New home @ https://github.com/mayan-edms/mayan-edms\n- Updated to use Django 1.6\n- Translation updates\n- Custom model properties removal\n- Source code improvements\n- Removal of included 3rd party modules\n- Automatic testing and code coverage check\n- Update of required modules and libraries versions\n- Database connection leaks fixes\n- Support for deletion of detached signatures\n- Removal of Fabric based installations script\n- Pluggable OCR backends\n- OCR improvements\n- License change, Mayan EDMS in now licensed under the Apache 2.0 License\n- PyPI package, Mayan EDMS in now available on PyPI: https://pypi.python.org/pypi/mayan-edms/\n- New REST API\n\n\n", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://gitlab.com/mayan-edms-ng/mayan-edms-ng", "keywords": "", "license": "Apache 2.0", "maintainer": "", "maintainer_email": "", "name": "mayan-edms-ng", "package_url": "https://pypi.org/project/mayan-edms-ng/", "platform": "any", "project_url": "https://pypi.org/project/mayan-edms-ng/", "project_urls": {"Homepage": "https://gitlab.com/mayan-edms-ng/mayan-edms-ng"}, "release_url": "https://pypi.org/project/mayan-edms-ng/3.0.2/", "requires_dist": ["Django (==1.11.11)", "Pillow (==5.0.0)", "PyYAML (==3.12)", "celery (==3.1.24)", "cssmin (==0.2.0)", "django-activity-stream (==0.6.5)", "django-autoadmin (==1.1.1)", "django-celery (==3.2.1)", "django-colorful (==1.2)", "django-compressor (==2.2)", "django-cors-headers (==2.2.0)", "django-downloadview (==1.9)", "django-formtools (==2.1)", "django-pure-pagination (==0.3.0)", "django-mathfilters (==0.4.0)", "django-model-utils (==3.1.1)", "django-mptt (==0.9.0)", "django-qsstats-magic (==1.0.0)", "django-stronghold (==0.3.0)", "django-suit (==0.2.26)", "django-widget-tweaks (==1.4.1)", "djangorestframework (==3.7.7)", "djangorestframework-recursive (==0.1.2)", "drf-yasg (==1.5.0)", "flex (==6.12.0)", "furl (==1.0.1)", "fusepy (==2.0.4)", "graphviz (==0.8.2)", "mock (==2.0.0)", "pycountry (==1.20)", "PyPDF2 (==1.26.0)", "pyocr (==0.5.1)", "python-dateutil (==2.6.1)", "python-gnupg (==0.3.9)", "python-magic (==0.4.15)", "pytz (==2018.3)", "requests (==2.18.4)", "sh (==1.12.14)", "swagger-spec-validator (==2.1.0)"], "requires_python": "", "summary": "Free Open Source Electronic Document Management System", "version": "3.0.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><a href=\"http://badge.fury.io/py/mayan-edms-ng\" rel=\"nofollow\"><img alt=\"pypi\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/e19bf8cc3e6dd13cfc4d62d9bca19cb1977e7ede/687474703a2f2f696d672e736869656c64732e696f2f707970692f762f6d6179616e2d65646d732d6e672e737667\"></a> <a href=\"https://gitlab.com/mayan-edms-ng/mayan-edms-ng/pipelines\" rel=\"nofollow\"><img alt=\"builds\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/573e92890c2dc77bd62d27d473625d806a204264/68747470733a2f2f6769746c61622e636f6d2f6d6179616e2d65646d732d6e672f6d6179616e2d65646d732d6e672f6261646765732f6d61737465722f6275696c642e737667\"></a> <a href=\"https://codecov.io/gitlab/mayan-edms-ng/mayan-edms-ng?branch=master\" rel=\"nofollow\"><img alt=\"coverage\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/18b86ca4460a78a1ee02fa1599e035c8639cd3fa/68747470733a2f2f636f6465636f762e696f2f6769746c61622f6d6179616e2d65646d732d6e672f6d6179616e2d65646d732d6e672f636f7665726167652e7376673f6272616e63683d6d6173746572\"></a> <img alt=\"python\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/fc44c4b1d70330deb3120dc005ab3e76d4b5cece/68747470733a2f2f696d672e736869656c64732e696f2f707970692f707976657273696f6e732f6d6179616e2d65646d732d6e672e737667\"> <img alt=\"license\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/708b09ab31fcb9b477213ca6e2825fdc550cea08/68747470733a2f2f696d672e736869656c64732e696f2f707970692f6c2f6d6179616e2d65646d732d6e672e7376673f7374796c653d666c6174\"></p>\n<p>Mayan EDMS NG is a modern fork of Mayan EDMS focused on stability,\nperfomance and new features.</p>\n<img alt=\"https://gitlab.com/mayan-edms-ng/mayan-edms-ng/raw/master/docs/_static/mayan-pyramid.png\" class=\"align-center\" height=\"200\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/e23b0559581d62019a878f7dcd6c39eb2115cf3e/68747470733a2f2f6769746c61622e636f6d2f6d6179616e2d65646d732d6e672f6d6179616e2d65646d732d6e672f7261772f6d61737465722f646f63732f5f7374617469632f6d6179616e2d707972616d69642e706e67\" width=\"200\">\n<p>Mayan EDMS is a document management system. Its main purpose is to store,\nintrospect, and categorize files, with a strong emphasis on preserving the\ncontextual and business information of documents. It can also OCR, preview,\nlabel, sign, send, and receive thoses files. Other features of interest\nare its workflow system, role based access control, and REST API.</p>\n<img alt=\"https://gitlab.com/mayan-edms-ng/mayan-edms-ng/raw/master/docs/_static/overview.gif\" class=\"align-center\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/45dabd1c6e325ce7a7db35076ae7fa3422a4cb32/68747470733a2f2f6769746c61622e636f6d2f6d6179616e2d65646d732d6e672f6d6179616e2d65646d732d6e672f7261772f6d61737465722f646f63732f5f7374617469632f6f766572766965772e676966\" width=\"200\">\n<p>The easiest way to use Mayan EDMS is by using the official <a href=\"https://www.docker.com/\" rel=\"nofollow\">Docker</a> image.\nMake sure Docker is properly installed and working before attempting to install\nMayan EDMS.</p>\n<p>For the complete set of installation, configuration, upgrade, and backup\ninstructions visit the Mayan EDMS Docker Hub page at:\n<a href=\"https://hub.docker.com/r/mayanedmsng/mayanedmsng/\" rel=\"nofollow\">https://hub.docker.com/r/mayanedmsng/mayanedmsng/</a></p>\n<p>Hardware requirements</p>\n<ul>\n<li>2 Gigabytes of RAM (1 Gigabyte if OCR is turned off).</li>\n<li>Multiple core CPU (64 bit, faster than 1 GHz recommended).</li>\n</ul>\n<p>Important links</p>\n<ul>\n<li><a href=\"http://www.mayan-edms.com\" rel=\"nofollow\">Homepage</a></li>\n<li><a href=\"https://www.youtube.com/channel/UCJOOXHP1MJ9lVA7d8ZTlHPw\" rel=\"nofollow\">Videos</a></li>\n<li><a href=\"http://mayan.readthedocs.io/en/stable/\" rel=\"nofollow\">Documentation</a></li>\n<li><a href=\"http://www.mayan-edms.com/providers/\" rel=\"nofollow\">Paid support</a></li>\n<li><a href=\"https://gitlab.com/mayan-edms-ng/mayan-edms-ng/wikis/roadmap\" rel=\"nofollow\">Roadmap</a></li>\n<li><a href=\"https://gitlab.com/mayan-edms-ng/mayan-edms-ng/blob/master/CONTRIBUTING.md\" rel=\"nofollow\">Contributing</a></li>\n<li><a href=\"https://groups.google.com/forum/#!forum/mayan-edms\" rel=\"nofollow\">Community forum</a></li>\n<li><a href=\"http://mayan-edms.1003.x6.nabble.com/\" rel=\"nofollow\">Community forum archive</a></li>\n<li><a href=\"https://gitlab.com/mayan-edms-ng/mayan-edms-ng\" rel=\"nofollow\">Source code, issues, bugs</a></li>\n<li><a href=\"https://gitlab.com/mayan-edms-ng/\" rel=\"nofollow\">Plug-ins, other related projects</a></li>\n<li><a href=\"https://www.transifex.com/rosarior/mayan-edms/\" rel=\"nofollow\">Translations</a></li>\n</ul>\n<div id=\"id1\">\n<h2>3.0.2 (2018-03-22)</h2>\n<ul>\n<li>Fix event and document states apps migration depedencies.</li>\n<li>Add the “to=” keyword argument to all ForeignKey, ManayToMany and OneToOne Fields.</li>\n</ul>\n</div>\n<div id=\"id2\">\n<h2>3.0.1 (2018-03-22)</h2>\n<ul>\n<li>Remove squashed migrations. This Django feature is not yet ready for\nproduction use.</li>\n<li>Fix “check for update” feature.</li>\n<li>Add Makefile target to check the format of the README.rst file.</li>\n<li>Fix carousel item height issues.</li>\n<li>Place the page number summary at the bottom of the carousel pages.</li>\n</ul>\n</div>\n<div id=\"id3\">\n<h2>3.0 (2018-03-19)</h2>\n<ul>\n<li>Fix permission filtering when performing document page searching.</li>\n<li>Fix cabinet detail view pagination.</li>\n<li>Update project to work with Django 1.11.11.</li>\n<li>Fix deprecations in preparation for Django 2.0.</li>\n<li>Improve permission handling in the workflow app.</li>\n<li>The checkedout detail view permission is now required for the checked out document detail API view.</li>\n<li>Switch to a resource and service based API from previous app based one.</li>\n<li>Add missing services for the checkout API.</li>\n<li>Fix existing checkout APIs.</li>\n<li>Update API vies and serializers for the latest Django REST framework version. Replace DRF Swagger with DRF-YASG.</li>\n<li>Update to the latest version of Pillow, django-activity-stream, django-compressor, django-cors-headers,\ndjango-formtools, django-qsstats-magic, django-stronghold, django-suit, furl, graphviz, pyocr,\npython-dateutil, python-magic, pytz, sh.</li>\n<li>Update to the latest version the packages for building, development, documentation and testing.</li>\n<li>Add statistics script to produce a report of the views, APIs and test for each app.</li>\n<li>Merge base64 filename patch from Cornelius Ludmann.</li>\n<li>SearchModel retrun interface changed. The class no longer returns the result_set value. Use the queryset returned instead.</li>\n<li>Squash migrations for apps: acls(1-2), checkouts(1-2), converter(1-12), django_gpg(1-6),\ndocument_parsing(1-2), document_states(1-2), dynamic_search(1-3), motd(1-5), permissions(1-3),\nsources(1-16).</li>\n<li>Update to Font Awesome 5.</li>\n<li>Turn Mayan EDMS into a single page app.</li>\n<li>Split base.js into mayan_app.js, mayan_image.js, partial_navigation.js.</li>\n<li>Add a HOME_VIEW setting. Use it for the default view to be loaded.</li>\n<li>Fix bug in document page view. Was storing the URL and the querystring as a single url variable.</li>\n<li>Use history.back instead of history.go(-1).</li>\n<li>Don’t use the previous variable when canceling a form action. Form now use only javascript’s history.back().</li>\n<li>Add template and modal to display server side errors.</li>\n<li>Remove the unused scrollable_content internal feature.</li>\n<li>Remove unused animate.css package.</li>\n<li>Add page loading indicator.</li>\n<li>Add periodic AJAX workers to update the value of the notifications link.</li>\n<li>Add notification count inside a badge on the notification link.</li>\n<li>Add the MERC specifying javascript library usage.</li>\n<li>Documents without at least a version are not scanned for duplicates.</li>\n<li>Use a SHA256 hex digest of the secret key at the name of the lockfile. This makes the generation of the name repeatable while unique between installations.</li>\n<li>Squashed apps migrations.</li>\n<li>Convert document thumbnails, preview, image preview and staging files to template base widgets.</li>\n<li>Unify all document widgets.</li>\n<li>Display resolution settings are now specified as width and height and not a single resolution value.</li>\n<li>Printed pages are now full width.</li>\n<li>Move the invalid document markup to a separate HTML template.</li>\n<li>Update to Fancybox 3.</li>\n<li>Update to jQuery 3.3.1</li>\n<li>Move transfomations to their own module.</li>\n<li>Split documents.tests.test_views into base.py, test_deleted_document_views.py,\ntest_document_page_views.py, test_document_type_views.py, test_document_version_views.py,\ntest_document_views.py, test_duplicated_document_views.py</li>\n<li>Sort smart links by label.</li>\n<li>Rename the internal name of the document type permissions namespace. Existing permissions will need to be updated.</li>\n<li>Add support for OR type searches. Use the “OR” string between the terms. Example: term1 OR term2.</li>\n<li>Removed redundant permissions checks.</li>\n<li>Move the page count display to the top of the image.</li>\n<li>Unify the way to gather the project’s metadata. Use mayan.__XX__ and a new common tag named {% project_information ‘’ %}</li>\n<li>Update logo.</li>\n<li>Return to the same source view after uploading a document.</li>\n<li>Add new WizardStep class to decouple the wizard step configuration.</li>\n<li>Add support for deregister upload wizard steps.</li>\n<li>Add wizard step to insert the document being uploaded to a cabinet.</li>\n<li>Fix documentation formatting.</li>\n<li>Add upload wizard step chapte.</li>\n<li>Improve and add additional diagrams.</li>\n<li>Change documenation theme to rtd.</li>\n</ul>\n</div>\n<div id=\"id4\">\n<h2>2.8 (2018-02-27)</h2>\n<ul>\n<li>Rename the role groups link label from “Members” to “Groups”.</li>\n<li>Rename the group users link label from “Members” to “Users”.</li>\n<li>Don’t show full document version label in the heading of the document\nversion list view.</li>\n<li>Show the number of pages of a document and of document versions in\nthe document list view and document versions list views respectively.</li>\n<li>Display a document version’s thumbnail before other attributes.</li>\n<li>User Django’s provided form for setting an users password.\nThis change allows displaying the current password policies\nand validation.</li>\n<li>Add method to modify a group’s role membership from the group’s\nview.</li>\n<li>Rename the group user count column label from “Members” to “Users”.</li>\n<li>Backport support for global and object event notification.\nGitLab issue #262.</li>\n<li>Remove Vagrant section of the document. Anything related to\nVagrant has been move into its own repository at:\n<a href=\"https://gitlab.com/mayan-edms/mayan-edms-vagrant\" rel=\"nofollow\">https://gitlab.com/mayan-edms/mayan-edms-vagrant</a></li>\n<li>Add view to show list of events performed by an user.</li>\n<li>Allow filtering an event list by clicking on the user column.</li>\n<li>Display a proper message in the document type metadata type relationship\nview when there are no metadata types exist.</li>\n<li>Improved styling and interaction of the multiple object action form.</li>\n<li>Add checkbox to allow selecting all item in the item list view.</li>\n<li>Rename project to Mayan EDMS NG.</li>\n</ul>\n</div>\n<div id=\"id5\">\n<h2>2.7.3 (2017-09-11)</h2>\n<ul>\n<li>Fix task manager queue list view. Thanks to LeVon Smoker for\nthe report.</li>\n<li>Fix resolved link class URL mangling when the keep_query argument is\nused. Thanks to Nick Douma (LordGaav) for the report and diagnostic\ninformation. Fixes source navigation on the document upload wizard.</li>\n</ul>\n</div>\n<div id=\"id6\">\n<h2>2.7.2 (2017-09-06)</h2>\n<ul>\n<li>Fix new mailer creation view. GitLab issue #431.\nThanks to Robert Schöftner (@robert.schoeftner) for the\nreport and the solution.</li>\n<li>Consolidate intial document created event and the first\ndocument properties edited events. Preserve the user that\ninitially creates the document. GitLab issue #433. Thanks\nto Jesaja Everling (@jeverling) for the report.</li>\n<li>Sort the list of root cabinets. Thanks to Thomas Plotkowiak\nfor the request.</li>\n<li>Sort the list of a document’s cabinets.</li>\n<li>Display a document’s cabinet list in italics. GitLab issue #435.\nThanks to LeVon Smoker for the request.</li>\n<li>Install mock by default to allow easier testing of deployed\ninstances.</li>\n</ul>\n</div>\n<div id=\"id7\">\n<h2>2.7.1 (2017-09-03)</h2>\n<ul>\n<li>Support unicode in URL querystring. GitLab issue #423.\nThanks to Gustavo Teixeira (@gsteixei) for the find.</li>\n<li>Import errors during initialization are only ignored\nif they are cause by a missing local.py. Thanks to\nMacRobb Simpson for the report and solution.</li>\n<li>Make sure the local.py created used unicode for strings\nby default. GitLab issue #424. Thanks to Gustavo Teixeira\n(@gsteixei) for the find.</li>\n</ul>\n</div>\n<div id=\"id8\">\n<h2>2.7 (2017-08-30)</h2>\n<ul>\n<li>Add workaround for PDF with IndirectObject as the\nrotation value. GitHub #261.</li>\n<li>Add ACL list link with icon and use it for the document facet menu.</li>\n<li>Fix mailing app permissions labels.</li>\n<li>Add ACLs link and ACLs permissions to the mailer profile model.</li>\n<li>Improve mailer URL regex.</li>\n<li>Add ordering support to the SourceColumn class. GitLab issue #417.</li>\n<li>Shows the cabinets in the document list. GitLab #417 @corneliusludmann</li>\n<li>Add workaround for pycountry versions without the bibliographical key.\nGitHub issue #250.</li>\n<li>Skip UUID migration on Oracle backends. GitHub issue #251.</li>\n<li>Allow changing the output format, DPI of the pdftoppm command, and\nthe output format of the converter via the CONVERTER_GRAPHICS_BACKEND_CONFIG\nsetting. GitHub issues #256 #257 GitLab issue #416.</li>\n<li>Add support for workflow triggers.</li>\n<li>Add support for workflow actions.</li>\n<li>Add support for rendering workflows.</li>\n<li>Add support for unbinding sub menus.</li>\n<li>Fix mailing profile test view.</li>\n<li>Disregard the last 3 dots that mark the end of the YAML document.</li>\n<li>Add support for multiple dashboards.</li>\n<li>Add support for removing dashboard widgets.</li>\n<li>Convert document version view to item list view.</li>\n<li>Add support for browsing individual document versions.</li>\n<li>Add support for dropdown menus to the item list view template.</li>\n<li>Add support for preserving the file extenstion when downloading a document\nversion. GitLab #415.</li>\n<li>Split OCR app into OCR and parsing.</li>\n<li>Remove Folders app.</li>\n<li>Use the literal ‘System’ instead of the target name when\nthe action user in unknown.</li>\n<li>Remove the view to submit all document for OCR.</li>\n<li>When changing document types, don’t delete the old metadata that is\nalso found in the new document type. GitLab issue #421.</li>\n<li>Add tag attach and tag remove events.</li>\n<li>Change the permission needed to attach and remove tags.</li>\n<li>Add HTTP POST workflow state action.</li>\n<li>Add access control grant workflow state action.</li>\n<li>Beta Python 3 support.</li>\n</ul>\n</div>\n<div id=\"id9\">\n<h2>2.6.4 (2017-07-26)</h2>\n<ul>\n<li>Add missing replacements of reverse to resolve_url.</li>\n</ul>\n</div>\n<div id=\"id10\">\n<h2>2.6.3 (2017-07-25)</h2>\n<ul>\n<li>Add makefile target to launch a PostgreSQL container.</li>\n<li>Use resolve_url instead of redirect to resolve the post login URL.</li>\n<li>Make the intialsetup and performupgrade management tasks work\nwith signals to allow customization from 3rd party apps.</li>\n<li>PEP8 cleanups.</li>\n<li>Add tag_ids keyword argument to the Source.handle_upload\nmodel method. GitLab issue #413.</li>\n<li>Add overflow wrapping so wrap long titles in Firefox too.</li>\n<li>Makes Roles searchable. GitLab issue #402.</li>\n<li>Add line numbers to the debug and production loggers.\nAdd date and time to the production logger.</li>\n<li>Add support for generating setup.py from a template. GitLab\n#149 #200.</li>\n<li>Add fade in animation to document images.</li>\n</ul>\n</div>\n<div id=\"id11\">\n<h2>2.6.2 (2017-07-19)</h2>\n<ul>\n<li>Fix deprecation warning to prepare upgrade to Django 1.11 and 2.0.</li>\n<li>Fix document page zoom.</li>\n<li>Add support to run tests against a MySQL, Postgres or Oracle container.</li>\n<li>Improve tag widget customization by moving the markup to its own template.</li>\n<li>Fix document page widget appearance in the document page list view.</li>\n<li>Make document version order deterministic.</li>\n<li>Allow total page number instrospection of encrypted PDF with non ASCII user properties. GitLab issue #411.</li>\n<li>Oracle database compatibility update in the cabinets app. GitHub #258.</li>\n</ul>\n</div>\n<div id=\"id12\">\n<h2>2.6.1 (2017-07-18)</h2>\n<ul>\n<li>Fix issue when editing or removing metadata from multiple documents.</li>\n</ul>\n</div>\n<div id=\"id13\">\n<h2>2.6 (2017-07-18)</h2>\n<ul>\n<li>Fix HTML mark up in window title. GitLab #397.</li>\n<li>Add support for emailing documents to a recipient list. GitLab #396.</li>\n<li>Backport metadata widget changes from @Macrobb. GitLab #377.</li>\n<li>Make users and group searchable.</li>\n<li>Add support for logging errors during in production mode.\nAdd COMMON_PRODUCTION_ERROR_LOG_PATH to control path of log file.\nDefaults to mayan/error.log.</li>\n<li>Add support logging request exceptions.</li>\n<li>Add document list item view.</li>\n<li>Sort setting by namespace label and by global name second.</li>\n<li>Sort indexes by label.</li>\n<li>Fix cabinets permission and access control checking.</li>\n<li>The permission to add or remove documents to cabinets now applies to documents too.</li>\n<li>Equalize dashboard widgets heights.</li>\n<li>Switch the order of the DEFAULT_AUTHENTICATION_CLASSES of DRF. GitLab #400.</li>\n<li>Backport document’s version list view permission.</li>\n<li>Improve code to unbind menu entries.</li>\n<li>Renamed the document type permission namespace from “Document setup” to “Document types”.</li>\n<li>Add support for granting the document type edit, document type delete, and document type view\npermissions to individual document type instances.</li>\n<li>Improved tests by testing for accesses.</li>\n<li>Increase the size of the mailing profile label field to 128 characters.</li>\n</ul>\n</div>\n<div id=\"id14\">\n<h2>2.5.2 (2017-07-08)</h2>\n<ul>\n<li>Improve new document creation signal handling.\nFixes issue with duplicate scanning at upload.</li>\n</ul>\n</div>\n<div id=\"id15\">\n<h2>2.5.1 (2017-07-08)</h2>\n<ul>\n<li>Update release target due to changes in PyPI.</li>\n</ul>\n</div>\n<div id=\"id16\">\n<h2>2.5 (2017-07-07)</h2>\n<ul>\n<li>Add view to download a document’s OCR text. GitLab #215</li>\n<li>Add user configurable mailer. GitLab #286.</li>\n<li>Use Toasts library for screen messages.</li>\n<li>Reduce verbosity of some debug messages.</li>\n<li>Add new lineart transformation.</li>\n<li>Fix SANE source resolution field.</li>\n<li>About and Profile menu reorganization.</li>\n<li>PDF compatibility improvements.</li>\n<li>Office document coversion improvements.</li>\n<li>New metadata type setup UI.</li>\n<li>Duplicated document scan support.</li>\n<li>“Remember me” login support.</li>\n<li>Forgotten password restore via email.</li>\n<li>Document cache disabling.</li>\n<li>Translation improvements.</li>\n<li>Image loading improvements.</li>\n<li>Lower Javascript memory utilization.</li>\n<li>HTML reponsive layout improvements.</li>\n<li>Make document deletion a background task.</li>\n<li>Unicode handling improvements.</li>\n<li>Python3 compatilibyt improvements.</li>\n<li>New screen messages using Toastr.</li>\n</ul>\n</div>\n<div id=\"id17\">\n<h2>2.4 (2017-06-23)</h2>\n<ul>\n<li>Add Django-mathfilters.</li>\n<li>Improve render of documents with no pages.</li>\n<li>Add SANE scanner document source.</li>\n<li>Added PDF orientation detection. GitLab issue #387.</li>\n<li>Fix repeated permission list API URL. GitLab issue #389.</li>\n<li>Fix role creation API endpoint not returning id. GitLab issue #390.</li>\n<li>Make tags, metadata types and cabinets searchable via the dynamic search API. GitLab issue #344.</li>\n<li>Add support for updating configuration options from environment variables.</li>\n<li>Add purgelocks management command. GitLab issue #221.</li>\n<li>Fix index rebuilding for multi value first levels. GitLab issue #391.</li>\n<li>Truncate views titles via the APPEARANCE_MAXIMUM_TITLE_LENGTH setting. GitLab issue #217.</li>\n<li>Add background task manager app. GitLab issue #132.</li>\n<li>Add link to show a document’s OCR errors. GitLab issue #291.</li>\n</ul>\n</div>\n<div id=\"id18\">\n<h2>2.3 (2017-06-08)</h2>\n<ul>\n<li>Allow for bigger indexing expression templates.</li>\n<li>Auto select checkbox when updating metadata values. GitLab issue #371.</li>\n<li>Added support for passing the options allow-other and allow-root to the\nFUSE index mirror. GitLab issue #385</li>\n<li>Add support for check for the latest released version of Mayan from the\nAbout menu.</li>\n<li>Support for rebuilding specific indexes. GitLab issue #372.</li>\n<li>Rewrite document indexing code to be faster and use less locking.</li>\n<li>Use a predefined file path for the file lock.</li>\n<li>Catch documents with not document version when displaying their thumbnails.</li>\n<li>Document page navigation fix when using Mayan as a sub URL app.</li>\n<li>Add support for indexing on workflow state changes.</li>\n<li>Add search model list API endpoint.</li>\n</ul>\n</div>\n<div id=\"id19\">\n<h2>2.2 (2017-04-26)</h2>\n<ul>\n<li>Remove the installation app (GitLab #301).</li>\n<li>Add support for document page search</li>\n<li>Remove recent searches feature</li>\n<li>Remove dependency on the django-filetransfer library</li>\n<li>Fix height calculation in resize transformation</li>\n<li>Improve upgrade instructions</li>\n<li>New image caching pipeline</li>\n<li>New drop down menus for the documents, folders and tags app as well as for\nthe user links.</li>\n<li>New Dashboard view</li>\n<li>Moved licenses to their own module in every app</li>\n<li>Update project to work with Django 1.10.4.</li>\n<li>Tags are alphabetically ordered by label (GitLab #342).</li>\n<li>Stop loading theme fonts from the web (GitLab #343).</li>\n<li>Add support for attaching multiple tags (GitLab #307).</li>\n<li>Integrate the Cabinets app.</li>\n</ul>\n</div>\n<div id=\"id20\">\n<h2>2.1.11 (2017-03-14)</h2>\n<ul>\n<li>Added a quick rename serializer to the document type API serializer.</li>\n<li>Added per document type, workflow list API view.</li>\n<li>Mayan EDMS was adopted a version 1.1 of the Linux Foundation Developer Certificate of Origin.</li>\n<li>Added the detail url of a permission in the permission serializer.</li>\n<li>Added endpoints for the ACL app API.</li>\n<li>Implemented document workflows transition ACLs. GitLab issue #321.</li>\n<li>Add document comments API endpoints. GitHub issue #249.</li>\n<li>Add support for overriding the Celery class.</li>\n<li>Changed the document upload view in source app to not use the HTTP referer\nURL blindly, but instead recompose the URL using known view name. Needed\nwhen integrating Mayan EDMS into other app via using iframes.</li>\n<li>Addes size field to the document version serializer.</li>\n<li>Removed the serializer from the deleted document restore API endpoint.</li>\n<li>Added support for adding or editing document types to smart links via the\nAPI.</li>\n</ul>\n</div>\n<div id=\"id21\">\n<h2>2.1.10 (2017-02-13)</h2>\n<ul>\n<li>Update Makefile to use twine for releases.</li>\n<li>Add Makefile target to make test releases.</li>\n</ul>\n</div>\n<div id=\"id22\">\n<h2>2.1.9 (2017-02-13)</h2>\n<ul>\n<li>Update make file to Workaround long standing pypa wheel bug #99</li>\n</ul>\n</div>\n<div id=\"id23\">\n<h2>2.1.8 (2017-02-12)</h2>\n<ul>\n<li>Fixes in the trashed document API endpoints.</li>\n<li>Improved tags API PUT and PATCH endpoints.</li>\n<li>Bulk document adding when creating and editing tags.</li>\n<li>The version of django-mptt is preserved in case mayan-cabinets is installed.</li>\n<li>Add Django GPG API endpoints for singing keys.</li>\n<li>Add API endpoints for the document states (workflows) app.</li>\n<li>Add API endpoints for the messsage of the day (MOTD) app.</li>\n<li>Add Smart link API endpoints.</li>\n<li>Add writable versions of the Document and Document Type serializers (GitLab issues #348 and #349).</li>\n<li>Close GitLab issue #310 “Metadata’s lookup with chinese messages when new document”</li>\n</ul>\n</div>\n<div id=\"id24\">\n<h2>2.1.7 (2017-02-01)</h2>\n<ul>\n<li>Improved user management API endpoints.</li>\n<li>Improved permissions API endpoints.</li>\n<li>Improvements in the API tests of a few apps.</li>\n<li>Addition Content type list API view to the common app.</li>\n<li>Add API endpoints to the events app.</li>\n<li>Enable the parser and validation fields of the metadata serializer.</li>\n</ul>\n</div>\n<div id=\"id25\">\n<h2>2.1.6 (2016-11-23)</h2>\n<ul>\n<li>Fix variable name typo in the rotation transformation class.</li>\n<li>Update translations</li>\n</ul>\n</div>\n<div id=\"id26\">\n<h2>2.1.5 (2016-11-08)</h2>\n<ul>\n<li>Backport resize transformation math operation fix (GitLab #319).</li>\n<li>Update Pillow to 3.1.2 (Security fix).</li>\n<li>Backport zoom transformation performance improvement (GitLab #334).</li>\n<li>Backport trash can navigation link resolution fix (GitLab #331).</li>\n<li>Improve documentation regarding the use of GPG version 1 (GitLab #333).</li>\n<li>Fix ACL create view HTML response type. (GitLab #335).</li>\n<li>Expland staging folder and watch folder explanation.</li>\n</ul>\n</div>\n<div id=\"id27\">\n<h2>2.1.4 (2016-10-28)</h2>\n<ul>\n<li>Add missing link to the 2.1.3 release notes in the index file.</li>\n<li>Improve TempfileCheckMixin.</li>\n<li>Fix statistics namespace list display view.</li>\n<li>Fix events list display view.</li>\n<li>Update required Django version to 1.8.15.</li>\n<li>Update required python-gnupg version to 0.3.9.</li>\n<li>Improved orphaned temporary files test mixin.</li>\n<li>Re-enable and improve GitLab CI MySQL testing.</li>\n<li>Improved GPG handling.</li>\n<li>New GPG backend system.</li>\n<li>Minor documentation updates.</li>\n</ul>\n</div>\n<div id=\"id28\">\n<h2>2.1.3 (2016-06-29)</h2>\n<ul>\n<li>Add help message when initialsetup migration phase fails. Relates to GitLab issue #296.</li>\n<li>Start using self.setdout instead of print as per documentation.</li>\n<li>Fix GitLab issue #295, “When editing a user the top bar jumps to the name of the user”.</li>\n<li>Normalize handling of temporary file and directory creation.</li>\n<li>Fix GitLab issue #309, “Temp files quickly filling-up my /tmp (1GB tmpfs)”.</li>\n<li>Explicitly check for residual temporary files in tests.</li>\n<li>Add missing temporary file cleanup for office documents.</li>\n<li>Fix file descriptor leak in the document signature download test.</li>\n</ul>\n</div>\n<div id=\"id29\">\n<h2>2.1.2 (2016-05-20)</h2>\n<ul>\n<li>Sort document languages and user profile locale language lists. GitLab issue #292.</li>\n<li>Fix metadata lookup for {{ users }} and {{ group }}. Fixes GitLab #290.</li>\n<li>Add Makefile for common development tasks</li>\n</ul>\n</div>\n<div id=\"id30\">\n<h2>2.1.1 (2016-05-17)</h2>\n<ul>\n<li>Fix navigation issue that make it impossible to add new sources. GitLab issue #288.</li>\n<li>The Tesseract OCR backend now reports if the requested language file is missing. GitLab issue #289.</li>\n<li>Ensure the automatic default index is created after the default document type.</li>\n</ul>\n</div>\n<div id=\"id31\">\n<h2>2.1 (2016-05-14)</h2>\n<ul>\n<li>Upgrade to use Django 1.8.13. Issue #246.</li>\n<li>Upgrade requirements.</li>\n<li>Remove remaining references to Django’s User model. GitLab issue #225</li>\n<li>Rename ‘Content’ search box to ‘OCR’.</li>\n<li>Remove included login required middleware using django-stronghold instead (<a href=\"http://mikegrouchy.com/django-stronghold/\" rel=\"nofollow\">http://mikegrouchy.com/django-stronghold/</a>).</li>\n<li>Improve generation of success and error messages for class based views.</li>\n<li>Remove ownership concept from folders.</li>\n<li>Replace strip_spaces middleware with the spaceless template tag. GitLab issue #255</li>\n<li>Deselect the update checkbox for optional metadata by default.</li>\n<li>Silence all Django 1.8 model import warnings.</li>\n<li>Implement per document type document creation permission. Closes GitLab issue #232.</li>\n<li>Add icons to the document face menu links.</li>\n<li>Increase icon to text spacing to 3px.</li>\n<li>Make document type delete time period optional.</li>\n<li>Fixed date locale handling in document properties, checkout and user detail views.</li>\n<li>Add new permission: checkout details view.</li>\n<li>Add HTML5 upload widget. Issue #162.</li>\n<li>Add Message of the Day app. Issue #222</li>\n<li>Update Document model’s uuid field to use Django’s native UUIDField class.</li>\n<li>Add new split view index navigation</li>\n<li>Newly uploaded documents appear in the Recent document list of the user.</li>\n<li>Document indexes now have ACL support.</li>\n<li>Remove the document index setup permission.</li>\n<li>Status messages now display the object class on which they operate not just the word “Object”.</li>\n<li>More tests added.</li>\n<li>Handle unicode filenames in staging folders.</li>\n<li>Add staging file deletion permission.</li>\n<li>New document_signature_view permission.</li>\n<li>Add support for signing documents.</li>\n<li>Instead of multiple keyservers only one keyserver is now supported.</li>\n<li>Replace document type selection widget with an opened selection list.</li>\n<li>Add mailing documentation chapter.</li>\n<li>Add roadmap documentation chapter.</li>\n<li>API updates.</li>\n</ul>\n</div>\n<div id=\"id32\">\n<h2>2.0.2 (2016-02-09)</h2>\n<ul>\n<li>Install testing dependencies when installing development dependencies.</li>\n<li>Fix GitLab issue #250 “Empty optional lookup metadata trigger validation error”.</li>\n<li>Fix OCR API test.</li>\n<li>Move metadata form value validation to .clean() method.</li>\n<li>Only extract validation error messages from ValidationError exception instances.</li>\n<li>Don’t store empty metadata value if the update checkbox is not checked.</li>\n<li>Add 2 second delay to document version tests to workaround MySQL limitation.</li>\n<li>Strip HTML tags from the browser title.</li>\n<li>Remove Docker and Docker Compose files.</li>\n</ul>\n</div>\n<div id=\"id33\">\n<h2>2.0.1 (2016-01-22)</h2>\n<ul>\n<li>Fix GitLab issue #243, “System allows a user to skip entering values for a required metadata field while uploading a new document”</li>\n<li>Fix GitLab issue #245, “Add multiple metadata not possible”</li>\n<li>Updated Vagrantfile to provision a production box too.</li>\n</ul>\n</div>\n<div id=\"id34\">\n<h2>2.0 (2015-12-04)</h2>\n<ul>\n<li>New source homepage: <a href=\"https://gitlab.com/mayan-edms/mayan-edms\" rel=\"nofollow\">https://gitlab.com/mayan-edms/mayan-edms</a></li>\n<li>Update to Django 1.7</li>\n<li>New Bootstrap Frontend UI</li>\n<li>Easier theming and rebranding</li>\n<li>Improved page navigation interface</li>\n<li>Menu reorganization</li>\n<li>Removal of famfam icon set</li>\n<li>Improved document preview generation</li>\n<li>Document submission for OCR changed to POST</li>\n<li>New YAML based settings system</li>\n<li>Removal of auto admin creation as separate app</li>\n<li>Removal of dependencies</li>\n<li>ACL system refactor</li>\n<li>Object access control inheritance</li>\n<li>Removal of anonymous user support</li>\n<li>Metadata validators refactor</li>\n<li>Trash can support</li>\n<li>Retention policies</li>\n<li>Support for sharing indexes as FUSE filesystems</li>\n<li>Clickable preview images titles</li>\n<li>Removal of eval</li>\n<li>Smarter OCR, per page parsing or OCR fallback</li>\n<li>Improve failure tolerance (not all Operational Errors are critical now)</li>\n<li>RGB tags</li>\n<li>Default document type and default document source</li>\n<li>Link unbinding</li>\n<li>Statistics refactor</li>\n<li>Apps merge</li>\n<li>New signals</li>\n<li>Test improvements</li>\n<li>Indexes recalculation after document creation too</li>\n<li>Upgrade command</li>\n<li>OCR data moved to ocr app from documents app</li>\n<li>New internal document creation workflow return a document stub</li>\n<li>Auto console debug logging during development and info during production</li>\n<li>New class based and menu based navigation system</li>\n<li>New class based transformations</li>\n<li>Usage of Font Awesome icons set</li>\n<li>Management command to remove obsolete permissions: <cite>purgepermissions</cite></li>\n<li>Normalization of ‘title’ and ‘name’ fields to ‘label’</li>\n<li>Improved API, now at version 1</li>\n<li>Invert page title/project name order in browser title</li>\n<li>Django’s class based views pagination</li>\n<li>Reduction of text strings</li>\n<li>Removal of the CombinedSource class</li>\n<li>Removal of default class ACLs</li>\n<li>Removal of the ImageMagick and GraphicsMagick converter backends</li>\n<li>Remove support for applying roles to new users automatically</li>\n<li>Removal of the DOCUMENT_RESTRICTIONS_OVERRIDE permission</li>\n<li>Removed the page_label field</li>\n</ul>\n</div>\n<div id=\"id35\">\n<h2>1.1.1 (2015-05-21)</h2>\n<ul>\n<li>Update to Django 1.6.11</li>\n<li>Fix make_dist.sh script</li>\n<li>Add test for issue #163</li>\n<li>Activate tests for the sources app</li>\n<li>Removal of the registration app</li>\n<li>New simplified official project description</li>\n<li>Improvements to the index admin interface</li>\n<li>Removal of installation statistics gathering</li>\n<li>Remove unused folder tag</li>\n<li>Fix usage of ugettext to ugettext_lazy</li>\n<li>Increase size of the lock name field</li>\n<li>New style documentation</li>\n</ul>\n</div>\n<div id=\"id36\">\n<h2>1.1 (2015-02-10)</h2>\n<ul>\n<li>Uses Celery for background tasks</li>\n<li>Removal of the splash screen</li>\n<li>Adds a home view with common function buttons</li>\n<li>Support for sending and receiving documents via email</li>\n<li>Removed custom logging app in favor of django-actvity-stream</li>\n<li>Adds watch folders</li>\n<li>Includes Vagrant file for unified development and testing environments</li>\n<li>Per user locale profile (language and timezone)</li>\n<li>Includes news document workflow app</li>\n<li>Optional and required metadata types</li>\n<li>Improved testings. Automated tests against SQLite, MySQL, PostgreSQL</li>\n<li>Many new REST API endpoints added</li>\n<li>Simplified text messages</li>\n<li>Improved method for custom settings</li>\n<li>Addition of CORS support to the REST API</li>\n<li>Per document language setting instead of per installation language setting</li>\n<li>Metadata validation and parsing support</li>\n<li>Start of code updates towards Python 3 support</li>\n<li>Simplified UI</li>\n<li>Stable PDF previews generation</li>\n<li>More technical documentation</li>\n</ul>\n</div>\n<div id=\"id37\">\n<h2>1.0 (2014-08-27)</h2>\n<ul>\n<li>New home @ <a href=\"https://github.com/mayan-edms/mayan-edms\" rel=\"nofollow\">https://github.com/mayan-edms/mayan-edms</a></li>\n<li>Updated to use Django 1.6</li>\n<li>Translation updates</li>\n<li>Custom model properties removal</li>\n<li>Source code improvements</li>\n<li>Removal of included 3rd party modules</li>\n<li>Automatic testing and code coverage check</li>\n<li>Update of required modules and libraries versions</li>\n<li>Database connection leaks fixes</li>\n<li>Support for deletion of detached signatures</li>\n<li>Removal of Fabric based installations script</li>\n<li>Pluggable OCR backends</li>\n<li>OCR improvements</li>\n<li>License change, Mayan EDMS in now licensed under the Apache 2.0 License</li>\n<li>PyPI package, Mayan EDMS in now available on PyPI: <a href=\"https://pypi.python.org/pypi/mayan-edms/\" rel=\"nofollow\">https://pypi.python.org/pypi/mayan-edms/</a></li>\n<li>New REST API</li>\n</ul>\n</div>\n\n          </div>"}, "last_serial": 3697226, "releases": {"2.8": [{"comment_text": "", "digests": {"md5": "888cad3e9dc031c75b54209fd391e657", "sha256": "0b3ae03ed95a00a9c5b5ae8109cd7be06060e61bd7fde2ae0d8e6de5d8f89f00"}, "downloads": -1, "filename": "mayan_edms_ng-2.8-py2-none-any.whl", "has_sig": false, "md5_digest": "888cad3e9dc031c75b54209fd391e657", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 8591658, "upload_time": "2018-02-27T09:57:42", "upload_time_iso_8601": "2018-02-27T09:57:42.406909Z", "url": "https://files.pythonhosted.org/packages/ae/7f/ba27cc79f72e03d72baa82e5e6b36b4c6e5d79436319cd84be4530c0211f/mayan_edms_ng-2.8-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a71f9301a154bbfa3c1f2980d7b1466d", "sha256": "c0a32a7f677c5d95707950085e2ce3eb348b1394711bd5481268c92c647f6670"}, "downloads": -1, "filename": "mayan-edms-ng-2.8.tar.gz", "has_sig": false, "md5_digest": "a71f9301a154bbfa3c1f2980d7b1466d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6524939, "upload_time": "2018-02-27T09:58:42", "upload_time_iso_8601": "2018-02-27T09:58:42.973586Z", "url": "https://files.pythonhosted.org/packages/ae/47/b0213b862be19fd32f5d2aec1744a824e9379ecccfd453db8758bdf463c7/mayan-edms-ng-2.8.tar.gz", "yanked": false}], "3.0": [{"comment_text": "", "digests": {"md5": "82ccfda7b4195522b725568479d2e6e3", "sha256": "0f28d6fd7cd43f31fef79d363e7315fa5befc332a587c7ebb4aec1d6a1b8e6ac"}, "downloads": -1, "filename": "mayan_edms_ng-3.0-py2-none-any.whl", "has_sig": false, "md5_digest": "82ccfda7b4195522b725568479d2e6e3", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 13887326, "upload_time": "2018-03-20T08:42:29", "upload_time_iso_8601": "2018-03-20T08:42:29.872438Z", "url": "https://files.pythonhosted.org/packages/9c/3a/a87c3b08f5202962c65ac676a3e20092b068875fc1182419515dbe075c34/mayan_edms_ng-3.0-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7b1314dbff54f92f1d24a2c3370c5516", "sha256": "a613b879f9e777861f571c669e473eff2094898fae789f924d31b4ec6fb222da"}, "downloads": -1, "filename": "mayan-edms-ng-3.0.tar.gz", "has_sig": false, "md5_digest": "7b1314dbff54f92f1d24a2c3370c5516", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10798512, "upload_time": "2018-03-20T08:43:59", "upload_time_iso_8601": "2018-03-20T08:43:59.852372Z", "url": "https://files.pythonhosted.org/packages/fe/1c/bdd1a1eb0bcbe3fce64f003c24bce11b018b50c9f79470bd4af9a634fa21/mayan-edms-ng-3.0.tar.gz", "yanked": false}], "3.0.1": [{"comment_text": "", "digests": {"md5": "2156e122977a5e0a17904e5d221741f3", "sha256": "08d6bbe61518d717b19ea8402e8b25eebdf5e2e35da0610dfe15143764329f3b"}, "downloads": -1, "filename": "mayan_edms_ng-3.0.1-py2-none-any.whl", "has_sig": false, "md5_digest": "2156e122977a5e0a17904e5d221741f3", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 13863390, "upload_time": "2018-03-22T09:11:28", "upload_time_iso_8601": "2018-03-22T09:11:28.688865Z", "url": "https://files.pythonhosted.org/packages/2e/89/0984c374839212b925359cb372ad02e99969711210172cb66b2b761c1d85/mayan_edms_ng-3.0.1-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f54fdcffeabcad376ee40a26ad095982", "sha256": "eb30ee5553fc9c78de76a9fa87416e43ac1e91ddcd18a65cd6d6b9208f4a88c4"}, "downloads": -1, "filename": "mayan-edms-ng-3.0.1.tar.gz", "has_sig": false, "md5_digest": "f54fdcffeabcad376ee40a26ad095982", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10789685, "upload_time": "2018-03-22T09:12:51", "upload_time_iso_8601": "2018-03-22T09:12:51.485181Z", "url": "https://files.pythonhosted.org/packages/0e/52/0c1dd2911b1082a2b678bc65361b2db4bdd524b3f5e6ae9158ef6c76e44b/mayan-edms-ng-3.0.1.tar.gz", "yanked": false}], "3.0.2": [{"comment_text": "", "digests": {"md5": "e51e58725543b2f214cc41c767e0ccd3", "sha256": "690973c4124beef972a507f6af19b367f2d80a4114e0ab354b71bb8c6994ddd7"}, "downloads": -1, "filename": "mayan_edms_ng-3.0.2-py2-none-any.whl", "has_sig": false, "md5_digest": "e51e58725543b2f214cc41c767e0ccd3", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 13863592, "upload_time": "2018-03-22T23:48:01", "upload_time_iso_8601": "2018-03-22T23:48:01.958296Z", "url": "https://files.pythonhosted.org/packages/03/25/04a6041e4aadf06b71f70ff1edadfb2442813b5095a2c9076eecbb86c786/mayan_edms_ng-3.0.2-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "93119b8268df3827b756ec768c4fd94d", "sha256": "12f69c50775dc1f7a6f41ec7c649b6705d7c66f6d4c93caa131c6262c6e78f1e"}, "downloads": -1, "filename": "mayan-edms-ng-3.0.2.tar.gz", "has_sig": false, "md5_digest": "93119b8268df3827b756ec768c4fd94d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10789740, "upload_time": "2018-03-22T23:49:30", "upload_time_iso_8601": "2018-03-22T23:49:30.320306Z", "url": "https://files.pythonhosted.org/packages/ec/9e/260bd39459855e82b609419f9d8cd29015f03287636e5c08c7a2a74974e6/mayan-edms-ng-3.0.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "e51e58725543b2f214cc41c767e0ccd3", "sha256": "690973c4124beef972a507f6af19b367f2d80a4114e0ab354b71bb8c6994ddd7"}, "downloads": -1, "filename": "mayan_edms_ng-3.0.2-py2-none-any.whl", "has_sig": false, "md5_digest": "e51e58725543b2f214cc41c767e0ccd3", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 13863592, "upload_time": "2018-03-22T23:48:01", "upload_time_iso_8601": "2018-03-22T23:48:01.958296Z", "url": "https://files.pythonhosted.org/packages/03/25/04a6041e4aadf06b71f70ff1edadfb2442813b5095a2c9076eecbb86c786/mayan_edms_ng-3.0.2-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "93119b8268df3827b756ec768c4fd94d", "sha256": "12f69c50775dc1f7a6f41ec7c649b6705d7c66f6d4c93caa131c6262c6e78f1e"}, "downloads": -1, "filename": "mayan-edms-ng-3.0.2.tar.gz", "has_sig": false, "md5_digest": "93119b8268df3827b756ec768c4fd94d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10789740, "upload_time": "2018-03-22T23:49:30", "upload_time_iso_8601": "2018-03-22T23:49:30.320306Z", "url": "https://files.pythonhosted.org/packages/ec/9e/260bd39459855e82b609419f9d8cd29015f03287636e5c08c7a2a74974e6/mayan-edms-ng-3.0.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:57:07 2020"}