{"info": {"author": "Jiao Lin", "author_email": "linjiao@caltech.edu", "bugtrack_url": null, "classifiers": ["Intended Audience :: Education", "Intended Audience :: Science/Research", "Programming Language :: C++", "Programming Language :: Python :: 2", "Topic :: Scientific/Engineering :: Physics"], "description": "MCViNE is a Monte Carlo simulation framework useful for simulating neutron experiments.\r\n\r\nMCViNE is a framework to construct simulated neutron instruments, and manage the flow of neutrons through them from moderator to detector.\r\n\r\nIt also provides a mechanism to allow users to assemble a complex sample component (including sample and also the sample environment, eg. sample holder). This mechanism is extensible to handle arbitrary complex geometeric shapes of neutron scatterer, and arbitrary complex physics of neutron scattering.", "description_content_type": null, "docs_url": null, "download_url": "http://dev.danse.us/packages/mcvine-1.0beta-src.tgz", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://docs.danse.us/MCViNE", "keywords": "neutron, neutron scattering, Monte Carlo, virtual experiment", "license": "This software is part of the open-source DANSE project at the California\r\nInstitute of Technology, and is available subject to the conditions and\r\nterms laid out below. By downloading and using this software you are\r\nagreeing to the following conditions.\r\n\r\nRedistribution and use in source and binary forms, with or without\r\nmodification, are permitted provided that the following conditions\r\nare met::\r\n\r\n    - Redistribution of source code must retain the above copyright\r\n      notice, this list of conditions and the following disclaimer.\r\n\r\n    - Redistribution in binary form must reproduce the above copyright\r\n      notice, this list of conditions and the following disclaimer in the\r\n      documentations and/or other materials provided with the distribution.\r\n\r\n    - Neither the name of the California Institute of Technology nor\r\n      the names of its contributors may be used to endorse or promote\r\n      products derived from this software without specific prior written\r\n      permission.\r\n\r\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\r\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED\r\nTO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\r\nPURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR\r\nCONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\r\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\r\nPROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;\r\nOR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\r\nWHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR\r\nOTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF\r\nADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\r\n\r\nCopyright (c) 2006-2010 California Institute of Technology. All rights reserved.\r\n\r\n\r\nIf you use this software to create productive user interfaces, we ask \r\nthat you acknowledge use of the software by citing the\r\nfollowing paper in your publication or your software site:\r\n\r\n    \"MCViNE: Monte Carlo VItual Neutron Experiment\",\r\n     Jiao Lin and Brent Fultz, unpublished;\r\n     http://danse.us/trac/MCViNE", "maintainer": "Jiao Lin", "maintainer_email": "linjiao@caltech.edu", "name": "mcvine", "package_url": "https://pypi.org/project/mcvine/", "platform": "Linux", "project_url": "https://pypi.org/project/mcvine/", "project_urls": {"Download": "http://dev.danse.us/packages/mcvine-1.0beta-src.tgz", "Homepage": "http://docs.danse.us/MCViNE"}, "release_url": "https://pypi.org/project/mcvine/1.0%20beta/", "requires_dist": null, "requires_python": null, "summary": "Monte Carlo VIrtual Neutron Experiment", "version": "1.0 beta", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>MCViNE is a Monte Carlo simulation framework useful for simulating neutron experiments.</p>\n<p>MCViNE is a framework to construct simulated neutron instruments, and manage the flow of neutrons through them from moderator to detector.</p>\n<p>It also provides a mechanism to allow users to assemble a complex sample component (including sample and also the sample environment, eg. sample holder). This mechanism is extensible to handle arbitrary complex geometeric shapes of neutron scatterer, and arbitrary complex physics of neutron scattering.</p>\n\n          </div>"}, "last_serial": 803078, "releases": {"1.0 beta": []}, "urls": [], "timestamp": "Fri May  8 00:56:53 2020"}