{"info": {"author": "Simon W. Jackson | miniArray", "author_email": "simon@miniarray.com", "bugtrack_url": null, "classifiers": [], "description": "# Description\n\nmelody-dl - Command line utility that downloads audio files from various\nwebsites.\n\n**Download from:**\n\n* [Bandcamp](http://www.bandcamp.com)\n* [8 Bit Peoples](http://www.8bitpeoples.com)\n* [Poly Vinyl](http://www.polyvinyl.com)\n* [more to come..](https://github.com/miniArray/melody-dl/issues?labels=extractor&page=1&state=open)\n\n# Synopsis\n\n    $ melody-dl URL\n\n# Install\n\n    $ pip install melody-dl\n\n# Details Usage:\n\n    melody-dl [--template=<template>] [--base-dir=<dir>]\n              [--quiet] [--full-album] <url>\n    melody-dl (-h | --help)\n    melody-dl (--version)\n\n# Options\n\n    -h --help                 Show this screen.\n    -v --version              Show version.\n    -q --quiet                Dont display anything to the screen.\n    -t --template=<template>  Output filename template.\n                              [default: %{artist}/%{album}/%{track} - %{title}]\n    -d --base-dir=<dir>       Base location of which all files are downloaded\n\n# Fiename Template\n\nThe `--template` option allows users to indicate a template for the output file\nnames and directories. Templates can be built using special tokens with the\nformat of `%{artist}`. Here is a list of allowed tokens:\n\n* `artist`: The artist name.\n* `album`: The album name.\n* `track`: The track number.\n* `title`: The track title.\n\nThe default template is: `%{artist}/%{album}/%{track} - %{title}`.\n\n# Requirements\n\nIt is released to the public domain, which means you can modify it, redistribute\nit or use it how ever you like.\n\n# Bugs\n\nBus should be reported at [https://github.com/miniarray/melody-dl/issues]().\nPlease include the full output of the command when run with `--verbose`.  The\noutput (including the first lines) contain important debugging information.\nIssues without the full output are often not reproducible and therefore do not\nget solved in short order, if ever.\n\nFor discussions, join us in the irc channel\n[#melody-dl](irc://chat.freenode.net/melody-dl) on freenode.\n\nWhen you submit a request, please re-read it once to avoid a couple of mistakes\n(you can and should use this as a checklist):\n\n### Is the description of the issue itself sufficient?\n\nWe often get issue reports that we cannot really decipher. While in most cases\nwe eventually get the required information after asking back multiple times,\nthis poses an unnecessary drain on our resources. Many contributors, including\nmyself, are also not native speakers, so we may misread some parts.\n\nSo please elaborate on what feature you are requesting, or what bug you want to\nbe fixed. Make sure that it's obvious:\n\n>  1. **What the problem is**\n>  2. **How it could be fixed**\n>  3. **How your proposed solution would look like**\n\nIf your report is shorter than two lines, it is almost certainly missing some of\nthese, which makes it hard for us to respond to it. We're often too polite to\nclose the issue outright, but the missing info makes misinterpretation likely.\nAs a commiter myself, I often get frustrated by these issues, since the only\npossible way for me to move forward on them is to ask for clarification over and\nover.\n\nFor bug reports, this means that your report should contain the *complete*\noutput of melody-dl when called with the `-v` flag. The error message you get\nfor (most) bugs even says so, but you would not believe how many of our bug\nreports do not contain this information.\n\nSite support requests **must contain an example URL**. An example URL is a URL\nyou might want to download, like `lifeformed.bandcamp.com/album/fastfall`.\n\n###  Are you using the latest version?\n\nThis should report that you're up-to-date. About 20% of the reports we receive\nare already fixed, but people are using outdated versions. This goes for feature\nrequests as well.\n\n###  Is the issue already documented?\n\nMake sure that someone has not already opened the issue you're trying to open.\nSearch at the top of the window or at\n[https://github.com/miniarray/melody-dl/search?type=Issues](Issues) . If\nthere is an issue, feel free to write something along the lines of \"This affects\nme as well, with version 2015.01.01. Here is some more information on the issue:\n...\". While some issues may be old, a new post into them often spurs rapid\nactivity.\n\n###  Why are existing options not enough?\n\nBefore requesting a new feature, please have a quick peek at [the list of\nsupported\noptions](https://github.com/miniarray/melody-dl/blob/master/README.md#synopsis).\nMany feature requests are for features that actually exist already! Please,\nabsolutely do show off your work in the issue report and detail how the existing\nsimilar options do *not* solve your problem.\n\n###  Is there enough context in your bug report?\n\nPeople want to solve problems, and often think they do us a favor by breaking\ndown their larger problems (e.g. wanting to skip already downloaded files) to a\nspecific request (e.g. requesting us to look whether the file exists before\ndownloading the info page). However, what often happens is that they break down\nthe problem into two steps: One simple, and one impossible (or extremely\ncomplicated one).\n\nWe are then presented with a very complicated request when the original problem\ncould be solved far easier, e.g. by recording the downloaded video IDs in a\nseparate file. To avoid this, you must include the greater context where it is\nnon-obvious. In particular, every feature request that does not consist of\nadding support for a new site should contain a use case scenario that explains\nin what situation the missing feature would be useful.\n\n###  Does the issue involve one problem, and one problem only?\n\nSome of our users seem to think there is a limit of issues they can or should\nopen. There is no limit of issues they can or should open. While it may seem\nappealing to be able to dump all your issues into one ticket, that means that\nsomeone who solves one of your issues cannot mark the issue as closed.\nTypically, reporting a bunch of issues leads to the ticket lingering since\nnobody wants to attack that behemoth, until someone mercifully splits the issue\ninto multiple ones.\n\nIn particular, every site support request issue should only pertain to services\nat one site (generally under a common domain, but always using the same backend\ntechnology). Do not request support for vimeo user videos, Whitehouse podcasts,\nand Google Plus pages in the same issue. Also, make sure that you don't post bug\nreports alongside feature requests. As a rule of thumb, a feature request does\nnot include outputs of melody-dl that are not immediately related to the feature\nat hand. Do not post reports of a network error alongside the request for a new\nvideo service.\n\n###  Is anyone going to need the feature?\n\nOnly post features that you (or an incapicated friend you can personally talk\nto) require. Do not post features because they seem like a good idea. If they\nare really useful, they will be requested by someone who requires them.\n\n###  Is your question about melody-dl?\n\nIt may sound strange, but some bug reports we receive are completely unrelated\nto melody-dl and relate to a different or even the reporter's own application.\nPlease make sure that you are actually using melody-dl. If you are using a UI\nfor melody-dl, report the bug to the maintainer of the actual application\nproviding the UI. On the other hand, if your UI for melody-dl fails in some way\nyou believe is related to melody-dl, by all means, go ahead and report the bug.\n\n# Dependencies\n\n* [BeautifulSoup](https://pypi.python.org/pypi/beautifulsoup4) - HTML Parsing\n* [Mutagen](https://pypi.python.org/pypi/mutagen) - ID3 Encoding\n* [Requests](https://pypi.python.org/pypi/requests) - for retriving the HTML\n* [Slimit](https://pypi.python.org/pypi/slimit) - Javascript parsing\n* Python version 2.7+\n\n# Copyright\n\nmelody-dl is released into the public domain by the copytright holders\n\nThis README file was inspired by the\n[youtube-dl](https://github.com/rg3/youtube-dl/blob/master/README.md) docs and\nis likewise released into the public domain.", "description_content_type": null, "docs_url": null, "download_url": "https://github.com/miniarray/melody-dl/tarball/v0.1.5", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://melody-dl.com", "keywords": "download,music,audio", "license": "LICENSE.txt", "maintainer": null, "maintainer_email": null, "name": "melody-dl", "package_url": "https://pypi.org/project/melody-dl/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/melody-dl/", "project_urls": {"Download": "https://github.com/miniarray/melody-dl/tarball/v0.1.5", "Homepage": "http://melody-dl.com"}, "release_url": "https://pypi.org/project/melody-dl/0.1.5/", "requires_dist": null, "requires_python": null, "summary": "Command line utility that downloads audio files from various websites.", "version": "0.1.5", "yanked": false, "html_description": "<div class=\"project-description\">\n            # Description<br><br>melody-dl - Command line utility that downloads audio files from various<br>websites.<br><br>**Download from:**<br><br>* [Bandcamp](http://www.bandcamp.com)<br>* [8 Bit Peoples](http://www.8bitpeoples.com)<br>* [Poly Vinyl](http://www.polyvinyl.com)<br>* [more to come..](https://github.com/miniArray/melody-dl/issues?labels=extractor&amp;page=1&amp;state=open)<br><br># Synopsis<br><br>    $ melody-dl URL<br><br># Install<br><br>    $ pip install melody-dl<br><br># Details Usage:<br><br>    melody-dl [--template=&lt;template&gt;] [--base-dir=&lt;dir&gt;]<br>              [--quiet] [--full-album] &lt;url&gt;<br>    melody-dl (-h | --help)<br>    melody-dl (--version)<br><br># Options<br><br>    -h --help                 Show this screen.<br>    -v --version              Show version.<br>    -q --quiet                Dont display anything to the screen.<br>    -t --template=&lt;template&gt;  Output filename template.<br>                              [default: %{artist}/%{album}/%{track} - %{title}]<br>    -d --base-dir=&lt;dir&gt;       Base location of which all files are downloaded<br><br># Fiename Template<br><br>The `--template` option allows users to indicate a template for the output file<br>names and directories. Templates can be built using special tokens with the<br>format of `%{artist}`. Here is a list of allowed tokens:<br><br>* `artist`: The artist name.<br>* `album`: The album name.<br>* `track`: The track number.<br>* `title`: The track title.<br><br>The default template is: `%{artist}/%{album}/%{track} - %{title}`.<br><br># Requirements<br><br>It is released to the public domain, which means you can modify it, redistribute<br>it or use it how ever you like.<br><br># Bugs<br><br>Bus should be reported at [https://github.com/miniarray/melody-dl/issues]().<br>Please include the full output of the command when run with `--verbose`.  The<br>output (including the first lines) contain important debugging information.<br>Issues without the full output are often not reproducible and therefore do not<br>get solved in short order, if ever.<br><br>For discussions, join us in the irc channel<br>[#melody-dl](irc://chat.freenode.net/melody-dl) on freenode.<br><br>When you submit a request, please re-read it once to avoid a couple of mistakes<br>(you can and should use this as a checklist):<br><br>### Is the description of the issue itself sufficient?<br><br>We often get issue reports that we cannot really decipher. While in most cases<br>we eventually get the required information after asking back multiple times,<br>this poses an unnecessary drain on our resources. Many contributors, including<br>myself, are also not native speakers, so we may misread some parts.<br><br>So please elaborate on what feature you are requesting, or what bug you want to<br>be fixed. Make sure that it's obvious:<br><br>&gt;  1. **What the problem is**<br>&gt;  2. **How it could be fixed**<br>&gt;  3. **How your proposed solution would look like**<br><br>If your report is shorter than two lines, it is almost certainly missing some of<br>these, which makes it hard for us to respond to it. We're often too polite to<br>close the issue outright, but the missing info makes misinterpretation likely.<br>As a commiter myself, I often get frustrated by these issues, since the only<br>possible way for me to move forward on them is to ask for clarification over and<br>over.<br><br>For bug reports, this means that your report should contain the *complete*<br>output of melody-dl when called with the `-v` flag. The error message you get<br>for (most) bugs even says so, but you would not believe how many of our bug<br>reports do not contain this information.<br><br>Site support requests **must contain an example URL**. An example URL is a URL<br>you might want to download, like `lifeformed.bandcamp.com/album/fastfall`.<br><br>###  Are you using the latest version?<br><br>This should report that you're up-to-date. About 20% of the reports we receive<br>are already fixed, but people are using outdated versions. This goes for feature<br>requests as well.<br><br>###  Is the issue already documented?<br><br>Make sure that someone has not already opened the issue you're trying to open.<br>Search at the top of the window or at<br>[https://github.com/miniarray/melody-dl/search?type=Issues](Issues) . If<br>there is an issue, feel free to write something along the lines of \"This affects<br>me as well, with version 2015.01.01. Here is some more information on the issue:<br>...\". While some issues may be old, a new post into them often spurs rapid<br>activity.<br><br>###  Why are existing options not enough?<br><br>Before requesting a new feature, please have a quick peek at [the list of<br>supported<br>options](https://github.com/miniarray/melody-dl/blob/master/README.md#synopsis).<br>Many feature requests are for features that actually exist already! Please,<br>absolutely do show off your work in the issue report and detail how the existing<br>similar options do *not* solve your problem.<br><br>###  Is there enough context in your bug report?<br><br>People want to solve problems, and often think they do us a favor by breaking<br>down their larger problems (e.g. wanting to skip already downloaded files) to a<br>specific request (e.g. requesting us to look whether the file exists before<br>downloading the info page). However, what often happens is that they break down<br>the problem into two steps: One simple, and one impossible (or extremely<br>complicated one).<br><br>We are then presented with a very complicated request when the original problem<br>could be solved far easier, e.g. by recording the downloaded video IDs in a<br>separate file. To avoid this, you must include the greater context where it is<br>non-obvious. In particular, every feature request that does not consist of<br>adding support for a new site should contain a use case scenario that explains<br>in what situation the missing feature would be useful.<br><br>###  Does the issue involve one problem, and one problem only?<br><br>Some of our users seem to think there is a limit of issues they can or should<br>open. There is no limit of issues they can or should open. While it may seem<br>appealing to be able to dump all your issues into one ticket, that means that<br>someone who solves one of your issues cannot mark the issue as closed.<br>Typically, reporting a bunch of issues leads to the ticket lingering since<br>nobody wants to attack that behemoth, until someone mercifully splits the issue<br>into multiple ones.<br><br>In particular, every site support request issue should only pertain to services<br>at one site (generally under a common domain, but always using the same backend<br>technology). Do not request support for vimeo user videos, Whitehouse podcasts,<br>and Google Plus pages in the same issue. Also, make sure that you don't post bug<br>reports alongside feature requests. As a rule of thumb, a feature request does<br>not include outputs of melody-dl that are not immediately related to the feature<br>at hand. Do not post reports of a network error alongside the request for a new<br>video service.<br><br>###  Is anyone going to need the feature?<br><br>Only post features that you (or an incapicated friend you can personally talk<br>to) require. Do not post features because they seem like a good idea. If they<br>are really useful, they will be requested by someone who requires them.<br><br>###  Is your question about melody-dl?<br><br>It may sound strange, but some bug reports we receive are completely unrelated<br>to melody-dl and relate to a different or even the reporter's own application.<br>Please make sure that you are actually using melody-dl. If you are using a UI<br>for melody-dl, report the bug to the maintainer of the actual application<br>providing the UI. On the other hand, if your UI for melody-dl fails in some way<br>you believe is related to melody-dl, by all means, go ahead and report the bug.<br><br># Dependencies<br><br>* [BeautifulSoup](https://pypi.python.org/pypi/beautifulsoup4) - HTML Parsing<br>* [Mutagen](https://pypi.python.org/pypi/mutagen) - ID3 Encoding<br>* [Requests](https://pypi.python.org/pypi/requests) - for retriving the HTML<br>* [Slimit](https://pypi.python.org/pypi/slimit) - Javascript parsing<br>* Python version 2.7+<br><br># Copyright<br><br>melody-dl is released into the public domain by the copytright holders<br><br>This README file was inspired by the<br>[youtube-dl](https://github.com/rg3/youtube-dl/blob/master/README.md) docs and<br>is likewise released into the public domain.\n          </div>"}, "last_serial": 1124192, "releases": {"0.1.5": [{"comment_text": "", "digests": {"md5": "2e7b0ec61c6722ae03d41cab479ad18b", "sha256": "85c0f4e510179d7029aa58700fdf5e0fcca5b9a5353473046e32d0eda50c7cc4"}, "downloads": -1, "filename": "melody-dl-0.1.5.tar.gz", "has_sig": false, "md5_digest": "2e7b0ec61c6722ae03d41cab479ad18b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8175, "upload_time": "2014-06-13T16:38:16", "upload_time_iso_8601": "2014-06-13T16:38:16.006779Z", "url": "https://files.pythonhosted.org/packages/6a/bc/ec47da14c45f56ef4205446e27df13a46b35afd14f4a69b33686dcbec6c0/melody-dl-0.1.5.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "2e7b0ec61c6722ae03d41cab479ad18b", "sha256": "85c0f4e510179d7029aa58700fdf5e0fcca5b9a5353473046e32d0eda50c7cc4"}, "downloads": -1, "filename": "melody-dl-0.1.5.tar.gz", "has_sig": false, "md5_digest": "2e7b0ec61c6722ae03d41cab479ad18b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8175, "upload_time": "2014-06-13T16:38:16", "upload_time_iso_8601": "2014-06-13T16:38:16.006779Z", "url": "https://files.pythonhosted.org/packages/6a/bc/ec47da14c45f56ef4205446e27df13a46b35afd14f4a69b33686dcbec6c0/melody-dl-0.1.5.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:56:23 2020"}