{"info": {"author": "Yaco Sistemas", "author_email": "msaelices@yaco.es", "bugtrack_url": null, "classifiers": ["Environment :: Web Environment", "Framework :: Django", "Intended Audience :: Developers", "License :: OSI Approved :: GNU Library or Lesser General Public License (LGPL)", "Operating System :: OS Independent", "Programming Language :: Python", "Topic :: Internet :: WWW/HTTP", "Topic :: Internet :: WWW/HTTP :: Dynamic Content", "Topic :: Internet :: WWW/HTTP :: WSGI", "Topic :: Software Development :: Libraries :: Application Frameworks", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "============================\nDjango-based CMS on steroids\n============================\n\nMerengue is a full-featured and pluggable CMS designed for creating websites, writing less code and mantaining clean, elegant and re-usable code.\n\nMore information in http://www.merengueproject.org/  \n\n\nChanges\n=======\n\nVersion 0.9.0\n-------------\n\n* Merge custommeta plugin into core plugin and refactor merengue so every portal will be able to use custom meta pages. See #2365.\n* Add the anonymous user of view of the menus. See #2366.\n* Fix adding group to roles when settings the permissions of an object. See #2364.\n* Support configurable plain text generation for all contents, useful for indexing in search engines. See #1088.\n* Refactor standingout plugin to improve its use inside sections or microsites. See #2358.\n* Add support for django message framework instead of using the old cmsutils.log. See #2362.\n* Catch SMTP exceptions, which are sent to the user. See #2361.\n* Extend global model admins (no related ones) change permission to users that own contents or are owners of a section/microsite. See #2360.\n* Add searchform to merengue jsi18n catalog. See #2359.\n* Section owners now are able to edit any related content to the section. See #2357.\n* Fix contactform opts bug when filling name field. See #2355.\n* Restricted admin of basesection. See #2356.\n* Add order in standingout categories. See #2354.\n* Fix javascript comparisons. See #2352.\n* In ``contactform`` plugin fields order is the same that admin interface. See #2351.\n* Rename file names with accents in ``filebrowser`` plugin to avoid problems. See #2349.\n* Fixed statistics error in ``piwik`` plugin. See #2348.\n* Avoid problems when trying to save a CMYK image as PNG. See #2347.\n* Fix breadcrumbs signature in plugins and base objects. See #2345.\n* Create plugins to set meta title, description and keywords to any page. See #2341.\n* Updated saml2 plugin to work with djangosaml2-0.6.1. See #2335.\n* Allow staff users to access model admins of the objects they own. See #2343.\n* Sort contents inside a contentgroup in ``contentmenu`` plugin. See #2334.\n* Fix bug in collection limit. See #2331.\n* Now the contact form block if the form has error is not cacheable. See #2329.\n* Fix calendar block when changing months. See #2330.\n* Customizable section views for developers. See #2324.\n* Enable plugins before any other merengue middleware. See #2325.\n* Improve ``contactform`` plugin. Add a name field to the options of a contact form so you can identify options by using their name instead of 'option_N'. See #2326.\n* The link of the custom portlet plugin is now optional. See #2327.\n* Update django-compressor to the 1.1.2 release. See #2328.\n* Allow to overwrite the default content commentable behaviour with a ``CONTENT_COMMENTABLE_BY_DEFAULT`` setting. See #2317.\n* Add a category filtered block in banner plugin. See #2316.\n* Add links into a microsite. See #2312.\n* Implement a method that allows sections to insert css classes into body.\n\nVersion 0.8.2\n-------------\n\n* Fixed an UnicodeDecodeError caused by transmeta 0.6.7 version. See #2308.\n\nVersion 0.8.1\n-------------\n\n* Fixed a weird error when registering new plugins. See #2229.\n* Improved setup.py keywords to improve searching on pypi. See #2284.\n\nVersion 0.8.0-final\n-------------------\n\n* More Selenium tests. See #2136 and #1746.\n* Invalid the block cache when user edit a block using inline edit. See #2242.\n* SEO improvements, with ``sitemap.xml`` generation. See #2248.\n* Included ``merengue/media`` in the synchronized media when you executes ``sync_apps_media`` command. See #2243.\n* Including expire headers in nginx configuration in the install documentation. See #377.\n* Incluiding inline edit to highlight plugin. See #2246.\n* Complete view for reporting a permission denied to the user and manager. See #2151.\n* More translations. See #2.\n* Unfrozen recaptcha client dependence in ``contactform`` plugin. See #2267.\n* Added cache block in ``render_single_block`` tag. See #2269.\n* Hided 3d images and panoramic views, because are not fully implemented in Merengue. See #2275.\n* New Debug Toolbar panel with blocks information for profiling purposes. See #2276.\n* \"Cache invalidation\" permission to have a more grained authorization. Fixes #2277.\n* Vast improvement in Merengue performance:\n\n * ``Menu.get_section`` improvement. See #2233.\n * Edit inline improvement. See #2234.\n * RSS plugin caching. See #2235.\n * Block cache is more efficient. See #2236.\n * ``getEventsMonthYear`` improvement. See #2238.\n * ``MenuBlock`` improvement. See #2241.\n\n* Bugfixes:\n\n * Fixed inplaceeditform error with text fields whose font size is not integer. See #2222.\n * Flowplayer error fixed in IE. See #2224.\n * Fixed error when CSS and JS compression is enabled. See #2223.\n * Fixed permission error in object when the passed object is None. See #2110.\n * Improved the inplace edit logic to check the \"edit\" permission. See #2230.\n * Some layout error. See #2217.\n * User is able to edit the blocks that are non cacheables. See #2237.\n * Fixed some migrations when executed in very old merengue sites. See #2244.\n * Now the ``render_single_block`` works with ``ContentBlock``. See #2252.\n * Make sure the unit tests run with dummy cache. See #2254.\n * Registry cache should not set cache when empty elements found. See #2255.\n * Fixed \"save and restore config\" issues. See #2189 and #918.\n * Fixed the inline edit when it's used with the intro button to save changes. See #2256.\n * Fixed permission test suite, related to a caching invalidation error. See #2253.\n * Avoid 301 redirect caching by some browser like Chrome or Firefox 3.5+. See #2220.\n * Error in AJAX request in the collection admin when the collection is inside a section. See #2260.\n * Error when installing some plugins after uninstalling them without server reloading. See #2262.\n * Removing some absolute references between CSS and the images. See #2264.\n * Now the ``contactform`` plugin works if this loaded with ajax, although this is not a default behaviour. See #2268.\n * Fixed a migration when GIS is disabled. See #2271.\n * Frozen ``django-mptt`` and ``django-ajax-selects`` packages because are now backward incompatibles. See #2278 and #2279\n \nVersion 0.8.0-rc2 (r5269)\n-------------------------\n\n* Fixed migration in MySQL databases. See #2215.\n\n* New non addable blocks. See #2147.\n\n* Optimized Merengue registry. See #2142.\n\n* Optimized permissions system. See #1322.\n\n* Optimized SQL sentences. See #2144.\n\n* Changed plugin detection implementation to make it works in all environments (deployments). This approach removes using a external process. See #2158.\n\n* Removed the ``--develop`` option in ``startproject`` command. By default the merengue will be symlinked. See #2148.\n\n* Completed spanish translations. See #2.\n\n* Completed and reviewed the documentation. See #377.\n\n* Changed JW Player to flowplayer, which is completely free. See #2199.\n\n* New ``MERENGUE_MAX_FILE_SIZE`` and ``MERENGUE_MAX_IMAGE_SIZE`` parameters to restrict the size of uploaded files. See #2185.\n\n* Reduced size of test data. See #2141.\n\n* Added ``anchor`` button to the tinyMCE.\n\n* Improved and fixing the Yaco theme look&feel. See #1990.\n\n* Include spellchecking in the visual editor, that will be in English by default.\n\n* Selenium tests for permission system. See #2136.\n\n* Make customizable the reviewers who will receive the review task notifications. See #2193.\n\n* The tags are now comma separated. See #2155.\n\n* Sortable fields for search form. See #2175.\n\n* Used autocompletion widget to select the main content of a section. See #2115.\n\n* New ``max_num_items`` parameter to the ``MenuBlock`` which collapse any menú branch if the number of children became higher than the parameter. See #2161.\n\n* Make a revision of all the CSS. See #2135.\n\n* Make the workflow statuses translatables. See #2212.\n\n* Allowed categories in the slideshow. See #2213. See #1983.\n\n* A lot of bugfixes:\n\n * Fixed an error in contentmenu. See #2083.\n * Removed by default a not very useful action (can be activated later). See #2032.\n * Sanitize internal links filters. See #2190.\n * Fixed the order in the forum index. See #2191.\n * Fixed the ``change_status`` admin action, which fails when it is done by a non superuser. See #2192.\n * Make piwik plugin more robust when piwik doesn't return nothing. See #1573.\n * Fixed error detecting saml plugin when no have python-saml2 installed. See #2201.\n * Restrict selectable multimedia contents to the owned ones. See #2150.\n * Feed items automatically created should be published. See #2157.\n * Fixed itags listing which fails in some circunstances. See #2162.\n * Fixed some errors in ``standingout`` plugin. See #2167.\n * Fixed addthis plugin language. See #2168.\n * Fixed CSRF problem in inplace edit form.\n * Fixed the ``syncdb --migrate`` command when a migration saves a plugin. See #2178.\n * Restrict by permissions the content you can link to a multimedia asset. See #2150.\n * Make ``djangosaml2`` application required for installing ``saml2`` plugin. See #2180.\n * Showed an admin link when menu view doesn't point to anywhere. See #2164\n * Some IE CSS bugfixes.\n * Fixed a problem with the latest ``BeautifulSoap`` version. See #2209. Thanks to Paul Sabou.\n * Make ``MemoizeCache`` (used for permissions, roles and registry cache) consistent in multithread environments. See #2214.\n * The url of the banner should not be verifiable. See #2219\n\nVersion 0.8.0-rc1 (r5126)\n-------------------------\n\n* Permissions cache for speed up Merengue. See #2085.\n\n* Optimized block rendering. See #2090.\n\n* Refactored the permission system to generalize the roles acquisition from a section. See #2094.\n\n* ``startplugin`` command to help developers to create plugins easily. See #2060.\n\n* A new ``register`` plugin for user registration. See #2000.\n\n* Enable inplace edit in the navigation block root elements. See #2055.\n\n* A new ``Reviewer`` role for improving the publishing process flexibility. See #2093.\n\n* Admin filters for installed or active plugins. See #2053.\n\n* Automatic plugins detection is disabled by default, because there is a \"detect new plugins\" view. See #2051.\n\n* Used the Django 1.3 message framework in the admin interface, to get latest features. See #2050.\n\n* Direct link in the block configuration view to the admin view for this block. See #2061.\n\n* Make more flexible the owners lookup for a content. See #2075.\n\n* Disable by default to the user the permission editing capabilities in the \"permission\" tab. See #2138.\n\n* Make the ``delete`` permission checking more flexible to be used in non ``BaseContent`` objects. See #2081.\n\n* Unit tests in the block mechanism. See #2089.\n\n* A new ``testmerengue`` command to test all the Merengue unit tests at once. See #2124.\n\n* Make more homogeneous the forms CSS. See #73.\n\n* Improved the selenium test runner to use frame buffer is needed. See #1999.\n\n* Allow deleting of broken registered items like broken plugins. See #2130.\n\n* Fixed a lot of bugs:\n\n * Reviewed permissions in related model admins. See #2042 and #2110.\n * Updating the open layers library to fix some FF3.0 errors. See #2084.\n * Custom permission in a content type are now visible in admin permissions view. See #2058.\n * Error adding non content blocks in the content scope. See #2077.\n * Make sure that contenttypes are sync after installing the plugin. This could cause weird issues. See #2052.\n * Fixed the detection of broken plugins in all circunstances. See #2054.\n * Workflows are loading without fixtures to avoid issues. See #2119.\n * Some translations. See #2045, #2097 and #2.\n * Others: #1772, #2063, #2064, #2066, #2067, #2042, #2074, #2076, #2077, #2080, #2082, #2086, #2088, #1744, #1989, #2092, #2096, #2098, #2100, #2101, #2102, #2103, #2104, #2105, #2106, #2109, #2112, #2114, #2045, #1923, #2117, #2118, #2120, #2121, #1982, #1972, #691, #2127, #2128, #2126, #2123, #2131, #2133.\n\nVersion 0.8.0-b2 (r4957)\n------------------------\n\n* Fixed a critical bug in 0.8.0-beta1 for newly created projects. See #2048.\n\n* Fixed the workflow unit tests. See #1832.\n\n* Improved Yaco theme layout. See #1990.\n\n* Fixed some Selenium tests which was broken. See #1938.\n\n* Hot link action for every content (disabled by default). See #2032.\n\n* Fix a bug when adding blocks in a specific scope. See #2011.\n\n* Other errors: #2037, #2038, #2039, #2036, #2040, #2041, #2043, #2046, #2039, #2047.\n\nVersion 0.8.0-b1 (r4880)\n------------------------\n\n* Django 1.3 compatibility. See #1568.\n\n* Workflow system with management interface. See #990, #987, #988, #989.\n\n* Added participants to contents and sections, in oposition of owners. See #1860.\n\n* Documentation:\n\n  * Improved English readability of documentation. See #377.\n  * A new ``optimization`` section. See #1796.\n\n* Activate a entire site cache with ``CACHE_SITE_FOR_ANONYMOUS`` setting. Also a ``invalidate cache`` panel. See #167.\n\n* Block caching with management interface and cache invalidation in public view. See #1332, #1993, #1866 and #2007.\n\n* More unit testing. See #1633, \n\n* Improvements to autoreports UI. See #1850, #1816.\n\n* Better and nicer notifications. See #1841.\n\n* The portal links categories can be configurable in the settings file. See #1858.\n\n* Better l10n support in datetime format for spanish. See #1875.\n\n* Developer can define the slug uniqueness in every inherited model. See #1873.\n\n* Access by role for the portal links. See #1883.\n\n* Add filtering to the block admin changelist. See #1806.\n\n* Adding and removing blocks in the user interface. See #1913, #1923 and #2011.\n\n* Mark the block container when adding blocks. See #1965.\n\n* Changed the \"content management\" tab in admin interface. See #1750.\n\n* Remove the ``Johnny-Cache`` fork because Django 1.3 support customs cache key prefixes. See #1758 and #1757.\n\n* Included a new ``size`` parameter in the ``multimedia_slide_link`` templatetags. See #1756.\n\n* Implemented a changelog view in admin interface. See #1778.\n\n* Included italian translations. See #1803.\n\n* All the managed contents types are orderable. See #1812.\n\n* Multiples levels of portal links. See #1858.\n\n* Support for fixed blocks (declared fixed by its developer). See #1056.\n\n* Improve the linking to content from a menu item. See #1928.\n\n* Add status to menus items. See #888.\n\n* Allow to change the section of a content. See #1839.\n\n* Implemented a \"browse by type\" admin view. See #1752.\n\n* Allow to change active tabs in admin depending on user. See #1988.\n\n* Inplace edit for image fields. See #1973.\n\n* Update the Django Debug Toolbar. See #2001.\n\n* New CSS class param for the blocks to gain look&feel flexibility. See #1977.\n\n* Implemented access control by roles in menus and portal links. See #1846 and #1883.\n\n* ``nondraggable`` and ``noncontained`` options for ``render_*_blocks`` templatetags. See #1895 and #1957.\n\n* Work in permissions system to make more flexible the authorization control. See #2010, #2016, #2017, .\n\n* Improvements in plugins:\n\n * New ``customportlet`` plugin to add customized chunks of HTML as you want. See #1761.\n\n * New ``piwik`` plugin, to collect statistics of accessing contents and sections using Piwik. See #1573.\n\n * New ``twitter`` plugin. See #1907.\n\n * New ``maps`` plugin, with a ``MapBlock`` block. See #1933 and #1941.\n\n * New ``googleanalytics`` plugin. See #1958.\n\n * Google search:\n\n   * Adapt the UI to the browser language. See #1871.\n\n * Standing out plugin:\n\n   * Create a new slide show block. See #1736.\n   * Completed the schema of standing out object. See #1736.\n\n * ``itags`` plugin: grouping list by content type. See #1879.\n\n * ``contactform`` plugin: allow to autofill dinamically by GET parameters. See #1950.\n\n * ``banner`` plugin: a new single banner block to add a banner wherever. See #1979.\n\n* A lot of bugfixes. See #1728, #1775, #1870, #1872, #1877, #1885, #1891, #1729, #1748, #1755, #1760, #1763, #1784, #1788, #1791, #1610, #1792, #1795, #1805, #1808, #1809, #1787, #1822, #1407, #1829, #1215, #1838, #1845, #1834, #1849, #1981, #1956, #1985, #1992, #1991, #1947, #1901, #1862, #1864, #1872, #1875, #1877, #1873, #1885, #1890, #1891, #1899, #1720, #1939, #1942, #1943, #1945, #1940, #1953, #1948, #1959, #1954, #1963, #1966, #1968, #1974, #1975, #1980, #1960, #2002, #2013, #2019, #2009, #2023, #2025, #2021, #2026, #2027.\n\nVersion 0.7.1\n-------------\n\n* New italian translations. See #1803 and #1814.\n\n* An email is sent to reviewers when a content came into ``pending`` status. See #1694.\n\n* Add changelog view in admin to review all admin actions. See #1778.\n\n* Implement single logout in ``saml2`` plugin. See #1442.\n\n* Reviewed the english grammar of some Merengue documents. See #377.\n\n* Unit tests for ``get_real_instance`` logic. See #1633.\n\n* More Selenium tests. See #1747.\n\n* Removed french translations because Merengue miss translations. See #1825.\n\n* And a lot of bugfixes:\n\n * The models cache was not corretly re-populated when loading plugins. See #1712.\n * Feed collection now read well the feed when created. See #1732.\n * Fix an error that do not allow to edit an existing ``standingout`` object if the selected content not changes. See #1736.\n * Error in prepopulated fields when are mixed with read only fields. See #1764.\n * Fixed microsites errors when user try to add two microsites with the same slug. See #1774. See #1790.\n * Fix bug about saving plugins registered on REQUIRED_PLUGINS. See #1786.\n * Check that end date is greater than start date in ``event`` plugin. See #1723.\n * Fixed some problems with django-inlinetrans and transhette. See #1800, #1799, #1801.\n * Some look and feel issues, like #1743, #1744 and #1821.\n * Plugin forums shows duplicated entries if the entries are anidated. See #1727.\n * Fix readonly widget in many2many fields. See #1776.\n * Other fixes: See #1789, #1811, #1823, #1731, #1797, #1783.\n\n\nVersion 0.7.0-final\n-------------------\n\n* Fixed an error in Mysql south migrations. See #1583.\n\n* Collections filters for date comparing. See #1621.\n\n* Bugfixes for collection grouping and ordering. See #1608, #1670, #1677.\n\n* Viewlets rendering bugfixes. See #1600.\n\n* Other bugfixes in collections: #1626.\n\n* IE7 layout bugfixes. See #1516.\n\n* Thread creation action for public view. See #1628.\n\n* Config params store validation fails to show in form with errors. See #1630.\n\n* Improving get_real_instance() logic to work in all cases. See #1632.\n\n* Users can manage its contents. All permissions are adapted to allow it. See #1634, #1658, #1688.\n\n* ``filebrowser`` plugin bugfixes. See #1629, #1661.\n\n* Improve permission checking throughout site. See #1644.\n\n* Some breadcrumbs fixes. See #1646, #1662, #1686.\n\n* Inline edit uses Merengue ``edit`` permission to decide if show the widget. See #1665.\n\n* View to show past events. See #1664.\n\n* New ``striptags`` filter in collection. See #1667.\n\n* Allow defining the default status for all contents in settings. See #1674.\n\n* Inline translation only appears to managers. See #1675.\n\n* Creator became the owner of contents he created automatically. See #1654.\n\n* Allow to set the same review task to more than one user. See #1679.\n\n* When a content gets in ``pending`` status, a new review task is created. See #1679.\n\n* Allow configure the page size in collections, make it a setting for that. See #1682.\n\n* ``feedback`` plugin get the user full name when adding comments. See #1683.\n\n* Model translation bugfixed when finding translatable fields if the superclass model is abstract. See #1685.\n\n* Fixed bugs in translation tools (``django-inlinetrans`` and ``transhette``), which was failing in some cases. See #1693, \n\n* Content location can be deleted now. See #1692.\n\n* Allow tags with white spaces inside. See #1228.\n\n* A new ``notify_pending_reviews`` command to notify users for pending tasks. See #1694.\n\n* Thumbnails in main image for contents are correctly updated when adding/hanging/deleting the content photos. See #1700.\n\n* Fixes some errors in SAML plugin. See #1442.\n\n* The models cache is not corretly re-populated when loading plugins. See #1712.\n\n* Better styling in public forms. See #1716.\n\n* Calendar block do not show events when loading the page. See #1719.\n\n* Other bugfixes: See #1701, #1706, #1561, #1711.\n\nVersion 0.7.0-rc1 (3988 revision)\n---------------------------------\n\n* Permissions are now a related admin, placed into a different tab in admin UI. See #1570.\n* Links can be open in new windows. See #1582.\n* Unified login UI in all themes. See #1382.\n* Removed multimedia slide when only one multimedia asset is shown. See #1460.\n* A new ``reinstall_plugins`` command to reinstall enabled plugins. See #1594.\n* Local roles and permissions can be deleted. See #1605.\n\n* A lot of bugs fixed:\n\n * Fixed broken comments in document sections for anonymous users. See #1614.\n * Fixes menu reordering. See #1581.\n * Errors in block reordering with drag-and-drop. See #1580, #1581.\n * Fixes some admin UI look and feel errors: See #1563, #1584, #1588, #1585.\n * Fixed Tag cloud block title look and feel in Merengue theme. See #1497.\n * Fixed block overwriting when same block is placed twice. See #1575.\n * Fixed error in ezdashboard plugin. See #1586.\n * Limit only one contact form for every content. See #1196.\n * Fixed oot error. See #1579.\n * Fixed south migration when tables already exist. See #1592.\n * Fixed ``migrate_plugins`` command in some circunstances. See #1595.\n * Fixed two viewlet errors. See #1600 and #1616.\n * Calendar block rendered using project locale. See #1609.\n * Fixed 404 error in ``contactform`` plugin. See #1536.\n\nVersion 0.7.0-beta4 (3913 revision)\n-----------------------------------\n\n* Permissions are now definible into sections. See #1564.\n\n* Some bugs fixed:\n\n * When I create a banner I can't see the image on site. See #1547.\n * Documented announcements section.\n * Layout errors in translation UI with IE. See #583.\n * Changed admin app index style. See #1569.\n * Bad django-inlinetrans dependence in requirements.txt.\n\nVersion 0.7.0-beta3 (3880 revision)\n-----------------------------------\n\n* Inline translation allow to create/update po files when the msgid is not found in any catalog. See #1401.\n\n* Some bugs fixed:\n\n * The block tools (for dragging and configuring) are well placed on CSS absolute positioned blocks. See #1562.\n * Adapted ezdashboard and filebrowser plugin to new registering API.\n * Fix bug rendering document sections. See #1565.\n\n\nVersion 0.7.0-beta2 (3861 revision)\n-----------------------------------\n\n* Fixed a lot of bug. These are the most important:\n\n * If a plugin is broken when registering all plugins, the process stopped. Now it continues with next plugin. See #1539.\n * Cleared Django apps cache after unregister plugin, to avoid weird errors in some circunstances. See #1526.\n * Plugins disabling was broken (only worked uninstalling). Now you can disable plugins. See #1486.\n * Blocks with content types filtering configuration was not showing any data. See #1530.\n * Add permission definition in related and non related object tools.\n * You can define successfully blocks related both in sections and in contents. See #1509 and #1491.\n * Removed 2mbytes of unused media in ``chunks`` plugin. See #1472.\n * Block config button is not shown if block has no available configuration. See #1528.\n * Others: #1532, #1519, #1508, #1523, #1525, #1543, #1544, #1487, #1460, #1410, #1497, #1527, #1498, #1476, #1549, #1546, #728, #608, #1478, #1378, #1551, #1552.\n\n* Adapted Selenium test to new Merengue admin redesign. See #1524.\n\n* Enable captcha in ``feedback`` plugin for non authenticated users. See #1534.\n\n* Adapted demo.merengueproject.org demo fixtures to section as base content refactoring. See #1531.\n\n* Finish ``Saml2`` plugin to support federated authentication/authorization. See #1442.\n\n* Users can now add feed collections to sections. See #1538.\n\n* Improved plugin tab to get more intuitive for users. See #1540.\n\n* Improve run_suites.py script, to run all selenium tests automatically. Also improve the documentation. See #1458.\n\n* Make direct accesses to regiteres blocks and actions in installed plugins, from plugin admin. See #1542.\n\n* Complete documentation in Merengue error reference, Merengue deployment, JS/CSS compression.\n\n* Finished django-announcements integration.\n\nVersion 0.7.0-beta1 (3786 revision)\n-----------------------------------\n\n* Manager can set a numbers of objects limit in collections. See #1510.\n\n* Implement related object tools for related model admins. See #1502.\n\n* Redesign of Merengue admin to improve usability. See #1503 and #1517.\n\n* Integrated django-announcements. Not finished yet. See #1302.\n\n* Saml2 pulgin to get federated AuthN/AuthR via SAML SP. Not finished yet. See #1442.\n\n* Toolbar panel which shows Merengue version for debugging purposes. See #1473.\n\n* Section request middleware (which define ``request.section``) is now pluggable, and can be easily redefined, for example by ``microsite`` plugin. See #1484.\n\n* Support registering by instances, to be able to have multiple registered items of a registrable class. Used for blocks related to contents. See #1445.\n\n* New filter by type in \"browse content\" admin view. See #1483.\n\n* Merengue sections (BaseSection model) are now base contents (inherited to BaseContent), with permissions, related blocks, and all features implemented in Merengue. See #1318.\n\n* Fixed a lot of bugs caused by last features added. See #1433, #1355, #1330, #1192, #1465, #1469, #1396, #1481, #1493, #1504, #1494, #1499.\n\nVersion 0.7.0-alpha (3630 revision)\n-----------------------------------\n\n* Support registering by instances (not classes) in Merengue registry, with singleton feature. See #1445.\n\n* Itags view, to show all tags in website. See #1404.\n\n* Pluggable toolbar with panels registrable in plugins. See #1391.\n\n* Inline edit support for contents, with a rewritten django-inplaceedit.\n\n* New selenium tests for the new features in 0.7 series.\n\n* Integrate JS and CSS assets in a place holder, avoiding duplicates and compressing code. See #1418.\n\n* CSS and JS compression when its configured for a production site. See #1415.\n\n* Improved yaco theme. See #1388.\n\n* Block configuration in public view. See #1365.\n\n* South support in plugins. See #1381.\n\n* Inline translation in all Merengue templates, using django-inlinetrans. See #1349.\n\n* Implemented a print style sheet and a print action. See #966.\n\n* Internationalized URLs. See #1112.\n\n* Optimized Merengue SQL sentences. See #1320.\n\n* Implemented unit tests for registry application. See #1314.\n\n* Cleaned up and refactored the Merengue menu implementation. See #1313.\n\n* Contact information is rendered in contents which have filled it. See #1309.\n\n* Implemented a review system, used in ``redirect`` plugin. See #1074.\n\n* You can attach blocks to individual contents, with a custom configuration for them. See #1261.\n\n* Manager can set the rendering a block only for one or more contents, with custom block configuration for each content. See #1247.\n\n* Plain text generation support for all contents, for indexing, tagging, etc. See #1088.\n\n* Refactored MIDDLEWARE_CLASSES to improve customization in projects. See #1253.\n\n* New features for microsite plugin:\n\n  * MIDDLEWARE to allow URLs like /foo-microsite/foo/url that will be like /microsites/foo-microsite/foo/url/\n  * All blocks in built-in plugins are valid inside microsites, showing only microsite contents.\n\n* Implemented contentmenu plugin, to allow content grouping in a Menu, but without having contents in same section.\n\n* Huge plugins, viewlets, blocks and breadcrumbs refactoring to improve redefinition in plugins. See #1256, #1258 and #1269\n\n* All built-in plugins uses collection when needed, to improve customization in listings by managers. See #1267.\n\n* HTML editor (TinyMCE) is now resizable. See #1270.\n\n* Removed hook_post_register hook and implemented post_install hook, invoked only when plugin are installed. See #1277.\n\n* Make rss plugin more customizable. See #1273.\n\n* Implemented ``tmtemplates`` plugin, to create HTML templates which can be inserted in every HTML field.\n\n* Collection can filtered by adding a extra ``_filters_collection`` context in view.\n\nVersion 0.6.0-final\n-------------------\n\n* Changed Django dependence to 1.1.3 version, because a security issue, fixed on that version.\n\n* Fixed some Postgresql database locks while creating the models when some plugins are installed.\n\n* A little speed up for Postgresql backend, using ``autocommit`` option by default.\n\n* Other minor bugfixes:\n\n * Error when accessing document without sections (after delete it).\n * Error when creating a searcher in a collection and you search for something on public view.\n * Manager cannot assign permissions to thread objects inside a forum.\n * Ensure NOT_PROVIDED value (got by the not defined config params) evaluates to False to avoid some errors.\n * Fixed web layout in the restart server confirmation page in transhette.\n\n* Added ``name`` field to contact information.\n\nVersion 0.6.0-rc1\n-----------------\n\n* Several bugfixes:\n\n * Fixed new error in params validation.\n * Unit tests execution fixed when memcached is used as caching backend.\n * Javascript error when moving blocks.\n * Deferred PIL import in captcha to the moment of create first captcha thumbnail, to avoid syncdb errors.\n * Improved validation in integerparams.\n * Fixed installing of django-inlinetrans with PIP.\n * Now all users with \"manage_portal\" permission can move blocks.\n * Allow deleting sent forms in contactform plugin.\n * Fixes searching in admin ``browse contents`` view.\n\n* Speed up Merengue permission checking.\n\n* Delete view in Merengue admin not take care about Merengue permissions in objects which are deleted in cascade.\n\n* Refactored and fixed all selenium tests.\n\nVersion 0.6.0-beta1 (2921 revision)\n-----------------------------------\n\n* A lot of bugfixes:\n\n * Section custom CSS validation error fixed.\n * More robust tagcloud and tag validation for itag plugin.\n * Several bugfixes to transhette.\n * Removed several \"permissions\" button in admin which don't worked.\n * Registry params validation support (for plugins, actions, etc.).\n * Included recaptcha keys to get captcha plugin works out-of-the-box.\n * Support both for PIL 1.1.6 and 1.1.7 (have incompatible import sentences).\n * Better date support in collections.\n * Fixed some errors with truncatechars filter in collections.\n * Errors in autoreports link in plugins admin.\n * Fixes stdimage validation for non required fields.\n * Fixed wrong user message when editing contents.\n * Fixed 404 error when adding link into sections.\n * Fixed error editing threads of a forum in forum plugin.\n * Better validation in some parts of subscription plugin.\n * Improved permission handling for plugin managers.\n * Fixed some web layout errors.\n * More robust handling of \"empty\" filters and other validation issues in collections.\n * Fixed errors in feed info in rss plugin.\n\n* Support of HTML emails in contactform plugin.\n\n* Non overwritable fixtures support.\n\n* Completed spanish translations.\n\n* Added sent date column in forms sents admin in contactform plugin.\n\n* Read only fields works with foreign key fields.\n\n* Complete documentation of:\n\n * Merengue fixtures.\n * Block hiding/showing by URL regex.\n * Install instructions and python dependences.\n\nVersion 0.6.0-alpha3 (2844 revision)\n------------------------------------\n\n* Split dependences to an external requirements.txt file.\n\nVersion 0.6.0-alpha2 (2842 revision)\n------------------------------------\n\n* Removed external SVN dependences. Now Merengue has all these dependences as python eggs.\n\n* Implemented a render_all_blocks templatetags, which is a shortcut to write less templating code.\n\n* Replaced plugins which render lists with customizable collections.\n\n* Make Merengue documentation compatible with Sphinx 1.0.\n\n* Several bug fixes related to:\n\n * Permissions system.\n * Administration broken links.\n * banners, oldbrowser and event plugin.\n * transhette application.\n * etc.\n\n* Improved usability in Merengue admin:\n\n * A content tree, for browsing all contents.\n * Improved visual block reordering.\n\n* Themes can have a screenshot, for previewing before activating.\n\n* Plugins can define new middlewares.\n\n* A new \"Owner\" role, to may customize permissions for content owners. This role is assigned for a user when the context is a content owned by him.\n\n* Manager can disable global permissions adquisition for a content, for example to disable \"View\" permission in private contents.\n\n* Blocks showable or hiddeable by URLs in Merengue admin, using regular expressions.\n\n* Begin integration with django-notification.\n\n* Contents can be defined as permanents (no deletable, no changeable or some fields not changeables), when your logic relies on these contents.\n\n* Plugin introspection before installing it. In Merengue admin you will see what blocks will be created by a plugin, or what new content types, etc.\n\n* When customizing a section CSS, you can upload new images to may customize the backgrounds.\n\n* New plugins:\n\n * contactform: to create forms, customizing fields, emails, behaviour, etc.\n * smartsearch: to include and manage search form, for example inside collections.\n * rss: to make feeds in your site, which are configurable.\n * redirect: to configure HTTP redirections in your site.\n * itag: tagging with i18n support.\n * addthis: addthis.com integration.\n * imagesize: notifications when size of uploaded images pass the configurables thresholds.\n\n\nVersion 0.6.0-alpha1 (2541 revision)\n------------------------------------\n\n* Huge speed up on related admin registration.\n\n* Allow to extends Merengue TinyMCE editor settings in apps and plugins.\n\n* Content collections, which are lists of managed contents with configurable filters, search form and listing options.\n\n* Theme support in Merengue admin site.\n\n* Post register hook to plugins, to allow developers to execute tasks after installing plugin.\n\n* Included language catalogs in all apps and plugins. Also included compiled .mo files.\n\n* New plugins:\n\n * oot: ODT conversion of managed contents.\n * banner: banner management plugin.\n * oldbrowser: a plugin that makes easy to notify to users that their browser is too old.\n\n* Several improvements in forum plugin:\n\n * Grouping forums into categories.\n * Show last comment in forum list and forum view.\n * Do not allow anonymous users.\n * Allow to close a thread so no new comments could be added.\n * Allow to move a thread from one forum to another one.\n * Allow different users to moderate different forums.\n\n* Implemented a subscribers listing in subscription plugin.\n\n\nVersion 0.5.1\n-------------\n\nNote: Changes from 0.5.1-rc1 version\n\n* Better south integration with translation system, that allows to migrate all translated models with all possible languages setting.\n\n* Fixed a lot of bugs like:\n\n * Avoid URL patterns grown every 404 request when have debug toolbar installed.\n * Fix audio player.\n * Error in URL parsing when accessing document inside sections.\n * Error with negative numbers in integer registry params.\n * Blocks placed in \"home\" and \"beforecontent\" position dissappears in home page.\n * Make facebook share link (from facebook plugin) works behind virtual hosts.\n * Highlight plugin does not show related content images.", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://www.merengueproject.org/", "keywords": "merengue,django,django cms,pluggable,cms,collaborative edition,geolocation,translatable models", "license": "UNKNOWN", "maintainer": null, "maintainer_email": null, "name": "merengue", "package_url": "https://pypi.org/project/merengue/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/merengue/", "project_urls": {"Download": "UNKNOWN", "Homepage": "http://www.merengueproject.org/"}, "release_url": "https://pypi.org/project/merengue/0.9.0/", "requires_dist": null, "requires_python": null, "summary": "Django-based CMS on steroids", "version": "0.9.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>Merengue is a full-featured and pluggable CMS designed for creating websites, writing less code and mantaining clean, elegant and re-usable code.</p>\n<p>More information in <a href=\"http://www.merengueproject.org/\" rel=\"nofollow\">http://www.merengueproject.org/</a></p>\n<div id=\"changes\">\n<h2>Changes</h2>\n<div id=\"version-0-9-0\">\n<h3>Version 0.9.0</h3>\n<ul>\n<li>Merge custommeta plugin into core plugin and refactor merengue so every portal will be able to use custom meta pages. See #2365.</li>\n<li>Add the anonymous user of view of the menus. See #2366.</li>\n<li>Fix adding group to roles when settings the permissions of an object. See #2364.</li>\n<li>Support configurable plain text generation for all contents, useful for indexing in search engines. See #1088.</li>\n<li>Refactor standingout plugin to improve its use inside sections or microsites. See #2358.</li>\n<li>Add support for django message framework instead of using the old cmsutils.log. See #2362.</li>\n<li>Catch SMTP exceptions, which are sent to the user. See #2361.</li>\n<li>Extend global model admins (no related ones) change permission to users that own contents or are owners of a section/microsite. See #2360.</li>\n<li>Add searchform to merengue jsi18n catalog. See #2359.</li>\n<li>Section owners now are able to edit any related content to the section. See #2357.</li>\n<li>Fix contactform opts bug when filling name field. See #2355.</li>\n<li>Restricted admin of basesection. See #2356.</li>\n<li>Add order in standingout categories. See #2354.</li>\n<li>Fix javascript comparisons. See #2352.</li>\n<li>In <tt>contactform</tt> plugin fields order is the same that admin interface. See #2351.</li>\n<li>Rename file names with accents in <tt>filebrowser</tt> plugin to avoid problems. See #2349.</li>\n<li>Fixed statistics error in <tt>piwik</tt> plugin. See #2348.</li>\n<li>Avoid problems when trying to save a CMYK image as PNG. See #2347.</li>\n<li>Fix breadcrumbs signature in plugins and base objects. See #2345.</li>\n<li>Create plugins to set meta title, description and keywords to any page. See #2341.</li>\n<li>Updated saml2 plugin to work with djangosaml2-0.6.1. See #2335.</li>\n<li>Allow staff users to access model admins of the objects they own. See #2343.</li>\n<li>Sort contents inside a contentgroup in <tt>contentmenu</tt> plugin. See #2334.</li>\n<li>Fix bug in collection limit. See #2331.</li>\n<li>Now the contact form block if the form has error is not cacheable. See #2329.</li>\n<li>Fix calendar block when changing months. See #2330.</li>\n<li>Customizable section views for developers. See #2324.</li>\n<li>Enable plugins before any other merengue middleware. See #2325.</li>\n<li>Improve <tt>contactform</tt> plugin. Add a name field to the options of a contact form so you can identify options by using their name instead of ‘option_N’. See #2326.</li>\n<li>The link of the custom portlet plugin is now optional. See #2327.</li>\n<li>Update django-compressor to the 1.1.2 release. See #2328.</li>\n<li>Allow to overwrite the default content commentable behaviour with a <tt>CONTENT_COMMENTABLE_BY_DEFAULT</tt> setting. See #2317.</li>\n<li>Add a category filtered block in banner plugin. See #2316.</li>\n<li>Add links into a microsite. See #2312.</li>\n<li>Implement a method that allows sections to insert css classes into body.</li>\n</ul>\n</div>\n<div id=\"version-0-8-2\">\n<h3>Version 0.8.2</h3>\n<ul>\n<li>Fixed an UnicodeDecodeError caused by transmeta 0.6.7 version. See #2308.</li>\n</ul>\n</div>\n<div id=\"version-0-8-1\">\n<h3>Version 0.8.1</h3>\n<ul>\n<li>Fixed a weird error when registering new plugins. See #2229.</li>\n<li>Improved setup.py keywords to improve searching on pypi. See #2284.</li>\n</ul>\n</div>\n<div id=\"version-0-8-0-final\">\n<h3>Version 0.8.0-final</h3>\n<ul>\n<li>More Selenium tests. See #2136 and #1746.</li>\n<li>Invalid the block cache when user edit a block using inline edit. See #2242.</li>\n<li>SEO improvements, with <tt>sitemap.xml</tt> generation. See #2248.</li>\n<li>Included <tt>merengue/media</tt> in the synchronized media when you executes <tt>sync_apps_media</tt> command. See #2243.</li>\n<li>Including expire headers in nginx configuration in the install documentation. See #377.</li>\n<li>Incluiding inline edit to highlight plugin. See #2246.</li>\n<li>Complete view for reporting a permission denied to the user and manager. See #2151.</li>\n<li>More translations. See #2.</li>\n<li>Unfrozen recaptcha client dependence in <tt>contactform</tt> plugin. See #2267.</li>\n<li>Added cache block in <tt>render_single_block</tt> tag. See #2269.</li>\n<li>Hided 3d images and panoramic views, because are not fully implemented in Merengue. See #2275.</li>\n<li>New Debug Toolbar panel with blocks information for profiling purposes. See #2276.</li>\n<li>“Cache invalidation” permission to have a more grained authorization. Fixes #2277.</li>\n<li>Vast improvement in Merengue performance:</li>\n</ul>\n<blockquote>\n<ul>\n<li><tt>Menu.get_section</tt> improvement. See #2233.</li>\n<li>Edit inline improvement. See #2234.</li>\n<li>RSS plugin caching. See #2235.</li>\n<li>Block cache is more efficient. See #2236.</li>\n<li><tt>getEventsMonthYear</tt> improvement. See #2238.</li>\n<li><tt>MenuBlock</tt> improvement. See #2241.</li>\n</ul>\n</blockquote>\n<ul>\n<li>Bugfixes:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Fixed inplaceeditform error with text fields whose font size is not integer. See #2222.</li>\n<li>Flowplayer error fixed in IE. See #2224.</li>\n<li>Fixed error when CSS and JS compression is enabled. See #2223.</li>\n<li>Fixed permission error in object when the passed object is None. See #2110.</li>\n<li>Improved the inplace edit logic to check the “edit” permission. See #2230.</li>\n<li>Some layout error. See #2217.</li>\n<li>User is able to edit the blocks that are non cacheables. See #2237.</li>\n<li>Fixed some migrations when executed in very old merengue sites. See #2244.</li>\n<li>Now the <tt>render_single_block</tt> works with <tt>ContentBlock</tt>. See #2252.</li>\n<li>Make sure the unit tests run with dummy cache. See #2254.</li>\n<li>Registry cache should not set cache when empty elements found. See #2255.</li>\n<li>Fixed “save and restore config” issues. See #2189 and #918.</li>\n<li>Fixed the inline edit when it’s used with the intro button to save changes. See #2256.</li>\n<li>Fixed permission test suite, related to a caching invalidation error. See #2253.</li>\n<li>Avoid 301 redirect caching by some browser like Chrome or Firefox 3.5+. See #2220.</li>\n<li>Error in AJAX request in the collection admin when the collection is inside a section. See #2260.</li>\n<li>Error when installing some plugins after uninstalling them without server reloading. See #2262.</li>\n<li>Removing some absolute references between CSS and the images. See #2264.</li>\n<li>Now the <tt>contactform</tt> plugin works if this loaded with ajax, although this is not a default behaviour. See #2268.</li>\n<li>Fixed a migration when GIS is disabled. See #2271.</li>\n<li>Frozen <tt><span class=\"pre\">django-mptt</span></tt> and <tt><span class=\"pre\">django-ajax-selects</span></tt> packages because are now backward incompatibles. See #2278 and #2279</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"version-0-8-0-rc2-r5269\">\n<h3>Version 0.8.0-rc2 (r5269)</h3>\n<ul>\n<li>Fixed migration in MySQL databases. See #2215.</li>\n<li>New non addable blocks. See #2147.</li>\n<li>Optimized Merengue registry. See #2142.</li>\n<li>Optimized permissions system. See #1322.</li>\n<li>Optimized SQL sentences. See #2144.</li>\n<li>Changed plugin detection implementation to make it works in all environments (deployments). This approach removes using a external process. See #2158.</li>\n<li>Removed the <tt><span class=\"pre\">--develop</span></tt> option in <tt>startproject</tt> command. By default the merengue will be symlinked. See #2148.</li>\n<li>Completed spanish translations. See #2.</li>\n<li>Completed and reviewed the documentation. See #377.</li>\n<li>Changed JW Player to flowplayer, which is completely free. See #2199.</li>\n<li>New <tt>MERENGUE_MAX_FILE_SIZE</tt> and <tt>MERENGUE_MAX_IMAGE_SIZE</tt> parameters to restrict the size of uploaded files. See #2185.</li>\n<li>Reduced size of test data. See #2141.</li>\n<li>Added <tt>anchor</tt> button to the tinyMCE.</li>\n<li>Improved and fixing the Yaco theme look&amp;feel. See #1990.</li>\n<li>Include spellchecking in the visual editor, that will be in English by default.</li>\n<li>Selenium tests for permission system. See #2136.</li>\n<li>Make customizable the reviewers who will receive the review task notifications. See #2193.</li>\n<li>The tags are now comma separated. See #2155.</li>\n<li>Sortable fields for search form. See #2175.</li>\n<li>Used autocompletion widget to select the main content of a section. See #2115.</li>\n<li>New <tt>max_num_items</tt> parameter to the <tt>MenuBlock</tt> which collapse any menú branch if the number of children became higher than the parameter. See #2161.</li>\n<li>Make a revision of all the CSS. See #2135.</li>\n<li>Make the workflow statuses translatables. See #2212.</li>\n<li>Allowed categories in the slideshow. See #2213. See #1983.</li>\n<li>A lot of bugfixes:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Fixed an error in contentmenu. See #2083.</li>\n<li>Removed by default a not very useful action (can be activated later). See #2032.</li>\n<li>Sanitize internal links filters. See #2190.</li>\n<li>Fixed the order in the forum index. See #2191.</li>\n<li>Fixed the <tt>change_status</tt> admin action, which fails when it is done by a non superuser. See #2192.</li>\n<li>Make piwik plugin more robust when piwik doesn’t return nothing. See #1573.</li>\n<li>Fixed error detecting saml plugin when no have python-saml2 installed. See #2201.</li>\n<li>Restrict selectable multimedia contents to the owned ones. See #2150.</li>\n<li>Feed items automatically created should be published. See #2157.</li>\n<li>Fixed itags listing which fails in some circunstances. See #2162.</li>\n<li>Fixed some errors in <tt>standingout</tt> plugin. See #2167.</li>\n<li>Fixed addthis plugin language. See #2168.</li>\n<li>Fixed CSRF problem in inplace edit form.</li>\n<li>Fixed the <tt>syncdb <span class=\"pre\">--migrate</span></tt> command when a migration saves a plugin. See #2178.</li>\n<li>Restrict by permissions the content you can link to a multimedia asset. See #2150.</li>\n<li>Make <tt>djangosaml2</tt> application required for installing <tt>saml2</tt> plugin. See #2180.</li>\n<li>Showed an admin link when menu view doesn’t point to anywhere. See #2164</li>\n<li>Some IE CSS bugfixes.</li>\n<li>Fixed a problem with the latest <tt>BeautifulSoap</tt> version. See #2209. Thanks to Paul Sabou.</li>\n<li>Make <tt>MemoizeCache</tt> (used for permissions, roles and registry cache) consistent in multithread environments. See #2214.</li>\n<li>The url of the banner should not be verifiable. See #2219</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"version-0-8-0-rc1-r5126\">\n<h3>Version 0.8.0-rc1 (r5126)</h3>\n<ul>\n<li>Permissions cache for speed up Merengue. See #2085.</li>\n<li>Optimized block rendering. See #2090.</li>\n<li>Refactored the permission system to generalize the roles acquisition from a section. See #2094.</li>\n<li><tt>startplugin</tt> command to help developers to create plugins easily. See #2060.</li>\n<li>A new <tt>register</tt> plugin for user registration. See #2000.</li>\n<li>Enable inplace edit in the navigation block root elements. See #2055.</li>\n<li>A new <tt>Reviewer</tt> role for improving the publishing process flexibility. See #2093.</li>\n<li>Admin filters for installed or active plugins. See #2053.</li>\n<li>Automatic plugins detection is disabled by default, because there is a “detect new plugins” view. See #2051.</li>\n<li>Used the Django 1.3 message framework in the admin interface, to get latest features. See #2050.</li>\n<li>Direct link in the block configuration view to the admin view for this block. See #2061.</li>\n<li>Make more flexible the owners lookup for a content. See #2075.</li>\n<li>Disable by default to the user the permission editing capabilities in the “permission” tab. See #2138.</li>\n<li>Make the <tt>delete</tt> permission checking more flexible to be used in non <tt>BaseContent</tt> objects. See #2081.</li>\n<li>Unit tests in the block mechanism. See #2089.</li>\n<li>A new <tt>testmerengue</tt> command to test all the Merengue unit tests at once. See #2124.</li>\n<li>Make more homogeneous the forms CSS. See #73.</li>\n<li>Improved the selenium test runner to use frame buffer is needed. See #1999.</li>\n<li>Allow deleting of broken registered items like broken plugins. See #2130.</li>\n<li>Fixed a lot of bugs:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Reviewed permissions in related model admins. See #2042 and #2110.</li>\n<li>Updating the open layers library to fix some FF3.0 errors. See #2084.</li>\n<li>Custom permission in a content type are now visible in admin permissions view. See #2058.</li>\n<li>Error adding non content blocks in the content scope. See #2077.</li>\n<li>Make sure that contenttypes are sync after installing the plugin. This could cause weird issues. See #2052.</li>\n<li>Fixed the detection of broken plugins in all circunstances. See #2054.</li>\n<li>Workflows are loading without fixtures to avoid issues. See #2119.</li>\n<li>Some translations. See #2045, #2097 and #2.</li>\n<li>Others: #1772, #2063, #2064, #2066, #2067, #2042, #2074, #2076, #2077, #2080, #2082, #2086, #2088, #1744, #1989, #2092, #2096, #2098, #2100, #2101, #2102, #2103, #2104, #2105, #2106, #2109, #2112, #2114, #2045, #1923, #2117, #2118, #2120, #2121, #1982, #1972, #691, #2127, #2128, #2126, #2123, #2131, #2133.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"version-0-8-0-b2-r4957\">\n<h3>Version 0.8.0-b2 (r4957)</h3>\n<ul>\n<li>Fixed a critical bug in 0.8.0-beta1 for newly created projects. See #2048.</li>\n<li>Fixed the workflow unit tests. See #1832.</li>\n<li>Improved Yaco theme layout. See #1990.</li>\n<li>Fixed some Selenium tests which was broken. See #1938.</li>\n<li>Hot link action for every content (disabled by default). See #2032.</li>\n<li>Fix a bug when adding blocks in a specific scope. See #2011.</li>\n<li>Other errors: #2037, #2038, #2039, #2036, #2040, #2041, #2043, #2046, #2039, #2047.</li>\n</ul>\n</div>\n<div id=\"version-0-8-0-b1-r4880\">\n<h3>Version 0.8.0-b1 (r4880)</h3>\n<ul>\n<li>Django 1.3 compatibility. See #1568.</li>\n<li>Workflow system with management interface. See #990, #987, #988, #989.</li>\n<li>Added participants to contents and sections, in oposition of owners. See #1860.</li>\n<li>Documentation:<ul>\n<li>Improved English readability of documentation. See #377.</li>\n<li>A new <tt>optimization</tt> section. See #1796.</li>\n</ul>\n</li>\n<li>Activate a entire site cache with <tt>CACHE_SITE_FOR_ANONYMOUS</tt> setting. Also a <tt>invalidate cache</tt> panel. See #167.</li>\n<li>Block caching with management interface and cache invalidation in public view. See #1332, #1993, #1866 and #2007.</li>\n<li>More unit testing. See #1633,</li>\n<li>Improvements to autoreports UI. See #1850, #1816.</li>\n<li>Better and nicer notifications. See #1841.</li>\n<li>The portal links categories can be configurable in the settings file. See #1858.</li>\n<li>Better l10n support in datetime format for spanish. See #1875.</li>\n<li>Developer can define the slug uniqueness in every inherited model. See #1873.</li>\n<li>Access by role for the portal links. See #1883.</li>\n<li>Add filtering to the block admin changelist. See #1806.</li>\n<li>Adding and removing blocks in the user interface. See #1913, #1923 and #2011.</li>\n<li>Mark the block container when adding blocks. See #1965.</li>\n<li>Changed the “content management” tab in admin interface. See #1750.</li>\n<li>Remove the <tt><span class=\"pre\">Johnny-Cache</span></tt> fork because Django 1.3 support customs cache key prefixes. See #1758 and #1757.</li>\n<li>Included a new <tt>size</tt> parameter in the <tt>multimedia_slide_link</tt> templatetags. See #1756.</li>\n<li>Implemented a changelog view in admin interface. See #1778.</li>\n<li>Included italian translations. See #1803.</li>\n<li>All the managed contents types are orderable. See #1812.</li>\n<li>Multiples levels of portal links. See #1858.</li>\n<li>Support for fixed blocks (declared fixed by its developer). See #1056.</li>\n<li>Improve the linking to content from a menu item. See #1928.</li>\n<li>Add status to menus items. See #888.</li>\n<li>Allow to change the section of a content. See #1839.</li>\n<li>Implemented a “browse by type” admin view. See #1752.</li>\n<li>Allow to change active tabs in admin depending on user. See #1988.</li>\n<li>Inplace edit for image fields. See #1973.</li>\n<li>Update the Django Debug Toolbar. See #2001.</li>\n<li>New CSS class param for the blocks to gain look&amp;feel flexibility. See #1977.</li>\n<li>Implemented access control by roles in menus and portal links. See #1846 and #1883.</li>\n<li><tt>nondraggable</tt> and <tt>noncontained</tt> options for <tt>render_*_blocks</tt> templatetags. See #1895 and #1957.</li>\n<li>Work in permissions system to make more flexible the authorization control. See #2010, #2016, #2017, .</li>\n<li>Improvements in plugins:</li>\n</ul>\n<blockquote>\n<ul>\n<li>New <tt>customportlet</tt> plugin to add customized chunks of HTML as you want. See #1761.</li>\n<li>New <tt>piwik</tt> plugin, to collect statistics of accessing contents and sections using Piwik. See #1573.</li>\n<li>New <tt>twitter</tt> plugin. See #1907.</li>\n<li>New <tt>maps</tt> plugin, with a <tt>MapBlock</tt> block. See #1933 and #1941.</li>\n<li>New <tt>googleanalytics</tt> plugin. See #1958.</li>\n<li>Google search:<ul>\n<li>Adapt the UI to the browser language. See #1871.</li>\n</ul>\n</li>\n<li>Standing out plugin:<ul>\n<li>Create a new slide show block. See #1736.</li>\n<li>Completed the schema of standing out object. See #1736.</li>\n</ul>\n</li>\n<li><tt>itags</tt> plugin: grouping list by content type. See #1879.</li>\n<li><tt>contactform</tt> plugin: allow to autofill dinamically by GET parameters. See #1950.</li>\n<li><tt>banner</tt> plugin: a new single banner block to add a banner wherever. See #1979.</li>\n</ul>\n</blockquote>\n<ul>\n<li>A lot of bugfixes. See #1728, #1775, #1870, #1872, #1877, #1885, #1891, #1729, #1748, #1755, #1760, #1763, #1784, #1788, #1791, #1610, #1792, #1795, #1805, #1808, #1809, #1787, #1822, #1407, #1829, #1215, #1838, #1845, #1834, #1849, #1981, #1956, #1985, #1992, #1991, #1947, #1901, #1862, #1864, #1872, #1875, #1877, #1873, #1885, #1890, #1891, #1899, #1720, #1939, #1942, #1943, #1945, #1940, #1953, #1948, #1959, #1954, #1963, #1966, #1968, #1974, #1975, #1980, #1960, #2002, #2013, #2019, #2009, #2023, #2025, #2021, #2026, #2027.</li>\n</ul>\n</div>\n<div id=\"version-0-7-1\">\n<h3>Version 0.7.1</h3>\n<ul>\n<li>New italian translations. See #1803 and #1814.</li>\n<li>An email is sent to reviewers when a content came into <tt>pending</tt> status. See #1694.</li>\n<li>Add changelog view in admin to review all admin actions. See #1778.</li>\n<li>Implement single logout in <tt>saml2</tt> plugin. See #1442.</li>\n<li>Reviewed the english grammar of some Merengue documents. See #377.</li>\n<li>Unit tests for <tt>get_real_instance</tt> logic. See #1633.</li>\n<li>More Selenium tests. See #1747.</li>\n<li>Removed french translations because Merengue miss translations. See #1825.</li>\n<li>And a lot of bugfixes:</li>\n</ul>\n<blockquote>\n<ul>\n<li>The models cache was not corretly re-populated when loading plugins. See #1712.</li>\n<li>Feed collection now read well the feed when created. See #1732.</li>\n<li>Fix an error that do not allow to edit an existing <tt>standingout</tt> object if the selected content not changes. See #1736.</li>\n<li>Error in prepopulated fields when are mixed with read only fields. See #1764.</li>\n<li>Fixed microsites errors when user try to add two microsites with the same slug. See #1774. See #1790.</li>\n<li>Fix bug about saving plugins registered on REQUIRED_PLUGINS. See #1786.</li>\n<li>Check that end date is greater than start date in <tt>event</tt> plugin. See #1723.</li>\n<li>Fixed some problems with django-inlinetrans and transhette. See #1800, #1799, #1801.</li>\n<li>Some look and feel issues, like #1743, #1744 and #1821.</li>\n<li>Plugin forums shows duplicated entries if the entries are anidated. See #1727.</li>\n<li>Fix readonly widget in many2many fields. See #1776.</li>\n<li>Other fixes: See #1789, #1811, #1823, #1731, #1797, #1783.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"version-0-7-0-final\">\n<h3>Version 0.7.0-final</h3>\n<ul>\n<li>Fixed an error in Mysql south migrations. See #1583.</li>\n<li>Collections filters for date comparing. See #1621.</li>\n<li>Bugfixes for collection grouping and ordering. See #1608, #1670, #1677.</li>\n<li>Viewlets rendering bugfixes. See #1600.</li>\n<li>Other bugfixes in collections: #1626.</li>\n<li>IE7 layout bugfixes. See #1516.</li>\n<li>Thread creation action for public view. See #1628.</li>\n<li>Config params store validation fails to show in form with errors. See #1630.</li>\n<li>Improving get_real_instance() logic to work in all cases. See #1632.</li>\n<li>Users can manage its contents. All permissions are adapted to allow it. See #1634, #1658, #1688.</li>\n<li><tt>filebrowser</tt> plugin bugfixes. See #1629, #1661.</li>\n<li>Improve permission checking throughout site. See #1644.</li>\n<li>Some breadcrumbs fixes. See #1646, #1662, #1686.</li>\n<li>Inline edit uses Merengue <tt>edit</tt> permission to decide if show the widget. See #1665.</li>\n<li>View to show past events. See #1664.</li>\n<li>New <tt>striptags</tt> filter in collection. See #1667.</li>\n<li>Allow defining the default status for all contents in settings. See #1674.</li>\n<li>Inline translation only appears to managers. See #1675.</li>\n<li>Creator became the owner of contents he created automatically. See #1654.</li>\n<li>Allow to set the same review task to more than one user. See #1679.</li>\n<li>When a content gets in <tt>pending</tt> status, a new review task is created. See #1679.</li>\n<li>Allow configure the page size in collections, make it a setting for that. See #1682.</li>\n<li><tt>feedback</tt> plugin get the user full name when adding comments. See #1683.</li>\n<li>Model translation bugfixed when finding translatable fields if the superclass model is abstract. See #1685.</li>\n<li>Fixed bugs in translation tools (<tt><span class=\"pre\">django-inlinetrans</span></tt> and <tt>transhette</tt>), which was failing in some cases. See #1693,</li>\n<li>Content location can be deleted now. See #1692.</li>\n<li>Allow tags with white spaces inside. See #1228.</li>\n<li>A new <tt>notify_pending_reviews</tt> command to notify users for pending tasks. See #1694.</li>\n<li>Thumbnails in main image for contents are correctly updated when adding/hanging/deleting the content photos. See #1700.</li>\n<li>Fixes some errors in SAML plugin. See #1442.</li>\n<li>The models cache is not corretly re-populated when loading plugins. See #1712.</li>\n<li>Better styling in public forms. See #1716.</li>\n<li>Calendar block do not show events when loading the page. See #1719.</li>\n<li>Other bugfixes: See #1701, #1706, #1561, #1711.</li>\n</ul>\n</div>\n<div id=\"version-0-7-0-rc1-3988-revision\">\n<h3>Version 0.7.0-rc1 (3988 revision)</h3>\n<ul>\n<li>Permissions are now a related admin, placed into a different tab in admin UI. See #1570.</li>\n<li>Links can be open in new windows. See #1582.</li>\n<li>Unified login UI in all themes. See #1382.</li>\n<li>Removed multimedia slide when only one multimedia asset is shown. See #1460.</li>\n<li>A new <tt>reinstall_plugins</tt> command to reinstall enabled plugins. See #1594.</li>\n<li>Local roles and permissions can be deleted. See #1605.</li>\n<li>A lot of bugs fixed:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Fixed broken comments in document sections for anonymous users. See #1614.</li>\n<li>Fixes menu reordering. See #1581.</li>\n<li>Errors in block reordering with drag-and-drop. See #1580, #1581.</li>\n<li>Fixes some admin UI look and feel errors: See #1563, #1584, #1588, #1585.</li>\n<li>Fixed Tag cloud block title look and feel in Merengue theme. See #1497.</li>\n<li>Fixed block overwriting when same block is placed twice. See #1575.</li>\n<li>Fixed error in ezdashboard plugin. See #1586.</li>\n<li>Limit only one contact form for every content. See #1196.</li>\n<li>Fixed oot error. See #1579.</li>\n<li>Fixed south migration when tables already exist. See #1592.</li>\n<li>Fixed <tt>migrate_plugins</tt> command in some circunstances. See #1595.</li>\n<li>Fixed two viewlet errors. See #1600 and #1616.</li>\n<li>Calendar block rendered using project locale. See #1609.</li>\n<li>Fixed 404 error in <tt>contactform</tt> plugin. See #1536.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"version-0-7-0-beta4-3913-revision\">\n<h3>Version 0.7.0-beta4 (3913 revision)</h3>\n<ul>\n<li>Permissions are now definible into sections. See #1564.</li>\n<li>Some bugs fixed:</li>\n</ul>\n<blockquote>\n<ul>\n<li>When I create a banner I can’t see the image on site. See #1547.</li>\n<li>Documented announcements section.</li>\n<li>Layout errors in translation UI with IE. See #583.</li>\n<li>Changed admin app index style. See #1569.</li>\n<li>Bad django-inlinetrans dependence in requirements.txt.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"version-0-7-0-beta3-3880-revision\">\n<h3>Version 0.7.0-beta3 (3880 revision)</h3>\n<ul>\n<li>Inline translation allow to create/update po files when the msgid is not found in any catalog. See #1401.</li>\n<li>Some bugs fixed:</li>\n</ul>\n<blockquote>\n<ul>\n<li>The block tools (for dragging and configuring) are well placed on CSS absolute positioned blocks. See #1562.</li>\n<li>Adapted ezdashboard and filebrowser plugin to new registering API.</li>\n<li>Fix bug rendering document sections. See #1565.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"version-0-7-0-beta2-3861-revision\">\n<h3>Version 0.7.0-beta2 (3861 revision)</h3>\n<ul>\n<li>Fixed a lot of bug. These are the most important:</li>\n</ul>\n<blockquote>\n<ul>\n<li>If a plugin is broken when registering all plugins, the process stopped. Now it continues with next plugin. See #1539.</li>\n<li>Cleared Django apps cache after unregister plugin, to avoid weird errors in some circunstances. See #1526.</li>\n<li>Plugins disabling was broken (only worked uninstalling). Now you can disable plugins. See #1486.</li>\n<li>Blocks with content types filtering configuration was not showing any data. See #1530.</li>\n<li>Add permission definition in related and non related object tools.</li>\n<li>You can define successfully blocks related both in sections and in contents. See #1509 and #1491.</li>\n<li>Removed 2mbytes of unused media in <tt>chunks</tt> plugin. See #1472.</li>\n<li>Block config button is not shown if block has no available configuration. See #1528.</li>\n<li>Others: #1532, #1519, #1508, #1523, #1525, #1543, #1544, #1487, #1460, #1410, #1497, #1527, #1498, #1476, #1549, #1546, #728, #608, #1478, #1378, #1551, #1552.</li>\n</ul>\n</blockquote>\n<ul>\n<li>Adapted Selenium test to new Merengue admin redesign. See #1524.</li>\n<li>Enable captcha in <tt>feedback</tt> plugin for non authenticated users. See #1534.</li>\n<li>Adapted demo.merengueproject.org demo fixtures to section as base content refactoring. See #1531.</li>\n<li>Finish <tt>Saml2</tt> plugin to support federated authentication/authorization. See #1442.</li>\n<li>Users can now add feed collections to sections. See #1538.</li>\n<li>Improved plugin tab to get more intuitive for users. See #1540.</li>\n<li>Improve run_suites.py script, to run all selenium tests automatically. Also improve the documentation. See #1458.</li>\n<li>Make direct accesses to regiteres blocks and actions in installed plugins, from plugin admin. See #1542.</li>\n<li>Complete documentation in Merengue error reference, Merengue deployment, JS/CSS compression.</li>\n<li>Finished django-announcements integration.</li>\n</ul>\n</div>\n<div id=\"version-0-7-0-beta1-3786-revision\">\n<h3>Version 0.7.0-beta1 (3786 revision)</h3>\n<ul>\n<li>Manager can set a numbers of objects limit in collections. See #1510.</li>\n<li>Implement related object tools for related model admins. See #1502.</li>\n<li>Redesign of Merengue admin to improve usability. See #1503 and #1517.</li>\n<li>Integrated django-announcements. Not finished yet. See #1302.</li>\n<li>Saml2 pulgin to get federated AuthN/AuthR via SAML SP. Not finished yet. See #1442.</li>\n<li>Toolbar panel which shows Merengue version for debugging purposes. See #1473.</li>\n<li>Section request middleware (which define <tt>request.section</tt>) is now pluggable, and can be easily redefined, for example by <tt>microsite</tt> plugin. See #1484.</li>\n<li>Support registering by instances, to be able to have multiple registered items of a registrable class. Used for blocks related to contents. See #1445.</li>\n<li>New filter by type in “browse content” admin view. See #1483.</li>\n<li>Merengue sections (BaseSection model) are now base contents (inherited to BaseContent), with permissions, related blocks, and all features implemented in Merengue. See #1318.</li>\n<li>Fixed a lot of bugs caused by last features added. See #1433, #1355, #1330, #1192, #1465, #1469, #1396, #1481, #1493, #1504, #1494, #1499.</li>\n</ul>\n</div>\n<div id=\"version-0-7-0-alpha-3630-revision\">\n<h3>Version 0.7.0-alpha (3630 revision)</h3>\n<ul>\n<li>Support registering by instances (not classes) in Merengue registry, with singleton feature. See #1445.</li>\n<li>Itags view, to show all tags in website. See #1404.</li>\n<li>Pluggable toolbar with panels registrable in plugins. See #1391.</li>\n<li>Inline edit support for contents, with a rewritten django-inplaceedit.</li>\n<li>New selenium tests for the new features in 0.7 series.</li>\n<li>Integrate JS and CSS assets in a place holder, avoiding duplicates and compressing code. See #1418.</li>\n<li>CSS and JS compression when its configured for a production site. See #1415.</li>\n<li>Improved yaco theme. See #1388.</li>\n<li>Block configuration in public view. See #1365.</li>\n<li>South support in plugins. See #1381.</li>\n<li>Inline translation in all Merengue templates, using django-inlinetrans. See #1349.</li>\n<li>Implemented a print style sheet and a print action. See #966.</li>\n<li>Internationalized URLs. See #1112.</li>\n<li>Optimized Merengue SQL sentences. See #1320.</li>\n<li>Implemented unit tests for registry application. See #1314.</li>\n<li>Cleaned up and refactored the Merengue menu implementation. See #1313.</li>\n<li>Contact information is rendered in contents which have filled it. See #1309.</li>\n<li>Implemented a review system, used in <tt>redirect</tt> plugin. See #1074.</li>\n<li>You can attach blocks to individual contents, with a custom configuration for them. See #1261.</li>\n<li>Manager can set the rendering a block only for one or more contents, with custom block configuration for each content. See #1247.</li>\n<li>Plain text generation support for all contents, for indexing, tagging, etc. See #1088.</li>\n<li>Refactored MIDDLEWARE_CLASSES to improve customization in projects. See #1253.</li>\n<li>New features for microsite plugin:<ul>\n<li>MIDDLEWARE to allow URLs like /foo-microsite/foo/url that will be like /microsites/foo-microsite/foo/url/</li>\n<li>All blocks in built-in plugins are valid inside microsites, showing only microsite contents.</li>\n</ul>\n</li>\n<li>Implemented contentmenu plugin, to allow content grouping in a Menu, but without having contents in same section.</li>\n<li>Huge plugins, viewlets, blocks and breadcrumbs refactoring to improve redefinition in plugins. See #1256, #1258 and #1269</li>\n<li>All built-in plugins uses collection when needed, to improve customization in listings by managers. See #1267.</li>\n<li>HTML editor (TinyMCE) is now resizable. See #1270.</li>\n<li>Removed hook_post_register hook and implemented post_install hook, invoked only when plugin are installed. See #1277.</li>\n<li>Make rss plugin more customizable. See #1273.</li>\n<li>Implemented <tt>tmtemplates</tt> plugin, to create HTML templates which can be inserted in every HTML field.</li>\n<li>Collection can filtered by adding a extra <tt>_filters_collection</tt> context in view.</li>\n</ul>\n</div>\n<div id=\"version-0-6-0-final\">\n<h3>Version 0.6.0-final</h3>\n<ul>\n<li>Changed Django dependence to 1.1.3 version, because a security issue, fixed on that version.</li>\n<li>Fixed some Postgresql database locks while creating the models when some plugins are installed.</li>\n<li>A little speed up for Postgresql backend, using <tt>autocommit</tt> option by default.</li>\n<li>Other minor bugfixes:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Error when accessing document without sections (after delete it).</li>\n<li>Error when creating a searcher in a collection and you search for something on public view.</li>\n<li>Manager cannot assign permissions to thread objects inside a forum.</li>\n<li>Ensure NOT_PROVIDED value (got by the not defined config params) evaluates to False to avoid some errors.</li>\n<li>Fixed web layout in the restart server confirmation page in transhette.</li>\n</ul>\n</blockquote>\n<ul>\n<li>Added <tt>name</tt> field to contact information.</li>\n</ul>\n</div>\n<div id=\"version-0-6-0-rc1\">\n<h3>Version 0.6.0-rc1</h3>\n<ul>\n<li>Several bugfixes:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Fixed new error in params validation.</li>\n<li>Unit tests execution fixed when memcached is used as caching backend.</li>\n<li>Javascript error when moving blocks.</li>\n<li>Deferred PIL import in captcha to the moment of create first captcha thumbnail, to avoid syncdb errors.</li>\n<li>Improved validation in integerparams.</li>\n<li>Fixed installing of django-inlinetrans with PIP.</li>\n<li>Now all users with “manage_portal” permission can move blocks.</li>\n<li>Allow deleting sent forms in contactform plugin.</li>\n<li>Fixes searching in admin <tt>browse contents</tt> view.</li>\n</ul>\n</blockquote>\n<ul>\n<li>Speed up Merengue permission checking.</li>\n<li>Delete view in Merengue admin not take care about Merengue permissions in objects which are deleted in cascade.</li>\n<li>Refactored and fixed all selenium tests.</li>\n</ul>\n</div>\n<div id=\"version-0-6-0-beta1-2921-revision\">\n<h3>Version 0.6.0-beta1 (2921 revision)</h3>\n<ul>\n<li>A lot of bugfixes:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Section custom CSS validation error fixed.</li>\n<li>More robust tagcloud and tag validation for itag plugin.</li>\n<li>Several bugfixes to transhette.</li>\n<li>Removed several “permissions” button in admin which don’t worked.</li>\n<li>Registry params validation support (for plugins, actions, etc.).</li>\n<li>Included recaptcha keys to get captcha plugin works out-of-the-box.</li>\n<li>Support both for PIL 1.1.6 and 1.1.7 (have incompatible import sentences).</li>\n<li>Better date support in collections.</li>\n<li>Fixed some errors with truncatechars filter in collections.</li>\n<li>Errors in autoreports link in plugins admin.</li>\n<li>Fixes stdimage validation for non required fields.</li>\n<li>Fixed wrong user message when editing contents.</li>\n<li>Fixed 404 error when adding link into sections.</li>\n<li>Fixed error editing threads of a forum in forum plugin.</li>\n<li>Better validation in some parts of subscription plugin.</li>\n<li>Improved permission handling for plugin managers.</li>\n<li>Fixed some web layout errors.</li>\n<li>More robust handling of “empty” filters and other validation issues in collections.</li>\n<li>Fixed errors in feed info in rss plugin.</li>\n</ul>\n</blockquote>\n<ul>\n<li>Support of HTML emails in contactform plugin.</li>\n<li>Non overwritable fixtures support.</li>\n<li>Completed spanish translations.</li>\n<li>Added sent date column in forms sents admin in contactform plugin.</li>\n<li>Read only fields works with foreign key fields.</li>\n<li>Complete documentation of:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Merengue fixtures.</li>\n<li>Block hiding/showing by URL regex.</li>\n<li>Install instructions and python dependences.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"version-0-6-0-alpha3-2844-revision\">\n<h3>Version 0.6.0-alpha3 (2844 revision)</h3>\n<ul>\n<li>Split dependences to an external requirements.txt file.</li>\n</ul>\n</div>\n<div id=\"version-0-6-0-alpha2-2842-revision\">\n<h3>Version 0.6.0-alpha2 (2842 revision)</h3>\n<ul>\n<li>Removed external SVN dependences. Now Merengue has all these dependences as python eggs.</li>\n<li>Implemented a render_all_blocks templatetags, which is a shortcut to write less templating code.</li>\n<li>Replaced plugins which render lists with customizable collections.</li>\n<li>Make Merengue documentation compatible with Sphinx 1.0.</li>\n<li>Several bug fixes related to:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Permissions system.</li>\n<li>Administration broken links.</li>\n<li>banners, oldbrowser and event plugin.</li>\n<li>transhette application.</li>\n<li>etc.</li>\n</ul>\n</blockquote>\n<ul>\n<li>Improved usability in Merengue admin:</li>\n</ul>\n<blockquote>\n<ul>\n<li>A content tree, for browsing all contents.</li>\n<li>Improved visual block reordering.</li>\n</ul>\n</blockquote>\n<ul>\n<li>Themes can have a screenshot, for previewing before activating.</li>\n<li>Plugins can define new middlewares.</li>\n<li>A new “Owner” role, to may customize permissions for content owners. This role is assigned for a user when the context is a content owned by him.</li>\n<li>Manager can disable global permissions adquisition for a content, for example to disable “View” permission in private contents.</li>\n<li>Blocks showable or hiddeable by URLs in Merengue admin, using regular expressions.</li>\n<li>Begin integration with django-notification.</li>\n<li>Contents can be defined as permanents (no deletable, no changeable or some fields not changeables), when your logic relies on these contents.</li>\n<li>Plugin introspection before installing it. In Merengue admin you will see what blocks will be created by a plugin, or what new content types, etc.</li>\n<li>When customizing a section CSS, you can upload new images to may customize the backgrounds.</li>\n<li>New plugins:</li>\n</ul>\n<blockquote>\n<ul>\n<li>contactform: to create forms, customizing fields, emails, behaviour, etc.</li>\n<li>smartsearch: to include and manage search form, for example inside collections.</li>\n<li>rss: to make feeds in your site, which are configurable.</li>\n<li>redirect: to configure HTTP redirections in your site.</li>\n<li>itag: tagging with i18n support.</li>\n<li>addthis: addthis.com integration.</li>\n<li>imagesize: notifications when size of uploaded images pass the configurables thresholds.</li>\n</ul>\n</blockquote>\n</div>\n<div id=\"version-0-6-0-alpha1-2541-revision\">\n<h3>Version 0.6.0-alpha1 (2541 revision)</h3>\n<ul>\n<li>Huge speed up on related admin registration.</li>\n<li>Allow to extends Merengue TinyMCE editor settings in apps and plugins.</li>\n<li>Content collections, which are lists of managed contents with configurable filters, search form and listing options.</li>\n<li>Theme support in Merengue admin site.</li>\n<li>Post register hook to plugins, to allow developers to execute tasks after installing plugin.</li>\n<li>Included language catalogs in all apps and plugins. Also included compiled .mo files.</li>\n<li>New plugins:</li>\n</ul>\n<blockquote>\n<ul>\n<li>oot: ODT conversion of managed contents.</li>\n<li>banner: banner management plugin.</li>\n<li>oldbrowser: a plugin that makes easy to notify to users that their browser is too old.</li>\n</ul>\n</blockquote>\n<ul>\n<li>Several improvements in forum plugin:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Grouping forums into categories.</li>\n<li>Show last comment in forum list and forum view.</li>\n<li>Do not allow anonymous users.</li>\n<li>Allow to close a thread so no new comments could be added.</li>\n<li>Allow to move a thread from one forum to another one.</li>\n<li>Allow different users to moderate different forums.</li>\n</ul>\n</blockquote>\n<ul>\n<li>Implemented a subscribers listing in subscription plugin.</li>\n</ul>\n</div>\n<div id=\"version-0-5-1\">\n<h3>Version 0.5.1</h3>\n<p>Note: Changes from 0.5.1-rc1 version</p>\n<ul>\n<li>Better south integration with translation system, that allows to migrate all translated models with all possible languages setting.</li>\n<li>Fixed a lot of bugs like:</li>\n</ul>\n<blockquote>\n<ul>\n<li>Avoid URL patterns grown every 404 request when have debug toolbar installed.</li>\n<li>Fix audio player.</li>\n<li>Error in URL parsing when accessing document inside sections.</li>\n<li>Error with negative numbers in integer registry params.</li>\n<li>Blocks placed in “home” and “beforecontent” position dissappears in home page.</li>\n<li>Make facebook share link (from facebook plugin) works behind virtual hosts.</li>\n<li>Highlight plugin does not show related content images.</li>\n</ul>\n</blockquote>\n</div>\n</div>\n\n          </div>"}, "last_serial": 794704, "releases": {"0.5": [{"comment_text": "", "digests": {"md5": "8b71264fd3f1825fd069d541828cf20a", "sha256": "8c751b4b6ee208b274bf21b526b95b4b321fc038fb0a5351d84df96e111ba0aa"}, "downloads": -1, "filename": "merengue-0.5.tar.gz", "has_sig": false, "md5_digest": "8b71264fd3f1825fd069d541828cf20a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6798532, "upload_time": "2010-06-23T02:44:58", "upload_time_iso_8601": "2010-06-23T02:44:58.724822Z", "url": "https://files.pythonhosted.org/packages/45/cc/89e84986bbb50d211087594359ab51a682ea0520ac97864d021a6d5c6a92/merengue-0.5.tar.gz", "yanked": false}], "0.5.1": [{"comment_text": "", "digests": {"md5": "59ab1b0aac48692d602fa7c726112d99", "sha256": "e48867c80873e36cfcdafa7a020498cf62af2dc8253ca052bd30e5389e60131c"}, "downloads": -1, "filename": "merengue-0.5.1.tar.gz", "has_sig": false, "md5_digest": "59ab1b0aac48692d602fa7c726112d99", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10034611, "upload_time": "2010-11-11T03:42:16", "upload_time_iso_8601": "2010-11-11T03:42:16.540956Z", "url": "https://files.pythonhosted.org/packages/27/49/ef241217e5bd504f50d67cc6d261ac916d51af49aa4990167486ea1a5495/merengue-0.5.1.tar.gz", "yanked": false}], "0.5.1-beta": [{"comment_text": "", "digests": {"md5": "914e9dd7f62df14bd829692fccc9704a", "sha256": "14e7995e42f867a72b0c2459ce84842b975f35c732ff20b89825c1c74c8883f6"}, "downloads": -1, "filename": "merengue-0.5.1-beta.tar.gz", "has_sig": false, "md5_digest": "914e9dd7f62df14bd829692fccc9704a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8416603, "upload_time": "2010-07-21T14:16:25", "upload_time_iso_8601": "2010-07-21T14:16:25.357881Z", "url": "https://files.pythonhosted.org/packages/67/85/84c07abd89c1c0f0b48b948f729739928064788a210044a13e1c2547f49c/merengue-0.5.1-beta.tar.gz", "yanked": false}], "0.5.1-beta2": [{"comment_text": "", "digests": {"md5": "b39b5b840f3cb924ae21b71b4723809e", "sha256": "16b3f557ff050a26cf91707e6c6ef7b8632043f2286425b33f105efdfb95a72a"}, "downloads": -1, "filename": "merengue-0.5.1-beta2.tar.gz", "has_sig": false, "md5_digest": "b39b5b840f3cb924ae21b71b4723809e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8399325, "upload_time": "2010-07-21T19:49:03", "upload_time_iso_8601": "2010-07-21T19:49:03.580230Z", "url": "https://files.pythonhosted.org/packages/9f/80/d6651b8d69591bfb31ecbed31c74de8e117d0babf67060bb3b102e8bc846/merengue-0.5.1-beta2.tar.gz", "yanked": false}], "0.5.1-beta3": [{"comment_text": "", "digests": {"md5": "b1001c3ecd6fbafb9b2f31792c4411b7", "sha256": "9b4508845beaaee730f2aa6bee42298a1aa932a42189009d85a0f5aa919926c1"}, "downloads": -1, "filename": "merengue-0.5.1-beta3.tar.gz", "has_sig": false, "md5_digest": "b1001c3ecd6fbafb9b2f31792c4411b7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9812851, "upload_time": "2010-08-04T02:11:41", "upload_time_iso_8601": "2010-08-04T02:11:41.491078Z", "url": "https://files.pythonhosted.org/packages/1d/55/051f4cd1b2e8669267f9475d2d309bd47a8b9dde038c381cf7f9eaa4aef7/merengue-0.5.1-beta3.tar.gz", "yanked": false}], "0.5.1-rc1": [], "0.6.0-alpha1": [{"comment_text": "", "digests": {"md5": "ac564a56e24ae28644222a481c73f97e", "sha256": "b7cbb35db7f8a4865fb113f83fbfa433b4a069f93548898eddaf886fbacaa2c9"}, "downloads": -1, "filename": "merengue-0.6.0-alpha1.tar.gz", "has_sig": false, "md5_digest": "ac564a56e24ae28644222a481c73f97e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9936173, "upload_time": "2010-12-22T18:27:13", "upload_time_iso_8601": "2010-12-22T18:27:13.824173Z", "url": "https://files.pythonhosted.org/packages/eb/c8/113de5ecd82c60876004fac1142757eb8a70fbe84fefea5df46ea9dc6d88/merengue-0.6.0-alpha1.tar.gz", "yanked": false}], "0.6.0-alpha2": [{"comment_text": "", "digests": {"md5": "39b517238c3f87f3f73849b129436ec8", "sha256": "a4b03dd9694dd00eadd98812420eaf933644628ea8ac2038aa391375b4de1142"}, "downloads": -1, "filename": "merengue-0.6.0-alpha2.tar.gz", "has_sig": false, "md5_digest": "39b517238c3f87f3f73849b129436ec8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9905474, "upload_time": "2010-12-28T19:15:12", "upload_time_iso_8601": "2010-12-28T19:15:12.878034Z", "url": "https://files.pythonhosted.org/packages/0d/7c/096470816175427283d1c4247119b01b8fed5d1a2daafd947c6c52102bb2/merengue-0.6.0-alpha2.tar.gz", "yanked": false}], "0.6.0-alpha3": [{"comment_text": "", "digests": {"md5": "6cf2a361f59006e79743cb8fbee4c40e", "sha256": "843cd0dacfd6c0acc4361477fdf8bc864bcc96f3c1962ea17fe699fae9441f7d"}, "downloads": -1, "filename": "merengue-0.6.0-alpha3.tar.gz", "has_sig": false, "md5_digest": "6cf2a361f59006e79743cb8fbee4c40e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9905808, "upload_time": "2010-12-29T16:37:23", "upload_time_iso_8601": "2010-12-29T16:37:23.897822Z", "url": "https://files.pythonhosted.org/packages/34/a2/031a48e8cecffe422718f8ec2c26579a95cc0a328861f99224b2100e92f7/merengue-0.6.0-alpha3.tar.gz", "yanked": false}], "0.6.0-beta1": [{"comment_text": "", "digests": {"md5": "6d1d2bb62d35c1d935b15851e1887859", "sha256": "bbf46adb5c31d9f642bcb3f797b5a55094050986e3acd04280632391c5695ecc"}, "downloads": -1, "filename": "merengue-0.6.0-beta1.tar.gz", "has_sig": false, "md5_digest": "6d1d2bb62d35c1d935b15851e1887859", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9892439, "upload_time": "2011-01-10T20:35:38", "upload_time_iso_8601": "2011-01-10T20:35:38.411798Z", "url": "https://files.pythonhosted.org/packages/ee/25/2fc1c611d406273761189fea8a98b0ddb8e315cfb54f58de72d835b292ff/merengue-0.6.0-beta1.tar.gz", "yanked": false}], "0.6.0-final": [{"comment_text": "", "digests": {"md5": "fc81a88be58a133a71e4089ad10260ae", "sha256": "17cb0894e1ea694ae617a59b7b8530cc048bf24e8196ae060d0e8ef09f77568b"}, "downloads": -1, "filename": "merengue-0.6.0-final.tar.gz", "has_sig": false, "md5_digest": "fc81a88be58a133a71e4089ad10260ae", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9894458, "upload_time": "2011-01-24T17:48:54", "upload_time_iso_8601": "2011-01-24T17:48:54.478585Z", "url": "https://files.pythonhosted.org/packages/76/a7/eaba2adc8fdbe4b309b0b8732d2144f8ceec133b94a692cd529ed7e04017/merengue-0.6.0-final.tar.gz", "yanked": false}], "0.6.0-rc1": [{"comment_text": "", "digests": {"md5": "b6b09460c41277567c33275cc143d8b8", "sha256": "01ff652439f4fccc57c2d08d4043ff008babb0fdbdeca006301755e15b8c262f"}, "downloads": -1, "filename": "merengue-0.6.0-rc1.tar.gz", "has_sig": false, "md5_digest": "b6b09460c41277567c33275cc143d8b8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9889614, "upload_time": "2011-01-22T03:40:28", "upload_time_iso_8601": "2011-01-22T03:40:28.990147Z", "url": "https://files.pythonhosted.org/packages/28/92/8ba16c2c0f30f08e9aa4ca382cc7ef26d2a84f5f100ee060552aa1f88d58/merengue-0.6.0-rc1.tar.gz", "yanked": false}], "0.6.1": [{"comment_text": "", "digests": {"md5": "b43ebd78a30233bcabde9a89c879342d", "sha256": "21659b83a326e7bc1feeb52355d0d0de534f1b6c3e651bdee8181717e6626876"}, "downloads": -1, "filename": "merengue-0.6.1.tar.gz", "has_sig": false, "md5_digest": "b43ebd78a30233bcabde9a89c879342d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9892060, "upload_time": "2011-01-31T02:44:41", "upload_time_iso_8601": "2011-01-31T02:44:41.746813Z", "url": "https://files.pythonhosted.org/packages/4a/ca/d3f471cb1c7b63cb250b472c266417aa899f9273374948125e82045bd59a/merengue-0.6.1.tar.gz", "yanked": false}], "0.6.2": [{"comment_text": "", "digests": {"md5": "3e61577df92528a5e78a13da6db6c6ef", "sha256": "1285effd28bb8271c0069dd340777c5b3684e6ffbfe33081b23135a37f31da00"}, "downloads": -1, "filename": "merengue-0.6.2.tar.gz", "has_sig": false, "md5_digest": "3e61577df92528a5e78a13da6db6c6ef", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9892157, "upload_time": "2011-02-01T12:50:39", "upload_time_iso_8601": "2011-02-01T12:50:39.079884Z", "url": "https://files.pythonhosted.org/packages/c4/29/fee2b91275c720c2874e8c556c106fd7338a127cda7f53eb050bd6e12b59/merengue-0.6.2.tar.gz", "yanked": false}], "0.7.0": [{"comment_text": "", "digests": {"md5": "477fd5158e5dc892b6b0dff476174e19", "sha256": "bec12e3de4187d4ba012f8fa6fd47b8e474f7aa95d75c283597a845a654f3d4e"}, "downloads": -1, "filename": "merengue-0.7.0.tar.gz", "has_sig": false, "md5_digest": "477fd5158e5dc892b6b0dff476174e19", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10120427, "upload_time": "2011-03-24T16:39:02", "upload_time_iso_8601": "2011-03-24T16:39:02.825309Z", "url": "https://files.pythonhosted.org/packages/e4/13/6ea64ef2b4b96255d04fc77adbbc74fd23a241d8e3f59df546bb60ef8838/merengue-0.7.0.tar.gz", "yanked": false}], "0.7.0-alpha1": [{"comment_text": "", "digests": {"md5": "228c8dfbf9a1bbe0f2545c5d9315ac41", "sha256": "cd9932a2cea990cf0ebe5c0a3ba1b590c18d8ae5d58eabedabc52df68c2fa5a1"}, "downloads": -1, "filename": "merengue-0.7.0-alpha1.tar.gz", "has_sig": false, "md5_digest": "228c8dfbf9a1bbe0f2545c5d9315ac41", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10153678, "upload_time": "2011-02-14T12:54:28", "upload_time_iso_8601": "2011-02-14T12:54:28.758573Z", "url": "https://files.pythonhosted.org/packages/92/29/3ec9bb9922b937c1e80b63aecde83fdf6ae00a93f558de09ec2326f37fa1/merengue-0.7.0-alpha1.tar.gz", "yanked": false}], "0.7.0-beta1": [{"comment_text": "", "digests": {"md5": "6940bbc66f9e4f18adea75e2676cc9b1", "sha256": "e7ed60e9e55f4829078a93be77486bf294313d87ae3f0ec54f849bbbfbdd167f"}, "downloads": -1, "filename": "merengue-0.7.0-beta1.tar.gz", "has_sig": false, "md5_digest": "6940bbc66f9e4f18adea75e2676cc9b1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10176816, "upload_time": "2011-02-19T16:48:23", "upload_time_iso_8601": "2011-02-19T16:48:23.187491Z", "url": "https://files.pythonhosted.org/packages/bd/74/898e96cb7c890b69f932913153ab14ba3bd5195e647f86bb775b78656fcd/merengue-0.7.0-beta1.tar.gz", "yanked": false}], "0.7.0-beta2": [{"comment_text": "", "digests": {"md5": "8915560c42f6e48db19cd51ab6e7f5ec", "sha256": "a44c22ddc46577437eb0d39af63fc5daac3351f6710a47b83b4dd935f23ed95d"}, "downloads": -1, "filename": "merengue-0.7.0-beta2.tar.gz", "has_sig": false, "md5_digest": "8915560c42f6e48db19cd51ab6e7f5ec", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9813706, "upload_time": "2011-02-22T20:14:50", "upload_time_iso_8601": "2011-02-22T20:14:50.433098Z", "url": "https://files.pythonhosted.org/packages/8c/f1/d02f52990bb7a95e6f5a9621a665301998de03b14c4d0f77b9ae0e2db679/merengue-0.7.0-beta2.tar.gz", "yanked": false}], "0.7.0-beta3": [{"comment_text": "", "digests": {"md5": "063ec978623841371ed8a1c0606e2bb9", "sha256": "d09c53277c8d90a6381b3c7a6c545d61cd2e9273b7a58687551cd0c864f82d1d"}, "downloads": -1, "filename": "merengue-0.7.0-beta3.tar.gz", "has_sig": false, "md5_digest": "063ec978623841371ed8a1c0606e2bb9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9813259, "upload_time": "2011-02-23T12:44:19", "upload_time_iso_8601": "2011-02-23T12:44:19.062496Z", "url": "https://files.pythonhosted.org/packages/ae/be/e50fa45911a6e12378a3ef0ffc80ceaa522bf52d654c43645b2198c0607a/merengue-0.7.0-beta3.tar.gz", "yanked": false}], "0.7.0-beta4": [{"comment_text": "", "digests": {"md5": "1d7f8cf61d2f07aff8ba6b68c9f37a72", "sha256": "13ddbf6b788d1574f1153511ae807bcd56982ce3936e07bb875482776b0d66af"}, "downloads": -1, "filename": "merengue-0.7.0-beta4.tar.gz", "has_sig": false, "md5_digest": "1d7f8cf61d2f07aff8ba6b68c9f37a72", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9814215, "upload_time": "2011-02-24T19:32:21", "upload_time_iso_8601": "2011-02-24T19:32:21.707199Z", "url": "https://files.pythonhosted.org/packages/ca/c3/3936d7837815fb75ba0b98ddaf26d675e087f262d5413f38a20b4ba5aab1/merengue-0.7.0-beta4.tar.gz", "yanked": false}], "0.7.1": [{"comment_text": "", "digests": {"md5": "e858ccaa1ca375420d5398690a377fca", "sha256": "46350e297d9a394c1b8539d333c8708550a58b1c54bf988efc043f14350ffd41"}, "downloads": -1, "filename": "merengue-0.7.1.tar.gz", "has_sig": false, "md5_digest": "e858ccaa1ca375420d5398690a377fca", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10146999, "upload_time": "2011-04-21T18:31:56", "upload_time_iso_8601": "2011-04-21T18:31:56.377510Z", "url": "https://files.pythonhosted.org/packages/72/bf/eca6eac749ca3d4f9edad4ea6273536c2dd51bc44e1573e89299a4d34d7a/merengue-0.7.1.tar.gz", "yanked": false}], "0.8.0": [{"comment_text": "", "digests": {"md5": "b2c8d957eba66284bc11ccf43d264098", "sha256": "bc756e02db71aa93db95cac9e9bb415720bfdebc66070fef32ccb422c4e4f233"}, "downloads": -1, "filename": "merengue-0.8.0.tar.gz", "has_sig": false, "md5_digest": "b2c8d957eba66284bc11ccf43d264098", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10854738, "upload_time": "2011-12-09T16:19:47", "upload_time_iso_8601": "2011-12-09T16:19:47.441852Z", "url": "https://files.pythonhosted.org/packages/10/7f/24d2117b4aef7f8bf3a312d820816b8983059b38f5e3efdb83651551513a/merengue-0.8.0.tar.gz", "yanked": false}], "0.8.0-b1": [{"comment_text": "", "digests": {"md5": "c4cb8d615adcf7367517bb87d16386f1", "sha256": "3bf787425636875ce5b3fce149333afe887ed8a33de94420b280ee201ea05121"}, "downloads": -1, "filename": "merengue-0.8.0-b1.tar.gz", "has_sig": false, "md5_digest": "c4cb8d615adcf7367517bb87d16386f1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10345476, "upload_time": "2011-06-15T23:50:48", "upload_time_iso_8601": "2011-06-15T23:50:48.019182Z", "url": "https://files.pythonhosted.org/packages/32/45/9a0426b929f0b4ca224d842e70a2750d4616408030326cbde2f705a93cf9/merengue-0.8.0-b1.tar.gz", "yanked": false}], "0.8.0-b2": [{"comment_text": "", "digests": {"md5": "88ffd3590111708c2784d60a7cf5e280", "sha256": "8470ccb3d3732644e9cfc9dd16adafd5aa08184d35b4f61921c1ee1eb702807b"}, "downloads": -1, "filename": "merengue-0.8.0-b2.tar.gz", "has_sig": false, "md5_digest": "88ffd3590111708c2784d60a7cf5e280", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10351638, "upload_time": "2011-06-17T19:20:07", "upload_time_iso_8601": "2011-06-17T19:20:07.281125Z", "url": "https://files.pythonhosted.org/packages/40/3a/060bf4037c09b786b9a8f0e85223cc419f9e299c5cf5f183fcc152472826/merengue-0.8.0-b2.tar.gz", "yanked": false}], "0.8.0-rc1": [{"comment_text": "", "digests": {"md5": "165e40f9d86f71ee5b827d5f0189a0d1", "sha256": "27d8a99887df922efcc54eec09883fb6ad3c99f780660859eda87ec5517419b2"}, "downloads": -1, "filename": "merengue-0.8.0-rc1.tar.gz", "has_sig": false, "md5_digest": "165e40f9d86f71ee5b827d5f0189a0d1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12675481, "upload_time": "2011-06-28T01:11:52", "upload_time_iso_8601": "2011-06-28T01:11:52.316192Z", "url": "https://files.pythonhosted.org/packages/42/24/4fc7cd29d8c74ab637d1b87f97bc0ed6316402984a9d20edafb15c54f5cd/merengue-0.8.0-rc1.tar.gz", "yanked": false}], "0.8.1": [{"comment_text": "", "digests": {"md5": "1d674bfc4d9b1758bda49309c664092e", "sha256": "57131bbb9965e383d820ce2785fa7cc06c067677490b0259e40bbeedb7a0f055"}, "downloads": -1, "filename": "merengue-0.8.1.tar.gz", "has_sig": false, "md5_digest": "1d674bfc4d9b1758bda49309c664092e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10857053, "upload_time": "2012-03-16T08:37:43", "upload_time_iso_8601": "2012-03-16T08:37:43.725613Z", "url": "https://files.pythonhosted.org/packages/1a/6a/c1681c8a1fd58747612cc9202518ac801aed26d1779cdc0c6ea4dfe9b49c/merengue-0.8.1.tar.gz", "yanked": false}], "0.8.2": [{"comment_text": "", "digests": {"md5": "b4167cccfd0887db81ae6b5aa3056e0f", "sha256": "06aa393d2ded0ce218c6a8695b6d220d18a424cb9483ff32b3410a487b60e26f"}, "downloads": -1, "filename": "merengue-0.8.2.tar.gz", "has_sig": false, "md5_digest": "b4167cccfd0887db81ae6b5aa3056e0f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10856725, "upload_time": "2012-04-09T09:19:35", "upload_time_iso_8601": "2012-04-09T09:19:35.470621Z", "url": "https://files.pythonhosted.org/packages/45/3c/c3471401332e60769ab5cd1c125afffe35dccbecea07ac62b563016b4372/merengue-0.8.2.tar.gz", "yanked": false}], "0.9.0": [{"comment_text": "", "digests": {"md5": "4178d256234ea4668db211b18c349461", "sha256": "68f4b8d94b029f805088b4052702dc5ccc5c12024f75da33350b17367535e54e"}, "downloads": -1, "filename": "merengue-0.9.0.tar.gz", "has_sig": false, "md5_digest": "4178d256234ea4668db211b18c349461", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10892566, "upload_time": "2013-01-24T18:39:49", "upload_time_iso_8601": "2013-01-24T18:39:49.878384Z", "url": "https://files.pythonhosted.org/packages/75/41/26b8dd83091ebe69152cf239e5897153744e063f598fc8a9c6e4236896af/merengue-0.9.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "4178d256234ea4668db211b18c349461", "sha256": "68f4b8d94b029f805088b4052702dc5ccc5c12024f75da33350b17367535e54e"}, "downloads": -1, "filename": "merengue-0.9.0.tar.gz", "has_sig": false, "md5_digest": "4178d256234ea4668db211b18c349461", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10892566, "upload_time": "2013-01-24T18:39:49", "upload_time_iso_8601": "2013-01-24T18:39:49.878384Z", "url": "https://files.pythonhosted.org/packages/75/41/26b8dd83091ebe69152cf239e5897153744e063f598fc8a9c6e4236896af/merengue-0.9.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:56:10 2020"}