{"info": {"author": "Philip Hodder", "author_email": "philip.hodder@encodis.com", "bugtrack_url": null, "classifiers": ["Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Programming Language :: Python", "Topic :: Text Processing :: Markup", "Topic :: Utilities"], "description": "# Introduction\n\nFor a while I've been running the excellent [DokuWiki](https://www.dokuwiki.org) on my Mac using OS X's bundled Apache server. The problem is that every time Apple update the OS they futz with the Apache config, so I have to work out how to get it going again. Then I have to update `DokuWiki` itself, as I don't do that nearly as often as I should. Etc, etc.\n\nHowever, it struck me that I don't really need a wiki as such---all I really need for my purposes are inter-page links (within pages in the same folder, usually) and the ability to tag pages and then get lists of pages that match a given set of tags. (This is basically DokuWiki's double bracket syntax for links to another page -- `[[A Page Title]] ` -- and its [tag](https://www.dokuwiki.org/plugin:tag) plugin.) I don't actually need the \"wiki\" bit, as I can easily edit the files locally and compile/deploy as needed. I've also got used to using Markdown rather than DokuWiki's markup (although there is a Markdown plugin for that but it's not Pandoc Markdown, which I prefer... and so on and so on).\n\nSo this project hosts a Python script (`mokuwiki.py`) that takes a source folder of Markdown documents and processes them according to a number of directives, putting the results in a target folder. The files in this target folder can then processed by a Markdown engine (such as [Pandoc](https://pandoc.org)) as usual. For my 'wikis' I usually use the 'single file' mode and Pandoc's standalone option on each file to produce the individual HTML pages (so in that respect it's a bit like part of a static site generator), but you can also run MokuWiki on a single file to take advantage of useful directives like file includes or comments.\n\n> NOTE: Originally I referred to this project as \"fake wiki\" which led to \"mock wiki\", and in a fit of alliterative humour I changed the project to \"mokuwiki\" in homage to *DokuWiki*. This should not be construed as \"mocking\" *DokuWiki*---far from it! *DokuWiki* is a great piece of software---if you need a proper wiki use that, don't use this!\n\n# How it works\n\nMokuWiki makes two key assumptions about the files that it processes:\n\n1.   YAML metadata elements in each source file control how it is processed. Most importantly this includes the name of the resulting file in the target folder (the 'title' element, see below). \n2.  Directives are processed once to yield Markdown files that will then bprocessed by some other application (the assumption is Pandoc, or something that understands Pandoc flavoured Markdown as that is what MokuWiki emits).\n\n## Metadata\n\nAll YAML metadata elements are passed through to the output files in the target folder unchanged. However, the presence of the following metadata will have the indicated result:\n\n*   *title*: The page's title is used to link to it using a 'page link' directive in another page (see below). It is also used to create the file name for that page in the target folder (see [Filename conversion] below). Titles must be unique within the source folder. \n\n*   *alias*: Aliases are also used to link to a page as an alternative to using a page's title. This can be useful if the actual title that is to be displayed (the \"formal\" title, if you will) is long but has a common shorter form. Aliases must be unique and not the same as any title.\n\n*   *tags*: A YAML sequence of strings that represent what the page is about, e.g. '[vehicle, equipment]'\n\nFor example, if this is the contents of `file1.md`:\n\n```\n---\ntitle: Page One\nalias: 1st Page\nauthor: Phil\ntags: [abc]\n...\n\nA link to [[Page Two]]\n\n```\n\nand this is `file2.md`\n\n```\n---\ntitle: Page Two\nauthor: Phil\ntags: [abc]\n...\n\nA link to [[Page One]]\n\nA link to [[1st Page]]\n\n```\n\nthen MokuWiki will create two files in the target folder. Based on their titles these will be `page_one.md` and `page_two.md` in the target folder. The page link directives (the double square brackets) will become, in `page_two.md` for example:\n\n```\n---\ntitle: Page Two\nauthor: Phil\ntags: [abc]\n...\n\nA link to [Page One](page_one.html)\n\nA link to [1st Page](page_one.html)\n\n```\n\n> NOTE: The YAML metadata block must start with three dashes and end with three periods. \n\n## Directives\n\nThe following directives are supported within a page. These generally take the form of double characters (often brackets) that should be unrecognised by a Markdown processor. \n\n### Page links\n\nAs described above links between pages are specified using double square brackets, so `[[Page One]]` is converted to a standard Markdown link to the HTML version of the page with that title: `[Page One](page_one.html)`. If a page has an alias then that can be used instead of the title, although the link name is still based on the title: `[[1st Page]]` becomes `[1st Page](page_one.html)`. \n\nYou can also define a \"display\" name using the syntax `[[Display Name|Page One]]`. This will become `[Display Name](page_one.html)` in the target file. Note that unlike the similar DokuWiki syntax you cannot specify an actual filename here: that is always determined by the 'title' metadata. \n\nNote that MokuWiki assumes that the eventual output will be HTML, so all of the links end in \".html\".\n\nIf a page does not have a 'title' field in the metadata block (or no metadata block at all) then processing of that file is skipped. The 'title' also cannot contain parentheses or brackets (basically just alpha-numeric characters and some punctuation)---see the section on [Filename Conversion] below.\n\nPage link directives that link to a non-existent page are transformed into bracketed spans with the 'broken' class. That is, `[[No Such Page]]` will be converted to `[No Such Page]{.broken}`. Use the `--broken` command line option to change the class name used for broken links. Use the `--report` command line option to list all broken links (i.e. missing pages) on standard out once processing is complete.\n\n#### Namespaces \n\nPage names can contain references to namespaces, again based on the MoukWiki model, e.g. `[[ns1:Page One]]`. Namespaces are assumed to refer to folders and so cannot contain spaces. How these are incorporated into the resulting link depends on whether the `--fullns` command line option is set:\n\n1.  When not set (the default) it assumes that the source folder is the main folder, with a single level of child folders, e.g. \"source/ns1\", \"source/n2\" and so on. A page link with a namespace reference in a page in the folder \"source/ns1\" is assumed to point to a page in a sibling folder. Therefore a page link directive like `[[ns2:Page Two]]` in a document in \"source/ns1\" will convert to `[Page Two](../ns2/page_two.html)`.\n\n2.  When `--fullns` is set it will treat a namespace as a full path of folders. The author is then responsible for specifying the correct relative path, e.g. `[[..:..:ns2:ns3:Some Page]]` will become `[Some Page](../../ns2/n3/some_page.html)`.\n\n> NOTE: MokuWiki does **not** recursively process folders and keep track of namespaces. This functionality merely makes it easier to create links between pages in different folders. Note also that this functionality may change in future versions...\n\n### Tag links\n\nTags that have been can be referenced in a page using the following syntax: `{{tag1}}`. This will produce a list of page links that have the \"tag1\" tag. So, for example, a source fragment:\n\n```\nPages containing tag 'abc':\n\n{{abc}}\n```\n\nmight produce:\n\n```\nPages containing tags 'abc':\n\n[Page One](page_one.html)\n\n[Page Two](page_two.html)\n```\n\nTag names cannot contain brackets or punctuation. When being defined in the YAML block tag names can contain spaces, e.g. `tags: [Wordy Tag, Other Tag]`. However, when referencing tags with spaces you must use an underscore instead of a space, e.g. `{{Wordy_Tag +other_tag}}`. Tag names are case-insensitive.\n\nTags can be combined using various operators:\n\n1.  `{{tag1 tag2}}` includes pages with 'tag1' *or* 'tag2'\n2.  `{{tag1 +tag2}}` includes pages with 'tag1' *and* 'tag2'\n3.  `{{tag1 -tag2}}` includes pages with 'tag1' that do *not* have 'tag2'\n4.  `{{*}}` includes *all* pages in the wiki that have any tag. Note that pages do not have to have a `tags` fields.\n5.  `{{#}}` represents the number of pages that have any tag\n6.  `{{#tag1}}` represents the number of pages that have the tag 'tag1'\n7.  `{{@}}` will return a list of all tags defined in the source folder as a series of bracketed spans with the class name 'tag'. This can be used to style tag lists. The class name can be changed using the `--tag` command line option.\n\n### Include directives\n\nInclude one file in another using the following markup: `<<include_me.md>>`. Any YAML data blocks will be removed from the included file before inclusion. This pattern actually supports globbing, so you can do `<<include_X*Y.dat>>` and so on. The path is assumed to be relative to the directory that the module was invoked from.\n\nBlank lines will be inserted between the contents of each file, and separators can be inserted between each one by using the syntax `<<include_X*Y.dat|* * *>>`. (The default is no separator, but \"* * *\" is a useful one as it becomes a horizontal rule when processed by `pandoc`. )\n\nA prefix can also be inserted in front of each *line* of the included files by specifying it as a third 'argument'. For example, `<<include_X*Y.dat|* * *|> >>` will insert `> ` in front of each line, including the content of the file as a block quote. To do so without a separator between files just leave that argument empty: `<<include_X*Y.dat||> >>`.\n\n### Image links\n\nThe image link directive provides an easier way to link to images: the syntax `!!A Nice Image!!` will be converted to `![A Nice Image](images/a_nice_image.jpg)`. Some points to note include:\n\n1.  The name of the link ('A Nice Image' in the example) is also the name of the image's caption.\n2.  The default assumes that all images are in an `images` folder which is a child of the folder the referencing file is in. The folder name can be changed with the `--media` command line option. \n3.  The default file format assumed is JPEG, therefore the extension is '.jpg'. This can be changed using the following syntax: `!!Another Picture|png!!`.\n4.  MoukWiki will not check for the existence of the 'image' folder or move any images into the target folder.\n\n### Exec directives\n\nThe 'exec' directive allows the output of a command can be inserted into the document using the following syntax: `%% ls -l test/*.dat %%`. The command must be in the user's PATH and any file specifications that the directive is to glob must be the last element of the command line (as shown here). Multiple, semi-colon separated commands are supported.\n\n1.  This directive uses the [subprocess.run()](https://docs.python.org/3/library/subprocess.html#subprocess.run) function. Therefore [standard security considerations](https://docs.python.org/3.6/library/subprocess.html#security-considerations) should be borne in mind when using this feature.\n2.  This feature has not been checked on Windows machines, but should work if executed in the appropriate shell (e.g. Git Bash).\n3.  The output of the command should be text suitable for a Markdown file.\n\n### Comment directives\n\nSingle line comments can be included in a source file: any characters on the line that occur after a double slash (`//`) will be removed. There are no block comments. \n\n## Other features\n\n### Single file mode\n\nSingle file mode can be enabled with the `--single` option. Only a single input file is expected and the output file given on the command line is used 'as-is' for the output (i.e. is assumed to be the intended output file name). This is not very useful for page links and tags but can be very handy for using the 'include' and 'exec' directives in the specified input file. The [search index] option is disabled in single file mode.\n\n### Search index\n\nThe optional command line option `--index` will cause MokuWiki to output a JSON file (called '_index.json') which contains an inverted index of terms contained in each page against page titles and file names. This can be used to create a simplistic search function in the \"wiki\". This is in JSON format:\n\n```\n{\n    \"page\": [\n        [\"page_one\", \"Page One\"],\n        [\"page_two\", \"Page Two\"]\n    ],\n    \"abc\": [\n        [\"page_one\", \"Page One\"],\n        [\"page_two\", \"Page Two\"]\n    ],\n    \"one\": [\n        [\"page_one\", \"Page One\"]\n    ],\n    \"two\": [\n        [\"page_two\", \"Page Two\"]\n    ]\n}\n```\n\nTo include this directly in an HTML page using a `<script>` statement it is often convenient to have this declared as a variable. Use the `--prefix` option to prefix the JSON with a string. For example, the author uses `--prefix='var MW = MW || {}; MW.searchIndex = '` on one of his projects for this purpose.\n\n### Search index fields\n\nBy default the following YAML metadata fields are parsed to create the search index: 'title', 'alias', 'summary', 'tags' and 'keywords'. A source file that has a metadata field of 'noindex' set to 'true' will *not* be indexed. Use the `--fields` option to specify a different list, e.g. `--fields='title,author'`.\n\nThe contents of files (i.e. the body text, after the metadata) can be indexed by using a \"pseudo-field\" called `_body_`. All punctuation etc. is removed from the indexed terms. \n\n### Noise words\n\nA small list of 'noise words' is included in MokuWiki by default. These are not indexed if they occur in any of the chosen metadata fields. The list can be changed using the `--noise` option to supply a plain text file of words, with one word on each line. For example, `--noise=bad_words.txt`.\n\n### Filename conversion\n\nTarget file names are created from the 'title' field as follows: leading and following spaces are stripped, remaining spaces are replaced with underscores and the whole string is made lower case. Unicode characters are also removed.\n\n# Installation\n\nAs MokuWiki is available on [PyPi](https://pypi.org) installation should be as simple as:\n\n```\n$ pip install mokuwiki\n```\n\n`mokuwiki` is dependent on [PyYAML](https://pyyaml.org). Some of the unit tests are dependent on [DeepDiff](https://github.com/seperman/deepdiff). \n\n# Usage\n\nOnce installed `mokuwiki` should be available as a command line script:\n\n```\n$ mokuwiki source-dir target-dir\n```\n\nor it can be run as a standard Python module:\n\n```\n$ python -m mokuwiki source-dir target-dir\n```\n\nRun in a Python interpreter using the \"mokuwiki()\" function:\n\n```\n$ python\n>>> import mokuwiki\n>>> mokuwiki.mokuwiki(source_dir, target_dir)\n```\n\nRun `mokuwiki --help` for all options.\n\n\n# Caveats\n\n1.  You cannot have two pages with the same title/alias (which actually kind of makes sense, for a wiki).\n2.  `mokuwiki` only converts the directive markup into the equivalent Markdown---adding any other features to the resultant HTML will have to be done by say, a `pandoc` template or similar mechanism. Regular Markdown syntax should be preserved.\n3.  This is started as one of my first Python projects, so it's mostly been cobbled together from Stack Overflow answers, mostly. It also designed mainly for my specific needs although I have tried to generalise it where I could. It seems to work alright but I wouldn't use it in production without some careful thought...\n\n# To Do\n\n1.  Better error handling.\n2.  More efficient file I/O. Currently each file is read once to create an index, then they are all read again so that the tag links can be resolved. There may be a more efficient way to do this using a database, or some other new-fangled doohickey, but in tests the time taken for the script to run is negligible compared to the \"conversion to HTML\" step.\n3.  Replace the current namespace mechanism with something modelled on *DokuWiki*'s.\n4.  Replace the complex logic that handles special tag characters (e.g. \"{{@}}\") with something more elegant.\n\n\n# Development notes\n\n## Unit testing\n\nA number of unit tests are included in the `tests` folder and can be run using the [pytest](https://pypi.org/project/pytest/) application.\n\n## Packaging a distribution\n\nWhen ready for a release use the [bumpversion](https://pypi.org/project/bumpversion/) application to update the version number, e.g.\n\n```\n$ bumpversion major --tag\n```\n\nThis will update the source file and the setup configuration. Then build the distribution:\n\n```\n$ python setup.py bdist_wheel\n```\n\n## Testing installation\n\nTesting that the distribution installs correctly can be accomplished using Docker. Use the following command (which will download the \"python\" Docker image if necessary, so it might take a couple of minutes when first run):\n\n```\n$ docker run -it --rm -v \"$PWD\":/mnt python bash\n```\n\nThis will start the \"python\" Docker image and execute a command prompt. From here install the \"mokuwiki\" distribution from the local \"dist\" folder (mounted in the Docker image under \"/mnt\"). Note that you have to install the dependency ([pyyaml](https://pypi.org/project/PyYAML/)) first as \"--no-index\" is specified.\n\n```\nroot@382a37174524:/# pip install pyyaml\nroot@382a37174524:/# pip install mokuwiki --no-index --find-links /mnt/dist\nroot@382a37174524:/# mokuwiki -h\nroot@382a37174524:/# python\n>>> import mokuwiki\n>>> exit()\n```\n\n## Upload to TestPyPi\n\nUpload the distribution to the TestPyPi site:\n\n```\n$ twine upload --repository-url https://test.pypi.org/legacy/ dist/*\n```\n\nThen run the \"python\" Docker image and attempt to install from there:\n\n```\n$ docker run -it -v \"$PWD\":/mnt --entrypoint=bash python\nroot@382a37174524:/# pip install --extra-index-url https://pypi.org --index-url https://test.pypi.org/simple/ mokuwiki\nroot@382a37174524:/# mokuwiki -h\n```\n\n## Upload to PyPi\n\nUpload to the real package index as follows (or specify the latest distribution):\n\n```\n$ twine upload dist/*\n```\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/encodis/mokuwiki", "keywords": "markdown wiki converter", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "mokuwiki", "package_url": "https://pypi.org/project/mokuwiki/", "platform": "", "project_url": "https://pypi.org/project/mokuwiki/", "project_urls": {"Homepage": "https://github.com/encodis/mokuwiki"}, "release_url": "https://pypi.org/project/mokuwiki/1.0.0/", "requires_dist": ["pyyaml (>=5.1)"], "requires_python": "", "summary": "Convert a folder of Markdown documents, replacing inter-page link and tag markup with Markdown links and lists", "version": "1.0.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Introduction</h1>\n<p>For a while I've been running the excellent <a href=\"https://www.dokuwiki.org\" rel=\"nofollow\">DokuWiki</a> on my Mac using OS X's bundled Apache server. The problem is that every time Apple update the OS they futz with the Apache config, so I have to work out how to get it going again. Then I have to update <code>DokuWiki</code> itself, as I don't do that nearly as often as I should. Etc, etc.</p>\n<p>However, it struck me that I don't really need a wiki as such---all I really need for my purposes are inter-page links (within pages in the same folder, usually) and the ability to tag pages and then get lists of pages that match a given set of tags. (This is basically DokuWiki's double bracket syntax for links to another page -- <code>[[A Page Title]]</code> -- and its <a href=\"https://www.dokuwiki.org/plugin:tag\" rel=\"nofollow\">tag</a> plugin.) I don't actually need the \"wiki\" bit, as I can easily edit the files locally and compile/deploy as needed. I've also got used to using Markdown rather than DokuWiki's markup (although there is a Markdown plugin for that but it's not Pandoc Markdown, which I prefer... and so on and so on).</p>\n<p>So this project hosts a Python script (<code>mokuwiki.py</code>) that takes a source folder of Markdown documents and processes them according to a number of directives, putting the results in a target folder. The files in this target folder can then processed by a Markdown engine (such as <a href=\"https://pandoc.org\" rel=\"nofollow\">Pandoc</a>) as usual. For my 'wikis' I usually use the 'single file' mode and Pandoc's standalone option on each file to produce the individual HTML pages (so in that respect it's a bit like part of a static site generator), but you can also run MokuWiki on a single file to take advantage of useful directives like file includes or comments.</p>\n<blockquote>\n<p>NOTE: Originally I referred to this project as \"fake wiki\" which led to \"mock wiki\", and in a fit of alliterative humour I changed the project to \"mokuwiki\" in homage to <em>DokuWiki</em>. This should not be construed as \"mocking\" <em>DokuWiki</em>---far from it! <em>DokuWiki</em> is a great piece of software---if you need a proper wiki use that, don't use this!</p>\n</blockquote>\n<h1>How it works</h1>\n<p>MokuWiki makes two key assumptions about the files that it processes:</p>\n<ol>\n<li>YAML metadata elements in each source file control how it is processed. Most importantly this includes the name of the resulting file in the target folder (the 'title' element, see below).</li>\n<li>Directives are processed once to yield Markdown files that will then bprocessed by some other application (the assumption is Pandoc, or something that understands Pandoc flavoured Markdown as that is what MokuWiki emits).</li>\n</ol>\n<h2>Metadata</h2>\n<p>All YAML metadata elements are passed through to the output files in the target folder unchanged. However, the presence of the following metadata will have the indicated result:</p>\n<ul>\n<li>\n<p><em>title</em>: The page's title is used to link to it using a 'page link' directive in another page (see below). It is also used to create the file name for that page in the target folder (see [Filename conversion] below). Titles must be unique within the source folder.</p>\n</li>\n<li>\n<p><em>alias</em>: Aliases are also used to link to a page as an alternative to using a page's title. This can be useful if the actual title that is to be displayed (the \"formal\" title, if you will) is long but has a common shorter form. Aliases must be unique and not the same as any title.</p>\n</li>\n<li>\n<p><em>tags</em>: A YAML sequence of strings that represent what the page is about, e.g. '[vehicle, equipment]'</p>\n</li>\n</ul>\n<p>For example, if this is the contents of <code>file1.md</code>:</p>\n<pre><code>---\ntitle: Page One\nalias: 1st Page\nauthor: Phil\ntags: [abc]\n...\n\nA link to [[Page Two]]\n\n</code></pre>\n<p>and this is <code>file2.md</code></p>\n<pre><code>---\ntitle: Page Two\nauthor: Phil\ntags: [abc]\n...\n\nA link to [[Page One]]\n\nA link to [[1st Page]]\n\n</code></pre>\n<p>then MokuWiki will create two files in the target folder. Based on their titles these will be <code>page_one.md</code> and <code>page_two.md</code> in the target folder. The page link directives (the double square brackets) will become, in <code>page_two.md</code> for example:</p>\n<pre><code>---\ntitle: Page Two\nauthor: Phil\ntags: [abc]\n...\n\nA link to [Page One](page_one.html)\n\nA link to [1st Page](page_one.html)\n\n</code></pre>\n<blockquote>\n<p>NOTE: The YAML metadata block must start with three dashes and end with three periods.</p>\n</blockquote>\n<h2>Directives</h2>\n<p>The following directives are supported within a page. These generally take the form of double characters (often brackets) that should be unrecognised by a Markdown processor.</p>\n<h3>Page links</h3>\n<p>As described above links between pages are specified using double square brackets, so <code>[[Page One]]</code> is converted to a standard Markdown link to the HTML version of the page with that title: <code>[Page One](page_one.html)</code>. If a page has an alias then that can be used instead of the title, although the link name is still based on the title: <code>[[1st Page]]</code> becomes <code>[1st Page](page_one.html)</code>.</p>\n<p>You can also define a \"display\" name using the syntax <code>[[Display Name|Page One]]</code>. This will become <code>[Display Name](page_one.html)</code> in the target file. Note that unlike the similar DokuWiki syntax you cannot specify an actual filename here: that is always determined by the 'title' metadata.</p>\n<p>Note that MokuWiki assumes that the eventual output will be HTML, so all of the links end in \".html\".</p>\n<p>If a page does not have a 'title' field in the metadata block (or no metadata block at all) then processing of that file is skipped. The 'title' also cannot contain parentheses or brackets (basically just alpha-numeric characters and some punctuation)---see the section on [Filename Conversion] below.</p>\n<p>Page link directives that link to a non-existent page are transformed into bracketed spans with the 'broken' class. That is, <code>[[No Such Page]]</code> will be converted to <code>[No Such Page]{.broken}</code>. Use the <code>--broken</code> command line option to change the class name used for broken links. Use the <code>--report</code> command line option to list all broken links (i.e. missing pages) on standard out once processing is complete.</p>\n<h4>Namespaces</h4>\n<p>Page names can contain references to namespaces, again based on the MoukWiki model, e.g. <code>[[ns1:Page One]]</code>. Namespaces are assumed to refer to folders and so cannot contain spaces. How these are incorporated into the resulting link depends on whether the <code>--fullns</code> command line option is set:</p>\n<ol>\n<li>\n<p>When not set (the default) it assumes that the source folder is the main folder, with a single level of child folders, e.g. \"source/ns1\", \"source/n2\" and so on. A page link with a namespace reference in a page in the folder \"source/ns1\" is assumed to point to a page in a sibling folder. Therefore a page link directive like <code>[[ns2:Page Two]]</code> in a document in \"source/ns1\" will convert to <code>[Page Two](../ns2/page_two.html)</code>.</p>\n</li>\n<li>\n<p>When <code>--fullns</code> is set it will treat a namespace as a full path of folders. The author is then responsible for specifying the correct relative path, e.g. <code>[[..:..:ns2:ns3:Some Page]]</code> will become <code>[Some Page](../../ns2/n3/some_page.html)</code>.</p>\n</li>\n</ol>\n<blockquote>\n<p>NOTE: MokuWiki does <strong>not</strong> recursively process folders and keep track of namespaces. This functionality merely makes it easier to create links between pages in different folders. Note also that this functionality may change in future versions...</p>\n</blockquote>\n<h3>Tag links</h3>\n<p>Tags that have been can be referenced in a page using the following syntax: <code>{{tag1}}</code>. This will produce a list of page links that have the \"tag1\" tag. So, for example, a source fragment:</p>\n<pre><code>Pages containing tag 'abc':\n\n{{abc}}\n</code></pre>\n<p>might produce:</p>\n<pre><code>Pages containing tags 'abc':\n\n[Page One](page_one.html)\n\n[Page Two](page_two.html)\n</code></pre>\n<p>Tag names cannot contain brackets or punctuation. When being defined in the YAML block tag names can contain spaces, e.g. <code>tags: [Wordy Tag, Other Tag]</code>. However, when referencing tags with spaces you must use an underscore instead of a space, e.g. <code>{{Wordy_Tag +other_tag}}</code>. Tag names are case-insensitive.</p>\n<p>Tags can be combined using various operators:</p>\n<ol>\n<li><code>{{tag1 tag2}}</code> includes pages with 'tag1' <em>or</em> 'tag2'</li>\n<li><code>{{tag1 +tag2}}</code> includes pages with 'tag1' <em>and</em> 'tag2'</li>\n<li><code>{{tag1 -tag2}}</code> includes pages with 'tag1' that do <em>not</em> have 'tag2'</li>\n<li><code>{{*}}</code> includes <em>all</em> pages in the wiki that have any tag. Note that pages do not have to have a <code>tags</code> fields.</li>\n<li><code>{{#}}</code> represents the number of pages that have any tag</li>\n<li><code>{{#tag1}}</code> represents the number of pages that have the tag 'tag1'</li>\n<li><code>{{@}}</code> will return a list of all tags defined in the source folder as a series of bracketed spans with the class name 'tag'. This can be used to style tag lists. The class name can be changed using the <code>--tag</code> command line option.</li>\n</ol>\n<h3>Include directives</h3>\n<p>Include one file in another using the following markup: <code>&lt;&lt;include_me.md&gt;&gt;</code>. Any YAML data blocks will be removed from the included file before inclusion. This pattern actually supports globbing, so you can do <code>&lt;&lt;include_X*Y.dat&gt;&gt;</code> and so on. The path is assumed to be relative to the directory that the module was invoked from.</p>\n<p>Blank lines will be inserted between the contents of each file, and separators can be inserted between each one by using the syntax <code>&lt;&lt;include_X*Y.dat|* * *&gt;&gt;</code>. (The default is no separator, but \"* * *\" is a useful one as it becomes a horizontal rule when processed by <code>pandoc</code>. )</p>\n<p>A prefix can also be inserted in front of each <em>line</em> of the included files by specifying it as a third 'argument'. For example, <code>&lt;&lt;include_X*Y.dat|* * *|&gt; &gt;&gt;</code> will insert <code>&gt;</code> in front of each line, including the content of the file as a block quote. To do so without a separator between files just leave that argument empty: <code>&lt;&lt;include_X*Y.dat||&gt; &gt;&gt;</code>.</p>\n<h3>Image links</h3>\n<p>The image link directive provides an easier way to link to images: the syntax <code>!!A Nice Image!!</code> will be converted to <code>![A Nice Image](images/a_nice_image.jpg)</code>. Some points to note include:</p>\n<ol>\n<li>The name of the link ('A Nice Image' in the example) is also the name of the image's caption.</li>\n<li>The default assumes that all images are in an <code>images</code> folder which is a child of the folder the referencing file is in. The folder name can be changed with the <code>--media</code> command line option.</li>\n<li>The default file format assumed is JPEG, therefore the extension is '.jpg'. This can be changed using the following syntax: <code>!!Another Picture|png!!</code>.</li>\n<li>MoukWiki will not check for the existence of the 'image' folder or move any images into the target folder.</li>\n</ol>\n<h3>Exec directives</h3>\n<p>The 'exec' directive allows the output of a command can be inserted into the document using the following syntax: <code>%% ls -l test/*.dat %%</code>. The command must be in the user's PATH and any file specifications that the directive is to glob must be the last element of the command line (as shown here). Multiple, semi-colon separated commands are supported.</p>\n<ol>\n<li>This directive uses the <a href=\"https://docs.python.org/3/library/subprocess.html#subprocess.run\" rel=\"nofollow\">subprocess.run()</a> function. Therefore <a href=\"https://docs.python.org/3.6/library/subprocess.html#security-considerations\" rel=\"nofollow\">standard security considerations</a> should be borne in mind when using this feature.</li>\n<li>This feature has not been checked on Windows machines, but should work if executed in the appropriate shell (e.g. Git Bash).</li>\n<li>The output of the command should be text suitable for a Markdown file.</li>\n</ol>\n<h3>Comment directives</h3>\n<p>Single line comments can be included in a source file: any characters on the line that occur after a double slash (<code>//</code>) will be removed. There are no block comments.</p>\n<h2>Other features</h2>\n<h3>Single file mode</h3>\n<p>Single file mode can be enabled with the <code>--single</code> option. Only a single input file is expected and the output file given on the command line is used 'as-is' for the output (i.e. is assumed to be the intended output file name). This is not very useful for page links and tags but can be very handy for using the 'include' and 'exec' directives in the specified input file. The [search index] option is disabled in single file mode.</p>\n<h3>Search index</h3>\n<p>The optional command line option <code>--index</code> will cause MokuWiki to output a JSON file (called '_index.json') which contains an inverted index of terms contained in each page against page titles and file names. This can be used to create a simplistic search function in the \"wiki\". This is in JSON format:</p>\n<pre><code>{\n    \"page\": [\n        [\"page_one\", \"Page One\"],\n        [\"page_two\", \"Page Two\"]\n    ],\n    \"abc\": [\n        [\"page_one\", \"Page One\"],\n        [\"page_two\", \"Page Two\"]\n    ],\n    \"one\": [\n        [\"page_one\", \"Page One\"]\n    ],\n    \"two\": [\n        [\"page_two\", \"Page Two\"]\n    ]\n}\n</code></pre>\n<p>To include this directly in an HTML page using a <code>&lt;script&gt;</code> statement it is often convenient to have this declared as a variable. Use the <code>--prefix</code> option to prefix the JSON with a string. For example, the author uses <code>--prefix='var MW = MW || {}; MW.searchIndex = '</code> on one of his projects for this purpose.</p>\n<h3>Search index fields</h3>\n<p>By default the following YAML metadata fields are parsed to create the search index: 'title', 'alias', 'summary', 'tags' and 'keywords'. A source file that has a metadata field of 'noindex' set to 'true' will <em>not</em> be indexed. Use the <code>--fields</code> option to specify a different list, e.g. <code>--fields='title,author'</code>.</p>\n<p>The contents of files (i.e. the body text, after the metadata) can be indexed by using a \"pseudo-field\" called <code>_body_</code>. All punctuation etc. is removed from the indexed terms.</p>\n<h3>Noise words</h3>\n<p>A small list of 'noise words' is included in MokuWiki by default. These are not indexed if they occur in any of the chosen metadata fields. The list can be changed using the <code>--noise</code> option to supply a plain text file of words, with one word on each line. For example, <code>--noise=bad_words.txt</code>.</p>\n<h3>Filename conversion</h3>\n<p>Target file names are created from the 'title' field as follows: leading and following spaces are stripped, remaining spaces are replaced with underscores and the whole string is made lower case. Unicode characters are also removed.</p>\n<h1>Installation</h1>\n<p>As MokuWiki is available on <a href=\"https://pypi.org\" rel=\"nofollow\">PyPi</a> installation should be as simple as:</p>\n<pre><code>$ pip install mokuwiki\n</code></pre>\n<p><code>mokuwiki</code> is dependent on <a href=\"https://pyyaml.org\" rel=\"nofollow\">PyYAML</a>. Some of the unit tests are dependent on <a href=\"https://github.com/seperman/deepdiff\" rel=\"nofollow\">DeepDiff</a>.</p>\n<h1>Usage</h1>\n<p>Once installed <code>mokuwiki</code> should be available as a command line script:</p>\n<pre><code>$ mokuwiki source-dir target-dir\n</code></pre>\n<p>or it can be run as a standard Python module:</p>\n<pre><code>$ python -m mokuwiki source-dir target-dir\n</code></pre>\n<p>Run in a Python interpreter using the \"mokuwiki()\" function:</p>\n<pre><code>$ python\n&gt;&gt;&gt; import mokuwiki\n&gt;&gt;&gt; mokuwiki.mokuwiki(source_dir, target_dir)\n</code></pre>\n<p>Run <code>mokuwiki --help</code> for all options.</p>\n<h1>Caveats</h1>\n<ol>\n<li>You cannot have two pages with the same title/alias (which actually kind of makes sense, for a wiki).</li>\n<li><code>mokuwiki</code> only converts the directive markup into the equivalent Markdown---adding any other features to the resultant HTML will have to be done by say, a <code>pandoc</code> template or similar mechanism. Regular Markdown syntax should be preserved.</li>\n<li>This is started as one of my first Python projects, so it's mostly been cobbled together from Stack Overflow answers, mostly. It also designed mainly for my specific needs although I have tried to generalise it where I could. It seems to work alright but I wouldn't use it in production without some careful thought...</li>\n</ol>\n<h1>To Do</h1>\n<ol>\n<li>Better error handling.</li>\n<li>More efficient file I/O. Currently each file is read once to create an index, then they are all read again so that the tag links can be resolved. There may be a more efficient way to do this using a database, or some other new-fangled doohickey, but in tests the time taken for the script to run is negligible compared to the \"conversion to HTML\" step.</li>\n<li>Replace the current namespace mechanism with something modelled on <em>DokuWiki</em>'s.</li>\n<li>Replace the complex logic that handles special tag characters (e.g. \"{{@}}\") with something more elegant.</li>\n</ol>\n<h1>Development notes</h1>\n<h2>Unit testing</h2>\n<p>A number of unit tests are included in the <code>tests</code> folder and can be run using the <a href=\"https://pypi.org/project/pytest/\" rel=\"nofollow\">pytest</a> application.</p>\n<h2>Packaging a distribution</h2>\n<p>When ready for a release use the <a href=\"https://pypi.org/project/bumpversion/\" rel=\"nofollow\">bumpversion</a> application to update the version number, e.g.</p>\n<pre><code>$ bumpversion major --tag\n</code></pre>\n<p>This will update the source file and the setup configuration. Then build the distribution:</p>\n<pre><code>$ python setup.py bdist_wheel\n</code></pre>\n<h2>Testing installation</h2>\n<p>Testing that the distribution installs correctly can be accomplished using Docker. Use the following command (which will download the \"python\" Docker image if necessary, so it might take a couple of minutes when first run):</p>\n<pre><code>$ docker run -it --rm -v \"$PWD\":/mnt python bash\n</code></pre>\n<p>This will start the \"python\" Docker image and execute a command prompt. From here install the \"mokuwiki\" distribution from the local \"dist\" folder (mounted in the Docker image under \"/mnt\"). Note that you have to install the dependency (<a href=\"https://pypi.org/project/PyYAML/\" rel=\"nofollow\">pyyaml</a>) first as \"--no-index\" is specified.</p>\n<pre><code>root@382a37174524:/# pip install pyyaml\nroot@382a37174524:/# pip install mokuwiki --no-index --find-links /mnt/dist\nroot@382a37174524:/# mokuwiki -h\nroot@382a37174524:/# python\n&gt;&gt;&gt; import mokuwiki\n&gt;&gt;&gt; exit()\n</code></pre>\n<h2>Upload to TestPyPi</h2>\n<p>Upload the distribution to the TestPyPi site:</p>\n<pre><code>$ twine upload --repository-url https://test.pypi.org/legacy/ dist/*\n</code></pre>\n<p>Then run the \"python\" Docker image and attempt to install from there:</p>\n<pre><code>$ docker run -it -v \"$PWD\":/mnt --entrypoint=bash python\nroot@382a37174524:/# pip install --extra-index-url https://pypi.org --index-url https://test.pypi.org/simple/ mokuwiki\nroot@382a37174524:/# mokuwiki -h\n</code></pre>\n<h2>Upload to PyPi</h2>\n<p>Upload to the real package index as follows (or specify the latest distribution):</p>\n<pre><code>$ twine upload dist/*\n</code></pre>\n\n          </div>"}, "last_serial": 5513304, "releases": {"1.0.0": [{"comment_text": "", "digests": {"md5": "ffefa113c606460956c4ec933cde30bb", "sha256": "b8f0fc46b78bbbb3705b5e067a7987330a018ddf0b3882f30454cb7a86c2a2b4"}, "downloads": -1, "filename": "mokuwiki-1.0.0-py3-none-any.whl", "has_sig": false, "md5_digest": "ffefa113c606460956c4ec933cde30bb", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 15620, "upload_time": "2019-07-10T17:58:33", "upload_time_iso_8601": "2019-07-10T17:58:33.613211Z", "url": "https://files.pythonhosted.org/packages/46/24/2a427609c7674b5a261beaffa853ce460488639d605c52cd1bd15de84874/mokuwiki-1.0.0-py3-none-any.whl", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "ffefa113c606460956c4ec933cde30bb", "sha256": "b8f0fc46b78bbbb3705b5e067a7987330a018ddf0b3882f30454cb7a86c2a2b4"}, "downloads": -1, "filename": "mokuwiki-1.0.0-py3-none-any.whl", "has_sig": false, "md5_digest": "ffefa113c606460956c4ec933cde30bb", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 15620, "upload_time": "2019-07-10T17:58:33", "upload_time_iso_8601": "2019-07-10T17:58:33.613211Z", "url": "https://files.pythonhosted.org/packages/46/24/2a427609c7674b5a261beaffa853ce460488639d605c52cd1bd15de84874/mokuwiki-1.0.0-py3-none-any.whl", "yanked": false}], "timestamp": "Fri May  8 00:52:36 2020"}