{"info": {"author": "Conor Mancone", "author_email": "cmancone@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Programming Language :: Python :: 3", "Topic :: Software Development :: Build Tools"], "description": "[![Build Status](https://travis-ci.org/cmancone/mygrations.svg?branch=master)](https://travis-ci.org/cmancone/mygrations)\n\n# mygrations\n\nA general purpose migration tool for managing MySQL updates.  Written in python but intended for use in other systems as well, especially PHP.\n\n## About\n\n`mygrations` manages database migrations with a declarative approach.  Rather than having many migration files, each table in your database has one SQL file which contains a `CREATE TABLE` command that gives the table definition.  This file defines the table structure that you want your table to have (potentially with records as well).  When it comes time to migrate your database, `mygrations` parses the SQL in these files to determine what the structure of your database should be.  It then compares this to the actual table structure in MySQL to determine all of the changes that need to happen to bring the database up to spec.  Finally, it generates any necessary `ALTER TABLE`, `CREATE TABLE`, or `DROP TABLE` commands to update the database.\n\nWhen you need to change a table structure you don't generate additional migration files, but instead simply edit the `CREATE TABLE` command inside the original table definition file.  When migrating multiple tables related via foreign key constraints you simply have to define your foreign keys in the `CREATE TABLE` command normally.  `mygrations` will take note of the foreign keys and and automatically calculate and resolve dependencies while migrating.\n\n## Installation\n\n1. Requires Python3\n2. Requires [MySQLdb For python3](https://pypi.python.org/pypi/mysqlclient).  (For ubuntu: `sudo apt-get install python3-mysqldb`)\n\nTo install `mygrations`:\n\n```pip install mygrations```\n\nThen you just need to download and install the mygrations runner.  Something like this works:\n\n```bash\nwget 'https://raw.githubusercontent.com/cmancone/mygrations/master/mygrate.py'\nchmod a+x mygrate.py\nsudo mv mygrate.py /usr/local/bin/mygrate.py\n```\n\nYour mileage may vary.\n\n## Setup\n\nThe calling sequence of the mygration runner is not yet very flexible, requiring you to have your environment setup in a particular way.  Right now it assumes:\n\n1. Your application already has a `.env` file somewhere, containing database credentials\n2. You place a `mygrate.conf` file in the same directory as the `.env` file\n3. You have a folder (somewhere) in your application that has all your `*.sql` files: ideally one for every table in your system\n\nWhen you run `mygrate.py` it will read the `mygrate.conf` file in your current directory.  It will also read the contents of your `.env` file, where it expects to find key-value pairs, in particular the connection details to your `MySQL` database.  It is as flexible as possible when reading the syntax of the `.env` file, with the goal that you should not have to make any adjustments to it in order to support `mygrate.py`.  Two pieces of information are pulled out of the `mygrate.conf` file: where to find your database credentials in the `.env` file, and where to find the `*.sql` files that it will be migrating your database to match.\n\n```\n/var/www/example.com/.env\n/var/www/example.com/mygrate.conf\n/var/www/example.com/public/\n/var/www/example.com/database/*.sql\n```\n\nYour `.env` file presumably already exists for your application to use, and may look like this:\n\n```\nDB_HOSTNAME     = \"localhost\"\nDB_USERNAME     = \"app\"\nDB_PASSWORD     = \"[Your password here]\"\nDB_DATABASE     = \"app\"\n\nANOTHER_CONFIG  = \"SomeValue\"\n```\n\nYour `mygrate.conf` file would then look like this:\n\n```\nhostname_key    = \"DB_HOSTNAME\"\nusername_key    = \"DB_USERNAME\"\npassword_key    = \"DB_PASSWORD\"\ndatabase_key    = \"DB_DATABASE\"\n\nfiles_directory = \"database/\"\n```\n\nTo be clear, you don't put your database credentials in your `mygrate.conf` file: instead you simply tell it which keys to grab the database credentials out of from your `.env` file.  This way you can just have one `mygrate.conf` file that works in all environments.  The files directory tells it where to find your `*.sql` files.  You simply specify the location of the directory containing those files, relative to the `mygrate.conf` file.  It will automatically read any `*.sql` files in that directory and use the structure in those files to determine the \"truth\" of what your database should look like.\n\n## Usage\n\nCurrently the system supports 3 modes:\n\n| Mode              | Action                                                                                       |\n| ----------------- | -------------------------------------------------------------------------------------------- |\n| version (default) | Display the version and license information and exit                                         |\n| apply             | Update the database!                                                                         |\n| check             | Read all `*.sql` file and report any SQL errors or MySQL 1215 errors                         |\n| plan              | Dump a list of MySQL commands that will bring the database up-to-spec with the `*.sql` files |\n| plan_export       | Dump a list of data showing how to update the `*.sql` files to match the database            |\n\nEach should be executed by running the mygration command with the desired mode as the first parameter, in the same directory as your `mygrate.conf` file:\n\n```mygrate.py [mode]```\n\nThe typical use case would be to run `mygrate.py plan` and inspect the results.  If things seem reasonable then simply  `mygrate.py execute`\n\n## Advantages\n\nThere are plenty of migration tools out there, and many frameworks come with their own.  So why would I write another, and why would anyone setup a new tool if one comes out-of-the-box with their framework of choice?  Because the declarative approach taken by `mygrations` has a number of concrete advantages.\n\n**1. Database structure trackable by version control**\n\nIn `mygrations` each database is defined by a single `CREATE TABLE` command living in one file.  Adjusting a table's structure means adjusting the `CREATE TABLE` command in the table's definition file.  As a result, if two developers attempt to change the same table in conflicting ways, the conflict will be picked up immediately at merge time by your version control system.  Because normal migration systems put each database change in its own file version control cannot pick up any conflicts.  Instead, conflicting table definitions are not found until after a merge when the next migration is run and an SQL error is generated.  This way, potential conflicts are found much sooner.\n\n**2. MySQL Linting**\n\nUnlike normal migration systems which simply apply developer-provided transformations to update your tables, `mygrations` is an intelligent tool that understands the actual structure you are trying to create.  As a result it is possible to perform checks to find easy-to-miss syntax errors, as well as enforce project standards.  There are many possibilities:\n\n1. Generate warnings about syntax errors in your SQL files\n2. Enforce system-wide naming conventions on column names\n3. Verify that all foreign key columns actually have foreign key constraints\n4. Set rules to determine what column types should/should not be used\n5. ... more when I think of it\n\nMainly though, my intention is to make a linting system that is fully configurable by the end user.\n\n**3. Better foreign key errors**\n\nDoes this look familiar?\n\n```ERROR 1215 (HY000): Cannot add foreign key constraint```\n\nI've seen developers at all skill levels waste many hours while creating foreign key constraints due to the above error from MySQL, which gives absolutely no hints as to what the problem actually is.  Because `mygrations` understands what the database is supposed to look like, it can detect the actual conditions that cause this error and provide a specific and actionable error message to the developer.\n\n**4. Migration plans**\n\nAgain, because `mygrations` operates with knowledge of both the current database and the target database, it can present an actual migration plan before making any changes.  This makes it easy for the developer to have one last spot check before making changes, if desired.\n\n**5. One table, one file**\n\nStandard migration systems dedicate a file to each change of a database table.  As a result, it is very difficult to figure out what the database structure *should* be simply by looking at the contents of the migration directory.  Having one table per file makes it easy to spot check your migrations and make sure nothing has been missed.\n\n**6. No Migration table**\n\nSince `mygrations` works directly with the database structure it doesn't need to keep a history of which migrations it has run.  Instead, it brings your database up-to-spec no matter what state it is in: no more hassle if your migration table somehow gets out of sync with your migration files.\n\n**7. Automatic migration builder**\n\nSince the migration files are just simple `CREATE TABLE` commands, `mygrations` can create the migration files for you from your database.  Although you probably won't have to do that very often because the migrations files are very easy to build anyway.  A simple `SHOW CREATE TABLE` command from MySQL is all you need.\n\n## Roadmap to 1.0\n\nThis is a brand new venture that is a long way from complete.  To give some guidance, here is my target feature list for when version 1.0 will officially be released:\n\n1. Parsing of `CREATE TABLE` and `INSERT` commands and using those as migration definitions (Done)\n2. Automatic foreign key dependency calculation (Sidelined)\n3. Detailed foreign key error notices (Done)\n4. Ability to migrate database to match definitions from any state (Done)\n5. Generation of migration commands (Done)\n6. Generation of migration files (Done)\n\nCurrently the system has reached a complete enough state that it is being tested in our real-world systems.", "description_content_type": "text/markdown", "docs_url": null, "download_url": "https://github.com/cmancone/mygrations/archive/v0.13.tar.gz", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/cmancone/mygrations", "keywords": "setuptools development migrations mysql", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "mygrations", "package_url": "https://pypi.org/project/mygrations/", "platform": "", "project_url": "https://pypi.org/project/mygrations/", "project_urls": {"Download": "https://github.com/cmancone/mygrations/archive/v0.13.tar.gz", "Homepage": "https://github.com/cmancone/mygrations"}, "release_url": "https://pypi.org/project/mygrations/0.13.0/", "requires_dist": null, "requires_python": "", "summary": "A general purpose migration tool for managing MySQL updates", "version": "0.13.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><a href=\"https://travis-ci.org/cmancone/mygrations\" rel=\"nofollow\"><img alt=\"Build Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/81c8fbfbfd6dfb8fc7210612e298e644c585a257/68747470733a2f2f7472617669732d63692e6f72672f636d616e636f6e652f6d7967726174696f6e732e7376673f6272616e63683d6d6173746572\"></a></p>\n<h1>mygrations</h1>\n<p>A general purpose migration tool for managing MySQL updates.  Written in python but intended for use in other systems as well, especially PHP.</p>\n<h2>About</h2>\n<p><code>mygrations</code> manages database migrations with a declarative approach.  Rather than having many migration files, each table in your database has one SQL file which contains a <code>CREATE TABLE</code> command that gives the table definition.  This file defines the table structure that you want your table to have (potentially with records as well).  When it comes time to migrate your database, <code>mygrations</code> parses the SQL in these files to determine what the structure of your database should be.  It then compares this to the actual table structure in MySQL to determine all of the changes that need to happen to bring the database up to spec.  Finally, it generates any necessary <code>ALTER TABLE</code>, <code>CREATE TABLE</code>, or <code>DROP TABLE</code> commands to update the database.</p>\n<p>When you need to change a table structure you don't generate additional migration files, but instead simply edit the <code>CREATE TABLE</code> command inside the original table definition file.  When migrating multiple tables related via foreign key constraints you simply have to define your foreign keys in the <code>CREATE TABLE</code> command normally.  <code>mygrations</code> will take note of the foreign keys and and automatically calculate and resolve dependencies while migrating.</p>\n<h2>Installation</h2>\n<ol>\n<li>Requires Python3</li>\n<li>Requires <a href=\"https://pypi.python.org/pypi/mysqlclient\" rel=\"nofollow\">MySQLdb For python3</a>.  (For ubuntu: <code>sudo apt-get install python3-mysqldb</code>)</li>\n</ol>\n<p>To install <code>mygrations</code>:</p>\n<p><code>pip install mygrations</code></p>\n<p>Then you just need to download and install the mygrations runner.  Something like this works:</p>\n<pre>wget <span class=\"s1\">'https://raw.githubusercontent.com/cmancone/mygrations/master/mygrate.py'</span>\nchmod a+x mygrate.py\nsudo mv mygrate.py /usr/local/bin/mygrate.py\n</pre>\n<p>Your mileage may vary.</p>\n<h2>Setup</h2>\n<p>The calling sequence of the mygration runner is not yet very flexible, requiring you to have your environment setup in a particular way.  Right now it assumes:</p>\n<ol>\n<li>Your application already has a <code>.env</code> file somewhere, containing database credentials</li>\n<li>You place a <code>mygrate.conf</code> file in the same directory as the <code>.env</code> file</li>\n<li>You have a folder (somewhere) in your application that has all your <code>*.sql</code> files: ideally one for every table in your system</li>\n</ol>\n<p>When you run <code>mygrate.py</code> it will read the <code>mygrate.conf</code> file in your current directory.  It will also read the contents of your <code>.env</code> file, where it expects to find key-value pairs, in particular the connection details to your <code>MySQL</code> database.  It is as flexible as possible when reading the syntax of the <code>.env</code> file, with the goal that you should not have to make any adjustments to it in order to support <code>mygrate.py</code>.  Two pieces of information are pulled out of the <code>mygrate.conf</code> file: where to find your database credentials in the <code>.env</code> file, and where to find the <code>*.sql</code> files that it will be migrating your database to match.</p>\n<pre><code>/var/www/example.com/.env\n/var/www/example.com/mygrate.conf\n/var/www/example.com/public/\n/var/www/example.com/database/*.sql\n</code></pre>\n<p>Your <code>.env</code> file presumably already exists for your application to use, and may look like this:</p>\n<pre><code>DB_HOSTNAME     = \"localhost\"\nDB_USERNAME     = \"app\"\nDB_PASSWORD     = \"[Your password here]\"\nDB_DATABASE     = \"app\"\n\nANOTHER_CONFIG  = \"SomeValue\"\n</code></pre>\n<p>Your <code>mygrate.conf</code> file would then look like this:</p>\n<pre><code>hostname_key    = \"DB_HOSTNAME\"\nusername_key    = \"DB_USERNAME\"\npassword_key    = \"DB_PASSWORD\"\ndatabase_key    = \"DB_DATABASE\"\n\nfiles_directory = \"database/\"\n</code></pre>\n<p>To be clear, you don't put your database credentials in your <code>mygrate.conf</code> file: instead you simply tell it which keys to grab the database credentials out of from your <code>.env</code> file.  This way you can just have one <code>mygrate.conf</code> file that works in all environments.  The files directory tells it where to find your <code>*.sql</code> files.  You simply specify the location of the directory containing those files, relative to the <code>mygrate.conf</code> file.  It will automatically read any <code>*.sql</code> files in that directory and use the structure in those files to determine the \"truth\" of what your database should look like.</p>\n<h2>Usage</h2>\n<p>Currently the system supports 3 modes:</p>\n<table>\n<thead>\n<tr>\n<th>Mode</th>\n<th>Action</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>version (default)</td>\n<td>Display the version and license information and exit</td>\n</tr>\n<tr>\n<td>apply</td>\n<td>Update the database!</td>\n</tr>\n<tr>\n<td>check</td>\n<td>Read all <code>*.sql</code> file and report any SQL errors or MySQL 1215 errors</td>\n</tr>\n<tr>\n<td>plan</td>\n<td>Dump a list of MySQL commands that will bring the database up-to-spec with the <code>*.sql</code> files</td>\n</tr>\n<tr>\n<td>plan_export</td>\n<td>Dump a list of data showing how to update the <code>*.sql</code> files to match the database</td>\n</tr></tbody></table>\n<p>Each should be executed by running the mygration command with the desired mode as the first parameter, in the same directory as your <code>mygrate.conf</code> file:</p>\n<p><code>mygrate.py [mode]</code></p>\n<p>The typical use case would be to run <code>mygrate.py plan</code> and inspect the results.  If things seem reasonable then simply  <code>mygrate.py execute</code></p>\n<h2>Advantages</h2>\n<p>There are plenty of migration tools out there, and many frameworks come with their own.  So why would I write another, and why would anyone setup a new tool if one comes out-of-the-box with their framework of choice?  Because the declarative approach taken by <code>mygrations</code> has a number of concrete advantages.</p>\n<p><strong>1. Database structure trackable by version control</strong></p>\n<p>In <code>mygrations</code> each database is defined by a single <code>CREATE TABLE</code> command living in one file.  Adjusting a table's structure means adjusting the <code>CREATE TABLE</code> command in the table's definition file.  As a result, if two developers attempt to change the same table in conflicting ways, the conflict will be picked up immediately at merge time by your version control system.  Because normal migration systems put each database change in its own file version control cannot pick up any conflicts.  Instead, conflicting table definitions are not found until after a merge when the next migration is run and an SQL error is generated.  This way, potential conflicts are found much sooner.</p>\n<p><strong>2. MySQL Linting</strong></p>\n<p>Unlike normal migration systems which simply apply developer-provided transformations to update your tables, <code>mygrations</code> is an intelligent tool that understands the actual structure you are trying to create.  As a result it is possible to perform checks to find easy-to-miss syntax errors, as well as enforce project standards.  There are many possibilities:</p>\n<ol>\n<li>Generate warnings about syntax errors in your SQL files</li>\n<li>Enforce system-wide naming conventions on column names</li>\n<li>Verify that all foreign key columns actually have foreign key constraints</li>\n<li>Set rules to determine what column types should/should not be used</li>\n<li>... more when I think of it</li>\n</ol>\n<p>Mainly though, my intention is to make a linting system that is fully configurable by the end user.</p>\n<p><strong>3. Better foreign key errors</strong></p>\n<p>Does this look familiar?</p>\n<p><code>ERROR 1215 (HY000): Cannot add foreign key constraint</code></p>\n<p>I've seen developers at all skill levels waste many hours while creating foreign key constraints due to the above error from MySQL, which gives absolutely no hints as to what the problem actually is.  Because <code>mygrations</code> understands what the database is supposed to look like, it can detect the actual conditions that cause this error and provide a specific and actionable error message to the developer.</p>\n<p><strong>4. Migration plans</strong></p>\n<p>Again, because <code>mygrations</code> operates with knowledge of both the current database and the target database, it can present an actual migration plan before making any changes.  This makes it easy for the developer to have one last spot check before making changes, if desired.</p>\n<p><strong>5. One table, one file</strong></p>\n<p>Standard migration systems dedicate a file to each change of a database table.  As a result, it is very difficult to figure out what the database structure <em>should</em> be simply by looking at the contents of the migration directory.  Having one table per file makes it easy to spot check your migrations and make sure nothing has been missed.</p>\n<p><strong>6. No Migration table</strong></p>\n<p>Since <code>mygrations</code> works directly with the database structure it doesn't need to keep a history of which migrations it has run.  Instead, it brings your database up-to-spec no matter what state it is in: no more hassle if your migration table somehow gets out of sync with your migration files.</p>\n<p><strong>7. Automatic migration builder</strong></p>\n<p>Since the migration files are just simple <code>CREATE TABLE</code> commands, <code>mygrations</code> can create the migration files for you from your database.  Although you probably won't have to do that very often because the migrations files are very easy to build anyway.  A simple <code>SHOW CREATE TABLE</code> command from MySQL is all you need.</p>\n<h2>Roadmap to 1.0</h2>\n<p>This is a brand new venture that is a long way from complete.  To give some guidance, here is my target feature list for when version 1.0 will officially be released:</p>\n<ol>\n<li>Parsing of <code>CREATE TABLE</code> and <code>INSERT</code> commands and using those as migration definitions (Done)</li>\n<li>Automatic foreign key dependency calculation (Sidelined)</li>\n<li>Detailed foreign key error notices (Done)</li>\n<li>Ability to migrate database to match definitions from any state (Done)</li>\n<li>Generation of migration commands (Done)</li>\n<li>Generation of migration files (Done)</li>\n</ol>\n<p>Currently the system has reached a complete enough state that it is being tested in our real-world systems.</p>\n\n          </div>"}, "last_serial": 6648333, "releases": {"0.10.0": [{"comment_text": "", "digests": {"md5": "cbaeb28e24dd272a35a2395e5da2ee93", "sha256": "a01d972d71425f2d975a61c4db9b861a996f070ce3c51cf1ab9ab13bf40bc305"}, "downloads": -1, "filename": "mygrations-0.10.0.tar.gz", "has_sig": false, "md5_digest": "cbaeb28e24dd272a35a2395e5da2ee93", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 65410, "upload_time": "2017-11-13T15:05:19", "upload_time_iso_8601": "2017-11-13T15:05:19.103597Z", "url": "https://files.pythonhosted.org/packages/04/4a/508ae491749ec8dd5eceea8e905a2de44b02d59287427e895fc198958b51/mygrations-0.10.0.tar.gz", "yanked": false}], "0.11.0": [{"comment_text": "", "digests": {"md5": "bba6b8da7096b196d19cbf9c86cb16ad", "sha256": "7aae4bc8bb42b756e16217647322b8de3e77cbd38f03ad2f0611331238ba7984"}, "downloads": -1, "filename": "mygrations-0.11.0.tar.gz", "has_sig": false, "md5_digest": "bba6b8da7096b196d19cbf9c86cb16ad", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 66694, "upload_time": "2017-11-13T15:22:15", "upload_time_iso_8601": "2017-11-13T15:22:15.732431Z", "url": "https://files.pythonhosted.org/packages/d7/63/7eaa63b783e81d237e9cbd9e9f0a392ff8f6671593f9f8358695a0c5234b/mygrations-0.11.0.tar.gz", "yanked": false}], "0.12.0": [{"comment_text": "", "digests": {"md5": "8baf80d7d1698bd2f1d5b5a62afd130c", "sha256": "3e852f58d74cbde1067c1cb9b2a95649889a09a35e654d467edbf40edfe2029f"}, "downloads": -1, "filename": "mygrations-0.12.0.tar.gz", "has_sig": false, "md5_digest": "8baf80d7d1698bd2f1d5b5a62afd130c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 67604, "upload_time": "2020-02-11T19:45:16", "upload_time_iso_8601": "2020-02-11T19:45:16.010480Z", "url": "https://files.pythonhosted.org/packages/f5/15/05cd1de305ac603f47b1f10973b55b5d917bd22f6ccfecc34c7a1f5cdcd9/mygrations-0.12.0.tar.gz", "yanked": false}], "0.13.0": [{"comment_text": "", "digests": {"md5": "90e99115736d97a829539b39f4df6e5f", "sha256": "3800e1a7e6ec3a4a20d25fb5b0e76287c47c2a26264674e36a63eb5e4101eb56"}, "downloads": -1, "filename": "mygrations-0.13.0.tar.gz", "has_sig": false, "md5_digest": "90e99115736d97a829539b39f4df6e5f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 70833, "upload_time": "2020-02-17T18:53:03", "upload_time_iso_8601": "2020-02-17T18:53:03.907152Z", "url": "https://files.pythonhosted.org/packages/3a/94/4c89d815cea1027e152c5c4c5f89f657e500e58fa35d4ab2bb8b834f6324/mygrations-0.13.0.tar.gz", "yanked": false}], "0.9.1": [{"comment_text": "", "digests": {"md5": "104494fe24d688caf1846e58d2a00b65", "sha256": "d3f9bbff761866de0a0b3db5f41c459930be9c2ccaeb5dd6701ebbfefe528266"}, "downloads": -1, "filename": "mygrations-0.9.1.tar.gz", "has_sig": false, "md5_digest": "104494fe24d688caf1846e58d2a00b65", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 38378, "upload_time": "2017-11-02T18:41:55", "upload_time_iso_8601": "2017-11-02T18:41:55.228074Z", "url": "https://files.pythonhosted.org/packages/cd/e7/bd7a5ae91afdbe9b7d51fc81f5033f6a0965176f5e70a1380ff5821d2efc/mygrations-0.9.1.tar.gz", "yanked": false}], "0.9.2": [{"comment_text": "", "digests": {"md5": "013894e87238dfd47578c6d129e0fe0e", "sha256": "d5632e4b6c3267b72956b560b0e382d0f594390b0305f099bdc0c6ff21929026"}, "downloads": -1, "filename": "mygrations-0.9.2.tar.gz", "has_sig": false, "md5_digest": "013894e87238dfd47578c6d129e0fe0e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 65380, "upload_time": "2017-11-02T19:00:01", "upload_time_iso_8601": "2017-11-02T19:00:01.613366Z", "url": "https://files.pythonhosted.org/packages/5a/db/ed32f90bb0a74247de367e6f60b8aa398413e2fe125b63f08e7a3c4c1ca5/mygrations-0.9.2.tar.gz", "yanked": false}], "0.9.3": [{"comment_text": "", "digests": {"md5": "b5009bbd9b009235ce1a1ebbffd50717", "sha256": "d83cb48b4b0b90541d822f4a40c1f8f99a26c6de462b93481c0da8bf90dd7a67"}, "downloads": -1, "filename": "mygrations-0.9.3.tar.gz", "has_sig": false, "md5_digest": "b5009bbd9b009235ce1a1ebbffd50717", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 65369, "upload_time": "2017-11-02T19:16:15", "upload_time_iso_8601": "2017-11-02T19:16:15.548969Z", "url": "https://files.pythonhosted.org/packages/5c/6f/ed442b018129f288bf2d18d4dc4c4784b423c6bb42059635eaf427e96667/mygrations-0.9.3.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "90e99115736d97a829539b39f4df6e5f", "sha256": "3800e1a7e6ec3a4a20d25fb5b0e76287c47c2a26264674e36a63eb5e4101eb56"}, "downloads": -1, "filename": "mygrations-0.13.0.tar.gz", "has_sig": false, "md5_digest": "90e99115736d97a829539b39f4df6e5f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 70833, "upload_time": "2020-02-17T18:53:03", "upload_time_iso_8601": "2020-02-17T18:53:03.907152Z", "url": "https://files.pythonhosted.org/packages/3a/94/4c89d815cea1027e152c5c4c5f89f657e500e58fa35d4ab2bb8b834f6324/mygrations-0.13.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:49:31 2020"}