{"info": {"author": "Oracle", "author_email": "UNKNOWN", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Environment :: Console", "Environment :: Win32 (MS Windows)", "Intended Audience :: Developers", "License :: OSI Approved :: GNU General Public License (GPL)", "Operating System :: Microsoft :: Windows", "Operating System :: OS Independent", "Operating System :: POSIX", "Programming Language :: Python :: 2.6", "Programming Language :: Python :: 2.7", "Topic :: Utilities"], "description": "MySQL Utilities 1.4 (part of MySQL Workbench Distribution 6.0)\n\nThis is a release of MySQL Utilities (part of MySQL Workbench Distribution),\nthe dual-license, complete database modeling, administration and development\nprogram for MySQL. For the avoidance of doubt, this \nparticular copy of the software is released under the \nversion 2 of the GNU General Public License. MySQL Utilities\nis brought to you by the MySQL team at Oracle.\n\nCopyright (c) 2010, 2014, Oracle and/or its affiliates. All rights reserved.\n\nFor more information MySQL Utilities, visit \n  http://dev.mysql.com/doc/workbench/en/index.html\nFor more downloads and the source of MySQL Utilities, visit\n  http://dev.mysql.com/downloads\n\nLicense information can be found in the LICENSE.txt file.\n\nThis distribution may include materials developed by third\nparties. For license and attribution notices for these\nmaterials, please refer to the documentation that accompanies\nthis distribution. A copy of the license/notices is also \nreproduced below. \n\nGPLv2 Disclaimer\nFor the avoidance of doubt, except that if any license choice\nother than GPL or LGPL is available it will apply instead, \nOracle elects to use only the General Public License version 2 \n(GPLv2) at this time for any software where a choice of GPL \nlicense versions is made available with the language indicating \nthat GPLv2 or any later version may be used, or where a choice \nof which version of the GPL is applied is otherwise unspecified.\n\n********************************************************************\n\nThird-Party Component Notices\n\n*********************************************************************\n\n%%The following software may be included in this product:\nPython\n\nUse of any of this software is governed by the terms of the license below:\n\nPython 2.7 license\n\nThis is the official license for the Python 2.7 release:\n\nA. HISTORY OF THE SOFTWARE\n==========================\n\nPython was created in the early 1990s by Guido van Rossum at Stichting\nMathematisch Centrum (CWI, see http://www.cwi.nl) in the Netherlands\nas a successor of a language called ABC.  Guido remains Python's\nprincipal author, although it includes many contributions from others.\n\nIn 1995, Guido continued his work on Python at the Corporation for\nNational Research Initiatives (CNRI, see http://www.cnri.reston.va.us)\nin Reston, Virginia where he released several versions of the\nsoftware.\n\nIn May 2000, Guido and the Python core development team moved to\nBeOpen.com to form the BeOpen PythonLabs team.  In October of the same\nyear, the PythonLabs team moved to Digital Creations (now Zope\nCorporation, see http://www.zope.com).  In 2001, the Python Software\nFoundation (PSF, see http://www.python.org/psf/) was formed, a\nnon-profit organization created specifically to own Python-related\nIntellectual Property.  Zope Corporation is a sponsoring member of\nthe PSF.\n\nAll Python releases are Open Source (see http://www.opensource.org for\nthe Open Source Definition).  Historically, most, but not all, Python\nreleases have also been GPL-compatible; the table below summarizes\nthe various releases.\n\n    Release         Derived     Year        Owner       GPL-\n                    from                                compatible? (1)\n\n    0.9.0 thru 1.2              1991-1995   CWI         yes\n    1.3 thru 1.5.2  1.2         1995-1999   CNRI        yes\n    1.6             1.5.2       2000        CNRI        no\n    2.0             1.6         2000        BeOpen.com  no\n    1.6.1           1.6         2001        CNRI        yes (2)\n    2.1             2.0+1.6.1   2001        PSF         no\n    2.0.1           2.0+1.6.1   2001        PSF         yes\n    2.1.1           2.1+2.0.1   2001        PSF         yes\n    2.2             2.1.1       2001        PSF         yes\n    2.1.2           2.1.1       2002        PSF         yes\n    2.1.3           2.1.2       2002        PSF         yes\n    2.2.1           2.2         2002        PSF         yes\n    2.2.2           2.2.1       2002        PSF         yes\n    2.2.3           2.2.2       2003        PSF         yes\n    2.3             2.2.2       2002-2003   PSF         yes\n    2.3.1           2.3         2002-2003   PSF         yes\n    2.3.2           2.3.1       2002-2003   PSF         yes\n    2.3.3           2.3.2       2002-2003   PSF         yes\n    2.3.4           2.3.3       2004        PSF         yes\n    2.3.5           2.3.4       2005        PSF         yes\n    2.4             2.3         2004        PSF         yes\n    2.4.1           2.4         2005        PSF         yes\n    2.4.2           2.4.1       2005        PSF         yes\n    2.4.3           2.4.2       2006        PSF         yes\n    2.4.4           2.4.3       2006        PSF         yes\n    2.5             2.4         2006        PSF         yes\n    2.5.1           2.5         2007        PSF         yes\n    2.5.2           2.5.1       2008        PSF         yes\n    2.5.3           2.5.2       2008        PSF         yes\n    2.6             2.5         2008        PSF         yes\n    2.6.1           2.6         2008        PSF         yes\n    2.6.2           2.6.1       2009        PSF         yes\n    2.6.3           2.6.2       2009        PSF         yes\n    2.6.4           2.6.3       2009        PSF         yes\n    2.6.5           2.6.4       2010        PSF         yes\n    2.7             2.6         2010        PSF         yes\n\nFootnotes:\n\n(1) GPL-compatible doesn't mean that we're distributing Python under\n    the GPL.  All Python licenses, unlike the GPL, let you distribute\n    a modified version without making your changes open source.  The\n    GPL-compatible licenses make it possible to combine Python with\n    other software that is released under the GPL; the others don't.\n\n(2) According to Richard Stallman, 1.6.1 is not GPL-compatible,\n    because its license has a choice of law clause.  According to\n    CNRI, however, Stallman's lawyer has told CNRI's lawyer that 1.6.1\n    is \"not incompatible\" with the GPL.\n\nThanks to the many outside volunteers who have worked under Guido's\ndirection to make these releases possible.\n\n\nB. TERMS AND CONDITIONS FOR ACCESSING OR OTHERWISE USING PYTHON\n===============================================================\n\nPYTHON SOFTWARE FOUNDATION LICENSE VERSION 2\n--------------------------------------------\n\n1. This LICENSE AGREEMENT is between the Python Software Foundation\n(\"PSF\"), and the Individual or Organization (\"Licensee\") accessing and\notherwise using this software (\"Python\") in source or binary form and\nits associated documentation.\n\n2. Subject to the terms and conditions of this License Agreement, PSF hereby\ngrants Licensee a nonexclusive, royalty-free, world-wide license to reproduce,\nanalyze, test, perform and/or display publicly, prepare derivative works,\ndistribute, and otherwise use Python alone or in any derivative version,\nprovided, however, that PSF's License Agreement and PSF's notice of copyright,\ni.e., \"Copyright (c) 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010,\n2011, 2012 Python Software Foundation; All Rights Reserved\" are retained in Python\nalone or in any derivative version prepared by Licensee.\n\n3. In the event Licensee prepares a derivative work that is based on\nor incorporates Python or any part thereof, and wants to make\nthe derivative work available to others as provided herein, then\nLicensee hereby agrees to include in any such work a brief summary of\nthe changes made to Python.\n\n4. PSF is making Python available to Licensee on an \"AS IS\"\nbasis.  PSF MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR\nIMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, PSF MAKES NO AND\nDISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS\nFOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON WILL NOT\nINFRINGE ANY THIRD PARTY RIGHTS.\n\n5. PSF SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON\nFOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS\nA RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON,\nOR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.\n\n6. This License Agreement will automatically terminate upon a material\nbreach of its terms and conditions.\n\n7. Nothing in this License Agreement shall be deemed to create any\nrelationship of agency, partnership, or joint venture between PSF and\nLicensee.  This License Agreement does not grant permission to use PSF\ntrademarks or trade name in a trademark sense to endorse or promote\nproducts or services of Licensee, or any third party.\n\n8. By copying, installing or otherwise using Python, Licensee\nagrees to be bound by the terms and conditions of this License\nAgreement.\n\n\nBEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0\n-------------------------------------------\n\nBEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1\n\n1. This LICENSE AGREEMENT is between BeOpen.com (\"BeOpen\"), having an\noffice at 160 Saratoga Avenue, Santa Clara, CA 95051, and the\nIndividual or Organization (\"Licensee\") accessing and otherwise using\nthis software in source or binary form and its associated\ndocumentation (\"the Software\").\n\n2. Subject to the terms and conditions of this BeOpen Python License\nAgreement, BeOpen hereby grants Licensee a non-exclusive,\nroyalty-free, world-wide license to reproduce, analyze, test, perform\nand/or display publicly, prepare derivative works, distribute, and\notherwise use the Software alone or in any derivative version,\nprovided, however, that the BeOpen Python License is retained in the\nSoftware, alone or in any derivative version prepared by Licensee.\n\n3. BeOpen is making the Software available to Licensee on an \"AS IS\"\nbasis.  BEOPEN MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR\nIMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, BEOPEN MAKES NO AND\nDISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS\nFOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE WILL NOT\nINFRINGE ANY THIRD PARTY RIGHTS.\n\n4. BEOPEN SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF THE\nSOFTWARE FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS\nAS A RESULT OF USING, MODIFYING OR DISTRIBUTING THE SOFTWARE, OR ANY\nDERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.\n\n5. This License Agreement will automatically terminate upon a material\nbreach of its terms and conditions.\n\n6. This License Agreement shall be governed by and interpreted in all\nrespects by the law of the State of California, excluding conflict of\nlaw provisions.  Nothing in this License Agreement shall be deemed to\ncreate any relationship of agency, partnership, or joint venture\nbetween BeOpen and Licensee.  This License Agreement does not grant\npermission to use BeOpen trademarks or trade names in a trademark\nsense to endorse or promote products or services of Licensee, or any\nthird party.  As an exception, the \"BeOpen Python\" logos available at\nhttp://www.pythonlabs.com/logos.html may be used according to the\npermissions granted on that web page.\n\n7. By copying, installing or otherwise using the software, Licensee\nagrees to be bound by the terms and conditions of this License\nAgreement.\n\n\nCNRI LICENSE AGREEMENT FOR PYTHON 1.6.1\n---------------------------------------\n\n1. This LICENSE AGREEMENT is between the Corporation for National\nResearch Initiatives, having an office at 1895 Preston White Drive,\nReston, VA 20191 (\"CNRI\"), and the Individual or Organization\n(\"Licensee\") accessing and otherwise using Python 1.6.1 software in\nsource or binary form and its associated documentation.\n\n2. Subject to the terms and conditions of this License Agreement, CNRI\nhereby grants Licensee a nonexclusive, royalty-free, world-wide\nlicense to reproduce, analyze, test, perform and/or display publicly,\nprepare derivative works, distribute, and otherwise use Python 1.6.1\nalone or in any derivative version, provided, however, that CNRI's\nLicense Agreement and CNRI's notice of copyright, i.e., \"Copyright (c)\n1995-2001 Corporation for National Research Initiatives; All Rights\nReserved\" are retained in Python 1.6.1 alone or in any derivative\nversion prepared by Licensee.  Alternately, in lieu of CNRI's License\nAgreement, Licensee may substitute the following text (omitting the\nquotes): \"Python 1.6.1 is made available subject to the terms and\nconditions in CNRI's License Agreement.  This Agreement together with\nPython 1.6.1 may be located on the Internet using the following\nunique, persistent identifier (known as a handle): 1895.22/1013.  This\nAgreement may also be obtained from a proxy server on the Internet\nusing the following URL: http://hdl.handle.net/1895.22/1013\".\n\n3. In the event Licensee prepares a derivative work that is based on\nor incorporates Python 1.6.1 or any part thereof, and wants to make\nthe derivative work available to others as provided herein, then\nLicensee hereby agrees to include in any such work a brief summary of\nthe changes made to Python 1.6.1.\n\n4. CNRI is making Python 1.6.1 available to Licensee on an \"AS IS\"\nbasis.  CNRI MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR\nIMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, CNRI MAKES NO AND\nDISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS\nFOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON 1.6.1 WILL NOT\nINFRINGE ANY THIRD PARTY RIGHTS.\n\n5. CNRI SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON\n1.6.1 FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS\nA RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON 1.6.1,\nOR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.\n\n6. This License Agreement will automatically terminate upon a material\nbreach of its terms and conditions.\n\n7. This License Agreement shall be governed by the federal\nintellectual property law of the United States, including without\nlimitation the federal copyright law, and, to the extent such\nU.S. federal law does not apply, by the law of the Commonwealth of\nVirginia, excluding Virginia's conflict of law provisions.\nNotwithstanding the foregoing, with regard to derivative works based\non Python 1.6.1 that incorporate non-separable material that was\npreviously distributed under the GNU General Public License (GPL), the\nlaw of the Commonwealth of Virginia shall govern this License\nAgreement only as to issues arising under or with respect to\nParagraphs 4, 5, and 7 of this License Agreement.  Nothing in this\nLicense Agreement shall be deemed to create any relationship of\nagency, partnership, or joint venture between CNRI and Licensee.  This\nLicense Agreement does not grant permission to use CNRI trademarks or\ntrade name in a trademark sense to endorse or promote products or\nservices of Licensee, or any third party.\n\n8. By clicking on the \"ACCEPT\" button where indicated, or by copying,\ninstalling or otherwise using Python 1.6.1, Licensee agrees to be\nbound by the terms and conditions of this License Agreement.\n\n        ACCEPT\n\n\nCWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2\n--------------------------------------------------\n\nCopyright (c) 1991 - 1995, Stichting Mathematisch Centrum Amsterdam,\nThe Netherlands.  All rights reserved.\n\nPermission to use, copy, modify, and distribute this software and its\ndocumentation for any purpose and without fee is hereby granted,\nprovided that the above copyright notice appear in all copies and that\nboth that copyright notice and this permission notice appear in\nsupporting documentation, and that the name of Stichting Mathematisch\nCentrum or CWI not be used in advertising or publicity pertaining to\ndistribution of the software without specific, written prior\npermission.\n\nSTICHTING MATHEMATISCH CENTRUM DISCLAIMS ALL WARRANTIES WITH REGARD TO\nTHIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND\nFITNESS, IN NO EVENT SHALL STICHTING MATHEMATISCH CENTRUM BE LIABLE\nFOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES\nWHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN\nACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT\nOF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n\n\nAdditional Conditions for this Windows binary build\n---------------------------------------------------\n\nThis program is linked with and uses Microsoft Distributable Code,\ncopyrighted by Microsoft Corporation. The Microsoft Distributable Code\nincludes the following files:\n\nmsvcr90.dll\nmsvcp90.dll\nmsvcm90.dll\n\nIf you further distribute programs that include the Microsoft\nDistributable Code, you must comply with the restrictions on\ndistribution specified by Microsoft. In particular, you must require\ndistributors and external end users to agree to terms that protect the\nMicrosoft Distributable Code at least as much as Microsoft's own\nrequirements for the Distributable Code. See Microsoft's documentation\n(included in its developer tools and on its website at microsoft.com)\nfor specific details.\n\nRedistribution of the Windows binary build of the Python interpreter\ncomplies with this agreement, provided that you do not:\n\n- alter any copyright, trademark or patent notice in Microsoft's\nDistributable Code;\n\n- use Microsoft's trademarks in your programs' names or in a way that\nsuggests your programs come from or are endorsed by Microsoft;\n\n- distribute Microsoft's Distributable Code to run on a platform other\nthan Microsoft operating systems, run-time technologies or application\nplatforms; or\n\n- include Microsoft Distributable Code in malicious, deceptive or\nunlawful programs.\n\nThese restrictions apply only to the Microsoft Distributable Code as\ndefined above, not to Python itself or any programs running on the\nPython interpreter. The redistribution of the Python interpreter and\nlibraries is governed by the Python Software License included with this\nfile, or by other licenses as marked.\n\n\nThis copy of Python includes a copy of bzip2, which is licensed under the following terms:\n\n\n--------------------------------------------------------------------------\n\nThis program, \"bzip2\", the associated library \"libbzip2\", and all\ndocumentation, are copyright (C) 1996-2007 Julian R Seward.  All\nrights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions\nare met:\n\n1. Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n\n2. The origin of this software must not be misrepresented; you must \n   not claim that you wrote the original software.  If you use this \n   software in a product, an acknowledgment in the product \n   documentation would be appreciated but is not required.\n\n3. Altered source versions must be plainly marked as such, and must\n   not be misrepresented as being the original software.\n\n4. The name of the author may not be used to endorse or promote \n   products derived from this software without specific prior written \n   permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS\nOR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\nARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY\nDIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE\nGOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\nWHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nJulian Seward, jseward@bzip.org\nbzip2/libbzip2 version 1.0.5 of 10 December 2007\n\n--------------------------------------------------------------------------\n\nThis copy of Python includes a copy of Berkeley DB, which is licensed under the following terms:\n\n/*-\n * $Id: LICENSE,v 12.9 2008/02/07 17:12:17 mark Exp $\n */\n\nThe following is the license that applies to this copy of the Berkeley DB\nsoftware.  For a license to use the Berkeley DB software under conditions\nother than those described here, or to purchase support for this software,\nplease contact Oracle at berkeleydb-info_us@oracle.com.\n\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n/*\n * Copyright (c) 1990,2008 Oracle.  All rights reserved.\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions\n * are met:\n * 1. Redistributions of source code must retain the above copyright\n *    notice, this list of conditions and the following disclaimer.\n * 2. Redistributions in binary form must reproduce the above copyright\n *    notice, this list of conditions and the following disclaimer in the\n *    documentation and/or other materials provided with the distribution.\n * 3. Redistributions in any form must be accompanied by information on\n *    how to obtain complete source code for the DB software and any\n *    accompanying software that uses the DB software.  The source code\n *    must either be included in the distribution or be available for no\n *    more than the cost of distribution plus a nominal fee, and must be\n *    freely redistributable under reasonable conditions.  For an\n *    executable file, complete source code means the source code for all\n *    modules it contains.  It does not include source code for modules or\n *    files that typically accompany the major components of the operating\n *    system on which the executable file runs.\n *\n * THIS SOFTWARE IS PROVIDED BY ORACLE ``AS IS'' AND ANY EXPRESS OR\n * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n * WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR\n * NON-INFRINGEMENT, ARE DISCLAIMED.  IN NO EVENT SHALL ORACLE BE LIABLE\n * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n * BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\n * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE\n * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN\n * IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n */\n/*\n * Copyright (c) 1990, 1993, 1994, 1995\n *  The Regents of the University of California.  All rights reserved.\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions\n * are met:\n * 1. Redistributions of source code must retain the above copyright\n *    notice, this list of conditions and the following disclaimer.\n * 2. Redistributions in binary form must reproduce the above copyright\n *    notice, this list of conditions and the following disclaimer in the\n *    documentation and/or other materials provided with the distribution.\n * 3. Neither the name of the University nor the names of its contributors\n *    may be used to endorse or promote products derived from this software\n *    without specific prior written permission.\n *\n * THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND\n * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n * ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE\n * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n * SUCH DAMAGE.\n */\n/*\n * Copyright (c) 1995, 1996\n *  The President and Fellows of Harvard University.  All rights reserved.\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions\n * are met:\n * 1. Redistributions of source code must retain the above copyright\n *    notice, this list of conditions and the following disclaimer.\n * 2. Redistributions in binary form must reproduce the above copyright\n *    notice, this list of conditions and the following disclaimer in the\n *    documentation and/or other materials provided with the distribution.\n * 3. Neither the name of the University nor the names of its contributors\n *    may be used to endorse or promote products derived from this software\n *    without specific prior written permission.\n *\n * THIS SOFTWARE IS PROVIDED BY HARVARD AND ITS CONTRIBUTORS ``AS IS'' AND\n * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n * ARE DISCLAIMED.  IN NO EVENT SHALL HARVARD OR ITS CONTRIBUTORS BE LIABLE\n * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n * SUCH DAMAGE.\n */\n=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=\n/***\n * ASM: a very small and fast Java bytecode manipulation framework\n * Copyright (c) 2000-2005 INRIA, France Telecom\n * All rights reserved.\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions\n * are met:\n * 1. Redistributions of source code must retain the above copyright\n *    notice, this list of conditions and the following disclaimer.\n * 2. Redistributions in binary form must reproduce the above copyright\n *    notice, this list of conditions and the following disclaimer in the\n *    documentation and/or other materials provided with the distribution.\n * 3. Neither the name of the copyright holders nor the names of its\n *    contributors may be used to endorse or promote products derived from\n *    this software without specific prior written permission.\n *\n * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE\n * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF\n * THE POSSIBILITY OF SUCH DAMAGE.\n */\n\nThis copy of Python includes a copy of openssl, which is licensed under the following terms:\n\n\n  LICENSE ISSUES\n  ==============\n\n  The OpenSSL toolkit stays under a dual license, i.e. both the conditions of\n  the OpenSSL License and the original SSLeay license apply to the toolkit.\n  See below for the actual license texts. Actually both licenses are BSD-style\n  Open Source licenses. In case of any license issues related to OpenSSL\n  please contact openssl-core@openssl.org.\n\n  OpenSSL License\n  ---------------\n\n/* ====================================================================\n * Copyright (c) 1998-2008 The OpenSSL Project.  All rights reserved.\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions\n * are met:\n *\n * 1. Redistributions of source code must retain the above copyright\n *    notice, this list of conditions and the following disclaimer. \n *\n * 2. Redistributions in binary form must reproduce the above copyright\n *    notice, this list of conditions and the following disclaimer in\n *    the documentation and/or other materials provided with the\n *    distribution.\n *\n * 3. All advertising materials mentioning features or use of this\n *    software must display the following acknowledgment:\n *    \"This product includes software developed by the OpenSSL Project\n *    for use in the OpenSSL Toolkit. (http://www.openssl.org/)\"\n *\n * 4. The names \"OpenSSL Toolkit\" and \"OpenSSL Project\" must not be used to\n *    endorse or promote products derived from this software without\n *    prior written permission. For written permission, please contact\n *    openssl-core@openssl.org.\n *\n * 5. Products derived from this software may not be called \"OpenSSL\"\n *    nor may \"OpenSSL\" appear in their names without prior written\n *    permission of the OpenSSL Project.\n *\n * 6. Redistributions of any form whatsoever must retain the following\n *    acknowledgment:\n *    \"This product includes software developed by the OpenSSL Project\n *    for use in the OpenSSL Toolkit (http://www.openssl.org/)\"\n *\n * THIS SOFTWARE IS PROVIDED BY THE OpenSSL PROJECT ``AS IS'' AND ANY\n * EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE OpenSSL PROJECT OR\n * ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT\n * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\n * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\n * OF THE POSSIBILITY OF SUCH DAMAGE.\n * ====================================================================\n *\n * This product includes cryptographic software written by Eric Young\n * (eay@cryptsoft.com).  This product includes software written by Tim\n * Hudson (tjh@cryptsoft.com).\n *\n */\n\n Original SSLeay License\n -----------------------\n\n/* Copyright (C) 1995-1998 Eric Young (eay@cryptsoft.com)\n * All rights reserved.\n *\n * This package is an SSL implementation written\n * by Eric Young (eay@cryptsoft.com).\n * The implementation was written so as to conform with Netscapes SSL.\n * \n * This library is free for commercial and non-commercial use as long as\n * the following conditions are aheared to.  The following conditions\n * apply to all code found in this distribution, be it the RC4, RSA,\n * lhash, DES, etc., code; not just the SSL code.  The SSL documentation\n * included with this distribution is covered by the same copyright terms\n * except that the holder is Tim Hudson (tjh@cryptsoft.com).\n * \n * Copyright remains Eric Young's, and as such any Copyright notices in\n * the code are not to be removed.\n * If this package is used in a product, Eric Young should be given attribution\n * as the author of the parts of the library used.\n * This can be in the form of a textual message at program startup or\n * in documentation (online or textual) provided with the package.\n * \n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions\n * are met:\n * 1. Redistributions of source code must retain the copyright\n *    notice, this list of conditions and the following disclaimer.\n * 2. Redistributions in binary form must reproduce the above copyright\n *    notice, this list of conditions and the following disclaimer in the\n *    documentation and/or other materials provided with the distribution.\n * 3. All advertising materials mentioning features or use of this software\n *    must display the following acknowledgement:\n *    \"This product includes cryptographic software written by\n *     Eric Young (eay@cryptsoft.com)\"\n *    The word 'cryptographic' can be left out if the rouines from the library\n *    being used are not cryptographic related :-).\n * 4. If you include any Windows specific code (or a derivative thereof) from \n *    the apps directory (application code) you must include an acknowledgement:\n *    \"This product includes software written by Tim Hudson (tjh@cryptsoft.com)\"\n * \n * THIS SOFTWARE IS PROVIDED BY ERIC YOUNG ``AS IS'' AND\n * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE\n * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\n * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS\n * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT\n * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY\n * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n * SUCH DAMAGE.\n * \n * The licence and distribution terms for any publically available version or\n * derivative of this code cannot be changed.  i.e. this code cannot simply be\n * copied and put under another distribution licence\n * [including the GNU Public Licence.]\n */\n\n\nThis copy of Python includes a copy of Tcl, which is licensed under the following terms:\n\nThis software is copyrighted by the Regents of the University of\nCalifornia, Sun Microsystems, Inc., Scriptics Corporation, ActiveState\nCorporation and other parties.  The following terms apply to all files\nassociated with the software unless explicitly disclaimed in\nindividual files.\n\nThe authors hereby grant permission to use, copy, modify, distribute,\nand license this software and its documentation for any purpose, provided\nthat existing copyright notices are retained in all copies and that this\nnotice is included verbatim in any distributions. No written agreement,\nlicense, or royalty fee is required for any of the authorized uses.\nModifications to this software may be copyrighted by their authors\nand need not follow the licensing terms described here, provided that\nthe new terms are clearly indicated on the first page of each file where\nthey apply.\n\nIN NO EVENT SHALL THE AUTHORS OR DISTRIBUTORS BE LIABLE TO ANY PARTY\nFOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES\nARISING OUT OF THE USE OF THIS SOFTWARE, ITS DOCUMENTATION, OR ANY\nDERIVATIVES THEREOF, EVEN IF THE AUTHORS HAVE BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGE.\n\nTHE AUTHORS AND DISTRIBUTORS SPECIFICALLY DISCLAIM ANY WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.  THIS SOFTWARE\nIS PROVIDED ON AN \"AS IS\" BASIS, AND THE AUTHORS AND DISTRIBUTORS HAVE\nNO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR\nMODIFICATIONS.\n\nGOVERNMENT USE: If you are acquiring this software on behalf of the\nU.S. government, the Government shall have only \"Restricted Rights\"\nin the software and related documentation as defined in the Federal \nAcquisition Regulations (FARs) in Clause 52.227.19 (c) (2).  If you\nare acquiring the software on behalf of the Department of Defense, the\nsoftware shall be classified as \"Commercial Computer Software\" and the\nGovernment shall have only \"Restricted Rights\" as defined in Clause\n252.227-7013 (c) (1) of DFARs.  Notwithstanding the foregoing, the\nauthors grant the U.S. Government and others acting in its behalf\npermission to use and distribute the software in accordance with the\nterms specified in this license. \n\nThis copy of Python includes a copy of Tk, which is licensed under the following terms:\n\nThis software is copyrighted by the Regents of the University of\nCalifornia, Sun Microsystems, Inc., and other parties.  The following\nterms apply to all files associated with the software unless explicitly\ndisclaimed in individual files.\n\nThe authors hereby grant permission to use, copy, modify, distribute,\nand license this software and its documentation for any purpose, provided\nthat existing copyright notices are retained in all copies and that this\nnotice is included verbatim in any distributions. No written agreement,\nlicense, or royalty fee is required for any of the authorized uses.\nModifications to this software may be copyrighted by their authors\nand need not follow the licensing terms described here, provided that\nthe new terms are clearly indicated on the first page of each file where\nthey apply.\n\nIN NO EVENT SHALL THE AUTHORS OR DISTRIBUTORS BE LIABLE TO ANY PARTY\nFOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES\nARISING OUT OF THE USE OF THIS SOFTWARE, ITS DOCUMENTATION, OR ANY\nDERIVATIVES THEREOF, EVEN IF THE AUTHORS HAVE BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGE.\n\nTHE AUTHORS AND DISTRIBUTORS SPECIFICALLY DISCLAIM ANY WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.  THIS SOFTWARE\nIS PROVIDED ON AN \"AS IS\" BASIS, AND THE AUTHORS AND DISTRIBUTORS HAVE\nNO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR\nMODIFICATIONS.\n\nGOVERNMENT USE: If you are acquiring this software on behalf of the\nU.S. government, the Government shall have only \"Restricted Rights\"\nin the software and related documentation as defined in the Federal \nAcquisition Regulations (FARs) in Clause 52.227.19 (c) (2).  If you\nare acquiring the software on behalf of the Department of Defense, the\nsoftware shall be classified as \"Commercial Computer Software\" and the\nGovernment shall have only \"Restricted Rights\" as defined in Clause\n252.227-7013 (c) (1) of DFARs.  Notwithstanding the foregoing, the\nauthors grant the U.S. Government and others acting in its behalf\npermission to use and distribute the software in accordance with the\nterms specified in this license.\n\nThis copy of Python includes a copy of Tix, which is licensed under the following terms:\n\nCopyright (c) 1993-1999 Ioi Kim Lam.\nCopyright (c) 2000-2001 Tix Project Group.\nCopyright (c) 2004 ActiveState\n\nThis software is copyrighted by the above entities\nand other parties.  The following terms apply to all files associated\nwith the software unless explicitly disclaimed in individual files.\n\nThe authors hereby grant permission to use, copy, modify, distribute,\nand license this software and its documentation for any purpose, provided\nthat existing copyright notices are retained in all copies and that this\nnotice is included verbatim in any distributions. No written agreement,\nlicense, or royalty fee is required for any of the authorized uses.\nModifications to this software may be copyrighted by their authors\nand need not follow the licensing terms described here, provided that\nthe new terms are clearly indicated on the first page of each file where\nthey apply.\n\nIN NO EVENT SHALL THE AUTHORS OR DISTRIBUTORS BE LIABLE TO ANY PARTY\nFOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES\nARISING OUT OF THE USE OF THIS SOFTWARE, ITS DOCUMENTATION, OR ANY\nDERIVATIVES THEREOF, EVEN IF THE AUTHORS HAVE BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGE.\n\nTHE AUTHORS AND DISTRIBUTORS SPECIFICALLY DISCLAIM ANY WARRANTIES,\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.  THIS SOFTWARE\nIS PROVIDED ON AN \"AS IS\" BASIS, AND THE AUTHORS AND DISTRIBUTORS HAVE\nNO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR\nMODIFICATIONS.\n\nGOVERNMENT USE: If you are acquiring this software on behalf of the\nU.S. government, the Government shall have only \"Restricted Rights\"\nin the software and related documentation as defined in the Federal \nAcquisition Regulations (FARs) in Clause 52.227.19 (c) (2).  If you\nare acquiring the software on behalf of the Department of Defense, the\nsoftware shall be classified as \"Commercial Computer Software\" and the\nGovernment shall have only \"Restricted Rights\" as defined in Clause\n252.227-7013 (c) (1) of DFARs.  Notwithstanding the foregoing, the\nauthors grant the U.S. Government and others acting in its behalf\npermission to use and distribute the software in accordance with the\nterms specified in this license. \n\n----------------------------------------------------------------------\n\nParts of this software are based on the Tcl/Tk software copyrighted by\nthe Regents of the University of California, Sun Microsystems, Inc.,\nand other parties. The original license terms of the Tcl/Tk software\ndistribution is included in the file docs/license.tcltk.\n\nParts of this software are based on the HTML Library software\ncopyrighted by Sun Microsystems, Inc. The original license terms of\nthe HTML Library software distribution is included in the file\ndocs/license.html_lib.\n\n*****************************************************************\n", "description_content_type": null, "docs_url": null, "download_url": null, "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://dev.mysql.com", "keywords": "mysql db", "license": "GNU GPLv2 (with FOSS License Exception)", "maintainer": null, "maintainer_email": null, "name": "mysql-utilities", "package_url": "https://pypi.org/project/mysql-utilities/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/mysql-utilities/", "project_urls": {"Homepage": "http://dev.mysql.com"}, "release_url": "https://pypi.org/project/mysql-utilities/1.4.3/", "requires_dist": null, "requires_python": null, "summary": "MySQL Utilities 1.4.3 (part of MySQL Workbench Distribution 6.0.0)", "version": "1.4.3", "yanked": false, "html_description": "<div class=\"project-description\">\n            MySQL Utilities 1.4 (part of MySQL Workbench Distribution 6.0)<br><br>This is a release of MySQL Utilities (part of MySQL Workbench Distribution),<br>the dual-license, complete database modeling, administration and development<br>program for MySQL. For the avoidance of doubt, this <br>particular copy of the software is released under the <br>version 2 of the GNU General Public License. MySQL Utilities<br>is brought to you by the MySQL team at Oracle.<br><br>Copyright (c) 2010, 2014, Oracle and/or its affiliates. All rights reserved.<br><br>For more information MySQL Utilities, visit <br>  http://dev.mysql.com/doc/workbench/en/index.html<br>For more downloads and the source of MySQL Utilities, visit<br>  http://dev.mysql.com/downloads<br><br>License information can be found in the LICENSE.txt file.<br><br>This distribution may include materials developed by third<br>parties. For license and attribution notices for these<br>materials, please refer to the documentation that accompanies<br>this distribution. A copy of the license/notices is also <br>reproduced below. <br><br>GPLv2 Disclaimer<br>For the avoidance of doubt, except that if any license choice<br>other than GPL or LGPL is available it will apply instead, <br>Oracle elects to use only the General Public License version 2 <br>(GPLv2) at this time for any software where a choice of GPL <br>license versions is made available with the language indicating <br>that GPLv2 or any later version may be used, or where a choice <br>of which version of the GPL is applied is otherwise unspecified.<br><br>********************************************************************<br><br>Third-Party Component Notices<br><br>*********************************************************************<br><br>%%The following software may be included in this product:<br>Python<br><br>Use of any of this software is governed by the terms of the license below:<br><br>Python 2.7 license<br><br>This is the official license for the Python 2.7 release:<br><br>A. HISTORY OF THE SOFTWARE<br>==========================<br><br>Python was created in the early 1990s by Guido van Rossum at Stichting<br>Mathematisch Centrum (CWI, see http://www.cwi.nl) in the Netherlands<br>as a successor of a language called ABC.  Guido remains Python's<br>principal author, although it includes many contributions from others.<br><br>In 1995, Guido continued his work on Python at the Corporation for<br>National Research Initiatives (CNRI, see http://www.cnri.reston.va.us)<br>in Reston, Virginia where he released several versions of the<br>software.<br><br>In May 2000, Guido and the Python core development team moved to<br>BeOpen.com to form the BeOpen PythonLabs team.  In October of the same<br>year, the PythonLabs team moved to Digital Creations (now Zope<br>Corporation, see http://www.zope.com).  In 2001, the Python Software<br>Foundation (PSF, see http://www.python.org/psf/) was formed, a<br>non-profit organization created specifically to own Python-related<br>Intellectual Property.  Zope Corporation is a sponsoring member of<br>the PSF.<br><br>All Python releases are Open Source (see http://www.opensource.org for<br>the Open Source Definition).  Historically, most, but not all, Python<br>releases have also been GPL-compatible; the table below summarizes<br>the various releases.<br><br>    Release         Derived     Year        Owner       GPL-<br>                    from                                compatible? (1)<br><br>    0.9.0 thru 1.2              1991-1995   CWI         yes<br>    1.3 thru 1.5.2  1.2         1995-1999   CNRI        yes<br>    1.6             1.5.2       2000        CNRI        no<br>    2.0             1.6         2000        BeOpen.com  no<br>    1.6.1           1.6         2001        CNRI        yes (2)<br>    2.1             2.0+1.6.1   2001        PSF         no<br>    2.0.1           2.0+1.6.1   2001        PSF         yes<br>    2.1.1           2.1+2.0.1   2001        PSF         yes<br>    2.2             2.1.1       2001        PSF         yes<br>    2.1.2           2.1.1       2002        PSF         yes<br>    2.1.3           2.1.2       2002        PSF         yes<br>    2.2.1           2.2         2002        PSF         yes<br>    2.2.2           2.2.1       2002        PSF         yes<br>    2.2.3           2.2.2       2003        PSF         yes<br>    2.3             2.2.2       2002-2003   PSF         yes<br>    2.3.1           2.3         2002-2003   PSF         yes<br>    2.3.2           2.3.1       2002-2003   PSF         yes<br>    2.3.3           2.3.2       2002-2003   PSF         yes<br>    2.3.4           2.3.3       2004        PSF         yes<br>    2.3.5           2.3.4       2005        PSF         yes<br>    2.4             2.3         2004        PSF         yes<br>    2.4.1           2.4         2005        PSF         yes<br>    2.4.2           2.4.1       2005        PSF         yes<br>    2.4.3           2.4.2       2006        PSF         yes<br>    2.4.4           2.4.3       2006        PSF         yes<br>    2.5             2.4         2006        PSF         yes<br>    2.5.1           2.5         2007        PSF         yes<br>    2.5.2           2.5.1       2008        PSF         yes<br>    2.5.3           2.5.2       2008        PSF         yes<br>    2.6             2.5         2008        PSF         yes<br>    2.6.1           2.6         2008        PSF         yes<br>    2.6.2           2.6.1       2009        PSF         yes<br>    2.6.3           2.6.2       2009        PSF         yes<br>    2.6.4           2.6.3       2009        PSF         yes<br>    2.6.5           2.6.4       2010        PSF         yes<br>    2.7             2.6         2010        PSF         yes<br><br>Footnotes:<br><br>(1) GPL-compatible doesn't mean that we're distributing Python under<br>    the GPL.  All Python licenses, unlike the GPL, let you distribute<br>    a modified version without making your changes open source.  The<br>    GPL-compatible licenses make it possible to combine Python with<br>    other software that is released under the GPL; the others don't.<br><br>(2) According to Richard Stallman, 1.6.1 is not GPL-compatible,<br>    because its license has a choice of law clause.  According to<br>    CNRI, however, Stallman's lawyer has told CNRI's lawyer that 1.6.1<br>    is \"not incompatible\" with the GPL.<br><br>Thanks to the many outside volunteers who have worked under Guido's<br>direction to make these releases possible.<br><br><br>B. TERMS AND CONDITIONS FOR ACCESSING OR OTHERWISE USING PYTHON<br>===============================================================<br><br>PYTHON SOFTWARE FOUNDATION LICENSE VERSION 2<br>--------------------------------------------<br><br>1. This LICENSE AGREEMENT is between the Python Software Foundation<br>(\"PSF\"), and the Individual or Organization (\"Licensee\") accessing and<br>otherwise using this software (\"Python\") in source or binary form and<br>its associated documentation.<br><br>2. Subject to the terms and conditions of this License Agreement, PSF hereby<br>grants Licensee a nonexclusive, royalty-free, world-wide license to reproduce,<br>analyze, test, perform and/or display publicly, prepare derivative works,<br>distribute, and otherwise use Python alone or in any derivative version,<br>provided, however, that PSF's License Agreement and PSF's notice of copyright,<br>i.e., \"Copyright (c) 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010,<br>2011, 2012 Python Software Foundation; All Rights Reserved\" are retained in Python<br>alone or in any derivative version prepared by Licensee.<br><br>3. In the event Licensee prepares a derivative work that is based on<br>or incorporates Python or any part thereof, and wants to make<br>the derivative work available to others as provided herein, then<br>Licensee hereby agrees to include in any such work a brief summary of<br>the changes made to Python.<br><br>4. PSF is making Python available to Licensee on an \"AS IS\"<br>basis.  PSF MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR<br>IMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, PSF MAKES NO AND<br>DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS<br>FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON WILL NOT<br>INFRINGE ANY THIRD PARTY RIGHTS.<br><br>5. PSF SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON<br>FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS<br>A RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON,<br>OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.<br><br>6. This License Agreement will automatically terminate upon a material<br>breach of its terms and conditions.<br><br>7. Nothing in this License Agreement shall be deemed to create any<br>relationship of agency, partnership, or joint venture between PSF and<br>Licensee.  This License Agreement does not grant permission to use PSF<br>trademarks or trade name in a trademark sense to endorse or promote<br>products or services of Licensee, or any third party.<br><br>8. By copying, installing or otherwise using Python, Licensee<br>agrees to be bound by the terms and conditions of this License<br>Agreement.<br><br><br>BEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0<br>-------------------------------------------<br><br>BEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1<br><br>1. This LICENSE AGREEMENT is between BeOpen.com (\"BeOpen\"), having an<br>office at 160 Saratoga Avenue, Santa Clara, CA 95051, and the<br>Individual or Organization (\"Licensee\") accessing and otherwise using<br>this software in source or binary form and its associated<br>documentation (\"the Software\").<br><br>2. Subject to the terms and conditions of this BeOpen Python License<br>Agreement, BeOpen hereby grants Licensee a non-exclusive,<br>royalty-free, world-wide license to reproduce, analyze, test, perform<br>and/or display publicly, prepare derivative works, distribute, and<br>otherwise use the Software alone or in any derivative version,<br>provided, however, that the BeOpen Python License is retained in the<br>Software, alone or in any derivative version prepared by Licensee.<br><br>3. BeOpen is making the Software available to Licensee on an \"AS IS\"<br>basis.  BEOPEN MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR<br>IMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, BEOPEN MAKES NO AND<br>DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS<br>FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE WILL NOT<br>INFRINGE ANY THIRD PARTY RIGHTS.<br><br>4. BEOPEN SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF THE<br>SOFTWARE FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS<br>AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THE SOFTWARE, OR ANY<br>DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.<br><br>5. This License Agreement will automatically terminate upon a material<br>breach of its terms and conditions.<br><br>6. This License Agreement shall be governed by and interpreted in all<br>respects by the law of the State of California, excluding conflict of<br>law provisions.  Nothing in this License Agreement shall be deemed to<br>create any relationship of agency, partnership, or joint venture<br>between BeOpen and Licensee.  This License Agreement does not grant<br>permission to use BeOpen trademarks or trade names in a trademark<br>sense to endorse or promote products or services of Licensee, or any<br>third party.  As an exception, the \"BeOpen Python\" logos available at<br>http://www.pythonlabs.com/logos.html may be used according to the<br>permissions granted on that web page.<br><br>7. By copying, installing or otherwise using the software, Licensee<br>agrees to be bound by the terms and conditions of this License<br>Agreement.<br><br><br>CNRI LICENSE AGREEMENT FOR PYTHON 1.6.1<br>---------------------------------------<br><br>1. This LICENSE AGREEMENT is between the Corporation for National<br>Research Initiatives, having an office at 1895 Preston White Drive,<br>Reston, VA 20191 (\"CNRI\"), and the Individual or Organization<br>(\"Licensee\") accessing and otherwise using Python 1.6.1 software in<br>source or binary form and its associated documentation.<br><br>2. Subject to the terms and conditions of this License Agreement, CNRI<br>hereby grants Licensee a nonexclusive, royalty-free, world-wide<br>license to reproduce, analyze, test, perform and/or display publicly,<br>prepare derivative works, distribute, and otherwise use Python 1.6.1<br>alone or in any derivative version, provided, however, that CNRI's<br>License Agreement and CNRI's notice of copyright, i.e., \"Copyright (c)<br>1995-2001 Corporation for National Research Initiatives; All Rights<br>Reserved\" are retained in Python 1.6.1 alone or in any derivative<br>version prepared by Licensee.  Alternately, in lieu of CNRI's License<br>Agreement, Licensee may substitute the following text (omitting the<br>quotes): \"Python 1.6.1 is made available subject to the terms and<br>conditions in CNRI's License Agreement.  This Agreement together with<br>Python 1.6.1 may be located on the Internet using the following<br>unique, persistent identifier (known as a handle): 1895.22/1013.  This<br>Agreement may also be obtained from a proxy server on the Internet<br>using the following URL: http://hdl.handle.net/1895.22/1013\".<br><br>3. In the event Licensee prepares a derivative work that is based on<br>or incorporates Python 1.6.1 or any part thereof, and wants to make<br>the derivative work available to others as provided herein, then<br>Licensee hereby agrees to include in any such work a brief summary of<br>the changes made to Python 1.6.1.<br><br>4. CNRI is making Python 1.6.1 available to Licensee on an \"AS IS\"<br>basis.  CNRI MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR<br>IMPLIED.  BY WAY OF EXAMPLE, BUT NOT LIMITATION, CNRI MAKES NO AND<br>DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS<br>FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON 1.6.1 WILL NOT<br>INFRINGE ANY THIRD PARTY RIGHTS.<br><br>5. CNRI SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON<br>1.6.1 FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS<br>A RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON 1.6.1,<br>OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.<br><br>6. This License Agreement will automatically terminate upon a material<br>breach of its terms and conditions.<br><br>7. This License Agreement shall be governed by the federal<br>intellectual property law of the United States, including without<br>limitation the federal copyright law, and, to the extent such<br>U.S. federal law does not apply, by the law of the Commonwealth of<br>Virginia, excluding Virginia's conflict of law provisions.<br>Notwithstanding the foregoing, with regard to derivative works based<br>on Python 1.6.1 that incorporate non-separable material that was<br>previously distributed under the GNU General Public License (GPL), the<br>law of the Commonwealth of Virginia shall govern this License<br>Agreement only as to issues arising under or with respect to<br>Paragraphs 4, 5, and 7 of this License Agreement.  Nothing in this<br>License Agreement shall be deemed to create any relationship of<br>agency, partnership, or joint venture between CNRI and Licensee.  This<br>License Agreement does not grant permission to use CNRI trademarks or<br>trade name in a trademark sense to endorse or promote products or<br>services of Licensee, or any third party.<br><br>8. By clicking on the \"ACCEPT\" button where indicated, or by copying,<br>installing or otherwise using Python 1.6.1, Licensee agrees to be<br>bound by the terms and conditions of this License Agreement.<br><br>        ACCEPT<br><br><br>CWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2<br>--------------------------------------------------<br><br>Copyright (c) 1991 - 1995, Stichting Mathematisch Centrum Amsterdam,<br>The Netherlands.  All rights reserved.<br><br>Permission to use, copy, modify, and distribute this software and its<br>documentation for any purpose and without fee is hereby granted,<br>provided that the above copyright notice appear in all copies and that<br>both that copyright notice and this permission notice appear in<br>supporting documentation, and that the name of Stichting Mathematisch<br>Centrum or CWI not be used in advertising or publicity pertaining to<br>distribution of the software without specific, written prior<br>permission.<br><br>STICHTING MATHEMATISCH CENTRUM DISCLAIMS ALL WARRANTIES WITH REGARD TO<br>THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND<br>FITNESS, IN NO EVENT SHALL STICHTING MATHEMATISCH CENTRUM BE LIABLE<br>FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES<br>WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN<br>ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT<br>OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.<br><br><br>Additional Conditions for this Windows binary build<br>---------------------------------------------------<br><br>This program is linked with and uses Microsoft Distributable Code,<br>copyrighted by Microsoft Corporation. The Microsoft Distributable Code<br>includes the following files:<br><br>msvcr90.dll<br>msvcp90.dll<br>msvcm90.dll<br><br>If you further distribute programs that include the Microsoft<br>Distributable Code, you must comply with the restrictions on<br>distribution specified by Microsoft. In particular, you must require<br>distributors and external end users to agree to terms that protect the<br>Microsoft Distributable Code at least as much as Microsoft's own<br>requirements for the Distributable Code. See Microsoft's documentation<br>(included in its developer tools and on its website at microsoft.com)<br>for specific details.<br><br>Redistribution of the Windows binary build of the Python interpreter<br>complies with this agreement, provided that you do not:<br><br>- alter any copyright, trademark or patent notice in Microsoft's<br>Distributable Code;<br><br>- use Microsoft's trademarks in your programs' names or in a way that<br>suggests your programs come from or are endorsed by Microsoft;<br><br>- distribute Microsoft's Distributable Code to run on a platform other<br>than Microsoft operating systems, run-time technologies or application<br>platforms; or<br><br>- include Microsoft Distributable Code in malicious, deceptive or<br>unlawful programs.<br><br>These restrictions apply only to the Microsoft Distributable Code as<br>defined above, not to Python itself or any programs running on the<br>Python interpreter. The redistribution of the Python interpreter and<br>libraries is governed by the Python Software License included with this<br>file, or by other licenses as marked.<br><br><br>This copy of Python includes a copy of bzip2, which is licensed under the following terms:<br><br><br>--------------------------------------------------------------------------<br><br>This program, \"bzip2\", the associated library \"libbzip2\", and all<br>documentation, are copyright (C) 1996-2007 Julian R Seward.  All<br>rights reserved.<br><br>Redistribution and use in source and binary forms, with or without<br>modification, are permitted provided that the following conditions<br>are met:<br><br>1. Redistributions of source code must retain the above copyright<br>   notice, this list of conditions and the following disclaimer.<br><br>2. The origin of this software must not be misrepresented; you must <br>   not claim that you wrote the original software.  If you use this <br>   software in a product, an acknowledgment in the product <br>   documentation would be appreciated but is not required.<br><br>3. Altered source versions must be plainly marked as such, and must<br>   not be misrepresented as being the original software.<br><br>4. The name of the author may not be used to endorse or promote <br>   products derived from this software without specific prior written <br>   permission.<br><br>THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS<br>OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED<br>WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE<br>ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY<br>DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL<br>DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE<br>GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS<br>INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,<br>WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING<br>NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS<br>SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.<br><br>Julian Seward, jseward@bzip.org<br>bzip2/libbzip2 version 1.0.5 of 10 December 2007<br><br>--------------------------------------------------------------------------<br><br>This copy of Python includes a copy of Berkeley DB, which is licensed under the following terms:<br><br>/*-<br> * $Id: LICENSE,v 12.9 2008/02/07 17:12:17 mark Exp $<br> */<br><br>The following is the license that applies to this copy of the Berkeley DB<br>software.  For a license to use the Berkeley DB software under conditions<br>other than those described here, or to purchase support for this software,<br>please contact Oracle at berkeleydb-info_us@oracle.com.<br><br>=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br>/*<br> * Copyright (c) 1990,2008 Oracle.  All rights reserved.<br> *<br> * Redistribution and use in source and binary forms, with or without<br> * modification, are permitted provided that the following conditions<br> * are met:<br> * 1. Redistributions of source code must retain the above copyright<br> *    notice, this list of conditions and the following disclaimer.<br> * 2. Redistributions in binary form must reproduce the above copyright<br> *    notice, this list of conditions and the following disclaimer in the<br> *    documentation and/or other materials provided with the distribution.<br> * 3. Redistributions in any form must be accompanied by information on<br> *    how to obtain complete source code for the DB software and any<br> *    accompanying software that uses the DB software.  The source code<br> *    must either be included in the distribution or be available for no<br> *    more than the cost of distribution plus a nominal fee, and must be<br> *    freely redistributable under reasonable conditions.  For an<br> *    executable file, complete source code means the source code for all<br> *    modules it contains.  It does not include source code for modules or<br> *    files that typically accompany the major components of the operating<br> *    system on which the executable file runs.<br> *<br> * THIS SOFTWARE IS PROVIDED BY ORACLE ``AS IS'' AND ANY EXPRESS OR<br> * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED<br> * WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR<br> * NON-INFRINGEMENT, ARE DISCLAIMED.  IN NO EVENT SHALL ORACLE BE LIABLE<br> * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR<br> * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF<br> * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR<br> * BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,<br> * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE<br> * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN<br> * IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.<br> */<br>/*<br> * Copyright (c) 1990, 1993, 1994, 1995<br> *  The Regents of the University of California.  All rights reserved.<br> *<br> * Redistribution and use in source and binary forms, with or without<br> * modification, are permitted provided that the following conditions<br> * are met:<br> * 1. Redistributions of source code must retain the above copyright<br> *    notice, this list of conditions and the following disclaimer.<br> * 2. Redistributions in binary form must reproduce the above copyright<br> *    notice, this list of conditions and the following disclaimer in the<br> *    documentation and/or other materials provided with the distribution.<br> * 3. Neither the name of the University nor the names of its contributors<br> *    may be used to endorse or promote products derived from this software<br> *    without specific prior written permission.<br> *<br> * THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND<br> * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE<br> * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE<br> * ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE<br> * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL<br> * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS<br> * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)<br> * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT<br> * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY<br> * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF<br> * SUCH DAMAGE.<br> */<br>/*<br> * Copyright (c) 1995, 1996<br> *  The President and Fellows of Harvard University.  All rights reserved.<br> *<br> * Redistribution and use in source and binary forms, with or without<br> * modification, are permitted provided that the following conditions<br> * are met:<br> * 1. Redistributions of source code must retain the above copyright<br> *    notice, this list of conditions and the following disclaimer.<br> * 2. Redistributions in binary form must reproduce the above copyright<br> *    notice, this list of conditions and the following disclaimer in the<br> *    documentation and/or other materials provided with the distribution.<br> * 3. Neither the name of the University nor the names of its contributors<br> *    may be used to endorse or promote products derived from this software<br> *    without specific prior written permission.<br> *<br> * THIS SOFTWARE IS PROVIDED BY HARVARD AND ITS CONTRIBUTORS ``AS IS'' AND<br> * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE<br> * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE<br> * ARE DISCLAIMED.  IN NO EVENT SHALL HARVARD OR ITS CONTRIBUTORS BE LIABLE<br> * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL<br> * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS<br> * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)<br> * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT<br> * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY<br> * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF<br> * SUCH DAMAGE.<br> */<br>=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=<br>/***<br> * ASM: a very small and fast Java bytecode manipulation framework<br> * Copyright (c) 2000-2005 INRIA, France Telecom<br> * All rights reserved.<br> *<br> * Redistribution and use in source and binary forms, with or without<br> * modification, are permitted provided that the following conditions<br> * are met:<br> * 1. Redistributions of source code must retain the above copyright<br> *    notice, this list of conditions and the following disclaimer.<br> * 2. Redistributions in binary form must reproduce the above copyright<br> *    notice, this list of conditions and the following disclaimer in the<br> *    documentation and/or other materials provided with the distribution.<br> * 3. Neither the name of the copyright holders nor the names of its<br> *    contributors may be used to endorse or promote products derived from<br> *    this software without specific prior written permission.<br> *<br> * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"<br> * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE<br> * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE<br> * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE<br> * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR<br> * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF<br> * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS<br> * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN<br> * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)<br> * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF<br> * THE POSSIBILITY OF SUCH DAMAGE.<br> */<br><br>This copy of Python includes a copy of openssl, which is licensed under the following terms:<br><br><br>  LICENSE ISSUES<br>  ==============<br><br>  The OpenSSL toolkit stays under a dual license, i.e. both the conditions of<br>  the OpenSSL License and the original SSLeay license apply to the toolkit.<br>  See below for the actual license texts. Actually both licenses are BSD-style<br>  Open Source licenses. In case of any license issues related to OpenSSL<br>  please contact openssl-core@openssl.org.<br><br>  OpenSSL License<br>  ---------------<br><br>/* ====================================================================<br> * Copyright (c) 1998-2008 The OpenSSL Project.  All rights reserved.<br> *<br> * Redistribution and use in source and binary forms, with or without<br> * modification, are permitted provided that the following conditions<br> * are met:<br> *<br> * 1. Redistributions of source code must retain the above copyright<br> *    notice, this list of conditions and the following disclaimer. <br> *<br> * 2. Redistributions in binary form must reproduce the above copyright<br> *    notice, this list of conditions and the following disclaimer in<br> *    the documentation and/or other materials provided with the<br> *    distribution.<br> *<br> * 3. All advertising materials mentioning features or use of this<br> *    software must display the following acknowledgment:<br> *    \"This product includes software developed by the OpenSSL Project<br> *    for use in the OpenSSL Toolkit. (http://www.openssl.org/)\"<br> *<br> * 4. The names \"OpenSSL Toolkit\" and \"OpenSSL Project\" must not be used to<br> *    endorse or promote products derived from this software without<br> *    prior written permission. For written permission, please contact<br> *    openssl-core@openssl.org.<br> *<br> * 5. Products derived from this software may not be called \"OpenSSL\"<br> *    nor may \"OpenSSL\" appear in their names without prior written<br> *    permission of the OpenSSL Project.<br> *<br> * 6. Redistributions of any form whatsoever must retain the following<br> *    acknowledgment:<br> *    \"This product includes software developed by the OpenSSL Project<br> *    for use in the OpenSSL Toolkit (http://www.openssl.org/)\"<br> *<br> * THIS SOFTWARE IS PROVIDED BY THE OpenSSL PROJECT ``AS IS'' AND ANY<br> * EXPRESSED OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE<br> * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR<br> * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE OpenSSL PROJECT OR<br> * ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,<br> * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT<br> * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;<br> * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)<br> * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,<br> * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)<br> * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED<br> * OF THE POSSIBILITY OF SUCH DAMAGE.<br> * ====================================================================<br> *<br> * This product includes cryptographic software written by Eric Young<br> * (eay@cryptsoft.com).  This product includes software written by Tim<br> * Hudson (tjh@cryptsoft.com).<br> *<br> */<br><br> Original SSLeay License<br> -----------------------<br><br>/* Copyright (C) 1995-1998 Eric Young (eay@cryptsoft.com)<br> * All rights reserved.<br> *<br> * This package is an SSL implementation written<br> * by Eric Young (eay@cryptsoft.com).<br> * The implementation was written so as to conform with Netscapes SSL.<br> * <br> * This library is free for commercial and non-commercial use as long as<br> * the following conditions are aheared to.  The following conditions<br> * apply to all code found in this distribution, be it the RC4, RSA,<br> * lhash, DES, etc., code; not just the SSL code.  The SSL documentation<br> * included with this distribution is covered by the same copyright terms<br> * except that the holder is Tim Hudson (tjh@cryptsoft.com).<br> * <br> * Copyright remains Eric Young's, and as such any Copyright notices in<br> * the code are not to be removed.<br> * If this package is used in a product, Eric Young should be given attribution<br> * as the author of the parts of the library used.<br> * This can be in the form of a textual message at program startup or<br> * in documentation (online or textual) provided with the package.<br> * <br> * Redistribution and use in source and binary forms, with or without<br> * modification, are permitted provided that the following conditions<br> * are met:<br> * 1. Redistributions of source code must retain the copyright<br> *    notice, this list of conditions and the following disclaimer.<br> * 2. Redistributions in binary form must reproduce the above copyright<br> *    notice, this list of conditions and the following disclaimer in the<br> *    documentation and/or other materials provided with the distribution.<br> * 3. All advertising materials mentioning features or use of this software<br> *    must display the following acknowledgement:<br> *    \"This product includes cryptographic software written by<br> *     Eric Young (eay@cryptsoft.com)\"<br> *    The word 'cryptographic' can be left out if the rouines from the library<br> *    being used are not cryptographic related :-).<br> * 4. If you include any Windows specific code (or a derivative thereof) from <br> *    the apps directory (application code) you must include an acknowledgement:<br> *    \"This product includes software written by Tim Hudson (tjh@cryptsoft.com)\"<br> * <br> * THIS SOFTWARE IS PROVIDED BY ERIC YOUNG ``AS IS'' AND<br> * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE<br> * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE<br> * ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE<br> * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL<br> * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS<br> * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)<br> * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT<br> * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY<br> * OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF<br> * SUCH DAMAGE.<br> * <br> * The licence and distribution terms for any publically available version or<br> * derivative of this code cannot be changed.  i.e. this code cannot simply be<br> * copied and put under another distribution licence<br> * [including the GNU Public Licence.]<br> */<br><br><br>This copy of Python includes a copy of Tcl, which is licensed under the following terms:<br><br>This software is copyrighted by the Regents of the University of<br>California, Sun Microsystems, Inc., Scriptics Corporation, ActiveState<br>Corporation and other parties.  The following terms apply to all files<br>associated with the software unless explicitly disclaimed in<br>individual files.<br><br>The authors hereby grant permission to use, copy, modify, distribute,<br>and license this software and its documentation for any purpose, provided<br>that existing copyright notices are retained in all copies and that this<br>notice is included verbatim in any distributions. No written agreement,<br>license, or royalty fee is required for any of the authorized uses.<br>Modifications to this software may be copyrighted by their authors<br>and need not follow the licensing terms described here, provided that<br>the new terms are clearly indicated on the first page of each file where<br>they apply.<br><br>IN NO EVENT SHALL THE AUTHORS OR DISTRIBUTORS BE LIABLE TO ANY PARTY<br>FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES<br>ARISING OUT OF THE USE OF THIS SOFTWARE, ITS DOCUMENTATION, OR ANY<br>DERIVATIVES THEREOF, EVEN IF THE AUTHORS HAVE BEEN ADVISED OF THE<br>POSSIBILITY OF SUCH DAMAGE.<br><br>THE AUTHORS AND DISTRIBUTORS SPECIFICALLY DISCLAIM ANY WARRANTIES,<br>INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,<br>FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.  THIS SOFTWARE<br>IS PROVIDED ON AN \"AS IS\" BASIS, AND THE AUTHORS AND DISTRIBUTORS HAVE<br>NO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR<br>MODIFICATIONS.<br><br>GOVERNMENT USE: If you are acquiring this software on behalf of the<br>U.S. government, the Government shall have only \"Restricted Rights\"<br>in the software and related documentation as defined in the Federal <br>Acquisition Regulations (FARs) in Clause 52.227.19 (c) (2).  If you<br>are acquiring the software on behalf of the Department of Defense, the<br>software shall be classified as \"Commercial Computer Software\" and the<br>Government shall have only \"Restricted Rights\" as defined in Clause<br>252.227-7013 (c) (1) of DFARs.  Notwithstanding the foregoing, the<br>authors grant the U.S. Government and others acting in its behalf<br>permission to use and distribute the software in accordance with the<br>terms specified in this license. <br><br>This copy of Python includes a copy of Tk, which is licensed under the following terms:<br><br>This software is copyrighted by the Regents of the University of<br>California, Sun Microsystems, Inc., and other parties.  The following<br>terms apply to all files associated with the software unless explicitly<br>disclaimed in individual files.<br><br>The authors hereby grant permission to use, copy, modify, distribute,<br>and license this software and its documentation for any purpose, provided<br>that existing copyright notices are retained in all copies and that this<br>notice is included verbatim in any distributions. No written agreement,<br>license, or royalty fee is required for any of the authorized uses.<br>Modifications to this software may be copyrighted by their authors<br>and need not follow the licensing terms described here, provided that<br>the new terms are clearly indicated on the first page of each file where<br>they apply.<br><br>IN NO EVENT SHALL THE AUTHORS OR DISTRIBUTORS BE LIABLE TO ANY PARTY<br>FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES<br>ARISING OUT OF THE USE OF THIS SOFTWARE, ITS DOCUMENTATION, OR ANY<br>DERIVATIVES THEREOF, EVEN IF THE AUTHORS HAVE BEEN ADVISED OF THE<br>POSSIBILITY OF SUCH DAMAGE.<br><br>THE AUTHORS AND DISTRIBUTORS SPECIFICALLY DISCLAIM ANY WARRANTIES,<br>INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,<br>FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.  THIS SOFTWARE<br>IS PROVIDED ON AN \"AS IS\" BASIS, AND THE AUTHORS AND DISTRIBUTORS HAVE<br>NO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR<br>MODIFICATIONS.<br><br>GOVERNMENT USE: If you are acquiring this software on behalf of the<br>U.S. government, the Government shall have only \"Restricted Rights\"<br>in the software and related documentation as defined in the Federal <br>Acquisition Regulations (FARs) in Clause 52.227.19 (c) (2).  If you<br>are acquiring the software on behalf of the Department of Defense, the<br>software shall be classified as \"Commercial Computer Software\" and the<br>Government shall have only \"Restricted Rights\" as defined in Clause<br>252.227-7013 (c) (1) of DFARs.  Notwithstanding the foregoing, the<br>authors grant the U.S. Government and others acting in its behalf<br>permission to use and distribute the software in accordance with the<br>terms specified in this license.<br><br>This copy of Python includes a copy of Tix, which is licensed under the following terms:<br><br>Copyright (c) 1993-1999 Ioi Kim Lam.<br>Copyright (c) 2000-2001 Tix Project Group.<br>Copyright (c) 2004 ActiveState<br><br>This software is copyrighted by the above entities<br>and other parties.  The following terms apply to all files associated<br>with the software unless explicitly disclaimed in individual files.<br><br>The authors hereby grant permission to use, copy, modify, distribute,<br>and license this software and its documentation for any purpose, provided<br>that existing copyright notices are retained in all copies and that this<br>notice is included verbatim in any distributions. No written agreement,<br>license, or royalty fee is required for any of the authorized uses.<br>Modifications to this software may be copyrighted by their authors<br>and need not follow the licensing terms described here, provided that<br>the new terms are clearly indicated on the first page of each file where<br>they apply.<br><br>IN NO EVENT SHALL THE AUTHORS OR DISTRIBUTORS BE LIABLE TO ANY PARTY<br>FOR DIRECT, INDIRECT, SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES<br>ARISING OUT OF THE USE OF THIS SOFTWARE, ITS DOCUMENTATION, OR ANY<br>DERIVATIVES THEREOF, EVEN IF THE AUTHORS HAVE BEEN ADVISED OF THE<br>POSSIBILITY OF SUCH DAMAGE.<br><br>THE AUTHORS AND DISTRIBUTORS SPECIFICALLY DISCLAIM ANY WARRANTIES,<br>INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,<br>FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT.  THIS SOFTWARE<br>IS PROVIDED ON AN \"AS IS\" BASIS, AND THE AUTHORS AND DISTRIBUTORS HAVE<br>NO OBLIGATION TO PROVIDE MAINTENANCE, SUPPORT, UPDATES, ENHANCEMENTS, OR<br>MODIFICATIONS.<br><br>GOVERNMENT USE: If you are acquiring this software on behalf of the<br>U.S. government, the Government shall have only \"Restricted Rights\"<br>in the software and related documentation as defined in the Federal <br>Acquisition Regulations (FARs) in Clause 52.227.19 (c) (2).  If you<br>are acquiring the software on behalf of the Department of Defense, the<br>software shall be classified as \"Commercial Computer Software\" and the<br>Government shall have only \"Restricted Rights\" as defined in Clause<br>252.227-7013 (c) (1) of DFARs.  Notwithstanding the foregoing, the<br>authors grant the U.S. Government and others acting in its behalf<br>permission to use and distribute the software in accordance with the<br>terms specified in this license. <br><br>----------------------------------------------------------------------<br><br>Parts of this software are based on the Tcl/Tk software copyrighted by<br>the Regents of the University of California, Sun Microsystems, Inc.,<br>and other parties. The original license terms of the Tcl/Tk software<br>distribution is included in the file docs/license.tcltk.<br><br>Parts of this software are based on the HTML Library software<br>copyrighted by Sun Microsystems, Inc. The original license terms of<br>the HTML Library software distribution is included in the file<br>docs/license.html_lib.<br><br>*****************************************************************<br>\n          </div>"}, "last_serial": 1167125, "releases": {"1.4.3": [{"comment_text": "", "digests": {"md5": "7a11b9fa7f9b6642c073cb113b1205b6", "sha256": "6657c67cff1a4f3905e6143d62af6bf2dc8a72de73b2ca82b8eac7e50f3ecad7"}, "downloads": -1, "filename": "mysql-utilities-1.4.3.tar.gz", "has_sig": false, "md5_digest": "7a11b9fa7f9b6642c073cb113b1205b6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 564604, "upload_time": "2014-07-23T17:50:47", "upload_time_iso_8601": "2014-07-23T17:50:47.251499Z", "url": "https://files.pythonhosted.org/packages/b3/79/137e4dbd1f3d900bc4327dc344dacc19fa65873543867e8a9f63203630b4/mysql-utilities-1.4.3.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "7a11b9fa7f9b6642c073cb113b1205b6", "sha256": "6657c67cff1a4f3905e6143d62af6bf2dc8a72de73b2ca82b8eac7e50f3ecad7"}, "downloads": -1, "filename": "mysql-utilities-1.4.3.tar.gz", "has_sig": false, "md5_digest": "7a11b9fa7f9b6642c073cb113b1205b6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 564604, "upload_time": "2014-07-23T17:50:47", "upload_time_iso_8601": "2014-07-23T17:50:47.251499Z", "url": "https://files.pythonhosted.org/packages/b3/79/137e4dbd1f3d900bc4327dc344dacc19fa65873543867e8a9f63203630b4/mysql-utilities-1.4.3.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:48:00 2020"}