{"info": {"author": "James Douglass", "author_email": "jdouglass@stanford.edu", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Intended Audience :: Developers", "Intended Audience :: Science/Research", "Natural Language :: English", "Operating System :: MacOS :: MacOS X", "Operating System :: Microsoft", "Operating System :: POSIX", "Programming Language :: Python :: 2 :: Only", "Topic :: Scientific/Engineering :: GIS"], "description": "OPAL: Offset Portfolio Analyzer and Locator\n===========================================\n\nA tool by the Natural Capital Project.\n\nVisit http://naturalcapitalproject.org/OPAL.html for more information.\n\n\nChanges\n=======\n\n1.1.0 (2015-11-12)\n-----------\n- (Feature) OPAL now saves a vector to the workspace of those municipalities \n  (softboundary 3) that intersect the project footprint.  This is only saved\n  when the softboundary 3 input is provided by the user.\n- (Bugfix) Corrected an issue where testing future scenarios in the static map \n  generator would raise an exception.\n- (Usability) Versioning replaced by `natcap.versioner`\n- (Usability) OPAL UI is now offered in spanish as well as english.\n- (Usability) OPAL UI allows for the user to select their language of choice among \n  those offered (currently english and spanish).\n- (Feature) OPAL/MAFE-T report and output CSV values are rounded to 3 significant \n  figures.\n- (Bufgix) Improved sorting by checkboxes in output report.\n- (Usability) Improved logging to user within longer-running processes.\n- (Feature) User's guide is tracked as a subrepository along with each build of\n  OPAL.  User's guide version numbers are pulled from the OPAL source tree.\n- (Feature) OPAL/MAFE-T report now includes the OPAL version used and a \n  time/date stamp.\n- (Bugfix) The OPAL/MAFE-T report used to offer a hyperlink to the vector\n  (a multi-part ESRI Shapefile) containing the set of parcels matching \n  criteria.  Clicking this link would only download part of the file.\n  It has been replaced with a text reference to the location of the file on \n  disk.\n- (Usability) Select all/Select None buttons have been removed from the report.\n  They didn't work.  They will be added back when they work properly.\n- (Usability) Files within the workspace that are outside of the per-hydrozone\n  analysis are now hidden within an intermediate/ folder.\n- (Usability) Various files have been renamed.\n- (Bugfix) The headers of the top table of the output report now render in the\n  language of the OPAL run.  They used to always render in english.\n- (Bugfix) Parcels in the parcels table of the report are now correctly screened\n  to ensure that they are at least as large as the smallest impacted area\n  of the same ecosystem type.\n- (Usability) The user is now unable to close the OPAL/MAFE-T execution dialog\n  unless the model run has completed or the process is terminated externally.\n- (Bugfix) Better handling for when the user provides an ecosystem vector without\n  any features or when the vector is of the wrong type (points or lines instead\n  of polygons).\n- (Usability) When a validated, optional input has its value removed from a UI\n  input, the green checkbox indicating input validity is now disabled.\n- (Bugfix) OPAL UI now allows files containing any UTF-8 character to be selected\n  by the user.\n- (Feature) Output vector of selected offsets now includes the distance from the \n  nearest impact site and the parcel size in the attribute table.\n- (Bugfix) Output report had some columns that were incorrectly rounded to 1 \n  decimal place instead of 2.\n- (Usability) OPAL/MAFE-T will now confirm that the user wishes to overwrite the\n  workspace if files exist within the user-defined workspace.  This dialog\n  is triggered if the user-defined workspace exists and there are files within.\n- (Usability) OPAL/MAFE-T will now prompt the user for a language on startup\n  and remember the user's selection.  The language may be set at any time\n  through File -> Select Language.  Changing the language will trigger an \n  application restart.\n\n\n1.0.3 (2015-3-20)\n-----------------\n- (Usability) Improved many UI labels.\n- (Usability) Improved folder name of the results folder.\n- (Bugfix) Removed empty folders created by the tool in the workspace.\n- (Bugfix) Corrected text of link to offsets vector in report.\n- (Bugfix) Implemented automatic window sizing.\n- (Usability) Filled in empty UI HelpText bubbles.\n- (Usability) Renamed static map folder inputs to indicate it needs a folder.\n- (Docs) Updated documentation to 1.0.3.\n- (Bugfix) Clarified in report that impact/offset values are unitless unless\n  run on static maps generated by calibrated models.\n- (Bugfix) Paths containing spaces now handled properly in UI.\n- (Feature) If user does not define an AOI, the AOI column is not included in\n  the report.\n- (Feature) Added Table of Contents to the output report.\n- (Usability) Updated labels of Windows Start Menu shortcuts.\n- (Bugfix) Offset parcels are now identified by a new column (\"parcel_id\") in\n  the selected_parcels.shp vector.\n- (Bugfix) If there is only one subzone per zone, we omit the soft boundary 1\n  (subzone) column from the parcels table in the report.\n- (Feature) Sped up initialization of the execution thread in the UI.\n- (Feature) Updated CSS to improve readability of output report tables.\n- (Feature) Added ability to export the parcels table to CSV.\n- (Feature) Binary 1/0 values in report columns are now centered for readability.\n- (Feature) UI now allows user to specify whether to open the workspace after\n  Successful execution.  Once execution completes (regardless of success or\n  failure), the input changes to a button, allowing the user to open the\n  workspace.\n- (Feature) Parcels table in the report now includes a binary column indicating\n  whether each parcel is in the suggested set of parcels.\n- (Feature) Updated InVEST version dependency to use more recent versions of\n  hydrological routing algorithms.\n\n1.0.2 (2015-1-20)\n-----------------\n- OPAL only: forcing the OPAL UI to use English.  This fixes an issue found by\n  users whose default OS language is not English.\n\n1.0.1 (2014-12-16)\n------------------\n- Updated MAFE-T static map UIs to provide correct parameters to OPAL core\n  while retaining MAFE-T's original functionality.\n- Updated MAFE-T UI input validation to reflect name changes for some static inputs.\n- Replaced servicesheds of MAFE-T with a more complete version.\n- Retained older version of servicesheds for use with OPAL.\n- Updated MAFE-T User's guide PDF.\n- Fixed issue with MAFE-T installer where static map zipfiles were not downloaded.\n\n1.0.0 (2014-12-3)\n-----------------\n- Initial public release of OPAL distribution.\n- New features for OPAL:\n  - Offset parcel recommendation that reattributes services to impacted beneficiaries\n  - Support for protection or restoration as a future scenario\n\n0.5.1 (2014-10-13)\n------------------\n- Added zipfile validation to the MAFE-T installer (Issue 3148)\n- MAFE-T installer now remembers selections when switching pages (Issue 3153)\n- Added validation to MAFE-T UI for the impacts vector (Issue 3149)\n\n0.5.0 (2014-10-8)\n-----------------\n- Initial public release of MAFE-T distribution.", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://bitbucket.org/natcap/opal", "keywords": "GIS", "license": "This tool has an open license. All people are invited to use the tool\nunder the following conditions and terms:\n\nCopyright (c) 2015, The Natural Capital Project\n\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n * Redistributions of source code must retain the above copyright\n   notice, this list of conditions and the following disclaimer.\n\n * Redistributions in binary form must reproduce the above copyright\n   notice, this list of conditions and the following disclaimer in the\n   documentation and/or other materials provided with the\n   distribution.\n\n * Neither the name of the Natural Capital Project nor the names of\n   its contributors may be used to endorse or promote products derived\n   from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.", "maintainer": null, "maintainer_email": null, "name": "natcap.opal", "package_url": "https://pypi.org/project/natcap.opal/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/natcap.opal/", "project_urls": {"Download": "UNKNOWN", "Homepage": "https://bitbucket.org/natcap/opal"}, "release_url": "https://pypi.org/project/natcap.opal/1.1.0/", "requires_dist": null, "requires_python": null, "summary": "Decision support tool for mitigating development impacts to ecosystem services", "version": "1.1.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            OPAL: Offset Portfolio Analyzer and Locator<br>===========================================<br><br>A tool by the Natural Capital Project.<br><br>Visit http://naturalcapitalproject.org/OPAL.html for more information.<br><br><br>Changes<br>=======<br><br>1.1.0 (2015-11-12)<br>-----------<br>- (Feature) OPAL now saves a vector to the workspace of those municipalities <br>  (softboundary 3) that intersect the project footprint.  This is only saved<br>  when the softboundary 3 input is provided by the user.<br>- (Bugfix) Corrected an issue where testing future scenarios in the static map <br>  generator would raise an exception.<br>- (Usability) Versioning replaced by `natcap.versioner`<br>- (Usability) OPAL UI is now offered in spanish as well as english.<br>- (Usability) OPAL UI allows for the user to select their language of choice among <br>  those offered (currently english and spanish).<br>- (Feature) OPAL/MAFE-T report and output CSV values are rounded to 3 significant <br>  figures.<br>- (Bufgix) Improved sorting by checkboxes in output report.<br>- (Usability) Improved logging to user within longer-running processes.<br>- (Feature) User's guide is tracked as a subrepository along with each build of<br>  OPAL.  User's guide version numbers are pulled from the OPAL source tree.<br>- (Feature) OPAL/MAFE-T report now includes the OPAL version used and a <br>  time/date stamp.<br>- (Bugfix) The OPAL/MAFE-T report used to offer a hyperlink to the vector<br>  (a multi-part ESRI Shapefile) containing the set of parcels matching <br>  criteria.  Clicking this link would only download part of the file.<br>  It has been replaced with a text reference to the location of the file on <br>  disk.<br>- (Usability) Select all/Select None buttons have been removed from the report.<br>  They didn't work.  They will be added back when they work properly.<br>- (Usability) Files within the workspace that are outside of the per-hydrozone<br>  analysis are now hidden within an intermediate/ folder.<br>- (Usability) Various files have been renamed.<br>- (Bugfix) The headers of the top table of the output report now render in the<br>  language of the OPAL run.  They used to always render in english.<br>- (Bugfix) Parcels in the parcels table of the report are now correctly screened<br>  to ensure that they are at least as large as the smallest impacted area<br>  of the same ecosystem type.<br>- (Usability) The user is now unable to close the OPAL/MAFE-T execution dialog<br>  unless the model run has completed or the process is terminated externally.<br>- (Bugfix) Better handling for when the user provides an ecosystem vector without<br>  any features or when the vector is of the wrong type (points or lines instead<br>  of polygons).<br>- (Usability) When a validated, optional input has its value removed from a UI<br>  input, the green checkbox indicating input validity is now disabled.<br>- (Bugfix) OPAL UI now allows files containing any UTF-8 character to be selected<br>  by the user.<br>- (Feature) Output vector of selected offsets now includes the distance from the <br>  nearest impact site and the parcel size in the attribute table.<br>- (Bugfix) Output report had some columns that were incorrectly rounded to 1 <br>  decimal place instead of 2.<br>- (Usability) OPAL/MAFE-T will now confirm that the user wishes to overwrite the<br>  workspace if files exist within the user-defined workspace.  This dialog<br>  is triggered if the user-defined workspace exists and there are files within.<br>- (Usability) OPAL/MAFE-T will now prompt the user for a language on startup<br>  and remember the user's selection.  The language may be set at any time<br>  through File -&gt; Select Language.  Changing the language will trigger an <br>  application restart.<br><br><br>1.0.3 (2015-3-20)<br>-----------------<br>- (Usability) Improved many UI labels.<br>- (Usability) Improved folder name of the results folder.<br>- (Bugfix) Removed empty folders created by the tool in the workspace.<br>- (Bugfix) Corrected text of link to offsets vector in report.<br>- (Bugfix) Implemented automatic window sizing.<br>- (Usability) Filled in empty UI HelpText bubbles.<br>- (Usability) Renamed static map folder inputs to indicate it needs a folder.<br>- (Docs) Updated documentation to 1.0.3.<br>- (Bugfix) Clarified in report that impact/offset values are unitless unless<br>  run on static maps generated by calibrated models.<br>- (Bugfix) Paths containing spaces now handled properly in UI.<br>- (Feature) If user does not define an AOI, the AOI column is not included in<br>  the report.<br>- (Feature) Added Table of Contents to the output report.<br>- (Usability) Updated labels of Windows Start Menu shortcuts.<br>- (Bugfix) Offset parcels are now identified by a new column (\"parcel_id\") in<br>  the selected_parcels.shp vector.<br>- (Bugfix) If there is only one subzone per zone, we omit the soft boundary 1<br>  (subzone) column from the parcels table in the report.<br>- (Feature) Sped up initialization of the execution thread in the UI.<br>- (Feature) Updated CSS to improve readability of output report tables.<br>- (Feature) Added ability to export the parcels table to CSV.<br>- (Feature) Binary 1/0 values in report columns are now centered for readability.<br>- (Feature) UI now allows user to specify whether to open the workspace after<br>  Successful execution.  Once execution completes (regardless of success or<br>  failure), the input changes to a button, allowing the user to open the<br>  workspace.<br>- (Feature) Parcels table in the report now includes a binary column indicating<br>  whether each parcel is in the suggested set of parcels.<br>- (Feature) Updated InVEST version dependency to use more recent versions of<br>  hydrological routing algorithms.<br><br>1.0.2 (2015-1-20)<br>-----------------<br>- OPAL only: forcing the OPAL UI to use English.  This fixes an issue found by<br>  users whose default OS language is not English.<br><br>1.0.1 (2014-12-16)<br>------------------<br>- Updated MAFE-T static map UIs to provide correct parameters to OPAL core<br>  while retaining MAFE-T's original functionality.<br>- Updated MAFE-T UI input validation to reflect name changes for some static inputs.<br>- Replaced servicesheds of MAFE-T with a more complete version.<br>- Retained older version of servicesheds for use with OPAL.<br>- Updated MAFE-T User's guide PDF.<br>- Fixed issue with MAFE-T installer where static map zipfiles were not downloaded.<br><br>1.0.0 (2014-12-3)<br>-----------------<br>- Initial public release of OPAL distribution.<br>- New features for OPAL:<br>  - Offset parcel recommendation that reattributes services to impacted beneficiaries<br>  - Support for protection or restoration as a future scenario<br><br>0.5.1 (2014-10-13)<br>------------------<br>- Added zipfile validation to the MAFE-T installer (Issue 3148)<br>- MAFE-T installer now remembers selections when switching pages (Issue 3153)<br>- Added validation to MAFE-T UI for the impacts vector (Issue 3149)<br><br>0.5.0 (2014-10-8)<br>-----------------<br>- Initial public release of MAFE-T distribution.\n          </div>"}, "last_serial": 2027294, "releases": {"1.1.0": [{"comment_text": "", "digests": {"md5": "1a00a42099ce632c278c1b13f0da02b6", "sha256": "ce31d97ceef2ada3d8ef9004761888d9cb49d5545ad110a1cde02a1d86ad5b8a"}, "downloads": -1, "filename": "natcap.opal-1.1.0-py2-none-any.whl", "has_sig": false, "md5_digest": "1a00a42099ce632c278c1b13f0da02b6", "packagetype": "bdist_wheel", "python_version": "2.7", "requires_python": null, "size": 175208, "upload_time": "2015-11-12T23:31:00", "upload_time_iso_8601": "2015-11-12T23:31:00.394824Z", "url": "https://files.pythonhosted.org/packages/7a/64/b56ef9cff8d2513d9bd6205a1ed349f1651100992bb997f87fe59ecb159e/natcap.opal-1.1.0-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "8f17714df45e6a697dfdbd629b04d1d5", "sha256": "17695d1cf216c1ea2057e61ec9e892c7d5f190e139620b54092cc8591815f7f6"}, "downloads": -1, "filename": "natcap.opal-1.1.0.tar.gz", "has_sig": false, "md5_digest": "8f17714df45e6a697dfdbd629b04d1d5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 170224, "upload_time": "2015-11-12T23:30:48", "upload_time_iso_8601": "2015-11-12T23:30:48.517014Z", "url": "https://files.pythonhosted.org/packages/c8/70/eb096e8b175ba6f67939b1570c0164bf14e19bd00d98950234f86f019dc9/natcap.opal-1.1.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "1a00a42099ce632c278c1b13f0da02b6", "sha256": "ce31d97ceef2ada3d8ef9004761888d9cb49d5545ad110a1cde02a1d86ad5b8a"}, "downloads": -1, "filename": "natcap.opal-1.1.0-py2-none-any.whl", "has_sig": false, "md5_digest": "1a00a42099ce632c278c1b13f0da02b6", "packagetype": "bdist_wheel", "python_version": "2.7", "requires_python": null, "size": 175208, "upload_time": "2015-11-12T23:31:00", "upload_time_iso_8601": "2015-11-12T23:31:00.394824Z", "url": "https://files.pythonhosted.org/packages/7a/64/b56ef9cff8d2513d9bd6205a1ed349f1651100992bb997f87fe59ecb159e/natcap.opal-1.1.0-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "8f17714df45e6a697dfdbd629b04d1d5", "sha256": "17695d1cf216c1ea2057e61ec9e892c7d5f190e139620b54092cc8591815f7f6"}, "downloads": -1, "filename": "natcap.opal-1.1.0.tar.gz", "has_sig": false, "md5_digest": "8f17714df45e6a697dfdbd629b04d1d5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 170224, "upload_time": "2015-11-12T23:30:48", "upload_time_iso_8601": "2015-11-12T23:30:48.517014Z", "url": "https://files.pythonhosted.org/packages/c8/70/eb096e8b175ba6f67939b1570c0164bf14e19bd00d98950234f86f019dc9/natcap.opal-1.1.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:47:23 2020"}