{"info": {"author": "http://github.com/Pebaz", "author_email": "", "bugtrack_url": null, "classifiers": [], "description": "<p align=\"center\"><img width=200px src=\"https://raw.githubusercontent.com/Pebaz/Nimporter/master/nimporter-logo.png\"></p>\n\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\n![License](https://img.shields.io/github/license/Pebaz/Nimporter)\n![Version](https://img.shields.io/pypi/v/nimporter)\n![Downloads each Month](https://img.shields.io/pypi/dm/Nimporter)\n![Wheel Supported](https://img.shields.io/pypi/wheel/Nimporter)\n\n# Nimporter\n\nCompile [Nim](<https://nim-lang.org/>) extensions for Python on import automatically!\n\n## What is Nimporter\n\n> With Nimporter, you can simply import Nim source code files *as if they\nwere Python modules*, and use them seamlessly with Python code.\n\n## Possible Benefits\n\n * Performance: Nim compiles to C\n * Reduce cloud computing costs without writing C\n * Leverage both language's ecosystems: [Python](https://pypi.org/) for breadth,\n [Nim](https://nimble.directory/) for performance.\n * Seamless integration with existing Nim code by using the\n   [Nimpy](https://github.com/yglukhov/nimpy) library.\n * Very low effort to create high-performance Python extensions using Nim.\n * 100% transparent to end users (doesn't require Nim compiler).\n\n## Installation\n\n```bash\n$ pip install nimporter\n```\n\nDependencies:\n\n 1. [Nim Compiler](<https://nim-lang.org/install.html>) (for compiling Nim\n source files)\n 2. [Nimpy library](https://github.com/yglukhov/nimpy) (Installed automatically)\n 3. [Nimporter library](https://github.com/Pebaz/nimporter) (distributed\n libraries will need access to Nimporter).\n\nNimporter can work seamlessly when Nim is installed via\n[Choosenim](https://nim-lang.org/install_unix.html#installation-using-choosenim)\nor manually. No additional configuration is necessary once installed since\nNimporter can find the Nim standard library and install\n[Nimpy library](https://github.com/yglukhov/nimpy) if Nimble is on your path.\n\n## About\n\nNimporter provides an official way to develop applications and libraries that\nmake use of Nim code for achieving higher performance.\n\nIt does this by providing a way to directly import Nim code and have it be\ncompiled at runtime. However, unlink Cython, this will not proliferate your\ndevelopment environment and require adding bunches of exceptions to your\n`.gitignore` file.\n\nAll artifacts are stored in their respective `__pycache__` directories. Builds\nare cached so that subsequent imports do not trigger a rebuild.\n\nNimporter allows you to treat Nim files exactly like Python modules. This means\nthat namespacing is maintained for package heirarchies.\n\nHere is a quick example of how to directly import Nim code:\n\n**nim_math.nim**\n\n```nim\nimport nimpy\n\nproc add(a: int, b: int): int {.exportpy.} =\n    return a + b\n```\n\n**Python file in same directory**\n\n```python\n# Nimporter is needed prior to importing any Nim code\nimport nimporter, nim_math\n\nprint(nim_math.add(2, 4))  # 6\n```\n\nDoes Nimporter support single-file Nim modules only? No, Nimporter allows you to\ntreat an entire Nim project as a single module. The project must contain a\n`.nimble` file that is used to build the project into a single library. Since\n`.nimble` files are supported, this means that they can rely on Nim dependencies\nand still be imported and compiled at runtime.\n\nHave a complex build requirement that would normally entail tweaking Nim\ncompiler switches for each supported platform? Nimporter fully supports adding a\n`switches.py` file for libraries that need to customize the CLI flags for any\nplatform seamlessly for both developing and bundling extensions.\n\nSince Nimporter relies on [Nimpy](https://github.com/yglukhov/nimpy) for Nim <->\nPython interaction, it is a required dependency during development for every\nmodule and library. Nimporter ensures that this is installed prior to every\ncompilation so that users do not have a separate `nimble install nimpy` step.\n\nAdditionally, for users who do not have access or are not interested in\ninstalling a Nim compiler, Nimporter makes distribution effortless.\n\nAfter creating an entire project with many Python and Nim modules/libraries in a\ndeeply-nested package heirarchy, Nimporter allows you to bundle all of this into\na single wheel just as you would with Python.\n\nTo do this, you need to add a single line to your `setup.py`:\n\n```python\nfrom setuptools import setup\nimport nimporter\n\nsetup(\n    ...,\n\n    # This is all the effort required to bundle all Nim modules/libraries\n    ext_modules=nimporter.build_nim_extensions()\n)\n```\n\n> Please note that the official distribution mechanism only requires a single\nline of code.\n\nAdditionally, all namespaces are preserved in the built extensions and end-users\ncan merely install the resulting wheel containing the binary artifacts without\ncompiling on the target machine.\n\nIn summary, Nimporter is a library that allows you to use Nim along with Python\neffortlessly by exposing two very simple APIs:\n\n```python\nimport nimporter  # Required prior to any Nim module import\n\n# 1. Import Nim code directly\nimport my_nim_module\n\n# 2. Find, build, and bundle all Nim extensions automatically\nnimporter.build_nim_extensions()\n```\n\n*How much simpler could it possibly get?*\n\n## Documentation\n\nFor tutorials, advanced usage, and more, head over to the\n[Wiki](<https://github.com/Pebaz/nimporter/wiki>).\n\nGenerated documentation can be found\n[here](https://pebaz.github.io/nimporter/index.html).\n\nFor a bunch of little examples, look in the `examples/` directory. For more\nrigorous examples testing every feature of Nimporter, you can take a look at the\nfiles within the `tests/` directory.\n\n## Distributing Libraries Using Nimporter\n\nNimporter supports two methods of distribution:\n\n* Source\n* Binary (Wheel)\n\nIf your library makes use of Nimporter for integrating Nim code, you will need\nto include it with your dependency list. Even for binary distributions which\ncompile each extension to prevent compilation on the end-users machine.\n\n### Binary Distributions\n\nBinary (wheel) distributions allow you to forego compilation of Nim source files\non the end user's machine. This has enormous benefit and can be accomplished\nvery easily by adding the following line to your `setup.py` file:\n\n```python\n...\nimport nimporter\n\nsetup(\n    ...,                                          # Keep your existing arguments\n    ext_modules=nimporter.build_nim_extensions()  # Recurse+build Nim extensions\n)\n```\n\nTo create the binary distribution:\n\n```bash\n$ python setup.py bdist_wheel\n```\n\nWhen installing via Pip, the appropriate wheel version will be selected,\ndownloaded, and installed, all without requiring users to install a Nim\ncompiler.\n\n> Special note for Linux users: Unfortunately, PyPi will not allow you to upload\njust any Linux wheel. There is a special compilation process that can be\nexplained [here](https://github.com/pypa/manylinux). Interestingly enough, I got\naround this by simply renaming the resulting Linux build according to the\n**manylinux1** naming convention. You can see my solution in the\n`examples/github_actions_template.yml` file for the `build-linux` job. I expect\nthat there could be many downsides of using this hack but it worked for me on 2\ndifferent Linux platforms.\n\n### Source Distributions\n\nSource distributions allow users to bundle Nim files so that end-users can\ncompile them upon import just how they would during normal development.\n\nThe only supported way of providing a source distribution is to bundle the Nim\nfiles along with the Python source files.\n\nTo do this, add these lines to your `setup.py` file:\n\n```python\nsetup(\n    ...,                            # Keep your existing arguments\n    package_data={'': ['*.nim']},   # Distribute Nim source files\n    include_package_data=True,\n    install_requires=['nimporter']  # Depends upon Nimporter\n)\n```\n\nTo create the source distribution:\n\n```bash\n$ python setup.py sdist\n```\n\nWhen installing via Pip and a binary distribution (wheel) cannot be found for a\ngiven platform, the source distribution will be installed which will include the\nbundled Nim source files. When the library is imported on the end-users's\nmachine, Nimporter compiles all of the Nim files as they are imported\ninternally which will cause a small delay to account for compilation. When the\nlibrary is subsequently imported, no compilation is necessary so imports are\nextremely fast.\n\n### Publish Build Artifacts to PyPi Automatically\n\nSince binary distributions allow Nimporter libraries to be distributed without\nrequiring a Nim compiler, they are the recommended packaging type. However,\nbuilding for each platform can be tedious.\n\nFor a dead-simple way to publish Windows, MacOS, and Linux wheels to PyPi\nautomatically, use the `github_actions_template.yml` template found in the\n`examples/` directory. This template integrates with your repository's GitHub\nActions runner to build, package, and deploy your library on Windows, MacOS, and\nLinux automatically when you create a new \"Release\" is created.\n\n## Nimporter Command Line Interface\n\nNimporter provides a CLI that you can use to easily clean all cached build and\nhash files from your project recursively. This can be very useful for debugging\nsituations arising from stale builds.\n\nUsage example:\n\n```bash\n# Recursively removes all hashes and cached builds\n$ nimporter clean\n```\n\nAdditionally, the CLI can also be used like a compiler to produce a binary\nextension (`.pyd` and `.so`) from a given Nim file.\n\n```bash\n# Stores build in __pycache__\n# Can be imported by first importing nimporter\n$ nimporter build file.nim\n\n# Stores build in current dir\n$ nimporter build file.nim --dest .\n\n# Same 2 examples but for Nim libraries\n$ nimporter build mylib\n$ nimporter build mylib --dest .\n\n# Although you can specify a Nim library's source file, please don't\n$ nimporter build mylib/mylib.nim\n```\n\nFinally, the CLI has provisions for quickly bundling your project into a source\nor binary distribution:\n\n```bash\n# Bundles your code into a wheel (look in dist/)\n$ nimporter bundle bin\n\n# Bundles your code into a source archive (look in dist/)\n$ nimporter bundle src\n```\n\nIf you do not have a `setup.py` in your current directory, the CLI will generate\none for you but you will have to edit it to make sure that all of your code is\nincluded in the resulting package. You can look\n[here](https://github.com/navdeep-G/setup.py) for an excellent tutorial on how\nto use `setup.py`.\n\n## Code Quality\n\nThere are ***44 unit tests*** and ***5 integration tests*** to make sure that\nNimporter performs as advertised.\n\nIn addition, Nimporter has ***94% code coverage*** so a host of bugs have already been\ncaught and dealt with in a manner befitting their wretched existence.\n\nLastly, it has been tested and fully supported on these platforms:\n\n* **Windows 10**\n* **MacOS Mojave**\n* **Linux**\n\n> Just for fun, I got out my Windows laptop, Mac, and SSHed into a Linux box on\nAWS. I then ran the test suite on all 3 platforms simultaneously. ;)\n\nNimporter likely works on a bunch of other platforms but I cannot justify the\ntime required to test them at this point.\n\n### Running The Tests\n\nTo run these on your local machine, you will need to install a Nim compiler.\n\nThis example will assume you are cloning the GitHub reposotory.\n\n```bash\n$ git clone https://github.com/Pebaz/Nimporter\n$ cd Nimporter\n$ pip install -r requirements.txt\n$ pip install .  # Nimporter is needed for the integration tests\n$ pytest --cov=. --cov-report=html tests\n```\n\n## How Does Nimporter Work?\n\nNimporter provides essentially two capabilities:\n\n* The ability to directly import Nim code\n* The ability to bundle Python-compatible extensions for any supported platform\n\nThe way it accomplishes the ability to import Nim code is by adding two custom\nimporters to the Python import machinery. This is why it is required to import\nNimporter before importing any Nim code because the Python import machinery must\nbe amended with the custom importers.\n\nThe first one is for the ability to search and import Nim modules. When a Nim\nmodule is found, Nimporter first looks in the `__pycache__` directory to see if\nthere is already a built version of the module. If there is not, it builds a new\none and stores it in the `__pycache__` directory.\n\nIf one is found, it could be stale meaning the Nim file could have been modified\nsince it was built. To keep track of this, a hash of the source file is also\nkept in the `__pycache__` directory and is consulted whenever there is a\npossibility that a stale build could be imported.\n\nWhen a Nim module and a Python module have the same name and reside in the same\nfolder, the Python module is given precedence. *Please don't do this.*\n\nThe second custom importer has the exact same purpose of the first one except it\nis used to import Nim extension libraries. A library is any folder within a\nPython project that contains a `<lib name>.nim` and a `<lib name>.nimble` file.\n\nThese files mark that the folder should be treated as one unit. It also makes it\nso that Nimble dependencies can be installed.\n\nAs for the second capability, Nimporter helps you bundle and distribute Nim code\nas part of a binary distribution extremely easily.\n\nThe way it works is by iterating through your entire project and identifying any\nNim module and Nim library that it finds and compiling them to C using a feature\nof Nim that specifically supports this.\n\nWhy compile to C? Because Python already has extensive infrastructure to support\nthe compilation and distribution of C extensions.\n\nOnce each Nim module and library is compiled to C, Python deals with them the\nexact same way as a typical C extension. These extensions are then bundled into\nthe resulting binary distribution and can be uploaded to PyPi or similar.\n\nAre source distributions supported? Yes and no. They are officially supported\nfor bundling the Nim source files themselves into the archive, but not the C\nsource files. Although the C source files would be a better alternative, the C\nfiles generated by Nim are platform specific, so they would only be of use to\nusers on the same exact platform and architecture. This is why the official way\nof distributing Nimporter libraries is by creating binary wheels.\n\n## State Of The Project\n\nI have implemented all of the features that I wanted to add at this time. I made\nsure to validate the effectiveness of each feature with the unit and integration\ntests. This project should be considered \"done\" and will receive no further\nenhancements except for bug fixes and patches. You can submit a bug report on\nNimporter's [GitHub Issues](https://github.com/Pebaz/nimporter/issues) page.\n\n## Contributing\n\nAlthough I would not seek to add any new features to Nimporter, there may exist\ncertain modifications that would enhance the effectiveness of Nimporter's core\nfeatures. Pull requests are welcome, especially for fixing bugs.\n\n## Special Thanks\n\nNimporter would not be possible without\n[Nimpy](https://github.com/yglukhov/nimpy). Thank you\n[Yuriy Glukhov](https://github.com/yglukhov) for making this project possible!\n\n## Stargazers Over Time\n\n[![Stargazers Over Time](https://starchart.cc/Pebaz/nimporter.svg)](https://starchart.cc/Pebaz/nimporter)\n\n> Made using <https://starchart.cc/>", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://github.com/Pebaz/Nimporter", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "nimporter", "package_url": "https://pypi.org/project/nimporter/", "platform": "", "project_url": "https://pypi.org/project/nimporter/", "project_urls": {"Homepage": "http://github.com/Pebaz/Nimporter"}, "release_url": "https://pypi.org/project/nimporter/1.0.1/", "requires_dist": null, "requires_python": "", "summary": "Compile Nim extensions for Python when imported!", "version": "1.0.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p align=\"center\"><img src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/062ae18d13cb2e5a08f3ed99a45d166774bb8892/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f506562617a2f4e696d706f727465722f6d61737465722f6e696d706f727465722d6c6f676f2e706e67\" width=\"200px\"></p>\n<p>                                                         \n<img alt=\"License\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/191152adb8ad8415f05eb2ffdbc26994d1237a22/68747470733a2f2f696d672e736869656c64732e696f2f6769746875622f6c6963656e73652f506562617a2f4e696d706f72746572\">\n<img alt=\"Version\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/419888a2c2539db83c70dd25d25880f096930894/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f6e696d706f72746572\">\n<img alt=\"Downloads each Month\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/fc1f43d0c35611bc7eedcf8460571e0dde0a0005/68747470733a2f2f696d672e736869656c64732e696f2f707970692f646d2f4e696d706f72746572\">\n<img alt=\"Wheel Supported\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/03f4e0ba30a7083c2975909b4a72fec750ddcd0d/68747470733a2f2f696d672e736869656c64732e696f2f707970692f776865656c2f4e696d706f72746572\"></p>\n<h1>Nimporter</h1>\n<p>Compile <a href=\"https://nim-lang.org/\" rel=\"nofollow\">Nim</a> extensions for Python on import automatically!</p>\n<h2>What is Nimporter</h2>\n<blockquote>\n<p>With Nimporter, you can simply import Nim source code files <em>as if they\nwere Python modules</em>, and use them seamlessly with Python code.</p>\n</blockquote>\n<h2>Possible Benefits</h2>\n<ul>\n<li>Performance: Nim compiles to C</li>\n<li>Reduce cloud computing costs without writing C</li>\n<li>Leverage both language's ecosystems: <a href=\"https://pypi.org/\" rel=\"nofollow\">Python</a> for breadth,\n<a href=\"https://nimble.directory/\" rel=\"nofollow\">Nim</a> for performance.</li>\n<li>Seamless integration with existing Nim code by using the\n<a href=\"https://github.com/yglukhov/nimpy\" rel=\"nofollow\">Nimpy</a> library.</li>\n<li>Very low effort to create high-performance Python extensions using Nim.</li>\n<li>100% transparent to end users (doesn't require Nim compiler).</li>\n</ul>\n<h2>Installation</h2>\n<pre>$ pip install nimporter\n</pre>\n<p>Dependencies:</p>\n<ol>\n<li><a href=\"https://nim-lang.org/install.html\" rel=\"nofollow\">Nim Compiler</a> (for compiling Nim\nsource files)</li>\n<li><a href=\"https://github.com/yglukhov/nimpy\" rel=\"nofollow\">Nimpy library</a> (Installed automatically)</li>\n<li><a href=\"https://github.com/Pebaz/nimporter\" rel=\"nofollow\">Nimporter library</a> (distributed\nlibraries will need access to Nimporter).</li>\n</ol>\n<p>Nimporter can work seamlessly when Nim is installed via\n<a href=\"https://nim-lang.org/install_unix.html#installation-using-choosenim\" rel=\"nofollow\">Choosenim</a>\nor manually. No additional configuration is necessary once installed since\nNimporter can find the Nim standard library and install\n<a href=\"https://github.com/yglukhov/nimpy\" rel=\"nofollow\">Nimpy library</a> if Nimble is on your path.</p>\n<h2>About</h2>\n<p>Nimporter provides an official way to develop applications and libraries that\nmake use of Nim code for achieving higher performance.</p>\n<p>It does this by providing a way to directly import Nim code and have it be\ncompiled at runtime. However, unlink Cython, this will not proliferate your\ndevelopment environment and require adding bunches of exceptions to your\n<code>.gitignore</code> file.</p>\n<p>All artifacts are stored in their respective <code>__pycache__</code> directories. Builds\nare cached so that subsequent imports do not trigger a rebuild.</p>\n<p>Nimporter allows you to treat Nim files exactly like Python modules. This means\nthat namespacing is maintained for package heirarchies.</p>\n<p>Here is a quick example of how to directly import Nim code:</p>\n<p><strong>nim_math.nim</strong></p>\n<pre><span class=\"kn\">import</span> <span class=\"n\">nimpy</span>\n\n<span class=\"k\">proc </span><span class=\"nf\">add</span><span class=\"p\">(</span><span class=\"n\">a</span><span class=\"p\">:</span> <span class=\"kt\">int</span><span class=\"p\">,</span> <span class=\"n\">b</span><span class=\"p\">:</span> <span class=\"kt\">int</span><span class=\"p\">):</span> <span class=\"kt\">int</span> <span class=\"p\">{.</span><span class=\"n\">exportpy</span><span class=\"p\">.}</span> <span class=\"o\">=</span>\n    <span class=\"k\">return</span> <span class=\"n\">a</span> <span class=\"o\">+</span> <span class=\"n\">b</span>\n</pre>\n<p><strong>Python file in same directory</strong></p>\n<pre><span class=\"c1\"># Nimporter is needed prior to importing any Nim code</span>\n<span class=\"kn\">import</span> <span class=\"nn\">nimporter</span><span class=\"o\">,</span> <span class=\"nn\">nim_math</span>\n\n<span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">nim_math</span><span class=\"o\">.</span><span class=\"n\">add</span><span class=\"p\">(</span><span class=\"mi\">2</span><span class=\"p\">,</span> <span class=\"mi\">4</span><span class=\"p\">))</span>  <span class=\"c1\"># 6</span>\n</pre>\n<p>Does Nimporter support single-file Nim modules only? No, Nimporter allows you to\ntreat an entire Nim project as a single module. The project must contain a\n<code>.nimble</code> file that is used to build the project into a single library. Since\n<code>.nimble</code> files are supported, this means that they can rely on Nim dependencies\nand still be imported and compiled at runtime.</p>\n<p>Have a complex build requirement that would normally entail tweaking Nim\ncompiler switches for each supported platform? Nimporter fully supports adding a\n<code>switches.py</code> file for libraries that need to customize the CLI flags for any\nplatform seamlessly for both developing and bundling extensions.</p>\n<p>Since Nimporter relies on <a href=\"https://github.com/yglukhov/nimpy\" rel=\"nofollow\">Nimpy</a> for Nim &lt;-&gt;\nPython interaction, it is a required dependency during development for every\nmodule and library. Nimporter ensures that this is installed prior to every\ncompilation so that users do not have a separate <code>nimble install nimpy</code> step.</p>\n<p>Additionally, for users who do not have access or are not interested in\ninstalling a Nim compiler, Nimporter makes distribution effortless.</p>\n<p>After creating an entire project with many Python and Nim modules/libraries in a\ndeeply-nested package heirarchy, Nimporter allows you to bundle all of this into\na single wheel just as you would with Python.</p>\n<p>To do this, you need to add a single line to your <code>setup.py</code>:</p>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">setuptools</span> <span class=\"kn\">import</span> <span class=\"n\">setup</span>\n<span class=\"kn\">import</span> <span class=\"nn\">nimporter</span>\n\n<span class=\"n\">setup</span><span class=\"p\">(</span>\n    <span class=\"o\">...</span><span class=\"p\">,</span>\n\n    <span class=\"c1\"># This is all the effort required to bundle all Nim modules/libraries</span>\n    <span class=\"n\">ext_modules</span><span class=\"o\">=</span><span class=\"n\">nimporter</span><span class=\"o\">.</span><span class=\"n\">build_nim_extensions</span><span class=\"p\">()</span>\n<span class=\"p\">)</span>\n</pre>\n<blockquote>\n<p>Please note that the official distribution mechanism only requires a single\nline of code.</p>\n</blockquote>\n<p>Additionally, all namespaces are preserved in the built extensions and end-users\ncan merely install the resulting wheel containing the binary artifacts without\ncompiling on the target machine.</p>\n<p>In summary, Nimporter is a library that allows you to use Nim along with Python\neffortlessly by exposing two very simple APIs:</p>\n<pre><span class=\"kn\">import</span> <span class=\"nn\">nimporter</span>  <span class=\"c1\"># Required prior to any Nim module import</span>\n\n<span class=\"c1\"># 1. Import Nim code directly</span>\n<span class=\"kn\">import</span> <span class=\"nn\">my_nim_module</span>\n\n<span class=\"c1\"># 2. Find, build, and bundle all Nim extensions automatically</span>\n<span class=\"n\">nimporter</span><span class=\"o\">.</span><span class=\"n\">build_nim_extensions</span><span class=\"p\">()</span>\n</pre>\n<p><em>How much simpler could it possibly get?</em></p>\n<h2>Documentation</h2>\n<p>For tutorials, advanced usage, and more, head over to the\n<a href=\"https://github.com/Pebaz/nimporter/wiki\" rel=\"nofollow\">Wiki</a>.</p>\n<p>Generated documentation can be found\n<a href=\"https://pebaz.github.io/nimporter/index.html\" rel=\"nofollow\">here</a>.</p>\n<p>For a bunch of little examples, look in the <code>examples/</code> directory. For more\nrigorous examples testing every feature of Nimporter, you can take a look at the\nfiles within the <code>tests/</code> directory.</p>\n<h2>Distributing Libraries Using Nimporter</h2>\n<p>Nimporter supports two methods of distribution:</p>\n<ul>\n<li>Source</li>\n<li>Binary (Wheel)</li>\n</ul>\n<p>If your library makes use of Nimporter for integrating Nim code, you will need\nto include it with your dependency list. Even for binary distributions which\ncompile each extension to prevent compilation on the end-users machine.</p>\n<h3>Binary Distributions</h3>\n<p>Binary (wheel) distributions allow you to forego compilation of Nim source files\non the end user's machine. This has enormous benefit and can be accomplished\nvery easily by adding the following line to your <code>setup.py</code> file:</p>\n<pre><span class=\"o\">...</span>\n<span class=\"kn\">import</span> <span class=\"nn\">nimporter</span>\n\n<span class=\"n\">setup</span><span class=\"p\">(</span>\n    <span class=\"o\">...</span><span class=\"p\">,</span>                                          <span class=\"c1\"># Keep your existing arguments</span>\n    <span class=\"n\">ext_modules</span><span class=\"o\">=</span><span class=\"n\">nimporter</span><span class=\"o\">.</span><span class=\"n\">build_nim_extensions</span><span class=\"p\">()</span>  <span class=\"c1\"># Recurse+build Nim extensions</span>\n<span class=\"p\">)</span>\n</pre>\n<p>To create the binary distribution:</p>\n<pre>$ python setup.py bdist_wheel\n</pre>\n<p>When installing via Pip, the appropriate wheel version will be selected,\ndownloaded, and installed, all without requiring users to install a Nim\ncompiler.</p>\n<blockquote>\n<p>Special note for Linux users: Unfortunately, PyPi will not allow you to upload\njust any Linux wheel. There is a special compilation process that can be\nexplained <a href=\"https://github.com/pypa/manylinux\" rel=\"nofollow\">here</a>. Interestingly enough, I got\naround this by simply renaming the resulting Linux build according to the\n<strong>manylinux1</strong> naming convention. You can see my solution in the\n<code>examples/github_actions_template.yml</code> file for the <code>build-linux</code> job. I expect\nthat there could be many downsides of using this hack but it worked for me on 2\ndifferent Linux platforms.</p>\n</blockquote>\n<h3>Source Distributions</h3>\n<p>Source distributions allow users to bundle Nim files so that end-users can\ncompile them upon import just how they would during normal development.</p>\n<p>The only supported way of providing a source distribution is to bundle the Nim\nfiles along with the Python source files.</p>\n<p>To do this, add these lines to your <code>setup.py</code> file:</p>\n<pre><span class=\"n\">setup</span><span class=\"p\">(</span>\n    <span class=\"o\">...</span><span class=\"p\">,</span>                            <span class=\"c1\"># Keep your existing arguments</span>\n    <span class=\"n\">package_data</span><span class=\"o\">=</span><span class=\"p\">{</span><span class=\"s1\">''</span><span class=\"p\">:</span> <span class=\"p\">[</span><span class=\"s1\">'*.nim'</span><span class=\"p\">]},</span>   <span class=\"c1\"># Distribute Nim source files</span>\n    <span class=\"n\">include_package_data</span><span class=\"o\">=</span><span class=\"kc\">True</span><span class=\"p\">,</span>\n    <span class=\"n\">install_requires</span><span class=\"o\">=</span><span class=\"p\">[</span><span class=\"s1\">'nimporter'</span><span class=\"p\">]</span>  <span class=\"c1\"># Depends upon Nimporter</span>\n<span class=\"p\">)</span>\n</pre>\n<p>To create the source distribution:</p>\n<pre>$ python setup.py sdist\n</pre>\n<p>When installing via Pip and a binary distribution (wheel) cannot be found for a\ngiven platform, the source distribution will be installed which will include the\nbundled Nim source files. When the library is imported on the end-users's\nmachine, Nimporter compiles all of the Nim files as they are imported\ninternally which will cause a small delay to account for compilation. When the\nlibrary is subsequently imported, no compilation is necessary so imports are\nextremely fast.</p>\n<h3>Publish Build Artifacts to PyPi Automatically</h3>\n<p>Since binary distributions allow Nimporter libraries to be distributed without\nrequiring a Nim compiler, they are the recommended packaging type. However,\nbuilding for each platform can be tedious.</p>\n<p>For a dead-simple way to publish Windows, MacOS, and Linux wheels to PyPi\nautomatically, use the <code>github_actions_template.yml</code> template found in the\n<code>examples/</code> directory. This template integrates with your repository's GitHub\nActions runner to build, package, and deploy your library on Windows, MacOS, and\nLinux automatically when you create a new \"Release\" is created.</p>\n<h2>Nimporter Command Line Interface</h2>\n<p>Nimporter provides a CLI that you can use to easily clean all cached build and\nhash files from your project recursively. This can be very useful for debugging\nsituations arising from stale builds.</p>\n<p>Usage example:</p>\n<pre><span class=\"c1\"># Recursively removes all hashes and cached builds</span>\n$ nimporter clean\n</pre>\n<p>Additionally, the CLI can also be used like a compiler to produce a binary\nextension (<code>.pyd</code> and <code>.so</code>) from a given Nim file.</p>\n<pre><span class=\"c1\"># Stores build in __pycache__</span>\n<span class=\"c1\"># Can be imported by first importing nimporter</span>\n$ nimporter build file.nim\n\n<span class=\"c1\"># Stores build in current dir</span>\n$ nimporter build file.nim --dest .\n\n<span class=\"c1\"># Same 2 examples but for Nim libraries</span>\n$ nimporter build mylib\n$ nimporter build mylib --dest .\n\n<span class=\"c1\"># Although you can specify a Nim library's source file, please don't</span>\n$ nimporter build mylib/mylib.nim\n</pre>\n<p>Finally, the CLI has provisions for quickly bundling your project into a source\nor binary distribution:</p>\n<pre><span class=\"c1\"># Bundles your code into a wheel (look in dist/)</span>\n$ nimporter bundle bin\n\n<span class=\"c1\"># Bundles your code into a source archive (look in dist/)</span>\n$ nimporter bundle src\n</pre>\n<p>If you do not have a <code>setup.py</code> in your current directory, the CLI will generate\none for you but you will have to edit it to make sure that all of your code is\nincluded in the resulting package. You can look\n<a href=\"https://github.com/navdeep-G/setup.py\" rel=\"nofollow\">here</a> for an excellent tutorial on how\nto use <code>setup.py</code>.</p>\n<h2>Code Quality</h2>\n<p>There are <em><strong>44 unit tests</strong></em> and <em><strong>5 integration tests</strong></em> to make sure that\nNimporter performs as advertised.</p>\n<p>In addition, Nimporter has <em><strong>94% code coverage</strong></em> so a host of bugs have already been\ncaught and dealt with in a manner befitting their wretched existence.</p>\n<p>Lastly, it has been tested and fully supported on these platforms:</p>\n<ul>\n<li><strong>Windows 10</strong></li>\n<li><strong>MacOS Mojave</strong></li>\n<li><strong>Linux</strong></li>\n</ul>\n<blockquote>\n<p>Just for fun, I got out my Windows laptop, Mac, and SSHed into a Linux box on\nAWS. I then ran the test suite on all 3 platforms simultaneously. ;)</p>\n</blockquote>\n<p>Nimporter likely works on a bunch of other platforms but I cannot justify the\ntime required to test them at this point.</p>\n<h3>Running The Tests</h3>\n<p>To run these on your local machine, you will need to install a Nim compiler.</p>\n<p>This example will assume you are cloning the GitHub reposotory.</p>\n<pre>$ git clone https://github.com/Pebaz/Nimporter\n$ <span class=\"nb\">cd</span> Nimporter\n$ pip install -r requirements.txt\n$ pip install .  <span class=\"c1\"># Nimporter is needed for the integration tests</span>\n$ pytest --cov<span class=\"o\">=</span>. --cov-report<span class=\"o\">=</span>html tests\n</pre>\n<h2>How Does Nimporter Work?</h2>\n<p>Nimporter provides essentially two capabilities:</p>\n<ul>\n<li>The ability to directly import Nim code</li>\n<li>The ability to bundle Python-compatible extensions for any supported platform</li>\n</ul>\n<p>The way it accomplishes the ability to import Nim code is by adding two custom\nimporters to the Python import machinery. This is why it is required to import\nNimporter before importing any Nim code because the Python import machinery must\nbe amended with the custom importers.</p>\n<p>The first one is for the ability to search and import Nim modules. When a Nim\nmodule is found, Nimporter first looks in the <code>__pycache__</code> directory to see if\nthere is already a built version of the module. If there is not, it builds a new\none and stores it in the <code>__pycache__</code> directory.</p>\n<p>If one is found, it could be stale meaning the Nim file could have been modified\nsince it was built. To keep track of this, a hash of the source file is also\nkept in the <code>__pycache__</code> directory and is consulted whenever there is a\npossibility that a stale build could be imported.</p>\n<p>When a Nim module and a Python module have the same name and reside in the same\nfolder, the Python module is given precedence. <em>Please don't do this.</em></p>\n<p>The second custom importer has the exact same purpose of the first one except it\nis used to import Nim extension libraries. A library is any folder within a\nPython project that contains a <code>&lt;lib name&gt;.nim</code> and a <code>&lt;lib name&gt;.nimble</code> file.</p>\n<p>These files mark that the folder should be treated as one unit. It also makes it\nso that Nimble dependencies can be installed.</p>\n<p>As for the second capability, Nimporter helps you bundle and distribute Nim code\nas part of a binary distribution extremely easily.</p>\n<p>The way it works is by iterating through your entire project and identifying any\nNim module and Nim library that it finds and compiling them to C using a feature\nof Nim that specifically supports this.</p>\n<p>Why compile to C? Because Python already has extensive infrastructure to support\nthe compilation and distribution of C extensions.</p>\n<p>Once each Nim module and library is compiled to C, Python deals with them the\nexact same way as a typical C extension. These extensions are then bundled into\nthe resulting binary distribution and can be uploaded to PyPi or similar.</p>\n<p>Are source distributions supported? Yes and no. They are officially supported\nfor bundling the Nim source files themselves into the archive, but not the C\nsource files. Although the C source files would be a better alternative, the C\nfiles generated by Nim are platform specific, so they would only be of use to\nusers on the same exact platform and architecture. This is why the official way\nof distributing Nimporter libraries is by creating binary wheels.</p>\n<h2>State Of The Project</h2>\n<p>I have implemented all of the features that I wanted to add at this time. I made\nsure to validate the effectiveness of each feature with the unit and integration\ntests. This project should be considered \"done\" and will receive no further\nenhancements except for bug fixes and patches. You can submit a bug report on\nNimporter's <a href=\"https://github.com/Pebaz/nimporter/issues\" rel=\"nofollow\">GitHub Issues</a> page.</p>\n<h2>Contributing</h2>\n<p>Although I would not seek to add any new features to Nimporter, there may exist\ncertain modifications that would enhance the effectiveness of Nimporter's core\nfeatures. Pull requests are welcome, especially for fixing bugs.</p>\n<h2>Special Thanks</h2>\n<p>Nimporter would not be possible without\n<a href=\"https://github.com/yglukhov/nimpy\" rel=\"nofollow\">Nimpy</a>. Thank you\n<a href=\"https://github.com/yglukhov\" rel=\"nofollow\">Yuriy Glukhov</a> for making this project possible!</p>\n<h2>Stargazers Over Time</h2>\n<p><a href=\"https://starchart.cc/Pebaz/nimporter\" rel=\"nofollow\"><img alt=\"Stargazers Over Time\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/192aa0c74697684513c4a70f6c0bb21d1d7473fa/68747470733a2f2f7374617263686172742e63632f506562617a2f6e696d706f727465722e737667\"></a></p>\n<blockquote>\n<p>Made using <a href=\"https://starchart.cc/\" rel=\"nofollow\">https://starchart.cc/</a></p>\n</blockquote>\n\n          </div>"}, "last_serial": 7055161, "releases": {"0.1.1": [{"comment_text": "", "digests": {"md5": "6a84d256f95e056557d5b66d6f73b91e", "sha256": "99ab173f709d22c092bd6d7868f3d4eddfd6d7b389acfabb5ce26bfe35442d36"}, "downloads": -1, "filename": "nimporter-0.1.1.tar.gz", "has_sig": false, "md5_digest": "6a84d256f95e056557d5b66d6f73b91e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 4699, "upload_time": "2019-12-13T19:19:08", "upload_time_iso_8601": "2019-12-13T19:19:08.284158Z", "url": "https://files.pythonhosted.org/packages/4a/10/bb406e3b5ee46ccfb4c19b0f911f3e57fc5ff73e3632d3c237b0bfce203f/nimporter-0.1.1.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "9ff5618d8bddb29cf85946aeff680ae7", "sha256": "74b31b1145049a7cf4ac4bec57d1870b24442d5b92110c821a0249a2bd62f487"}, "downloads": -1, "filename": "nimporter-0.1.2.tar.gz", "has_sig": false, "md5_digest": "9ff5618d8bddb29cf85946aeff680ae7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 4948, "upload_time": "2019-12-13T19:35:53", "upload_time_iso_8601": "2019-12-13T19:35:53.726439Z", "url": "https://files.pythonhosted.org/packages/5a/2e/183cdc808fc270f3810b48c0514025253ab66abb78acc8c2266d1b8fefb5/nimporter-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "29a2260e99bf20b0cd77a55e0dfbf708", "sha256": "b4c6a3f6194198db7f236034d7a4c3c2397760ed00a8db3907dfdc3e0226ea10"}, "downloads": -1, "filename": "nimporter-0.1.3.tar.gz", "has_sig": false, "md5_digest": "29a2260e99bf20b0cd77a55e0dfbf708", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5318, "upload_time": "2019-12-18T02:44:15", "upload_time_iso_8601": "2019-12-18T02:44:15.343380Z", "url": "https://files.pythonhosted.org/packages/59/13/ccdd423254da10e88e883e92101e59b18dfc3bf6df8ad3540882ec5f2ab6/nimporter-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "23a40e55e2147759c57ef546079a75bb", "sha256": "b46d42976f02b5c248cdf8edca37990d442af5ec86f3fa14961596285fc55f0a"}, "downloads": -1, "filename": "nimporter-0.1.4.tar.gz", "has_sig": false, "md5_digest": "23a40e55e2147759c57ef546079a75bb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5417, "upload_time": "2019-12-21T00:17:22", "upload_time_iso_8601": "2019-12-21T00:17:22.950363Z", "url": "https://files.pythonhosted.org/packages/bb/e4/7e8144757d4c88d2a2106b15fb1f8d063949b7348b49f2f335a220454bd1/nimporter-0.1.4.tar.gz", "yanked": false}], "0.1.5": [{"comment_text": "", "digests": {"md5": "00749808c1c57ac3ecee902fd43518f8", "sha256": "f0fa687d4ba1f54df538389a143b545bc8ce3e5c0a9ef7e92ebc27266b56c6e4"}, "downloads": -1, "filename": "nimporter-0.1.5.tar.gz", "has_sig": false, "md5_digest": "00749808c1c57ac3ecee902fd43518f8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5558, "upload_time": "2019-12-26T15:21:22", "upload_time_iso_8601": "2019-12-26T15:21:22.989020Z", "url": "https://files.pythonhosted.org/packages/12/c0/c25a2d28dd717e7482f001ec7cf8d74d2d65a87509d83faf6be1185e281c/nimporter-0.1.5.tar.gz", "yanked": false}], "1.0.0": [{"comment_text": "", "digests": {"md5": "63d63b07d3e43c9b864c43cfa4dd1343", "sha256": "cf7dd5d00b6dd6275657df26a398b6d436e385ee1539c558c0bf80ced64636a7"}, "downloads": -1, "filename": "nimporter-1.0.0.tar.gz", "has_sig": false, "md5_digest": "63d63b07d3e43c9b864c43cfa4dd1343", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 19720, "upload_time": "2020-04-11T15:43:34", "upload_time_iso_8601": "2020-04-11T15:43:34.404996Z", "url": "https://files.pythonhosted.org/packages/21/99/8d27e6d7b8a872aeef4b806f0a888116f985e40e0edc18b142e2c93b4926/nimporter-1.0.0.tar.gz", "yanked": false}, {"comment_text": "", "digests": {"md5": "289f0584c18e83ce9ec9ec4ed265614b", "sha256": "b51d534fcf369009f96441837469dcdc512f06838082ce150a1cccd62427244c"}, "downloads": -1, "filename": "nimporter-1.0.post1-py3-none-any.whl", "has_sig": false, "md5_digest": "289f0584c18e83ce9ec9ec4ed265614b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18922, "upload_time": "2020-04-11T15:42:32", "upload_time_iso_8601": "2020-04-11T15:42:32.788067Z", "url": "https://files.pythonhosted.org/packages/c6/b8/f1d46925e1bbfb3a3e260059a34ba38d9d1f2559f892eeb88ae525096aa0/nimporter-1.0.post1-py3-none-any.whl", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "2a21baa3375dba941460253257f831cd", "sha256": "ad7b58ec02e691855669c79e069552ad1f860523a6986c997d2b39a925a91fd7"}, "downloads": -1, "filename": "nimporter-1.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "2a21baa3375dba941460253257f831cd", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 20834, "upload_time": "2020-04-19T18:22:47", "upload_time_iso_8601": "2020-04-19T18:22:47.474904Z", "url": "https://files.pythonhosted.org/packages/d2/81/25fae83fe6c28d9b2e0830cdbdb957cce69096ce35bc05db0b0906152e0c/nimporter-1.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d88fd6513f0df162e2f04ca1e3af02b9", "sha256": "413875d666de9f57d92ea79559a43398100f228fd6f3daa150887328e6174e8b"}, "downloads": -1, "filename": "nimporter-1.0.1.tar.gz", "has_sig": false, "md5_digest": "d88fd6513f0df162e2f04ca1e3af02b9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 21658, "upload_time": "2020-04-19T18:22:26", "upload_time_iso_8601": "2020-04-19T18:22:26.085226Z", "url": "https://files.pythonhosted.org/packages/56/47/a7e34967a56952bb59ac8106f06ebcd8be07e6f785c024976aaa5787ba2d/nimporter-1.0.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "2a21baa3375dba941460253257f831cd", "sha256": "ad7b58ec02e691855669c79e069552ad1f860523a6986c997d2b39a925a91fd7"}, "downloads": -1, "filename": "nimporter-1.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "2a21baa3375dba941460253257f831cd", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 20834, "upload_time": "2020-04-19T18:22:47", "upload_time_iso_8601": "2020-04-19T18:22:47.474904Z", "url": "https://files.pythonhosted.org/packages/d2/81/25fae83fe6c28d9b2e0830cdbdb957cce69096ce35bc05db0b0906152e0c/nimporter-1.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d88fd6513f0df162e2f04ca1e3af02b9", "sha256": "413875d666de9f57d92ea79559a43398100f228fd6f3daa150887328e6174e8b"}, "downloads": -1, "filename": "nimporter-1.0.1.tar.gz", "has_sig": false, "md5_digest": "d88fd6513f0df162e2f04ca1e3af02b9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 21658, "upload_time": "2020-04-19T18:22:26", "upload_time_iso_8601": "2020-04-19T18:22:26.085226Z", "url": "https://files.pythonhosted.org/packages/56/47/a7e34967a56952bb59ac8106f06ebcd8be07e6f785c024976aaa5787ba2d/nimporter-1.0.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 00:45:20 2020"}