{"info": {"author": "Lukas Graf", "author_email": "graflukas@web.de", "bugtrack_url": null, "classifiers": ["Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "[logo]: https://github.com/lukasValentin/OBIA4RTM/blob/master/obia4rtm_logo.JPG \"OBIA4RTM logo\"\n**OBIA4RTM**\n------------\n[![DOI](https://zenodo.org/badge/184379375.svg)](https://zenodo.org/badge/latestdoi/184379375) [![Python 3.6](https://img.shields.io/badge/python-3.7-blue.svg)](https://www.python.org/downloads/release/python-370/) [![Coverage Status](https://coveralls.io/repos/github/lukasValentin/OBIA4RTM/badge.svg?branch=master)](https://coveralls.io/github/lukasValentin/OBIA4RTM?branch=master) [![Build Status](https://travis-ci.com/lukasValentin/OBIA4RTM.svg?branch=master)](https://travis-ci.com/lukasValentin/OBIA4RTM) [![Documentation Status](https://readthedocs.org/projects/obia4rtm/badge/?version=latest)](https://obia4rtm.readthedocs.io/en/latest/genindex.html)\n\nAn open-source tool for object-based image analysis for radiative transfer modeling\nusing ProSAIL (Prospect5 + 4SAIL) free for non-commercial applications (research and education) under **Creative Commons Attribution-NonCommercial 4.0 International Public License**.\n\n**IMPORTANT**\tOBIA4RTM is currently just a first prototype and will continously updated. Therefore, **contributions** (see below) are welcomed!\n\nIf you'd like to see how **`OBIA4RTM works in practice`** have a look at this [new repository](https://github.com/lukasValentin/OBIA4RTM-Agricultural-Example) that provides some insights into and results from an agricultural use case.\n\nAbout OBIA4RTM\n--------------\n\nOBIA4RTM aims for **`plant parameter retrieval`** - relevant in *smart farming* applications - by using **`radiative transfer models (RTM)`** and **`object-based image analysis (OBIA)`** that\ndireclty addresses actual user needs and policy demands in a highly efficient, flexible and scalable way. It uses optical satellite data (concurrently **Sentinel-2**) as input.\n\nThe RTM approach makes the tool transferable and nearly globally applicable to a broad range of different crop types, while OBIA accounts for producing results on a per-object rather than per pixel-base. Image objects have the distinct advantage of being directly related to real-world entities such as single field parcels. Furthermore, results on a per-object base can be easily managed and shared via geospatial databases and web-interfaces and refer also to the requirements of the Big-Data era.\n\nThe basis idea of OBIA4RTM is to combine to widely used Remote Sensing analysis techniques:\n\nThe biophysical parameter retrieval from optical imagery by means of radiative transfer modelling (RTM) and the object-based image analysis (OBIA) concept. While RTM accounts for retrieving the most relevant plant parameters relevant in farming context (Leaf Area Index, Leaf Chlorophyll Content, etc.), the OBIA approach allows for semantic enrichment of spectral data by means of **incorporating expert knowledge and advanced spatial analysis techniques**.\n\nOBIA4RTM relies therefore on two main pillars: It describes plant spectra by means of physical equations that are universally applicable by using RTM and it introduces the concept of spatial autocorrelation to reduce redundancies and provide more meaningful image objects by means of OBIA. It is thereby capable to provide vegetation parameter retrieval techniques that are not bound by temporal or geographic restrictions. Furthermore, **OBIA4RTM directly addresses objects and, thus, human needs** as humans tend not to think in artificial spatial units (i.e. pixels)\nbut in terms of tangible entities such as single field patches or individual trees in an orchard.\n\nContributing\n------------\n\nContribution to OBIA4RTM is more than welcomed! My time resources are limited and in case you are interested in the topic and you have ideas about\n\n- improving the code (since it is not always implemented very efficiently ;) )\n- adding additional features\n- testing the functionalities and reporting bugs\n- improving the usability\n- etc.\n\nyou are invited to join!\n\n\nWorkflow\n--------\n\nThe overall workflow implemented in OBIA4RTM is shown below.\n\n## Inputs\n\nOBIA4RTM currently expects **Sentinel-2** imagery in **Level-2A** (i.e. corrected for atmospheric effects). Per default it is assumed that Sen2Core was used for generating the Level-2A data (see: http://step.esa.int/main/third-party-plugins-2/sen2cor/) or data was almost downloaded in this processing level from Copernicus or any other (national) data hub.\n**OBIA4RTM offers a convenient wrapper around the Sen2Core command line tool** that takes about all the preprocessing and formatting steps. This wrapper works independently of OBIA4RTM in the sense that it does not interact with the OBIA4RTM database. In can be therefore also used for other Sentinel-2 preprocessing workflows.\n\nOptionally, preprocessing can be also done using **Google Earth Engine** (optionally) which makes OBIA4RTM a **zero-download** program as not imagery is downloaded expect the object spectra that are directly written to the OBIA4RTM database.\n\n![OBIA4RTM Workflow](https://github.com/lukasValentin/OBIA4RTM/blob/master/OBIA4RTM_Workflow.gif \"OBIA4RTM Workflow Overview\")\n\n\nIt should be noted, that:\n\n- OBIA4RTM expects stacked Sentinel-2 (A and B) image data as GeoTiff-File. Only the following Sentinel-2 bands (wavelengths and bandwidths shown for Sentinel-2A only) are used: \n\nBand Number  |\tCentral wavelength (nm)\t|  Bandwidth (nm)  |  Spatial resolution (m)\n-----------  |  ----------------------- |  --------------  |  ----------------------\n2    |\t492.4  |\t66\t| 10\n3    |\t559.8  |\t36\t| 10\n4    |\t664.6  |\t31\t| 10\n5    |\t704.1  |\t15\t| 20\n6    |\t740.5  |\t15\t| 20\n7    |\t782.8  |\t20\t| 20\n8a   |\t864.7  |\t21\t| 20\n11   |\t1613.7 |\t91\t| 20\n12   |\t2202.4 |\t175\t| 20\n\n- Scene metadata is read directly from either the Sen2Core provided metadata file (or in case you have already acquired Level-2A data the equivalent xml file) or by using the Google-Earth-Engine derived scene metadata. Without this metadata information, OBIA4RTM cannot be executed!\n\n- the use of Copernicus land monitoring data is just a *suggestion*. Users can use also different land cover/ use classification or can even provide no classification at all (then all objects will be treated equally, otherwise, vegetation parameters have to be set per land use class).\n\n- OBIA4RTM does not provide any image segementation facilities as there are lots of freely available image segmentation algorithms available (e.g. within the **Orfeo-Toolbox**).\n\n- concurrently, OBIA4RTM uses the Root Mean Squared Error (RMSE) as cost function within the inversion strategy. Users can specify their own cost-functions. It is planned to add more cost functions in the future.\n\n- all image objects are stored in a PostgreSQL database with PostGIS extension. Make sure to have PostgreSQL **and** PostGIS installed on your machine or where-ever you want to run OBIA4RTM.\n\nInstallation\n------------\n\nThe installation of OBIA4RTM is multi-step procedure. It is suggested to start installing all dependencies first and then building the OBIA4RTM package using the setup.py file.\n\n### PostgreSQL and PostGIS installation\n\nThe OBIA4RTM backend requires **PostgreSQL** for storing the information in a hybrid database (i.e. mainly relational with some object-oriented features). OBIA4RTM was mainly developed under PostgreSQL 10.9 but it is assumed that higher versions (>11.0) should work as well. For installing PostgreSQL you can refer this [tutorial for Windows](http://www.postgresqltutorial.com/install-postgresql/) or use this [instructions under Ubuntu](https://www.postgresql.org/download/linux/ubuntu/).\n\nAfter having installed PostgreSQL, **PostGIS** is required to make PostgreSQL become a spatial database. For installation instructions, please see [here](https://postgis.net/install/).\n\n### Python Packages\n\nOBIA4RTM depends on a set of non-standard **Python-3** packages that are required to make the software running. **NOTE** that Python 2.x is not supported by OBIA4RTM as Python2 will reach its end of lifecycle in the near future!\n\nOnly the Google Earth Engine Python-API as well as Py6S are optional packages that users might skip. It is recommended to use [Anaconda](https://anaconda.org/anaconda) for the Python package management especially if you are planning to deploy OBIA4RTM under Windows. Especially the Setup of GDAL and the required RTM modules worked out smoothly under Windows when using Anaconda and installling directly from the Anaconda cloud.\n\nYou can install the following packages from the Anaconda command prompt:\n\n```console\n$ conda install -c conda-forge spectral\n$ conda install -c anaconda scipy\n$ conda install -c anaconda psycopg2\n$ conda install -c conda-forge gdal\n$ conda install -c jgomezdans prosail\n$ conda install -c anaconda numpy\n```\n\nIn case your planning to use Google Earth Engine (GEE), make sure to also install\n\n```console\n$ conda install -c conda-forge earthengine-api\n$ conda install -c conda-forge Py6S\n```\n\nSee also the instructions [how to use GEE Python API](https://developers.google.com/earth-engine/python_install).\n\n### OBIA4RTM setup\n\nFirst, clone or download OBIA4RTM from Github (as long as no PyPi/ Anaconda package is available):\n\n```console\n$ git clone https://github.com/lukasValentin/OBIA4RTM.git\n```\n\nThen go into the OBIA4RTM directory (cd ./OBIA4RTM) and run either \n\n```console\n$ python3 -m pip install .\n```\n\nor \n\n```console\n$ python3 setup.py install\n```\n\nto use either pip or the more advanced egg-installation.\n\nAfter that, OBIA4RTM **is installed but not ready to use**. Therefore, open a Python3 session and type in\n\n```python\nfrom OBIA4RTM import install\ninstall.install()\n```\nThis installation script will take care about the database setup (including the creation of tables and functions) and enable the required extensions. Moreover, it will copy some configuration files into a **OBIA4RTM home directory** in the user profile. After having successfully run the installation script, OBIA4RTM is ready to use.\n\nUsage Instructions\n------------------\n\n### Configuring OBIA4RTM\n\nOBIA4RTM has a set of configuration files which are important for running the software:\n\n- a configuration file that holds the **connection parameters of the PostgreSQL backend database** (*'postgres.ini'*). In case you want to use a different database instead of the default one, you have to set the connection parameters accordingly.\n\n- a **configuration file specifying the table and schema names in the database** (*'obia4rtm_backend.cfg'*). Most likely you will only have to change something in there in case you want to use additional database schemes.\n\n- a file that holds the soil spectra. Per default, the **soil spectra** offered by PyProsail are used (*'soil_relfectance.txt'*). However, it is also possible to add a custom soil spectrum in case, for instance, in-situ reference information for a specific region is available. Since the handling of external files is not very convenient it is `**planned to integrate the soil spectra directly into the OBIA4RTM database`**.\n\n- a file specifying the **parameterization of the ProSAIL lookup table(s)** (*'prosail.txt'*) per land use/ cover class. Since the handling of this configuration file is also not very convenient it is planned to change the layout of the file and the way the parameters are set in a future release of the software.\n\n- an additional file mapping the codes and semantic defintion of the **land cover/ land use classes** to be used in OBIA4RTM (*'landcover.cfg*). Whenever you are about to add a new land use/ cover class you have to change the information in this file. Most likely, however, this will be also changed in a future version of the software.\n\nAll the files are located in the **`OBIA4RTM home directory`** which can be found in the user directory once OBIA4RTM was successfully installed (see section above). Most often users will want to chnage the ProSAIL configuration file since this file is essential for running the ProSAIL forward simulations and hence the derivation of plant parameters. Please note that the overall structure of the files must be maintained as otherwise I/O-related errors are very likely to occur. Therefore, it might be safer to keep a copy of the original files that came with the installation whenever you are changing something.\n\n### Image Preprocessing\n\nTo enable *operational usage* of OBIA4RTM, **preprocessing opportunities** are offered using **`Google Earth Engine (Python API client)`** (GEE) or **`Sen2Core`** software together with **`GDAL`**.\n\nThe **Sen2Core** approach is optional in the way that OBIA4RTM also accepts imagery in Level-2A directly provided from ESA (i.e images one which Sen2Core was almost executed by ESA). Using GDAL, the imagery is then also brought in the format required by OBIA4RTM (GeoTiff as image stack of the required Sentinel-2 bands and the SCL layer). Thus, the user has not to take care about any annoying preprocessing or file conversion issues.\n\nThe **GEE** approach includes atmospheric correction using **Py6S** as well as cloud and cloud shadow masking using functionalities provided by Sam Murphy under Apache 2.0 license.\nCheck out\n\n- https://github.com/samsammurphy/gee-atmcorr-S2 for the atmospheric correction algorithm, and\n\n- https://github.com/samsammurphy/cloud-masking-sentinel2 for the cloud and shadow masking\n\nThe preprocessed images are then stored and treated the same way in OBIA4RTM as in the file- (Sen2Core) based way.\n\nFor demonstration, some sample code is available in a Jupyter Notebook https://github.com/lukasValentin/OBIA4RTM/tree/master/Examples/jupyter\n\n**NOTE**: Please make sure to follow the installation instructions before running this functionality and having the Google Earth Engine client enabled.\n\n### Inversion\n\nThe inversion (i.e. derivation of plant biochemical and biophysical parameters) is done numerically since the invserse of the radiative transfer equations is not defined analytically. OBIA4RTM therefore uses a cost function to find the closest match between the satellite-derived and ProSAIL-modelled spectra per land use/cover class. Currently, only the **root mean squared error (RMSE)** is supported as cost function since it is very simple and computational effecient. Future versions of OBIA4RTM might also include additional and more advanced cost functions. To ensure the **numerical stability of the inversion** the user can specify that the average of the best *n* solutions is used in terms of the lowest RMSE. *n* can range between 1 and *N*, where *N* is the number of spectra in the LUT even that makes not really sense from a physical point of view since the average of all spectra in the LUT will most likely not correspond to a physically meaningful solution.\n\n\nDemodata produced with OBIA4RTM\n-------------------------------\n\nSample data can be found here: http://dx.doi.org/10.17632/vs55cwssyh.1 showing some Sentinel-2 data that was processed using OBIA4RTM in an agricultural area in Southern Germany.\n\nPublications\n------------\ncoming soon\n\nOBIA4RTM\n--------\n[![DOI](https://zenodo.org/badge/184379375.svg)](https://zenodo.org/badge/latestdoi/184379375)\n\n\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/lukasValentin/OBIA4RTM", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "OBIA4RTM", "package_url": "https://pypi.org/project/OBIA4RTM/", "platform": "", "project_url": "https://pypi.org/project/OBIA4RTM/", "project_urls": {"Homepage": "https://github.com/lukasValentin/OBIA4RTM"}, "release_url": "https://pypi.org/project/OBIA4RTM/1.0/", "requires_dist": null, "requires_python": "", "summary": "Object-Based Image Analysis Tools for Radiative Transfer Modelling", "version": "1.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h2>[logo]: <a href=\"https://github.com/lukasValentin/OBIA4RTM/blob/master/obia4rtm_logo.JPG\" rel=\"nofollow\">https://github.com/lukasValentin/OBIA4RTM/blob/master/obia4rtm_logo.JPG</a> \"OBIA4RTM logo\"\n<strong>OBIA4RTM</strong></h2>\n<p><a href=\"https://zenodo.org/badge/latestdoi/184379375\" rel=\"nofollow\"><img alt=\"DOI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/9e8d0fdf1f6f89f2fa50c92ba1833635c9b22607/68747470733a2f2f7a656e6f646f2e6f72672f62616467652f3138343337393337352e737667\"></a> <a href=\"https://www.python.org/downloads/release/python-370/\" rel=\"nofollow\"><img alt=\"Python 3.6\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/99a5180f32db379110e9948c7de1aaf8f77bf2e8/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f707974686f6e2d332e372d626c75652e737667\"></a> <a href=\"https://coveralls.io/github/lukasValentin/OBIA4RTM?branch=master\" rel=\"nofollow\"><img alt=\"Coverage Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/e91ad9872a6a6231d03a75c3ae875996e94c102d/68747470733a2f2f636f766572616c6c732e696f2f7265706f732f6769746875622f6c756b617356616c656e74696e2f4f4249413452544d2f62616467652e7376673f6272616e63683d6d6173746572\"></a> <a href=\"https://travis-ci.com/lukasValentin/OBIA4RTM\" rel=\"nofollow\"><img alt=\"Build Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/36eb92487f4968d0ce5b2f7288cd4014f895d6e9/68747470733a2f2f7472617669732d63692e636f6d2f6c756b617356616c656e74696e2f4f4249413452544d2e7376673f6272616e63683d6d6173746572\"></a> <a href=\"https://obia4rtm.readthedocs.io/en/latest/genindex.html\" rel=\"nofollow\"><img alt=\"Documentation Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/5b1cd315816388f328b73a916b817b77fdc44f62/68747470733a2f2f72656164746865646f63732e6f72672f70726f6a656374732f6f6269613472746d2f62616467652f3f76657273696f6e3d6c6174657374\"></a></p>\n<p>An open-source tool for object-based image analysis for radiative transfer modeling\nusing ProSAIL (Prospect5 + 4SAIL) free for non-commercial applications (research and education) under <strong>Creative Commons Attribution-NonCommercial 4.0 International Public License</strong>.</p>\n<p><strong>IMPORTANT</strong>\tOBIA4RTM is currently just a first prototype and will continously updated. Therefore, <strong>contributions</strong> (see below) are welcomed!</p>\n<p>If you'd like to see how <strong><code>OBIA4RTM works in practice</code></strong> have a look at this <a href=\"https://github.com/lukasValentin/OBIA4RTM-Agricultural-Example\" rel=\"nofollow\">new repository</a> that provides some insights into and results from an agricultural use case.</p>\n<h2>About OBIA4RTM</h2>\n<p>OBIA4RTM aims for <strong><code>plant parameter retrieval</code></strong> - relevant in <em>smart farming</em> applications - by using <strong><code>radiative transfer models (RTM)</code></strong> and <strong><code>object-based image analysis (OBIA)</code></strong> that\ndireclty addresses actual user needs and policy demands in a highly efficient, flexible and scalable way. It uses optical satellite data (concurrently <strong>Sentinel-2</strong>) as input.</p>\n<p>The RTM approach makes the tool transferable and nearly globally applicable to a broad range of different crop types, while OBIA accounts for producing results on a per-object rather than per pixel-base. Image objects have the distinct advantage of being directly related to real-world entities such as single field parcels. Furthermore, results on a per-object base can be easily managed and shared via geospatial databases and web-interfaces and refer also to the requirements of the Big-Data era.</p>\n<p>The basis idea of OBIA4RTM is to combine to widely used Remote Sensing analysis techniques:</p>\n<p>The biophysical parameter retrieval from optical imagery by means of radiative transfer modelling (RTM) and the object-based image analysis (OBIA) concept. While RTM accounts for retrieving the most relevant plant parameters relevant in farming context (Leaf Area Index, Leaf Chlorophyll Content, etc.), the OBIA approach allows for semantic enrichment of spectral data by means of <strong>incorporating expert knowledge and advanced spatial analysis techniques</strong>.</p>\n<p>OBIA4RTM relies therefore on two main pillars: It describes plant spectra by means of physical equations that are universally applicable by using RTM and it introduces the concept of spatial autocorrelation to reduce redundancies and provide more meaningful image objects by means of OBIA. It is thereby capable to provide vegetation parameter retrieval techniques that are not bound by temporal or geographic restrictions. Furthermore, <strong>OBIA4RTM directly addresses objects and, thus, human needs</strong> as humans tend not to think in artificial spatial units (i.e. pixels)\nbut in terms of tangible entities such as single field patches or individual trees in an orchard.</p>\n<h2>Contributing</h2>\n<p>Contribution to OBIA4RTM is more than welcomed! My time resources are limited and in case you are interested in the topic and you have ideas about</p>\n<ul>\n<li>improving the code (since it is not always implemented very efficiently ;) )</li>\n<li>adding additional features</li>\n<li>testing the functionalities and reporting bugs</li>\n<li>improving the usability</li>\n<li>etc.</li>\n</ul>\n<p>you are invited to join!</p>\n<h2>Workflow</h2>\n<p>The overall workflow implemented in OBIA4RTM is shown below.</p>\n<h2>Inputs</h2>\n<p>OBIA4RTM currently expects <strong>Sentinel-2</strong> imagery in <strong>Level-2A</strong> (i.e. corrected for atmospheric effects). Per default it is assumed that Sen2Core was used for generating the Level-2A data (see: <a href=\"http://step.esa.int/main/third-party-plugins-2/sen2cor/\" rel=\"nofollow\">http://step.esa.int/main/third-party-plugins-2/sen2cor/</a>) or data was almost downloaded in this processing level from Copernicus or any other (national) data hub.\n<strong>OBIA4RTM offers a convenient wrapper around the Sen2Core command line tool</strong> that takes about all the preprocessing and formatting steps. This wrapper works independently of OBIA4RTM in the sense that it does not interact with the OBIA4RTM database. In can be therefore also used for other Sentinel-2 preprocessing workflows.</p>\n<p>Optionally, preprocessing can be also done using <strong>Google Earth Engine</strong> (optionally) which makes OBIA4RTM a <strong>zero-download</strong> program as not imagery is downloaded expect the object spectra that are directly written to the OBIA4RTM database.</p>\n<p><img alt=\"OBIA4RTM Workflow\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/c73a0a0cea7d7f7d9e814784b00a24ca1ccb667e/68747470733a2f2f6769746875622e636f6d2f6c756b617356616c656e74696e2f4f4249413452544d2f626c6f622f6d61737465722f4f4249413452544d5f576f726b666c6f772e676966\"></p>\n<p>It should be noted, that:</p>\n<ul>\n<li>OBIA4RTM expects stacked Sentinel-2 (A and B) image data as GeoTiff-File. Only the following Sentinel-2 bands (wavelengths and bandwidths shown for Sentinel-2A only) are used:</li>\n</ul>\n<table>\n<thead>\n<tr>\n<th>Band Number</th>\n<th>Central wavelength (nm)</th>\n<th>Bandwidth (nm)</th>\n<th>Spatial resolution (m)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>2</td>\n<td>492.4</td>\n<td>66</td>\n<td>10</td>\n</tr>\n<tr>\n<td>3</td>\n<td>559.8</td>\n<td>36</td>\n<td>10</td>\n</tr>\n<tr>\n<td>4</td>\n<td>664.6</td>\n<td>31</td>\n<td>10</td>\n</tr>\n<tr>\n<td>5</td>\n<td>704.1</td>\n<td>15</td>\n<td>20</td>\n</tr>\n<tr>\n<td>6</td>\n<td>740.5</td>\n<td>15</td>\n<td>20</td>\n</tr>\n<tr>\n<td>7</td>\n<td>782.8</td>\n<td>20</td>\n<td>20</td>\n</tr>\n<tr>\n<td>8a</td>\n<td>864.7</td>\n<td>21</td>\n<td>20</td>\n</tr>\n<tr>\n<td>11</td>\n<td>1613.7</td>\n<td>91</td>\n<td>20</td>\n</tr>\n<tr>\n<td>12</td>\n<td>2202.4</td>\n<td>175</td>\n<td>20</td>\n</tr></tbody></table>\n<ul>\n<li>\n<p>Scene metadata is read directly from either the Sen2Core provided metadata file (or in case you have already acquired Level-2A data the equivalent xml file) or by using the Google-Earth-Engine derived scene metadata. Without this metadata information, OBIA4RTM cannot be executed!</p>\n</li>\n<li>\n<p>the use of Copernicus land monitoring data is just a <em>suggestion</em>. Users can use also different land cover/ use classification or can even provide no classification at all (then all objects will be treated equally, otherwise, vegetation parameters have to be set per land use class).</p>\n</li>\n<li>\n<p>OBIA4RTM does not provide any image segementation facilities as there are lots of freely available image segmentation algorithms available (e.g. within the <strong>Orfeo-Toolbox</strong>).</p>\n</li>\n<li>\n<p>concurrently, OBIA4RTM uses the Root Mean Squared Error (RMSE) as cost function within the inversion strategy. Users can specify their own cost-functions. It is planned to add more cost functions in the future.</p>\n</li>\n<li>\n<p>all image objects are stored in a PostgreSQL database with PostGIS extension. Make sure to have PostgreSQL <strong>and</strong> PostGIS installed on your machine or where-ever you want to run OBIA4RTM.</p>\n</li>\n</ul>\n<h2>Installation</h2>\n<p>The installation of OBIA4RTM is multi-step procedure. It is suggested to start installing all dependencies first and then building the OBIA4RTM package using the setup.py file.</p>\n<h3>PostgreSQL and PostGIS installation</h3>\n<p>The OBIA4RTM backend requires <strong>PostgreSQL</strong> for storing the information in a hybrid database (i.e. mainly relational with some object-oriented features). OBIA4RTM was mainly developed under PostgreSQL 10.9 but it is assumed that higher versions (&gt;11.0) should work as well. For installing PostgreSQL you can refer this <a href=\"http://www.postgresqltutorial.com/install-postgresql/\" rel=\"nofollow\">tutorial for Windows</a> or use this <a href=\"https://www.postgresql.org/download/linux/ubuntu/\" rel=\"nofollow\">instructions under Ubuntu</a>.</p>\n<p>After having installed PostgreSQL, <strong>PostGIS</strong> is required to make PostgreSQL become a spatial database. For installation instructions, please see <a href=\"https://postgis.net/install/\" rel=\"nofollow\">here</a>.</p>\n<h3>Python Packages</h3>\n<p>OBIA4RTM depends on a set of non-standard <strong>Python-3</strong> packages that are required to make the software running. <strong>NOTE</strong> that Python 2.x is not supported by OBIA4RTM as Python2 will reach its end of lifecycle in the near future!</p>\n<p>Only the Google Earth Engine Python-API as well as Py6S are optional packages that users might skip. It is recommended to use <a href=\"https://anaconda.org/anaconda\" rel=\"nofollow\">Anaconda</a> for the Python package management especially if you are planning to deploy OBIA4RTM under Windows. Especially the Setup of GDAL and the required RTM modules worked out smoothly under Windows when using Anaconda and installling directly from the Anaconda cloud.</p>\n<p>You can install the following packages from the Anaconda command prompt:</p>\n<pre><span class=\"gp\">$</span> conda install -c conda-forge spectral\n<span class=\"gp\">$</span> conda install -c anaconda scipy\n<span class=\"gp\">$</span> conda install -c anaconda psycopg2\n<span class=\"gp\">$</span> conda install -c conda-forge gdal\n<span class=\"gp\">$</span> conda install -c jgomezdans prosail\n<span class=\"gp\">$</span> conda install -c anaconda numpy\n</pre>\n<p>In case your planning to use Google Earth Engine (GEE), make sure to also install</p>\n<pre><span class=\"gp\">$</span> conda install -c conda-forge earthengine-api\n<span class=\"gp\">$</span> conda install -c conda-forge Py6S\n</pre>\n<p>See also the instructions <a href=\"https://developers.google.com/earth-engine/python_install\" rel=\"nofollow\">how to use GEE Python API</a>.</p>\n<h3>OBIA4RTM setup</h3>\n<p>First, clone or download OBIA4RTM from Github (as long as no PyPi/ Anaconda package is available):</p>\n<pre><span class=\"gp\">$</span> git clone https://github.com/lukasValentin/OBIA4RTM.git\n</pre>\n<p>Then go into the OBIA4RTM directory (cd ./OBIA4RTM) and run either</p>\n<pre><span class=\"gp\">$</span> python3 -m pip install .\n</pre>\n<p>or</p>\n<pre><span class=\"gp\">$</span> python3 setup.py install\n</pre>\n<p>to use either pip or the more advanced egg-installation.</p>\n<p>After that, OBIA4RTM <strong>is installed but not ready to use</strong>. Therefore, open a Python3 session and type in</p>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">OBIA4RTM</span> <span class=\"kn\">import</span> <span class=\"n\">install</span>\n<span class=\"n\">install</span><span class=\"o\">.</span><span class=\"n\">install</span><span class=\"p\">()</span>\n</pre>\n<p>This installation script will take care about the database setup (including the creation of tables and functions) and enable the required extensions. Moreover, it will copy some configuration files into a <strong>OBIA4RTM home directory</strong> in the user profile. After having successfully run the installation script, OBIA4RTM is ready to use.</p>\n<h2>Usage Instructions</h2>\n<h3>Configuring OBIA4RTM</h3>\n<p>OBIA4RTM has a set of configuration files which are important for running the software:</p>\n<ul>\n<li>\n<p>a configuration file that holds the <strong>connection parameters of the PostgreSQL backend database</strong> (<em>'postgres.ini'</em>). In case you want to use a different database instead of the default one, you have to set the connection parameters accordingly.</p>\n</li>\n<li>\n<p>a <strong>configuration file specifying the table and schema names in the database</strong> (<em>'obia4rtm_backend.cfg'</em>). Most likely you will only have to change something in there in case you want to use additional database schemes.</p>\n</li>\n<li>\n<p>a file that holds the soil spectra. Per default, the <strong>soil spectra</strong> offered by PyProsail are used (<em>'soil_relfectance.txt'</em>). However, it is also possible to add a custom soil spectrum in case, for instance, in-situ reference information for a specific region is available. Since the handling of external files is not very convenient it is <code>**planned to integrate the soil spectra directly into the OBIA4RTM database</code>**.</p>\n</li>\n<li>\n<p>a file specifying the <strong>parameterization of the ProSAIL lookup table(s)</strong> (<em>'prosail.txt'</em>) per land use/ cover class. Since the handling of this configuration file is also not very convenient it is planned to change the layout of the file and the way the parameters are set in a future release of the software.</p>\n</li>\n<li>\n<p>an additional file mapping the codes and semantic defintion of the <strong>land cover/ land use classes</strong> to be used in OBIA4RTM (<em>'landcover.cfg</em>). Whenever you are about to add a new land use/ cover class you have to change the information in this file. Most likely, however, this will be also changed in a future version of the software.</p>\n</li>\n</ul>\n<p>All the files are located in the <strong><code>OBIA4RTM home directory</code></strong> which can be found in the user directory once OBIA4RTM was successfully installed (see section above). Most often users will want to chnage the ProSAIL configuration file since this file is essential for running the ProSAIL forward simulations and hence the derivation of plant parameters. Please note that the overall structure of the files must be maintained as otherwise I/O-related errors are very likely to occur. Therefore, it might be safer to keep a copy of the original files that came with the installation whenever you are changing something.</p>\n<h3>Image Preprocessing</h3>\n<p>To enable <em>operational usage</em> of OBIA4RTM, <strong>preprocessing opportunities</strong> are offered using <strong><code>Google Earth Engine (Python API client)</code></strong> (GEE) or <strong><code>Sen2Core</code></strong> software together with <strong><code>GDAL</code></strong>.</p>\n<p>The <strong>Sen2Core</strong> approach is optional in the way that OBIA4RTM also accepts imagery in Level-2A directly provided from ESA (i.e images one which Sen2Core was almost executed by ESA). Using GDAL, the imagery is then also brought in the format required by OBIA4RTM (GeoTiff as image stack of the required Sentinel-2 bands and the SCL layer). Thus, the user has not to take care about any annoying preprocessing or file conversion issues.</p>\n<p>The <strong>GEE</strong> approach includes atmospheric correction using <strong>Py6S</strong> as well as cloud and cloud shadow masking using functionalities provided by Sam Murphy under Apache 2.0 license.\nCheck out</p>\n<ul>\n<li>\n<p><a href=\"https://github.com/samsammurphy/gee-atmcorr-S2\" rel=\"nofollow\">https://github.com/samsammurphy/gee-atmcorr-S2</a> for the atmospheric correction algorithm, and</p>\n</li>\n<li>\n<p><a href=\"https://github.com/samsammurphy/cloud-masking-sentinel2\" rel=\"nofollow\">https://github.com/samsammurphy/cloud-masking-sentinel2</a> for the cloud and shadow masking</p>\n</li>\n</ul>\n<p>The preprocessed images are then stored and treated the same way in OBIA4RTM as in the file- (Sen2Core) based way.</p>\n<p>For demonstration, some sample code is available in a Jupyter Notebook <a href=\"https://github.com/lukasValentin/OBIA4RTM/tree/master/Examples/jupyter\" rel=\"nofollow\">https://github.com/lukasValentin/OBIA4RTM/tree/master/Examples/jupyter</a></p>\n<p><strong>NOTE</strong>: Please make sure to follow the installation instructions before running this functionality and having the Google Earth Engine client enabled.</p>\n<h3>Inversion</h3>\n<p>The inversion (i.e. derivation of plant biochemical and biophysical parameters) is done numerically since the invserse of the radiative transfer equations is not defined analytically. OBIA4RTM therefore uses a cost function to find the closest match between the satellite-derived and ProSAIL-modelled spectra per land use/cover class. Currently, only the <strong>root mean squared error (RMSE)</strong> is supported as cost function since it is very simple and computational effecient. Future versions of OBIA4RTM might also include additional and more advanced cost functions. To ensure the <strong>numerical stability of the inversion</strong> the user can specify that the average of the best <em>n</em> solutions is used in terms of the lowest RMSE. <em>n</em> can range between 1 and <em>N</em>, where <em>N</em> is the number of spectra in the LUT even that makes not really sense from a physical point of view since the average of all spectra in the LUT will most likely not correspond to a physically meaningful solution.</p>\n<h2>Demodata produced with OBIA4RTM</h2>\n<p>Sample data can be found here: <a href=\"http://dx.doi.org/10.17632/vs55cwssyh.1\" rel=\"nofollow\">http://dx.doi.org/10.17632/vs55cwssyh.1</a> showing some Sentinel-2 data that was processed using OBIA4RTM in an agricultural area in Southern Germany.</p>\n<h2>Publications</h2>\n<p>coming soon</p>\n<h2>OBIA4RTM</h2>\n<p><a href=\"https://zenodo.org/badge/latestdoi/184379375\" rel=\"nofollow\"><img alt=\"DOI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/9e8d0fdf1f6f89f2fa50c92ba1833635c9b22607/68747470733a2f2f7a656e6f646f2e6f72672f62616467652f3138343337393337352e737667\"></a></p>\n\n          </div>"}, "last_serial": 7151698, "releases": {"1.0": [{"comment_text": "", "digests": {"md5": "6a185a0d5feb3394d73337096d8cf68c", "sha256": "5e160191d82438eb2a23750d16f874a31aa8e85e49c5eb53f27a625276527ee6"}, "downloads": -1, "filename": "OBIA4RTM-1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "6a185a0d5feb3394d73337096d8cf68c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 84414, "upload_time": "2020-05-02T14:23:46", "upload_time_iso_8601": "2020-05-02T14:23:46.730910Z", "url": "https://files.pythonhosted.org/packages/a9/f3/1dbf7c02509c895b156f78d6f6452d04e25bdfe7161f7c8ca92665320c55/OBIA4RTM-1.0-py3-none-any.whl", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "6a185a0d5feb3394d73337096d8cf68c", "sha256": "5e160191d82438eb2a23750d16f874a31aa8e85e49c5eb53f27a625276527ee6"}, "downloads": -1, "filename": "OBIA4RTM-1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "6a185a0d5feb3394d73337096d8cf68c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 84414, "upload_time": "2020-05-02T14:23:46", "upload_time_iso_8601": "2020-05-02T14:23:46.730910Z", "url": "https://files.pythonhosted.org/packages/a9/f3/1dbf7c02509c895b156f78d6f6452d04e25bdfe7161f7c8ca92665320c55/OBIA4RTM-1.0-py3-none-any.whl", "yanked": false}], "timestamp": "Fri May  8 00:43:51 2020"}