{"info": {"author": "Yartsev Alexander", "author_email": "a.yartsev@yartsev.by", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Intended Audience :: Developers", "License :: OSI Approved :: GNU Lesser General Public License v3 (LGPLv3)", "License :: OSI Approved :: GNU Lesser General Public License v3 or later (LGPLv3+)", "Programming Language :: Python", "Programming Language :: Python :: 3", "Topic :: Internet", "Topic :: Software Development :: Libraries", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "# odpm\n\nОсновная задача данного проекта - это упростить жизнь разработчику при работе с системой odoo. Данный проект отражает ислючительно мой собственный опыт и лично мой взгляд на удобство разработки.\n\n# Идея\nВ процессе работы с платформой odoo у меня начали появляться рутинные задачи, которые требуют большой усидчивости и внимания. Ситуацию усугбляет то, что отладка и отлов ошибок в них очень сильно затруднен. Например мне нужно создать новый проект, для этого мне нужно подготовить окружение с учетом версий не только odoo но и самого python. А если мне нужно проект сделать совместимым с несколькими версиями то совсем тяжко. И очень часто возникала ситуация когда трудоемкость самого модуля сильно меньше чем затраты не создание окружения и прочих вспомогательных операций. Со временем я осознал что действую в этих ситуациях по определенному шаблону и пришло понимание того, что эти действия необходимо автоматизировать. Вот несколько операций которые вы можете совершать с помощью данного инструмента:\n- Создать рабочее окружение для проекта\n- Создать архив базы\n- Сделать сброс базы\n- Восттановить базу из архива\n- ...\n\nТак же часть ресурсов разработчика расходуется на упорядочение зависмостей, которые реализованы третьей стороной, например проект muk. Т.е. если бы у нас был инструмент, который бы мог сам скачать сторонние проекты и подключить их к нашему, то это так же сэкономило бы много нервов.\n\n# Работа с проектом\n```\nВ связи с тем, что чаще всего мне требовалось подхватывать уже существующий проект, то на данный момент автоматизированное развертывание окружение возможно только при наличии git репозитория уже сущствующиего проекта, содержащего odoo модули. Репозиторий должен иметь ветки с именами версий аналогично проекту odoo. Инициализация проекта пока в разработке.\n```\n\nНа данный момент работа программы протестирована только на OS GNU/Linux Debian\n\n\n\n## Установка\n```\nsudo pip3 install odpm\n```\nВыбирем или создаем каталог, где будет располагаться наш проект и создаем odpm_project.json файл со следующим содержимым:\n```json\n{\n    \"projects_dir\": \"/home/my_home_dir/projects/\",\n    \"odoo_projects_dir\": \"/home/www-data/odoo_projects/\",\n    \"odoo_dir\": \"/home/www-data/odoo/\",\n    \"odoo_venvs_dir\": \"/home/www-data/odoo_venvs/\",\n    \"dependencies_projects_urls\": [],\n    \"dev_project_url\": \"https://yartsev@bitbucket.org/yartsevco/solid_pos.git\",\n    \"odoo_version_for_project\": \"11.0\",\n    \"project_name\": \"oodobno\",\n    \"modules_to_update\":[\"solid_pos\"],\n    \"git_servers_params\":{\n         \"bitbucket.org\":{\n            \"user\":\"your_login\",\n            \"password\":\"your_password\"\n        }\n    }\n    \"database_name\":\"new_db\"\n}\n```\nКаталог с проектом должен находится в месте, указанном в параметре `projects_dir`.\n\n## Параметры json файла:\n- projects_dir - каталог с проектами, в данном случаем проект может являть собой не только модули odoo, а нечто большее, так же у меня проект хранит файл конфигурации odoo, и файл запуска odoo в режиме разработки, для каждого проекта они уникальны. Необязательный параметр, по умолчанию будет создан каталог в домашней директории пользователя от имени которого запускается приложение. Тип - строка\n- odoo_projects_dir - каталог в который загружаются все проекты которые являют собой либо модуль odoo либо несколько модулей, эти проект должны иметь ветки с именами совподающими с версиями odoo. Необязательный параметр, по умолчанию будет создан каталог в домашней директории пользователя от имени которого запускается приложение. Тип - строка\n- odoo_dir - каталог, в который будет склонирована сама odoo из своего официального репозитория. Необязательный параметр, по умолчанию будет создан каталог в домашней директории пользователя от имени которого запускается приложение. Тип - строка\n- odoo_venvs_dir - каталог в котором содрежатся виртуальные окружения используемых разработчиком версий odoo. Необязательный параметр, по умолчанию будет создан каталог в домашней директории пользователя от имени которого запускается приложение. Тип - строка\n- dependencies_projects_urls - список проектов созданных третьими лицами (например OCA или Muk). Обязательный параметр. Тип - массив.\n- dependencies_projects_dirs - список каталогов со сторонними проектами, которые не находятся в git, но тут нет проверки версии, поэтому придется следить самостоятельно за этим. тип - массив\n- dev_project_url - ссылка на текущий разрабатываемый проект. Обязательный параметр. Тип - строка\n- odoo_version_for_project - имя версии odoo для проекта. Обязательный параметр. Тип - строка.\n- project_name - имя текущего проекта, можно не указывать. Если указываете то должно совпадать с именем каталога в котором находится проект. Обязательный параметр. Тип - строка.\n- git_servers_params -  можно указать сервера и логин с паролем для него, чтобы odpm при работе с закрытыми репозиториями не спрашивал пароли, но данное решение не является безопасным, используете на свой страх и риск. Обязательный параметр. Тип - объект.\n- database_name - имя базы данных, которое будет использовано при разработке. Необязательный параметр, по умолчанию будет создана баз с именем проекта с прибавлениме версии odoo. Такой подход позволяет быстро переключаться между версий системы. Тип - строка.\n- modules_to_update -  список модулей, который будет установлен при первом запуске базы или автоматически обновлен при перезапуске. Обязательный параметр. Тип - массив.\n\n# Параметры коммандной строки\n\n* --drop-db - укажите через пробел имя базы данных для сброса\n* --backup-db - используется совместно с параметром --arch-path, позволяет сделать архив базы данных\n* --restore-db - используется совместно с параметром --arch-path, позволяет восстановить архив базы данных\n* --arch-path - путь к архиву базы данных, используется для создания и восстановления архивов баз\n* --update -  делает  git pull во всех репозиториях odoo и проектах с модулями odoo\n* --project-path - данный парметр позволяет запустить odpm в контесте другого проекта\n* --dev-restart - запустит odoo с вашим проектом выводом консоли\n* --create-module - создаст заготовку модуля из шаблона, в отличии от стандартного в шаблоне присутствует часть фронтэнда\n* --change-password - замена пароля в базе, которая указана в проекте, на указанный в параметре\n\n# Примеры\n\n```\n\n```\n\n Дорожная карта:\n - сброс базы +\n - бекап базы +\n - восстановление базы +\n - создание модуля odoo с файлами для фронтэнда +\n - обновить git репозитории +\n - принудительная пересборка окружения virtualenv -\n - инициализазия проекта +\n - сделать файл конфигурации для глобальных значений -\n - нужно добавить сбор ключей для git серверов - ???\n\n# История изменений\n*****************\n\n* **Release 0.0.14 (01-02-2020)**\n\n  * Добавлена команда --change-password  для смены пароля администратора системы\n\n* **Release 0.0.1 (03-01-2020)**\n\n  * Первый релиз\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/aayartsev/odpm", "keywords": "odoo odpm", "license": "LGPLv3", "maintainer": "", "maintainer_email": "", "name": "odpm", "package_url": "https://pypi.org/project/odpm/", "platform": "", "project_url": "https://pypi.org/project/odpm/", "project_urls": {"Homepage": "https://github.com/aayartsev/odpm"}, "release_url": "https://pypi.org/project/odpm/0.0.18/", "requires_dist": null, "requires_python": ">=3", "summary": "odoo development project mananagement", "version": "0.0.18", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>odpm</h1>\n<p>Основная задача данного проекта - это упростить жизнь разработчику при работе с системой odoo. Данный проект отражает ислючительно мой собственный опыт и лично мой взгляд на удобство разработки.</p>\n<h1>Идея</h1>\n<p>В процессе работы с платформой odoo у меня начали появляться рутинные задачи, которые требуют большой усидчивости и внимания. Ситуацию усугбляет то, что отладка и отлов ошибок в них очень сильно затруднен. Например мне нужно создать новый проект, для этого мне нужно подготовить окружение с учетом версий не только odoo но и самого python. А если мне нужно проект сделать совместимым с несколькими версиями то совсем тяжко. И очень часто возникала ситуация когда трудоемкость самого модуля сильно меньше чем затраты не создание окружения и прочих вспомогательных операций. Со временем я осознал что действую в этих ситуациях по определенному шаблону и пришло понимание того, что эти действия необходимо автоматизировать. Вот несколько операций которые вы можете совершать с помощью данного инструмента:</p>\n<ul>\n<li>Создать рабочее окружение для проекта</li>\n<li>Создать архив базы</li>\n<li>Сделать сброс базы</li>\n<li>Восттановить базу из архива</li>\n<li>...</li>\n</ul>\n<p>Так же часть ресурсов разработчика расходуется на упорядочение зависмостей, которые реализованы третьей стороной, например проект muk. Т.е. если бы у нас был инструмент, который бы мог сам скачать сторонние проекты и подключить их к нашему, то это так же сэкономило бы много нервов.</p>\n<h1>Работа с проектом</h1>\n<pre><code>В связи с тем, что чаще всего мне требовалось подхватывать уже существующий проект, то на данный момент автоматизированное развертывание окружение возможно только при наличии git репозитория уже сущствующиего проекта, содержащего odoo модули. Репозиторий должен иметь ветки с именами версий аналогично проекту odoo. Инициализация проекта пока в разработке.\n</code></pre>\n<p>На данный момент работа программы протестирована только на OS GNU/Linux Debian</p>\n<h2>Установка</h2>\n<pre><code>sudo pip3 install odpm\n</code></pre>\n<p>Выбирем или создаем каталог, где будет располагаться наш проект и создаем odpm_project.json файл со следующим содержимым:</p>\n<pre><span class=\"p\">{</span>\n    <span class=\"nt\">\"projects_dir\"</span><span class=\"p\">:</span> <span class=\"s2\">\"/home/my_home_dir/projects/\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"odoo_projects_dir\"</span><span class=\"p\">:</span> <span class=\"s2\">\"/home/www-data/odoo_projects/\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"odoo_dir\"</span><span class=\"p\">:</span> <span class=\"s2\">\"/home/www-data/odoo/\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"odoo_venvs_dir\"</span><span class=\"p\">:</span> <span class=\"s2\">\"/home/www-data/odoo_venvs/\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"dependencies_projects_urls\"</span><span class=\"p\">:</span> <span class=\"p\">[],</span>\n    <span class=\"nt\">\"dev_project_url\"</span><span class=\"p\">:</span> <span class=\"s2\">\"https://yartsev@bitbucket.org/yartsevco/solid_pos.git\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"odoo_version_for_project\"</span><span class=\"p\">:</span> <span class=\"s2\">\"11.0\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"project_name\"</span><span class=\"p\">:</span> <span class=\"s2\">\"oodobno\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"modules_to_update\"</span><span class=\"p\">:[</span><span class=\"s2\">\"solid_pos\"</span><span class=\"p\">],</span>\n    <span class=\"nt\">\"git_servers_params\"</span><span class=\"p\">:{</span>\n         <span class=\"nt\">\"bitbucket.org\"</span><span class=\"p\">:{</span>\n            <span class=\"nt\">\"user\"</span><span class=\"p\">:</span><span class=\"s2\">\"your_login\"</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"password\"</span><span class=\"p\">:</span><span class=\"s2\">\"your_password\"</span>\n        <span class=\"p\">}</span>\n    <span class=\"p\">}</span>\n    <span class=\"s2\">\"database_name\"</span><span class=\"p\">:</span><span class=\"s2\">\"new_db\"</span>\n<span class=\"p\">}</span>\n</pre>\n<p>Каталог с проектом должен находится в месте, указанном в параметре <code>projects_dir</code>.</p>\n<h2>Параметры json файла:</h2>\n<ul>\n<li>projects_dir - каталог с проектами, в данном случаем проект может являть собой не только модули odoo, а нечто большее, так же у меня проект хранит файл конфигурации odoo, и файл запуска odoo в режиме разработки, для каждого проекта они уникальны. Необязательный параметр, по умолчанию будет создан каталог в домашней директории пользователя от имени которого запускается приложение. Тип - строка</li>\n<li>odoo_projects_dir - каталог в который загружаются все проекты которые являют собой либо модуль odoo либо несколько модулей, эти проект должны иметь ветки с именами совподающими с версиями odoo. Необязательный параметр, по умолчанию будет создан каталог в домашней директории пользователя от имени которого запускается приложение. Тип - строка</li>\n<li>odoo_dir - каталог, в который будет склонирована сама odoo из своего официального репозитория. Необязательный параметр, по умолчанию будет создан каталог в домашней директории пользователя от имени которого запускается приложение. Тип - строка</li>\n<li>odoo_venvs_dir - каталог в котором содрежатся виртуальные окружения используемых разработчиком версий odoo. Необязательный параметр, по умолчанию будет создан каталог в домашней директории пользователя от имени которого запускается приложение. Тип - строка</li>\n<li>dependencies_projects_urls - список проектов созданных третьими лицами (например OCA или Muk). Обязательный параметр. Тип - массив.</li>\n<li>dependencies_projects_dirs - список каталогов со сторонними проектами, которые не находятся в git, но тут нет проверки версии, поэтому придется следить самостоятельно за этим. тип - массив</li>\n<li>dev_project_url - ссылка на текущий разрабатываемый проект. Обязательный параметр. Тип - строка</li>\n<li>odoo_version_for_project - имя версии odoo для проекта. Обязательный параметр. Тип - строка.</li>\n<li>project_name - имя текущего проекта, можно не указывать. Если указываете то должно совпадать с именем каталога в котором находится проект. Обязательный параметр. Тип - строка.</li>\n<li>git_servers_params -  можно указать сервера и логин с паролем для него, чтобы odpm при работе с закрытыми репозиториями не спрашивал пароли, но данное решение не является безопасным, используете на свой страх и риск. Обязательный параметр. Тип - объект.</li>\n<li>database_name - имя базы данных, которое будет использовано при разработке. Необязательный параметр, по умолчанию будет создана баз с именем проекта с прибавлениме версии odoo. Такой подход позволяет быстро переключаться между версий системы. Тип - строка.</li>\n<li>modules_to_update -  список модулей, который будет установлен при первом запуске базы или автоматически обновлен при перезапуске. Обязательный параметр. Тип - массив.</li>\n</ul>\n<h1>Параметры коммандной строки</h1>\n<ul>\n<li>--drop-db - укажите через пробел имя базы данных для сброса</li>\n<li>--backup-db - используется совместно с параметром --arch-path, позволяет сделать архив базы данных</li>\n<li>--restore-db - используется совместно с параметром --arch-path, позволяет восстановить архив базы данных</li>\n<li>--arch-path - путь к архиву базы данных, используется для создания и восстановления архивов баз</li>\n<li>--update -  делает  git pull во всех репозиториях odoo и проектах с модулями odoo</li>\n<li>--project-path - данный парметр позволяет запустить odpm в контесте другого проекта</li>\n<li>--dev-restart - запустит odoo с вашим проектом выводом консоли</li>\n<li>--create-module - создаст заготовку модуля из шаблона, в отличии от стандартного в шаблоне присутствует часть фронтэнда</li>\n<li>--change-password - замена пароля в базе, которая указана в проекте, на указанный в параметре</li>\n</ul>\n<h1>Примеры</h1>\n<pre><code>\n</code></pre>\n<p>Дорожная карта:</p>\n<ul>\n<li>сброс базы +</li>\n<li>бекап базы +</li>\n<li>восстановление базы +</li>\n<li>создание модуля odoo с файлами для фронтэнда +</li>\n<li>обновить git репозитории +</li>\n<li>принудительная пересборка окружения virtualenv -</li>\n<li>инициализазия проекта +</li>\n<li>сделать файл конфигурации для глобальных значений -</li>\n<li>нужно добавить сбор ключей для git серверов - ???</li>\n</ul>\n<h1>История изменений</h1>\n<hr>\n<ul>\n<li>\n<p><strong>Release 0.0.14 (01-02-2020)</strong></p>\n<ul>\n<li>Добавлена команда --change-password  для смены пароля администратора системы</li>\n</ul>\n</li>\n<li>\n<p><strong>Release 0.0.1 (03-01-2020)</strong></p>\n<ul>\n<li>Первый релиз</li>\n</ul>\n</li>\n</ul>\n\n          </div>"}, "last_serial": 6667906, "releases": {"0.0.10": [{"comment_text": "", "digests": {"md5": "54e15afe4aafc169fa6e2d214a891a74", "sha256": "e00ea1eddea3c72aad76700216f229ae6a7b3b23c42e02f3d213c5792b2a8911"}, "downloads": -1, "filename": "odpm-0.0.10-py3-none-any.whl", "has_sig": false, "md5_digest": "54e15afe4aafc169fa6e2d214a891a74", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 31953, "upload_time": "2020-01-08T20:59:41", "upload_time_iso_8601": "2020-01-08T20:59:41.652505Z", "url": "https://files.pythonhosted.org/packages/c1/b9/69e7a33ed43c90ccb848cd706259aa210a9a82002d29b7e809ecbc6b4667/odpm-0.0.10-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "59ddd450cf6c005c9dd0c51a87f44aab", "sha256": "61eec1c2acb438e4ebcfd069b5e895275cea5391b9afcc9caae475346ef81fe7"}, "downloads": -1, "filename": "odpm-0.0.10.tar.gz", "has_sig": false, "md5_digest": "59ddd450cf6c005c9dd0c51a87f44aab", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 31063, "upload_time": "2020-01-08T20:59:43", "upload_time_iso_8601": "2020-01-08T20:59:43.521372Z", "url": "https://files.pythonhosted.org/packages/65/5d/507aa49df1040ed90bc43c477ef92e866035c2126cfe93b73e99fdefba33/odpm-0.0.10.tar.gz", "yanked": false}], "0.0.11": [{"comment_text": "", "digests": {"md5": "cc4acfe2ad374ce9fd34c8a1c2efb726", "sha256": "32fb85656be677324e43afbe1b346b9e30139ebe5b27d36562171d3b99dbb619"}, "downloads": -1, "filename": "odpm-0.0.11-py3-none-any.whl", "has_sig": false, "md5_digest": "cc4acfe2ad374ce9fd34c8a1c2efb726", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 31927, "upload_time": "2020-01-28T07:12:03", "upload_time_iso_8601": "2020-01-28T07:12:03.934399Z", "url": "https://files.pythonhosted.org/packages/97/d0/1fb0e742f9586913dccce18cbd2800dfbf20087acdc65c32c5de1c9cc1bb/odpm-0.0.11-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "52a1f9e469d224e0047c51252e970664", "sha256": "12447c8c1c2ca8dae28c2d7deba7719a0071d57fcade779a96edb1b1117d998e"}, "downloads": -1, "filename": "odpm-0.0.11.tar.gz", "has_sig": false, "md5_digest": "52a1f9e469d224e0047c51252e970664", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 31051, "upload_time": "2020-01-28T07:12:05", "upload_time_iso_8601": "2020-01-28T07:12:05.890774Z", "url": "https://files.pythonhosted.org/packages/7b/f2/ba9eda1a33f48d9e29ef23b191a6dc0784e3bcf95785e9e28e39e9286cfe/odpm-0.0.11.tar.gz", "yanked": false}], "0.0.12": [{"comment_text": "", "digests": {"md5": "1fbc9243fbfd392440a250f450b09bbe", "sha256": "c10c3974ba3436d824728392244e3459a54859d31910fb8bcf848cc3cd11146a"}, "downloads": -1, "filename": "odpm-0.0.12-py3-none-any.whl", "has_sig": false, "md5_digest": "1fbc9243fbfd392440a250f450b09bbe", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 31929, "upload_time": "2020-01-28T07:19:39", "upload_time_iso_8601": "2020-01-28T07:19:39.026898Z", "url": "https://files.pythonhosted.org/packages/e8/46/3a5420072e6a2bf8c8b46f522528d7782fa64f877a17bcdddd56bbb3d20d/odpm-0.0.12-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ace6399a2d8f248c720e59d0af12775c", "sha256": "a2647ec511de483a75f686165e72f249de3536e0d0dd308078853ef44a794bb9"}, "downloads": -1, "filename": "odpm-0.0.12.tar.gz", "has_sig": false, "md5_digest": "ace6399a2d8f248c720e59d0af12775c", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 31057, "upload_time": "2020-01-28T07:19:40", "upload_time_iso_8601": "2020-01-28T07:19:40.988340Z", "url": "https://files.pythonhosted.org/packages/77/de/3fa64e543aae6000e303fa9bc13f1ae7cd1bf92534029511ef5836f95cda/odpm-0.0.12.tar.gz", "yanked": false}], "0.0.13": [{"comment_text": "", "digests": {"md5": "847f1a825d93ec259dfbf31598d33eda", "sha256": "78664e9de96facb63103ad4ccc7a428555535786817596d25ff0bbc6f656df19"}, "downloads": -1, "filename": "odpm-0.0.13-py3-none-any.whl", "has_sig": false, "md5_digest": "847f1a825d93ec259dfbf31598d33eda", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 31995, "upload_time": "2020-01-29T09:06:07", "upload_time_iso_8601": "2020-01-29T09:06:07.827363Z", "url": "https://files.pythonhosted.org/packages/e2/ab/0a90f33320b73c0e8787524e9de9340cb14288eadd5b99cbe45a7e486ca9/odpm-0.0.13-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "da3c9c8227a03db968b9662c2cdb33d7", "sha256": "c66d7577e1e7daa7be6c245c4a326433fa12c3af0931d082375d03b52b57419a"}, "downloads": -1, "filename": "odpm-0.0.13.tar.gz", "has_sig": false, "md5_digest": "da3c9c8227a03db968b9662c2cdb33d7", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 31113, "upload_time": "2020-01-29T09:06:09", "upload_time_iso_8601": "2020-01-29T09:06:09.900425Z", "url": "https://files.pythonhosted.org/packages/e8/90/d7d796ef59d7b698241f55a5a973eb545da131b0000e8a339bf1ea315a08/odpm-0.0.13.tar.gz", "yanked": false}], "0.0.14": [{"comment_text": "", "digests": {"md5": "30121552bc9d2e9876ba1d8b275751c4", "sha256": "41293914aeda7b9662c11d6befd41c3376c5fa185ca40b3dd57cb0913c50f69a"}, "downloads": -1, "filename": "odpm-0.0.14-py3-none-any.whl", "has_sig": false, "md5_digest": "30121552bc9d2e9876ba1d8b275751c4", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 32674, "upload_time": "2020-02-01T15:56:55", "upload_time_iso_8601": "2020-02-01T15:56:55.313956Z", "url": "https://files.pythonhosted.org/packages/86/7b/eddba3c4d0ad328e18d1e7db83d9806931c2e70a78a349b2c1a198c9e3d8/odpm-0.0.14-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "65b11007025840f33b21885dcaada3c0", "sha256": "15150f3373c5311974086c6661b09f1bd093593460124b8f603b74bb490d742b"}, "downloads": -1, "filename": "odpm-0.0.14.tar.gz", "has_sig": false, "md5_digest": "65b11007025840f33b21885dcaada3c0", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 31856, "upload_time": "2020-02-01T15:56:56", "upload_time_iso_8601": "2020-02-01T15:56:56.799798Z", "url": "https://files.pythonhosted.org/packages/16/74/c8524d26978b84ff1f3c2ee9b718b89fc99f0cafa3b9d616a355a8fea3e6/odpm-0.0.14.tar.gz", "yanked": false}], "0.0.15": [{"comment_text": "", "digests": {"md5": "6ce09c0cfbcea4306f0aaf6186509542", "sha256": "97bddc38ca16f3800b86fa0e1d3d73a912c03eb891b25ed318b2ab47df03279b"}, "downloads": -1, "filename": "odpm-0.0.15-py3-none-any.whl", "has_sig": false, "md5_digest": "6ce09c0cfbcea4306f0aaf6186509542", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 32681, "upload_time": "2020-02-03T19:53:42", "upload_time_iso_8601": "2020-02-03T19:53:42.225511Z", "url": "https://files.pythonhosted.org/packages/61/cd/46fd0c824346045ac4cc71faed7aefc195008dc5e8b11abda0392e11b4c3/odpm-0.0.15-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0a3890c2538fdcd1cc722ab3b7469fa8", "sha256": "b5bedf4ae8ff8160a99fd90c18192dbf562861c9783586bc73d1bb15ced25dbd"}, "downloads": -1, "filename": "odpm-0.0.15.tar.gz", "has_sig": false, "md5_digest": "0a3890c2538fdcd1cc722ab3b7469fa8", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 31860, "upload_time": "2020-02-03T19:53:44", "upload_time_iso_8601": "2020-02-03T19:53:44.295836Z", "url": "https://files.pythonhosted.org/packages/78/bf/7264c0f91c7423340579adf4e38db12c3487f42bc6d771145c0cc139de4e/odpm-0.0.15.tar.gz", "yanked": false}], "0.0.16": [{"comment_text": "", "digests": {"md5": "46592821fa1b19fab1922350ffa33f81", "sha256": "82b9b941cc24f3f5e39db5533f21f44a869f07aa707b19a80012a014c3292666"}, "downloads": -1, "filename": "odpm-0.0.16-py3-none-any.whl", "has_sig": false, "md5_digest": "46592821fa1b19fab1922350ffa33f81", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 32676, "upload_time": "2020-02-03T20:31:23", "upload_time_iso_8601": "2020-02-03T20:31:23.752905Z", "url": "https://files.pythonhosted.org/packages/9e/2e/3eedcc3c24fe118d20847f89f4770ad49ce1e82e428fd5f985e5dfe85500/odpm-0.0.16-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "48e87a4209493da827c1170d1ab4bd5a", "sha256": "9d630fc5365e7c0e1569b941d2e03ace61e7d934bab02bf7866f51e3e2bf2ce3"}, "downloads": -1, "filename": "odpm-0.0.16.tar.gz", "has_sig": false, "md5_digest": "48e87a4209493da827c1170d1ab4bd5a", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 31855, "upload_time": "2020-02-03T20:31:25", "upload_time_iso_8601": "2020-02-03T20:31:25.618678Z", "url": "https://files.pythonhosted.org/packages/d0/f8/21b727143d5daa460dfe55682eb738a91991de93081b92cf4929fe49a25b/odpm-0.0.16.tar.gz", "yanked": false}], "0.0.17": [{"comment_text": "", "digests": {"md5": "c1bb83514e24153f34c64cda05b63f11", "sha256": "e985146f2a5c1a44588b9dfb7dc730e4caed89f881504f3ad4920966ec82a0c7"}, "downloads": -1, "filename": "odpm-0.0.17-py3-none-any.whl", "has_sig": false, "md5_digest": "c1bb83514e24153f34c64cda05b63f11", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 32702, "upload_time": "2020-02-04T07:23:14", "upload_time_iso_8601": "2020-02-04T07:23:14.331584Z", "url": "https://files.pythonhosted.org/packages/09/a3/dbe299fad05c8a75eeff0d4b75a104fed79978572ee4f28ce822ca4c5623/odpm-0.0.17-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f91823f04491023dd642ae33e9d6f5b2", "sha256": "dfda440b5e5bd9f557694e65835808597510307d5722a997b99ff21bd6bbbe73"}, "downloads": -1, "filename": "odpm-0.0.17.tar.gz", "has_sig": false, "md5_digest": "f91823f04491023dd642ae33e9d6f5b2", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 31931, "upload_time": "2020-02-04T07:23:16", "upload_time_iso_8601": "2020-02-04T07:23:16.317980Z", "url": "https://files.pythonhosted.org/packages/ba/67/c549f3af788b9046b62f5671fb4dbf69a506159041989af240a3be67315b/odpm-0.0.17.tar.gz", "yanked": false}], "0.0.18": [{"comment_text": "", "digests": {"md5": "03240763ea4639a022a29b5ac2d8ad8d", "sha256": "0f3b790d757c930846654bfd2d89ca308af3f889cb783a824582381394968940"}, "downloads": -1, "filename": "odpm-0.0.18-py3-none-any.whl", "has_sig": false, "md5_digest": "03240763ea4639a022a29b5ac2d8ad8d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 32935, "upload_time": "2020-02-20T12:34:37", "upload_time_iso_8601": "2020-02-20T12:34:37.438326Z", "url": "https://files.pythonhosted.org/packages/59/21/4494e8cae65e8c6b0ed5cf133ee70236234ebb05d62254acfca9ad262bd7/odpm-0.0.18-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "fc3d2465987991e6cd23486b71238c6b", "sha256": "d19f9bf1a8ddb4bb59f97e019b53b32252828c62b520b4078d12a8161fe9f0a3"}, "downloads": -1, "filename": "odpm-0.0.18.tar.gz", "has_sig": false, "md5_digest": "fc3d2465987991e6cd23486b71238c6b", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 32263, "upload_time": "2020-02-20T12:34:39", "upload_time_iso_8601": "2020-02-20T12:34:39.460781Z", "url": "https://files.pythonhosted.org/packages/ed/fb/1c20676c0b150186525d0867979fefe044ab9597a6588be517a61fdc1f31/odpm-0.0.18.tar.gz", "yanked": false}], "0.0.5": [{"comment_text": "", "digests": {"md5": "f91113b52174def70ebd36a47d2b1bda", "sha256": "9fe8f63f13fa8b72b07818e42d4cfb410b705efecd1c3c7575752434320f8c5a"}, "downloads": -1, "filename": "odpm-0.0.5-py3-none-any.whl", "has_sig": false, "md5_digest": "f91113b52174def70ebd36a47d2b1bda", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 25082, "upload_time": "2020-01-03T19:57:32", "upload_time_iso_8601": "2020-01-03T19:57:32.467449Z", "url": "https://files.pythonhosted.org/packages/e1/0e/c0763fba18e9b9a8dfaa249a26d0f7a6ea2953546e1ec03ca9be47cfaed7/odpm-0.0.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "24e94d9fe300c8f5f4912dc13efa2b58", "sha256": "ef71547531a0808c5796ee2d6b2804999a35a70f4a5fe09b24e30bf94a92f4b3"}, "downloads": -1, "filename": "odpm-0.0.5.tar.gz", "has_sig": false, "md5_digest": "24e94d9fe300c8f5f4912dc13efa2b58", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 12573, "upload_time": "2020-01-03T19:57:35", "upload_time_iso_8601": "2020-01-03T19:57:35.139060Z", "url": "https://files.pythonhosted.org/packages/8b/03/5d0bfbc8255306afd3eb912cfde007dfac3588f6a681fae0580ad11a03ab/odpm-0.0.5.tar.gz", "yanked": false}], "0.0.6": [{"comment_text": "", "digests": {"md5": "f6cb47c8d51afc8fa755be45138c7333", "sha256": "59ab84d3b8dfc13a55fdc474c12636d69997e8aeb153349a499d9cc9a373d05a"}, "downloads": -1, "filename": "odpm-0.0.6-py3-none-any.whl", "has_sig": false, "md5_digest": "f6cb47c8d51afc8fa755be45138c7333", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 31281, "upload_time": "2020-01-03T21:39:21", "upload_time_iso_8601": "2020-01-03T21:39:21.680027Z", "url": "https://files.pythonhosted.org/packages/b6/5d/114f21c854b762702239370ef16021092f787bf2bc55165df59488bc0fd0/odpm-0.0.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d96c9f01c66907c3cbe8339d15a19629", "sha256": "5a708688e64794603cd3b02297b00805287becada84811836facd60d78d59a5f"}, "downloads": -1, "filename": "odpm-0.0.6.tar.gz", "has_sig": false, "md5_digest": "d96c9f01c66907c3cbe8339d15a19629", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 30380, "upload_time": "2020-01-03T21:39:23", "upload_time_iso_8601": "2020-01-03T21:39:23.663912Z", "url": "https://files.pythonhosted.org/packages/d9/86/7195bfdd222b1b9cbbddddc3fc85fb43f16805ddd20a6c21ff308219180a/odpm-0.0.6.tar.gz", "yanked": false}], "0.0.7": [{"comment_text": "", "digests": {"md5": "14c74c0c06892fb2a76c2b9ea5abbd10", "sha256": "11fcc881a9082a9dfcea177523c22762b6b830072d2ae7847c8107ce4d1dba95"}, "downloads": -1, "filename": "odpm-0.0.7-py3-none-any.whl", "has_sig": false, "md5_digest": "14c74c0c06892fb2a76c2b9ea5abbd10", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 31413, "upload_time": "2020-01-04T10:19:00", "upload_time_iso_8601": "2020-01-04T10:19:00.702498Z", "url": "https://files.pythonhosted.org/packages/15/7e/84fd89f869104d5a41b5fa5d1dd2ee0d4a9eb5430a677fadcc6783df6687/odpm-0.0.7-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "67266aab10e55f7aefa9ee1671acc4ca", "sha256": "1c9ada6408c09d05ab0f325f397d858fee0ec240d3f95f5c59bdf6cc8c01c546"}, "downloads": -1, "filename": "odpm-0.0.7.tar.gz", "has_sig": false, "md5_digest": "67266aab10e55f7aefa9ee1671acc4ca", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 30409, "upload_time": "2020-01-04T10:19:02", "upload_time_iso_8601": "2020-01-04T10:19:02.753907Z", "url": "https://files.pythonhosted.org/packages/d8/73/b89079439bd99a1545bd40c137663f8642831f033f4bada4e128d8b14633/odpm-0.0.7.tar.gz", "yanked": false}], "0.0.8": [{"comment_text": "", "digests": {"md5": "1d04b1446f543aba28879ee09a0335d0", "sha256": "d89c651db9550304545abb20bf9c98179f2e318f1a56664fef4763d8ba7d5cfd"}, "downloads": -1, "filename": "odpm-0.0.8-py3-none-any.whl", "has_sig": false, "md5_digest": "1d04b1446f543aba28879ee09a0335d0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 31882, "upload_time": "2020-01-08T10:14:33", "upload_time_iso_8601": "2020-01-08T10:14:33.112540Z", "url": "https://files.pythonhosted.org/packages/d2/81/96fe1e7fe12857cb5ea0d168d4b722bd2b37e23befe886b1ce5adc90803a/odpm-0.0.8-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "c5f9cd1178f0b817ad39ada6a8d065cc", "sha256": "47f5344bf88ccc677507f08effb30fb0b7a03f4e778e9418b3729e1a43e4ebcd"}, "downloads": -1, "filename": "odpm-0.0.8.tar.gz", "has_sig": false, "md5_digest": "c5f9cd1178f0b817ad39ada6a8d065cc", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 30943, "upload_time": "2020-01-08T10:14:35", "upload_time_iso_8601": "2020-01-08T10:14:35.994782Z", "url": "https://files.pythonhosted.org/packages/6e/d5/44558452a758288e2c3ff05a09e0fae7521ed7a3ea595b2ed6121f0912ea/odpm-0.0.8.tar.gz", "yanked": false}], "0.0.9": [{"comment_text": "", "digests": {"md5": "ce69996e35b7ac95ba3fc35cdb87b39c", "sha256": "10326a4681f2a29f8123debcc8592f90dc56016046e1dc1b29a0aa614ee470ff"}, "downloads": -1, "filename": "odpm-0.0.9-py3-none-any.whl", "has_sig": false, "md5_digest": "ce69996e35b7ac95ba3fc35cdb87b39c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 31876, "upload_time": "2020-01-08T14:22:19", "upload_time_iso_8601": "2020-01-08T14:22:19.305005Z", "url": "https://files.pythonhosted.org/packages/05/f7/9b534807bb27e565945b176ccb9c5b32eac3b36c54ffc6df53160d716d1f/odpm-0.0.9-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "2a165920ea85ba58abf24163e05ad029", "sha256": "23105ecf255ff87afe1f2b2e56d3181d5e5c1ccf411f348b834118a76763ece8"}, "downloads": -1, "filename": "odpm-0.0.9.tar.gz", "has_sig": false, "md5_digest": "2a165920ea85ba58abf24163e05ad029", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 30930, "upload_time": "2020-01-08T14:22:21", "upload_time_iso_8601": "2020-01-08T14:22:21.235223Z", "url": "https://files.pythonhosted.org/packages/d1/8c/0bda531ab7deb04f40d62bc5adc1a9b7b01d60f0d69d568c159c14df5e06/odpm-0.0.9.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "03240763ea4639a022a29b5ac2d8ad8d", "sha256": "0f3b790d757c930846654bfd2d89ca308af3f889cb783a824582381394968940"}, "downloads": -1, "filename": "odpm-0.0.18-py3-none-any.whl", "has_sig": false, "md5_digest": "03240763ea4639a022a29b5ac2d8ad8d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 32935, "upload_time": "2020-02-20T12:34:37", "upload_time_iso_8601": "2020-02-20T12:34:37.438326Z", "url": "https://files.pythonhosted.org/packages/59/21/4494e8cae65e8c6b0ed5cf133ee70236234ebb05d62254acfca9ad262bd7/odpm-0.0.18-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "fc3d2465987991e6cd23486b71238c6b", "sha256": "d19f9bf1a8ddb4bb59f97e019b53b32252828c62b520b4078d12a8161fe9f0a3"}, "downloads": -1, "filename": "odpm-0.0.18.tar.gz", "has_sig": false, "md5_digest": "fc3d2465987991e6cd23486b71238c6b", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 32263, "upload_time": "2020-02-20T12:34:39", "upload_time_iso_8601": "2020-02-20T12:34:39.460781Z", "url": "https://files.pythonhosted.org/packages/ed/fb/1c20676c0b150186525d0867979fefe044ab9597a6588be517a61fdc1f31/odpm-0.0.18.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:05:04 2020"}