{"info": {"author": "Jesse Li", "author_email": "jessejesse123@gmail.com", "bugtrack_url": null, "classifiers": [], "description": "****\nOmen\n****\nI'm experimenting with markov chains, so this code prioritizes readability over performance. Perhaps it can be of use for you.\nIt uses ``nltk`` for tokenization and detokenization, since the focus is on the markov chain itself, not than the yak shaving.\n\nThe repo includes a sample corpus: the complete text of Charlotte Brontë's *Jane Eyre*, downloaded from\n`Project Gutenberg`_. Project Gutenberg license below.\n\n.. _Project Gutenberg: https://www.gutenberg.org/files/1260/1260-h/1260-h.htm\n\nResults\n#######\n    They betray an unfortunate state of mind: they merit severe reproof: they would rise, and pass all my time in the nursery, and feared to find death.\n\n    Half reclined on a couch appeared Mr. Rochester, \\`\\`if you do not inquire why Mr. Briggs sought after you—what he wanted with you.\n\n    You say truly; but no coldness, and no further reference made to it by two broad steps, and looking through, I thought Moor House as complete a model of elderly English respectability.\n\n    One never knows what she has, sir: no words could tell you what I suffered when I sought all England over, I can slip away unnoticed.\n\n    There was a grass-grown track descending the forest aisle between hoar and knotty shafts and under branched arches.\n\nInstallation\n############\n::\n\n  $ pip install omen\n\nUsage\n#####\n\n>>> from omen import Omen\n>>> omen = Omen()\n>>> omen.train(open(\"corpus.txt\").read())\n>>> omen.generate()\n'Not, certainly, that of a man, turned his head slowly towards where I stood I could see him plainly.'\n>>> omen.dump_states(open(\"states.pkl\", \"wb\"))\n>>> omen.load_states(open(\"states.pkl\", \"rb\"))\n>>> omen.generate()\n\"A quarter of an hour's length, in which I communicated it: yet six months after he wrote to me of a Jane Eyre: I have been, for none of the Reeds were there, they say, almost like a dog quarrelling.\"\n\nNote that due to the Markov chain's structure, the model may be trained online over multiple corpora as if they were a single\nbody of text:\n\n>>> omen.train(open(\"jane_eyre.txt\").read())\n>>> omen.train(open(\"twenty_thousand_leagues.txt\").read())\n>>> omen.generate()\n'Last night I can not say it with his harpoon, a dreadful weapon in his hands.'\n\nConfiguration\n#############\n\nSpecify state size (defaults to 3. Higher sizes produce sentences that are more coherent but less original; you need more\ntraining data the higher you set the state size):\n\n>>> omen = Omen(state_size=2)\n\nOverriding functions:\n*********************\n\nYou may override the following functions:\n\n- ``sentence_tokenize``\n- ``word_tokenize``\n- ``detokenize``\n- ``weighted_choice`` (I'm not sure why you would want to override this function, but the option's there)\n\nExample:\n\n>>> import omen\n>>> o = omen.Omen()\n>>> o.train(open(\"corpus.txt\").read())\n>>>\n>>> omen.detokenize = lambda x: \" $$$ \".join(x)\n>>> o.generate()\nBut $$$ you $$$ can $$$ not $$$ be $$$ , $$$ sir $$$ , $$$ that $$$ I $$$ desired $$$ perfection $$$ , $$$ either $$$ of $$$ mind $$$ or $$$ person $$$ .'\n\nProject Gutenberg license\n#########################\n::\n\n    THE FULL PROJECT GUTENBERG LICENSE\n    PLEASE READ THIS BEFORE YOU DISTRIBUTE OR USE THIS WORK\n\n    To protect the Project Gutenberg-tm mission of promoting the free\n    distribution of electronic works, by using or distributing this work\n    (or any other work associated in any way with the phrase \"Project\n    Gutenberg\"), you agree to comply with all the terms of the Full Project\n    Gutenberg-tm License (available with this file or online at\n    http://www.gutenberg.org/license).\n\n\n    Section 1.  General Terms of Use and Redistributing Project Gutenberg-tm\n    electronic works\n\n    1.A.  By reading or using any part of this Project Gutenberg-tm\n    electronic work, you indicate that you have read, understand, agree to\n    and accept all the terms of this license and intellectual property\n    (trademark/copyright) agreement.  If you do not agree to abide by all\n    the terms of this agreement, you must cease using and return or destroy\n    all copies of Project Gutenberg-tm electronic works in your possession.\n    If you paid a fee for obtaining a copy of or access to a Project\n    Gutenberg-tm electronic work and you do not agree to be bound by the\n    terms of this agreement, you may obtain a refund from the person or\n    entity to whom you paid the fee as set forth in paragraph 1.E.8.\n\n    1.B.  \"Project Gutenberg\" is a registered trademark.  It may only be\n    used on or associated in any way with an electronic work by people who\n    agree to be bound by the terms of this agreement.  There are a few\n    things that you can do with most Project Gutenberg-tm electronic works\n    even without complying with the full terms of this agreement.  See\n    paragraph 1.C below.  There are a lot of things you can do with Project\n    Gutenberg-tm electronic works if you follow the terms of this agreement\n    and help preserve free future access to Project Gutenberg-tm electronic\n    works.  See paragraph 1.E below.\n\n    1.C.  The Project Gutenberg Literary Archive Foundation (\"the Foundation\"\n    or PGLAF), owns a compilation copyright in the collection of Project\n    Gutenberg-tm electronic works.  Nearly all the individual works in the\n    collection are in the public domain in the United States.  If an\n    individual work is in the public domain in the United States and you are\n    located in the United States, we do not claim a right to prevent you from\n    copying, distributing, performing, displaying or creating derivative\n    works based on the work as long as all references to Project Gutenberg\n    are removed.  Of course, we hope that you will support the Project\n    Gutenberg-tm mission of promoting free access to electronic works by\n    freely sharing Project Gutenberg-tm works in compliance with the terms of\n    this agreement for keeping the Project Gutenberg-tm name associated with\n    the work.  You can easily comply with the terms of this agreement by\n    keeping this work in the same format with its attached full Project\n    Gutenberg-tm License when you share it without charge with others.\n\n    1.D.  The copyright laws of the place where you are located also govern\n    what you can do with this work.  Copyright laws in most countries are in\n    a constant state of change.  If you are outside the United States, check\n    the laws of your country in addition to the terms of this agreement\n    before downloading, copying, displaying, performing, distributing or\n    creating derivative works based on this work or any other Project\n    Gutenberg-tm work.  The Foundation makes no representations concerning\n    the copyright status of any work in any country outside the United\n    States.\n\n    1.E.  Unless you have removed all references to Project Gutenberg:\n\n    1.E.1.  The following sentence, with active links to, or other immediate\n    access to, the full Project Gutenberg-tm License must appear prominently\n    whenever any copy of a Project Gutenberg-tm work (any work on which the\n    phrase \"Project Gutenberg\" appears, or with which the phrase \"Project\n    Gutenberg\" is associated) is accessed, displayed, performed, viewed,\n    copied or distributed:\n\n    This eBook is for the use of anyone anywhere at no cost and with\n    almost no restrictions whatsoever.  You may copy it, give it away or\n    re-use it under the terms of the Project Gutenberg License included\n    with this eBook or online at www.gutenberg.org\n\n    1.E.2.  If an individual Project Gutenberg-tm electronic work is derived\n    from the public domain (does not contain a notice indicating that it is\n    posted with permission of the copyright holder), the work can be copied\n    and distributed to anyone in the United States without paying any fees\n    or charges.  If you are redistributing or providing access to a work\n    with the phrase \"Project Gutenberg\" associated with or appearing on the\n    work, you must comply either with the requirements of paragraphs 1.E.1\n    through 1.E.7 or obtain permission for the use of the work and the\n    Project Gutenberg-tm trademark as set forth in paragraphs 1.E.8 or\n    1.E.9.\n\n    1.E.3.  If an individual Project Gutenberg-tm electronic work is posted\n    with the permission of the copyright holder, your use and distribution\n    must comply with both paragraphs 1.E.1 through 1.E.7 and any additional\n    terms imposed by the copyright holder.  Additional terms will be linked\n    to the Project Gutenberg-tm License for all works posted with the\n    permission of the copyright holder found at the beginning of this work.\n\n    1.E.4.  Do not unlink or detach or remove the full Project Gutenberg-tm\n    License terms from this work, or any files containing a part of this\n    work or any other work associated with Project Gutenberg-tm.\n\n    1.E.5.  Do not copy, display, perform, distribute or redistribute this\n    electronic work, or any part of this electronic work, without\n    prominently displaying the sentence set forth in paragraph 1.E.1 with\n    active links or immediate access to the full terms of the Project\n    Gutenberg-tm License.\n\n    1.E.6.  You may convert to and distribute this work in any binary,\n    compressed, marked up, nonproprietary or proprietary form, including any\n    word processing or hypertext form.  However, if you provide access to or\n    distribute copies of a Project Gutenberg-tm work in a format other than\n    \"Plain Vanilla ASCII\" or other format used in the official version\n    posted on the official Project Gutenberg-tm web site (www.gutenberg.org),\n    you must, at no additional cost, fee or expense to the user, provide a\n    copy, a means of exporting a copy, or a means of obtaining a copy upon\n    request, of the work in its original \"Plain Vanilla ASCII\" or other\n    form.  Any alternate format must include the full Project Gutenberg-tm\n    License as specified in paragraph 1.E.1.\n\n    1.E.7.  Do not charge a fee for access to, viewing, displaying,\n    performing, copying or distributing any Project Gutenberg-tm works\n    unless you comply with paragraph 1.E.8 or 1.E.9.\n\n    1.E.8.  You may charge a reasonable fee for copies of or providing\n    access to or distributing Project Gutenberg-tm electronic works provided\n    that\n\n    - You pay a royalty fee of 20% of the gross profits you derive from\n         the use of Project Gutenberg-tm works calculated using the method\n         you already use to calculate your applicable taxes.  The fee is\n         owed to the owner of the Project Gutenberg-tm trademark, but he\n         has agreed to donate royalties under this paragraph to the\n         Project Gutenberg Literary Archive Foundation.  Royalty payments\n         must be paid within 60 days following each date on which you\n         prepare (or are legally required to prepare) your periodic tax\n         returns.  Royalty payments should be clearly marked as such and\n         sent to the Project Gutenberg Literary Archive Foundation at the\n         address specified in Section 4, \"Information about donations to\n         the Project Gutenberg Literary Archive Foundation.\"\n\n    - You provide a full refund of any money paid by a user who notifies\n         you in writing (or by e-mail) within 30 days of receipt that s/he\n         does not agree to the terms of the full Project Gutenberg-tm\n         License.  You must require such a user to return or\n         destroy all copies of the works possessed in a physical medium\n         and discontinue all use of and all access to other copies of\n         Project Gutenberg-tm works.\n\n    - You provide, in accordance with paragraph 1.F.3, a full refund of any\n         money paid for a work or a replacement copy, if a defect in the\n         electronic work is discovered and reported to you within 90 days\n         of receipt of the work.\n\n    - You comply with all other terms of this agreement for free\n         distribution of Project Gutenberg-tm works.\n\n    1.E.9.  If you wish to charge a fee or distribute a Project Gutenberg-tm\n    electronic work or group of works on different terms than are set\n    forth in this agreement, you must obtain permission in writing from\n    both the Project Gutenberg Literary Archive Foundation and Michael\n    Hart, the owner of the Project Gutenberg-tm trademark.  Contact the\n    Foundation as set forth in Section 3 below.\n\n    1.F.\n\n    1.F.1.  Project Gutenberg volunteers and employees expend considerable\n    effort to identify, do copyright research on, transcribe and proofread\n    public domain works in creating the Project Gutenberg-tm\n    collection.  Despite these efforts, Project Gutenberg-tm electronic\n    works, and the medium on which they may be stored, may contain\n    \"Defects,\" such as, but not limited to, incomplete, inaccurate or\n    corrupt data, transcription errors, a copyright or other intellectual\n    property infringement, a defective or damaged disk or other medium, a\n    computer virus, or computer codes that damage or cannot be read by\n    your equipment.\n\n    1.F.2.  LIMITED WARRANTY, DISCLAIMER OF DAMAGES - Except for the \"Right\n    of Replacement or Refund\" described in paragraph 1.F.3, the Project\n    Gutenberg Literary Archive Foundation, the owner of the Project\n    Gutenberg-tm trademark, and any other party distributing a Project\n    Gutenberg-tm electronic work under this agreement, disclaim all\n    liability to you for damages, costs and expenses, including legal\n    fees.  YOU AGREE THAT YOU HAVE NO REMEDIES FOR NEGLIGENCE, STRICT\n    LIABILITY, BREACH OF WARRANTY OR BREACH OF CONTRACT EXCEPT THOSE\n    PROVIDED IN PARAGRAPH F3.  YOU AGREE THAT THE FOUNDATION, THE\n    TRADEMARK OWNER, AND ANY DISTRIBUTOR UNDER THIS AGREEMENT WILL NOT BE\n    LIABLE TO YOU FOR ACTUAL, DIRECT, INDIRECT, CONSEQUENTIAL, PUNITIVE OR\n    INCIDENTAL DAMAGES EVEN IF YOU GIVE NOTICE OF THE POSSIBILITY OF SUCH\n    DAMAGE.\n\n    1.F.3.  LIMITED RIGHT OF REPLACEMENT OR REFUND - If you discover a\n    defect in this electronic work within 90 days of receiving it, you can\n    receive a refund of the money (if any) you paid for it by sending a\n    written explanation to the person you received the work from.  If you\n    received the work on a physical medium, you must return the medium with\n    your written explanation.  The person or entity that provided you with\n    the defective work may elect to provide a replacement copy in lieu of a\n    refund.  If you received the work electronically, the person or entity\n    providing it to you may choose to give you a second opportunity to\n    receive the work electronically in lieu of a refund.  If the second copy\n    is also defective, you may demand a refund in writing without further\n    opportunities to fix the problem.\n\n    1.F.4.  Except for the limited right of replacement or refund set forth\n    in paragraph 1.F.3, this work is provided to you 'AS-IS', WITH NO OTHER\n    WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO\n    WARRANTIES OF MERCHANTIBILITY OR FITNESS FOR ANY PURPOSE.\n\n    1.F.5.  Some states do not allow disclaimers of certain implied\n    warranties or the exclusion or limitation of certain types of damages.\n    If any disclaimer or limitation set forth in this agreement violates the\n    law of the state applicable to this agreement, the agreement shall be\n    interpreted to make the maximum disclaimer or limitation permitted by\n    the applicable state law.  The invalidity or unenforceability of any\n    provision of this agreement shall not void the remaining provisions.\n\n    1.F.6.  INDEMNITY - You agree to indemnify and hold the Foundation, the\n    trademark owner, any agent or employee of the Foundation, anyone\n    providing copies of Project Gutenberg-tm electronic works in accordance\n    with this agreement, and any volunteers associated with the production,\n    promotion and distribution of Project Gutenberg-tm electronic works,\n    harmless from all liability, costs and expenses, including legal fees,\n    that arise directly or indirectly from any of the following which you do\n    or cause to occur: (a) distribution of this or any Project Gutenberg-tm\n    work, (b) alteration, modification, or additions or deletions to any\n    Project Gutenberg-tm work, and (c) any Defect you cause.\n\n\n    Section  2.  Information about the Mission of Project Gutenberg-tm\n\n    Project Gutenberg-tm is synonymous with the free distribution of\n    electronic works in formats readable by the widest variety of computers\n    including obsolete, old, middle-aged and new computers.  It exists\n    because of the efforts of hundreds of volunteers and donations from\n    people in all walks of life.\n\n    Volunteers and financial support to provide volunteers with the\n    assistance they need, is critical to reaching Project Gutenberg-tm's\n    goals and ensuring that the Project Gutenberg-tm collection will\n    remain freely available for generations to come.  In 2001, the Project\n    Gutenberg Literary Archive Foundation was created to provide a secure\n    and permanent future for Project Gutenberg-tm and future generations.\n    To learn more about the Project Gutenberg Literary Archive Foundation\n    and how your efforts and donations can help, see Sections 3 and 4\n    and the Foundation web page at http://www.gutenberg.org/fundraising/pglaf.\n\n\n    Section 3.  Information about the Project Gutenberg Literary Archive\n    Foundation\n\n    The Project Gutenberg Literary Archive Foundation is a non profit\n    501(c)(3) educational corporation organized under the laws of the\n    state of Mississippi and granted tax exempt status by the Internal\n    Revenue Service.  The Foundation's EIN or federal tax identification\n    number is 64-6221541.  Contributions to the Project Gutenberg\n    Literary Archive Foundation are tax deductible to the full extent\n    permitted by U.S. federal laws and your state's laws.\n\n    The Foundation's principal office is located at 4557 Melan Dr. S.\n    Fairbanks, AK, 99712., but its volunteers and employees are scattered\n    throughout numerous locations.  Its business office is located at\n    809 North 1500 West, Salt Lake City, UT 84116, (801) 596-1887, email\n    business@pglaf.org.  Email contact links and up to date contact\n    information can be found at the Foundation's web site and official\n    page at http://www.gutenberg.org/about/contact\n\n    For additional contact information:\n         Dr. Gregory B. Newby\n         Chief Executive and Director\n         gbnewby@pglaf.org\n\n    Section 4.  Information about Donations to the Project Gutenberg\n    Literary Archive Foundation\n\n    Project Gutenberg-tm depends upon and cannot survive without wide\n    spread public support and donations to carry out its mission of\n    increasing the number of public domain and licensed works that can be\n    freely distributed in machine readable form accessible by the widest\n    array of equipment including outdated equipment.  Many small donations\n    ($1 to $5,000) are particularly important to maintaining tax exempt\n    status with the IRS.\n\n    The Foundation is committed to complying with the laws regulating\n    charities and charitable donations in all 50 states of the United\n    States.  Compliance requirements are not uniform and it takes a\n    considerable effort, much paperwork and many fees to meet and keep up\n    with these requirements.  We do not solicit donations in locations\n    where we have not received written confirmation of compliance.  To\n    SEND DONATIONS or determine the status of compliance for any\n    particular state visit http://www.gutenberg.org/fundraising/donate\n\n    While we cannot and do not solicit contributions from states where we\n    have not met the solicitation requirements, we know of no prohibition\n    against accepting unsolicited donations from donors in such states who\n    approach us with offers to donate.\n\n    International donations are gratefully accepted, but we cannot make\n    any statements concerning tax treatment of donations received from\n    outside the United States.  U.S. laws alone swamp our small staff.\n\n    Please check the Project Gutenberg Web pages for current donation\n    methods and addresses.  Donations are accepted in a number of other\n    ways including checks, online payments and credit card donations.\n    To donate, please visit:\n    http://www.gutenberg.org/fundraising/donate\n\n\n    Section 5.  General Information About Project Gutenberg-tm electronic\n    works.\n\n    Professor Michael S. Hart is the originator of the Project Gutenberg-tm\n    concept of a library of electronic works that could be freely shared\n    with anyone.  For thirty years, he produced and distributed Project\n    Gutenberg-tm eBooks with only a loose network of volunteer support.\n\n    Project Gutenberg-tm eBooks are often created from several printed\n    editions, all of which are confirmed as Public Domain in the U.S.\n    unless a copyright notice is included.  Thus, we do not necessarily\n    keep eBooks in compliance with any particular paper edition.\n\n    Most people start at our Web site which has the main PG search facility:\n\n         http://www.gutenberg.org\n\n    This Web site includes information about Project Gutenberg-tm,\n    including how to make donations to the Project Gutenberg Literary\n    Archive Foundation, how to help produce our new eBooks, and how to\n    subscribe to our email newsletter to hear about new eBooks.\n\n\n", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/veggiedefender/omen", "keywords": "markov chain nlp", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "omen", "package_url": "https://pypi.org/project/omen/", "platform": "", "project_url": "https://pypi.org/project/omen/", "project_urls": {"Homepage": "https://github.com/veggiedefender/omen"}, "release_url": "https://pypi.org/project/omen/1.4/", "requires_dist": ["nltk", "dill"], "requires_python": "", "summary": "Simple markov chain library", "version": "1.4", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>I’m experimenting with markov chains, so this code prioritizes readability over performance. Perhaps it can be of use for you.\nIt uses <tt>nltk</tt> for tokenization and detokenization, since the focus is on the markov chain itself, not than the yak shaving.</p>\n<p>The repo includes a sample corpus: the complete text of Charlotte Brontë’s <em>Jane Eyre</em>, downloaded from\n<a href=\"https://www.gutenberg.org/files/1260/1260-h/1260-h.htm\" rel=\"nofollow\">Project Gutenberg</a>. Project Gutenberg license below.</p>\n<div id=\"results\">\n<h2>Results</h2>\n<blockquote>\n<p>They betray an unfortunate state of mind: they merit severe reproof: they would rise, and pass all my time in the nursery, and feared to find death.</p>\n<p>Half reclined on a couch appeared Mr. Rochester, ``if you do not inquire why Mr. Briggs sought after you—what he wanted with you.</p>\n<p>You say truly; but no coldness, and no further reference made to it by two broad steps, and looking through, I thought Moor House as complete a model of elderly English respectability.</p>\n<p>One never knows what she has, sir: no words could tell you what I suffered when I sought all England over, I can slip away unnoticed.</p>\n<p>There was a grass-grown track descending the forest aisle between hoar and knotty shafts and under branched arches.</p>\n</blockquote>\n</div>\n<div id=\"installation\">\n<h2>Installation</h2>\n<pre>$ pip install omen\n</pre>\n</div>\n<div id=\"usage\">\n<h2>Usage</h2>\n<pre>&gt;&gt;&gt; from omen import Omen\n&gt;&gt;&gt; omen = Omen()\n&gt;&gt;&gt; omen.train(open(\"corpus.txt\").read())\n&gt;&gt;&gt; omen.generate()\n'Not, certainly, that of a man, turned his head slowly towards where I stood I could see him plainly.'\n&gt;&gt;&gt; omen.dump_states(open(\"states.pkl\", \"wb\"))\n&gt;&gt;&gt; omen.load_states(open(\"states.pkl\", \"rb\"))\n&gt;&gt;&gt; omen.generate()\n\"A quarter of an hour's length, in which I communicated it: yet six months after he wrote to me of a Jane Eyre: I have been, for none of the Reeds were there, they say, almost like a dog quarrelling.\"\n</pre>\n<p>Note that due to the Markov chain’s structure, the model may be trained online over multiple corpora as if they were a single\nbody of text:</p>\n<pre>&gt;&gt;&gt; omen.train(open(\"jane_eyre.txt\").read())\n&gt;&gt;&gt; omen.train(open(\"twenty_thousand_leagues.txt\").read())\n&gt;&gt;&gt; omen.generate()\n'Last night I can not say it with his harpoon, a dreadful weapon in his hands.'\n</pre>\n</div>\n<div id=\"configuration\">\n<h2>Configuration</h2>\n<p>Specify state size (defaults to 3. Higher sizes produce sentences that are more coherent but less original; you need more\ntraining data the higher you set the state size):</p>\n<pre>&gt;&gt;&gt; omen = Omen(state_size=2)\n</pre>\n<div id=\"overriding-functions\">\n<h3>Overriding functions:</h3>\n<p>You may override the following functions:</p>\n<ul>\n<li><tt>sentence_tokenize</tt></li>\n<li><tt>word_tokenize</tt></li>\n<li><tt>detokenize</tt></li>\n<li><tt>weighted_choice</tt> (I’m not sure why you would want to override this function, but the option’s there)</li>\n</ul>\n<p>Example:</p>\n<pre>&gt;&gt;&gt; import omen\n&gt;&gt;&gt; o = omen.Omen()\n&gt;&gt;&gt; o.train(open(\"corpus.txt\").read())\n&gt;&gt;&gt;\n&gt;&gt;&gt; omen.detokenize = lambda x: \" $$$ \".join(x)\n&gt;&gt;&gt; o.generate()\nBut $$$ you $$$ can $$$ not $$$ be $$$ , $$$ sir $$$ , $$$ that $$$ I $$$ desired $$$ perfection $$$ , $$$ either $$$ of $$$ mind $$$ or $$$ person $$$ .'\n</pre>\n</div>\n</div>\n<div id=\"project-gutenberg-license\">\n<h2>Project Gutenberg license</h2>\n<pre>THE FULL PROJECT GUTENBERG LICENSE\nPLEASE READ THIS BEFORE YOU DISTRIBUTE OR USE THIS WORK\n\nTo protect the Project Gutenberg-tm mission of promoting the free\ndistribution of electronic works, by using or distributing this work\n(or any other work associated in any way with the phrase \"Project\nGutenberg\"), you agree to comply with all the terms of the Full Project\nGutenberg-tm License (available with this file or online at\nhttp://www.gutenberg.org/license).\n\n\nSection 1.  General Terms of Use and Redistributing Project Gutenberg-tm\nelectronic works\n\n1.A.  By reading or using any part of this Project Gutenberg-tm\nelectronic work, you indicate that you have read, understand, agree to\nand accept all the terms of this license and intellectual property\n(trademark/copyright) agreement.  If you do not agree to abide by all\nthe terms of this agreement, you must cease using and return or destroy\nall copies of Project Gutenberg-tm electronic works in your possession.\nIf you paid a fee for obtaining a copy of or access to a Project\nGutenberg-tm electronic work and you do not agree to be bound by the\nterms of this agreement, you may obtain a refund from the person or\nentity to whom you paid the fee as set forth in paragraph 1.E.8.\n\n1.B.  \"Project Gutenberg\" is a registered trademark.  It may only be\nused on or associated in any way with an electronic work by people who\nagree to be bound by the terms of this agreement.  There are a few\nthings that you can do with most Project Gutenberg-tm electronic works\neven without complying with the full terms of this agreement.  See\nparagraph 1.C below.  There are a lot of things you can do with Project\nGutenberg-tm electronic works if you follow the terms of this agreement\nand help preserve free future access to Project Gutenberg-tm electronic\nworks.  See paragraph 1.E below.\n\n1.C.  The Project Gutenberg Literary Archive Foundation (\"the Foundation\"\nor PGLAF), owns a compilation copyright in the collection of Project\nGutenberg-tm electronic works.  Nearly all the individual works in the\ncollection are in the public domain in the United States.  If an\nindividual work is in the public domain in the United States and you are\nlocated in the United States, we do not claim a right to prevent you from\ncopying, distributing, performing, displaying or creating derivative\nworks based on the work as long as all references to Project Gutenberg\nare removed.  Of course, we hope that you will support the Project\nGutenberg-tm mission of promoting free access to electronic works by\nfreely sharing Project Gutenberg-tm works in compliance with the terms of\nthis agreement for keeping the Project Gutenberg-tm name associated with\nthe work.  You can easily comply with the terms of this agreement by\nkeeping this work in the same format with its attached full Project\nGutenberg-tm License when you share it without charge with others.\n\n1.D.  The copyright laws of the place where you are located also govern\nwhat you can do with this work.  Copyright laws in most countries are in\na constant state of change.  If you are outside the United States, check\nthe laws of your country in addition to the terms of this agreement\nbefore downloading, copying, displaying, performing, distributing or\ncreating derivative works based on this work or any other Project\nGutenberg-tm work.  The Foundation makes no representations concerning\nthe copyright status of any work in any country outside the United\nStates.\n\n1.E.  Unless you have removed all references to Project Gutenberg:\n\n1.E.1.  The following sentence, with active links to, or other immediate\naccess to, the full Project Gutenberg-tm License must appear prominently\nwhenever any copy of a Project Gutenberg-tm work (any work on which the\nphrase \"Project Gutenberg\" appears, or with which the phrase \"Project\nGutenberg\" is associated) is accessed, displayed, performed, viewed,\ncopied or distributed:\n\nThis eBook is for the use of anyone anywhere at no cost and with\nalmost no restrictions whatsoever.  You may copy it, give it away or\nre-use it under the terms of the Project Gutenberg License included\nwith this eBook or online at www.gutenberg.org\n\n1.E.2.  If an individual Project Gutenberg-tm electronic work is derived\nfrom the public domain (does not contain a notice indicating that it is\nposted with permission of the copyright holder), the work can be copied\nand distributed to anyone in the United States without paying any fees\nor charges.  If you are redistributing or providing access to a work\nwith the phrase \"Project Gutenberg\" associated with or appearing on the\nwork, you must comply either with the requirements of paragraphs 1.E.1\nthrough 1.E.7 or obtain permission for the use of the work and the\nProject Gutenberg-tm trademark as set forth in paragraphs 1.E.8 or\n1.E.9.\n\n1.E.3.  If an individual Project Gutenberg-tm electronic work is posted\nwith the permission of the copyright holder, your use and distribution\nmust comply with both paragraphs 1.E.1 through 1.E.7 and any additional\nterms imposed by the copyright holder.  Additional terms will be linked\nto the Project Gutenberg-tm License for all works posted with the\npermission of the copyright holder found at the beginning of this work.\n\n1.E.4.  Do not unlink or detach or remove the full Project Gutenberg-tm\nLicense terms from this work, or any files containing a part of this\nwork or any other work associated with Project Gutenberg-tm.\n\n1.E.5.  Do not copy, display, perform, distribute or redistribute this\nelectronic work, or any part of this electronic work, without\nprominently displaying the sentence set forth in paragraph 1.E.1 with\nactive links or immediate access to the full terms of the Project\nGutenberg-tm License.\n\n1.E.6.  You may convert to and distribute this work in any binary,\ncompressed, marked up, nonproprietary or proprietary form, including any\nword processing or hypertext form.  However, if you provide access to or\ndistribute copies of a Project Gutenberg-tm work in a format other than\n\"Plain Vanilla ASCII\" or other format used in the official version\nposted on the official Project Gutenberg-tm web site (www.gutenberg.org),\nyou must, at no additional cost, fee or expense to the user, provide a\ncopy, a means of exporting a copy, or a means of obtaining a copy upon\nrequest, of the work in its original \"Plain Vanilla ASCII\" or other\nform.  Any alternate format must include the full Project Gutenberg-tm\nLicense as specified in paragraph 1.E.1.\n\n1.E.7.  Do not charge a fee for access to, viewing, displaying,\nperforming, copying or distributing any Project Gutenberg-tm works\nunless you comply with paragraph 1.E.8 or 1.E.9.\n\n1.E.8.  You may charge a reasonable fee for copies of or providing\naccess to or distributing Project Gutenberg-tm electronic works provided\nthat\n\n- You pay a royalty fee of 20% of the gross profits you derive from\n     the use of Project Gutenberg-tm works calculated using the method\n     you already use to calculate your applicable taxes.  The fee is\n     owed to the owner of the Project Gutenberg-tm trademark, but he\n     has agreed to donate royalties under this paragraph to the\n     Project Gutenberg Literary Archive Foundation.  Royalty payments\n     must be paid within 60 days following each date on which you\n     prepare (or are legally required to prepare) your periodic tax\n     returns.  Royalty payments should be clearly marked as such and\n     sent to the Project Gutenberg Literary Archive Foundation at the\n     address specified in Section 4, \"Information about donations to\n     the Project Gutenberg Literary Archive Foundation.\"\n\n- You provide a full refund of any money paid by a user who notifies\n     you in writing (or by e-mail) within 30 days of receipt that s/he\n     does not agree to the terms of the full Project Gutenberg-tm\n     License.  You must require such a user to return or\n     destroy all copies of the works possessed in a physical medium\n     and discontinue all use of and all access to other copies of\n     Project Gutenberg-tm works.\n\n- You provide, in accordance with paragraph 1.F.3, a full refund of any\n     money paid for a work or a replacement copy, if a defect in the\n     electronic work is discovered and reported to you within 90 days\n     of receipt of the work.\n\n- You comply with all other terms of this agreement for free\n     distribution of Project Gutenberg-tm works.\n\n1.E.9.  If you wish to charge a fee or distribute a Project Gutenberg-tm\nelectronic work or group of works on different terms than are set\nforth in this agreement, you must obtain permission in writing from\nboth the Project Gutenberg Literary Archive Foundation and Michael\nHart, the owner of the Project Gutenberg-tm trademark.  Contact the\nFoundation as set forth in Section 3 below.\n\n1.F.\n\n1.F.1.  Project Gutenberg volunteers and employees expend considerable\neffort to identify, do copyright research on, transcribe and proofread\npublic domain works in creating the Project Gutenberg-tm\ncollection.  Despite these efforts, Project Gutenberg-tm electronic\nworks, and the medium on which they may be stored, may contain\n\"Defects,\" such as, but not limited to, incomplete, inaccurate or\ncorrupt data, transcription errors, a copyright or other intellectual\nproperty infringement, a defective or damaged disk or other medium, a\ncomputer virus, or computer codes that damage or cannot be read by\nyour equipment.\n\n1.F.2.  LIMITED WARRANTY, DISCLAIMER OF DAMAGES - Except for the \"Right\nof Replacement or Refund\" described in paragraph 1.F.3, the Project\nGutenberg Literary Archive Foundation, the owner of the Project\nGutenberg-tm trademark, and any other party distributing a Project\nGutenberg-tm electronic work under this agreement, disclaim all\nliability to you for damages, costs and expenses, including legal\nfees.  YOU AGREE THAT YOU HAVE NO REMEDIES FOR NEGLIGENCE, STRICT\nLIABILITY, BREACH OF WARRANTY OR BREACH OF CONTRACT EXCEPT THOSE\nPROVIDED IN PARAGRAPH F3.  YOU AGREE THAT THE FOUNDATION, THE\nTRADEMARK OWNER, AND ANY DISTRIBUTOR UNDER THIS AGREEMENT WILL NOT BE\nLIABLE TO YOU FOR ACTUAL, DIRECT, INDIRECT, CONSEQUENTIAL, PUNITIVE OR\nINCIDENTAL DAMAGES EVEN IF YOU GIVE NOTICE OF THE POSSIBILITY OF SUCH\nDAMAGE.\n\n1.F.3.  LIMITED RIGHT OF REPLACEMENT OR REFUND - If you discover a\ndefect in this electronic work within 90 days of receiving it, you can\nreceive a refund of the money (if any) you paid for it by sending a\nwritten explanation to the person you received the work from.  If you\nreceived the work on a physical medium, you must return the medium with\nyour written explanation.  The person or entity that provided you with\nthe defective work may elect to provide a replacement copy in lieu of a\nrefund.  If you received the work electronically, the person or entity\nproviding it to you may choose to give you a second opportunity to\nreceive the work electronically in lieu of a refund.  If the second copy\nis also defective, you may demand a refund in writing without further\nopportunities to fix the problem.\n\n1.F.4.  Except for the limited right of replacement or refund set forth\nin paragraph 1.F.3, this work is provided to you 'AS-IS', WITH NO OTHER\nWARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO\nWARRANTIES OF MERCHANTIBILITY OR FITNESS FOR ANY PURPOSE.\n\n1.F.5.  Some states do not allow disclaimers of certain implied\nwarranties or the exclusion or limitation of certain types of damages.\nIf any disclaimer or limitation set forth in this agreement violates the\nlaw of the state applicable to this agreement, the agreement shall be\ninterpreted to make the maximum disclaimer or limitation permitted by\nthe applicable state law.  The invalidity or unenforceability of any\nprovision of this agreement shall not void the remaining provisions.\n\n1.F.6.  INDEMNITY - You agree to indemnify and hold the Foundation, the\ntrademark owner, any agent or employee of the Foundation, anyone\nproviding copies of Project Gutenberg-tm electronic works in accordance\nwith this agreement, and any volunteers associated with the production,\npromotion and distribution of Project Gutenberg-tm electronic works,\nharmless from all liability, costs and expenses, including legal fees,\nthat arise directly or indirectly from any of the following which you do\nor cause to occur: (a) distribution of this or any Project Gutenberg-tm\nwork, (b) alteration, modification, or additions or deletions to any\nProject Gutenberg-tm work, and (c) any Defect you cause.\n\n\nSection  2.  Information about the Mission of Project Gutenberg-tm\n\nProject Gutenberg-tm is synonymous with the free distribution of\nelectronic works in formats readable by the widest variety of computers\nincluding obsolete, old, middle-aged and new computers.  It exists\nbecause of the efforts of hundreds of volunteers and donations from\npeople in all walks of life.\n\nVolunteers and financial support to provide volunteers with the\nassistance they need, is critical to reaching Project Gutenberg-tm's\ngoals and ensuring that the Project Gutenberg-tm collection will\nremain freely available for generations to come.  In 2001, the Project\nGutenberg Literary Archive Foundation was created to provide a secure\nand permanent future for Project Gutenberg-tm and future generations.\nTo learn more about the Project Gutenberg Literary Archive Foundation\nand how your efforts and donations can help, see Sections 3 and 4\nand the Foundation web page at http://www.gutenberg.org/fundraising/pglaf.\n\n\nSection 3.  Information about the Project Gutenberg Literary Archive\nFoundation\n\nThe Project Gutenberg Literary Archive Foundation is a non profit\n501(c)(3) educational corporation organized under the laws of the\nstate of Mississippi and granted tax exempt status by the Internal\nRevenue Service.  The Foundation's EIN or federal tax identification\nnumber is 64-6221541.  Contributions to the Project Gutenberg\nLiterary Archive Foundation are tax deductible to the full extent\npermitted by U.S. federal laws and your state's laws.\n\nThe Foundation's principal office is located at 4557 Melan Dr. S.\nFairbanks, AK, 99712., but its volunteers and employees are scattered\nthroughout numerous locations.  Its business office is located at\n809 North 1500 West, Salt Lake City, UT 84116, (801) 596-1887, email\nbusiness@pglaf.org.  Email contact links and up to date contact\ninformation can be found at the Foundation's web site and official\npage at http://www.gutenberg.org/about/contact\n\nFor additional contact information:\n     Dr. Gregory B. Newby\n     Chief Executive and Director\n     gbnewby@pglaf.org\n\nSection 4.  Information about Donations to the Project Gutenberg\nLiterary Archive Foundation\n\nProject Gutenberg-tm depends upon and cannot survive without wide\nspread public support and donations to carry out its mission of\nincreasing the number of public domain and licensed works that can be\nfreely distributed in machine readable form accessible by the widest\narray of equipment including outdated equipment.  Many small donations\n($1 to $5,000) are particularly important to maintaining tax exempt\nstatus with the IRS.\n\nThe Foundation is committed to complying with the laws regulating\ncharities and charitable donations in all 50 states of the United\nStates.  Compliance requirements are not uniform and it takes a\nconsiderable effort, much paperwork and many fees to meet and keep up\nwith these requirements.  We do not solicit donations in locations\nwhere we have not received written confirmation of compliance.  To\nSEND DONATIONS or determine the status of compliance for any\nparticular state visit http://www.gutenberg.org/fundraising/donate\n\nWhile we cannot and do not solicit contributions from states where we\nhave not met the solicitation requirements, we know of no prohibition\nagainst accepting unsolicited donations from donors in such states who\napproach us with offers to donate.\n\nInternational donations are gratefully accepted, but we cannot make\nany statements concerning tax treatment of donations received from\noutside the United States.  U.S. laws alone swamp our small staff.\n\nPlease check the Project Gutenberg Web pages for current donation\nmethods and addresses.  Donations are accepted in a number of other\nways including checks, online payments and credit card donations.\nTo donate, please visit:\nhttp://www.gutenberg.org/fundraising/donate\n\n\nSection 5.  General Information About Project Gutenberg-tm electronic\nworks.\n\nProfessor Michael S. Hart is the originator of the Project Gutenberg-tm\nconcept of a library of electronic works that could be freely shared\nwith anyone.  For thirty years, he produced and distributed Project\nGutenberg-tm eBooks with only a loose network of volunteer support.\n\nProject Gutenberg-tm eBooks are often created from several printed\neditions, all of which are confirmed as Public Domain in the U.S.\nunless a copyright notice is included.  Thus, we do not necessarily\nkeep eBooks in compliance with any particular paper edition.\n\nMost people start at our Web site which has the main PG search facility:\n\n     http://www.gutenberg.org\n\nThis Web site includes information about Project Gutenberg-tm,\nincluding how to make donations to the Project Gutenberg Literary\nArchive Foundation, how to help produce our new eBooks, and how to\nsubscribe to our email newsletter to hear about new eBooks.\n</pre>\n</div>\n\n          </div>"}, "last_serial": 3549451, "releases": {"1.0": [{"comment_text": "", "digests": {"md5": "21b5758c7fd599ebdea9f1022c8161d9", "sha256": "d875cfbd8aa1ef4a0ca997ed0f2fd2828586eddda1f3dbd4cd3527c0e99ef084"}, "downloads": -1, "filename": "omen-1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "21b5758c7fd599ebdea9f1022c8161d9", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 16616, "upload_time": "2018-02-03T16:46:01", "upload_time_iso_8601": "2018-02-03T16:46:01.456275Z", "url": "https://files.pythonhosted.org/packages/dd/ac/1cac8b6cbc211d3b87f3e035085c2bd5dac30ee9909b0185a27f5cfaf1a7/omen-1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "088ba361eb74781bb8c66a9f12e4a870", "sha256": "e699aff3389d0f7d5ffcab2ddd57e65b53421045256c7d3cf0fe59b9c54b331f"}, "downloads": -1, "filename": "omen-1.0.tar.gz", "has_sig": false, "md5_digest": "088ba361eb74781bb8c66a9f12e4a870", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 11625, "upload_time": "2018-02-03T16:46:02", "upload_time_iso_8601": "2018-02-03T16:46:02.986423Z", "url": "https://files.pythonhosted.org/packages/a5/be/b192d67c49dce41db99a32f1b6c6ed46a1a662ef935313ebe7a17995b929/omen-1.0.tar.gz", "yanked": false}], "1.1": [{"comment_text": "", "digests": {"md5": "a453967e61501cad41409c01401fefd3", "sha256": "1dc9faae17928ce466fc2528609d359e8ac0a262e8025e8a79f2a2bb9524feb9"}, "downloads": -1, "filename": "omen-1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "a453967e61501cad41409c01401fefd3", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 17765, "upload_time": "2018-02-03T17:44:06", "upload_time_iso_8601": "2018-02-03T17:44:06.966025Z", "url": "https://files.pythonhosted.org/packages/35/0d/659ca2b799cbe25da085a1f0d58e7477021119cc24901a9d7d3d66d89556/omen-1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b0cb8f09e9b4f593ba890fb9ad61d847", "sha256": "87e1f8da37e9f34d3be4d08709a0998193309ab27bfd6e2b2218ad9eff48e113"}, "downloads": -1, "filename": "omen-1.1.tar.gz", "has_sig": false, "md5_digest": "b0cb8f09e9b4f593ba890fb9ad61d847", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10757, "upload_time": "2018-02-03T17:44:12", "upload_time_iso_8601": "2018-02-03T17:44:12.487218Z", "url": "https://files.pythonhosted.org/packages/00/2f/72f268f8a6d59de84b26a6076c4f35d3f35e6e621ef0e6b866f51a0c8316/omen-1.1.tar.gz", "yanked": false}], "1.1.1": [{"comment_text": "", "digests": {"md5": "ed75fd341fdfafba3a0276229abbd95f", "sha256": "917704a5db243b00160004a404a4af023e54af2e3e222a4e0db68864a5eb63f3"}, "downloads": -1, "filename": "omen-1.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "ed75fd341fdfafba3a0276229abbd95f", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18072, "upload_time": "2018-02-03T18:19:37", "upload_time_iso_8601": "2018-02-03T18:19:37.112733Z", "url": "https://files.pythonhosted.org/packages/78/89/6acd5415fa044f545fa44c4eddbadbf1e35c6e1f1d903d41f446f663480c/omen-1.1.1-py3-none-any.whl", "yanked": false}], "1.2": [{"comment_text": "", "digests": {"md5": "864f24328a85584b63c4db6111d15bc6", "sha256": "04cb320b3ecf6807eed0e876cceda839d33ec8fac9ffda43c6911f8e17d55d57"}, "downloads": -1, "filename": "omen-1.2-py3-none-any.whl", "has_sig": false, "md5_digest": "864f24328a85584b63c4db6111d15bc6", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18043, "upload_time": "2018-02-03T18:25:53", "upload_time_iso_8601": "2018-02-03T18:25:53.912721Z", "url": "https://files.pythonhosted.org/packages/ea/57/c19b5a5f9e270f4d75fac3e1339e33b9218aeccf3699da7ef5fdcd5adbab/omen-1.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "75825191d6a697b252ec6557bd508291", "sha256": "05f672c03bb78e125b24a8e39d8810ef9e8cfcfd669dea9acce8391d4a683bff"}, "downloads": -1, "filename": "omen-1.2.tar.gz", "has_sig": false, "md5_digest": "75825191d6a697b252ec6557bd508291", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10918, "upload_time": "2018-02-03T18:25:55", "upload_time_iso_8601": "2018-02-03T18:25:55.212687Z", "url": "https://files.pythonhosted.org/packages/e3/f2/4ce263b428c20a5ef1afa7a29e2742f09886fc8d340183843515a94f80f4/omen-1.2.tar.gz", "yanked": false}], "1.3": [{"comment_text": "", "digests": {"md5": "0e770cb2ca48e32bf4e2832f27e74cca", "sha256": "c7f083d02023e955299576e0d07fa42b0f728a94990dd59846c33b2cc0c3e86f"}, "downloads": -1, "filename": "omen-1.3-py3-none-any.whl", "has_sig": false, "md5_digest": "0e770cb2ca48e32bf4e2832f27e74cca", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 18225, "upload_time": "2018-02-03T21:26:21", "upload_time_iso_8601": "2018-02-03T21:26:21.659635Z", "url": "https://files.pythonhosted.org/packages/39/2e/1bc17f0ae7ca130b1def1d0bafb66b9d2d15426c95dc33c14e553ea1b18f/omen-1.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "93f02513cc5bdac57bbaaee42be39dd4", "sha256": "679e88a65efc9981566e1131688402b879654e8bff50a386afd81e1c082262c5"}, "downloads": -1, "filename": "omen-1.3.tar.gz", "has_sig": false, "md5_digest": "93f02513cc5bdac57bbaaee42be39dd4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 11004, "upload_time": "2018-02-03T21:26:22", "upload_time_iso_8601": "2018-02-03T21:26:22.668960Z", "url": "https://files.pythonhosted.org/packages/0c/f4/22f242cf49693c417bcee5dab0d89dfebc0692c4a4d6289835a950e7cfaf/omen-1.3.tar.gz", "yanked": false}], "1.4": [{"comment_text": "", "digests": {"md5": "943c6450d90f6cd7dc25970172454288", "sha256": "36feb3434dd2e2d22105d025b16bac38e39be0b7368dc046d71ccdf7a698e90b"}, "downloads": -1, "filename": "omen-1.4-py3-none-any.whl", "has_sig": false, "md5_digest": "943c6450d90f6cd7dc25970172454288", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 19328, "upload_time": "2018-02-04T01:06:03", "upload_time_iso_8601": "2018-02-04T01:06:03.164975Z", "url": "https://files.pythonhosted.org/packages/2d/d8/4dfa1ffa84ef8dbf712d259cf6e6201e56d587d67ae16986a5b31511a92b/omen-1.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7e424d0aabe3e0deec7c04299be9e5a6", "sha256": "04240a3e82545251607ff39bc4f4808bbc40837eeda390a19a9f7c0023fc94d7"}, "downloads": -1, "filename": "omen-1.4.tar.gz", "has_sig": false, "md5_digest": "7e424d0aabe3e0deec7c04299be9e5a6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 11977, "upload_time": "2018-02-04T01:06:04", "upload_time_iso_8601": "2018-02-04T01:06:04.209724Z", "url": "https://files.pythonhosted.org/packages/d9/8c/b35500aeee12608422c5a3184d893e1995a6aef0aad3a04360fa2374f928/omen-1.4.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "943c6450d90f6cd7dc25970172454288", "sha256": "36feb3434dd2e2d22105d025b16bac38e39be0b7368dc046d71ccdf7a698e90b"}, "downloads": -1, "filename": "omen-1.4-py3-none-any.whl", "has_sig": false, "md5_digest": "943c6450d90f6cd7dc25970172454288", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 19328, "upload_time": "2018-02-04T01:06:03", "upload_time_iso_8601": "2018-02-04T01:06:03.164975Z", "url": "https://files.pythonhosted.org/packages/2d/d8/4dfa1ffa84ef8dbf712d259cf6e6201e56d587d67ae16986a5b31511a92b/omen-1.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7e424d0aabe3e0deec7c04299be9e5a6", "sha256": "04240a3e82545251607ff39bc4f4808bbc40837eeda390a19a9f7c0023fc94d7"}, "downloads": -1, "filename": "omen-1.4.tar.gz", "has_sig": false, "md5_digest": "7e424d0aabe3e0deec7c04299be9e5a6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 11977, "upload_time": "2018-02-04T01:06:04", "upload_time_iso_8601": "2018-02-04T01:06:04.209724Z", "url": "https://files.pythonhosted.org/packages/d9/8c/b35500aeee12608422c5a3184d893e1995a6aef0aad3a04360fa2374f928/omen-1.4.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:04:34 2020"}