{"info": {"author": "Duncan Parkes", "author_email": "deparkes@gmail.com", "bugtrack_url": null, "classifiers": [], "description": "OOMMFTools\r\n==========\r\n\r\n\r\n.. image:: https://oommftools.github.io/assets/main_window.png\r\n   :target: https://oommftools.github.io/assets/main_window.png\r\n   :alt: OOMMFTools Main Window\r\n\r\n\r\nIntroduction\r\n============\r\n\r\nOOMMFTools is a set of utilities designed to assist OOMMF postprocessing with an intuitive, graphical interface. It includes the following subcomponents:\r\n\r\n-\\ `OOMMFDecode <#oommfdecode>`_ : Converts OOMMF vector files into numpy arrays and/or MATLAB data files\r\n\r\n-\\ `OOMMFConvert <#oommfconvert>`_\\ : Converts OOMMF vector files into bitmaps and movies\r\n\r\n-\\ `ODTChomp <#odtchomp>`_ : Converts ODT files or subsets thereof into normally-delimited text files\r\n\r\nOOMMFTools was original developed by `Mark Mascaro <http://web.mit.edu/daigohji/projects/OOMMFTools/>`_. The version hosted here incorporates some additional code and compatability with recent libraries.\r\n\r\nBug reports and feature requests should logged on github.\r\n\r\nInstallation\r\n============\r\n\r\nInstall With Pip\r\n----------------\r\n\r\nWindows / OSX\r\n^^^^^^^^^^^^^\r\n\r\nWindows and OSX users can install with pip:\r\n\r\n.. code-block::\r\n\r\n   pip install oommftools\r\n\r\nYou can then load the oommftools main window with \r\n\r\n.. code-block::\r\n\r\n   python -m oommftools\r\n\r\nLinux\r\n^^^^^\r\n\r\nOOMMFTools has a dependency on wxpython and packages for this `are not <https://wxpython.org/blog/2017-08-17-builds-for-linux-with-pip/index.html>`_ (currently) available on PyPI. \r\n\r\nLinux users need to install wxpython 4.x separately before running pip install. You may find a suitable wheel file for your version of linux `here <https://wxpython.org/pages/downloads/index.html>`_ which can be installed with a command like:\r\n\r\n.. code-block::\r\n\r\n   pip install -U \\\r\n       -f https://extras.wxpython.org/wxPython4/extras/linux/gtk3/ubuntu-16.04 \\\r\n       wxPython\r\n\r\nYou can then install OOMMFTools with pip:\r\n\r\n.. code-block::\r\n\r\n   pip install oommftools\r\n\r\nYou can then load the oommftools main window with \r\n\r\n.. code-block::\r\n\r\n   python -m oommftools\r\n\r\nInstall With Anaconda\r\n---------------------\r\n\r\nInstalling with the `Anaconda Distribution <https://www.continuum.io/downloads>`_ should not depend on your platform.\r\n\r\nClone this repository to get the latest code:\r\n\r\n.. code-block::\r\n\r\n   git clone https://github.com/deparkes/OOMMFTools.git\r\n\r\nThe OOMMFTools repository contains an environment yaml file with the dependencies it needs.\r\n\r\n.. code-block::\r\n\r\n   conda env create -f environment.yml\r\n   python oommftools/oommftools.py\r\n\r\nInstall Dependencies\r\n--------------------\r\n\r\nOOMMFTools has the following dependencies:\r\n\r\n\r\n* Python 2.7\r\n* wxPython 4.x\r\n* numpy\r\n* scipy\r\n* FFmpeg - needed for `OOMMFConvert <#oommfconvert>`_\r\n* OOMMF - needed for `OOMMFConvert <#oommfconvert>`_\r\n* Tcl/Tk - needed for `OOMMFConvert <#oommfconvert>`_\r\n\r\nOOMMFDecode\r\n===========\r\n\r\nOOMMFDecode batch-processes vector files (omf, ovf, oef, ohf) into numpy arrays. These can then be pickled, for python users, or saved into MATLAB data files, for MATLAB users.\r\n\r\n\r\n.. image:: https://oommftools.github.io/assets/oommfdecode_window.png\r\n   :target: https://oommftools.github.io/assets/oommfdecode_window.png\r\n   :alt: OOMMFTools OOMMFDecode\r\n\r\n\r\n1. UTILIZATION\r\n--------------\r\n\r\nThe GUI is very simple. Two checkboxes are offered - for making numpy data and for making MATLAB data. Simply check the options for the types of data you want to save and drag one or more OMF files onto the application. The data format (text, binary 4, binary 8) is automatically detected. When the import is finished, you'll be prompted to save the data for each format you selected.\r\n\r\nDropping a batch of OMF files is primarily designed to automate aggregation of data from various states of a single simulation. The program assumes all files you drop at a time are \"similar\" - that is, they have the same grid size and other header data. Please be mindful of this constraint, and if you wish to convert files from several disparate simulations do so in different drop operations.\r\n\r\nSome files (such as energy densities) contain only a single value, not a vector. In OOMMF, these outputs are still vector files. The relevant quantity is stored in the X coordinate.\r\n\r\nA. MATLAB Data\r\n^^^^^^^^^^^^^^\r\n\r\nThe output .MAT file contains several variables.\r\n\r\nFirst, a 3-element vector GridSize, which contains the X, Y, and Z span of each cell. This is imported from the OMF file headers, specifically from the first file on the list of dropped files (again, it is assumed all files in one batch are similar).\r\n\r\nSecond, a vector SimTime, which contains the simulation time associated with each OMF file, if any. The input files are sorted based on SimTime if and only if times are available for all files.\r\n\r\nThird and fourth, the vectors Iteration and Stage, which contain the iteration and stage number associated with each OMF file, if any. This is the total iteration number, not the stage iteration number.\r\n\r\nThe final variable is a 5-D matrix OOMMFData, which can be understood as follows.\r\n\r\n  OOMMFData(A,B,C,D,E):\r\n\r\nA. The index of the OMF file, in simulation time order. If simtime data is not available, the files are in the same order as they were dropped on the program, which is generally the operating system sort order.\r\n\r\nB. X coordinate in first-octant coordinates.\r\n\r\nC. Y coordinate in first-octant coordinates.\r\n\r\nD. Z coordinate in first-octant coordinates.\r\n\r\nE. (1,2,3) are the x,y,z components of the vector.\r\n\r\nNote that everything is indexed in the OOMMF (first-octant) coordinate system, but row-column matrix notation is fourth-quadrant. Depending on what you're trying to do, it may be necessary to transform the data accordingly. When in doubt, remember that indices into matrices generated by this program match OOMMF's own numbers!\r\n\r\nB. numpy Data\r\n^^^^^^^^^^^^^\r\n\r\nThe output .PNP file can be unpickled into a tuple containing two items: first, a 5-D matrix as documented above; second, a dictionary of header values extracted from the OMF file header data. This latter data is useful for looking up the scale of each cell or the simulation time of a particular file.\r\n\r\nOOMMFConvert\r\n============\r\n\r\nOOMMFConvert is meant to ease converting OOMMF simulation results into bitmaps and movies, especially for Windows users for whom the console is more unfamiliar or difficult. It uses the existing avf2ppm capability of OOMMF, along with the open-source utility FFmpeg for movie conversion.\r\n\r\n\r\n.. image:: https://oommftools.github.io/assets/oommfconvert_window.png\r\n   :target: https://oommftools.github.io/assets/oommfconvert_window.png\r\n   :alt: OOMMFTools OOMMFConvert\r\n\r\n\r\n1. Utilization\r\n--------------\r\n\r\nThe GUI is divided into five sections as follows.\r\n\r\nA. Path to OOMMF - configures Tcl shell calls\r\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n\r\nThe left dropbox contains the call necessary to involve tcl. This defaults to and should almost always be left on the value \"tclsh\".  However, some Windows installations of ActiveTcl/Tk use other commands, such as tclsh85  (which is provided as a dropdown option). If necessary, enter a new value here.\r\n\r\nThe static text field to the right shows the path to the oommf.tcl file in your OOMMF installation. This is the file that will be called to invoke avf2ppm. You can use the \"Load OOMMF\" button to locate it, or simply drag the oommf.tcl file anywhere over the program window. This path is recorded in the file oommf.path in the program directory, and this configuration step is only necessary once.\r\n\r\nB. Configuration File - shows mmDisp configuration file\r\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n\r\nThis section shows which mmDisp configuration file is going to be used in avf2ppm. You can save an mmDisp configuration file from an mmDisp view with the \"Write config...\" option in the File menu. You can select a configuration file with the \"Load Config\" button, or by dragging a file with the extension .conf, .config, or .cnf anywhere within the program window. The text shows the absolute path to the currently selected config file. This value is *NOT* saved between sessions, as it is typically sim-dependent and unique for different groups of OMF files. To clarify, it is saved between file drops, so you can easily use the same configuration file to convert multiple batches of OMF files without closing the program.\r\n\r\nFor the magnetization, the maximum value of the vector field is fixed (Ms). For other kinds of fields, such as demag, the maximum value of the vector field may fluctuate from file to file. This could result in clipping unless you happened to use the largest-values o?f file to produce your config file. If you're using a field where the maximum value fluctuates significant, check \"generate vector field maxima\". If this is checked, the program will decode the files to be converted and find the maximum vector magnitude among all files. This can add significantly to the runtime, but makes it easy to generate uniformly-scaled pictures for these sorts of fields without clipping.\r\n\r\nC. Images - configures bitmap output\r\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n\r\nThis section controls the bitmap file output. If \"Make Bitmaps\" is unchecked, no images will be created. It defaults on. \"Image Magnify%\" overrides the parameters in the mmDisp configuration file to increase the output bitmap size. It employs a temporary copy of the configuration file, and the original is not overwritten. The value is in percent of the OOMMF default size, usually\r\naround 640x480.\r\n\r\nD. Movies - configures movie output\r\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n\r\nThis section controls the output of a movie file based on a collection of input OMF files. A movie will be made from each batch of OMF files if \"Make Movies\" is checked, but it defaults off.\r\n\r\nThe leftmost configuration on the bottom row is the FPS of the output movie. You may also consider it \"simulation files per second.\" Since FFmpeg uses an awkward fixed-framerate form, frames will be duplicated to fill in time when the FPS is reduced. These temporary files are cleaned up automatically. This value can be between 1 and 25 FPS, and defaults to 25.\r\n\r\nThe middle combo box allows the choice of encoding from a number of codecs built into FFmpeg. The default is HuffYUV, which I find gives the best-quality output files for the common red-white-blue color scheme. MPEG4 has some difficulty with the black-on-blue arrows and gives a visibly worse encoding. The HuffYUV decoder does not come standard on most systems (Windows) but is freely available, and I highly suggest using this codec.\r\n\r\nThe rightmost control is the movie magnification, which functions similarly to the image magnification. However, many codecs are unstable for large input image sizes (above around 140% over the OOMMF default size) and may fail silently. This is a bug in the encoder and cannot be worked around. Therefore, increasing the movie magnification is done at the user's risk. The default codec HuffYUV is quite robust, and readily supports use of the movie magnification control.\r\n\r\nE. Drop OOMMF Files Here! - a friendly reminder\r\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^\r\n\r\nDrag and drop configuration and vector field files here - or anywhere in the program window, but this section is a friendly reminder. Multiple files can be dropped at a time. OMF files are converted to bitmaps using the oommf command line utility avf2ppm and the supplied mmDisp configuration file. If a movie is being made, the batch of simultaneously dropped OMF files is converted to a single movie with the frames in filename order.\r\n\r\nODTChomp\r\n========\r\n\r\nODTChomp takes in ODT data tables, simplifies the name scheme to the extent it it possible, and outputs the desired columns into a text file with a given delimeter. The behavior is rather distict from odtcols, which is better at fixed-width rather than fixed-delimitation formatting.\r\n\r\n\r\n.. image:: https://oommftools.github.io/assets/odtchomp_window.png\r\n   :target: https://oommftools.github.io/assets/odtchomp_window.png\r\n   :alt: OOMMFTools ODTChomp\r\n\r\n\r\n1. Utilization\r\n--------------\r\n\r\nBegin by loading an ODT file. Drag-and-drop also works. The leftmost panel shows the columns found in the ODT file, using a simplified name scheme that uses the minimum number of uniquely identifying descriptors. The result is generally very human-readable unless the simulation file is extremely complex. The right panel shows which data fields will appear in the output file.\r\n\r\nDouble-clicking an entry in the left panel, or clicking an entry and then the \"-->\" button, will mark it for export. Double-clicking an entry in the right panel, or clicking an entry and then the \"<--\" button, will remove it from the export. The subsequent set of buttons can be used to add or remove all fields from the output file. The \"Move Up\" and \"Move Down\" buttons affect the item highlighted in the right panel, and are used to reorder the output columns.\r\n\r\nThe radio buttons between the two panels choose the delimiting symbol for the values in the output. For example, if you want the comma-separated values commonly used by Excel, choose comma. If you choose space as the delimited, spaces that appear in column names will be replaced by underscores in the output.\r\n\r\nFinally, the export button writes the selected columns in the selected order to a plaintext file.\r\n\r\n2. Batch Mode\r\n-------------\r\n\r\nThe checkbox just above the Export button enables Batch Mode. Batch Mode is designed to extract the same data fields from a large group of ODT files using drag-and-drop. Batch Mode can only be used once one file has already been loaded and export data has been selected. Even if Batch Mode is checked, if no file has previously been loaded, the first file drop will give non-batch behavior.\r\n\r\nOnce a file has been loaded and data fields have been chosen, any files dragged and dropped onto ODTChomp with Batch Mode enabled will have the specified fields extracted. The output will be placed in the same folder as the dropped file, with the same filename and the \".txt\" extension. Currently, dropping directories is not supported and they will not be recursed.\r\n\r\nDevelopment\r\n===========\r\n\r\nRunning Tests\r\n-------------\r\n\r\n.. code-block::\r\n\r\n   $pytest - run all tests\r\n   $pytest tests/test_odtchomp.py - run test for one file\r\n   $pytest tests/test_odtchomp.py::Test_headers_prettify - run specific test\r\n\r\nRunning pylint\r\n--------------\r\n\r\npylint --extension-pkg-whitelist=wx --output-format=colorized oommftools/oommftools.py\r\n\r\n\r\n", "description_content_type": null, "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/deparkes/OOMMFTools", "keywords": "", "license": "GPLv2", "maintainer": "", "maintainer_email": "", "name": "OOMMFTools", "package_url": "https://pypi.org/project/OOMMFTools/", "platform": "", "project_url": "https://pypi.org/project/OOMMFTools/", "project_urls": {"Homepage": "https://github.com/deparkes/OOMMFTools"}, "release_url": "https://pypi.org/project/OOMMFTools/2.0.2/", "requires_dist": ["numpy", "scipy", "wxpython"], "requires_python": "", "summary": "OOMMFTools is a set of drag-and-drop GUI utilities to assist in OOMMF postprocessing, including imageconversion and vector file manipulation.", "version": "2.0.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <div id=\"oommftools\">\n<h2>OOMMFTools</h2>\n<a href=\"https://oommftools.github.io/assets/main_window.png\" rel=\"nofollow\"><img alt=\"OOMMFTools Main Window\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/9354738d57bfcd1fa2065ce1041403af6545724a/68747470733a2f2f6f6f6d6d66746f6f6c732e6769746875622e696f2f6173736574732f6d61696e5f77696e646f772e706e67\"></a>\n</div>\n<div id=\"introduction\">\n<h2>Introduction</h2>\n<p>OOMMFTools is a set of utilities designed to assist OOMMF postprocessing with an intuitive, graphical interface. It includes the following subcomponents:</p>\n<p>-<a href=\"#oommfdecode\" rel=\"nofollow\">OOMMFDecode</a> : Converts OOMMF vector files into numpy arrays and/or MATLAB data files</p>\n<p>-<a href=\"#oommfconvert\" rel=\"nofollow\">OOMMFConvert</a>: Converts OOMMF vector files into bitmaps and movies</p>\n<p>-<a href=\"#odtchomp\" rel=\"nofollow\">ODTChomp</a> : Converts ODT files or subsets thereof into normally-delimited text files</p>\n<p>OOMMFTools was original developed by <a href=\"http://web.mit.edu/daigohji/projects/OOMMFTools/\" rel=\"nofollow\">Mark Mascaro</a>. The version hosted here incorporates some additional code and compatability with recent libraries.</p>\n<p>Bug reports and feature requests should logged on github.</p>\n</div>\n<div id=\"installation\">\n<h2>Installation</h2>\n<div id=\"install-with-pip\">\n<h3>Install With Pip</h3>\n<div id=\"windows-osx\">\n<h4>Windows / OSX</h4>\n<p>Windows and OSX users can install with pip:</p>\n<pre>pip install oommftools\n</pre>\n<p>You can then load the oommftools main window with</p>\n<pre>python -m oommftools\n</pre>\n</div>\n<div id=\"linux\">\n<h4>Linux</h4>\n<p>OOMMFTools has a dependency on wxpython and packages for this <a href=\"https://wxpython.org/blog/2017-08-17-builds-for-linux-with-pip/index.html\" rel=\"nofollow\">are not</a> (currently) available on PyPI.</p>\n<p>Linux users need to install wxpython 4.x separately before running pip install. You may find a suitable wheel file for your version of linux <a href=\"https://wxpython.org/pages/downloads/index.html\" rel=\"nofollow\">here</a> which can be installed with a command like:</p>\n<pre>pip install -U \\\n    -f https://extras.wxpython.org/wxPython4/extras/linux/gtk3/ubuntu-16.04 \\\n    wxPython\n</pre>\n<p>You can then install OOMMFTools with pip:</p>\n<pre>pip install oommftools\n</pre>\n<p>You can then load the oommftools main window with</p>\n<pre>python -m oommftools\n</pre>\n</div>\n</div>\n<div id=\"install-with-anaconda\">\n<h3>Install With Anaconda</h3>\n<p>Installing with the <a href=\"https://www.continuum.io/downloads\" rel=\"nofollow\">Anaconda Distribution</a> should not depend on your platform.</p>\n<p>Clone this repository to get the latest code:</p>\n<pre>git clone https://github.com/deparkes/OOMMFTools.git\n</pre>\n<p>The OOMMFTools repository contains an environment yaml file with the dependencies it needs.</p>\n<pre>conda env create -f environment.yml\npython oommftools/oommftools.py\n</pre>\n</div>\n<div id=\"install-dependencies\">\n<h3>Install Dependencies</h3>\n<p>OOMMFTools has the following dependencies:</p>\n<ul>\n<li>Python 2.7</li>\n<li>wxPython 4.x</li>\n<li>numpy</li>\n<li>scipy</li>\n<li>FFmpeg - needed for <a href=\"#oommfconvert\" rel=\"nofollow\">OOMMFConvert</a></li>\n<li>OOMMF - needed for <a href=\"#oommfconvert\" rel=\"nofollow\">OOMMFConvert</a></li>\n<li>Tcl/Tk - needed for <a href=\"#oommfconvert\" rel=\"nofollow\">OOMMFConvert</a></li>\n</ul>\n</div>\n</div>\n<div id=\"id4\">\n<h2>OOMMFDecode</h2>\n<p>OOMMFDecode batch-processes vector files (omf, ovf, oef, ohf) into numpy arrays. These can then be pickled, for python users, or saved into MATLAB data files, for MATLAB users.</p>\n<a href=\"https://oommftools.github.io/assets/oommfdecode_window.png\" rel=\"nofollow\"><img alt=\"OOMMFTools OOMMFDecode\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/78887659d00d7661fa0fef29f3358bd1b8a413ac/68747470733a2f2f6f6f6d6d66746f6f6c732e6769746875622e696f2f6173736574732f6f6f6d6d666465636f64655f77696e646f772e706e67\"></a>\n<div id=\"utilization\">\n<h3>1. UTILIZATION</h3>\n<p>The GUI is very simple. Two checkboxes are offered - for making numpy data and for making MATLAB data. Simply check the options for the types of data you want to save and drag one or more OMF files onto the application. The data format (text, binary 4, binary 8) is automatically detected. When the import is finished, you’ll be prompted to save the data for each format you selected.</p>\n<p>Dropping a batch of OMF files is primarily designed to automate aggregation of data from various states of a single simulation. The program assumes all files you drop at a time are “similar” - that is, they have the same grid size and other header data. Please be mindful of this constraint, and if you wish to convert files from several disparate simulations do so in different drop operations.</p>\n<p>Some files (such as energy densities) contain only a single value, not a vector. In OOMMF, these outputs are still vector files. The relevant quantity is stored in the X coordinate.</p>\n<div id=\"a-matlab-data\">\n<h4>A. MATLAB Data</h4>\n<p>The output .MAT file contains several variables.</p>\n<p>First, a 3-element vector GridSize, which contains the X, Y, and Z span of each cell. This is imported from the OMF file headers, specifically from the first file on the list of dropped files (again, it is assumed all files in one batch are similar).</p>\n<p>Second, a vector SimTime, which contains the simulation time associated with each OMF file, if any. The input files are sorted based on SimTime if and only if times are available for all files.</p>\n<p>Third and fourth, the vectors Iteration and Stage, which contain the iteration and stage number associated with each OMF file, if any. This is the total iteration number, not the stage iteration number.</p>\n<p>The final variable is a 5-D matrix OOMMFData, which can be understood as follows.</p>\n<blockquote>\nOOMMFData(A,B,C,D,E):</blockquote>\n<ol>\n<li>The index of the OMF file, in simulation time order. If simtime data is not available, the files are in the same order as they were dropped on the program, which is generally the operating system sort order.</li>\n<li>X coordinate in first-octant coordinates.</li>\n<li>Y coordinate in first-octant coordinates.</li>\n<li>Z coordinate in first-octant coordinates.</li>\n<li>(1,2,3) are the x,y,z components of the vector.</li>\n</ol>\n<p>Note that everything is indexed in the OOMMF (first-octant) coordinate system, but row-column matrix notation is fourth-quadrant. Depending on what you’re trying to do, it may be necessary to transform the data accordingly. When in doubt, remember that indices into matrices generated by this program match OOMMF’s own numbers!</p>\n</div>\n<div id=\"b-numpy-data\">\n<h4>B. numpy Data</h4>\n<p>The output .PNP file can be unpickled into a tuple containing two items: first, a 5-D matrix as documented above; second, a dictionary of header values extracted from the OMF file header data. This latter data is useful for looking up the scale of each cell or the simulation time of a particular file.</p>\n</div>\n</div>\n</div>\n<div id=\"id5\">\n<h2>OOMMFConvert</h2>\n<p>OOMMFConvert is meant to ease converting OOMMF simulation results into bitmaps and movies, especially for Windows users for whom the console is more unfamiliar or difficult. It uses the existing avf2ppm capability of OOMMF, along with the open-source utility FFmpeg for movie conversion.</p>\n<a href=\"https://oommftools.github.io/assets/oommfconvert_window.png\" rel=\"nofollow\"><img alt=\"OOMMFTools OOMMFConvert\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/4a8c49bad08c99fc94d03099e44a5643c9e54dc5/68747470733a2f2f6f6f6d6d66746f6f6c732e6769746875622e696f2f6173736574732f6f6f6d6d66636f6e766572745f77696e646f772e706e67\"></a>\n<div id=\"id6\">\n<h3>1. Utilization</h3>\n<p>The GUI is divided into five sections as follows.</p>\n<div id=\"a-path-to-oommf-configures-tcl-shell-calls\">\n<h4>A. Path to OOMMF - configures Tcl shell calls</h4>\n<p>The left dropbox contains the call necessary to involve tcl. This defaults to and should almost always be left on the value “tclsh”.  However, some Windows installations of ActiveTcl/Tk use other commands, such as tclsh85  (which is provided as a dropdown option). If necessary, enter a new value here.</p>\n<p>The static text field to the right shows the path to the oommf.tcl file in your OOMMF installation. This is the file that will be called to invoke avf2ppm. You can use the “Load OOMMF” button to locate it, or simply drag the oommf.tcl file anywhere over the program window. This path is recorded in the file oommf.path in the program directory, and this configuration step is only necessary once.</p>\n</div>\n<div id=\"b-configuration-file-shows-mmdisp-configuration-file\">\n<h4>B. Configuration File - shows mmDisp configuration file</h4>\n<p>This section shows which mmDisp configuration file is going to be used in avf2ppm. You can save an mmDisp configuration file from an mmDisp view with the “Write config…” option in the File menu. You can select a configuration file with the “Load Config” button, or by dragging a file with the extension .conf, .config, or .cnf anywhere within the program window. The text shows the absolute path to the currently selected config file. This value is <em>NOT</em> saved between sessions, as it is typically sim-dependent and unique for different groups of OMF files. To clarify, it is saved between file drops, so you can easily use the same configuration file to convert multiple batches of OMF files without closing the program.</p>\n<p>For the magnetization, the maximum value of the vector field is fixed (Ms). For other kinds of fields, such as demag, the maximum value of the vector field may fluctuate from file to file. This could result in clipping unless you happened to use the largest-values o?f file to produce your config file. If you’re using a field where the maximum value fluctuates significant, check “generate vector field maxima”. If this is checked, the program will decode the files to be converted and find the maximum vector magnitude among all files. This can add significantly to the runtime, but makes it easy to generate uniformly-scaled pictures for these sorts of fields without clipping.</p>\n</div>\n<div id=\"c-images-configures-bitmap-output\">\n<h4>C. Images - configures bitmap output</h4>\n<p>This section controls the bitmap file output. If “Make Bitmaps” is unchecked, no images will be created. It defaults on. “Image Magnify%” overrides the parameters in the mmDisp configuration file to increase the output bitmap size. It employs a temporary copy of the configuration file, and the original is not overwritten. The value is in percent of the OOMMF default size, usually\naround 640x480.</p>\n</div>\n<div id=\"d-movies-configures-movie-output\">\n<h4>D. Movies - configures movie output</h4>\n<p>This section controls the output of a movie file based on a collection of input OMF files. A movie will be made from each batch of OMF files if “Make Movies” is checked, but it defaults off.</p>\n<p>The leftmost configuration on the bottom row is the FPS of the output movie. You may also consider it “simulation files per second.” Since FFmpeg uses an awkward fixed-framerate form, frames will be duplicated to fill in time when the FPS is reduced. These temporary files are cleaned up automatically. This value can be between 1 and 25 FPS, and defaults to 25.</p>\n<p>The middle combo box allows the choice of encoding from a number of codecs built into FFmpeg. The default is HuffYUV, which I find gives the best-quality output files for the common red-white-blue color scheme. MPEG4 has some difficulty with the black-on-blue arrows and gives a visibly worse encoding. The HuffYUV decoder does not come standard on most systems (Windows) but is freely available, and I highly suggest using this codec.</p>\n<p>The rightmost control is the movie magnification, which functions similarly to the image magnification. However, many codecs are unstable for large input image sizes (above around 140% over the OOMMF default size) and may fail silently. This is a bug in the encoder and cannot be worked around. Therefore, increasing the movie magnification is done at the user’s risk. The default codec HuffYUV is quite robust, and readily supports use of the movie magnification control.</p>\n</div>\n<div id=\"e-drop-oommf-files-here-a-friendly-reminder\">\n<h4>E. Drop OOMMF Files Here! - a friendly reminder</h4>\n<p>Drag and drop configuration and vector field files here - or anywhere in the program window, but this section is a friendly reminder. Multiple files can be dropped at a time. OMF files are converted to bitmaps using the oommf command line utility avf2ppm and the supplied mmDisp configuration file. If a movie is being made, the batch of simultaneously dropped OMF files is converted to a single movie with the frames in filename order.</p>\n</div>\n</div>\n</div>\n<div id=\"id7\">\n<h2>ODTChomp</h2>\n<p>ODTChomp takes in ODT data tables, simplifies the name scheme to the extent it it possible, and outputs the desired columns into a text file with a given delimeter. The behavior is rather distict from odtcols, which is better at fixed-width rather than fixed-delimitation formatting.</p>\n<a href=\"https://oommftools.github.io/assets/odtchomp_window.png\" rel=\"nofollow\"><img alt=\"OOMMFTools ODTChomp\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/727303432b1ef3dd50f73c9a350345ad680cbe12/68747470733a2f2f6f6f6d6d66746f6f6c732e6769746875622e696f2f6173736574732f6f647463686f6d705f77696e646f772e706e67\"></a>\n<div id=\"id8\">\n<h3>1. Utilization</h3>\n<p>Begin by loading an ODT file. Drag-and-drop also works. The leftmost panel shows the columns found in the ODT file, using a simplified name scheme that uses the minimum number of uniquely identifying descriptors. The result is generally very human-readable unless the simulation file is extremely complex. The right panel shows which data fields will appear in the output file.</p>\n<p>Double-clicking an entry in the left panel, or clicking an entry and then the “–&gt;” button, will mark it for export. Double-clicking an entry in the right panel, or clicking an entry and then the “&lt;–” button, will remove it from the export. The subsequent set of buttons can be used to add or remove all fields from the output file. The “Move Up” and “Move Down” buttons affect the item highlighted in the right panel, and are used to reorder the output columns.</p>\n<p>The radio buttons between the two panels choose the delimiting symbol for the values in the output. For example, if you want the comma-separated values commonly used by Excel, choose comma. If you choose space as the delimited, spaces that appear in column names will be replaced by underscores in the output.</p>\n<p>Finally, the export button writes the selected columns in the selected order to a plaintext file.</p>\n</div>\n<div id=\"batch-mode\">\n<h3>2. Batch Mode</h3>\n<p>The checkbox just above the Export button enables Batch Mode. Batch Mode is designed to extract the same data fields from a large group of ODT files using drag-and-drop. Batch Mode can only be used once one file has already been loaded and export data has been selected. Even if Batch Mode is checked, if no file has previously been loaded, the first file drop will give non-batch behavior.</p>\n<p>Once a file has been loaded and data fields have been chosen, any files dragged and dropped onto ODTChomp with Batch Mode enabled will have the specified fields extracted. The output will be placed in the same folder as the dropped file, with the same filename and the “.txt” extension. Currently, dropping directories is not supported and they will not be recursed.</p>\n</div>\n</div>\n<div id=\"development\">\n<h2>Development</h2>\n<div id=\"running-tests\">\n<h3>Running Tests</h3>\n<pre>$pytest - run all tests\n$pytest tests/test_odtchomp.py - run test for one file\n$pytest tests/test_odtchomp.py::Test_headers_prettify - run specific test\n</pre>\n</div>\n<div id=\"running-pylint\">\n<h3>Running pylint</h3>\n<p>pylint –extension-pkg-whitelist=wx –output-format=colorized oommftools/oommftools.py</p>\n</div>\n</div>\n\n          </div>"}, "last_serial": 3656703, "releases": {"1.0": [{"comment_text": "", "digests": {"md5": "834b677067c669e17774e5b141188045", "sha256": "127032085188bfe2bd065a4d8a49d1e7d9389631bcf776bcc10f5b45276c1732"}, "downloads": -1, "filename": "OOMMFTools-1.0.tar.gz", "has_sig": false, "md5_digest": "834b677067c669e17774e5b141188045", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 19827, "upload_time": "2017-01-18T21:09:26", "upload_time_iso_8601": "2017-01-18T21:09:26.953207Z", "url": "https://files.pythonhosted.org/packages/ea/4c/1b2ed11c3d326c1df199f2c51c65f0b28a35e994e640e0708e08ac04dc05/OOMMFTools-1.0.tar.gz", "yanked": false}], "2.0.1": [{"comment_text": "", "digests": {"md5": "09e123f0bccf6f2f3ef7e58648711f4e", "sha256": "e657c7add9c58fc1eea56afe42f0bebe6df5e07964c8c1b59cb0450adf2e07a0"}, "downloads": -1, "filename": "oommftools-2.0.1-py2-none-any.whl", "has_sig": false, "md5_digest": "09e123f0bccf6f2f3ef7e58648711f4e", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 33669, "upload_time": "2018-03-08T20:27:32", "upload_time_iso_8601": "2018-03-08T20:27:32.514353Z", "url": "https://files.pythonhosted.org/packages/36/9b/c6c4e5c6f8521b2fc863eaf8bad525806ccb25ffe6ba8709481386610bf0/oommftools-2.0.1-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "cca9a5370479bb21d896c5e6885cee6d", "sha256": "de73b5a521faf22cff84e2b7b6ccd8a52d8113e732b715d55dfc1347916369b0"}, "downloads": -1, "filename": "oommftools-2.0.1.tar.gz", "has_sig": false, "md5_digest": "cca9a5370479bb21d896c5e6885cee6d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 22950, "upload_time": "2018-03-08T20:27:38", "upload_time_iso_8601": "2018-03-08T20:27:38.061140Z", "url": "https://files.pythonhosted.org/packages/9f/b7/bbca72b82f91706bdbd755ec474081c79da69b3f1bfd04150070b3b01bde/oommftools-2.0.1.tar.gz", "yanked": false}], "2.0.1.dev20180308": [{"comment_text": "", "digests": {"md5": "5b81caaea16c4c57ea3facf9cabb5c94", "sha256": "f4e0b651e594c4c98475e7ab3a99d82f4a345315274e8f8280a19d067a704f5c"}, "downloads": -1, "filename": "oommftools-2.0.1.dev20180308-py2-none-any.whl", "has_sig": false, "md5_digest": "5b81caaea16c4c57ea3facf9cabb5c94", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 33792, "upload_time": "2018-03-08T20:27:34", "upload_time_iso_8601": "2018-03-08T20:27:34.255902Z", "url": "https://files.pythonhosted.org/packages/11/59/776fcf230b520deadb2e41083c3916abf8656c83b41b84410e42d4d66283/oommftools-2.0.1.dev20180308-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1fe30c4b3ca4fa38676fe75bf5a03d90", "sha256": "1c77b2cff1fa6960f0234e27ceeb9d5f1c5319ae3400ddc5bcbea8465dd94335"}, "downloads": -1, "filename": "oommftools-2.0.1.dev20180308.tar.gz", "has_sig": false, "md5_digest": "1fe30c4b3ca4fa38676fe75bf5a03d90", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 22925, "upload_time": "2018-03-08T20:27:35", "upload_time_iso_8601": "2018-03-08T20:27:35.920860Z", "url": "https://files.pythonhosted.org/packages/62/4b/ffd09ae92ee976657f66630aa560b92e216e600338252706740161b598d9/oommftools-2.0.1.dev20180308.tar.gz", "yanked": false}], "2.0.2": [{"comment_text": "", "digests": {"md5": "06c01ec3925e0d2b547e4065a5bdd5c7", "sha256": "edfbc2f56cc5028ce0caf3b33484637db87e6ecff83178b4a5f1a07be14b12ac"}, "downloads": -1, "filename": "oommftools-2.0.2-py2-none-any.whl", "has_sig": false, "md5_digest": "06c01ec3925e0d2b547e4065a5bdd5c7", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 34268, "upload_time": "2018-03-10T10:30:29", "upload_time_iso_8601": "2018-03-10T10:30:29.006237Z", "url": "https://files.pythonhosted.org/packages/33/0e/97b3dbda7ab0a641cf3a8f4179e2bfd30266fd5a20f52fe86677336a9168/oommftools-2.0.2-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "39a63f63fa9eb3cb1869e3ecbc8211cf", "sha256": "775cd4f6555f9b82da6684e76a21657b40ada8204fe3adfbc0220a6180e99202"}, "downloads": -1, "filename": "oommftools-2.0.2.tar.gz", "has_sig": false, "md5_digest": "39a63f63fa9eb3cb1869e3ecbc8211cf", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23454, "upload_time": "2018-03-10T10:30:30", "upload_time_iso_8601": "2018-03-10T10:30:30.813389Z", "url": "https://files.pythonhosted.org/packages/3a/a0/a4943b780cca8fd59739955ce6ec0cd2bc8880882562622ccd7885a9ae43/oommftools-2.0.2.tar.gz", "yanked": false}], "2.0.2.dev20180310": [{"comment_text": "", "digests": {"md5": "413194c1bdc39219393069f2d4142e71", "sha256": "41e751724a3067982ee44043a5f4849c1e7e2f6256c8aeae3bef07f7ab448d0a"}, "downloads": -1, "filename": "oommftools-2.0.2.dev20180310-py2-none-any.whl", "has_sig": false, "md5_digest": "413194c1bdc39219393069f2d4142e71", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 34446, "upload_time": "2018-03-10T10:17:06", "upload_time_iso_8601": "2018-03-10T10:17:06.390171Z", "url": "https://files.pythonhosted.org/packages/a7/12/622908109b462c0241fd6d16d6df9ba2c5b2744f188e76674b3511179c9b/oommftools-2.0.2.dev20180310-py2-none-any.whl", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "06c01ec3925e0d2b547e4065a5bdd5c7", "sha256": "edfbc2f56cc5028ce0caf3b33484637db87e6ecff83178b4a5f1a07be14b12ac"}, "downloads": -1, "filename": "oommftools-2.0.2-py2-none-any.whl", "has_sig": false, "md5_digest": "06c01ec3925e0d2b547e4065a5bdd5c7", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 34268, "upload_time": "2018-03-10T10:30:29", "upload_time_iso_8601": "2018-03-10T10:30:29.006237Z", "url": "https://files.pythonhosted.org/packages/33/0e/97b3dbda7ab0a641cf3a8f4179e2bfd30266fd5a20f52fe86677336a9168/oommftools-2.0.2-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "39a63f63fa9eb3cb1869e3ecbc8211cf", "sha256": "775cd4f6555f9b82da6684e76a21657b40ada8204fe3adfbc0220a6180e99202"}, "downloads": -1, "filename": "oommftools-2.0.2.tar.gz", "has_sig": false, "md5_digest": "39a63f63fa9eb3cb1869e3ecbc8211cf", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23454, "upload_time": "2018-03-10T10:30:30", "upload_time_iso_8601": "2018-03-10T10:30:30.813389Z", "url": "https://files.pythonhosted.org/packages/3a/a0/a4943b780cca8fd59739955ce6ec0cd2bc8880882562622ccd7885a9ae43/oommftools-2.0.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:03:42 2020"}