{"info": {"author": "Waterbear Cloud", "author_email": "hello@waterbear.cloud", "bugtrack_url": null, "classifiers": ["Intended Audience :: Developers", "License :: OSI Approved :: Mozilla Public License 2.0 (MPL 2.0)", "Programming Language :: Python", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3.8"], "description": "# Paco: Prescribed automation for cloud orchestration\n\n [![PyPi version](https://img.shields.io/pypi/v/paco-cloud.svg)](https://pypi.python.org/pypi/paco-cloud/) [![](https://img.shields.io/badge/python-3.6+-blue.svg)](https://www.python.org/downloads/) ![t](https://img.shields.io/badge/status-stable-green.svg) [![](https://img.shields.io/github/license/waterbear-cloud/paco.svg)](https://github.com/waterbear-cloud/paco/blob/master/LICENSE.md)\n\n\nPaco is a cloud orchestration tool for AWS. It enables you to automate the creation and management of your cloud resources\nwith declarative YAML. For more see the [paco-cloud.io web site](https://www.paco-cloud.io).\n\n## Use Paco\n\nPaco can be pip installed from the [paco-cloud](https://pypi.org/project/paco-cloud) package on PyPI.\n\n    pip install paco-cloud\n\nFor more information see the [Paco install](https://www.paco-cloud.io/en/latest/install.html) instructions.\nThen see [Getting Started with Paco](https://www.paco-cloud.io/en/latest/started.html) to learn how to\ncreate a Paco project and connect it to your AWS account.\n\n\n## Get Involved\n\n - Give us a Git Star and share on social media with #PacoCloud. Community discussion happens on\n   [/r/paco_cloud](https://www.reddit.com/r/paco_cloud/).\n\n- Chat with us on [Gitter at paco-cloud](https://gitter.im/paco-cloud/community).\n\n - Submit [feature request and bug reports](https://github.com/waterbear-cloud/paco/issues) on GitHub.\n\n - To develop Paco, git clone this project as well as [paco.models](https://github.com/waterbear-cloud/paco.models).\n\n## Authors\n\nPaco is created by Kevin Lindsay and Kevin Teague for [Waterbear Cloud](https://waterbear.cloud).\n\n\nChangelog for Paco\n==================\n\n6.2.0 (2020-04-04)\n------------------\n\n### Migration\n\n- ASG rolling_udpate_policy behaviour has been changed. The fields ``update_policy_max_batch_size`` and ``update_policy_min_instances_in_service``\n  have been removed and these settings are only controlled with the ``rolling_udpate_policy`` field.\n\n### Added\n\n- IoT support! IoT Core has new types for IoTPolicy and IoTTopicRule, IoT Analytics has an IoTAnalyticsPipeline.\n\n### Changed\n\n- All Paco warnings are now prefixed with a standard \"WARNING:\" and will only\n  be displayed if the -w, --warn flag is passed.\n\n- DeepDiff version required is 4.3.2. This version fixes the need to fiddle with deprecation\n  warning suppression.\n\n\n6.1.1 (2020-03-14)\n------------------\n\n### Added\n\n- Expanded the Stages/Actions for DeploymentPipeline to include S3.Deploy\n\n### Fixed\n\n- SLRoles template was not fully ported to StackTemplate API.\n\n- CodePipeline resource can be created in Service applications.\n\n\n6.1.0 (2020-03-09)\n------------------\n\n### Added\n\n- New Private PyPI Starter Project.\n\n\n6.0.1 (2020-03-08)\n------------------\n\n### Fixed\n\n- Removed ``{{['.gitignore']|join}}`` cookiecutter file that crept back in that breaks install on\n  filesystems that do not allow the | character.\n\n- ALB rule.target group fix was merged into wrong place in the code.\n\n- Restored StackOrders which wasn't being respected after refactor.\n\n6.0.0 (2020-03-06)\n------------------\n\n### Breaking\n\n- Consolidated the Paco work directories into a single ``.paco-work`` directory.\n  Documented them on a new Paco Internals doc page. To migrate an existing Paco project\n  to this new structure:\n\n      cd <my-paco-project>\n      git mv aimdata .paco-work\n      git mv Outputs .paco-work/outputs\n      git mv build .paco-work/build\n\n  Those commands assume you are using git to manage a Paco project. If you are, also update your ``.gitignore``\n  file to ignore .paco-work/build.\n\n- The IAM Roles for BackupVault had inconsistently named CloudFormation stacks (\"BackupVaults--Backup\").\n  A new IAM Role will be created in a new stack. The old stack will remain but it can be safely deleted.\n\n  There will be a stack UPDATE to the BackupVaults. Each AWS::Backup::BackupSelection resource will\n  have \"Selection: \" prefixed on the SelectionName, this will replace the old BackupSelection resources\n  with new ones using the new Role. The AWS CloudFormation documentation states that a BackupSelection's\n  SelectionName is a display name only, but this is incorrect.\n\n- Removed the ``Resource/NotificationGroups.yaml`` filename alias. This file is now only loaded using\n  the filename ``resoruce/snstopics.yaml``.\n\n- EventsRule type target field changed from a list of Targets to a list of IEventTarget objects. This allows\n  the ability to specify other information with the target such as the input_json field. Old was:\n\n    type: EventsRule\n    targets:\n      - paco.ref some.ref\n\n  The new format is:\n\n    type: EventsRule\n    targets:\n      - target: paco.ref some.ref\n        input_json: '{\"cat\":\"dog\"}'\n\n### Added\n\n- DeploymentPipeline can now use GitHub.Source as a source.\n\n- Integrated the Parliment library to lint/validate the IAM Policies used for all Roles.\n  https://github.com/duo-labs/parliament\n\n\n5.1.1 (2020-02-19)\n------------------\n\n### Fixed\n\n- Fixed security_group field for ElasticsearchDomain.\n\n\n5.1.0 (2020-02-19)\n------------------\n\n### Added\n\n- Ability to enforce that you need to be on a specific git branch to change a specific environment.\n  Documentation for this was added to a new Paco Workflows page.\n\n## Fixed\n\n- Added proper names to Elasticsearch output refs.\n\n5.0.1 (2020-02-17)\n------------------\n\n### Added\n\n- ASG has new field desirec_capacity_ignore_changes that can be set.\n\n### Fixed\n\n- If ignore_changes was set for a CloudFormation Parameter it was breaking the Confirm Changes CLI.\n\n\n5.0.0 (2020-02-17)\n------------------\n\n### Breaking\n\n- Breaking: Lamdba now creates it's Log Group in the CloudFormation. It also allows for additional\n  app-specific Log Groups. Lambda's execution role now restricts Log Group permissions to just the\n  Log Groups it needs.\n\n  If you have existing Lambdas, you will need to delete the Log Group and then re-provision the\n  Lambda (and ensrue the Lambda isn't invoked after the Log Group is deleted or it will re-create it).\n  This will allow the Lambda Log Groups to be under CloudFormation state.\n\n### Added\n\n- ServiceLinkedRoles for IAM. New IAM controller method ``add_service_linked_role`` which can be\n  used to add a SerivceLinkedRole.\n\n- ElasticsearchDomain resource.\n\n- Ability for a template Parameter to ignore_changes. If this is True then the Parameter will not\n  be changed during stack updates.\n\n- ASG has a new instance_ami_ignore_changes field which will mark the InstanceAMI Parameter with\n  ignore_changes.\n\n- EventRules can be in the State=ENABLED or State=DISABLED set by the ``enabled_state`` boolean field.\n\n### Changed\n\n- EventsRules are named with a random suffix instead of a prefix. This makes it easier to\n  use the --name-prefix option for list-rules in the AWS CLI and API.\n\n- New CFTemplate.create_output created that makes creating and registering outputs easier.\n\n4.0.0 (2020-02-05)\n------------------\n\n### Breaking\n\n- Breaking: This will change the secrets for any secret that was created by ``generate_secret_string``.\n  Completed full implementation of ``secrets.generate_secret_string``, every property in the CloudFormation\n  resource is represented so that expressing defaults won't trigger new secret created.\n\n### Added\n\n- New ``warn_template_changes`` method for CFTemplate. This is a hook that allows\n  templates to print a warning about potential unintended side-effects of the change.\n  The SecretsManager template is the first to implement this warning hook.\n\n### Docs\n\n- Improved Getting Started documentation and \"paco init project\" CLI messages.\n\n3.5.5 (2020-01-29)\n------------------\n\n### Fixed\n\n- EFS resource can be in a disabled state.\n\n- EIP resource will be removed when disabled.\n\n- ALB resource properly removes ALB when disabled.\n\n- ASG resource is properly disabled.\n\n\n3.5.4 (2020-01-21)\n------------------\n\n### Added\n\n- CloudFrontCacheBehaviours have min_ttl and max_ttl field support.\n\n### Fixed\n\n- CodeCommit repositories policy refactor to work around maximum 10 policy per IAM User limit.\n\n\n3.5.3 (2020-01-16)\n------------------\n\n### Added\n\n- Warn if generated CloudFormation template reaches 80% or greater of the maximum stack size of 51,200 bytes.\n\n### Fixed\n\n- AWS Backup was missing group name in templates. Now creates a stack for every BackupVault.\n\n3.5.2 (2020-01-08)\n------------------\n\n### Fixed\n\n- `paco init project` creates the `.gitignore` after cookiecutter runs. This avoids having a | character\n  in the filename, which certain filsystems do not like.\n\n- Fixed bug where resource/s3.yaml buckets were being run twice on validate and provision.\n\n3.5.1 (2020-01-06)\n------------------\n\n### Fixed\n\n- Fix starter projects: check for aws_second_region in ``paco init project``.\n\n### Changed\n\n- Starter Projects paco-project-version brought up to 6.3.\n\n3.5.0 (2020-01-03)\n------------------\n\n### Added\n\n - Route 53 Health Checks support ip_address field.\n\n - Duplicate key errors in the YAML have a proper error message.\n\n - Docs have multi-account set-up page.\n\n### Changed\n\n- NetworkEnvironment networks can now be (almost) empty. This can be used for serverless environments\n  that do not need a network. The ``network:`` configuration still needs to exist, but only has to contain\n  the ``aws_account`` and ``enabled`` fields.\n\n- Removed Parameter.ending format for cfn-init parameters and Dashboard variables.\n  Instead simply including the ending in the paco.ref\n\n- cfn-init launch bundle sends cfn-signal after cfn-init finishes.\n\n- `paco provision account` provisions the accounts.\n\n### Fixed\n\n- If entire VPC is disabled for an ASG, the disabled ASG is removed.\n\n- DeploymentPipeline can be enabled/disabled without throwing errors.\n\n- Throw error if an account is missing an account_id.\n\n- Throw error if .credentials file is missing before asking for MFA.\n\n- cfn-init uses proper base path for Amazon Linux which has cfn-init pre-installed in /opt/aws.\n\n- log group expire_events_after_days can be left blank for log_set and log_group without throwing error.\n\n- Route 53 Record Set stack for an ALB is provisioned in the same account that Route53 is in.\n\n- DeploymentPipeline no longer hard-codes to a 'data' account for CodeCommit principle,\n  and instead uses the actual account(s) that CodeCommit repo's use.\n\n- Alarm notifications that do not come from plug-in work again.\n\n- Clean-up for wordpress-single-tier starting template.\n\n- Create ~/.aws/cli/cache directory if it doesn't already exist.\n\n- LogAlarms were incorrectly getting a Resource Dimension added to them.\n\n\n3.4.1 (2019-12-04)\n------------------\n\n### Fixed\n\n- Include paco.cookiecutters data files in paco-cloud distribution.\n\n\n3.4.0 (2019-12-03)\n------------------\n\n### Added\n\n- New CloudWatch Dashboard resource.\n\n- Route53 Health Check supports domain_name or load_balancer fields.\n\n### Fixed\n\n- include paco.stack_grps package!\n\n- Route53 Health Check alarm gets Namespace again.\n\n### Changed\n\n- Final AIM --> Paco rename: Log metric namespace changed from `AIM/` to `Paco/`\n\n3.3.1 (2019-11-29)\n------------------\n\n### Fixed\n\n- Placeholder in the wordpress-single-tier template for AMI Id.\n\n- Assorted fixes created by the AIM to paco rename.\n\n- ALB AWS::ElasticLoadBalancingV2::ListenerCertificate are restored.\n\n- Fixed Zone reference lookups in Route53 stack group.\n\n### Docs\n\n- Overview page works on mobile.\n\n3.3.0 (2019-11-28)\n------------------\n\n### Changed\n\n- Changed dependency from `aim.models` to `paco.models`\n\n- Renamed all things `aim` to `paco`.\n\n\n3.2.0 (2019-11-27)\n------------------\n\n- AIM has been renamed to Paco: Prescribed automation for cloud orchestration.\n  The CLI is now `paco` with a PACO_HOME environment variables. The\n  PyPI package is at `paco-cloud`.\n\n- AWS Backup service is supported by paco. Create BackupVaults with BackupPlans and BackupSelections.\n\n\n3.1.0 (2019-11-06)\n------------------\n\n### Added\n\n- DBParameterGroups template.\n\n- LogGroups template adds MetricFilters if present.\n\n- Respect the `global_role_names` field for the IAM Role RoleName.\n\n- Alarms can be provisioned at the Application level without being specific to a Resoure context.\n\n- Route53HealthChecks can be provisioned. These are global resources with the application region\n  suffixed to the health check name. The CloudFormation template and CLoudWatch Alarm are provisioned\n  in us-east-1, as that is where the metrics are hard-coded to by AWS.\n\n- Lambda template will grant Lambda permissions to an Events Rule in the same application that\n  references it as a Target.\n\n- New Events Rule template.\n\n- Added change_protected support to Cloudfront, IAM Managed Policies, and IAM Role templates.\n\n- Added a CodeBuild IAM Permission for IAM Users\n\n- Added the EIP Application Resource and a support 'eip' field to the ASG resource for associating an EIP with a single instance ASG.\n\n- Added `cftemplate_iam_user_delegates_2019_10_02` legacy flag to make user delegate role stack names consistent with others.\n\n- Added support to allow ASG to launch into a single subnet.\n\n- Added ResourceGroupid to the ElastiCache Application Resource\n\n- Added caching to instance AMI ID function.ref lookups.\n\n- Added swap, wget installer, and get tag value helper functions to the EC2 Launch manager and moved all of its scripts to a separate file that is copied from S3 and executed.\n\n- Added VPC Associations to the VPC private hosted zone.\n\n- Added VpcConfig to the Lambda function cftemplate.\n\n- Added `secrets_manager` to Network Environments.\n\n- Added support for !Ref and !Sub to yaml.py\n\n- Added a 'Nested StackGroup' feature to StackGroups. This allows us to nest a StackGroup in the place of a Stack within a StackGroup. This was needed to allow Route53 RecordSets to be created in order, but to allow a different Stack name from the current StackGroup being populated.\n\n- Added the Route53RecordSet CFTemplate and ctl_route53.add_record_set() method.\n\n- Added the EBS Application Resources.\n  Added `ebs_volume_mounts` to IASG to mount volumes to single instance groups.\n  Added the EBS Launch Bundle to implement `ebs_volume_mounts`\n\n### Changed\n\n- Fixed bug where if a AssumeRolePolicyDocument has both `service` and `aws` fields for the Principal,\n  the `aws` field was ignored.\n\n- Improvements to the CLI. Verbose flag is now respected.\n  Yes/no questions are consistent and can be answered with 'y', 'n', 'yes' or 'no'.\n  Clean-up to formatting. Only prompt for provision changes when running the provision\n  sub-command.\n\n- ALB Alarms now provision with an `LBApplication` suffix and match the Resoruce.type field.\n\n- Made IAM Users default password more complex to satisfy password contraints.\n\n- Updated some of the cookiecutter templates for `aim init project`.\n\n- Ported the Route53 CFTemplate to troposphere and separated zones into their own stacks.\n  Added the legacy flag `route53_hosted_zone_2019_10_12` for this change.\n\n- Cleaned up expired token handling in Stack() by consolidating duplicate code into a single method.\n\n- Refactor of EC2 Launch Manager user data script management. Common functions are now stored in S3 to reduce user data size.\n\n- Modifed LogGroup names to include the Network Environment name.\n\n- Refactored how Route53 RecordSets are being created. The previous design created RecordSets right in the resource's template. The new design uses the Route53 Controller to create RecordSets in their own stack using an account global name . The reason is that CloudFormation does not allow you to modify RecordSets unless you are modifying the stack that created it. This made it impossible to move DNS between resources without first deleting the record and recreating it. With a global controller, we can simple rewrite the RecordSets to new values.\n  Added `route53_record_set_2019_10_16` legacy flag to deal with pre-existing RecordSets\n\n- Moved app_engine.get_stack_from_ref to StackGroup\n\n### Fixed\n\n- Fixed a couple of AWS token expiry retries from failing.\n\n- AWS session caching was not properly caching.\n\n- NotificationGroups controller was not setting up refs correctly, nor resolving them correctly.\n\n3.0.0 (2019-09-27)\n------------------\n\n### Added\n\n- New directory `aimdata` is created within an AIM Project by paco. This is used to record state\n  of AIM provisioning. CloudFormation templates used to create stacks in AWS are cached as well\n  as the last copy of the AIM Project YAML files. These files are used to speed up subsequent\n  runs and more importantly can show you what is changed between AIM runs to make it easier to\n  review new changes before they are actaully made to AWS.\n\n- CLI: Display a diff of changes from last AIM run and new run in the AIM Project YAML configuration.\n  The `-d`, `--disable-validation` flag can be used to\n\n- CLI: Display changes and ask for verification before updating CF templates. This can be disabled\n  with the `-y` flag.\n\n- CLI: Offer to delete a stack in a CREATE FAILED state so that a new stack can be provisioned in it's place.\n\n- AWS credentials can now be set to live for up to 12 hours. You can set the .credentials field to\n `mfa_session_expiry_secs: 43200 # 12 hours` to enable this. The default is still one hour.\n\n- Resources with the `change_protected` flag set to true will not have their CloudFormation stacks\n  updated.\n\n- API Gateway REST API can now have models, methods and stages. It supports Lambda integration\n  with either 'AWS_PROXY' via an assumed Role or 'AWS' via a Lambda Permission.\n\n- S3Bucket has NotificationConfiguration for Lambdas. Lambda will detect if an S3Bucket within the\n  same application notifies the lambda and will automatically add a Lambda permission to allow S3 to\n  invoke the lambda.\n\n- Lambda AWS::SNS::Subscription resources now have a Region property.\n\n- CloudWatchAlarms template has a `notification_region` class attribute that can be set if\n  notificationgroup subscriptions need to go to a single region.\n\n- CloudFront has Origin ID support.\n\n- EFS Resource support.\n\n### Changed\n\n- Breaking! CF Template names have been refactored so that they are more user friendly when listed in the\n  AWS Console. This requires deletion and reprovisioning of AWS resources. Templates now have new\n  consistent ways to create their names, so this should be the last time this change happens.\n\n- CLI: References to NetworkEnvironments now use consistent `paco.ref` syntax, e.g.\n  `aim provision netenv <ne>.<env>.<region>`\n\n- All stacks are created with Termination Protection set.\n\n- CF template base class `paco.cftemplates.cftemplates.CFTemplate` has new methods for creating consistent\n  AWS names: `create_resource_name()`, `create_resoruce_name_join()`, `create_cfn_logical_id()`,\n  and `create_cfn_logical_id_join()`.\n\n- Console messages reworked to show relevant information in columns.\n\n- CF template base class method `gen_parameter` renamed to `create_cfn_parameter`.\n\n- S3 controller now relies on the bucket name to come from the S3Bucket model object.\n\n- Lambda code.s3_bucket field can now be an paco.ref or a plain bucket name.\n\n- You can provision without specifying the region and it will include all regions in an env.\n\n- NotificationGroups are loaded from project['resource']['notificationgroups']\n\n### Fixed\n\n- CloudTrail generates it's own CloudWatch LogGroup if needed. Outputs for CloudTrail and CloudWatch LogGroup.\n\n- APIGateway, SNSTopics and Lambda now respect the `enabled` field.\n\n2.0.0 (2019-08-26)\n------------------\n\n### Fixed\n\n- snstopic output ref and lambda alarm ref fixes.\n\n- Added IAM Users feature for creating IAM Users and configuring console access\n  assigning permissions, and access keys.\n\n### Added\n\n- Moved aim reference generation into the Model. Model objects now have .paco_ref and\n  .paco_ref_parts properties which contain their paco.ref reference.\n\n- Added StackOutputsManger(). This now creates and maintains $AIM_HOME/ResourceMap.yaml\n  which will include a complete list of all stack outputs that are referenced using the\n  yaml dictionary path of the resource.\n\n- ALB Outputs includes TargetGroup Fullname.\n\n- Minimal APIGatewayRestApi template.\n\n- Added external_resource support to the ACM\n\n- Added ReadOnly support to the Administrator IAMUserPermission\n\n### Changed\n\n- Automated CloudFront Parameter lists for things like security group and target arn lists.\n\n- Consolidated CFTemplates and Stack's and other Stack cleanups.\n\n- CloudWatch Alarms multi-Dimension Alarms now expect an paco.ref. CloudWatch Alarms are now Troposphere.\n\n\n1.4.0 (2019-08-21)\n------------------\n\n### Added\n\n- CloudTrail resource adds basic CloudTrail provisioning.\n\n- LogGroups are created for all groups that the CloudWatch Agent will require.\n  Uses the new Logging schema in paco.models.\n\n- Added CloudFront application Resource\n\n- Added VPC Peering application resource.\n\n- Automated the glue of passing outputs from a stack to the parameter of another stack.\n\n1.3.1 (2019-08-07)\n------------------\n\n### Fixed\n\n- Python packaging, also include version.txt.\n\n\n1.3.0 (2019-08-07)\n------------------\n\n### Changed\n\n- CloudWatchAlarms now check for namespace and dimesions fields, that\n  can be used to override the default of one primary dimension and the resource_name.\n\n### Fixed\n\n- Python dist did not include README.md and CHANGELOG.md\n\n1.2.0 (2019-08-06)\n------------------\n\n### Added\n\n- Deleting resources can leave dangling CloudFormation templates in your\n  account. Controllers for NetworkEnvironments now keep track of templates\n  they've provisioned and warn you about unused templates.\n\n- NotificationGroups can be provisioned as SNS Topics and subscriptions.\n  Use ``aim provision notificationgroups``.\n\n- CloudWatch Alarm descriptions are JSON with metadata about the environment,\n  region, application, resource group and resource that the alarm is for.\n\n- CloudWatch Alarms will not notify the SNS Topics that they are subscribed to.\n\n- Rewrote commands with consistent way of passing arguments to controllers.\n  Controllers args can now be all lower case.\n\n- Added Account initialization to 'aim init project'.\n\n### Changed\n\n - AIM references have a new format! It's simpler and more consistent.\n   Every ref now starts with ``paco.ref ``.\n\n - Created ``paco.utils`` to clean up PacoContext object.\n\n1.1.0 (2019-07-24)\n------------------\n\n### Added\n\n- Logging functionality added to monitoring. Logs will be ingested by a configured\n  CloudWatch Agent and sent to a CloudWatch Log Group.\n\n- Added --nocache to cli to force updates to stacks.\n\n- CLI reports human readable validation errors from AIM project configuration files\n\n- \"aim ftest\" command added to run functional tests on the \"aim init project\"\n  templates. This command will be expanded in the future so you can test your\n  own aim projects.\n\n- Resources/S3.yaml is now functional: eg. aim validate S3\n\n- Added Region to cftemplates so we can do inline replace of <account> and <region>.\n\n- Added LambdaPermission and CWEventRule cftemplates.\n\n- Added CloudWatchController and LambdaController.\n\n### Fixed\n\n - cookiecutter generated .credentials file was not in git repo as, the cookiecutter\n   .gitignore file was causing it to be ignored.\n\n\n1.0.0 (2019-07-06)\n------------------\n\n### Added\n\n- Initial documentation with AIM project site at https://paco.waterbear.cloud/en/latest/\n\n- Added init command with ability to create starting templates for AIM projects\n  with the cookiecutter project under the hood.\n\n- Added redirect to Listner rules in the ALB\n\n### Changed\n\n- Document and refactor AIM CLI.\n\n- Moved yaml.py to paco.core\n\n- Refactored S3 Controller\n\n- Ported Route53 config to the model\n\n- Ported CodeCommit config to the model\n\n- Refactored S3 to use Application StackGroup\n\n- CPBD artifacts s3 bucket now uses S3 Resource in NetEnv yaml instead\n\n- Converted the ALB's listener and listener rules to dicts from lists\n\n### Removed\n\n- Removed deprecated configuration\n\n\n0.6.0 (2019-06-21)\n-----------------------\n\n- Document and clean-up AIM CLI\n\n- Validate and Provision functioning after cleanup\n\n\n0.5.0 (2019-06-21)\n------------------\n\n- First open source release", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/waterbear-cloud/paco", "keywords": "AWS,Waterbear,Cloud,Infrastructure as Code,CloudFormation", "license": "", "maintainer": "", "maintainer_email": "", "name": "paco-cloud", "package_url": "https://pypi.org/project/paco-cloud/", "platform": "", "project_url": "https://pypi.org/project/paco-cloud/", "project_urls": {"Homepage": "https://github.com/waterbear-cloud/paco"}, "release_url": "https://pypi.org/project/paco-cloud/6.2.0/", "requires_dist": null, "requires_python": "", "summary": "Paco: Prescribed automation for cloud orchestration", "version": "6.2.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Paco: Prescribed automation for cloud orchestration</h1>\n<p><a href=\"https://pypi.python.org/pypi/paco-cloud/\" rel=\"nofollow\"><img alt=\"PyPi version\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/27fb0b693a32239ed81093efffd1d95f42e83a9f/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f7061636f2d636c6f75642e737667\"></a> <a href=\"https://www.python.org/downloads/\" rel=\"nofollow\"><img alt=\"\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/6a042d910c74fbce532a01da853019c164ef42a8/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f707974686f6e2d332e362b2d626c75652e737667\"></a> <img alt=\"t\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/1bb67b3a6efe045bfa065b326d3d2a3fef5847b9/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f7374617475732d737461626c652d677265656e2e737667\"> <a href=\"https://github.com/waterbear-cloud/paco/blob/master/LICENSE.md\" rel=\"nofollow\"><img alt=\"\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/770ab8a12c55b54c95a49c1cb31ee62be8e71c7c/68747470733a2f2f696d672e736869656c64732e696f2f6769746875622f6c6963656e73652f7761746572626561722d636c6f75642f7061636f2e737667\"></a></p>\n<p>Paco is a cloud orchestration tool for AWS. It enables you to automate the creation and management of your cloud resources\nwith declarative YAML. For more see the <a href=\"https://www.paco-cloud.io\" rel=\"nofollow\">paco-cloud.io web site</a>.</p>\n<h2>Use Paco</h2>\n<p>Paco can be pip installed from the <a href=\"https://pypi.org/project/paco-cloud\" rel=\"nofollow\">paco-cloud</a> package on PyPI.</p>\n<pre><code>pip install paco-cloud\n</code></pre>\n<p>For more information see the <a href=\"https://www.paco-cloud.io/en/latest/install.html\" rel=\"nofollow\">Paco install</a> instructions.\nThen see <a href=\"https://www.paco-cloud.io/en/latest/started.html\" rel=\"nofollow\">Getting Started with Paco</a> to learn how to\ncreate a Paco project and connect it to your AWS account.</p>\n<h2>Get Involved</h2>\n<ul>\n<li>\n<p>Give us a Git Star and share on social media with #PacoCloud. Community discussion happens on\n<a href=\"https://www.reddit.com/r/paco_cloud/\" rel=\"nofollow\">/r/paco_cloud</a>.</p>\n</li>\n<li>\n<p>Chat with us on <a href=\"https://gitter.im/paco-cloud/community\" rel=\"nofollow\">Gitter at paco-cloud</a>.</p>\n</li>\n<li>\n<p>Submit <a href=\"https://github.com/waterbear-cloud/paco/issues\" rel=\"nofollow\">feature request and bug reports</a> on GitHub.</p>\n</li>\n<li>\n<p>To develop Paco, git clone this project as well as <a href=\"https://github.com/waterbear-cloud/paco.models\" rel=\"nofollow\">paco.models</a>.</p>\n</li>\n</ul>\n<h2>Authors</h2>\n<p>Paco is created by Kevin Lindsay and Kevin Teague for <a href=\"https://waterbear.cloud\" rel=\"nofollow\">Waterbear Cloud</a>.</p>\n<h1>Changelog for Paco</h1>\n<h2>6.2.0 (2020-04-04)</h2>\n<h3>Migration</h3>\n<ul>\n<li>ASG rolling_udpate_policy behaviour has been changed. The fields <code>update_policy_max_batch_size</code> and <code>update_policy_min_instances_in_service</code>\nhave been removed and these settings are only controlled with the <code>rolling_udpate_policy</code> field.</li>\n</ul>\n<h3>Added</h3>\n<ul>\n<li>IoT support! IoT Core has new types for IoTPolicy and IoTTopicRule, IoT Analytics has an IoTAnalyticsPipeline.</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>\n<p>All Paco warnings are now prefixed with a standard \"WARNING:\" and will only\nbe displayed if the -w, --warn flag is passed.</p>\n</li>\n<li>\n<p>DeepDiff version required is 4.3.2. This version fixes the need to fiddle with deprecation\nwarning suppression.</p>\n</li>\n</ul>\n<h2>6.1.1 (2020-03-14)</h2>\n<h3>Added</h3>\n<ul>\n<li>Expanded the Stages/Actions for DeploymentPipeline to include S3.Deploy</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>\n<p>SLRoles template was not fully ported to StackTemplate API.</p>\n</li>\n<li>\n<p>CodePipeline resource can be created in Service applications.</p>\n</li>\n</ul>\n<h2>6.1.0 (2020-03-09)</h2>\n<h3>Added</h3>\n<ul>\n<li>New Private PyPI Starter Project.</li>\n</ul>\n<h2>6.0.1 (2020-03-08)</h2>\n<h3>Fixed</h3>\n<ul>\n<li>\n<p>Removed <code>{{['.gitignore']|join}}</code> cookiecutter file that crept back in that breaks install on\nfilesystems that do not allow the | character.</p>\n</li>\n<li>\n<p>ALB rule.target group fix was merged into wrong place in the code.</p>\n</li>\n<li>\n<p>Restored StackOrders which wasn't being respected after refactor.</p>\n</li>\n</ul>\n<h2>6.0.0 (2020-03-06)</h2>\n<h3>Breaking</h3>\n<ul>\n<li>\n<p>Consolidated the Paco work directories into a single <code>.paco-work</code> directory.\nDocumented them on a new Paco Internals doc page. To migrate an existing Paco project\nto this new structure:</p>\n<pre><code>cd &lt;my-paco-project&gt;\ngit mv aimdata .paco-work\ngit mv Outputs .paco-work/outputs\ngit mv build .paco-work/build\n</code></pre>\n<p>Those commands assume you are using git to manage a Paco project. If you are, also update your <code>.gitignore</code>\nfile to ignore .paco-work/build.</p>\n</li>\n<li>\n<p>The IAM Roles for BackupVault had inconsistently named CloudFormation stacks (\"BackupVaults--Backup\").\nA new IAM Role will be created in a new stack. The old stack will remain but it can be safely deleted.</p>\n<p>There will be a stack UPDATE to the BackupVaults. Each AWS::Backup::BackupSelection resource will\nhave \"Selection: \" prefixed on the SelectionName, this will replace the old BackupSelection resources\nwith new ones using the new Role. The AWS CloudFormation documentation states that a BackupSelection's\nSelectionName is a display name only, but this is incorrect.</p>\n</li>\n<li>\n<p>Removed the <code>Resource/NotificationGroups.yaml</code> filename alias. This file is now only loaded using\nthe filename <code>resoruce/snstopics.yaml</code>.</p>\n</li>\n<li>\n<p>EventsRule type target field changed from a list of Targets to a list of IEventTarget objects. This allows\nthe ability to specify other information with the target such as the input_json field. Old was:</p>\n<p>type: EventsRule\ntargets:\n- paco.ref some.ref</p>\n<p>The new format is:</p>\n<p>type: EventsRule\ntargets:\n- target: paco.ref some.ref\ninput_json: '{\"cat\":\"dog\"}'</p>\n</li>\n</ul>\n<h3>Added</h3>\n<ul>\n<li>\n<p>DeploymentPipeline can now use GitHub.Source as a source.</p>\n</li>\n<li>\n<p>Integrated the Parliment library to lint/validate the IAM Policies used for all Roles.\n<a href=\"https://github.com/duo-labs/parliament\" rel=\"nofollow\">https://github.com/duo-labs/parliament</a></p>\n</li>\n</ul>\n<h2>5.1.1 (2020-02-19)</h2>\n<h3>Fixed</h3>\n<ul>\n<li>Fixed security_group field for ElasticsearchDomain.</li>\n</ul>\n<h2>5.1.0 (2020-02-19)</h2>\n<h3>Added</h3>\n<ul>\n<li>Ability to enforce that you need to be on a specific git branch to change a specific environment.\nDocumentation for this was added to a new Paco Workflows page.</li>\n</ul>\n<h2>Fixed</h2>\n<ul>\n<li>Added proper names to Elasticsearch output refs.</li>\n</ul>\n<h2>5.0.1 (2020-02-17)</h2>\n<h3>Added</h3>\n<ul>\n<li>ASG has new field desirec_capacity_ignore_changes that can be set.</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>If ignore_changes was set for a CloudFormation Parameter it was breaking the Confirm Changes CLI.</li>\n</ul>\n<h2>5.0.0 (2020-02-17)</h2>\n<h3>Breaking</h3>\n<ul>\n<li>\n<p>Breaking: Lamdba now creates it's Log Group in the CloudFormation. It also allows for additional\napp-specific Log Groups. Lambda's execution role now restricts Log Group permissions to just the\nLog Groups it needs.</p>\n<p>If you have existing Lambdas, you will need to delete the Log Group and then re-provision the\nLambda (and ensrue the Lambda isn't invoked after the Log Group is deleted or it will re-create it).\nThis will allow the Lambda Log Groups to be under CloudFormation state.</p>\n</li>\n</ul>\n<h3>Added</h3>\n<ul>\n<li>\n<p>ServiceLinkedRoles for IAM. New IAM controller method <code>add_service_linked_role</code> which can be\nused to add a SerivceLinkedRole.</p>\n</li>\n<li>\n<p>ElasticsearchDomain resource.</p>\n</li>\n<li>\n<p>Ability for a template Parameter to ignore_changes. If this is True then the Parameter will not\nbe changed during stack updates.</p>\n</li>\n<li>\n<p>ASG has a new instance_ami_ignore_changes field which will mark the InstanceAMI Parameter with\nignore_changes.</p>\n</li>\n<li>\n<p>EventRules can be in the State=ENABLED or State=DISABLED set by the <code>enabled_state</code> boolean field.</p>\n</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>\n<p>EventsRules are named with a random suffix instead of a prefix. This makes it easier to\nuse the --name-prefix option for list-rules in the AWS CLI and API.</p>\n</li>\n<li>\n<p>New CFTemplate.create_output created that makes creating and registering outputs easier.</p>\n</li>\n</ul>\n<h2>4.0.0 (2020-02-05)</h2>\n<h3>Breaking</h3>\n<ul>\n<li>Breaking: This will change the secrets for any secret that was created by <code>generate_secret_string</code>.\n  Completed full implementation of <code>secrets.generate_secret_string</code>, every property in the CloudFormation\nresource is represented so that expressing defaults won't trigger new secret created.</li>\n</ul>\n<h3>Added</h3>\n<ul>\n<li>New <code>warn_template_changes</code> method for CFTemplate. This is a hook that allows\ntemplates to print a warning about potential unintended side-effects of the change.\nThe SecretsManager template is the first to implement this warning hook.</li>\n</ul>\n<h3>Docs</h3>\n<ul>\n<li>Improved Getting Started documentation and \"paco init project\" CLI messages.</li>\n</ul>\n<h2>3.5.5 (2020-01-29)</h2>\n<h3>Fixed</h3>\n<ul>\n<li>\n<p>EFS resource can be in a disabled state.</p>\n</li>\n<li>\n<p>EIP resource will be removed when disabled.</p>\n</li>\n<li>\n<p>ALB resource properly removes ALB when disabled.</p>\n</li>\n<li>\n<p>ASG resource is properly disabled.</p>\n</li>\n</ul>\n<h2>3.5.4 (2020-01-21)</h2>\n<h3>Added</h3>\n<ul>\n<li>CloudFrontCacheBehaviours have min_ttl and max_ttl field support.</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>CodeCommit repositories policy refactor to work around maximum 10 policy per IAM User limit.</li>\n</ul>\n<h2>3.5.3 (2020-01-16)</h2>\n<h3>Added</h3>\n<ul>\n<li>Warn if generated CloudFormation template reaches 80% or greater of the maximum stack size of 51,200 bytes.</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>AWS Backup was missing group name in templates. Now creates a stack for every BackupVault.</li>\n</ul>\n<h2>3.5.2 (2020-01-08)</h2>\n<h3>Fixed</h3>\n<ul>\n<li>\n<p><code>paco init project</code> creates the <code>.gitignore</code> after cookiecutter runs. This avoids having a | character\nin the filename, which certain filsystems do not like.</p>\n</li>\n<li>\n<p>Fixed bug where resource/s3.yaml buckets were being run twice on validate and provision.</p>\n</li>\n</ul>\n<h2>3.5.1 (2020-01-06)</h2>\n<h3>Fixed</h3>\n<ul>\n<li>Fix starter projects: check for aws_second_region in <code>paco init project</code>.</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>Starter Projects paco-project-version brought up to 6.3.</li>\n</ul>\n<h2>3.5.0 (2020-01-03)</h2>\n<h3>Added</h3>\n<ul>\n<li>\n<p>Route 53 Health Checks support ip_address field.</p>\n</li>\n<li>\n<p>Duplicate key errors in the YAML have a proper error message.</p>\n</li>\n<li>\n<p>Docs have multi-account set-up page.</p>\n</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>\n<p>NetworkEnvironment networks can now be (almost) empty. This can be used for serverless environments\nthat do not need a network. The <code>network:</code> configuration still needs to exist, but only has to contain\nthe <code>aws_account</code> and <code>enabled</code> fields.</p>\n</li>\n<li>\n<p>Removed Parameter.ending format for cfn-init parameters and Dashboard variables.\nInstead simply including the ending in the paco.ref</p>\n</li>\n<li>\n<p>cfn-init launch bundle sends cfn-signal after cfn-init finishes.</p>\n</li>\n<li>\n<p><code>paco provision account</code> provisions the accounts.</p>\n</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>\n<p>If entire VPC is disabled for an ASG, the disabled ASG is removed.</p>\n</li>\n<li>\n<p>DeploymentPipeline can be enabled/disabled without throwing errors.</p>\n</li>\n<li>\n<p>Throw error if an account is missing an account_id.</p>\n</li>\n<li>\n<p>Throw error if .credentials file is missing before asking for MFA.</p>\n</li>\n<li>\n<p>cfn-init uses proper base path for Amazon Linux which has cfn-init pre-installed in /opt/aws.</p>\n</li>\n<li>\n<p>log group expire_events_after_days can be left blank for log_set and log_group without throwing error.</p>\n</li>\n<li>\n<p>Route 53 Record Set stack for an ALB is provisioned in the same account that Route53 is in.</p>\n</li>\n<li>\n<p>DeploymentPipeline no longer hard-codes to a 'data' account for CodeCommit principle,\nand instead uses the actual account(s) that CodeCommit repo's use.</p>\n</li>\n<li>\n<p>Alarm notifications that do not come from plug-in work again.</p>\n</li>\n<li>\n<p>Clean-up for wordpress-single-tier starting template.</p>\n</li>\n<li>\n<p>Create ~/.aws/cli/cache directory if it doesn't already exist.</p>\n</li>\n<li>\n<p>LogAlarms were incorrectly getting a Resource Dimension added to them.</p>\n</li>\n</ul>\n<h2>3.4.1 (2019-12-04)</h2>\n<h3>Fixed</h3>\n<ul>\n<li>Include paco.cookiecutters data files in paco-cloud distribution.</li>\n</ul>\n<h2>3.4.0 (2019-12-03)</h2>\n<h3>Added</h3>\n<ul>\n<li>\n<p>New CloudWatch Dashboard resource.</p>\n</li>\n<li>\n<p>Route53 Health Check supports domain_name or load_balancer fields.</p>\n</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>\n<p>include paco.stack_grps package!</p>\n</li>\n<li>\n<p>Route53 Health Check alarm gets Namespace again.</p>\n</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>Final AIM --&gt; Paco rename: Log metric namespace changed from <code>AIM/</code> to <code>Paco/</code></li>\n</ul>\n<h2>3.3.1 (2019-11-29)</h2>\n<h3>Fixed</h3>\n<ul>\n<li>\n<p>Placeholder in the wordpress-single-tier template for AMI Id.</p>\n</li>\n<li>\n<p>Assorted fixes created by the AIM to paco rename.</p>\n</li>\n<li>\n<p>ALB AWS::ElasticLoadBalancingV2::ListenerCertificate are restored.</p>\n</li>\n<li>\n<p>Fixed Zone reference lookups in Route53 stack group.</p>\n</li>\n</ul>\n<h3>Docs</h3>\n<ul>\n<li>Overview page works on mobile.</li>\n</ul>\n<h2>3.3.0 (2019-11-28)</h2>\n<h3>Changed</h3>\n<ul>\n<li>\n<p>Changed dependency from <code>aim.models</code> to <code>paco.models</code></p>\n</li>\n<li>\n<p>Renamed all things <code>aim</code> to <code>paco</code>.</p>\n</li>\n</ul>\n<h2>3.2.0 (2019-11-27)</h2>\n<ul>\n<li>\n<p>AIM has been renamed to Paco: Prescribed automation for cloud orchestration.\nThe CLI is now <code>paco</code> with a PACO_HOME environment variables. The\nPyPI package is at <code>paco-cloud</code>.</p>\n</li>\n<li>\n<p>AWS Backup service is supported by paco. Create BackupVaults with BackupPlans and BackupSelections.</p>\n</li>\n</ul>\n<h2>3.1.0 (2019-11-06)</h2>\n<h3>Added</h3>\n<ul>\n<li>\n<p>DBParameterGroups template.</p>\n</li>\n<li>\n<p>LogGroups template adds MetricFilters if present.</p>\n</li>\n<li>\n<p>Respect the <code>global_role_names</code> field for the IAM Role RoleName.</p>\n</li>\n<li>\n<p>Alarms can be provisioned at the Application level without being specific to a Resoure context.</p>\n</li>\n<li>\n<p>Route53HealthChecks can be provisioned. These are global resources with the application region\nsuffixed to the health check name. The CloudFormation template and CLoudWatch Alarm are provisioned\nin us-east-1, as that is where the metrics are hard-coded to by AWS.</p>\n</li>\n<li>\n<p>Lambda template will grant Lambda permissions to an Events Rule in the same application that\nreferences it as a Target.</p>\n</li>\n<li>\n<p>New Events Rule template.</p>\n</li>\n<li>\n<p>Added change_protected support to Cloudfront, IAM Managed Policies, and IAM Role templates.</p>\n</li>\n<li>\n<p>Added a CodeBuild IAM Permission for IAM Users</p>\n</li>\n<li>\n<p>Added the EIP Application Resource and a support 'eip' field to the ASG resource for associating an EIP with a single instance ASG.</p>\n</li>\n<li>\n<p>Added <code>cftemplate_iam_user_delegates_2019_10_02</code> legacy flag to make user delegate role stack names consistent with others.</p>\n</li>\n<li>\n<p>Added support to allow ASG to launch into a single subnet.</p>\n</li>\n<li>\n<p>Added ResourceGroupid to the ElastiCache Application Resource</p>\n</li>\n<li>\n<p>Added caching to instance AMI ID function.ref lookups.</p>\n</li>\n<li>\n<p>Added swap, wget installer, and get tag value helper functions to the EC2 Launch manager and moved all of its scripts to a separate file that is copied from S3 and executed.</p>\n</li>\n<li>\n<p>Added VPC Associations to the VPC private hosted zone.</p>\n</li>\n<li>\n<p>Added VpcConfig to the Lambda function cftemplate.</p>\n</li>\n<li>\n<p>Added <code>secrets_manager</code> to Network Environments.</p>\n</li>\n<li>\n<p>Added support for !Ref and !Sub to yaml.py</p>\n</li>\n<li>\n<p>Added a 'Nested StackGroup' feature to StackGroups. This allows us to nest a StackGroup in the place of a Stack within a StackGroup. This was needed to allow Route53 RecordSets to be created in order, but to allow a different Stack name from the current StackGroup being populated.</p>\n</li>\n<li>\n<p>Added the Route53RecordSet CFTemplate and ctl_route53.add_record_set() method.</p>\n</li>\n<li>\n<p>Added the EBS Application Resources.\nAdded <code>ebs_volume_mounts</code> to IASG to mount volumes to single instance groups.\nAdded the EBS Launch Bundle to implement <code>ebs_volume_mounts</code></p>\n</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>\n<p>Fixed bug where if a AssumeRolePolicyDocument has both <code>service</code> and <code>aws</code> fields for the Principal,\nthe <code>aws</code> field was ignored.</p>\n</li>\n<li>\n<p>Improvements to the CLI. Verbose flag is now respected.\nYes/no questions are consistent and can be answered with 'y', 'n', 'yes' or 'no'.\nClean-up to formatting. Only prompt for provision changes when running the provision\nsub-command.</p>\n</li>\n<li>\n<p>ALB Alarms now provision with an <code>LBApplication</code> suffix and match the Resoruce.type field.</p>\n</li>\n<li>\n<p>Made IAM Users default password more complex to satisfy password contraints.</p>\n</li>\n<li>\n<p>Updated some of the cookiecutter templates for <code>aim init project</code>.</p>\n</li>\n<li>\n<p>Ported the Route53 CFTemplate to troposphere and separated zones into their own stacks.\nAdded the legacy flag <code>route53_hosted_zone_2019_10_12</code> for this change.</p>\n</li>\n<li>\n<p>Cleaned up expired token handling in Stack() by consolidating duplicate code into a single method.</p>\n</li>\n<li>\n<p>Refactor of EC2 Launch Manager user data script management. Common functions are now stored in S3 to reduce user data size.</p>\n</li>\n<li>\n<p>Modifed LogGroup names to include the Network Environment name.</p>\n</li>\n<li>\n<p>Refactored how Route53 RecordSets are being created. The previous design created RecordSets right in the resource's template. The new design uses the Route53 Controller to create RecordSets in their own stack using an account global name . The reason is that CloudFormation does not allow you to modify RecordSets unless you are modifying the stack that created it. This made it impossible to move DNS between resources without first deleting the record and recreating it. With a global controller, we can simple rewrite the RecordSets to new values.\nAdded <code>route53_record_set_2019_10_16</code> legacy flag to deal with pre-existing RecordSets</p>\n</li>\n<li>\n<p>Moved app_engine.get_stack_from_ref to StackGroup</p>\n</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>\n<p>Fixed a couple of AWS token expiry retries from failing.</p>\n</li>\n<li>\n<p>AWS session caching was not properly caching.</p>\n</li>\n<li>\n<p>NotificationGroups controller was not setting up refs correctly, nor resolving them correctly.</p>\n</li>\n</ul>\n<h2>3.0.0 (2019-09-27)</h2>\n<h3>Added</h3>\n<ul>\n<li>\n<p>New directory <code>aimdata</code> is created within an AIM Project by paco. This is used to record state\nof AIM provisioning. CloudFormation templates used to create stacks in AWS are cached as well\nas the last copy of the AIM Project YAML files. These files are used to speed up subsequent\nruns and more importantly can show you what is changed between AIM runs to make it easier to\nreview new changes before they are actaully made to AWS.</p>\n</li>\n<li>\n<p>CLI: Display a diff of changes from last AIM run and new run in the AIM Project YAML configuration.\nThe <code>-d</code>, <code>--disable-validation</code> flag can be used to</p>\n</li>\n<li>\n<p>CLI: Display changes and ask for verification before updating CF templates. This can be disabled\nwith the <code>-y</code> flag.</p>\n</li>\n<li>\n<p>CLI: Offer to delete a stack in a CREATE FAILED state so that a new stack can be provisioned in it's place.</p>\n</li>\n<li>\n<p>AWS credentials can now be set to live for up to 12 hours. You can set the .credentials field to\n<code>mfa_session_expiry_secs: 43200 # 12 hours</code> to enable this. The default is still one hour.</p>\n</li>\n<li>\n<p>Resources with the <code>change_protected</code> flag set to true will not have their CloudFormation stacks\nupdated.</p>\n</li>\n<li>\n<p>API Gateway REST API can now have models, methods and stages. It supports Lambda integration\nwith either 'AWS_PROXY' via an assumed Role or 'AWS' via a Lambda Permission.</p>\n</li>\n<li>\n<p>S3Bucket has NotificationConfiguration for Lambdas. Lambda will detect if an S3Bucket within the\nsame application notifies the lambda and will automatically add a Lambda permission to allow S3 to\ninvoke the lambda.</p>\n</li>\n<li>\n<p>Lambda AWS::SNS::Subscription resources now have a Region property.</p>\n</li>\n<li>\n<p>CloudWatchAlarms template has a <code>notification_region</code> class attribute that can be set if\nnotificationgroup subscriptions need to go to a single region.</p>\n</li>\n<li>\n<p>CloudFront has Origin ID support.</p>\n</li>\n<li>\n<p>EFS Resource support.</p>\n</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>\n<p>Breaking! CF Template names have been refactored so that they are more user friendly when listed in the\nAWS Console. This requires deletion and reprovisioning of AWS resources. Templates now have new\nconsistent ways to create their names, so this should be the last time this change happens.</p>\n</li>\n<li>\n<p>CLI: References to NetworkEnvironments now use consistent <code>paco.ref</code> syntax, e.g.\n<code>aim provision netenv &lt;ne&gt;.&lt;env&gt;.&lt;region&gt;</code></p>\n</li>\n<li>\n<p>All stacks are created with Termination Protection set.</p>\n</li>\n<li>\n<p>CF template base class <code>paco.cftemplates.cftemplates.CFTemplate</code> has new methods for creating consistent\nAWS names: <code>create_resource_name()</code>, <code>create_resoruce_name_join()</code>, <code>create_cfn_logical_id()</code>,\nand <code>create_cfn_logical_id_join()</code>.</p>\n</li>\n<li>\n<p>Console messages reworked to show relevant information in columns.</p>\n</li>\n<li>\n<p>CF template base class method <code>gen_parameter</code> renamed to <code>create_cfn_parameter</code>.</p>\n</li>\n<li>\n<p>S3 controller now relies on the bucket name to come from the S3Bucket model object.</p>\n</li>\n<li>\n<p>Lambda code.s3_bucket field can now be an paco.ref or a plain bucket name.</p>\n</li>\n<li>\n<p>You can provision without specifying the region and it will include all regions in an env.</p>\n</li>\n<li>\n<p>NotificationGroups are loaded from project['resource']['notificationgroups']</p>\n</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>\n<p>CloudTrail generates it's own CloudWatch LogGroup if needed. Outputs for CloudTrail and CloudWatch LogGroup.</p>\n</li>\n<li>\n<p>APIGateway, SNSTopics and Lambda now respect the <code>enabled</code> field.</p>\n</li>\n</ul>\n<h2>2.0.0 (2019-08-26)</h2>\n<h3>Fixed</h3>\n<ul>\n<li>\n<p>snstopic output ref and lambda alarm ref fixes.</p>\n</li>\n<li>\n<p>Added IAM Users feature for creating IAM Users and configuring console access\nassigning permissions, and access keys.</p>\n</li>\n</ul>\n<h3>Added</h3>\n<ul>\n<li>\n<p>Moved aim reference generation into the Model. Model objects now have .paco_ref and\n.paco_ref_parts properties which contain their paco.ref reference.</p>\n</li>\n<li>\n<p>Added StackOutputsManger(). This now creates and maintains $AIM_HOME/ResourceMap.yaml\nwhich will include a complete list of all stack outputs that are referenced using the\nyaml dictionary path of the resource.</p>\n</li>\n<li>\n<p>ALB Outputs includes TargetGroup Fullname.</p>\n</li>\n<li>\n<p>Minimal APIGatewayRestApi template.</p>\n</li>\n<li>\n<p>Added external_resource support to the ACM</p>\n</li>\n<li>\n<p>Added ReadOnly support to the Administrator IAMUserPermission</p>\n</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>\n<p>Automated CloudFront Parameter lists for things like security group and target arn lists.</p>\n</li>\n<li>\n<p>Consolidated CFTemplates and Stack's and other Stack cleanups.</p>\n</li>\n<li>\n<p>CloudWatch Alarms multi-Dimension Alarms now expect an paco.ref. CloudWatch Alarms are now Troposphere.</p>\n</li>\n</ul>\n<h2>1.4.0 (2019-08-21)</h2>\n<h3>Added</h3>\n<ul>\n<li>\n<p>CloudTrail resource adds basic CloudTrail provisioning.</p>\n</li>\n<li>\n<p>LogGroups are created for all groups that the CloudWatch Agent will require.\nUses the new Logging schema in paco.models.</p>\n</li>\n<li>\n<p>Added CloudFront application Resource</p>\n</li>\n<li>\n<p>Added VPC Peering application resource.</p>\n</li>\n<li>\n<p>Automated the glue of passing outputs from a stack to the parameter of another stack.</p>\n</li>\n</ul>\n<h2>1.3.1 (2019-08-07)</h2>\n<h3>Fixed</h3>\n<ul>\n<li>Python packaging, also include version.txt.</li>\n</ul>\n<h2>1.3.0 (2019-08-07)</h2>\n<h3>Changed</h3>\n<ul>\n<li>CloudWatchAlarms now check for namespace and dimesions fields, that\ncan be used to override the default of one primary dimension and the resource_name.</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>Python dist did not include README.md and CHANGELOG.md</li>\n</ul>\n<h2>1.2.0 (2019-08-06)</h2>\n<h3>Added</h3>\n<ul>\n<li>\n<p>Deleting resources can leave dangling CloudFormation templates in your\naccount. Controllers for NetworkEnvironments now keep track of templates\nthey've provisioned and warn you about unused templates.</p>\n</li>\n<li>\n<p>NotificationGroups can be provisioned as SNS Topics and subscriptions.\nUse <code>aim provision notificationgroups</code>.</p>\n</li>\n<li>\n<p>CloudWatch Alarm descriptions are JSON with metadata about the environment,\nregion, application, resource group and resource that the alarm is for.</p>\n</li>\n<li>\n<p>CloudWatch Alarms will not notify the SNS Topics that they are subscribed to.</p>\n</li>\n<li>\n<p>Rewrote commands with consistent way of passing arguments to controllers.\nControllers args can now be all lower case.</p>\n</li>\n<li>\n<p>Added Account initialization to 'aim init project'.</p>\n</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>\n<p>AIM references have a new format! It's simpler and more consistent.\nEvery ref now starts with <code>paco.ref</code>.</p>\n</li>\n<li>\n<p>Created <code>paco.utils</code> to clean up PacoContext object.</p>\n</li>\n</ul>\n<h2>1.1.0 (2019-07-24)</h2>\n<h3>Added</h3>\n<ul>\n<li>\n<p>Logging functionality added to monitoring. Logs will be ingested by a configured\nCloudWatch Agent and sent to a CloudWatch Log Group.</p>\n</li>\n<li>\n<p>Added --nocache to cli to force updates to stacks.</p>\n</li>\n<li>\n<p>CLI reports human readable validation errors from AIM project configuration files</p>\n</li>\n<li>\n<p>\"aim ftest\" command added to run functional tests on the \"aim init project\"\ntemplates. This command will be expanded in the future so you can test your\nown aim projects.</p>\n</li>\n<li>\n<p>Resources/S3.yaml is now functional: eg. aim validate S3</p>\n</li>\n<li>\n<p>Added Region to cftemplates so we can do inline replace of &lt;account&gt; and &lt;region&gt;.</p>\n</li>\n<li>\n<p>Added LambdaPermission and CWEventRule cftemplates.</p>\n</li>\n<li>\n<p>Added CloudWatchController and LambdaController.</p>\n</li>\n</ul>\n<h3>Fixed</h3>\n<ul>\n<li>cookiecutter generated .credentials file was not in git repo as, the cookiecutter\n.gitignore file was causing it to be ignored.</li>\n</ul>\n<h2>1.0.0 (2019-07-06)</h2>\n<h3>Added</h3>\n<ul>\n<li>\n<p>Initial documentation with AIM project site at <a href=\"https://paco.waterbear.cloud/en/latest/\" rel=\"nofollow\">https://paco.waterbear.cloud/en/latest/</a></p>\n</li>\n<li>\n<p>Added init command with ability to create starting templates for AIM projects\nwith the cookiecutter project under the hood.</p>\n</li>\n<li>\n<p>Added redirect to Listner rules in the ALB</p>\n</li>\n</ul>\n<h3>Changed</h3>\n<ul>\n<li>\n<p>Document and refactor AIM CLI.</p>\n</li>\n<li>\n<p>Moved yaml.py to paco.core</p>\n</li>\n<li>\n<p>Refactored S3 Controller</p>\n</li>\n<li>\n<p>Ported Route53 config to the model</p>\n</li>\n<li>\n<p>Ported CodeCommit config to the model</p>\n</li>\n<li>\n<p>Refactored S3 to use Application StackGroup</p>\n</li>\n<li>\n<p>CPBD artifacts s3 bucket now uses S3 Resource in NetEnv yaml instead</p>\n</li>\n<li>\n<p>Converted the ALB's listener and listener rules to dicts from lists</p>\n</li>\n</ul>\n<h3>Removed</h3>\n<ul>\n<li>Removed deprecated configuration</li>\n</ul>\n<h2>0.6.0 (2019-06-21)</h2>\n<ul>\n<li>\n<p>Document and clean-up AIM CLI</p>\n</li>\n<li>\n<p>Validate and Provision functioning after cleanup</p>\n</li>\n</ul>\n<h2>0.5.0 (2019-06-21)</h2>\n<ul>\n<li>First open source release</li>\n</ul>\n\n          </div>"}, "last_serial": 6949729, "releases": {"3.2.0": [{"comment_text": "", "digests": {"md5": "a2d0fdc74fb117304ad852579f2afed8", "sha256": "a8db18b0aaf0d910806f7bd4f78e5abc882bbac312eae41b2e009c91ef1481d5"}, "downloads": -1, "filename": "paco-cloud-3.2.0.tar.gz", "has_sig": false, "md5_digest": "a2d0fdc74fb117304ad852579f2afed8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 166207, "upload_time": "2019-11-27T21:59:42", "upload_time_iso_8601": "2019-11-27T21:59:42.801219Z", "url": "https://files.pythonhosted.org/packages/49/d4/f25c506106230656e679d168347af495ddb744bbc592c2da50f964f0d137/paco-cloud-3.2.0.tar.gz", "yanked": false}], "3.3.0": [{"comment_text": "", "digests": {"md5": "4380aa5f0773a7b871aa84698719666b", "sha256": "72ef9eddb35cab1a4b011f137ee983da72f121b9ec5c7f717423642b2670d3dd"}, "downloads": -1, "filename": "paco-cloud-3.3.0.tar.gz", "has_sig": false, "md5_digest": "4380aa5f0773a7b871aa84698719666b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 152820, "upload_time": "2019-11-28T10:42:19", "upload_time_iso_8601": "2019-11-28T10:42:19.935449Z", "url": "https://files.pythonhosted.org/packages/ae/e1/077dc18fd206658790f32ec9b7b90bb5d506b0a9edc254edd2a447c350b5/paco-cloud-3.3.0.tar.gz", "yanked": false}], "3.3.1": [{"comment_text": "", "digests": {"md5": "60553273e08083a8549f369f146a8925", "sha256": "4bdb0176c1faee23aad19fb5b629c2adec0393520ebc4a06036a45a11bd2eb5f"}, "downloads": -1, "filename": "paco-cloud-3.3.1.tar.gz", "has_sig": false, "md5_digest": "60553273e08083a8549f369f146a8925", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 166298, "upload_time": "2019-11-29T17:19:36", "upload_time_iso_8601": "2019-11-29T17:19:36.547216Z", "url": "https://files.pythonhosted.org/packages/4a/c6/0dad0ecf23e6893e1e738604dcca12d609d27be8521d5ee3a8557178af48/paco-cloud-3.3.1.tar.gz", "yanked": false}], "3.4.0": [{"comment_text": "", "digests": {"md5": "16f9dc97541aab5c6cfbd67e0c65506a", "sha256": "9d772b1d5405e5c0377c12a8809f1a1a9e27d255e70a39b7d7a02f6d12586a04"}, "downloads": -1, "filename": "paco-cloud-3.4.0.tar.gz", "has_sig": false, "md5_digest": "16f9dc97541aab5c6cfbd67e0c65506a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 168626, "upload_time": "2019-12-03T19:52:00", "upload_time_iso_8601": "2019-12-03T19:52:00.390831Z", "url": "https://files.pythonhosted.org/packages/82/c0/62dbf62b51cc8571bb91b2de45860109f24789357c7b37037bae04af1b9c/paco-cloud-3.4.0.tar.gz", "yanked": false}], "3.4.1": [{"comment_text": "", "digests": {"md5": "7344f90bbfbbe065e2473a45125a3c5e", "sha256": "c6a73bc5628d9f73eb80b90960ac17c1107387f332d9f428cbc74cf1f18a9d46"}, "downloads": -1, "filename": "paco-cloud-3.4.1.tar.gz", "has_sig": false, "md5_digest": "7344f90bbfbbe065e2473a45125a3c5e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 168714, "upload_time": "2019-12-04T08:01:29", "upload_time_iso_8601": "2019-12-04T08:01:29.720819Z", "url": "https://files.pythonhosted.org/packages/ad/7e/dedc3f67c7af7d5cad0ff14033c0987a7863b811c4f8b371753f4e4e0476/paco-cloud-3.4.1.tar.gz", "yanked": false}], "3.5.0": [{"comment_text": "", "digests": {"md5": "01d14891d5d28f7d80e5eb28077d5d5c", "sha256": "257c0bda63d8bd66d4c7eb3dda743394550f00831519c9245cdc30d760936166"}, "downloads": -1, "filename": "paco-cloud-3.5.0.tar.gz", "has_sig": false, "md5_digest": "01d14891d5d28f7d80e5eb28077d5d5c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 184728, "upload_time": "2020-01-03T10:05:25", "upload_time_iso_8601": "2020-01-03T10:05:25.668884Z", "url": "https://files.pythonhosted.org/packages/84/50/a1d633c688c8aff98f8bf4c0f04f030ec876b9d87a6ed2b11f4b4e94b84d/paco-cloud-3.5.0.tar.gz", "yanked": false}], "3.5.1": [{"comment_text": "", "digests": {"md5": "cecd61b4277c14583427d6ccd45dd2bd", "sha256": "b500083e72dd9122ec61859f0a0239889e9c25c7bf83ab8a8619a0dfe0bdb7df"}, "downloads": -1, "filename": "paco-cloud-3.5.1.tar.gz", "has_sig": false, "md5_digest": "cecd61b4277c14583427d6ccd45dd2bd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 182968, "upload_time": "2020-01-06T19:32:57", "upload_time_iso_8601": "2020-01-06T19:32:57.228021Z", "url": "https://files.pythonhosted.org/packages/49/14/185df9b42feb0e110d12d7eb0e443d794d3bc5cefcf30945c16d5ab52116/paco-cloud-3.5.1.tar.gz", "yanked": false}], "3.5.2": [{"comment_text": "", "digests": {"md5": "6d4e66138d7a7d0db7fc7d8d73ea1260", "sha256": "16d3c0ead23c3cc8f00261ea6c766a0b2953fb2f431b6d503c8302ece5c84efe"}, "downloads": -1, "filename": "paco-cloud-3.5.2.tar.gz", "has_sig": false, "md5_digest": "6d4e66138d7a7d0db7fc7d8d73ea1260", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 183764, "upload_time": "2020-01-08T18:06:44", "upload_time_iso_8601": "2020-01-08T18:06:44.335864Z", "url": "https://files.pythonhosted.org/packages/84/80/3372965c05a57fb395c270e75de9f37f229ed954bfd3497fe676b87e4d94/paco-cloud-3.5.2.tar.gz", "yanked": false}], "3.5.3": [{"comment_text": "", "digests": {"md5": "87fe26f069f64c5de198c6bdfc171935", "sha256": "1c9048c43b34dc4349dd685c30a5fca79d2a305cd7d81cc34e49056e57f9128d"}, "downloads": -1, "filename": "paco-cloud-3.5.3.tar.gz", "has_sig": false, "md5_digest": "87fe26f069f64c5de198c6bdfc171935", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 185422, "upload_time": "2020-01-16T17:47:56", "upload_time_iso_8601": "2020-01-16T17:47:56.855555Z", "url": "https://files.pythonhosted.org/packages/ba/6e/ae71186809462791a8bb5b50f69c6331d574cf2fdec2cd48462cea8ccec9/paco-cloud-3.5.3.tar.gz", "yanked": false}], "3.5.4": [{"comment_text": "", "digests": {"md5": "568bb1a84788190530515fc54dad39db", "sha256": "1b46d3b934aee5fd0013073cd7772622e5aec7f7c37b61287ec43d9893995018"}, "downloads": -1, "filename": "paco-cloud-3.5.4.tar.gz", "has_sig": false, "md5_digest": "568bb1a84788190530515fc54dad39db", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 185743, "upload_time": "2020-01-21T08:24:35", "upload_time_iso_8601": "2020-01-21T08:24:35.282554Z", "url": "https://files.pythonhosted.org/packages/3f/99/9b5a9ad92b058abf370e90e2313ec7795ccff05a02fc72e416b13794e4af/paco-cloud-3.5.4.tar.gz", "yanked": false}], "3.5.5": [{"comment_text": "", "digests": {"md5": "dd9c845dfd76ee71c4c8fe70077347bc", "sha256": "ee07161afc01f8e102ea234dc8331b232ea7a72dc9c65426a927e79a1a1c0cc0"}, "downloads": -1, "filename": "paco-cloud-3.5.5.tar.gz", "has_sig": false, "md5_digest": "dd9c845dfd76ee71c4c8fe70077347bc", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 185849, "upload_time": "2020-01-29T15:17:26", "upload_time_iso_8601": "2020-01-29T15:17:26.181543Z", "url": "https://files.pythonhosted.org/packages/8a/a5/4367694eb7b29f1b7224ddd5687f984f041a4314a04743b0b908dca03847/paco-cloud-3.5.5.tar.gz", "yanked": false}], "4.0.0": [{"comment_text": "", "digests": {"md5": "64c3dc00eb853e489c2edca5e928570e", "sha256": "2ddb820f385f596b7697449fbb31ae1087afacd26e12a2a3d76033c7fc66c8d2"}, "downloads": -1, "filename": "paco-cloud-4.0.0.tar.gz", "has_sig": false, "md5_digest": "64c3dc00eb853e489c2edca5e928570e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 187538, "upload_time": "2020-02-05T12:22:35", "upload_time_iso_8601": "2020-02-05T12:22:35.774801Z", "url": "https://files.pythonhosted.org/packages/92/ae/89932d58347c1c751769997c103fe31f640c75d71e2fc9f64cc629b8da18/paco-cloud-4.0.0.tar.gz", "yanked": false}], "5.0.0": [{"comment_text": "", "digests": {"md5": "56610fa5d79549d3974a31a31294c1c3", "sha256": "fdc9d41a0ba4c601256e0531fabb37bd937a2abd511edc31f8055a9a4fb3f1a2"}, "downloads": -1, "filename": "paco-cloud-5.0.0.tar.gz", "has_sig": false, "md5_digest": "56610fa5d79549d3974a31a31294c1c3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 189915, "upload_time": "2020-02-17T14:01:07", "upload_time_iso_8601": "2020-02-17T14:01:07.743828Z", "url": "https://files.pythonhosted.org/packages/98/31/0abe9081e8c42440befeeb054c22e1dea73fc25d80e298b8b36b0aaee804/paco-cloud-5.0.0.tar.gz", "yanked": false}], "5.0.1": [{"comment_text": "", "digests": {"md5": "3a756ce2229db827ae066c46e88566c3", "sha256": "249b791e4c406060300152a84d21bfe14e6f7b092e8dd8aaa60937ecc55c2233"}, "downloads": -1, "filename": "paco-cloud-5.0.1.tar.gz", "has_sig": false, "md5_digest": "3a756ce2229db827ae066c46e88566c3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 190131, "upload_time": "2020-02-17T17:08:34", "upload_time_iso_8601": "2020-02-17T17:08:34.071953Z", "url": "https://files.pythonhosted.org/packages/22/b5/588bec12ca6b4110d2a422467aeccfacced696835981714ebc9ef27b3750/paco-cloud-5.0.1.tar.gz", "yanked": false}], "5.1.0": [{"comment_text": "", "digests": {"md5": "3f41f8e3e7d4c6696bd9ce25c676bc6e", "sha256": "d0c5651162d21e7d825f88421025f3251b241c02f29fdceb20789e4c004f9235"}, "downloads": -1, "filename": "paco-cloud-5.1.0.tar.gz", "has_sig": false, "md5_digest": "3f41f8e3e7d4c6696bd9ce25c676bc6e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 191770, "upload_time": "2020-02-19T15:13:05", "upload_time_iso_8601": "2020-02-19T15:13:05.008195Z", "url": "https://files.pythonhosted.org/packages/4d/83/6cff0105adc1c6344d0c042067f485c657faed3df9a989fd3f55dd942ef2/paco-cloud-5.1.0.tar.gz", "yanked": false}], "5.1.1": [{"comment_text": "", "digests": {"md5": "c86a46f48b543ab3f12e5a9848354a35", "sha256": "776ebff10e65ad450c19feb21c018c6e3087b5c828aad0542de9a7486c733f06"}, "downloads": -1, "filename": "paco-cloud-5.1.1.tar.gz", "has_sig": false, "md5_digest": "c86a46f48b543ab3f12e5a9848354a35", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 191832, "upload_time": "2020-02-19T19:10:06", "upload_time_iso_8601": "2020-02-19T19:10:06.791255Z", "url": "https://files.pythonhosted.org/packages/95/39/8c34bedc5302a549a06cd9178716fa51d36a4d7362fe794a569a701a9cd3/paco-cloud-5.1.1.tar.gz", "yanked": false}], "6.0.0": [{"comment_text": "", "digests": {"md5": "9a0d2fd67f01fef15adb319a3e53a370", "sha256": "d54b06bdc93baec410b877738b6cf13160ff0f9bec3d2b5b70709a935b7b8270"}, "downloads": -1, "filename": "paco-cloud-6.0.0.tar.gz", "has_sig": false, "md5_digest": "9a0d2fd67f01fef15adb319a3e53a370", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 192152, "upload_time": "2020-03-06T12:27:14", "upload_time_iso_8601": "2020-03-06T12:27:14.121829Z", "url": "https://files.pythonhosted.org/packages/6c/11/4b0e6591c07b67f8b9ef2050e892b9f97320c1b1c4f83e642d1a550d7406/paco-cloud-6.0.0.tar.gz", "yanked": false}], "6.0.1": [{"comment_text": "", "digests": {"md5": "3c3dcfc8726ff968b942c1916512e0c1", "sha256": "aaf8e8fe01298b9c9b7de87ddb255044239787e7d93149b6cfc1aa357dbe400e"}, "downloads": -1, "filename": "paco-cloud-6.0.1.tar.gz", "has_sig": false, "md5_digest": "3c3dcfc8726ff968b942c1916512e0c1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 196849, "upload_time": "2020-03-08T17:26:32", "upload_time_iso_8601": "2020-03-08T17:26:32.858210Z", "url": "https://files.pythonhosted.org/packages/c7/bc/ae2c5351a9a29fd6466df4286d4aca8a66f286c2c8392ed757a8a64e6246/paco-cloud-6.0.1.tar.gz", "yanked": false}], "6.1.0": [{"comment_text": "", "digests": {"md5": "23c6495d2c83348a87a2d004de1f3668", "sha256": "419460587a825b94d695958e6a87daedef0cc20c25f52b1ef876e42e9ab340e8"}, "downloads": -1, "filename": "paco-cloud-6.1.0.tar.gz", "has_sig": false, "md5_digest": "23c6495d2c83348a87a2d004de1f3668", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 197605, "upload_time": "2020-03-09T11:29:24", "upload_time_iso_8601": "2020-03-09T11:29:24.663308Z", "url": "https://files.pythonhosted.org/packages/56/ae/67cefc10040774ddb897d5c897088da8bdf5cb9265d22a531ca665990fc7/paco-cloud-6.1.0.tar.gz", "yanked": false}], "6.1.1": [{"comment_text": "", "digests": {"md5": "173e6adc717ad7b45badc73c6950a1d9", "sha256": "0bf3822bba8eb8da2f57c01b5d5fb6acebefdd99ed45fcff7c7f8ab98c1951f9"}, "downloads": -1, "filename": "paco-cloud-6.1.1.tar.gz", "has_sig": false, "md5_digest": "173e6adc717ad7b45badc73c6950a1d9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 199605, "upload_time": "2020-03-14T07:34:49", "upload_time_iso_8601": "2020-03-14T07:34:49.625196Z", "url": "https://files.pythonhosted.org/packages/69/69/fb9950b6c2783d6232e924a328cfa0725e63c33506ea55b5a315a33867b0/paco-cloud-6.1.1.tar.gz", "yanked": false}], "6.2.0": [{"comment_text": "", "digests": {"md5": "7a91cbc6ebcf3e8b21aa3c4b0b5d6ed3", "sha256": "df70f2af809a87aac96302f0ce658035bbbb04c14e38548ab055bab64af5fec1"}, "downloads": -1, "filename": "paco-cloud-6.2.0.tar.gz", "has_sig": false, "md5_digest": "7a91cbc6ebcf3e8b21aa3c4b0b5d6ed3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 207495, "upload_time": "2020-04-04T13:43:43", "upload_time_iso_8601": "2020-04-04T13:43:43.327913Z", "url": "https://files.pythonhosted.org/packages/a4/05/4ab5901559d041c4bb3a007e2743a48bb17931070baf22a5f0bd7a1c7d12/paco-cloud-6.2.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "7a91cbc6ebcf3e8b21aa3c4b0b5d6ed3", "sha256": "df70f2af809a87aac96302f0ce658035bbbb04c14e38548ab055bab64af5fec1"}, "downloads": -1, "filename": "paco-cloud-6.2.0.tar.gz", "has_sig": false, "md5_digest": "7a91cbc6ebcf3e8b21aa3c4b0b5d6ed3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 207495, "upload_time": "2020-04-04T13:43:43", "upload_time_iso_8601": "2020-04-04T13:43:43.327913Z", "url": "https://files.pythonhosted.org/packages/a4/05/4ab5901559d041c4bb3a007e2743a48bb17931070baf22a5f0bd7a1c7d12/paco-cloud-6.2.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:00:03 2020"}