{"info": {"author": "Microsoft Corporation", "author_email": "connectors@microsoft.com", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Console", "Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Natural Language :: English", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Topic :: Software Development :: Build Tools"], "description": "# Microsoft Power Platform Connectors CLI\n\n**NOTE**\n\n**These release notes describe functionality that may not have been released yet.** To see when this functionality is planned to release, please review [What's new and planned for Common Data Model and Data Integration](https://docs.microsoft.com/en-us/business-applications-release-notes/April19/cdm-data-integration/planned-features). Delivery timelines and projected functionality may change or may not ship (see [Microsoft policy](https://go.microsoft.com/fwlink/p/?linkid=2007332)).\n\n\nThe `paconn` command line tool is designed to aid Microsoft Power Platform custom connectors development.\n\n## Installing\n\n1. Install Python 3.5+ from https://www.python.org/downloads. Click the 'Download' link on any version of Python greater than Python 3.5. For Linux and Mac OS X please follow the appropriate link on the page. You can also install using an OS specific package manager of your choice.\n\n2. Run the installer to begin installation and be sure to check the box 'Add Python X.X to PATH'.\n\n3. Make sure the installation path is in the PATH variable by running:\n\n    `python --version`\n\n4. After python is installed, install `paconn` by running:\n\n    `pip install paconn`\n\n  If you get errors saying 'Access is denied', consider using the `--user` option or running the command as an Administrator (Windows).\n\n## Custom Connector Directory and Files\n\nA custom connector consists of three files: An Open API swagger definition, an API properties file, and an optional icon for the connector. The files are generally located in a directory with the connector ID as the name of the directory.\n\nSometimes, the custom connector directory may include a `settings.json` file. Although this file is not part of the connector definition, it can be used as an argument-store for the CLI.\n\n### API Definition (Swagger) File\n\nThe API definition, also known as the swagger, describes the API for the custom connector using the OpenAPI specification. More information about API definition to write custom connector can be found in [the connector documentation on the subject](https://docs.microsoft.com/en-us/connectors/custom-connectors/define-openapi-definition). Please also review the tutorial on [extending an OpenApi definition](https://docs.microsoft.com/en-us/connectors/custom-connectors/openapi-extensions).\n\n### API Properties File\n\nThe API properties file contains some properties for the custom connector. These properties are not part of the API definition. It contains information such as the brand color, authentication information, etc. A typical API properties file looks like the following:\n\n```json\n{\n  \"properties\": {\n    \"capabilities\": [],\n    \"connectionParameters\": {\n      \"api_key\": {\n        \"type\": \"securestring\",\n        \"uiDefinition\": {\n          \"constraints\": {\n            \"clearText\": false,\n            \"required\": \"true\",\n            \"tabIndex\": 2\n          },\n          \"description\": \"The KEY for this API\",\n          \"displayName\": \"KEY\",\n          \"tooltip\": \"Provide your KEY\"\n        }\n      }\n    },\n    \"iconBrandColor\": \"#007EE6\",\n    \"policyTemplateInstances\": [\n      {\n        \"title\": \"MyPolicy\",\n        \"templateId\": \"setqueryparameter\",\n        \"parameters\": {\n            \"x-ms-apimTemplateParameter.name\": \"queryParameterName\",\n            \"x-ms-apimTemplateParameter.value\": \"queryParameterValue\",\n            \"x-ms-apimTemplateParameter.existsAction\": \"override\"\n        }\n      }\n    ]    \n  }\n}\n```\n\nMore information on the each of the properties are given below:\n\n* `properties`: The container for the information.\n\n* `connectionParameters`: Defines the connection parameter for the service.\n\n* `iconBrandColor`: The icon brand color in HTML hex code for the custom connector.\n\n* `capabilities`: Describes the capabilities for the connector, e.g. cloud only, on-prem gateway etc.\n\n* `policyTemplateInstances`: An optional list of policy template instances and values used in the custom connector.\n\n### Icon File\n\nThe icon is icon image file for the custom connector.\n\n### Settings File\n\nInstead of providing the arguments in the command line, a `settings.json` file can be used to specify them. A typical `settings.json` file looks like the following: \n\n```json\n{\n  \"connectorId\": \"CONNECTOR-ID\",\n  \"environment\": \"ENVIRONMENT-GUID\",\n  \"apiProperties\": \"apiProperties.json\",\n  \"apiDefinition\": \"apiDefinition.swagger.json\",\n  \"icon\": \"icon.png\",\n  \"powerAppsApiVersion\": \"2016-11-01\",\n  \"powerAppsUrl\": \"https://api.powerapps.com\"\n}\n```\n\nIn the settings file the following items are expected. If an option is missing but required, the console will prompt for the missing information.\n\n* `connectorId`: The connector ID string for the custom connector. This parameter is required for download and update operations, but not for the create operation since a new custom connector with the new ID will be created. It's also not needed for the validate command. If you need to update a custom connector just created using the same settings file, please make sure the settings file is correctly updated with the new connector ID from the create operation.\n\n* `environment`: The environment ID string for the custom connector. This parameter is required for all operations, except the validate operation.\n\n* `apiProperties`: The path to the API properties file. It is required for the create and update operation. When this option is present during the download operation, the file will be downloaded to the given location, otherwise it will be saved as `apiProperties.json`.\n\n* `apiDefinition`: The path to the swagger file. It is required for the create, update, and validate operations. When this option is present during the download operation, the file in the given location will be written to, otherwise it will be saved as `apiDefinition.swagger.json`.\n\n* `icon`: The path to the optional icon file. The create and update operations will use the default icon when this parameter is no specified. When this option is present during the download operation, the file in the given location will be written to, otherwise it will be saved as `icon.png`.\n\n* `powerAppsUrl`: The API URL for PowerApps. This is optional and set to `https://api.powerapps.com` by default.\n\n* `powerAppsApiVersion`: The API version to use for PowerApps. This is optional and set to `2016-11-01` by default.\n\n\n## Command Line Operations\n\n### Login\n\nLogin to Power Platform by running:\n\n`paconn login`\n\nThis will ask you to login using device code login process. Please follow the prompt for the login.\n\n\n### Download Custom Connector Files\n\nThe connector files are always downloaded into a sub-directory with the connector ID as the directory name. When a destination directory is specified, the sub-directory will be created in the specified one. Otherwise, it will be created in the current directory. In addition to the three connector files, the download operation will also write a fourth file called settings.json containing the parameters used to download the files.\n\nDownload the custom connector files by running:\n\n`paconn download`\n\nor\n\n`paconn download -e [Power Platform Environment ID] -c [Connector ID]`\n\nor\n\n`paconn download -s [Path to settings.json]`\n\nWhen environment or connector ID is not specified the command will prompt for the missing argument(s). The command will print the download location for the connector on successful completion.\n\n```\nArguments\n   --cid -c      : The custom connector ID.\n   --dest -d     : Destination directory.\n   --env -e      : Power Platform environment ID.\n   --pau -u      : Power Platform URL.\n   --pav -v      : Power Platform API version.\n   --settings -s : A settings file containing required parameters.\n                   When a settings file is specified some command \n                   line parameters are ignored.\n```\n### Create a New Custom Connector\n\nA new custom connector can be created from the connectors files using the `create` operation. Create a connector by running:\n\n`paconn create --api-prop [Path to apiProperties.json] --api-def [Path to apiDefinition.swagger.json]`\n\nor\n\n`paconn create -e [Power Platform Environment ID] --api-prop [Path to apiProperties.json] --api-def [Path to apiDefinition.swagger.json] --icon [Path to icon.png] --secret [The OAuth2 client secret for the connector]`\n\nor\n\n`paconn create -s [Path to settings.json] --secret [The OAuth2 client secret for the connector]`\n\nWhen environment is not specified the command will prompt for it. However, the API definition and API properties file must be provided as part of the command line argument or a settings file. The OAuth2 secret must be provided for a connector using OAuth2. The command will print the connector ID for the newly created custom connector on successful completion. If you are using a settings file for the create command, please make sure to update it with the new connector ID before you update the newly created connector.\n\n```\nArguments\n   --api-def     : Location for the Open API definition JSON document.\n   --api-prop    : Location for the API properties JSON document.\n   --env -e      : Power Platform environment ID.\n   --icon        : Location for the icon file.\n   --pau -u      : Power Platform URL.\n   --pav -v      : Power Platform API version.\n   --secret -r   : The OAuth2 client secret for the connector.\n   --settings -s : A settings file containing required parameters.\n                   When a settings file is specified some command \n                   line parameters are ignored.\n```\n### Update an Existing Custom Connector\n\nLike the `create` operation, an existing custom connector can be updated using the `update` operation. Update a connector by running:\n\n`paconn update --api-prop [Path to apiProperties.json] --api-def [Path to apiDefinition.swagger.json]`\n\nor\n\n`paconn update -e [Power Platform Environment ID] -c [Connector ID] --api-prop [Path to apiProperties.json] --api-def [Path to apiDefinition.swagger.json] --icon [Path to icon.png] --secret [The OAuth2 client secret for the connector]`\n\nor\n\n`paconn update -s [Path to settings.json] --secret [The OAuth2 client secret for the connector]`\n\nWhen environment or connector ID is not specified the command will prompt for the missing argument(s). However, the API definition and API properties file must be provided as part of the command line argument or a settings file. The OAuth2 secret must be provided for a connector using OAuth2. The command will print the updated connector ID on successful completion. If you are using a settings file for the update command, please make sure correct environment and connector ID are specified.\n\n```\nArguments\n   --api-def     : Location for the Open API definition JSON document.\n   --api-prop    : Location for the API properties JSON document.\n   --cid -c      : The custom connector ID.\n   --env -e      : Power Platform environment ID.\n   --icon        : Location for the icon file.\n   --pau -u      : Power Platform URL.\n   --pav -v      : Power Platform API version.\n   --secret -r   : The OAuth2 client secret for the connector.\n   --settings -s : A settings file containing required parameters.\n                   When a settings file is specified some command \n                   line parameters are ignored.\n   ```\n\n### Validate a Swagger JSON\n\nThe validate operation takes a swagger file and verfies if it follows all the recommended rules. Validate a swagger file by running:\n\n`paconn validate --api-def [Path to apiDefinition.swagger.json]`\n\nor\n\n`paconn validate -s [Path to settings.json]`\n\nThe command will print the error, warning, or success message depending result of the validation.\n\n```\nArguments\n   --api-def     : Location for the Open API definition JSON document.\n   --pau -u      : Power Platform URL.\n   --pav -v      : Power Platform API version.\n   --settings -s : A settings file containing required parameters.\n                   When a settings file is specified some command \n                   line parameters are ignored.\n   ```\n\n\n### Best Practice\n\nDownload all of your connectors and use git or any other source code management system to save the files. In case of an incorrect update, redeploy the connector by rerunning the update command with the correct set of files from the source code management system.\n\nPlease test the custom connector and the settings file in a test environment before deploying in the production environment. Always double check that the environment and connector id are correct.\n\n## Limitations\n\nThe project is limited to creation, update, and download of custom connector in flow and powerapps environment. When an environment is not specified only the flow envrionments are displayed to choose from. For non-custom connector the swagger file is not returned.\n\n\n## Reporting issues and feedback\n\nIf you encounter any bugs with the tool please file an issue in the [Issues](https://github.com/Microsoft/PowerPlatformConnectors/issues) section of our GitHub repo.\n\nIf you believe you have found a security vulnerability that meets [Microsoft's definition of a security vulnerability](https://docs.microsoft.com/en-us/previous-versions/tn-archive/cc751383%28v=technet.10%29), please submit the [report to MSRC](https://msrc.microsoft.com/create-report). More information can be found at [MSRC frequently asked questions on reporting](https://www.microsoft.com/en-us/msrc/faqs-report-an-issue).\n\n\n## Contributing\n\nThis project welcomes contributions and suggestions.  Most contributions require you to agree to a\nContributor License Agreement (CLA) declaring that you have the right to, and actually do, grant us\nthe rights to use your contribution. For details, visit https://cla.microsoft.com.\n\nTo contibute a connector to the open source repo, please start by creating a fork on the github repo.\nOnce you have the fork created, create a new branch on the forked repo. Clone this forked repo on you \nlocal machine, and checkout the branch. Create a folder for your connector under the `connectors` folder\nand place the connector files in the sub-folder. Commit and push the changes to your forked branch.\nCreate a pull request from the forked branch to the main repo to merge your changes into the main repo.\n[Please see this document for more information](https://github.com/CoolProp/CoolProp/wiki/Contributing:-git-development-workflow).\n\nWhen you submit a pull request, a CLA-bot will automatically determine whether you need to provide\na CLA and decorate the PR appropriately (e.g., label, comment). Simply follow the instructions\nprovided by the bot. You will only need to do this once across all repos using our CLA.\n\nThis project has adopted the [Microsoft Open Source Code of Conduct](https://opensource.microsoft.com/codeofconduct/).\nFor more information see the [Code of Conduct FAQ](https://opensource.microsoft.com/codeofconduct/faq/) or\ncontact [opencode@microsoft.com](mailto:opencode@microsoft.com) with any additional questions or comments.\n\n## Legal Notices\n\nMicrosoft and any contributors grant you a license to the Microsoft documentation and other content\nin this repository under the [Creative Commons Attribution 4.0 International Public License](https://creativecommons.org/licenses/by/4.0/legalcode),\nsee the [LICENSE](LICENSE) file, and grant you a license to any code in the repository under the [MIT License](https://opensource.org/licenses/MIT), see the\n[LICENSE-CODE](LICENSE-CODE) file.\n\nMicrosoft, Windows, Microsoft Azure and/or other Microsoft products and services referenced in the documentation\nmay be either trademarks or registered trademarks of Microsoft in the United States and/or other countries.\nThe licenses for this project do not grant you rights to use any Microsoft names, logos, or trademarks.\nMicrosoft's general trademark guidelines can be found at http://go.microsoft.com/fwlink/?LinkID=254653.\n\nPrivacy information can be found at https://privacy.microsoft.com/en-us/\n\nMicrosoft and any contributors reserve all others rights, whether under their respective copyrights, patents,\nor trademarks, whether by implication, estoppel or otherwise.\n\n## License\n\n```\nMicrosoft Power Platform Connectors CLI (paconn)\n\nCopyright (c) Microsoft Corporation\nAll rights reserved.\n\nMIT License\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"\"Software\"\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED *AS IS*, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n```\n\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "", "keywords": "azure,powerapps,flow,power platform,connectors", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "paconn", "package_url": "https://pypi.org/project/paconn/", "platform": "", "project_url": "https://pypi.org/project/paconn/", "project_urls": null, "release_url": "https://pypi.org/project/paconn/0.0.13/", "requires_dist": ["docutils", "flake8", "future", "knack (~=0.5.1)", "pytest", "pytest-xdist", "virtualenv", "requests", "adal", "msrestazure", "azure-storage-blob (<12.0,>=2.1)", "pylint (~=1.9.2) ; python_version<'3.0'", "pylint (~=2.0.0) ; python_version>='3.0'"], "requires_python": ">=3.5,<4", "summary": "Microsoft Power Platform Connectors CLI", "version": "0.0.13", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Microsoft Power Platform Connectors CLI</h1>\n<p><strong>NOTE</strong></p>\n<p><strong>These release notes describe functionality that may not have been released yet.</strong> To see when this functionality is planned to release, please review <a href=\"https://docs.microsoft.com/en-us/business-applications-release-notes/April19/cdm-data-integration/planned-features\" rel=\"nofollow\">What's new and planned for Common Data Model and Data Integration</a>. Delivery timelines and projected functionality may change or may not ship (see <a href=\"https://go.microsoft.com/fwlink/p/?linkid=2007332\" rel=\"nofollow\">Microsoft policy</a>).</p>\n<p>The <code>paconn</code> command line tool is designed to aid Microsoft Power Platform custom connectors development.</p>\n<h2>Installing</h2>\n<ol>\n<li>\n<p>Install Python 3.5+ from <a href=\"https://www.python.org/downloads\" rel=\"nofollow\">https://www.python.org/downloads</a>. Click the 'Download' link on any version of Python greater than Python 3.5. For Linux and Mac OS X please follow the appropriate link on the page. You can also install using an OS specific package manager of your choice.</p>\n</li>\n<li>\n<p>Run the installer to begin installation and be sure to check the box 'Add Python X.X to PATH'.</p>\n</li>\n<li>\n<p>Make sure the installation path is in the PATH variable by running:</p>\n<p><code>python --version</code></p>\n</li>\n<li>\n<p>After python is installed, install <code>paconn</code> by running:</p>\n<p><code>pip install paconn</code></p>\n</li>\n</ol>\n<p>If you get errors saying 'Access is denied', consider using the <code>--user</code> option or running the command as an Administrator (Windows).</p>\n<h2>Custom Connector Directory and Files</h2>\n<p>A custom connector consists of three files: An Open API swagger definition, an API properties file, and an optional icon for the connector. The files are generally located in a directory with the connector ID as the name of the directory.</p>\n<p>Sometimes, the custom connector directory may include a <code>settings.json</code> file. Although this file is not part of the connector definition, it can be used as an argument-store for the CLI.</p>\n<h3>API Definition (Swagger) File</h3>\n<p>The API definition, also known as the swagger, describes the API for the custom connector using the OpenAPI specification. More information about API definition to write custom connector can be found in <a href=\"https://docs.microsoft.com/en-us/connectors/custom-connectors/define-openapi-definition\" rel=\"nofollow\">the connector documentation on the subject</a>. Please also review the tutorial on <a href=\"https://docs.microsoft.com/en-us/connectors/custom-connectors/openapi-extensions\" rel=\"nofollow\">extending an OpenApi definition</a>.</p>\n<h3>API Properties File</h3>\n<p>The API properties file contains some properties for the custom connector. These properties are not part of the API definition. It contains information such as the brand color, authentication information, etc. A typical API properties file looks like the following:</p>\n<pre><span class=\"p\">{</span>\n  <span class=\"nt\">\"properties\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">\"capabilities\"</span><span class=\"p\">:</span> <span class=\"p\">[],</span>\n    <span class=\"nt\">\"connectionParameters\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n      <span class=\"nt\">\"api_key\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n        <span class=\"nt\">\"type\"</span><span class=\"p\">:</span> <span class=\"s2\">\"securestring\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"uiDefinition\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n          <span class=\"nt\">\"constraints\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n            <span class=\"nt\">\"clearText\"</span><span class=\"p\">:</span> <span class=\"kc\">false</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"required\"</span><span class=\"p\">:</span> <span class=\"s2\">\"true\"</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"tabIndex\"</span><span class=\"p\">:</span> <span class=\"mi\">2</span>\n          <span class=\"p\">},</span>\n          <span class=\"nt\">\"description\"</span><span class=\"p\">:</span> <span class=\"s2\">\"The KEY for this API\"</span><span class=\"p\">,</span>\n          <span class=\"nt\">\"displayName\"</span><span class=\"p\">:</span> <span class=\"s2\">\"KEY\"</span><span class=\"p\">,</span>\n          <span class=\"nt\">\"tooltip\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Provide your KEY\"</span>\n        <span class=\"p\">}</span>\n      <span class=\"p\">}</span>\n    <span class=\"p\">},</span>\n    <span class=\"nt\">\"iconBrandColor\"</span><span class=\"p\">:</span> <span class=\"s2\">\"#007EE6\"</span><span class=\"p\">,</span>\n    <span class=\"nt\">\"policyTemplateInstances\"</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n      <span class=\"p\">{</span>\n        <span class=\"nt\">\"title\"</span><span class=\"p\">:</span> <span class=\"s2\">\"MyPolicy\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"templateId\"</span><span class=\"p\">:</span> <span class=\"s2\">\"setqueryparameter\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"parameters\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n            <span class=\"nt\">\"x-ms-apimTemplateParameter.name\"</span><span class=\"p\">:</span> <span class=\"s2\">\"queryParameterName\"</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"x-ms-apimTemplateParameter.value\"</span><span class=\"p\">:</span> <span class=\"s2\">\"queryParameterValue\"</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"x-ms-apimTemplateParameter.existsAction\"</span><span class=\"p\">:</span> <span class=\"s2\">\"override\"</span>\n        <span class=\"p\">}</span>\n      <span class=\"p\">}</span>\n    <span class=\"p\">]</span>    \n  <span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</pre>\n<p>More information on the each of the properties are given below:</p>\n<ul>\n<li>\n<p><code>properties</code>: The container for the information.</p>\n</li>\n<li>\n<p><code>connectionParameters</code>: Defines the connection parameter for the service.</p>\n</li>\n<li>\n<p><code>iconBrandColor</code>: The icon brand color in HTML hex code for the custom connector.</p>\n</li>\n<li>\n<p><code>capabilities</code>: Describes the capabilities for the connector, e.g. cloud only, on-prem gateway etc.</p>\n</li>\n<li>\n<p><code>policyTemplateInstances</code>: An optional list of policy template instances and values used in the custom connector.</p>\n</li>\n</ul>\n<h3>Icon File</h3>\n<p>The icon is icon image file for the custom connector.</p>\n<h3>Settings File</h3>\n<p>Instead of providing the arguments in the command line, a <code>settings.json</code> file can be used to specify them. A typical <code>settings.json</code> file looks like the following:</p>\n<pre><span class=\"p\">{</span>\n  <span class=\"nt\">\"connectorId\"</span><span class=\"p\">:</span> <span class=\"s2\">\"CONNECTOR-ID\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"environment\"</span><span class=\"p\">:</span> <span class=\"s2\">\"ENVIRONMENT-GUID\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"apiProperties\"</span><span class=\"p\">:</span> <span class=\"s2\">\"apiProperties.json\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"apiDefinition\"</span><span class=\"p\">:</span> <span class=\"s2\">\"apiDefinition.swagger.json\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"icon\"</span><span class=\"p\">:</span> <span class=\"s2\">\"icon.png\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"powerAppsApiVersion\"</span><span class=\"p\">:</span> <span class=\"s2\">\"2016-11-01\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"powerAppsUrl\"</span><span class=\"p\">:</span> <span class=\"s2\">\"https://api.powerapps.com\"</span>\n<span class=\"p\">}</span>\n</pre>\n<p>In the settings file the following items are expected. If an option is missing but required, the console will prompt for the missing information.</p>\n<ul>\n<li>\n<p><code>connectorId</code>: The connector ID string for the custom connector. This parameter is required for download and update operations, but not for the create operation since a new custom connector with the new ID will be created. It's also not needed for the validate command. If you need to update a custom connector just created using the same settings file, please make sure the settings file is correctly updated with the new connector ID from the create operation.</p>\n</li>\n<li>\n<p><code>environment</code>: The environment ID string for the custom connector. This parameter is required for all operations, except the validate operation.</p>\n</li>\n<li>\n<p><code>apiProperties</code>: The path to the API properties file. It is required for the create and update operation. When this option is present during the download operation, the file will be downloaded to the given location, otherwise it will be saved as <code>apiProperties.json</code>.</p>\n</li>\n<li>\n<p><code>apiDefinition</code>: The path to the swagger file. It is required for the create, update, and validate operations. When this option is present during the download operation, the file in the given location will be written to, otherwise it will be saved as <code>apiDefinition.swagger.json</code>.</p>\n</li>\n<li>\n<p><code>icon</code>: The path to the optional icon file. The create and update operations will use the default icon when this parameter is no specified. When this option is present during the download operation, the file in the given location will be written to, otherwise it will be saved as <code>icon.png</code>.</p>\n</li>\n<li>\n<p><code>powerAppsUrl</code>: The API URL for PowerApps. This is optional and set to <code>https://api.powerapps.com</code> by default.</p>\n</li>\n<li>\n<p><code>powerAppsApiVersion</code>: The API version to use for PowerApps. This is optional and set to <code>2016-11-01</code> by default.</p>\n</li>\n</ul>\n<h2>Command Line Operations</h2>\n<h3>Login</h3>\n<p>Login to Power Platform by running:</p>\n<p><code>paconn login</code></p>\n<p>This will ask you to login using device code login process. Please follow the prompt for the login.</p>\n<h3>Download Custom Connector Files</h3>\n<p>The connector files are always downloaded into a sub-directory with the connector ID as the directory name. When a destination directory is specified, the sub-directory will be created in the specified one. Otherwise, it will be created in the current directory. In addition to the three connector files, the download operation will also write a fourth file called settings.json containing the parameters used to download the files.</p>\n<p>Download the custom connector files by running:</p>\n<p><code>paconn download</code></p>\n<p>or</p>\n<p><code>paconn download -e [Power Platform Environment ID] -c [Connector ID]</code></p>\n<p>or</p>\n<p><code>paconn download -s [Path to settings.json]</code></p>\n<p>When environment or connector ID is not specified the command will prompt for the missing argument(s). The command will print the download location for the connector on successful completion.</p>\n<pre><code>Arguments\n   --cid -c      : The custom connector ID.\n   --dest -d     : Destination directory.\n   --env -e      : Power Platform environment ID.\n   --pau -u      : Power Platform URL.\n   --pav -v      : Power Platform API version.\n   --settings -s : A settings file containing required parameters.\n                   When a settings file is specified some command \n                   line parameters are ignored.\n</code></pre>\n<h3>Create a New Custom Connector</h3>\n<p>A new custom connector can be created from the connectors files using the <code>create</code> operation. Create a connector by running:</p>\n<p><code>paconn create --api-prop [Path to apiProperties.json] --api-def [Path to apiDefinition.swagger.json]</code></p>\n<p>or</p>\n<p><code>paconn create -e [Power Platform Environment ID] --api-prop [Path to apiProperties.json] --api-def [Path to apiDefinition.swagger.json] --icon [Path to icon.png] --secret [The OAuth2 client secret for the connector]</code></p>\n<p>or</p>\n<p><code>paconn create -s [Path to settings.json] --secret [The OAuth2 client secret for the connector]</code></p>\n<p>When environment is not specified the command will prompt for it. However, the API definition and API properties file must be provided as part of the command line argument or a settings file. The OAuth2 secret must be provided for a connector using OAuth2. The command will print the connector ID for the newly created custom connector on successful completion. If you are using a settings file for the create command, please make sure to update it with the new connector ID before you update the newly created connector.</p>\n<pre><code>Arguments\n   --api-def     : Location for the Open API definition JSON document.\n   --api-prop    : Location for the API properties JSON document.\n   --env -e      : Power Platform environment ID.\n   --icon        : Location for the icon file.\n   --pau -u      : Power Platform URL.\n   --pav -v      : Power Platform API version.\n   --secret -r   : The OAuth2 client secret for the connector.\n   --settings -s : A settings file containing required parameters.\n                   When a settings file is specified some command \n                   line parameters are ignored.\n</code></pre>\n<h3>Update an Existing Custom Connector</h3>\n<p>Like the <code>create</code> operation, an existing custom connector can be updated using the <code>update</code> operation. Update a connector by running:</p>\n<p><code>paconn update --api-prop [Path to apiProperties.json] --api-def [Path to apiDefinition.swagger.json]</code></p>\n<p>or</p>\n<p><code>paconn update -e [Power Platform Environment ID] -c [Connector ID] --api-prop [Path to apiProperties.json] --api-def [Path to apiDefinition.swagger.json] --icon [Path to icon.png] --secret [The OAuth2 client secret for the connector]</code></p>\n<p>or</p>\n<p><code>paconn update -s [Path to settings.json] --secret [The OAuth2 client secret for the connector]</code></p>\n<p>When environment or connector ID is not specified the command will prompt for the missing argument(s). However, the API definition and API properties file must be provided as part of the command line argument or a settings file. The OAuth2 secret must be provided for a connector using OAuth2. The command will print the updated connector ID on successful completion. If you are using a settings file for the update command, please make sure correct environment and connector ID are specified.</p>\n<pre><code>Arguments\n   --api-def     : Location for the Open API definition JSON document.\n   --api-prop    : Location for the API properties JSON document.\n   --cid -c      : The custom connector ID.\n   --env -e      : Power Platform environment ID.\n   --icon        : Location for the icon file.\n   --pau -u      : Power Platform URL.\n   --pav -v      : Power Platform API version.\n   --secret -r   : The OAuth2 client secret for the connector.\n   --settings -s : A settings file containing required parameters.\n                   When a settings file is specified some command \n                   line parameters are ignored.\n</code></pre>\n<h3>Validate a Swagger JSON</h3>\n<p>The validate operation takes a swagger file and verfies if it follows all the recommended rules. Validate a swagger file by running:</p>\n<p><code>paconn validate --api-def [Path to apiDefinition.swagger.json]</code></p>\n<p>or</p>\n<p><code>paconn validate -s [Path to settings.json]</code></p>\n<p>The command will print the error, warning, or success message depending result of the validation.</p>\n<pre><code>Arguments\n   --api-def     : Location for the Open API definition JSON document.\n   --pau -u      : Power Platform URL.\n   --pav -v      : Power Platform API version.\n   --settings -s : A settings file containing required parameters.\n                   When a settings file is specified some command \n                   line parameters are ignored.\n</code></pre>\n<h3>Best Practice</h3>\n<p>Download all of your connectors and use git or any other source code management system to save the files. In case of an incorrect update, redeploy the connector by rerunning the update command with the correct set of files from the source code management system.</p>\n<p>Please test the custom connector and the settings file in a test environment before deploying in the production environment. Always double check that the environment and connector id are correct.</p>\n<h2>Limitations</h2>\n<p>The project is limited to creation, update, and download of custom connector in flow and powerapps environment. When an environment is not specified only the flow envrionments are displayed to choose from. For non-custom connector the swagger file is not returned.</p>\n<h2>Reporting issues and feedback</h2>\n<p>If you encounter any bugs with the tool please file an issue in the <a href=\"https://github.com/Microsoft/PowerPlatformConnectors/issues\" rel=\"nofollow\">Issues</a> section of our GitHub repo.</p>\n<p>If you believe you have found a security vulnerability that meets <a href=\"https://docs.microsoft.com/en-us/previous-versions/tn-archive/cc751383%28v=technet.10%29\" rel=\"nofollow\">Microsoft's definition of a security vulnerability</a>, please submit the <a href=\"https://msrc.microsoft.com/create-report\" rel=\"nofollow\">report to MSRC</a>. More information can be found at <a href=\"https://www.microsoft.com/en-us/msrc/faqs-report-an-issue\" rel=\"nofollow\">MSRC frequently asked questions on reporting</a>.</p>\n<h2>Contributing</h2>\n<p>This project welcomes contributions and suggestions.  Most contributions require you to agree to a\nContributor License Agreement (CLA) declaring that you have the right to, and actually do, grant us\nthe rights to use your contribution. For details, visit <a href=\"https://cla.microsoft.com\" rel=\"nofollow\">https://cla.microsoft.com</a>.</p>\n<p>To contibute a connector to the open source repo, please start by creating a fork on the github repo.\nOnce you have the fork created, create a new branch on the forked repo. Clone this forked repo on you\nlocal machine, and checkout the branch. Create a folder for your connector under the <code>connectors</code> folder\nand place the connector files in the sub-folder. Commit and push the changes to your forked branch.\nCreate a pull request from the forked branch to the main repo to merge your changes into the main repo.\n<a href=\"https://github.com/CoolProp/CoolProp/wiki/Contributing:-git-development-workflow\" rel=\"nofollow\">Please see this document for more information</a>.</p>\n<p>When you submit a pull request, a CLA-bot will automatically determine whether you need to provide\na CLA and decorate the PR appropriately (e.g., label, comment). Simply follow the instructions\nprovided by the bot. You will only need to do this once across all repos using our CLA.</p>\n<p>This project has adopted the <a href=\"https://opensource.microsoft.com/codeofconduct/\" rel=\"nofollow\">Microsoft Open Source Code of Conduct</a>.\nFor more information see the <a href=\"https://opensource.microsoft.com/codeofconduct/faq/\" rel=\"nofollow\">Code of Conduct FAQ</a> or\ncontact <a href=\"mailto:opencode@microsoft.com\">opencode@microsoft.com</a> with any additional questions or comments.</p>\n<h2>Legal Notices</h2>\n<p>Microsoft and any contributors grant you a license to the Microsoft documentation and other content\nin this repository under the <a href=\"https://creativecommons.org/licenses/by/4.0/legalcode\" rel=\"nofollow\">Creative Commons Attribution 4.0 International Public License</a>,\nsee the <a href=\"LICENSE\" rel=\"nofollow\">LICENSE</a> file, and grant you a license to any code in the repository under the <a href=\"https://opensource.org/licenses/MIT\" rel=\"nofollow\">MIT License</a>, see the\n<a href=\"LICENSE-CODE\" rel=\"nofollow\">LICENSE-CODE</a> file.</p>\n<p>Microsoft, Windows, Microsoft Azure and/or other Microsoft products and services referenced in the documentation\nmay be either trademarks or registered trademarks of Microsoft in the United States and/or other countries.\nThe licenses for this project do not grant you rights to use any Microsoft names, logos, or trademarks.\nMicrosoft's general trademark guidelines can be found at <a href=\"http://go.microsoft.com/fwlink/?LinkID=254653\" rel=\"nofollow\">http://go.microsoft.com/fwlink/?LinkID=254653</a>.</p>\n<p>Privacy information can be found at <a href=\"https://privacy.microsoft.com/en-us/\" rel=\"nofollow\">https://privacy.microsoft.com/en-us/</a></p>\n<p>Microsoft and any contributors reserve all others rights, whether under their respective copyrights, patents,\nor trademarks, whether by implication, estoppel or otherwise.</p>\n<h2>License</h2>\n<pre><code>Microsoft Power Platform Connectors CLI (paconn)\n\nCopyright (c) Microsoft Corporation\nAll rights reserved.\n\nMIT License\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"\"Software\"\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED *AS IS*, WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n</code></pre>\n\n          </div>"}, "last_serial": 6708426, "releases": {"0.0.10": [{"comment_text": "", "digests": {"md5": "6df086eeb7631f714199062fc28dc1fd", "sha256": "5d8412a2a3d6ace524b8f9e65b9c8806cd5213f3d17878829d1188e37f9440f5"}, "downloads": -1, "filename": "paconn-0.0.10-py3-none-any.whl", "has_sig": false, "md5_digest": "6df086eeb7631f714199062fc28dc1fd", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5,<4", "size": 34765, "upload_time": "2019-05-08T21:20:46", "upload_time_iso_8601": "2019-05-08T21:20:46.832160Z", "url": "https://files.pythonhosted.org/packages/f2/d5/4529af52160e8e44ae228187b798aec540f96a877e17f85a3a3683cec007/paconn-0.0.10-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "cc3fe54043734a2c6a9fec4680cbcef5", "sha256": "b8e5de17c2c7a95862a6af7c7ea10481abbea58c5bb1e09fb4de6cbb0573483b"}, "downloads": -1, "filename": "paconn-0.0.10.tar.gz", "has_sig": false, "md5_digest": "cc3fe54043734a2c6a9fec4680cbcef5", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5,<4", "size": 25919, "upload_time": "2019-05-08T21:20:48", "upload_time_iso_8601": "2019-05-08T21:20:48.344709Z", "url": "https://files.pythonhosted.org/packages/0b/d4/cd27c6680cdd974152f0ef392c744046df36bf838e95086527466a72587e/paconn-0.0.10.tar.gz", "yanked": false}], "0.0.11": [{"comment_text": "", "digests": {"md5": "6ff40ef746b9541c97eebe61031c95fd", "sha256": "5fe36dd28c19f40351374bde82b9439facdcce3b1dc2ca33949df884d68d0556"}, "downloads": -1, "filename": "paconn-0.0.11-py3-none-any.whl", "has_sig": false, "md5_digest": "6ff40ef746b9541c97eebe61031c95fd", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5,<4", "size": 47215, "upload_time": "2019-09-24T19:20:55", "upload_time_iso_8601": "2019-09-24T19:20:55.591319Z", "url": "https://files.pythonhosted.org/packages/f2/54/c6c2866933b9f9c5759d8fe1a9ca4a2b83ca9cf3cc0673f426cf707fd802/paconn-0.0.11-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4816696e7d124d273afb38f62b86cc0c", "sha256": "905613521f4868265b1ce345566c92f923a04dfe4e89261c054e04b5d2bea2f8"}, "downloads": -1, "filename": "paconn-0.0.11.tar.gz", "has_sig": false, "md5_digest": "4816696e7d124d273afb38f62b86cc0c", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5,<4", "size": 28284, "upload_time": "2019-09-24T19:20:57", "upload_time_iso_8601": "2019-09-24T19:20:57.658780Z", "url": "https://files.pythonhosted.org/packages/d2/6a/9300c3283c2e363b7c31b862c7fca3b6b436ab9943dfc0f9d6084f243a0f/paconn-0.0.11.tar.gz", "yanked": false}], "0.0.12": [{"comment_text": "", "digests": {"md5": "c98af6efca7ca6779d8ad11a75ed2a72", "sha256": "07e0d64ce4307aa0a88037b869c5e22940603fc68b9dec53a6d471c3e920f49c"}, "downloads": -1, "filename": "paconn-0.0.12-py3-none-any.whl", "has_sig": false, "md5_digest": "c98af6efca7ca6779d8ad11a75ed2a72", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5,<4", "size": 46646, "upload_time": "2020-02-04T01:40:40", "upload_time_iso_8601": "2020-02-04T01:40:40.860327Z", "url": "https://files.pythonhosted.org/packages/e3/64/e60162a83021219c7ebc78558b8fac0566454e251fcc6aa69dc6fef2b593/paconn-0.0.12-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "eaf6adfe01fc6ab8141d197a3f393471", "sha256": "d554bf67ec2c3528d0a01cb99595014744367614cd2338a452116c99c5064a76"}, "downloads": -1, "filename": "paconn-0.0.12.tar.gz", "has_sig": false, "md5_digest": "eaf6adfe01fc6ab8141d197a3f393471", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5,<4", "size": 28482, "upload_time": "2020-02-04T01:40:42", "upload_time_iso_8601": "2020-02-04T01:40:42.310479Z", "url": "https://files.pythonhosted.org/packages/c9/e1/29b9386ad6b9905d22dbdab93ed4eb77fc145cdfc985c6e44fa9106e31e2/paconn-0.0.12.tar.gz", "yanked": false}], "0.0.13": [{"comment_text": "", "digests": {"md5": "0a0d226721ae5d6586604d255c398a1f", "sha256": "47c25528aab4cb007da507550667796db3087c160d9a402cc9278f7efcab731a"}, "downloads": -1, "filename": "paconn-0.0.13-py3-none-any.whl", "has_sig": false, "md5_digest": "0a0d226721ae5d6586604d255c398a1f", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5,<4", "size": 36382, "upload_time": "2020-02-27T02:29:30", "upload_time_iso_8601": "2020-02-27T02:29:30.308256Z", "url": "https://files.pythonhosted.org/packages/be/a9/58df87d7b48f51801c5d3f26eae1d02895fc1e46f02e515351dc325f61e2/paconn-0.0.13-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9f8e70fb003b26d0241ee2214ed49f0c", "sha256": "3b1912c6d71966d0fc1d1f04e0ef5677dd923468a1c93a503d6019e22d274533"}, "downloads": -1, "filename": "paconn-0.0.13.tar.gz", "has_sig": false, "md5_digest": "9f8e70fb003b26d0241ee2214ed49f0c", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5,<4", "size": 28522, "upload_time": "2020-02-27T02:29:31", "upload_time_iso_8601": "2020-02-27T02:29:31.869834Z", "url": "https://files.pythonhosted.org/packages/04/c3/b626b3d93574e91db3cfdab7887c8e6b295f95789964929da3ad58c2270b/paconn-0.0.13.tar.gz", "yanked": false}], "0.0.9": [{"comment_text": "", "digests": {"md5": "a9575db7b734d56e982f423c9cb46b30", "sha256": "8f2bef174a7f8621ad5e6cdb4ad8af9f39835e946dc9e446a283acdf8b2f9839"}, "downloads": -1, "filename": "paconn-0.0.9-py3-none-any.whl", "has_sig": false, "md5_digest": "a9575db7b734d56e982f423c9cb46b30", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5,<4", "size": 29875, "upload_time": "2019-04-01T17:43:07", "upload_time_iso_8601": "2019-04-01T17:43:07.596930Z", "url": "https://files.pythonhosted.org/packages/23/91/de62a2c23336c51f10adaa4400454d9926c60336e08aa62aa6c86e16b9da/paconn-0.0.9-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e82df690b55ab60d671fb4b2afb034ce", "sha256": "864bd5bd371dedea80afeb8fd61b58f0ce67ff8ec4d7a64c0b70ec5beb3beea3"}, "downloads": -1, "filename": "paconn-0.0.9.tar.gz", "has_sig": false, "md5_digest": "e82df690b55ab60d671fb4b2afb034ce", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5,<4", "size": 23539, "upload_time": "2019-04-01T17:43:08", "upload_time_iso_8601": "2019-04-01T17:43:08.887117Z", "url": "https://files.pythonhosted.org/packages/b8/c9/aad14dbb7fab416feb1b26b48838e402fdec6c340f0dec56e41344852397/paconn-0.0.9.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "0a0d226721ae5d6586604d255c398a1f", "sha256": "47c25528aab4cb007da507550667796db3087c160d9a402cc9278f7efcab731a"}, "downloads": -1, "filename": "paconn-0.0.13-py3-none-any.whl", "has_sig": false, "md5_digest": "0a0d226721ae5d6586604d255c398a1f", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.5,<4", "size": 36382, "upload_time": "2020-02-27T02:29:30", "upload_time_iso_8601": "2020-02-27T02:29:30.308256Z", "url": "https://files.pythonhosted.org/packages/be/a9/58df87d7b48f51801c5d3f26eae1d02895fc1e46f02e515351dc325f61e2/paconn-0.0.13-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9f8e70fb003b26d0241ee2214ed49f0c", "sha256": "3b1912c6d71966d0fc1d1f04e0ef5677dd923468a1c93a503d6019e22d274533"}, "downloads": -1, "filename": "paconn-0.0.13.tar.gz", "has_sig": false, "md5_digest": "9f8e70fb003b26d0241ee2214ed49f0c", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5,<4", "size": 28522, "upload_time": "2020-02-27T02:29:31", "upload_time_iso_8601": "2020-02-27T02:29:31.869834Z", "url": "https://files.pythonhosted.org/packages/04/c3/b626b3d93574e91db3cfdab7887c8e6b295f95789964929da3ad58c2270b/paconn-0.0.13.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:00:03 2020"}