{"info": {"author": "Vesselin Bontchev", "author_email": "vbontchev@yahoo.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Environment :: Console", "Intended Audience :: Developers", "License :: OSI Approved :: GNU General Public License v3 (GPLv3)", "Natural Language :: English", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Topic :: Security", "Topic :: Software Development :: Disassemblers", "Topic :: Utilities"], "description": "# pcodedmp.py - A VBA p-code disassembler\n\n## Introduction\n\nIt is not widely known, but macros written in VBA (Visual Basic for Applications; the macro programming language used in Microsoft Office) exist in three different executable forms, each of which can be what is actually executed at run time, depending on the circumstances. These forms are:\n\n- _Source code_. The original source code of the macro module is compressed and stored at the end of the module stream. This makes it relatively easy to locate and extract and most free DFIR tools for macro analysis like [oledump](https://blog.didierstevens.com/programs/oledump-py/) or [olevba](http://www.decalage.info/python/olevba) or even many professional anti-virus tools look only at this form. However, most of the time the source code is completely ignored by Office. In fact, it is possible to remove the source code (and therefore make all these tools think that there are no macros present), yet the macros will still execute without any problems. I have created a [proof of concept](http://bontchev.my.contact.bg/poc2.zip) illustrating this. Most tools will not see any macros in the documents in this archive it but if opened with the corresponding Word version (that matches the document name), it will display a message and will launch `calc.exe`. It is surprising that malware authors are not using this trick more widely.\n\n- _P-code_. As each VBA line is entered into the VBA editor, it is immediately compiled into p-code (a pseudo code for a stack machine) and stored in a different place in the module stream. The p-code is precisely what is executed most of the time. In fact, even when you open the source of a macro module in the VBA editor, what is displayed is not the decompressed source code but the p-code decompiled into source. Only if the document is opened under a version of Office that uses a different VBA version from the one that has been used to create the document, the stored compressed source code is re-compiled into p-code and then that p-code is executed. This makes it possible to open a VBA-containing document on any version of Office that supports VBA and have the macros inside remain executable, despite the fact that the different versions of VBA use different (incompatible) p-code instructions.\n\n- _Execodes_. When the p-code has been executed at least once, a further tokenized form of it is stored elsewhere in the document (in streams, the names of which begin with `__SRP_`, followed by a number). From there it can be executed much faster. However, the format of the execodes is extremely complex and is specific for the particular Office version (not VBA version) in which they have been created. This makes them extremely non-portable. In addition, their presence is not necessary - they can be removed and the macros will run just fine (from the p-code).\n\nSince most of the time it is the p-code that determines what exactly a macro would do (even if neither source code, nor execodes are present), it would make sense to have a tool that can display it. This is what prompted us to create this VBA p-code disassembler.\n\n## Installation\n\nThe script will work both in Python version 2.6+ and in Python 3.x. The simplest way to install it is from [PyPi](https://pypi.org/) with `pip`:\n\n    pip install pcodedmp -U\n\nThe above command will install the latest version of `pcodedmp` (upgrading an older one if it already exists), while also installing all the necessary dependencies (currently only `oletools` and `win_unicode_console` but there might be additional ones in the future).\n\nIf you would rather install it from the GitHub repository, you can do it like this:\n\n    git clone https://github.com/bontchev/pcodedmp.git\n    cd pcodedmp\n    pip install .\n\n## Usage\n\nThe script takes as a command-line argument a list of one or more names of files or directories. If the name is an OLE2 document, it will be inspected for VBA code and the p-code of each code module will be disassembled. If the name is a directory, all the files in this directory and its subdirectories will be similarly processed. In addition to the disassembled p-code, by default the script also displays the parsed records of the `dir` stream, as well as the identifiers (variable and function names) used in the VBA modules and stored in the `_VBA_PROJECT` stream.\n\nThe script supports VBA5 (Office 97, MacOffice 98), VBA6 (Office 2000 to Office 2009) and VBA7 (Office 2010 and higher).\n\nThe script also accepts the following command-line options:\n\n`-h`, `--help`    Displays a short explanation how to use the script and what the command-line options are.\n\n`-v`, `--version` Displays the version of the script.\n\n`-n`, `--norecurse` If a name specified on the command line is a directory, process only the files in this directory; do not process the files in its subdirectories.\n\n`-d`, `--disasmonly` Only the p-code will be disassembled, without the parsed contents of the `dir` stream or the identifiers in the `_VBA_PROJECT` stream.\n\n`-b`, `--verbose` The contents of the `dir` and `_VBA_PROJECT` streams is dumped in hex and ASCII form. In addition, the raw bytes of each compiled into p-code VBA line are also dumped in hex and ASCII.\n\n`-o OUTFILE`, `--output OUTFILE` Save the results to the specified output file, instead of sending it to the standard output.\n\nFor instance, using the script on one of the documents in the [proof of concept](http://bontchev.my.contact.bg/poc2.zip) mentioned above produces the following results:\n\n```shell\npython pcodedmp.py -d Word2013.doc\n\nProcessing file: Word2013.doc\n===============================================================================\nModule streams:\nMacros/VBA/ThisDocument - 1517 bytes\nLine #0:\n        FuncDefn (Private Sub Document_Open())\nLine #1:\n        LitStr 0x001D \"This could have been a virus!\"\n        Ld vbOKOnly\n        Ld vbInformation\n        Add\n        LitStr 0x0006 \"Virus!\"\n        ArgsCall MsgBox 0x0003\nLine #2:\n        LitStr 0x0008 \"calc.exe\"\n        Paren\n        ArgsCall Shell 0x0001\nLine #3:\n        EndSub\n```\n\nFor reference, it is the result of compiling the following VBA code:\n\n```vba\nPrivate Sub Document_Open()\n    MsgBox \"This could have been a virus!\", vbOKOnly + vbInformation, \"Virus!\"\n    Shell(\"calc.exe\")\nEnd Sub\n```\n\n## Known problems\n\n- Office 2016 64-bit only: When disassembling variables declared as being of custom type (e.g., `Dim SomeVar As SomeType`), the type (`As SomeType`) is not disassembled.\n\n- Office 2016 64-bit only: The `Private` property of `Sub`, `Function` and `Property` declarations is not disassembled.\n\n- Office 2016 64-bit only: The `Declare` part of external function declarations (e.g., `Private Declare PtrSafe Function SomeFunc Lib \"SomeLib\" Alias \"SomeName\" () As Long`) is not disassembled.\n\n- Office 2000 and higher: The type of a subroutine or function argument of type `ParamArray` is not disassembled correctly. For instance, `Sub Foo (ParamArray arg())` will be disassembled as `Sub Foo (arg)`.\n\n- All versions of Office: The `Alias \"SomeName\"` part of external function declarations (e.g., `Private Declare PtrSafe Function SomeFunc Lib \"SomeLib\" Alias \"SomeName\" () As Long`) is not disassembled.\n\n- All versions of Office: The `Public` property of custom type definitions (e.g., `Public Type SomeType`) is not disassembled.\n\n- All versions of Office: The custom type of a subroutine or function argument is not disassembled correctly and `CustomType` is used instead. For instance, `Sub Foo (arg As Bar)` will be disassembled as `Sub Foo (arg As CustomType)`.\n\n- If the output of the program is sent to a file, instead of to the console (either by using the `-o` option or by redirecting `stdout`), any non-ASCII strings (like module names, texsts used in the macros, etc.) might not be properly encoded.\n\nI do not have access to 64-bit Office 2016 and the few samples of documents, generated by this version of Office, that I have, have been insufficient for me to figure out where the corresponding information resides. I know where it resides in the other versions of Office, but it has been moved elsewhere in 64-bit Office 2016 and the old algorithms no longer work.\n\n## To do\n\n- Implement support of VBA3 (Excel95).\n\n- While the script should support documents created by MacOffice, this has not been tested (and you know how well untested code usually works). This should be tested and any bugs related to it should be fixed.\n\n- I am not an experienced Python programmer and the code is ugly. Somebody more familiar with Python than me should probably rewrite the script and make it look better.\n\n## Change log\n\nVersion 1.2.6:\n\n- Changed it not to require the `win_unicode_console` module when it is not available - e.g., when not running on a Windows machine or when running under the PyPy implementation of Python, thanks to [Philippe Lagadec](https://github.com/decalage2).\n\nVersion 1.2.5:\n\n- Added a sanity check to avoid errors when parsing object declarations\n- The functions that produce output now have the output file (default is `stdout`) as a parameter, for better integration with other tools, thanks to [Philippe Lagadec](https://github.com/decalage2).\n\nVersion 1.2.4:\n\n- Implemented support for module names with non-ASCII characters in their names. Thanks to [Philippe Lagadec](https://github.com/decalage2) for helping me with that.\n- Fixed a parsing error when disassembling object declarations.\n- Removed some unused variables.\n- Improved the documentation a bit.\n\nVersion 1.2.3:\n\n- Fixed a few crashes and documented better some disassembly failures.\n- Converted the script into a package that can be installed with ``pip``. Use the command ``pip install pcodedmp``.\n\nVersion 1.2.2:\n\n- Implemented handling of documents saved in Open XML format (which is the default format of Office 2007 and higher) - `.docm`, `.xlsm`, `.pptm`.\n\nVersion 1.2.1:\n\n- Now runs under Python 3.x too.\n- Improved support of 64-bit Office documents.\n- Implemented support of some VBA7-specific features (`Friend`, `PtrSafe`, `LongPtr`).\n- Improved the disassembling of `Dim` declarations.\n\nVersion 1.2.0:\n\n- Disassembling the various declarations (`New`, `Type`, `Dim`, `ReDim`, `Sub`, `Function`, `Property`).\n\nVersion 1.1.0:\n\n- Storing the opcodes in a more efficient manner.\n- Implemented VBA7 support.\n- Implemented support for documents created by the 64-bit version of Office.\n\nVersion 1.0.0:\n\n- Initial version.\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/bontchev/pcodedmp", "keywords": "vba,p-code,disassembler", "license": "GPL", "maintainer": "Vesselin Bontchev", "maintainer_email": "vbontchev@yahoo.com", "name": "pcodedmp", "package_url": "https://pypi.org/project/pcodedmp/", "platform": "", "project_url": "https://pypi.org/project/pcodedmp/", "project_urls": {"Homepage": "https://github.com/bontchev/pcodedmp"}, "release_url": "https://pypi.org/project/pcodedmp/1.2.6/", "requires_dist": ["oletools (>=0.54)", "win-unicode-console ; platform_system == \"Windows\" and platform_python_implementation != \"PyPy\""], "requires_python": "", "summary": "A VBA p-code disassembler", "version": "1.2.6", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>pcodedmp.py - A VBA p-code disassembler</h1>\n<h2>Introduction</h2>\n<p>It is not widely known, but macros written in VBA (Visual Basic for Applications; the macro programming language used in Microsoft Office) exist in three different executable forms, each of which can be what is actually executed at run time, depending on the circumstances. These forms are:</p>\n<ul>\n<li>\n<p><em>Source code</em>. The original source code of the macro module is compressed and stored at the end of the module stream. This makes it relatively easy to locate and extract and most free DFIR tools for macro analysis like <a href=\"https://blog.didierstevens.com/programs/oledump-py/\" rel=\"nofollow\">oledump</a> or <a href=\"http://www.decalage.info/python/olevba\" rel=\"nofollow\">olevba</a> or even many professional anti-virus tools look only at this form. However, most of the time the source code is completely ignored by Office. In fact, it is possible to remove the source code (and therefore make all these tools think that there are no macros present), yet the macros will still execute without any problems. I have created a <a href=\"http://bontchev.my.contact.bg/poc2.zip\" rel=\"nofollow\">proof of concept</a> illustrating this. Most tools will not see any macros in the documents in this archive it but if opened with the corresponding Word version (that matches the document name), it will display a message and will launch <code>calc.exe</code>. It is surprising that malware authors are not using this trick more widely.</p>\n</li>\n<li>\n<p><em>P-code</em>. As each VBA line is entered into the VBA editor, it is immediately compiled into p-code (a pseudo code for a stack machine) and stored in a different place in the module stream. The p-code is precisely what is executed most of the time. In fact, even when you open the source of a macro module in the VBA editor, what is displayed is not the decompressed source code but the p-code decompiled into source. Only if the document is opened under a version of Office that uses a different VBA version from the one that has been used to create the document, the stored compressed source code is re-compiled into p-code and then that p-code is executed. This makes it possible to open a VBA-containing document on any version of Office that supports VBA and have the macros inside remain executable, despite the fact that the different versions of VBA use different (incompatible) p-code instructions.</p>\n</li>\n<li>\n<p><em>Execodes</em>. When the p-code has been executed at least once, a further tokenized form of it is stored elsewhere in the document (in streams, the names of which begin with <code>__SRP_</code>, followed by a number). From there it can be executed much faster. However, the format of the execodes is extremely complex and is specific for the particular Office version (not VBA version) in which they have been created. This makes them extremely non-portable. In addition, their presence is not necessary - they can be removed and the macros will run just fine (from the p-code).</p>\n</li>\n</ul>\n<p>Since most of the time it is the p-code that determines what exactly a macro would do (even if neither source code, nor execodes are present), it would make sense to have a tool that can display it. This is what prompted us to create this VBA p-code disassembler.</p>\n<h2>Installation</h2>\n<p>The script will work both in Python version 2.6+ and in Python 3.x. The simplest way to install it is from <a href=\"https://pypi.org/\" rel=\"nofollow\">PyPi</a> with <code>pip</code>:</p>\n<pre><code>pip install pcodedmp -U\n</code></pre>\n<p>The above command will install the latest version of <code>pcodedmp</code> (upgrading an older one if it already exists), while also installing all the necessary dependencies (currently only <code>oletools</code> and <code>win_unicode_console</code> but there might be additional ones in the future).</p>\n<p>If you would rather install it from the GitHub repository, you can do it like this:</p>\n<pre><code>git clone https://github.com/bontchev/pcodedmp.git\ncd pcodedmp\npip install .\n</code></pre>\n<h2>Usage</h2>\n<p>The script takes as a command-line argument a list of one or more names of files or directories. If the name is an OLE2 document, it will be inspected for VBA code and the p-code of each code module will be disassembled. If the name is a directory, all the files in this directory and its subdirectories will be similarly processed. In addition to the disassembled p-code, by default the script also displays the parsed records of the <code>dir</code> stream, as well as the identifiers (variable and function names) used in the VBA modules and stored in the <code>_VBA_PROJECT</code> stream.</p>\n<p>The script supports VBA5 (Office 97, MacOffice 98), VBA6 (Office 2000 to Office 2009) and VBA7 (Office 2010 and higher).</p>\n<p>The script also accepts the following command-line options:</p>\n<p><code>-h</code>, <code>--help</code>    Displays a short explanation how to use the script and what the command-line options are.</p>\n<p><code>-v</code>, <code>--version</code> Displays the version of the script.</p>\n<p><code>-n</code>, <code>--norecurse</code> If a name specified on the command line is a directory, process only the files in this directory; do not process the files in its subdirectories.</p>\n<p><code>-d</code>, <code>--disasmonly</code> Only the p-code will be disassembled, without the parsed contents of the <code>dir</code> stream or the identifiers in the <code>_VBA_PROJECT</code> stream.</p>\n<p><code>-b</code>, <code>--verbose</code> The contents of the <code>dir</code> and <code>_VBA_PROJECT</code> streams is dumped in hex and ASCII form. In addition, the raw bytes of each compiled into p-code VBA line are also dumped in hex and ASCII.</p>\n<p><code>-o OUTFILE</code>, <code>--output OUTFILE</code> Save the results to the specified output file, instead of sending it to the standard output.</p>\n<p>For instance, using the script on one of the documents in the <a href=\"http://bontchev.my.contact.bg/poc2.zip\" rel=\"nofollow\">proof of concept</a> mentioned above produces the following results:</p>\n<pre>python pcodedmp.py -d Word2013.doc\n\nProcessing file: Word2013.doc\n<span class=\"o\">===============================================================================</span>\nModule streams:\nMacros/VBA/ThisDocument - <span class=\"m\">1517</span> bytes\nLine <span class=\"c1\">#0:</span>\n        FuncDefn <span class=\"o\">(</span>Private Sub Document_Open<span class=\"o\">())</span>\nLine <span class=\"c1\">#1:</span>\n        LitStr 0x001D <span class=\"s2\">\"This could have been a virus!\"</span>\n        Ld vbOKOnly\n        Ld vbInformation\n        Add\n        LitStr 0x0006 <span class=\"s2\">\"Virus!\"</span>\n        ArgsCall MsgBox 0x0003\nLine <span class=\"c1\">#2:</span>\n        LitStr 0x0008 <span class=\"s2\">\"calc.exe\"</span>\n        Paren\n        ArgsCall Shell 0x0001\nLine <span class=\"c1\">#3:</span>\n        EndSub\n</pre>\n<p>For reference, it is the result of compiling the following VBA code:</p>\n<pre>Private Sub Document_Open()\n    MsgBox \"This could have been a virus!\", vbOKOnly + vbInformation, \"Virus!\"\n    Shell(\"calc.exe\")\nEnd Sub\n</pre>\n<h2>Known problems</h2>\n<ul>\n<li>\n<p>Office 2016 64-bit only: When disassembling variables declared as being of custom type (e.g., <code>Dim SomeVar As SomeType</code>), the type (<code>As SomeType</code>) is not disassembled.</p>\n</li>\n<li>\n<p>Office 2016 64-bit only: The <code>Private</code> property of <code>Sub</code>, <code>Function</code> and <code>Property</code> declarations is not disassembled.</p>\n</li>\n<li>\n<p>Office 2016 64-bit only: The <code>Declare</code> part of external function declarations (e.g., <code>Private Declare PtrSafe Function SomeFunc Lib \"SomeLib\" Alias \"SomeName\" () As Long</code>) is not disassembled.</p>\n</li>\n<li>\n<p>Office 2000 and higher: The type of a subroutine or function argument of type <code>ParamArray</code> is not disassembled correctly. For instance, <code>Sub Foo (ParamArray arg())</code> will be disassembled as <code>Sub Foo (arg)</code>.</p>\n</li>\n<li>\n<p>All versions of Office: The <code>Alias \"SomeName\"</code> part of external function declarations (e.g., <code>Private Declare PtrSafe Function SomeFunc Lib \"SomeLib\" Alias \"SomeName\" () As Long</code>) is not disassembled.</p>\n</li>\n<li>\n<p>All versions of Office: The <code>Public</code> property of custom type definitions (e.g., <code>Public Type SomeType</code>) is not disassembled.</p>\n</li>\n<li>\n<p>All versions of Office: The custom type of a subroutine or function argument is not disassembled correctly and <code>CustomType</code> is used instead. For instance, <code>Sub Foo (arg As Bar)</code> will be disassembled as <code>Sub Foo (arg As CustomType)</code>.</p>\n</li>\n<li>\n<p>If the output of the program is sent to a file, instead of to the console (either by using the <code>-o</code> option or by redirecting <code>stdout</code>), any non-ASCII strings (like module names, texsts used in the macros, etc.) might not be properly encoded.</p>\n</li>\n</ul>\n<p>I do not have access to 64-bit Office 2016 and the few samples of documents, generated by this version of Office, that I have, have been insufficient for me to figure out where the corresponding information resides. I know where it resides in the other versions of Office, but it has been moved elsewhere in 64-bit Office 2016 and the old algorithms no longer work.</p>\n<h2>To do</h2>\n<ul>\n<li>\n<p>Implement support of VBA3 (Excel95).</p>\n</li>\n<li>\n<p>While the script should support documents created by MacOffice, this has not been tested (and you know how well untested code usually works). This should be tested and any bugs related to it should be fixed.</p>\n</li>\n<li>\n<p>I am not an experienced Python programmer and the code is ugly. Somebody more familiar with Python than me should probably rewrite the script and make it look better.</p>\n</li>\n</ul>\n<h2>Change log</h2>\n<p>Version 1.2.6:</p>\n<ul>\n<li>Changed it not to require the <code>win_unicode_console</code> module when it is not available - e.g., when not running on a Windows machine or when running under the PyPy implementation of Python, thanks to <a href=\"https://github.com/decalage2\" rel=\"nofollow\">Philippe Lagadec</a>.</li>\n</ul>\n<p>Version 1.2.5:</p>\n<ul>\n<li>Added a sanity check to avoid errors when parsing object declarations</li>\n<li>The functions that produce output now have the output file (default is <code>stdout</code>) as a parameter, for better integration with other tools, thanks to <a href=\"https://github.com/decalage2\" rel=\"nofollow\">Philippe Lagadec</a>.</li>\n</ul>\n<p>Version 1.2.4:</p>\n<ul>\n<li>Implemented support for module names with non-ASCII characters in their names. Thanks to <a href=\"https://github.com/decalage2\" rel=\"nofollow\">Philippe Lagadec</a> for helping me with that.</li>\n<li>Fixed a parsing error when disassembling object declarations.</li>\n<li>Removed some unused variables.</li>\n<li>Improved the documentation a bit.</li>\n</ul>\n<p>Version 1.2.3:</p>\n<ul>\n<li>Fixed a few crashes and documented better some disassembly failures.</li>\n<li>Converted the script into a package that can be installed with <code>pip</code>. Use the command <code>pip install pcodedmp</code>.</li>\n</ul>\n<p>Version 1.2.2:</p>\n<ul>\n<li>Implemented handling of documents saved in Open XML format (which is the default format of Office 2007 and higher) - <code>.docm</code>, <code>.xlsm</code>, <code>.pptm</code>.</li>\n</ul>\n<p>Version 1.2.1:</p>\n<ul>\n<li>Now runs under Python 3.x too.</li>\n<li>Improved support of 64-bit Office documents.</li>\n<li>Implemented support of some VBA7-specific features (<code>Friend</code>, <code>PtrSafe</code>, <code>LongPtr</code>).</li>\n<li>Improved the disassembling of <code>Dim</code> declarations.</li>\n</ul>\n<p>Version 1.2.0:</p>\n<ul>\n<li>Disassembling the various declarations (<code>New</code>, <code>Type</code>, <code>Dim</code>, <code>ReDim</code>, <code>Sub</code>, <code>Function</code>, <code>Property</code>).</li>\n</ul>\n<p>Version 1.1.0:</p>\n<ul>\n<li>Storing the opcodes in a more efficient manner.</li>\n<li>Implemented VBA7 support.</li>\n<li>Implemented support for documents created by the 64-bit version of Office.</li>\n</ul>\n<p>Version 1.0.0:</p>\n<ul>\n<li>Initial version.</li>\n</ul>\n\n          </div>"}, "last_serial": 5609126, "releases": {"1.2.3": [{"comment_text": "", "digests": {"md5": "22fe926a8855888cfdc5b41e35808217", "sha256": "539856f791dbd613425ae8f9e8cf4ca1766e1e73ba0bbe3f1a1890566c92a119"}, "downloads": -1, "filename": "pcodedmp-1.2.3-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "22fe926a8855888cfdc5b41e35808217", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 34554, "upload_time": "2018-02-09T23:29:09", "upload_time_iso_8601": "2018-02-09T23:29:09.231537Z", "url": "https://files.pythonhosted.org/packages/a4/70/16234b49eaf4d8fee808cb4f327be2d18c923aa4096dae53cccc8a86ecaf/pcodedmp-1.2.3-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "871a543004373fa3a76474cbaeb645a9", "sha256": "8ceded091b9eab9e6235638e8b1c90f384c1b57aea04cb3b104cd88e1669f4ce"}, "downloads": -1, "filename": "pcodedmp-1.2.3.tar.gz", "has_sig": false, "md5_digest": "871a543004373fa3a76474cbaeb645a9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 18585, "upload_time": "2018-02-09T23:29:15", "upload_time_iso_8601": "2018-02-09T23:29:15.277072Z", "url": "https://files.pythonhosted.org/packages/67/d4/6691f75e6f9bbbdad9101e1d02398806909f5991c8da1cc6ab528e71acb2/pcodedmp-1.2.3.tar.gz", "yanked": false}], "1.2.4": [{"comment_text": "", "digests": {"md5": "e0d32494333521edfb217c8e18a69825", "sha256": "e72d29c31452968ef7c967082d1c564636ce567ddff384f764944a6dde16ebf6"}, "downloads": -1, "filename": "pcodedmp-1.2.4-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "e0d32494333521edfb217c8e18a69825", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 30559, "upload_time": "2019-05-17T09:15:49", "upload_time_iso_8601": "2019-05-17T09:15:49.452887Z", "url": "https://files.pythonhosted.org/packages/26/1a/784cea019800c48a006fbfc0e96f35adcdfe19e7d97d47fe90295f81d251/pcodedmp-1.2.4-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b272dfbf8e87336733796878172b9410", "sha256": "ea791ea2968faabdc933f56282c8c2b86740a48b2248f38d73489215824c71d0"}, "downloads": -1, "filename": "pcodedmp-1.2.4.tar.gz", "has_sig": false, "md5_digest": "b272dfbf8e87336733796878172b9410", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 34915, "upload_time": "2019-05-17T09:15:51", "upload_time_iso_8601": "2019-05-17T09:15:51.262978Z", "url": "https://files.pythonhosted.org/packages/8a/c9/b2ad0b52d6fa563b5261d0dced5494a0883bd48431dec805e134c02709cc/pcodedmp-1.2.4.tar.gz", "yanked": false}], "1.2.5": [{"comment_text": "", "digests": {"md5": "580c44e08bb281a258b40bb2ffc57430", "sha256": "0ddfec384313bdb2d5fbae7bad6a471b5f5cafefa4fe9901bbf9d2c977b8d3ca"}, "downloads": -1, "filename": "pcodedmp-1.2.5-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "580c44e08bb281a258b40bb2ffc57430", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 30732, "upload_time": "2019-06-05T15:13:42", "upload_time_iso_8601": "2019-06-05T15:13:42.228900Z", "url": "https://files.pythonhosted.org/packages/aa/92/c7003700c6fcfd8153f06e77a4a1f8129700fe551068743d209b90b768d4/pcodedmp-1.2.5-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e836d2afbbda02f83c15a802512741ce", "sha256": "119991e04bb0960d806436bce6a2c17d396a7829b09f8b8313219d489e1421e2"}, "downloads": -1, "filename": "pcodedmp-1.2.5.tar.gz", "has_sig": false, "md5_digest": "e836d2afbbda02f83c15a802512741ce", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 35228, "upload_time": "2019-06-05T15:13:43", "upload_time_iso_8601": "2019-06-05T15:13:43.937469Z", "url": "https://files.pythonhosted.org/packages/37/c3/2c494ff41c66d4ffe9031a620a0523fa4fb99d7b852e30e5a149c0d53971/pcodedmp-1.2.5.tar.gz", "yanked": false}], "1.2.6": [{"comment_text": "", "digests": {"md5": "8cceca2520b7b789b49fe3b7dd06ce04", "sha256": "4441f7c0ab4cbda27bd4668db3b14f36261d86e5059ce06c0828602cbe1c4278"}, "downloads": -1, "filename": "pcodedmp-1.2.6-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "8cceca2520b7b789b49fe3b7dd06ce04", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 30939, "upload_time": "2019-07-30T18:05:40", "upload_time_iso_8601": "2019-07-30T18:05:40.483419Z", "url": "https://files.pythonhosted.org/packages/ba/72/b380fb5c89d89c3afafac8cf02a71a45f4f4a4f35531ca949a34683962d1/pcodedmp-1.2.6-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9b9b4e85203a6dd19757793bf2d87af4", "sha256": "025f8c809a126f45a082ffa820893e6a8d990d9d7ddb68694b5a9f0a6dbcd955"}, "downloads": -1, "filename": "pcodedmp-1.2.6.tar.gz", "has_sig": false, "md5_digest": "9b9b4e85203a6dd19757793bf2d87af4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 35549, "upload_time": "2019-07-30T18:05:42", "upload_time_iso_8601": "2019-07-30T18:05:42.516848Z", "url": "https://files.pythonhosted.org/packages/3d/20/6d461e29135f474408d0d7f95b2456a9ba245560768ee51b788af10f7429/pcodedmp-1.2.6.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "8cceca2520b7b789b49fe3b7dd06ce04", "sha256": "4441f7c0ab4cbda27bd4668db3b14f36261d86e5059ce06c0828602cbe1c4278"}, "downloads": -1, "filename": "pcodedmp-1.2.6-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "8cceca2520b7b789b49fe3b7dd06ce04", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 30939, "upload_time": "2019-07-30T18:05:40", "upload_time_iso_8601": "2019-07-30T18:05:40.483419Z", "url": "https://files.pythonhosted.org/packages/ba/72/b380fb5c89d89c3afafac8cf02a71a45f4f4a4f35531ca949a34683962d1/pcodedmp-1.2.6-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9b9b4e85203a6dd19757793bf2d87af4", "sha256": "025f8c809a126f45a082ffa820893e6a8d990d9d7ddb68694b5a9f0a6dbcd955"}, "downloads": -1, "filename": "pcodedmp-1.2.6.tar.gz", "has_sig": false, "md5_digest": "9b9b4e85203a6dd19757793bf2d87af4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 35549, "upload_time": "2019-07-30T18:05:42", "upload_time_iso_8601": "2019-07-30T18:05:42.516848Z", "url": "https://files.pythonhosted.org/packages/3d/20/6d461e29135f474408d0d7f95b2456a9ba245560768ee51b788af10f7429/pcodedmp-1.2.6.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:57:25 2020"}