{"info": {"author": "Leonardo Murri", "author_email": "leonardo.murri1995@gmail.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# PennGrader\nWelcome to the PennGrader!\n\nHere at PennGrader, we believe that learning comes from lots of practice...and from making lots of mistakes. \n\nAfter many years as a student I found myself very frustrated in the following homework timeline: struggle on a homework assignment for weeks, submit something that may or may not be right and then wait a few more weeks to receive any type of feedback, at which point I had forgotten all about the homework. After many years as a TA, I also found myself very frustrated with the common auto-grading tools, the hours and hours of manual grading and the onslaught of re-grade requests that came thereafter.\n\nFrom these frustrations, the PennGrader was born!\n\nThe PennGrader was built to allow students to get instant feedback and many opportunities for re-submission. After all, programming is about making mistakes and learning from feedback! Moreover, we wanted to allow TAs and Instructors to write their homework in any way they pleased, without having to worry about the structure of a specific auto-grader. The examples below are done using Jupyter Notebooks which is the most common use case, but you can use this for normal Python homework as well. \n\nHere is what a student sees in his Homework Notebook. All a student has to do is write her solution and run the auto-grading cell.\n\n![Sample Question](https://penngrader-wiki.s3.amazonaws.com/sample_question.gif)\n\nThrough the magic of AWS Lambdas, the student's answer (in this case the `addition_function` object) is packaged and shipped to the backend where it is checked against the teacher-defined test case. Finally, a score is returned. All students' scores are saved in the backend and are easily accessible to the instructors. If at first they don't succeed, they can learn from their mistakes and try again.  (Yes, if you'd like, can set a maximum number of daily submissions to incentivize students to start early). This \"grader\" function can easily be used from any Jupyter notebook (even Google Colab), all you have to do is to `pip install penngrader`. See templates below.\n\nOk, ok, you might be saying to yourself: \"That looks easy enough, but what about us TAs, we want something that simple too!\" Well, look no further. The TAs/Instructors' experience is just as seamless. All TAs will share a __Teacher_Backend__ notebook, which contains all the test case functions. The logic of how testing is done is simple: whatever Python object gets passed through the `answer` field in the `grade(...)` function (see above) will be the input to the test case function (see below). In the above example, `addition_function` is passed as the answer to a test case named `\"test_case_1\"`. Therefore, the TAs will need to write a `test_case_1(addition_function)` function in the __Teacher_Backend__ notebook, as follows:\n\n![Sample Question](https://penngrader-wiki.s3.amazonaws.com/sample_update.gif)\n\nAs you can see, this function tests that `addition_function(1,2) == 3`, if correct it adds 5 points to the `student_score`. The test must then return an integer tuple `(student_score, max_score)`, which is what will be displayed to the student. As you can see this type of test function gives the Instructor complete flexibility on what to test and how much partial credit to give. Remember that the answer that gets passed to the test case could be anything... a function, a class, a DataFrame, a list, a picture... anything! The PennGrader automatically serializes it and all its dependencies and ships to AWS for grading.\n\nTo create homework for your class you will need a course `SECRET_KEY`. We will open to the public soon, however for now contact me at leonardo.murri1995@gmail.com if you are interested in using the PennGrader for your class.\n\n[PennGrader_Homework_Template.ipynb](https://penngrader-wiki.s3.amazonaws.com/PennGrader_Homework_Template.ipynb)\n\n[PennGrader_TeacherBackend.ipynb](https://penngrader-wiki.s3.amazonaws.com/PennGrader_TeacherBackend.ipynb)\n\nDownload these two notebooks and launch them via Jupyter. They will show you how to add grading cells in your homework notebook and add write/update test cases via the teacher backend, as well as view student's grades.\n\n## Behind the scenes...\nIn the following section, I will go into detail about the system implementation. Below is the system design overview we will go into.\n\n![Architecture Design](https://penngrader-wiki.s3.amazonaws.com/design.png)\n\n### Clients\nThere are two pip installable clients, one for students and one for instructors. You can install these two clients by running `pip install penngrader` in your favorite terminal.  When creating a new homework download the [Homework_Template.ipynb](https://penngrader-wiki.s3.amazonaws.com/PennGrader_Homework_Template.ipynb) and the [TeacherBackend.ipynb](https://penngrader-wiki.s3.amazonaws.com/PennGrader_TeacherBackend.ipynb) notebooks and follow the instructions. More details are presented below.\n\n#### Student's Client: PennGrader\n\nThe student's client will be embedded in the homework release notebook. Its main purpose will be to interface the student's homework with the AWS backend. This client is represented by the `PennGrader` class which needs to be initialized by the instructor when writing the homework as follows. Note: the HOMEWORK_ID needs to be filled in before releasing the notebook. The student should only enter his or her's student id. \n\n```\nimport penngrader.grader\ngrader = PennGrader(homework_id = HOMEWORK_ID, student_id = STUDENT_ID)\n```\n\nThe HOMEWORK_ID is the string obtained when creating new homework via the teacher backend, see below. \n\nSTUDENT_ID is the student defined variable representing their 8-digit PennID. The student will need to run this cell at the beginning of the notebook to initialize the grader. After every question, the Instructor will also need to write a grading cell which the student will run to invoke the grader. A grading cell looks as follows:\n\n```\ngrader.grade(test_case_id = TEST_CASE_NAME, answer = ANSWER) \n```\n\nTEST_CASE_NAME is the string name of the test case function that will grader the given question. \n\nANSWER is the object that needs to be graded. \n\nFor example, you might have a question where you instruct the student to create a DataFrame called `answer_df`. You will need to write `answer_df` as the input answer parameter of the grader function as follows:\n\n```\ngrader.grade(test_case_id = TEST_CASE_NAME, answer = answer_df) \n```\n\n That way, when the student runs this cell, the grader will automatically find the test function named TEST_CASE_NAME, serialize the `answer_df` python variable and ship it to AWS. The cool thing about the PennGrader is that you can pass pretty much anything as the answer.\n\n#### Teacher's Client: PennGraderBackend\n\nThe teacher client allows instructors to create and edit the test cases function mentioned earlier, as well as define multiple homework metadata parameters. As shown in the template notebooks linked above, you first need to initialize the _PennGraderBackend_ for a specific homework as follows:\n\n```\nbackend = PennGraderBackend(secret_key = SECRET_KEY, homework_number = HOMEWORK_NUMBER)\n```\n\nSECRET_KEY is the string variable obtained when creating a course. \n\nHOMEWORK_NUMBER identifies which homework number you are planning to write/edit. \n\nAfter running the above cell in a Jupyter Notebook, given a correct SECRET_KEY,  the assigned HOMEWORK_ID string will be printed out. This HOMEWORK_ID needs to be copied into the initialization of the PennGrader student client for release. Just the homework id, without the secret key, will not allow students to see any of the test cases, so make sure the secret key does not get out. \n\nAfter initialization, the  `backend` can be used to 1) update metadata 2) edit/write test cases.\n\nYou can edit the following metadata parmaters by runnin the following code:\n\n```\nTOTAL_SCORE = 100\nDEADLINE = '2019-12-05 11:59 PM'\nMAX_DAILY_TEST_CASE_SUBMISSIONS = 100\n\nbackend.update_metadata(DEADLINE, TOTAL_SCORE, MAX_DAILY_TEST_CASE_SUBMISSIONS)\n```\n\n`TOTAL_SCORE` represents the total number of points the homework is worth and should equal the sum of all test cases weights.\n\n`DEADLINE` represents the deadline of the homework, with format: _YYYY-MM-DD HH:MM A_.\n\n`MAX_DAILY_TEST_CASE_SUBMISSIONS` represents the number of allowed submissions per test case per day.\n\nWriting test cases is also just as simple. In a Jupyter Notebook (see Teacher Backend template above), you just need to write test case functions for each gradable question.  Each test case will be identified by a _test_case_id_ which is the name of the test case function. A test case functions needs to follow the following format:\n\n```\ndef test_case_name(answer_object_name):\n\tstudent_score = 0 # Current student score\n\tmax_score = 5 # Number of points this question is worth\n\n\t# some kind of grading that adds or subtracts from the student_score #\n\n\treturn (student_score, max_score)\n```\n\nThe test case function needs to return an integer tuple representing the student score for their answer and max number of points that can be earned in the given question.\n\nAfter writing all the test cases you need, simply run the following code in a cell and the PennGraderBackend class will automatically extract all user-defined functions in the current notebook and upload them to AWS.\n\n```\nbackend.update_test_cases()\n```\n\nA success message will print once the operation has succeeded. If loading a lot of external libraries this might take a few minutes.\n\n### Lambdas\n#### Grader\n\nThe _Grader_ lambda gets triggered from an API Gateway URL from the student's PennGrader client. The student's client as defined above will serialize its answer and make a POST request to the lambda with the following body parameters: \n\n`{'homework_id' : ______, 'student_id' : ________, 'test_case_id' : ________, 'answer' : _______ }`\n\nThe lambda will proceed by downloading the correct serialized _test_case_'s and _libraries_ from the _HomeworksTestCases_ DyanmoDB table. It will then deserialize these objects and extract the correct test case given the _test_case_id_ . import the correct libraries used by given test case. If the submission is valid the student score will be recorded in the backend. \n\n#### Grades\n\nThe grades lamabda interfaces the TeacherBackend and student notebook with the Gradebook. Using this API Gateway trigged lambda the TeacherBackend client can request all grades for a given homework. The payload body used to trigger this lambda will need to include \n\n`{'homework_id' : ______, 'secret_key' : ________, 'request_type' : ________ }`\n\nWhere the _secret_key_ parameter is optional and will allow a properly initialized TeacherBackend to download all grades for the selected homework. Students will also be able to view their scores.\n\n#### HomeworkConfig\n\nThe _HomeworkConfig_  lambda interfaces the TeacherBackend with the _HomeworkTestCases_ and _HomeworkMetadata_ DynamoDB Tables (see below for table schema). This lambda can be triggered in two ways 1) to update metadata and 2) to update test cases. After unparsing and deserializing the triggered payload, the inputted data gets written into the appropriate DynamoDB table. \n\n### DynamoDB Tables & S3 Buckets\nAs shown in the above schematic we maintain the majority of the data needed for grading and grade storage on DynamoDB. Below we list the information recorded in each table.\n\n**Classes DynamoDB Table**\n\n_Classes_ contains information about all courses currently registered for the PennGrader. The grading protocol is on a per-class basis. Each class that wants to create a course that uses the PennGrader will receive `SECRET_KEY`, this secret key will be passed in the TeacherBackend client to allow instructors to edit test cases. The tables contain the following schema:\n\n`secret_key` : Unique UUID used as a secret identifier for a course.\n\n`course_id`  : Human-readable identifier representing the course number and semester of the class offered i.e. 'CIS545_Spring_2019'. This ID will be the pre-fix of the `homework_id`, which will be used to identify a homework assignment.\n\n**HomeworksMetadata DynamoDB Table**\n\nThe _HomeworksMetadata_ is used to maintain updatable information about a specific homework. The information in this table will be editable from the TeacherBackend even after homework release. The tables contain the following schema:\n\n`homework_id` : Unique identifier representing a course + homework number pair. _homeowork_id_ is constructed by taking the _course_id_ defined above and appending the homework number of the assignment in question. For example, given the course id defined above (CIS545_Spring_2019), the _homework_id_ for the first homework will be 'CIS545_Spring_2019_HW1'. This homework_id will be passed into the PennGrader Grader class in the student's homework notebook and will be used to correctly find the correct test cases and store the student scores correctly.\n\n`deadline` : String representing the deadline of the homework in local time i.e. 2019-12-05 11:59 PM (format: YYYY-MM-DD HH:MM A)\n\n`max_daily_submissions` : Number representing the total number of submissions allows per test case per day. For example, if this number is set to 5, it means that all students can submit an answer to a specific test case 5 times a day. Resetting at midnight. \n\n`max_score` : The total number of points this homework is worth. This number should be equal to the sum of all test case weights. _max_score_ is used to show students how many points they have earned out of the total assignment.\n\n**HomeworksTestCases DynamoDB Table**\n\nThe _HomeworksTestCases_ table contains a serialized encoding of the test cases and libraries imports needed to run a student's answer. The tables contain the following schema:\n\n`homework_id` : Same _homework_id_ from the _HomeworksMetadata_ table.\n\n`test_cases` : This field contains a dill UTF-8 string serialization of the test cases defined in the teacher backend. The teacher backend extracts all test case functions from the notebook and creates a dictionary of _name_ -> _function_. This parameter is deserialized when a new grading request is made and the correct test case is extracted and ran. \n\n`libraries` : Similar to the _test_cases_ field, the libraries are UTF-8 dill serialized list of tuples that contain all libraries and functions imported in the teacher backend notebook and their appropriate short name. This list is used to import all needed libraries to run a specific test case. \n\n\n**Gradebook DynamoDB Table**\n\nThe _Gradebook_ table contains all grading submissions and student scores. The table contains the following schema:\n\n`homework_id` : Same _homework_id_ from the _HomeworksMetadata_ table.\n\n`student_submission_id` : String representing a student submission. This string is create by appending the student's PennID to the test case name i.e. '12345678_test_case_1'.\n\n`max_score` : Maximum points that can be earned for this test case\n\n`student_score` : Points earned by the student on this test case. \n\nNote: Currently only the last submission is recorded, thus the latest student score will overwrite all previous scores.\n\n\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/LeoMurri/PennGrader", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "penngrader", "package_url": "https://pypi.org/project/penngrader/", "platform": "", "project_url": "https://pypi.org/project/penngrader/", "project_urls": {"Homepage": "https://github.com/LeoMurri/PennGrader"}, "release_url": "https://pypi.org/project/penngrader/0.4/", "requires_dist": null, "requires_python": "", "summary": "In-line python grader client.", "version": "0.4", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>PennGrader</h1>\n<p>Welcome to the PennGrader!</p>\n<p>Here at PennGrader, we believe that learning comes from lots of practice...and from making lots of mistakes.</p>\n<p>After many years as a student I found myself very frustrated in the following homework timeline: struggle on a homework assignment for weeks, submit something that may or may not be right and then wait a few more weeks to receive any type of feedback, at which point I had forgotten all about the homework. After many years as a TA, I also found myself very frustrated with the common auto-grading tools, the hours and hours of manual grading and the onslaught of re-grade requests that came thereafter.</p>\n<p>From these frustrations, the PennGrader was born!</p>\n<p>The PennGrader was built to allow students to get instant feedback and many opportunities for re-submission. After all, programming is about making mistakes and learning from feedback! Moreover, we wanted to allow TAs and Instructors to write their homework in any way they pleased, without having to worry about the structure of a specific auto-grader. The examples below are done using Jupyter Notebooks which is the most common use case, but you can use this for normal Python homework as well.</p>\n<p>Here is what a student sees in his Homework Notebook. All a student has to do is write her solution and run the auto-grading cell.</p>\n<p><img alt=\"Sample Question\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/22a1d9875cab21161f71dd1c7f5a4d1f7f310394/68747470733a2f2f70656e6e6772616465722d77696b692e73332e616d617a6f6e6177732e636f6d2f73616d706c655f7175657374696f6e2e676966\"></p>\n<p>Through the magic of AWS Lambdas, the student's answer (in this case the <code>addition_function</code> object) is packaged and shipped to the backend where it is checked against the teacher-defined test case. Finally, a score is returned. All students' scores are saved in the backend and are easily accessible to the instructors. If at first they don't succeed, they can learn from their mistakes and try again.  (Yes, if you'd like, can set a maximum number of daily submissions to incentivize students to start early). This \"grader\" function can easily be used from any Jupyter notebook (even Google Colab), all you have to do is to <code>pip install penngrader</code>. See templates below.</p>\n<p>Ok, ok, you might be saying to yourself: \"That looks easy enough, but what about us TAs, we want something that simple too!\" Well, look no further. The TAs/Instructors' experience is just as seamless. All TAs will share a <strong>Teacher_Backend</strong> notebook, which contains all the test case functions. The logic of how testing is done is simple: whatever Python object gets passed through the <code>answer</code> field in the <code>grade(...)</code> function (see above) will be the input to the test case function (see below). In the above example, <code>addition_function</code> is passed as the answer to a test case named <code>\"test_case_1\"</code>. Therefore, the TAs will need to write a <code>test_case_1(addition_function)</code> function in the <strong>Teacher_Backend</strong> notebook, as follows:</p>\n<p><img alt=\"Sample Question\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/3829ac1b108b625c698b662352f3395d11b6c101/68747470733a2f2f70656e6e6772616465722d77696b692e73332e616d617a6f6e6177732e636f6d2f73616d706c655f7570646174652e676966\"></p>\n<p>As you can see, this function tests that <code>addition_function(1,2) == 3</code>, if correct it adds 5 points to the <code>student_score</code>. The test must then return an integer tuple <code>(student_score, max_score)</code>, which is what will be displayed to the student. As you can see this type of test function gives the Instructor complete flexibility on what to test and how much partial credit to give. Remember that the answer that gets passed to the test case could be anything... a function, a class, a DataFrame, a list, a picture... anything! The PennGrader automatically serializes it and all its dependencies and ships to AWS for grading.</p>\n<p>To create homework for your class you will need a course <code>SECRET_KEY</code>. We will open to the public soon, however for now contact me at <a href=\"mailto:leonardo.murri1995@gmail.com\">leonardo.murri1995@gmail.com</a> if you are interested in using the PennGrader for your class.</p>\n<p><a href=\"https://penngrader-wiki.s3.amazonaws.com/PennGrader_Homework_Template.ipynb\" rel=\"nofollow\">PennGrader_Homework_Template.ipynb</a></p>\n<p><a href=\"https://penngrader-wiki.s3.amazonaws.com/PennGrader_TeacherBackend.ipynb\" rel=\"nofollow\">PennGrader_TeacherBackend.ipynb</a></p>\n<p>Download these two notebooks and launch them via Jupyter. They will show you how to add grading cells in your homework notebook and add write/update test cases via the teacher backend, as well as view student's grades.</p>\n<h2>Behind the scenes...</h2>\n<p>In the following section, I will go into detail about the system implementation. Below is the system design overview we will go into.</p>\n<p><img alt=\"Architecture Design\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/5881362ae6bb808b5006deedb765812ef94e1978/68747470733a2f2f70656e6e6772616465722d77696b692e73332e616d617a6f6e6177732e636f6d2f64657369676e2e706e67\"></p>\n<h3>Clients</h3>\n<p>There are two pip installable clients, one for students and one for instructors. You can install these two clients by running <code>pip install penngrader</code> in your favorite terminal.  When creating a new homework download the <a href=\"https://penngrader-wiki.s3.amazonaws.com/PennGrader_Homework_Template.ipynb\" rel=\"nofollow\">Homework_Template.ipynb</a> and the <a href=\"https://penngrader-wiki.s3.amazonaws.com/PennGrader_TeacherBackend.ipynb\" rel=\"nofollow\">TeacherBackend.ipynb</a> notebooks and follow the instructions. More details are presented below.</p>\n<h4>Student's Client: PennGrader</h4>\n<p>The student's client will be embedded in the homework release notebook. Its main purpose will be to interface the student's homework with the AWS backend. This client is represented by the <code>PennGrader</code> class which needs to be initialized by the instructor when writing the homework as follows. Note: the HOMEWORK_ID needs to be filled in before releasing the notebook. The student should only enter his or her's student id.</p>\n<pre><code>import penngrader.grader\ngrader = PennGrader(homework_id = HOMEWORK_ID, student_id = STUDENT_ID)\n</code></pre>\n<p>The HOMEWORK_ID is the string obtained when creating new homework via the teacher backend, see below.</p>\n<p>STUDENT_ID is the student defined variable representing their 8-digit PennID. The student will need to run this cell at the beginning of the notebook to initialize the grader. After every question, the Instructor will also need to write a grading cell which the student will run to invoke the grader. A grading cell looks as follows:</p>\n<pre><code>grader.grade(test_case_id = TEST_CASE_NAME, answer = ANSWER) \n</code></pre>\n<p>TEST_CASE_NAME is the string name of the test case function that will grader the given question.</p>\n<p>ANSWER is the object that needs to be graded.</p>\n<p>For example, you might have a question where you instruct the student to create a DataFrame called <code>answer_df</code>. You will need to write <code>answer_df</code> as the input answer parameter of the grader function as follows:</p>\n<pre><code>grader.grade(test_case_id = TEST_CASE_NAME, answer = answer_df) \n</code></pre>\n<p>That way, when the student runs this cell, the grader will automatically find the test function named TEST_CASE_NAME, serialize the <code>answer_df</code> python variable and ship it to AWS. The cool thing about the PennGrader is that you can pass pretty much anything as the answer.</p>\n<h4>Teacher's Client: PennGraderBackend</h4>\n<p>The teacher client allows instructors to create and edit the test cases function mentioned earlier, as well as define multiple homework metadata parameters. As shown in the template notebooks linked above, you first need to initialize the <em>PennGraderBackend</em> for a specific homework as follows:</p>\n<pre><code>backend = PennGraderBackend(secret_key = SECRET_KEY, homework_number = HOMEWORK_NUMBER)\n</code></pre>\n<p>SECRET_KEY is the string variable obtained when creating a course.</p>\n<p>HOMEWORK_NUMBER identifies which homework number you are planning to write/edit.</p>\n<p>After running the above cell in a Jupyter Notebook, given a correct SECRET_KEY,  the assigned HOMEWORK_ID string will be printed out. This HOMEWORK_ID needs to be copied into the initialization of the PennGrader student client for release. Just the homework id, without the secret key, will not allow students to see any of the test cases, so make sure the secret key does not get out.</p>\n<p>After initialization, the  <code>backend</code> can be used to 1) update metadata 2) edit/write test cases.</p>\n<p>You can edit the following metadata parmaters by runnin the following code:</p>\n<pre><code>TOTAL_SCORE = 100\nDEADLINE = '2019-12-05 11:59 PM'\nMAX_DAILY_TEST_CASE_SUBMISSIONS = 100\n\nbackend.update_metadata(DEADLINE, TOTAL_SCORE, MAX_DAILY_TEST_CASE_SUBMISSIONS)\n</code></pre>\n<p><code>TOTAL_SCORE</code> represents the total number of points the homework is worth and should equal the sum of all test cases weights.</p>\n<p><code>DEADLINE</code> represents the deadline of the homework, with format: <em>YYYY-MM-DD HH:MM A</em>.</p>\n<p><code>MAX_DAILY_TEST_CASE_SUBMISSIONS</code> represents the number of allowed submissions per test case per day.</p>\n<p>Writing test cases is also just as simple. In a Jupyter Notebook (see Teacher Backend template above), you just need to write test case functions for each gradable question.  Each test case will be identified by a <em>test_case_id</em> which is the name of the test case function. A test case functions needs to follow the following format:</p>\n<pre><code>def test_case_name(answer_object_name):\n\tstudent_score = 0 # Current student score\n\tmax_score = 5 # Number of points this question is worth\n\n\t# some kind of grading that adds or subtracts from the student_score #\n\n\treturn (student_score, max_score)\n</code></pre>\n<p>The test case function needs to return an integer tuple representing the student score for their answer and max number of points that can be earned in the given question.</p>\n<p>After writing all the test cases you need, simply run the following code in a cell and the PennGraderBackend class will automatically extract all user-defined functions in the current notebook and upload them to AWS.</p>\n<pre><code>backend.update_test_cases()\n</code></pre>\n<p>A success message will print once the operation has succeeded. If loading a lot of external libraries this might take a few minutes.</p>\n<h3>Lambdas</h3>\n<h4>Grader</h4>\n<p>The <em>Grader</em> lambda gets triggered from an API Gateway URL from the student's PennGrader client. The student's client as defined above will serialize its answer and make a POST request to the lambda with the following body parameters:</p>\n<p><code>{'homework_id' : ______, 'student_id' : ________, 'test_case_id' : ________, 'answer' : _______ }</code></p>\n<p>The lambda will proceed by downloading the correct serialized <em>test_case</em>'s and <em>libraries</em> from the <em>HomeworksTestCases</em> DyanmoDB table. It will then deserialize these objects and extract the correct test case given the <em>test_case_id</em> . import the correct libraries used by given test case. If the submission is valid the student score will be recorded in the backend.</p>\n<h4>Grades</h4>\n<p>The grades lamabda interfaces the TeacherBackend and student notebook with the Gradebook. Using this API Gateway trigged lambda the TeacherBackend client can request all grades for a given homework. The payload body used to trigger this lambda will need to include</p>\n<p><code>{'homework_id' : ______, 'secret_key' : ________, 'request_type' : ________ }</code></p>\n<p>Where the <em>secret_key</em> parameter is optional and will allow a properly initialized TeacherBackend to download all grades for the selected homework. Students will also be able to view their scores.</p>\n<h4>HomeworkConfig</h4>\n<p>The <em>HomeworkConfig</em>  lambda interfaces the TeacherBackend with the <em>HomeworkTestCases</em> and <em>HomeworkMetadata</em> DynamoDB Tables (see below for table schema). This lambda can be triggered in two ways 1) to update metadata and 2) to update test cases. After unparsing and deserializing the triggered payload, the inputted data gets written into the appropriate DynamoDB table.</p>\n<h3>DynamoDB Tables &amp; S3 Buckets</h3>\n<p>As shown in the above schematic we maintain the majority of the data needed for grading and grade storage on DynamoDB. Below we list the information recorded in each table.</p>\n<p><strong>Classes DynamoDB Table</strong></p>\n<p><em>Classes</em> contains information about all courses currently registered for the PennGrader. The grading protocol is on a per-class basis. Each class that wants to create a course that uses the PennGrader will receive <code>SECRET_KEY</code>, this secret key will be passed in the TeacherBackend client to allow instructors to edit test cases. The tables contain the following schema:</p>\n<p><code>secret_key</code> : Unique UUID used as a secret identifier for a course.</p>\n<p><code>course_id</code>  : Human-readable identifier representing the course number and semester of the class offered i.e. 'CIS545_Spring_2019'. This ID will be the pre-fix of the <code>homework_id</code>, which will be used to identify a homework assignment.</p>\n<p><strong>HomeworksMetadata DynamoDB Table</strong></p>\n<p>The <em>HomeworksMetadata</em> is used to maintain updatable information about a specific homework. The information in this table will be editable from the TeacherBackend even after homework release. The tables contain the following schema:</p>\n<p><code>homework_id</code> : Unique identifier representing a course + homework number pair. <em>homeowork_id</em> is constructed by taking the <em>course_id</em> defined above and appending the homework number of the assignment in question. For example, given the course id defined above (CIS545_Spring_2019), the <em>homework_id</em> for the first homework will be 'CIS545_Spring_2019_HW1'. This homework_id will be passed into the PennGrader Grader class in the student's homework notebook and will be used to correctly find the correct test cases and store the student scores correctly.</p>\n<p><code>deadline</code> : String representing the deadline of the homework in local time i.e. 2019-12-05 11:59 PM (format: YYYY-MM-DD HH:MM A)</p>\n<p><code>max_daily_submissions</code> : Number representing the total number of submissions allows per test case per day. For example, if this number is set to 5, it means that all students can submit an answer to a specific test case 5 times a day. Resetting at midnight.</p>\n<p><code>max_score</code> : The total number of points this homework is worth. This number should be equal to the sum of all test case weights. <em>max_score</em> is used to show students how many points they have earned out of the total assignment.</p>\n<p><strong>HomeworksTestCases DynamoDB Table</strong></p>\n<p>The <em>HomeworksTestCases</em> table contains a serialized encoding of the test cases and libraries imports needed to run a student's answer. The tables contain the following schema:</p>\n<p><code>homework_id</code> : Same <em>homework_id</em> from the <em>HomeworksMetadata</em> table.</p>\n<p><code>test_cases</code> : This field contains a dill UTF-8 string serialization of the test cases defined in the teacher backend. The teacher backend extracts all test case functions from the notebook and creates a dictionary of <em>name</em> -&gt; <em>function</em>. This parameter is deserialized when a new grading request is made and the correct test case is extracted and ran.</p>\n<p><code>libraries</code> : Similar to the <em>test_cases</em> field, the libraries are UTF-8 dill serialized list of tuples that contain all libraries and functions imported in the teacher backend notebook and their appropriate short name. This list is used to import all needed libraries to run a specific test case.</p>\n<p><strong>Gradebook DynamoDB Table</strong></p>\n<p>The <em>Gradebook</em> table contains all grading submissions and student scores. The table contains the following schema:</p>\n<p><code>homework_id</code> : Same <em>homework_id</em> from the <em>HomeworksMetadata</em> table.</p>\n<p><code>student_submission_id</code> : String representing a student submission. This string is create by appending the student's PennID to the test case name i.e. '12345678_test_case_1'.</p>\n<p><code>max_score</code> : Maximum points that can be earned for this test case</p>\n<p><code>student_score</code> : Points earned by the student on this test case.</p>\n<p>Note: Currently only the last submission is recorded, thus the latest student score will overwrite all previous scores.</p>\n\n          </div>"}, "last_serial": 6497392, "releases": {"0.1": [{"comment_text": "", "digests": {"md5": "1c85890be90b494f7002d60ba011210b", "sha256": "429cbaf7d1accaa30f4f9ace2b753993518ead592cc2a94aef0eb599e1f0f464"}, "downloads": -1, "filename": "penngrader-0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "1c85890be90b494f7002d60ba011210b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 5433, "upload_time": "2019-12-01T15:30:24", "upload_time_iso_8601": "2019-12-01T15:30:24.432486Z", "url": "https://files.pythonhosted.org/packages/59/fe/2137144e826a8a2634e12e9b9dd595ba7b24e5e1bcf919a357e69530b5d9/penngrader-0.1-py3-none-any.whl", "yanked": false}], "0.2": [{"comment_text": "", "digests": {"md5": "88cbbc459fb04fa23aee51e126e232cd", "sha256": "01772f8c4dcbeca2c78a85906ebdd1a9ba4cc76b9e29289dc61008e00bc0bede"}, "downloads": -1, "filename": "penngrader-0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "88cbbc459fb04fa23aee51e126e232cd", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 5435, "upload_time": "2019-12-01T15:38:50", "upload_time_iso_8601": "2019-12-01T15:38:50.016909Z", "url": "https://files.pythonhosted.org/packages/19/7d/1a8bd8ba666ae7b4cec257688578b5686f1ae5e6eb833b154bb9b8801f04/penngrader-0.2-py3-none-any.whl", "yanked": false}], "0.2.1": [{"comment_text": "", "digests": {"md5": "9913849e11905b474d7f171b75d69d84", "sha256": "459c3de8ab6e83a86101dde232f55df9e02af4ef0726709bf00326ca46fe9ba8"}, "downloads": -1, "filename": "penngrader-0.2.1-py3-none-any.whl", "has_sig": false, "md5_digest": "9913849e11905b474d7f171b75d69d84", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 5613, "upload_time": "2019-12-01T15:44:20", "upload_time_iso_8601": "2019-12-01T15:44:20.577575Z", "url": "https://files.pythonhosted.org/packages/29/85/eae50e9bfef1b5ae475f9fb38ac0806a22910c6e427f6eb94cf7ed594b4d/penngrader-0.2.1-py3-none-any.whl", "yanked": false}], "0.2.2": [{"comment_text": "", "digests": {"md5": "f3bb5ad98441bc56351fd3fb9f54fcbf", "sha256": "1ed7becca19d90d62a93b5504a419ae332f3f2883c4bb36cf244a396cdc1735e"}, "downloads": -1, "filename": "penngrader-0.2.2-py3-none-any.whl", "has_sig": false, "md5_digest": "f3bb5ad98441bc56351fd3fb9f54fcbf", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 7664, "upload_time": "2019-12-01T15:50:42", "upload_time_iso_8601": "2019-12-01T15:50:42.098400Z", "url": "https://files.pythonhosted.org/packages/46/cd/827aeb1fcaef655a0d9716dd628a72e12cc141cbbc2d85213fe81b3a3385/penngrader-0.2.2-py3-none-any.whl", "yanked": false}], "0.2.3": [{"comment_text": "", "digests": {"md5": "4552f393e3fe076686e86b3499faa234", "sha256": "16243fec60ef91b37192e61c10dd417717435d3d4cc37906e7363d3429f786fc"}, "downloads": -1, "filename": "penngrader-0.2.3-py3-none-any.whl", "has_sig": false, "md5_digest": "4552f393e3fe076686e86b3499faa234", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 7674, "upload_time": "2019-12-01T17:41:37", "upload_time_iso_8601": "2019-12-01T17:41:37.853399Z", "url": "https://files.pythonhosted.org/packages/8a/f3/d64607345118119bb0473ea23f8a4085a4c9602fbe213383405efa4428af/penngrader-0.2.3-py3-none-any.whl", "yanked": false}], "0.2.4": [{"comment_text": "", "digests": {"md5": "91c094e9af58195f330314491fecdcc2", "sha256": "d54ead69c2ae103452f341d52d11d8501843d8fdc2c9f5c304e7557039961819"}, "downloads": -1, "filename": "penngrader-0.2.4-py3-none-any.whl", "has_sig": false, "md5_digest": "91c094e9af58195f330314491fecdcc2", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 7674, "upload_time": "2019-12-01T17:45:18", "upload_time_iso_8601": "2019-12-01T17:45:18.656944Z", "url": "https://files.pythonhosted.org/packages/a7/03/1b84ea86105f9594bb982d7ff18e6c57b7c3be0e935f091b13822ba69673/penngrader-0.2.4-py3-none-any.whl", "yanked": false}], "0.2.5": [{"comment_text": "", "digests": {"md5": "4fb0e9d48b97fde93a896fc85b0a9e61", "sha256": "590b7f309420c817b606a5e704fc93aa6d44b00c4a915d1ef3a65d938477549d"}, "downloads": -1, "filename": "penngrader-0.2.5-py2-none-any.whl", "has_sig": false, "md5_digest": "4fb0e9d48b97fde93a896fc85b0a9e61", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 7667, "upload_time": "2019-12-03T16:53:52", "upload_time_iso_8601": "2019-12-03T16:53:52.401289Z", "url": "https://files.pythonhosted.org/packages/e2/59/432ba2fd63266f0f254949767ed4a30f7467ee77db8ed30a7d81b8f51bd4/penngrader-0.2.5-py2-none-any.whl", "yanked": false}], "0.2.6": [{"comment_text": "", "digests": {"md5": "365ccc3856571e6b7c6af0aa76b3c6d6", "sha256": "f8149d724f3edd7d91fb47e4bb2cabb4e9e4cad97bfcfdc6437e983c69103edd"}, "downloads": -1, "filename": "penngrader-0.2.6-py2-none-any.whl", "has_sig": false, "md5_digest": "365ccc3856571e6b7c6af0aa76b3c6d6", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 5657, "upload_time": "2019-12-04T15:15:41", "upload_time_iso_8601": "2019-12-04T15:15:41.624729Z", "url": "https://files.pythonhosted.org/packages/f3/42/27634c4bf8e3299b4d343cb5b0823628c864cc399fec5dce6b93b40c5c41/penngrader-0.2.6-py2-none-any.whl", "yanked": false}], "0.3.0": [{"comment_text": "", "digests": {"md5": "d63504047ce1043e7055b82a0f467d66", "sha256": "99577653c58c6d53cd302d317f262c022f1e188d24a97bbebaa3fe56f0ec9570"}, "downloads": -1, "filename": "penngrader-0.3.0-py3-none-any.whl", "has_sig": false, "md5_digest": "d63504047ce1043e7055b82a0f467d66", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 10344, "upload_time": "2019-12-07T22:05:15", "upload_time_iso_8601": "2019-12-07T22:05:15.434029Z", "url": "https://files.pythonhosted.org/packages/12/a0/727686e72d3a996f8d6f60433ef7dc156168b94d05ab8a32cb89521ca8a5/penngrader-0.3.0-py3-none-any.whl", "yanked": false}], "0.3.1": [{"comment_text": "", "digests": {"md5": "9927b19135c147bd6284cba86e065c54", "sha256": "e01ce772022a14599b21ec11f3b36d198824fc013262a4e693f0de3339141abb"}, "downloads": -1, "filename": "penngrader-0.3.1-py3-none-any.whl", "has_sig": false, "md5_digest": "9927b19135c147bd6284cba86e065c54", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 10386, "upload_time": "2019-12-07T23:02:03", "upload_time_iso_8601": "2019-12-07T23:02:03.561668Z", "url": "https://files.pythonhosted.org/packages/e4/42/51924b4d240721c2b1a19bc8b92962af19914e4e290691652315c9970e7e/penngrader-0.3.1-py3-none-any.whl", "yanked": false}], "0.3.2": [{"comment_text": "", "digests": {"md5": "95cc4f0b64c9f5f4aad57f436dc555ce", "sha256": "b13afc63114e084428063ba7a62d58813db6c8f97629be504559209d959362d0"}, "downloads": -1, "filename": "penngrader-0.3.2-py3-none-any.whl", "has_sig": false, "md5_digest": "95cc4f0b64c9f5f4aad57f436dc555ce", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 13836, "upload_time": "2020-01-02T15:35:52", "upload_time_iso_8601": "2020-01-02T15:35:52.475746Z", "url": "https://files.pythonhosted.org/packages/c6/59/8006dbaaecd839495ed3924c60ce8a61d1aa6657202ce8e50ae9d13c060d/penngrader-0.3.2-py3-none-any.whl", "yanked": false}], "0.4": [{"comment_text": "", "digests": {"md5": "fd87c4342678f6bc6b203d4e76b0d77c", "sha256": "c48d760dfd821c1a99386f7a67190e0c20dcf739b51164b6fa4ca41f1d224f8a"}, "downloads": -1, "filename": "penngrader-0.4-py3-none-any.whl", "has_sig": false, "md5_digest": "fd87c4342678f6bc6b203d4e76b0d77c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 13381, "upload_time": "2020-01-21T23:12:50", "upload_time_iso_8601": "2020-01-21T23:12:50.105309Z", "url": "https://files.pythonhosted.org/packages/f2/75/07b110a3bf5a5b1d6119fe1cbd970398c3136a3580c1b6461eab4b14d8f6/penngrader-0.4-py3-none-any.whl", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "fd87c4342678f6bc6b203d4e76b0d77c", "sha256": "c48d760dfd821c1a99386f7a67190e0c20dcf739b51164b6fa4ca41f1d224f8a"}, "downloads": -1, "filename": "penngrader-0.4-py3-none-any.whl", "has_sig": false, "md5_digest": "fd87c4342678f6bc6b203d4e76b0d77c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 13381, "upload_time": "2020-01-21T23:12:50", "upload_time_iso_8601": "2020-01-21T23:12:50.105309Z", "url": "https://files.pythonhosted.org/packages/f2/75/07b110a3bf5a5b1d6119fe1cbd970398c3136a3580c1b6461eab4b14d8f6/penngrader-0.4-py3-none-any.whl", "yanked": false}], "timestamp": "Fri May  8 02:56:31 2020"}