{"info": {"author": "Renato Fabbri", "author_email": "listamacambira@googlegroups.com", "bugtrack_url": null, "classifiers": ["Development Status :: 2 - Pre-Alpha", "Intended Audience :: Developers", "Intended Audience :: Education", "Intended Audience :: Other Audience", "Intended Audience :: Religion", "Intended Audience :: Science/Research", "Intended Audience :: Telecommunications Industry", "License :: OSI Approved :: MIT License", "Programming Language :: Python :: 3", "Topic :: Artistic Software", "Topic :: Multimedia :: Graphics :: Presentation", "Topic :: Multimedia :: Sound/Audio :: Editors", "Topic :: Multimedia :: Sound/Audio :: Mixers", "Topic :: Multimedia :: Sound/Audio :: Sound Synthesis", "Topic :: Multimedia :: Sound/Audio :: Speech", "Topic :: Multimedia :: Video :: Display", "Topic :: Other/Nonlisted Topic", "Topic :: Scientific/Engineering :: Information Analysis", "Topic :: Scientific/Engineering :: Physics", "Topic :: Scientific/Engineering :: Visualization", "Topic :: Text Processing", "Topic :: Text Processing :: Linguistic"], "description": "# percolation\nthe percolation python package for harnessing open linked social data\n\n## install with:\nIf you are running Ubuntu, you may want to install pygraphviz from standard (apt) package manager.\n\n    $ pip install percolation\nor\n    $ python setup.py install\nFor greater control of customization (and debugging), clone the repo and install with pip with -e:\n    $ git clone https://github.com/ttm/percolation.git\n    $ pip install -e <path_to_repo>\nThis install method is especially useful when reloading modified module in subsequent runs of percolation\n(usually with the standard importlib).\n\nPercolation may use social, music and visuals packages to enable anthropological physics experiments and social harnessing:\n- https://github.com/ttm/social\n- https://github.com/ttm/music\n- https://github.com/ttm/visuals\n\n\n## core features\n  - Provide routines for percolation in social systems by experiments and processes.\n  - Ease knowledge about the networked self.\n  - Analyses of social systems through textual, topological, temporal statistics within a typology framework of agents and networks.\n  - Art and games from social structures, such as music and animation.\n  - Integration of resources through RDF data and OWL ontologies.\n  - Cross provenance resource recommendation, extending facilities from the Participation package.\n  - WWW integration to provide data and media.\n\n## coding conventions\nA function name has a verb if it changes state of initialized objects, if it only \"returns something\", it is has no verb in name.\nThis rule is extended for the cases where instead of return triples, they are added to the percolation\\_graph.\n\nClasses, functions and variables are writen in CamelCase, headlessCamelCase and lowercase, respectively.\nUnderline is used only in variable names where the words in variable name make something unreadable (usually because the resulting name is big).\n\nThe code is the documentation. Code should be very readable to avoid writing unnecessary documentation and duplicating routine representations. This adds up to using docstrings to give context to the objects or omitting the docstrings.\n\nTasks might have c(\"some status message\") which are printed with time interval in seconds between P.check calls.\nThese messages are turned of by setting P.QUIET=True or calling P.silence() which just sets P.QUIET=True\n\nThe usual variables in scripts are: P for percolation, NS for P.rdf.NS for namespace, a for NS.rdf.type, c for P.utils.check, S for social, M for music, V for visuals, n for numpy, p for pylab, r for rdflib, x for networkx\n\nThe file cureimport.py in newtests avoids cluttering the header of the percolation file while hacking framework. In using the Python interpreter, subsequent runs of scripts don't reload or raise error with importlib if the prior error was on load. Just load it first: import cureimport, percolation as P, etc.\n\nThe variable P.percolation\\_graph is a ConjunctiveGraph with all execution state information metadata and translates and with each variable value as value, a bag (unordered, e.g. word sizes) or a collection (ordered, principal components, etc).\n\nEvery feature should be related to at least one legacy/ outline.\n\nRoutines should be oriented towards making or navigating percolation graph paths directly or through numeric computation and rendering of new triples in Open Linked Social Data and external resources such as the DBpedia sparql endpoint: http://dbpedia.org/sparql\n\n### package structure\nData and metadata is in the P.percolation\\_graph=rdflib.ConjunctiveGraph()\nwhich is persistent across runs in the system and is initialized by bootstrap.py\nand developed by user with rdf or automatically while other percolation tasks are run.\nThe statistics module have routines for obtaining statistics from data, which are applied\nto data in measures.\nThe analyses module make (qualitative) assertions about the measures in social structures.\nThe utils eases file navigation and sharing in local system and web, percolation status register and small features that fit nowhere else.\nThe help module have some directions on percolation usage while legacy module have diverse usage outlines.\n\n#### the modules are: \nbootstrap.py for PercolationServer and the canonic startup\n\nlegacy/\\* for standard usage outlines, analyses and media rendering from legacy data (Open Linked Open Data)\n- harnessing/\\*.py for percolative procedures (e.g. experiments), resource recommendation, self-knowledge and information collection and diffusion.\n- mediaRendering/ for general output of media (music.py, image.py, animation.py, table.py, game.py).\n- rdf \n- analyses/\\*.py for canonical percolation analysis of structures, results in assertions and data endorsements\n- measures/\\*.py for measurement routines, data structures and values from initial data\n- triples/\\*.py triples with information about files and notes\n  - datasets.py for triples on the datasets of open linked social data with local and remote filenames\n  - linksets.py for triples that link datasets (e.g. irc:Participant#hybrid po:sameAs fb:Participant#renato.fabbri)\n  - enrichments.py for hand notes and other structures for enrichment of the percolation status (be traslated to rdf)\n  - notes.py for hand notes and other structures for enrichment of the percolation status (be traslated to rdf)\n  - software.py for triples of software and ontologies pertinent to percolation environment\n\nrdf/\\* for rdf data managing\n- ontology.py triples and organization of the participation ontology (po), an umbrella ontology\n- reasoning.py reasoning on specific rdfs and owl rules to enhance performance and benchmarking among approaches\n- rdflib.py facilities for rdflib graph manipulation\n- sparql.py facilities for querying and connecting through sparql\n\nstatistics/\\* for computing statistics appropriated to Open Linked Social Data\n- kolmogorv\\_smirnov.py for obtaining KS distance and c statistics\n- unit\\_root\\_test.py for e.g. the augmented Dickey–Fuller test\n- pca.py for correlation and principal component analysis\n- outliers.py for the detection of outliers in data\n- circular.py for circular statistics\n- localization.py for mean, standard deviation, skewness and kurtosis\n- grouping/\\*.py for obtaining meaningful groups of entities through Erdos sectorialization, k-means, k-nn, Kohonen, genetic algorithms, etc.\n\nmeasures/\\* for taking measures of social structures. It takes data and produces more informative data which is used in the analyses\n- text/\\*.py for taking measures from chars, tokens, sentences, paragraphs of a single text\n- topology/\\*.py for making networks and taking topological measures from a single structure\n- time/\\*.py for taking circular measures of \n- integrated/\\*.py \n  - pca.py for application of principal component analysis to grouped entities and appropriated data\n  - power\\_law.py for measures about the optimum fit of the power-law \n  - kolmogorov\\_smirnov.py for KS-distance and c statistics between the grouped entities.\n- multi/\\* for measures of multiple structures\n  - grouping.py for obtaining meaningful groups of entities. Basic grouping of texts is the message, basic grouping for topology and time is the participant. The topmost grouping is the snapshot or collection of snapshots.\n  - scale.py for measures in multiple scales (e.g. snapshots, snapshot, sector, user, message)\n  - timeline.py for timeline sequences of structures, make unit root test and pca averages and stds\n  - scale\\_timeline.py for multiple scale timelines, find best fit for power-law and \n\nanalysis/\\* for deriving assertions from social structures (e.g. mean(token size) above mean of OLSD legacy. Same file tree as measures\n\nutils/\\*.py\n  - general.py for general purpose utilities that fit nowhere else, e.g. randomNick\n  - status.py for \n  - file.py for navigating and modifying file structure\n  - web/\\* for integration to the WWW\n\nhelp/\\* for helper routines (e.g. wizard or steps to make something)\n\n## usage example\n```python\nimport percolation as P\n\nP.start() # starts percolation server and session with metadata about open linked social data\nP.analyse() # take measures and deliver assertions\nP.legacy.media_rendering.render() # make tables, music and animation\nP.web() # start server to make data and media accessible in the Web\n```\n\n## further information\nThe percolation package is a work in progress.\n\n### notes\nIn the integrated measures, see if networks that have peculiar distribution of measures in Erdos sectors also have smaller KS-distance between histograms of degrees and other topological measures. Generalizing, see if structures with an outlier of a measure (or set of measures) is correlated with other measures characteristics, such as the correlation histogram.\n\nAre there benchmark datasets and results for the statistics used in percolation? If so, integrate them into legacy.statistics.tests.\nOtherwise, make benchmarks from synthesized and empirical data.\n\nPercolation makes use of other packages designed for percolation for direct use or through the rendered RDF they deliver.\nThese are:\n- The social package for rendering RDF data from social networking platforms and protocols (e.g. facebook, twitter, irc, instagram, noosfero, diaspora)\n- The gmane package for rendering RDF data from public Gmane email lists (e.g. apache, c++ stdlib)\n- The participation package for rendering RDF data from social participation platforms (e.g. participabr, cidade democratica, aa)\n- The scientific package (ToDo) for rendering RDF data from scientific resources such as FAPESP\n- The music package to render music from open linked social data\n- The visuals package to render images and movies from open linked social data\n\nSee legacy.triples for further notes.\n\nSee percolationLegacy issues at: https://github.com/ttm/percolationLegacy/issues\n\nSee this deprecated document for some of the intended goals:\nhttps://github.com/ttm/percolationlegacy/blob/master/latex/percolation-article.pdf", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/ttm/percolation", "keywords": "complexity networks human interaction physics data text mining analysis visualization music physics synthesis toolbox semantic web linked data owl ontology social participation anthropological physics", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "percolation", "package_url": "https://pypi.org/project/percolation/", "platform": "", "project_url": "https://pypi.org/project/percolation/", "project_urls": {"Homepage": "https://github.com/ttm/percolation"}, "release_url": "https://pypi.org/project/percolation/0.2.dev0/", "requires_dist": null, "requires_python": "", "summary": "percolation is a python package for harnessing open linked social data", "version": "0.2.dev0", "yanked": false, "html_description": "<div class=\"project-description\">\n            # percolation<br>the percolation python package for harnessing open linked social data<br><br>## install with:<br>If you are running Ubuntu, you may want to install pygraphviz from standard (apt) package manager.<br><br>    $ pip install percolation<br>or<br>    $ python setup.py install<br>For greater control of customization (and debugging), clone the repo and install with pip with -e:<br>    $ git clone https://github.com/ttm/percolation.git<br>    $ pip install -e &lt;path_to_repo&gt;<br>This install method is especially useful when reloading modified module in subsequent runs of percolation<br>(usually with the standard importlib).<br><br>Percolation may use social, music and visuals packages to enable anthropological physics experiments and social harnessing:<br>- https://github.com/ttm/social<br>- https://github.com/ttm/music<br>- https://github.com/ttm/visuals<br><br><br>## core features<br>  - Provide routines for percolation in social systems by experiments and processes.<br>  - Ease knowledge about the networked self.<br>  - Analyses of social systems through textual, topological, temporal statistics within a typology framework of agents and networks.<br>  - Art and games from social structures, such as music and animation.<br>  - Integration of resources through RDF data and OWL ontologies.<br>  - Cross provenance resource recommendation, extending facilities from the Participation package.<br>  - WWW integration to provide data and media.<br><br>## coding conventions<br>A function name has a verb if it changes state of initialized objects, if it only \"returns something\", it is has no verb in name.<br>This rule is extended for the cases where instead of return triples, they are added to the percolation\\_graph.<br><br>Classes, functions and variables are writen in CamelCase, headlessCamelCase and lowercase, respectively.<br>Underline is used only in variable names where the words in variable name make something unreadable (usually because the resulting name is big).<br><br>The code is the documentation. Code should be very readable to avoid writing unnecessary documentation and duplicating routine representations. This adds up to using docstrings to give context to the objects or omitting the docstrings.<br><br>Tasks might have c(\"some status message\") which are printed with time interval in seconds between P.check calls.<br>These messages are turned of by setting P.QUIET=True or calling P.silence() which just sets P.QUIET=True<br><br>The usual variables in scripts are: P for percolation, NS for P.rdf.NS for namespace, a for NS.rdf.type, c for P.utils.check, S for social, M for music, V for visuals, n for numpy, p for pylab, r for rdflib, x for networkx<br><br>The file cureimport.py in newtests avoids cluttering the header of the percolation file while hacking framework. In using the Python interpreter, subsequent runs of scripts don't reload or raise error with importlib if the prior error was on load. Just load it first: import cureimport, percolation as P, etc.<br><br>The variable P.percolation\\_graph is a ConjunctiveGraph with all execution state information metadata and translates and with each variable value as value, a bag (unordered, e.g. word sizes) or a collection (ordered, principal components, etc).<br><br>Every feature should be related to at least one legacy/ outline.<br><br>Routines should be oriented towards making or navigating percolation graph paths directly or through numeric computation and rendering of new triples in Open Linked Social Data and external resources such as the DBpedia sparql endpoint: http://dbpedia.org/sparql<br><br>### package structure<br>Data and metadata is in the P.percolation\\_graph=rdflib.ConjunctiveGraph()<br>which is persistent across runs in the system and is initialized by bootstrap.py<br>and developed by user with rdf or automatically while other percolation tasks are run.<br>The statistics module have routines for obtaining statistics from data, which are applied<br>to data in measures.<br>The analyses module make (qualitative) assertions about the measures in social structures.<br>The utils eases file navigation and sharing in local system and web, percolation status register and small features that fit nowhere else.<br>The help module have some directions on percolation usage while legacy module have diverse usage outlines.<br><br>#### the modules are: <br>bootstrap.py for PercolationServer and the canonic startup<br><br>legacy/\\* for standard usage outlines, analyses and media rendering from legacy data (Open Linked Open Data)<br>- harnessing/\\*.py for percolative procedures (e.g. experiments), resource recommendation, self-knowledge and information collection and diffusion.<br>- mediaRendering/ for general output of media (music.py, image.py, animation.py, table.py, game.py).<br>- rdf <br>- analyses/\\*.py for canonical percolation analysis of structures, results in assertions and data endorsements<br>- measures/\\*.py for measurement routines, data structures and values from initial data<br>- triples/\\*.py triples with information about files and notes<br>  - datasets.py for triples on the datasets of open linked social data with local and remote filenames<br>  - linksets.py for triples that link datasets (e.g. irc:Participant#hybrid po:sameAs fb:Participant#renato.fabbri)<br>  - enrichments.py for hand notes and other structures for enrichment of the percolation status (be traslated to rdf)<br>  - notes.py for hand notes and other structures for enrichment of the percolation status (be traslated to rdf)<br>  - software.py for triples of software and ontologies pertinent to percolation environment<br><br>rdf/\\* for rdf data managing<br>- ontology.py triples and organization of the participation ontology (po), an umbrella ontology<br>- reasoning.py reasoning on specific rdfs and owl rules to enhance performance and benchmarking among approaches<br>- rdflib.py facilities for rdflib graph manipulation<br>- sparql.py facilities for querying and connecting through sparql<br><br>statistics/\\* for computing statistics appropriated to Open Linked Social Data<br>- kolmogorv\\_smirnov.py for obtaining KS distance and c statistics<br>- unit\\_root\\_test.py for e.g. the augmented Dickey–Fuller test<br>- pca.py for correlation and principal component analysis<br>- outliers.py for the detection of outliers in data<br>- circular.py for circular statistics<br>- localization.py for mean, standard deviation, skewness and kurtosis<br>- grouping/\\*.py for obtaining meaningful groups of entities through Erdos sectorialization, k-means, k-nn, Kohonen, genetic algorithms, etc.<br><br>measures/\\* for taking measures of social structures. It takes data and produces more informative data which is used in the analyses<br>- text/\\*.py for taking measures from chars, tokens, sentences, paragraphs of a single text<br>- topology/\\*.py for making networks and taking topological measures from a single structure<br>- time/\\*.py for taking circular measures of <br>- integrated/\\*.py <br>  - pca.py for application of principal component analysis to grouped entities and appropriated data<br>  - power\\_law.py for measures about the optimum fit of the power-law <br>  - kolmogorov\\_smirnov.py for KS-distance and c statistics between the grouped entities.<br>- multi/\\* for measures of multiple structures<br>  - grouping.py for obtaining meaningful groups of entities. Basic grouping of texts is the message, basic grouping for topology and time is the participant. The topmost grouping is the snapshot or collection of snapshots.<br>  - scale.py for measures in multiple scales (e.g. snapshots, snapshot, sector, user, message)<br>  - timeline.py for timeline sequences of structures, make unit root test and pca averages and stds<br>  - scale\\_timeline.py for multiple scale timelines, find best fit for power-law and <br><br>analysis/\\* for deriving assertions from social structures (e.g. mean(token size) above mean of OLSD legacy. Same file tree as measures<br><br>utils/\\*.py<br>  - general.py for general purpose utilities that fit nowhere else, e.g. randomNick<br>  - status.py for <br>  - file.py for navigating and modifying file structure<br>  - web/\\* for integration to the WWW<br><br>help/\\* for helper routines (e.g. wizard or steps to make something)<br><br>## usage example<br>```python<br>import percolation as P<br><br>P.start() # starts percolation server and session with metadata about open linked social data<br>P.analyse() # take measures and deliver assertions<br>P.legacy.media_rendering.render() # make tables, music and animation<br>P.web() # start server to make data and media accessible in the Web<br>```<br><br>## further information<br>The percolation package is a work in progress.<br><br>### notes<br>In the integrated measures, see if networks that have peculiar distribution of measures in Erdos sectors also have smaller KS-distance between histograms of degrees and other topological measures. Generalizing, see if structures with an outlier of a measure (or set of measures) is correlated with other measures characteristics, such as the correlation histogram.<br><br>Are there benchmark datasets and results for the statistics used in percolation? If so, integrate them into legacy.statistics.tests.<br>Otherwise, make benchmarks from synthesized and empirical data.<br><br>Percolation makes use of other packages designed for percolation for direct use or through the rendered RDF they deliver.<br>These are:<br>- The social package for rendering RDF data from social networking platforms and protocols (e.g. facebook, twitter, irc, instagram, noosfero, diaspora)<br>- The gmane package for rendering RDF data from public Gmane email lists (e.g. apache, c++ stdlib)<br>- The participation package for rendering RDF data from social participation platforms (e.g. participabr, cidade democratica, aa)<br>- The scientific package (ToDo) for rendering RDF data from scientific resources such as FAPESP<br>- The music package to render music from open linked social data<br>- The visuals package to render images and movies from open linked social data<br><br>See legacy.triples for further notes.<br><br>See percolationLegacy issues at: https://github.com/ttm/percolationLegacy/issues<br><br>See this deprecated document for some of the intended goals:<br>https://github.com/ttm/percolationlegacy/blob/master/latex/percolation-article.pdf\n          </div>"}, "last_serial": 5214283, "releases": {"0.1.dev1": [{"comment_text": "", "digests": {"md5": "a2e1c85a06de942164de1ac33aa4be3d", "sha256": "c13458f1804e190ce19a17485cba3973210c65c75ab20af65e9e67b6115b59d6"}, "downloads": -1, "filename": "percolation-0.1.dev1.tar.gz", "has_sig": false, "md5_digest": "a2e1c85a06de942164de1ac33aa4be3d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3365, "upload_time": "2015-03-29T17:42:50", "upload_time_iso_8601": "2015-03-29T17:42:50.082557Z", "url": "https://files.pythonhosted.org/packages/57/a9/b1b812ec051a021065e1c448e9d8abf1b47e535494c1358df94fd15c1111/percolation-0.1.dev1.tar.gz", "yanked": false}], "0.2.dev0": [{"comment_text": "", "digests": {"md5": "802c7d944ab41245fbca904073ec2c9f", "sha256": "7bf347a4bbbdf40da43ee68ba414c0b363f86a12bc3a72cc4a2572d97ad4c7d0"}, "downloads": -1, "filename": "percolation-0.2.dev0.tar.gz", "has_sig": false, "md5_digest": "802c7d944ab41245fbca904073ec2c9f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 70387, "upload_time": "2019-05-01T21:04:37", "upload_time_iso_8601": "2019-05-01T21:04:37.153417Z", "url": "https://files.pythonhosted.org/packages/f8/19/b26b8fd8d98204a5d6b4003dbf25e97ff8da054b0037aec44ef0cb244f4f/percolation-0.2.dev0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "802c7d944ab41245fbca904073ec2c9f", "sha256": "7bf347a4bbbdf40da43ee68ba414c0b363f86a12bc3a72cc4a2572d97ad4c7d0"}, "downloads": -1, "filename": "percolation-0.2.dev0.tar.gz", "has_sig": false, "md5_digest": "802c7d944ab41245fbca904073ec2c9f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 70387, "upload_time": "2019-05-01T21:04:37", "upload_time_iso_8601": "2019-05-01T21:04:37.153417Z", "url": "https://files.pythonhosted.org/packages/f8/19/b26b8fd8d98204a5d6b4003dbf25e97ff8da054b0037aec44ef0cb244f4f/percolation-0.2.dev0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:56:21 2020"}