{"info": {"author": "Jolle Jolles", "author_email": "j.w.jolles@gmail.com", "bugtrack_url": null, "classifiers": ["Intended Audience :: Science/Research", "License :: OSI Approved :: Apache Software License", "Operating System :: MacOS", "Operating System :: POSIX", "Operating System :: Unix", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Topic :: Multimedia :: Video", "Topic :: Scientific/Engineering :: Image Recognition", "Topic :: Scientific/Engineering :: Information Analysis", "Topic :: Scientific/Engineering :: Visualization"], "description": "[![PyPI version](https://badge.fury.io/py/pirecorder.svg)](https://badge.fury.io/py/pirecorder) [![DOI](https://zenodo.org/badge/DOI/10.5281/zenodo.2529515.svg)](https://doi.org/10.5281/zenodo.2529515)\n\n# pirecorder\n**A python module for controlled and automated image and video recording with the raspberry pi**\n\n*pirecorder* is a package to facilitate controlled and automated image and video recording for the Raspberry Pi (rpi), specifically developed with the Behavioural Scientist in mind.\n\n<p align=\"center\"><img src=\"https://github.com/JolleJolles/pirecorder/blob/master/images/pirecorder-logo.jpg\"></p>\n\n*pirecorder* consists of a main `PiRecorder` class and a number of additional [submodules](#submodules) that facilitate setting up the Raspberry Pi camera, configuring the camera, scheduling future recordings, and converting recorded media. It helps get optimal recording settings and stores these such that they can be easily updated by the user via python or a text file. Subsequently, these settings can be used to make standardised recordings by user command or via a user-set schedule of recordings.\n\n*pirecorder* is build to make controlled and automated recordings as simple as possible. It is fully usable by simple terminal commands without needing to go into python (via `calibrate`,`record`, `schedule`, and `convert`). The package also comes with detailed documentation and tutorials that are continuously updated with the aim to help people with limited coding knowledge to set up their rpi and make controlled and automated image and video recordings. See the detailed [wiki](https://github.com/JolleJolles/pirecorder/wiki).\n\n\n## <a name=\"install\"></a>Install\n\nPiRecorder is easy to install. Simply open a terminal window and enter:\n\n```bash\npip install pirecorder\n```\n\nAll dependencies (see below) will be automatically installed with *pirecorder* except for:\n\n- *picamera*: To enable *pirecorder* to be installable on non-rpi systems such as to use the convert functionality\n- *opencv*: Opencv has to be manually installed due to various dependencies. Click [here](https://github.com/JolleJolles/pirecorder/wiki/Install-OpenCV-for-Python-on-Mac,-Ubuntu,-Raspberry-Pi) for my opencv installation guide.\n- *ffmpeg*: ffmpeg is needed only for using the convert functionality of *pirecorder* and needs to be installed manually. Click [here](https://github.com/JolleJolles/pirecorder/wiki/Installing-ffmpeg-on-Mac-OS-X) for my guide to install on OS X and [here](https://github.com/JolleJolles/pirecorder/wiki/Installing-ffmpeg-on-Raspberry-Pi-with-h264-support) for my guide to install on raspberry pi.\n\n**See the [pirecorder wiki](https://github.com/JolleJolles/pirecorder/wiki) for a detailed guide for setting up your raspberry pi and installing and working with pirecorder.**\n\n## Dependencies\n*pirecorder* is both Python 2.7 and 3 compatible. It builds strongly on the [picamera](http://picamera.readthedocs.io/) package, uses [numpy](http://www.numpy.org/), [pyyaml](https://pyyaml.org), and [opencv](http://opencv.org) for some of its core functionality, and relies on various utility functions of my [pythutils](https://github.com/JolleJolles/pythutils) package. The scheduling functionality is baded on *CronTab* and the associated [python-crontab](https://pypi.org/project/python-crontab/) package.\n\n## Module overview\n\n### Recorder class\nThe main functionality of *pirecorder* is the `PiRecorder` class. This class initiates a Recorder instance that sets up the Raspberry Pi to record either A) a single image, b) a sequence of images, C) a single video, or D) sessions of video recordings.\n\nThere are many custom recording parameters that can be set with the `PiRecorder` class, which are divided into 1) general user recording parameters, 2) camera settings, 3) video recording settings, 4) image recording settings, and 5) custom settings linked to the specific rpi being used. A detailed overview and description of all these settings can be found by calling `print(pirecorder.PiRecorder.__doc__)`.\n\nWhen the `PiRecorder` is run for the first time, it creates a `pirecorder` setup directory in the user's home folder to store all relevant setup files. Central is the default configuration file `pirecorder.conf`. *PiRecorder* is set up in such a way that it is very easy to set and save custom settings that are then automatically used for future use without further user input.\n\nMultiple configuration files can be created and called for specific recording settings and the configuration file(s) can be easily edited with any text editor as well as updated from the command line with the `set_config()` method. In addition the setup directory will contain a log file *pirecorder.log* that will store all terminal output when *PiRecorder* is used to help keep a history log of your recordings.\n\n### Recording modes\n`PiRecorder` has four recording modes (set with `rectype`):\n\n1. `img`: Records a single image with the custom settings and then quits.\n2. `imgseq`: Creates a controlled sequence of images based on either a set duration (setting `imgtime`) or total number of images to be recorded (setting `imgnr`) with a certain delay between images (setting `imgwait`).\n3. `vid` : Records a single video. Specific settings that can be set for this mode are `vidfps`, the framerate of the video; `vidduration`, the duration of the video; and `viddelay`, extra recording time in seconds that will be added to vidduration.\n4. `vidseq`: Starts a series of standardized videos using the custom settings. After each recording has finished, the user is asked with a keypress if a new recording should be started or exit.\n\nFiles are automatically stored in the configured directory (`recdir`), by default a directory called `recordings` in the pirecorder directory, and are automatically named according to the provided `label`, the computer name, the date and time, and potentially the session number or image sequence nr.\n\n### <a name=\"submodules\"></a>Submodules\nIn addition to the main recording module, *pirecorder* contains a number of modules to facilitate setting-up the Raspberry Pi camera, configuring the camera, and schedule future recordings, with more functionalities to be integrated in the future, see the planned enhancements [here](https://github.com/JolleJolles/pirecorder/labels/enhancement).\n\n- `calibrate()`: Opens a live video stream with user interface to calibrate the raspberry pi camera in terms of its position, focus, and region of interest (roi).\n- `set_gains()`: Function to calibrate the red and blue color balance either automatically or dynamically using a live video stream with user interface.\n- `record`: Start a recording using the stored configuration settings. If initiated for the first time, the default configuration file will be created (`pirecorder/pirecorder.conf`). This file can be simply updated with a text editor (e.g. via `sudo nano`).\n- `schedule()`: Automatically start image and video recording in the future according to custom recording schedules.\n- `convert`: Convert images or videos to (resized) videos (with timestamps)\n\n## Development\n*pirecorder* is developed by [Dr Jolle Jolles](http://jollejolles.com) at the Max Planck Institute of Animal Behavior, Konstanz, Germany.\n\nFor an overview of version changes see the [CHANGELOG](https://github.com/JolleJolles/pirecorder/blob/master/CHANGELOG) and for detailed changes see the [commits page](https://github.com/JolleJolles/pirecorder/commits/). Please submit bugs or feature requests to the GitHub issue tracker [here](https://github.com/JolleJolles/pirecorder/issues).\n\n## Citing\nIf you use pirecorder in your research, please cite it as follows:\n\n```\n@misc{Jolles2019,\n      title = {pirecorder: controlled and automated image and video recording with the raspberry pi},\n      author = {Jolles, Jolle W.},\n      year = {2019}\n      url = {http://doi.org/10.5281/zenodo.2529515},\n      doi = {10.5281/zenodo.2529515}\n}\n```\n\n## License\nReleased under a Apache 2.0 License. See [LICENSE](https://github.com/JolleJolles/pirecorder/blob/master/LICENSE) for details.", "description_content_type": "text/markdown", "docs_url": null, "download_url": "https://github.com/JolleJolles/pirecorder/archive/v2.2.2.tar.gz", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/JolleJolles", "keywords": "", "license": "License :: OSI Approved :: Apache Software License", "maintainer": "Jolle Jolles", "maintainer_email": "j.w.jolles@gmail.com", "name": "pirecorder", "package_url": "https://pypi.org/project/pirecorder/", "platform": "Windows", "project_url": "https://pypi.org/project/pirecorder/", "project_urls": {"Download": "https://github.com/JolleJolles/pirecorder/archive/v2.2.2.tar.gz", "Homepage": "https://github.com/JolleJolles"}, "release_url": "https://pypi.org/project/pirecorder/2.2.2/", "requires_dist": null, "requires_python": "", "summary": "A python module for controlled and automated image and video recording with the raspberry pi", "version": "2.2.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><a href=\"https://badge.fury.io/py/pirecorder\" rel=\"nofollow\"><img alt=\"PyPI version\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/a004f63193d8b7850975ca63642a92b9602b1eb1/68747470733a2f2f62616467652e667572792e696f2f70792f70697265636f726465722e737667\"></a> <a href=\"https://doi.org/10.5281/zenodo.2529515\" rel=\"nofollow\"><img alt=\"DOI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/e627ccf3936eeff6c4b4fc2011a789cb3fb51e39/68747470733a2f2f7a656e6f646f2e6f72672f62616467652f444f492f31302e353238312f7a656e6f646f2e323532393531352e737667\"></a></p>\n<h1>pirecorder</h1>\n<p><strong>A python module for controlled and automated image and video recording with the raspberry pi</strong></p>\n<p><em>pirecorder</em> is a package to facilitate controlled and automated image and video recording for the Raspberry Pi (rpi), specifically developed with the Behavioural Scientist in mind.</p>\n<p align=\"center\"><img src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8d15e1c0d8b624385f8275a3e93bf2cbd00f6e4d/68747470733a2f2f6769746875622e636f6d2f4a6f6c6c654a6f6c6c65732f70697265636f726465722f626c6f622f6d61737465722f696d616765732f70697265636f726465722d6c6f676f2e6a7067\"></p>\n<p><em>pirecorder</em> consists of a main <code>PiRecorder</code> class and a number of additional <a href=\"#submodules\" rel=\"nofollow\">submodules</a> that facilitate setting up the Raspberry Pi camera, configuring the camera, scheduling future recordings, and converting recorded media. It helps get optimal recording settings and stores these such that they can be easily updated by the user via python or a text file. Subsequently, these settings can be used to make standardised recordings by user command or via a user-set schedule of recordings.</p>\n<p><em>pirecorder</em> is build to make controlled and automated recordings as simple as possible. It is fully usable by simple terminal commands without needing to go into python (via <code>calibrate</code>,<code>record</code>, <code>schedule</code>, and <code>convert</code>). The package also comes with detailed documentation and tutorials that are continuously updated with the aim to help people with limited coding knowledge to set up their rpi and make controlled and automated image and video recordings. See the detailed <a href=\"https://github.com/JolleJolles/pirecorder/wiki\" rel=\"nofollow\">wiki</a>.</p>\n<h2><a></a>Install</h2>\n<p>PiRecorder is easy to install. Simply open a terminal window and enter:</p>\n<pre>pip install pirecorder\n</pre>\n<p>All dependencies (see below) will be automatically installed with <em>pirecorder</em> except for:</p>\n<ul>\n<li><em>picamera</em>: To enable <em>pirecorder</em> to be installable on non-rpi systems such as to use the convert functionality</li>\n<li><em>opencv</em>: Opencv has to be manually installed due to various dependencies. Click <a href=\"https://github.com/JolleJolles/pirecorder/wiki/Install-OpenCV-for-Python-on-Mac,-Ubuntu,-Raspberry-Pi\" rel=\"nofollow\">here</a> for my opencv installation guide.</li>\n<li><em>ffmpeg</em>: ffmpeg is needed only for using the convert functionality of <em>pirecorder</em> and needs to be installed manually. Click <a href=\"https://github.com/JolleJolles/pirecorder/wiki/Installing-ffmpeg-on-Mac-OS-X\" rel=\"nofollow\">here</a> for my guide to install on OS X and <a href=\"https://github.com/JolleJolles/pirecorder/wiki/Installing-ffmpeg-on-Raspberry-Pi-with-h264-support\" rel=\"nofollow\">here</a> for my guide to install on raspberry pi.</li>\n</ul>\n<p><strong>See the <a href=\"https://github.com/JolleJolles/pirecorder/wiki\" rel=\"nofollow\">pirecorder wiki</a> for a detailed guide for setting up your raspberry pi and installing and working with pirecorder.</strong></p>\n<h2>Dependencies</h2>\n<p><em>pirecorder</em> is both Python 2.7 and 3 compatible. It builds strongly on the <a href=\"http://picamera.readthedocs.io/\" rel=\"nofollow\">picamera</a> package, uses <a href=\"http://www.numpy.org/\" rel=\"nofollow\">numpy</a>, <a href=\"https://pyyaml.org\" rel=\"nofollow\">pyyaml</a>, and <a href=\"http://opencv.org\" rel=\"nofollow\">opencv</a> for some of its core functionality, and relies on various utility functions of my <a href=\"https://github.com/JolleJolles/pythutils\" rel=\"nofollow\">pythutils</a> package. The scheduling functionality is baded on <em>CronTab</em> and the associated <a href=\"https://pypi.org/project/python-crontab/\" rel=\"nofollow\">python-crontab</a> package.</p>\n<h2>Module overview</h2>\n<h3>Recorder class</h3>\n<p>The main functionality of <em>pirecorder</em> is the <code>PiRecorder</code> class. This class initiates a Recorder instance that sets up the Raspberry Pi to record either A) a single image, b) a sequence of images, C) a single video, or D) sessions of video recordings.</p>\n<p>There are many custom recording parameters that can be set with the <code>PiRecorder</code> class, which are divided into 1) general user recording parameters, 2) camera settings, 3) video recording settings, 4) image recording settings, and 5) custom settings linked to the specific rpi being used. A detailed overview and description of all these settings can be found by calling <code>print(pirecorder.PiRecorder.__doc__)</code>.</p>\n<p>When the <code>PiRecorder</code> is run for the first time, it creates a <code>pirecorder</code> setup directory in the user's home folder to store all relevant setup files. Central is the default configuration file <code>pirecorder.conf</code>. <em>PiRecorder</em> is set up in such a way that it is very easy to set and save custom settings that are then automatically used for future use without further user input.</p>\n<p>Multiple configuration files can be created and called for specific recording settings and the configuration file(s) can be easily edited with any text editor as well as updated from the command line with the <code>set_config()</code> method. In addition the setup directory will contain a log file <em>pirecorder.log</em> that will store all terminal output when <em>PiRecorder</em> is used to help keep a history log of your recordings.</p>\n<h3>Recording modes</h3>\n<p><code>PiRecorder</code> has four recording modes (set with <code>rectype</code>):</p>\n<ol>\n<li><code>img</code>: Records a single image with the custom settings and then quits.</li>\n<li><code>imgseq</code>: Creates a controlled sequence of images based on either a set duration (setting <code>imgtime</code>) or total number of images to be recorded (setting <code>imgnr</code>) with a certain delay between images (setting <code>imgwait</code>).</li>\n<li><code>vid</code> : Records a single video. Specific settings that can be set for this mode are <code>vidfps</code>, the framerate of the video; <code>vidduration</code>, the duration of the video; and <code>viddelay</code>, extra recording time in seconds that will be added to vidduration.</li>\n<li><code>vidseq</code>: Starts a series of standardized videos using the custom settings. After each recording has finished, the user is asked with a keypress if a new recording should be started or exit.</li>\n</ol>\n<p>Files are automatically stored in the configured directory (<code>recdir</code>), by default a directory called <code>recordings</code> in the pirecorder directory, and are automatically named according to the provided <code>label</code>, the computer name, the date and time, and potentially the session number or image sequence nr.</p>\n<h3><a></a>Submodules</h3>\n<p>In addition to the main recording module, <em>pirecorder</em> contains a number of modules to facilitate setting-up the Raspberry Pi camera, configuring the camera, and schedule future recordings, with more functionalities to be integrated in the future, see the planned enhancements <a href=\"https://github.com/JolleJolles/pirecorder/labels/enhancement\" rel=\"nofollow\">here</a>.</p>\n<ul>\n<li><code>calibrate()</code>: Opens a live video stream with user interface to calibrate the raspberry pi camera in terms of its position, focus, and region of interest (roi).</li>\n<li><code>set_gains()</code>: Function to calibrate the red and blue color balance either automatically or dynamically using a live video stream with user interface.</li>\n<li><code>record</code>: Start a recording using the stored configuration settings. If initiated for the first time, the default configuration file will be created (<code>pirecorder/pirecorder.conf</code>). This file can be simply updated with a text editor (e.g. via <code>sudo nano</code>).</li>\n<li><code>schedule()</code>: Automatically start image and video recording in the future according to custom recording schedules.</li>\n<li><code>convert</code>: Convert images or videos to (resized) videos (with timestamps)</li>\n</ul>\n<h2>Development</h2>\n<p><em>pirecorder</em> is developed by <a href=\"http://jollejolles.com\" rel=\"nofollow\">Dr Jolle Jolles</a> at the Max Planck Institute of Animal Behavior, Konstanz, Germany.</p>\n<p>For an overview of version changes see the <a href=\"https://github.com/JolleJolles/pirecorder/blob/master/CHANGELOG\" rel=\"nofollow\">CHANGELOG</a> and for detailed changes see the <a href=\"https://github.com/JolleJolles/pirecorder/commits/\" rel=\"nofollow\">commits page</a>. Please submit bugs or feature requests to the GitHub issue tracker <a href=\"https://github.com/JolleJolles/pirecorder/issues\" rel=\"nofollow\">here</a>.</p>\n<h2>Citing</h2>\n<p>If you use pirecorder in your research, please cite it as follows:</p>\n<pre><code>@misc{Jolles2019,\n      title = {pirecorder: controlled and automated image and video recording with the raspberry pi},\n      author = {Jolles, Jolle W.},\n      year = {2019}\n      url = {http://doi.org/10.5281/zenodo.2529515},\n      doi = {10.5281/zenodo.2529515}\n}\n</code></pre>\n<h2>License</h2>\n<p>Released under a Apache 2.0 License. See <a href=\"https://github.com/JolleJolles/pirecorder/blob/master/LICENSE\" rel=\"nofollow\">LICENSE</a> for details.</p>\n\n          </div>"}, "last_serial": 6829293, "releases": {"2.0.0": [{"comment_text": "", "digests": {"md5": "b7560fb4fd0bd814c9fc87b658956441", "sha256": "718836660b7d1b51c559161be6c1062de1e2a991576158c9ef71d98f0cb25934"}, "downloads": -1, "filename": "pirecorder-2.0.0-py3-none-any.whl", "has_sig": false, "md5_digest": "b7560fb4fd0bd814c9fc87b658956441", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 27069, "upload_time": "2019-11-18T10:21:30", "upload_time_iso_8601": "2019-11-18T10:21:30.619815Z", "url": "https://files.pythonhosted.org/packages/2e/30/4583f80d08bb133c73c3df8d40ccd5a4f0e372484be5f81d629e8331d023/pirecorder-2.0.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "dcfd0b122762955d4d2684a45b507089", "sha256": "b4fb5c0d9bbd25f44e66a6be71440a2b3dcb1f01692ce28ce0fa74484a6785d0"}, "downloads": -1, "filename": "pirecorder-2.0.0.tar.gz", "has_sig": false, "md5_digest": "dcfd0b122762955d4d2684a45b507089", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 20134, "upload_time": "2019-11-18T10:21:32", "upload_time_iso_8601": "2019-11-18T10:21:32.852559Z", "url": "https://files.pythonhosted.org/packages/14/d7/55daccf7af277661c959d3d4284e63cfe2a57b791db7a9cffad485c16d1d/pirecorder-2.0.0.tar.gz", "yanked": false}], "2.1.0": [{"comment_text": "", "digests": {"md5": "7e90e42aad24cc0f6d4b8c40a9293032", "sha256": "afdc1f700bd17f8d8c73dd234d01e14719accddd57d8c2916661becbdde82465"}, "downloads": -1, "filename": "pirecorder-2.1.0.tar.gz", "has_sig": false, "md5_digest": "7e90e42aad24cc0f6d4b8c40a9293032", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 21331, "upload_time": "2019-12-23T16:58:38", "upload_time_iso_8601": "2019-12-23T16:58:38.301605Z", "url": "https://files.pythonhosted.org/packages/c6/08/ffdd75bdf9589c392be095e8b2a2cdc0c72146042dc350a81e3409321237/pirecorder-2.1.0.tar.gz", "yanked": false}], "2.2.0": [{"comment_text": "", "digests": {"md5": "78f61b97263eb840dea96619734463a0", "sha256": "3a2736547ead66eb49767f9c48b16c6cec3dedee0f653dd11841bc003f4ca567"}, "downloads": -1, "filename": "pirecorder-2.2.0.tar.gz", "has_sig": false, "md5_digest": "78f61b97263eb840dea96619734463a0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 22231, "upload_time": "2020-02-17T09:06:39", "upload_time_iso_8601": "2020-02-17T09:06:39.705005Z", "url": "https://files.pythonhosted.org/packages/d4/f4/7ef0bb1982be3d7eba8187d7245303a3d61508920b68d41d1e98ce1160e5/pirecorder-2.2.0.tar.gz", "yanked": false}], "2.2.2": [{"comment_text": "", "digests": {"md5": "47fbc56ace4f02a2614a32d97eac2f69", "sha256": "a5cd2ff09780d92549f036ac8d5631008118379836d74e089996ebbad1c6813e"}, "downloads": -1, "filename": "pirecorder-2.2.2.tar.gz", "has_sig": false, "md5_digest": "47fbc56ace4f02a2614a32d97eac2f69", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 22297, "upload_time": "2020-03-17T15:24:30", "upload_time_iso_8601": "2020-03-17T15:24:30.073293Z", "url": "https://files.pythonhosted.org/packages/79/22/f219731ec2795f91bf0b4d645599ef0c3d75b118ee33efd354487fc4b3db/pirecorder-2.2.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "47fbc56ace4f02a2614a32d97eac2f69", "sha256": "a5cd2ff09780d92549f036ac8d5631008118379836d74e089996ebbad1c6813e"}, "downloads": -1, "filename": "pirecorder-2.2.2.tar.gz", "has_sig": false, "md5_digest": "47fbc56ace4f02a2614a32d97eac2f69", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 22297, "upload_time": "2020-03-17T15:24:30", "upload_time_iso_8601": "2020-03-17T15:24:30.073293Z", "url": "https://files.pythonhosted.org/packages/79/22/f219731ec2795f91bf0b4d645599ef0c3d75b118ee33efd354487fc4b3db/pirecorder-2.2.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:54:02 2020"}