{"info": {"author": "Jason Antman", "author_email": "jason@jasonantman.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Environment :: No Input/Output (Daemon)", "Intended Audience :: End Users/Desktop", "License :: OSI Approved :: GNU Affero General Public License v3 or later (AGPLv3+)", "Natural Language :: English", "Operating System :: POSIX :: Linux", "Programming Language :: Python", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Topic :: Other/Nonlisted Topic", "Topic :: System :: Logging", "Topic :: Utilities"], "description": "pizero-gpslog\n=============\n\n.. image:: http://www.repostatus.org/badges/latest/active.svg\n   :alt: Project Status: Active – The project has reached a stable, usable state and is being actively developed.\n   :target: http://www.repostatus.org/#active\n\nRaspberry Pi Zero gpsd logger with status LEDs.\n\n.. image:: http://blog.jasonantman.com/GFX/pizero_gpslogger_1_sm.jpg\n   :alt: Photograph of finished hardware next to playing card deck for size comparison\n   :target: http://blog.jasonantman.com/GFX/pizero_gpslogger_1.jpg\n\nA longer description of the motivation behind this and the specific hardware that I used is available on my blog: `DIY Raspberry Pi Zero GPS Track Logger <http://blog.jasonantman.com/2018/03/diy-raspberry-pi-zero-gps-track-logger/>`_.\n\nIntroduction and Goals\n----------------------\n\nThis is a trivial (and not really \"supported\") project of mine to couple a Raspberry Pi Zero with a USB GPS receiver and a battery pack to GPS track my hikes. The hardware decision was mainly based on what I had lying around: a Raspberry Pi Zero, a 10,000mAh external battery pack for my cell phone, and a USB GPS (well, I thought I had one, and got far enough into the project when I decided it was missing for good that I bought another).\n\nThe goal is to package all of this together into a \"small\" (but not necessarily lightweight, based on the components) package that I can put in the outside pocket of my hiking pack, and record an accurate and detailed GPS track of my hikes. It writes the most recent position data from gpsd to disk at a user-defined interval, flushes IO after each write (so that it's safe to just pull the power on the Pi), and uses two LEDs to indicate status while in the field. Data is written in gpsd's native format, but a conversion tool is provided.\n\nThis program relies on `gpsd <http://www.catb.org/gpsd/>`_ to interact with the GPS itself, as it's very mature and stable software, exposes a simple JSON-based socket interface, and also has decent Python bindings. There's no reason for a logger to have to worry about the nuances of GPS communication itself.\n\nRequirements\n------------\n\n* Raspberry Pi (tested with `Pi Zero <https://www.raspberrypi.org/products/raspberry-pi-zero/>`_ 1.3) and a MicroSD card (I'm using an `8GB SanDisk Ultra Class 10 UHS-1 <https://www.amazon.com/gp/product/B00M55C0VU/>`_, which has enough space after the OS for 240 days of 5-second-interval data).\n* Raspbian Stretch with Python3 (see installation instructions below)\n* `gpsd compatible <http://www.catb.org/gpsd/hardware.html>`_ GPS (I use a `GlobalSat BU-353-S4 USB <https://www.amazon.com/gp/product/B008200LHW/>`_; the gpsd folks say some pretty awful things about it, but we'll see...)\n* Two GPIO-connected LEDs on the RPi, ideally different colors (see below).\n* Some sort of power source for the Pi. I use a standard adapter when testing and a 10000mAh USB battery pack in the field (specifically the `Anker PowerCore Speed 10000 QA <https://www.amazon.com/gp/product/B01JIYWUBA/>`_). That battery pack is extreme overkill, and powers the unit continuously for 42 hours, when logging at a 5-second interval.\n\nInstallation\n------------\n\nSoftware\n++++++++\n\nThis assumes you're running on Linux...\n\n1. Download the latest `Raspbian Stretch Lite <https://www.raspberrypi.org/downloads/raspbian/>`_ image. I'm using the \"November 2017\" version, released 2017-11-29, kernel 4.9.\n2. Verify the checksum on the file and then unzip it.\n3. Put the MicroSD card in your machine and write the image to it. As root, ``dd bs=4M if=2017-11-29-raspbian-stretch-lite.img of=/dev/sdX conv=fsync status=progress`` (where ``/dev/sdX`` is the device that the SD card showed up at).\n4. Wait for the copy to finish and IO to the device to stop (run ``sync``).\n5. *Optional:* If you're going to be using this on a network (i.e. for setup, troubleshooting, development, etc.) then this would be a good time to mount the Raspian partition on your computer and make some changes. See `this script from pi2graphite <https://github.com/jantman/pi2graphite/blob/master/setup_raspbian.sh>`_ for some tips.\n\n  1. Copy your authorized_keys file over to ``/home/pi``.\n  2. Touch the file at ``/boot/ssh`` on the Pi boot partition to enable SSH access.\n  3. Set a hostname.\n  4. If desired, configure WiFi (as well as downloading the packages for any required drivers onto the OS partition).\n  5. When finished, unmount, ``sync`` and remove the SD card.\n\n6. Put the SD card in your Pi and plug it in. If you're going to be connecting directly with a keyboard and monitor, do so. If you configured WiFi (or want to use a USB Ethernet adapter) and have everything setup correctly, it should eventually connect to your network. If you have issues with a USB Ethernet adapter, try letting the Pi boot up (give it 2-3 minutes) and *then* plug in the adapter.\n7. Log in. The default user is named \"pi\" with a default password of \"raspberry\".\n8. ``sudo apt-get update && sudo apt-get install haveged git python3-gpiozero python3-setuptools python3-pip gpsd``\n9. Run sudo `raspi-config <https://github.com/RPi-Distro/raspi-config>`_ to set things like the locale and timezone. Personally, I usually leave the ``pi`` user password at its default for devices that will never be on an untrusted network.\n10. In ``/home/pi``, run ``git clone https://github.com/jantman/pizero-gpslog.git && cd pizero-gpslog && sudo python3 setup.py develop && sudo pizero-gpslog-install``. The installer, ``pizero-gpslog-install``, templates out a systemd unit file, reloads systemd, and enables the unit. Environment variables to set for the service are taken from command line arguments.\n11. If you're ready, ``sudo systemctl start pizero-gpslog`` to start it. Otherwise, it will start on the next boot.\n12. Find out the USB vendor and product IDs for your GPS. My BU-353S4 uses a Prolific PL2303 serial chipset (vendor 067b product 2303) which is disabled by default in the Debian gpsd udev rules. Look at ``/lib/udev/rules.d/60-gpsd.rules``. If your GPS is commented out like mine, uncomment it and save the file.\n\nHardware\n++++++++\n\n1. Add two LEDs to the Pi Zero. I prefer to solder a female right-angle header to the Pi, then put the LEDs on a male header so they can be removed. gpiozero, the library used for controlling the LEDs, has `pinout diagrams <https://gpiozero.readthedocs.io/en/stable/recipes.html#pin-numbering>`_ and information on the `wiring that the API expects <https://gpiozero.readthedocs.io/en/stable/api_output.html#gpiozero.LED>`_. The code this project uses expects the LEDs to be wired active-high (cathode to ground, anode to GPIO pin through a limiting resistor). I made up a small 8x20 header for my LEDs and (very sloppily) potted them in epoxy.\n2. Test the LEDs.\n3. Plug your GPS into the USB input on the RPi, via a \"usb on the go\" (USB OTG) cable. Then plug the Pi into a power source. Everything else should be automatic after the installation described below.\n\nConfiguration\n-------------\n\npizero-gpslog's entire configuration is provided via environment variables. There are NO command-line switches.\n\n* ``LOG_LEVEL`` - Defaults to \"WARNING\"; other accepted values are \"INFO\" and \"DEBUG\". All logging is to STDOUT.\n* ``LED_PIN_RED`` - Integer. Specifies the GPIO pin number used for the primary (\"red\") LED. Leave unset if running on non-RPi hardware, in which case LED state will be logged to STDOUT. Note the number used here is the Broadcom GPIO pin number, not the physical board pin number.\n* ``LED_PIN_GREEN`` - Integer. Specifies the GPIO pin number used for the secondary (\"green\") LED. Leave unset if running on non-RPi hardware, in which case LED state will be logged to STDOUT. Note the number used here is the Broadcom GPIO pin number, not the physical board pin number.\n* ``GPS_INTERVAL_SEC`` - Integer. Interval to poll gps at, and write gps position. Defaults to every 5 seconds.\n* ``FLUSH_FILE`` - String. If set to \"false\", do not explicitly flush output file after every write.\n* ``OUT_DIR`` - Directory to write log files under. If not set, will use current working directory.\n\nRunning\n-------\n\nConfigure as described above, then use the ``pizero-gpslog`` systemd service.\n\nLED Outputs\n+++++++++++\n\n* Green Solid (at start) - connecting to gpsd. Green LED goes out when connected to gpsd and the output file is opened for writing.\n* Red Solid - no active GPS (gpsd does not yet have an active gps, or no GPS is connected).\n* Red 3 Fast Blinks (0.1 sec) - GPS is connected but does not yet have a fix.\n* Red 2 Slow Blinks (0.5 sec) - GPS has a 2D-only fix; position data is being read.\n* Red 1 Slow Blink (0.5s) - GPS has a 3D fix; position data is being read.\n* Green Blink (0.25s) - Data point written to disk (and flushed, if flush not disabled).\n\nLog Files\n+++++++++\n\nLog files will be written under the directory specified by the ``OUT_DIR`` environment variable, or the current working directory if that environment variable is not set. Log files will be written under that directory, named according to the time and date when the program started (``%Y-%m-%d_%H-%M-%S`` format).\n\nEach line of the output file is a single raw gpsd response to the ``?POLL`` command. While this program also decodes the responses, it doesn't make sense for us to invent our own data structure for something that already has one. Each line in the output file should be valid JSON matching the `gpsd JSON ?POLL response schema <http://www.catb.org/gpsd/gpsd_json.html>`_, deserialized and reserialized to ensure that it does not contain any linebreaks.\n\nGetting the Data\n++++++++++++++++\n\nAt the moment, when I'm home from a hike and the Pi is powered down, I just pull the SD card and copy the data to my computer, then delete the data file(s) from the SD card and put it back. It would certainly be easy to automate this with a Pi Zero W or an Ethernet or WiFi connection, but it's not worth it for me for this project. If you're interested, I have some scripts and instructions that might help as part of my `pi2graphite <https://github.com/jantman/pi2graphite>`_ project.\n\nUsing the Data\n--------------\n\nThe log files output by ``pizero-gpslog`` are in the `gpsd JSON ?POLL response format <http://www.catb.org/gpsd/gpsd_json.html>`_, one response per line (some responses may be empty). In order to make the output useful, this package also includes the ``pizero-gpslog-convert`` command line tool which can convert a specified JSON file to one of a variety of more-useful formats. While `gpsbabel <https://www.gpsbabel.org/>`_ is the standard for GPS data format conversion, it doesn't support the gpsd POLL response format. This utility is provided as a means of converting to some common GPS data formats. If you need other formats, please convert to one of these and then to gpsbabel.\n\n* ``pizero-gpslog-convert YYYY-MM-DD_HH:MM:SS.json`` - convert ``YYYY-MM-DD_HH:MM:SS.json`` to GPX and write at ``YYYY-MM-DD_HH:MM:SS.gpx``\n* ``pizero-gpslog-convert --stats YYYY-MM-DD_HH:MM:SS.json`` - same as above, but also print some stats to STDERR\n\nIt's up to you how to use the data, but there are a number of handy online tools that work with GPX files, including:\n\n* `gpsvisualizer.com <http://www.gpsvisualizer.com/>`_ that has multiple output formats including `elevation and speed profiles <http://www.gpsvisualizer.com/profile_input>`_ (and other profiles including slope, climb rate, pace, etc.), plotting the track `on Google Maps <http://www.gpsvisualizer.com/map_input?form=google>`_ (including with colorization by speed, elevation, slope, climb rate, pace, etc.), converting `to Google Earth KML <http://www.gpsvisualizer.com/map_input?form=googleearth>`_, etc. Plotting can also use sources other than Google Maps, such as OpenStreetMap, ThunderForest, OpenTopoMap, USGS, USFS, etc. (and there's some `explanation <http://www.gpsvisualizer.com/examples/google_custom_backgrounds.html>`_ about how this is done).\n* `utrack.crempa.net <http://utrack.crempa.net/>`_ Takes a GPX file and generates a HTML page \"report\" giving a map overlay (with optional elevation colorization) as well as elevation and speed profiles (against both time and distance), some statistics, a distance vs time profile, and the option to download that report as a PDF.\n* `sunearthtools.com <https://www.sunearthtools.com/tools/gps-view.php>`_ has a simple tool (admittedly with a poor UI) that plots GPX data on Google maps along with a separate speed and elevation profile (by distance).\n* `mygpsfiles <http://www.mygpsfiles.com/en/>`_ Is a web-based app with a native-looking tiled UI that can plot tracks on Google Maps (Satellite or Map + Topo) as well as displaying per-point statistics (distance, time, elevation, speed, pace) and a configurable profile of elevation, speed, distance, pace, etc. As far as I can tell, all units are metric.\n\nTesting\n-------\n\nThere currently aren't any code tests. But there are some scripts and tox-based helpers to aid with manual testing.\n\n* ``pizero_gpslog/tests/data/runfake.sh`` - Runs `gpsfake <http://www.catb.org/gpsd/gpsfake.html>`_ (provided by gpsd) with sample data. Takes optional arguments for ``--nofix`` (data with no GPS fix) or ``--stillfix`` (fix but not moving).\n\nAcknowledgements\n----------------\n\nFirst, many thanks to the developers of gpsd, who have put forth the massive effort to make a script like this relatively trivial.\n\nSecond, thanks to `Martijn Braam <https://github.com/MartijnBraam>`_, developer of the MIT-licensed `gpsd-py3 <https://github.com/MartijnBraam/gpsd-py3>`_ package. A modified version of that package makes up the ``gpsd.py`` module.\n\n\n", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/jantman/pizero-gpslog", "keywords": "raspberry pi rpi gps log logger gpsd", "license": "", "maintainer": "", "maintainer_email": "", "name": "pizero-gpslog", "package_url": "https://pypi.org/project/pizero-gpslog/", "platform": "", "project_url": "https://pypi.org/project/pizero-gpslog/", "project_urls": {"Homepage": "https://github.com/jantman/pizero-gpslog"}, "release_url": "https://pypi.org/project/pizero-gpslog/0.1.3/", "requires_dist": ["gpiozero", "gpxpy", "pint"], "requires_python": "", "summary": "Raspberry Pi Zero gpsd logger with status LEDs.", "version": "0.1.3", "yanked": false, "html_description": "<div class=\"project-description\">\n            <a href=\"http://www.repostatus.org/#active\" rel=\"nofollow\"><img alt=\"Project Status: Active – The project has reached a stable, usable state and is being actively developed.\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/51adb09f202aea47725eca73a3fcf5e1ab47f2e9/687474703a2f2f7777772e7265706f7374617475732e6f72672f6261646765732f6c61746573742f6163746976652e737667\"></a>\n<p>Raspberry Pi Zero gpsd logger with status LEDs.</p>\n<a href=\"http://blog.jasonantman.com/GFX/pizero_gpslogger_1.jpg\" rel=\"nofollow\"><img alt=\"Photograph of finished hardware next to playing card deck for size comparison\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/b8fcdd9707e1d7d43697c655800cdc99c87abeeb/687474703a2f2f626c6f672e6a61736f6e616e746d616e2e636f6d2f4746582f70697a65726f5f6770736c6f676765725f315f736d2e6a7067\"></a>\n<p>A longer description of the motivation behind this and the specific hardware that I used is available on my blog: <a href=\"http://blog.jasonantman.com/2018/03/diy-raspberry-pi-zero-gps-track-logger/\" rel=\"nofollow\">DIY Raspberry Pi Zero GPS Track Logger</a>.</p>\n<div id=\"introduction-and-goals\">\n<h2>Introduction and Goals</h2>\n<p>This is a trivial (and not really “supported”) project of mine to couple a Raspberry Pi Zero with a USB GPS receiver and a battery pack to GPS track my hikes. The hardware decision was mainly based on what I had lying around: a Raspberry Pi Zero, a 10,000mAh external battery pack for my cell phone, and a USB GPS (well, I thought I had one, and got far enough into the project when I decided it was missing for good that I bought another).</p>\n<p>The goal is to package all of this together into a “small” (but not necessarily lightweight, based on the components) package that I can put in the outside pocket of my hiking pack, and record an accurate and detailed GPS track of my hikes. It writes the most recent position data from gpsd to disk at a user-defined interval, flushes IO after each write (so that it’s safe to just pull the power on the Pi), and uses two LEDs to indicate status while in the field. Data is written in gpsd’s native format, but a conversion tool is provided.</p>\n<p>This program relies on <a href=\"http://www.catb.org/gpsd/\" rel=\"nofollow\">gpsd</a> to interact with the GPS itself, as it’s very mature and stable software, exposes a simple JSON-based socket interface, and also has decent Python bindings. There’s no reason for a logger to have to worry about the nuances of GPS communication itself.</p>\n</div>\n<div id=\"requirements\">\n<h2>Requirements</h2>\n<ul>\n<li>Raspberry Pi (tested with <a href=\"https://www.raspberrypi.org/products/raspberry-pi-zero/\" rel=\"nofollow\">Pi Zero</a> 1.3) and a MicroSD card (I’m using an <a href=\"https://www.amazon.com/gp/product/B00M55C0VU/\" rel=\"nofollow\">8GB SanDisk Ultra Class 10 UHS-1</a>, which has enough space after the OS for 240 days of 5-second-interval data).</li>\n<li>Raspbian Stretch with Python3 (see installation instructions below)</li>\n<li><a href=\"http://www.catb.org/gpsd/hardware.html\" rel=\"nofollow\">gpsd compatible</a> GPS (I use a <a href=\"https://www.amazon.com/gp/product/B008200LHW/\" rel=\"nofollow\">GlobalSat BU-353-S4 USB</a>; the gpsd folks say some pretty awful things about it, but we’ll see…)</li>\n<li>Two GPIO-connected LEDs on the RPi, ideally different colors (see below).</li>\n<li>Some sort of power source for the Pi. I use a standard adapter when testing and a 10000mAh USB battery pack in the field (specifically the <a href=\"https://www.amazon.com/gp/product/B01JIYWUBA/\" rel=\"nofollow\">Anker PowerCore Speed 10000 QA</a>). That battery pack is extreme overkill, and powers the unit continuously for 42 hours, when logging at a 5-second interval.</li>\n</ul>\n</div>\n<div id=\"installation\">\n<h2>Installation</h2>\n<div id=\"software\">\n<h3>Software</h3>\n<p>This assumes you’re running on Linux…</p>\n<ol>\n<li>Download the latest <a href=\"https://www.raspberrypi.org/downloads/raspbian/\" rel=\"nofollow\">Raspbian Stretch Lite</a> image. I’m using the “November 2017” version, released 2017-11-29, kernel 4.9.</li>\n<li>Verify the checksum on the file and then unzip it.</li>\n<li>Put the MicroSD card in your machine and write the image to it. As root, <tt>dd bs=4M <span class=\"pre\">if=2017-11-29-raspbian-stretch-lite.img</span> <span class=\"pre\">of=/dev/sdX</span> conv=fsync status=progress</tt> (where <tt>/dev/sdX</tt> is the device that the SD card showed up at).</li>\n<li>Wait for the copy to finish and IO to the device to stop (run <tt>sync</tt>).</li>\n<li><em>Optional:</em> If you’re going to be using this on a network (i.e. for setup, troubleshooting, development, etc.) then this would be a good time to mount the Raspian partition on your computer and make some changes. See <a href=\"https://github.com/jantman/pi2graphite/blob/master/setup_raspbian.sh\" rel=\"nofollow\">this script from pi2graphite</a> for some tips.</li>\n</ol>\n<blockquote>\n<ol>\n<li>Copy your authorized_keys file over to <tt>/home/pi</tt>.</li>\n<li>Touch the file at <tt>/boot/ssh</tt> on the Pi boot partition to enable SSH access.</li>\n<li>Set a hostname.</li>\n<li>If desired, configure WiFi (as well as downloading the packages for any required drivers onto the OS partition).</li>\n<li>When finished, unmount, <tt>sync</tt> and remove the SD card.</li>\n</ol>\n</blockquote>\n<ol>\n<li>Put the SD card in your Pi and plug it in. If you’re going to be connecting directly with a keyboard and monitor, do so. If you configured WiFi (or want to use a USB Ethernet adapter) and have everything setup correctly, it should eventually connect to your network. If you have issues with a USB Ethernet adapter, try letting the Pi boot up (give it 2-3 minutes) and <em>then</em> plug in the adapter.</li>\n<li>Log in. The default user is named “pi” with a default password of “raspberry”.</li>\n<li><tt>sudo <span class=\"pre\">apt-get</span> update &amp;&amp; sudo <span class=\"pre\">apt-get</span> install haveged git <span class=\"pre\">python3-gpiozero</span> <span class=\"pre\">python3-setuptools</span> <span class=\"pre\">python3-pip</span> gpsd</tt></li>\n<li>Run sudo <a href=\"https://github.com/RPi-Distro/raspi-config\" rel=\"nofollow\">raspi-config</a> to set things like the locale and timezone. Personally, I usually leave the <tt>pi</tt> user password at its default for devices that will never be on an untrusted network.</li>\n<li>In <tt>/home/pi</tt>, run <tt>git clone <span class=\"pre\">https://github.com/jantman/pizero-gpslog.git</span> &amp;&amp; cd <span class=\"pre\">pizero-gpslog</span> &amp;&amp; sudo python3 setup.py develop &amp;&amp; sudo <span class=\"pre\">pizero-gpslog-install</span></tt>. The installer, <tt><span class=\"pre\">pizero-gpslog-install</span></tt>, templates out a systemd unit file, reloads systemd, and enables the unit. Environment variables to set for the service are taken from command line arguments.</li>\n<li>If you’re ready, <tt>sudo systemctl start <span class=\"pre\">pizero-gpslog</span></tt> to start it. Otherwise, it will start on the next boot.</li>\n<li>Find out the USB vendor and product IDs for your GPS. My BU-353S4 uses a Prolific PL2303 serial chipset (vendor 067b product 2303) which is disabled by default in the Debian gpsd udev rules. Look at <tt><span class=\"pre\">/lib/udev/rules.d/60-gpsd.rules</span></tt>. If your GPS is commented out like mine, uncomment it and save the file.</li>\n</ol>\n</div>\n<div id=\"hardware\">\n<h3>Hardware</h3>\n<ol>\n<li>Add two LEDs to the Pi Zero. I prefer to solder a female right-angle header to the Pi, then put the LEDs on a male header so they can be removed. gpiozero, the library used for controlling the LEDs, has <a href=\"https://gpiozero.readthedocs.io/en/stable/recipes.html#pin-numbering\" rel=\"nofollow\">pinout diagrams</a> and information on the <a href=\"https://gpiozero.readthedocs.io/en/stable/api_output.html#gpiozero.LED\" rel=\"nofollow\">wiring that the API expects</a>. The code this project uses expects the LEDs to be wired active-high (cathode to ground, anode to GPIO pin through a limiting resistor). I made up a small 8x20 header for my LEDs and (very sloppily) potted them in epoxy.</li>\n<li>Test the LEDs.</li>\n<li>Plug your GPS into the USB input on the RPi, via a “usb on the go” (USB OTG) cable. Then plug the Pi into a power source. Everything else should be automatic after the installation described below.</li>\n</ol>\n</div>\n</div>\n<div id=\"configuration\">\n<h2>Configuration</h2>\n<p>pizero-gpslog’s entire configuration is provided via environment variables. There are NO command-line switches.</p>\n<ul>\n<li><tt>LOG_LEVEL</tt> - Defaults to “WARNING”; other accepted values are “INFO” and “DEBUG”. All logging is to STDOUT.</li>\n<li><tt>LED_PIN_RED</tt> - Integer. Specifies the GPIO pin number used for the primary (“red”) LED. Leave unset if running on non-RPi hardware, in which case LED state will be logged to STDOUT. Note the number used here is the Broadcom GPIO pin number, not the physical board pin number.</li>\n<li><tt>LED_PIN_GREEN</tt> - Integer. Specifies the GPIO pin number used for the secondary (“green”) LED. Leave unset if running on non-RPi hardware, in which case LED state will be logged to STDOUT. Note the number used here is the Broadcom GPIO pin number, not the physical board pin number.</li>\n<li><tt>GPS_INTERVAL_SEC</tt> - Integer. Interval to poll gps at, and write gps position. Defaults to every 5 seconds.</li>\n<li><tt>FLUSH_FILE</tt> - String. If set to “false”, do not explicitly flush output file after every write.</li>\n<li><tt>OUT_DIR</tt> - Directory to write log files under. If not set, will use current working directory.</li>\n</ul>\n</div>\n<div id=\"running\">\n<h2>Running</h2>\n<p>Configure as described above, then use the <tt><span class=\"pre\">pizero-gpslog</span></tt> systemd service.</p>\n<div id=\"led-outputs\">\n<h3>LED Outputs</h3>\n<ul>\n<li>Green Solid (at start) - connecting to gpsd. Green LED goes out when connected to gpsd and the output file is opened for writing.</li>\n<li>Red Solid - no active GPS (gpsd does not yet have an active gps, or no GPS is connected).</li>\n<li>Red 3 Fast Blinks (0.1 sec) - GPS is connected but does not yet have a fix.</li>\n<li>Red 2 Slow Blinks (0.5 sec) - GPS has a 2D-only fix; position data is being read.</li>\n<li>Red 1 Slow Blink (0.5s) - GPS has a 3D fix; position data is being read.</li>\n<li>Green Blink (0.25s) - Data point written to disk (and flushed, if flush not disabled).</li>\n</ul>\n</div>\n<div id=\"log-files\">\n<h3>Log Files</h3>\n<p>Log files will be written under the directory specified by the <tt>OUT_DIR</tt> environment variable, or the current working directory if that environment variable is not set. Log files will be written under that directory, named according to the time and date when the program started (<tt><span class=\"pre\">%Y-%m-%d_%H-%M-%S</span></tt> format).</p>\n<p>Each line of the output file is a single raw gpsd response to the <tt><span class=\"pre\">?POLL</span></tt> command. While this program also decodes the responses, it doesn’t make sense for us to invent our own data structure for something that already has one. Each line in the output file should be valid JSON matching the <a href=\"http://www.catb.org/gpsd/gpsd_json.html\" rel=\"nofollow\">gpsd JSON ?POLL response schema</a>, deserialized and reserialized to ensure that it does not contain any linebreaks.</p>\n</div>\n<div id=\"getting-the-data\">\n<h3>Getting the Data</h3>\n<p>At the moment, when I’m home from a hike and the Pi is powered down, I just pull the SD card and copy the data to my computer, then delete the data file(s) from the SD card and put it back. It would certainly be easy to automate this with a Pi Zero W or an Ethernet or WiFi connection, but it’s not worth it for me for this project. If you’re interested, I have some scripts and instructions that might help as part of my <a href=\"https://github.com/jantman/pi2graphite\" rel=\"nofollow\">pi2graphite</a> project.</p>\n</div>\n</div>\n<div id=\"using-the-data\">\n<h2>Using the Data</h2>\n<p>The log files output by <tt><span class=\"pre\">pizero-gpslog</span></tt> are in the <a href=\"http://www.catb.org/gpsd/gpsd_json.html\" rel=\"nofollow\">gpsd JSON ?POLL response format</a>, one response per line (some responses may be empty). In order to make the output useful, this package also includes the <tt><span class=\"pre\">pizero-gpslog-convert</span></tt> command line tool which can convert a specified JSON file to one of a variety of more-useful formats. While <a href=\"https://www.gpsbabel.org/\" rel=\"nofollow\">gpsbabel</a> is the standard for GPS data format conversion, it doesn’t support the gpsd POLL response format. This utility is provided as a means of converting to some common GPS data formats. If you need other formats, please convert to one of these and then to gpsbabel.</p>\n<ul>\n<li><tt><span class=\"pre\">pizero-gpslog-convert</span> <span class=\"pre\">YYYY-MM-DD_HH:MM:SS.json</span></tt> - convert <tt><span class=\"pre\">YYYY-MM-DD_HH:MM:SS.json</span></tt> to GPX and write at <tt><span class=\"pre\">YYYY-MM-DD_HH:MM:SS.gpx</span></tt></li>\n<li><tt><span class=\"pre\">pizero-gpslog-convert</span> <span class=\"pre\">--stats</span> <span class=\"pre\">YYYY-MM-DD_HH:MM:SS.json</span></tt> - same as above, but also print some stats to STDERR</li>\n</ul>\n<p>It’s up to you how to use the data, but there are a number of handy online tools that work with GPX files, including:</p>\n<ul>\n<li><a href=\"http://www.gpsvisualizer.com/\" rel=\"nofollow\">gpsvisualizer.com</a> that has multiple output formats including <a href=\"http://www.gpsvisualizer.com/profile_input\" rel=\"nofollow\">elevation and speed profiles</a> (and other profiles including slope, climb rate, pace, etc.), plotting the track <a href=\"http://www.gpsvisualizer.com/map_input?form=google\" rel=\"nofollow\">on Google Maps</a> (including with colorization by speed, elevation, slope, climb rate, pace, etc.), converting <a href=\"http://www.gpsvisualizer.com/map_input?form=googleearth\" rel=\"nofollow\">to Google Earth KML</a>, etc. Plotting can also use sources other than Google Maps, such as OpenStreetMap, ThunderForest, OpenTopoMap, USGS, USFS, etc. (and there’s some <a href=\"http://www.gpsvisualizer.com/examples/google_custom_backgrounds.html\" rel=\"nofollow\">explanation</a> about how this is done).</li>\n<li><a href=\"http://utrack.crempa.net/\" rel=\"nofollow\">utrack.crempa.net</a> Takes a GPX file and generates a HTML page “report” giving a map overlay (with optional elevation colorization) as well as elevation and speed profiles (against both time and distance), some statistics, a distance vs time profile, and the option to download that report as a PDF.</li>\n<li><a href=\"https://www.sunearthtools.com/tools/gps-view.php\" rel=\"nofollow\">sunearthtools.com</a> has a simple tool (admittedly with a poor UI) that plots GPX data on Google maps along with a separate speed and elevation profile (by distance).</li>\n<li><a href=\"http://www.mygpsfiles.com/en/\" rel=\"nofollow\">mygpsfiles</a> Is a web-based app with a native-looking tiled UI that can plot tracks on Google Maps (Satellite or Map + Topo) as well as displaying per-point statistics (distance, time, elevation, speed, pace) and a configurable profile of elevation, speed, distance, pace, etc. As far as I can tell, all units are metric.</li>\n</ul>\n</div>\n<div id=\"testing\">\n<h2>Testing</h2>\n<p>There currently aren’t any code tests. But there are some scripts and tox-based helpers to aid with manual testing.</p>\n<ul>\n<li><tt>pizero_gpslog/tests/data/runfake.sh</tt> - Runs <a href=\"http://www.catb.org/gpsd/gpsfake.html\" rel=\"nofollow\">gpsfake</a> (provided by gpsd) with sample data. Takes optional arguments for <tt><span class=\"pre\">--nofix</span></tt> (data with no GPS fix) or <tt><span class=\"pre\">--stillfix</span></tt> (fix but not moving).</li>\n</ul>\n</div>\n<div id=\"acknowledgements\">\n<h2>Acknowledgements</h2>\n<p>First, many thanks to the developers of gpsd, who have put forth the massive effort to make a script like this relatively trivial.</p>\n<p>Second, thanks to <a href=\"https://github.com/MartijnBraam\" rel=\"nofollow\">Martijn Braam</a>, developer of the MIT-licensed <a href=\"https://github.com/MartijnBraam/gpsd-py3\" rel=\"nofollow\">gpsd-py3</a> package. A modified version of that package makes up the <tt>gpsd.py</tt> module.</p>\n</div>\n\n          </div>"}, "last_serial": 6226071, "releases": {"0.1.3": [{"comment_text": "", "digests": {"md5": "70dfa9d3cbc5eb98d62a4600af106b58", "sha256": "4555933ccfba39aed223665654a7d7c75023fd485be5370473df0349d3506f1b"}, "downloads": -1, "filename": "pizero_gpslog-0.1.3-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "70dfa9d3cbc5eb98d62a4600af106b58", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 37337, "upload_time": "2019-12-02T01:59:40", "upload_time_iso_8601": "2019-12-02T01:59:40.878787Z", "url": "https://files.pythonhosted.org/packages/97/6d/cb62ef2334ab7ac31dbfc04e9715dce2561c2de6083754fcd927c362186e/pizero_gpslog-0.1.3-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9921613f4ab0425c5903085da91299d3", "sha256": "4cf78b423fbb5dcf83140cfa503a4d431b80e08c67556f9932ae760c02898de6"}, "downloads": -1, "filename": "pizero-gpslog-0.1.3.tar.gz", "has_sig": false, "md5_digest": "9921613f4ab0425c5903085da91299d3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 36634, "upload_time": "2019-12-02T01:59:43", "upload_time_iso_8601": "2019-12-02T01:59:43.362313Z", "url": "https://files.pythonhosted.org/packages/65/15/18a703565fd9dbc729cf88c086a2370a0f962ab6bd361050383289fb0ead/pizero-gpslog-0.1.3.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "70dfa9d3cbc5eb98d62a4600af106b58", "sha256": "4555933ccfba39aed223665654a7d7c75023fd485be5370473df0349d3506f1b"}, "downloads": -1, "filename": "pizero_gpslog-0.1.3-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "70dfa9d3cbc5eb98d62a4600af106b58", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 37337, "upload_time": "2019-12-02T01:59:40", "upload_time_iso_8601": "2019-12-02T01:59:40.878787Z", "url": "https://files.pythonhosted.org/packages/97/6d/cb62ef2334ab7ac31dbfc04e9715dce2561c2de6083754fcd927c362186e/pizero_gpslog-0.1.3-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9921613f4ab0425c5903085da91299d3", "sha256": "4cf78b423fbb5dcf83140cfa503a4d431b80e08c67556f9932ae760c02898de6"}, "downloads": -1, "filename": "pizero-gpslog-0.1.3.tar.gz", "has_sig": false, "md5_digest": "9921613f4ab0425c5903085da91299d3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 36634, "upload_time": "2019-12-02T01:59:43", "upload_time_iso_8601": "2019-12-02T01:59:43.362313Z", "url": "https://files.pythonhosted.org/packages/65/15/18a703565fd9dbc729cf88c086a2370a0f962ab6bd361050383289fb0ead/pizero-gpslog-0.1.3.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:53:52 2020"}