{"info": {"author": "Plone Foundation", "author_email": "plone-developers@lists.sourceforge.net", "bugtrack_url": null, "classifiers": ["Environment :: Web Environment", "Framework :: Plone", "Framework :: Plone :: 5.0", "Framework :: Plone :: 5.1", "Framework :: Zope2", "License :: OSI Approved :: GNU General Public License v2 (GPLv2)", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 2.7", "Topic :: Software Development :: Pre-processors"], "description": "Overview\n========\n\nA registry for linked Stylesheet and Javascript files.\n\nThis registry is mainly aimed at solving the following usecases:\n\n- Enable product authors to register stylesheets with their product\n  installers without having to resort to override either header.pt or\n  ploneCustom.css creating potential conflicts with other products.\n\n- Enable more componentialization of the stylesheets provided with Plone\n  (and other products) without having to increase the number of http\n  requests for a Plone page.\n\n- Enable condition checking on stylesheets. Great for variable\n  look-and-feel for groups/roles/folders/departments/content-types/etc\n\n- Enable inline dynamic stylesheets. For those style rules that should\n  vary for each request. Mainly used for things like header-bar-\n  backgroundimages, department colors etc.\n\n- Enable developers to activate/deactivate their styles in a simpler way\n\n- Enable compression to safe bandwidth and download time\n\nUsage\n=====\n\nThe CSSRegistry and JSRegistry are configured through the ZMI. They can be\nfound in the ZMI of your plonesite as 'portal_css' and 'portal_javascript'.\n\nAdd links to stylesheets that exist in your skins paths, by ids;  like\n'plone.css', 'ploneCustom.css' etc.\n\nLinked stylesheets take some parameters:\n\nid -- The id mentioned above. the Zope id of the stylesheet to be used.\n\nbundle -- A resource bundle is like a tag, which can be applied to each\nresource. The default (implicit) bundle is called 'default', but other names\ncan be used. Bundles are associated with themes (skins) on the 'Bundles' tab\nin the ZMI. Note that the same association applies to all resource registries,\ni.e. this is a global setting. Bundles act like a filter - only resources in\nthe bundles listed for the current theme will be included.\n\nexpression -- A CMF expression to be evaluated to check if the stylesheet\nshould be included in output or not.\n\nauthenticated -- Restrict the resource to authenticated users. If this is\nset, the expression is not evaluated.\n\nconditionalcomment -- A small string to be included in a conditional comment\naround the resource. For example, entering simply 'IE' in the field will\nresult in a conditional comment of: <!--[if IE]>...<![endif]--> This behavior\nis currently only enabled for the CSS Registry. For more information see:\nhttp://msdn.microsoft.com/en-us/library/ms537512.aspx\n\nmedia -- The media for which the stylesheet should apply, normally empty or\n'all'. other possible values are 'screen', 'print' etc.\n\nrel -- Link relation. defaults to 'stylesheet', and should almost always\nstay that way. For designating alternative stylesheets.\n\ntitle -- the title for alternate stylesheets\n\nrendering -- How to link the stylesheet from the html page:\n\n- 'import' - the default. normal css import\n\n- 'link' - works better for old browsers and is needed for alternate\n           stylesheets\n\n- 'inline' - render the stylesheet inline instead of linking it\n             externally.\n             Shouldn't be used at all!\n             It isn't possible to create sites which validate if you do.\n             For more information see:\n             http://developer.mozilla.org/en/docs/Properly_Using_CSS_and_JavaScript_in_XHTML_Documents\n\ncompression -- Whether and how much the resource should be compressed:\n\n- 'none' - the original content will not be changed\n\n- 'safe' - the content will be compressed in a way which should be safe\n           for any workarounds for browser bugs. Conditional code for\n           Internet Explorer is preserved since ResourceRegistries\n           1.2.3 and 1.3.1.\n\n- 'full' - the content will be compressed with some additional rules.\n           For css all comments and most newlines are removed, this may\n           break special browser hacks, so use with care.\n           For javascript this encodes variables with special prefixes\n           according to the rules described here (Special Characters):\n           http://dean.edwards.name/packer/usage/\n           The source code needs to be written according to those rules,\n           otherwise it's more than likely that it will break.\n\n- 'safe-encode' - only available for javascript\n- 'full-encode' - only available for javascript\n           Additionally encodes keywords. This heavily compresses the\n           javascript, but it needs to be decoded on the fly in the\n           browser on each load. Depending on the size of the scripts\n           this could lead to timeouts in Firefox.\n           Use with special care!\n\nIf several stylesheets listed directly after each other in the registry have\nthe same parameters and expression, they will be concatenated into a larger,\ncomposite, stylesheet on rendering. - This can be useful for splitting\nstylesheets into smaller components for overrideing, while preserving\ncacheability and minimising the number of http-requests to Plone.\n\nThis tool was started at the excellent SnowSprint 2005 - Organised by\nTelesis in the Austrian Alps. Thanks, Jodok! :)\n\nCredits\n=======\n\n* Florian Schulze -- Independent\n\n* Laurence Rowe -- Independent\n\n* Geir Baekholt -- `Jarn AS <http://www.jarn.com>`__\n\n* Matt Hamilton -- `Netsight Internet Solutions <http://www.netsight.co.uk>`__\n\nJarn AS\n\n* http://www.jarn.com\n\n* info@jarn.com\n\nNetsight Internet Solutions\n\n* http://www.netsight.co.uk\n\n* info@netsight.co.uk\n\n\nChangelog\n=========\n\n3.0.7 (2018-04-08)\n------------------\n\nBug fixes:\n\n- Fix relative import for py3\n  [pbauer]\n\n\n3.0.6 (2018-02-05)\n------------------\n\nBug fixes:\n\n- Add Python 2 / 3 compatibility.  [maurits]\n\n\n3.0.5 (2016-11-17)\n------------------\n\nBug fixes:\n\n- Fix import from Globals that is removed in Zope4.\n  [pbauer]\n\n- Remove tests, since this contains only stubs\n  [tomgross]\n\n\n3.0.4 (2016-08-18)\n------------------\n\nFixes:\n\n- ``_setId`` was incorrectly rising ``ValueError`` making it impossible to rename an external resource.\n  [hvelarde]\n\n- Use zope.interface decorator.\n  [gforcada]\n\n\n3.0.3 (2015-09-22)\n------------------\n\n- bugfix: Handle theme names containing a `.` properly in ``manage_bundlesForm``\n  [fRiSi]\n\n\n3.0.2 (2015-05-04)\n------------------\n\n- Comment out views from old resource registry so it does not render\n  them on Plone 5.  Meanwhile we don't remove the product.  It is\n  planned to be removed on Plone 5.1.\n  [bloodbare]\n\n\n3.0.1 (2014-10-23)\n------------------\n\n- Use ``application/javascript`` instead of ``application/x-javascript`` for\n  the ``Content-Type`` http header of JavaScript resources. Also see:\n  http://stackoverflow.com/questions/9664282\n  [thet]\n\n- bugfix: do not convert URIs such as\n  url(data:image/svg+xml;base64,PD94bWwgdmVyc2lv) to absolute urls\n  see https://github.com/plone/Products.ResourceRegistries/pull/16\n  [cillianderoiste]\n\n- Include ``insert-after`` as an attribute when exporting ResourceRegistries.\n  [saily]\n\n\n3.0 (2014-04-05)\n----------------\n\n- add csrf token to delete urls for resources\n  [vangheem]\n\n- Properly handle redirections from login view; resources used to be erased\n  on authentication redirect for POST action\n  [mihneasim]\n\n- Replace troublesome HTTP_REFERER redirects, they can lead to infinite\n  redirects on expired session re-login\n  [mihneasim]\n\n- Don't try to traverse to remote objects starting with '//', triggered\n  from plone.css\n  [eleddy]\n\n\n2.2.9 (2013-06-13)\n------------------\n\n- Allow users to add resources starting with '//', the proper way to link\n  to external resources when serving over http and https. This makes it\n  much easier to manage content on CDNs.\n  [eleddy]\n\n\n2.2.8 (2013-05-23)\n------------------\n\n- Avoid recursive call of _migrateCookedResouces method in BaseTool which\n  prevented the old concatenated resource storage from beeing migrated.\n  The problem emerged when migrating from Plone 4.2 to 4.3.\n  [thet]\n\n\n2.2.7 (2013-03-05)\n------------------\n\n- Fixed some spurious test failures for Expires being off by\n  minus one second.\n  [maurits]\n\n\n2.2.6 (2013-01-17)\n------------------\n\n- Raise width of resource-id input fields in ZMI from 30 to 80, so that browser\n  resource ids can be shown as whole.\n  [thet]\n\n- Fixed spurious test failures for Expires being off by one second.\n  [maurits]\n\n\n2.2.5 (2013-01-13)\n------------------\n\n- Detect when CSS configuration will cause them to be marked as alternate\n  by browsers and warn the user.\n  [MatthewWilkes]\n\n\n2.2.4 (2012-12-09)\n------------------\n\n- Add some space between up/down and remove links in ZMI\n  [maartenking]\n\n2.2.3 (2012-10-16)\n------------------\n\n- Don't break if the site doesn't have a portal_kss registry.\n  [davisagli]\n\n\n2.2.2 (2012-08-29)\n------------------\n\n- Changed deprecated getSiteEncoding to hardcoded `utf-8`\n  [tom_gross]\n\n2.2.1 (2012-08-11)\n------------------\n\n- Make it possible to change the default bundles for a theme by\n  assigning bundles to '(default)'\n  [davisagli]\n\n2.2 (2012-07-02)\n----------------\n\n- Change BaseRegistryTool.deferredGetContent method to use\n  OFS.File.update_data instead of OFS.File.manage_upload. The\n  manage_upload method is a \"ZMI\" API.  By calling manage_upload\n  an ObjectModifiedEvent would be generated for every resource\n  served from the registry.  Let's do less work.\n  [runyaga]\n\n2.1.2 (2012-05-25)\n------------------\n\n- Fix test failure under Plone 4.2.\n  [hannosch]\n\n- using hashlib.md5 (fixing a deprecation warning)\n  [ajung]\n\n\n2.1.1 (2012-05-07)\n------------------\n\n- Added theme-parameter for getResourceContent for JavaScriptRegistry.\n  Even if it is unused it now allows the same arguments as the\n  BaseRegistry\n  [tom_gross]\n\n- Added support for OFS.Image.File-objects using OFS.Image.PData\n  This fixes https://dev.plone.org/ticket/12479\n  [datakurre]\n\n2.1 (2012-04-18)\n----------------\n\n- Use iterative magic number generation based on the properties of all\n  included resources (for each concatenated resource).\n\n  This fixes an issue with external caches where resources for\n  different content would sometimes get assigned the same resource id\n  (due to the previous implementation using a random integer), making\n  it impossible to cache a resource correctly without additional\n  information.\n  [malthe]\n\n\n2.1a1 (2011-06-28)\n------------------\n\n- Add bundle concept - a bundle is a string tag against a resource, which can\n  be used to filter resources by theme. Each theme has a list of enabled\n  bundles, managed on the 'Bundles' tab in the ZMI (note that this is global).\n  [optilude]\n\n- Fix handling of the purge attribute on import.\n  [rossp]\n\n\n2.0.8 (2012-03-14)\n------------------\n\n- Add time element. This is necessary for the generated ids to update\n  on any save, to reflect possible updates in the served content.\n  [malthe]\n\n\n2.0.7 (2012-03-14)\n------------------\n\n- Fixed ZMI screens to render for resources containing query strings in their\n  ids, like found in the plone.session refresh support.\n  [hannosch]\n\n\n2.0.6 (2011-11-24)\n------------------\n\n- Fixed \"AttributeError: 'FileResourceXX' object has no attribute 'POST'\n  when displaying inline resources when using a POST request.\n  Fixes http://dev.plone.org/ticket/8998\n  [maurits]\n\n\n2.0.5 - 2011-07-19\n------------------\n\n- Switched <link rel=\"kinetic-stylesheet\" type=\"text/css\" /> to <link\n  rel=\"stylesheet\" data-rel=\"kinetic-stylesheet\" type=\"text/kss\" /> to fix HTML5\n  validation. References http://dev.plone.org/plone/ticket/11300\n  [spliter]\n\n- Add MANIFEST.in.\n  [WouterVH]\n\n\n2.0.4 - 2011-04-15\n------------------\n\n- Bugfix for #9849. Incomplete caching.\n  [do3cc]\n\n\n2.0.3 - 2011-03-02\n------------------\n\n- Support merging of resources that return IStreamIterators\n  [optilude]\n\n\n2.0.2 - 2010-07-18\n------------------\n\n- Update license to GPL version 2 only.\n  [hannosch]\n\n\n2.0.1 - 2010-07-15\n------------------\n\n- Silence the `Nothing to import.` log messages.\n  [hannosch]\n\n\n2.0 - 2010-07-01\n----------------\n\n- Changed the registries moveResourceAfter and moveResourceBefore methods to\n  gracefully handle missing destination ids. This is useful for GenericSetup\n  upgrade steps to work even if the resources specified in \"insert-after\" or\n  \"insert-before\" do not exist.\n  [hannosch]\n\n\n2.0b5 - 2010-06-13\n------------------\n\n- Avoid deprecation warnings under Zope 2.13.\n  [hannosch]\n\n- Adjusted tests to match new content-type for JavaScript in Zope 2.12.7+.\n  [hannosch]\n\n\n2.0b4 - 2010-06-03\n------------------\n\n- Add purge support to export/import handlers.\n  [elro]\n\n- Fix the authenticated checkbox on the kss form.\n  [elro]\n\n\n2.0b3 - 2010-05-01\n------------------\n\n- Add an option 'applyPrefix' to stylesheets. This can be set in the UI, in\n  the various constructor methods, or as an attribute in a cssregistry.xml\n  file. It defaults to false. It has no effect in debug mode. In non-debug-\n  mode, however, it will parse a stylesheet for 'url()' statements that\n  contain *relative* paths. These will be prefixed with the Plone site path.\n  If the stylesheet id contains a path (e.g. '++resource++foo/css/bar.css')\n  this will be used in the prefix as well. The goal is to make relative paths\n  internal to a resource directory work, even when resource merging is used.\n  Previously, it'd break because resource merging changes the URL.\n  [optilude]\n\n\n2.0b2 - 2010-01-24\n------------------\n\n- Apply a marker interface ICookedFile to the files created on the fly for\n  cooked/concatenated resources returned by ResourceRegistries. This makes\n  it easier to detect these for caching purposes and treat them differently\n  to in-ZODB files, which may also be instances of OFS.Image.File.\n  [optilude]\n\n\n2.0b1 - 2009-12-27\n------------------\n\n- Marked zope.component as a real dependency of this package.\n  [hannosch]\n\n\n2.0a2 - 2009-12-20\n------------------\n\n- Cleaned up some old charset related fallback code.\n  [hannosch]\n\n- Changed the development mode to be a non-persistent setting. By default it\n  follows the Zope development mode (bin/instance fg vs. bin/instance console).\n  The setting can be changed during process runtime.\n  [hannosch]\n\n\n2.0a1 - 2009-11-16\n------------------\n\n- Declare 'screen' to be the default for the media attribute instead of None.\n  It is the most commonly used one in Plone's own themes.\n  [hannosch]\n\n- Fixed typo in update process of authenticated resources. Fixes #9599\n  [naro]\n\n- Fixed JS packer to be a little less greedy about protecting regular\n  expressions. This fixes #8790.\n  [dunlapm]\n\n- Changed the order of CSS/JS rendering, CSS now renders first to allow the\n  browser to get it as soon as possible, to avoid the \"flash of unstyled\n  content\"\n  [limi]\n\n- Removed some whitespace in the rendering templates for JS, CSS and KSS to make\n  the source rendering more readable. These are very small and understandable\n  templates, so we'd rather have some noise there than on the front end.\n  [limi]\n\n- Removed the `autogroupingmode` feature. In practice it turned out to work\n  not so well and caused hard to debug problems.\n  [hannosch]\n\n- Automatically set the registries into development mode if Zope itself runs\n  in development mode.\n  [hannosch]\n\n- Get the tests working again under Plone 5 and make sure we handle\n  zope.app.publisher file resources correctly under repoze.zope2.\n  [hannosch]\n\n- Added missing InitializeClass call for BaseRegistryTool.\n  [davisagli]\n\n- Changed default values for resources to more sensible values.\n  [hannosch]\n\n- Restructured documentation files.\n  [hannosch]\n\n- Added `authenticated` as a new option to all resources. If a resource is\n  marked this way, it will only be shown for authenticated users. This makes\n  the most common use-case of restricting resources to logged-in users easier\n  and allows to optimize the internal API for speed for this use-case. An\n  expression on a resource is ignored if the authenticated flag is set.\n  [hannosch]\n\n- Removed BBB imports and code. We require Zope 2.12 now.\n  [hannosch]\n\n- Handle a missing portal_kss tool gracefully in the kineticstylesheets\n  viewlet.\n  [hannosch]\n\n- Added BBB imports to make sure the InitializeClass can be imported in\n  Zope versions before 2.12.\n  [hannosch]\n\n- Avoid dependency on the zope.app.zapi package.\n  [hannosch]\n\n- Declare package dependencies, fixed deprecation warnings for use of\n  Globals and changed error raising to be forward compatible.\n  [hannosch]\n\n- Change the fix for #7522 made in 1.4.3. For inline resources we pass\n  Unicode down into the page templates. The TAL machinery expects to get\n  Unicode and not encoded strings.\n  [hannosch]\n\n\n1.5.3 - 2009-05-17\n------------------\n\n- Allow setting of debug mode in registries through Generic Setup\n  profiles. This closes http://dev.plone.org/plone/ticket/8712\n  [dunlapm]\n\n- Fixed error with inline z3resources not being able to handle a POST\n  request. This fixes http://dev.plone.org/plone/ticket/8998\n  [dunlapm]\n\n\n1.5.2 - 2009-04-21\n------------------\n\n- Fixed error with the conditional comment being lost when adding a new\n  Resource when adding a new entry to the JS or CSS registries.\n  [dunlapm]\n\n- Fixed error with GS Export/Import. Fixes\n  http://dev.plone.org/plone/ticket/9154\n  [dunlapm]\n\n\n1.5.1 - 2009-04-14\n------------------\n\n- Put CDATA start and end markers in a javascript comment. Fixes\n  http://dev.plone.org/plone/ticket/9128\n  [wichert]\n\n\n1.5.0 - 2009-03-01\n------------------\n\n- Removed the uppermost Save button from the ZMI pages for registries.\n  Clicking this button before the registry page has finished loading could\n  lead to data loss.\n  [dunlapm, fschulze]\n\n- Resources beginning with \"http://\" or \"https://\" are now valid and may be\n  included as resources. Registries will automatically disable merging,\n  caching, compression, and inline rendering of external resources. This\n  closes http://dev.plone.org/plone/ticket/8312\n  [dunlapm, fschulze]\n\n- Added option to have a conditional comment attached to a given resource.\n  Currently the UI only supports this behavior with the CSS and JavaScript\n  Registries, but the underpinnings for the KSS registry is in place.\n  This closes http://dev.plone.org/plone/ticket/5521\n  [dunlapm, fschulze]\n\n- Do not try to export the `cooked_expression` into the GenericSetup\n  profiles. It is only an internal optimization and the value is reflected\n  in the `expression` value.\n  [hannosch]\n\n- Store the cooked expressions as a real persistent expression object,\n  instead of compiling the expression on every view.\n  [hannosch]\n\n- Added 'context' as an alias for 'object' in action expressions.\n  [davisagli, hannosch]\n\n\n1.4.3 - 2008-10-08\n------------------\n\n- Eggified into Products.ResourceRegistries.\n\n- Fixed error where non-traversable resources could be registered. This closes\n  http://dev.plone.org/plone/ticket/8153\n  [dunlapm]\n\n- Ensure that resources can be removed in xml.\n  [maurits]\n\n- Purge old zope2 Interface interfaces for Zope 2.12 compatibility.\n  [elro]\n\n- Encode inline resources using the site encoding.\n  Fixes http://dev.plone.org/plone/ticket/7522\n  [wichert]\n\n- Fixed potential Acquisition problems in viewlets.\n  [hannosch]\n\n\n1.4.2 - 2008-03-06\n------------------\n\n- Properly encode the resource id. This fixes moving of resource without JS\n  and removing recources which contain special chars like plus signs.\n  Fixes http://dev.plone.org/plone/ticket/7482\n  [fschulze]\n\n- Revert part of r7143: returning NotFound from a API call is never\n  the right thing to do since it makes the publisher show a object-not-found\n  page, hiding the real error. Restore the old behaviour and raise a\n  ValueError instead. This fixes mysterious not-found errors from\n  GenericSetup imports.\n  [wichert]\n\n- Support Z3 template resources (not just file and image resources).\n  [mj]\n\n\n1.4.1 - 2007-10-10\n------------------\n\n- Added '/' to the strings that are filtered out in\n  BaseRegistry.generateId(). This fixes #7048.\n  [davconvent]\n\n\n1.4.0 - 2007-08-16\n------------------\n\n- Add support for automatic grouping mode to the GenericSetup export/import\n  code.\n  [wichert]\n\n\n1.4.0-rc1 - 2007-07-09\n----------------------\n\n- Added a new automatic grouping mode feature. It is turned off by default.\n  When enabled the resources will first be sorted into groups with the same\n  merging-relevant settings and after that merged. In the groups the order of\n  the resources in the registries will be preserved.\n  [hannosch]\n\n- Changed the exportimport handlers to only cook the resources once at the end\n  and not after each new resource has been added.\n  [hannosch]\n\n\n1.4.0-beta5 - 2007-05-02\n------------------------\n\n- Fixed setting of cache headers when the registry is associated with a\n  RAMCache.\n  [fschulze]\n\n\n1.4.0-beta4 - 2007-04-30\n------------------------\n\n- Switched back to getToolByName.\n  [wichert]\n\n- Added portal_kss as registry for kss files.\n  [fschulze]\n\n- Slightly optimized the viewlet manager templates.\n  [hannosch]\n\n\n1.4.0-beta3 - 2007-03-25\n------------------------\n\n- Replace usage of getToolByNames with getUtility.\n  [wichert, hannosch]\n\n\n1.4.0-beta2 - 2007-03-01\n------------------------\n\n- Reverted fix of tests, because Zope was wrong.\n  [fschulze]\n\n\n1.4.0-beta1 - 2007-02-27\n------------------------\n\n- Fixed test failures caused by changes in Zope 2.10.\n  [fschulze]\n\n- Ported bugfixes from 1.3 line.\n  [fschulze]\n\n\n1.4.0-alpha2 - 2007-02-11\n-------------------------\n\n- Started to use views and viewlet managers.\n  [fschulze]\n\n- Removed compatibility stuff for Plone version lower than 3.0.\n  [fschulze]\n\n\n1.3.8 - 2007-04-16\n------------------\n\n- Cook resources after GS profile import.\n  [fschulze]\n\n- Added missing enabled property handling to updateScript.\n  [fschulze]\n\n- Fixed typo which prevented position-after/insert-after in GS profiles to\n  work.\n  [fschulze]\n\n\n1.3.7 - 2007-03-25\n------------------\n\n- For compatibility with GenericSetup conventions, the import steps now\n  support 'insert-before' and  'insert-after' as aliases for\n  'position-before' and 'position-after', while 'insert-top' and\n  'insert-bottom' are aliases for 'position-top' and 'position-bottom',\n  respectively.\n  [mj]\n\n\n1.3.6 - 2007-02-27\n------------------\n\n- Invalidate cache when cooking resources if the registry is assigned to a\n  RAMCache or similar cache manager.\n\n- Fixed string replacement during packing when several resources got packed\n  in different threads at once, which resulted in exchanged strings.\n  [fschulze]\n\n\n1.3.5 - 2007-02-11\n------------------\n\n- Fixed string protection for strings which mix single and double quotes.\n  [fschulze]\n\n- Made packer.py usable as a standalone commandline tool.\n  [fschulze]\n\n- Fixed several issues in 'full' compression.\n  [fschulze]\n\n- Extended the GenericSetup import step to support positioning of resources:\n  the 'position-before' and 'position-after' attributes cause the resource\n  to be positioned before or after resource named in the attribute.\n  'position-top' and 'position-bottom' move a resource to the top or bottom.\n  [mj]\n\n\n1.3.4 - 2007-01-03\n------------------\n\n- Improved IE conditional compilation protection, it now works in \"full\"\n  compression.\n  [fschulze]\n\n- Improved regular expression for strings.\n  [fschulze]\n\n- Fixed order of oneline and multiline comment removal in javascript packer.\n  [fschulze]\n\n- Fixed validation warning about multiple comments when rendering resources\n  inline.\n  [fschulze]\n\n- Made css \"full\" packing more aggressive.\n  [fschulze]\n\n- Cleaned up testing framework and made all tests run properly.\n  [fschulze, hannosch]\n\n\n1.3.3 - 2006-12-13\n------------------\n\n- Don't wrap None in aquisition wrapper if resource is not found.\n  [tesdal]\n\n\n1.3.2 - 2006-09-11\n------------------\n\n- Made GenericSetup importer not fail on repeated imports.\n  [alecm]\n\n- Made enabled checkbox work again.\n  [fschulze]\n\n\n1.3.1 - 2006-08-17\n------------------\n\n- Enable use of z3 / Five resources.\n  [ree]\n\n- Mark missing or unaccessible ressources in management screens.\n  [fschulze]\n\n- Moved 'enabled' checkbox into legend before 'id' textbox.\n  [fschulze]\n\n- Don't remove conditional compile instructions for IE from javascripts.\n  [fschulze]\n\n- Fixed error when content is unicode.\n  [rocky]\n\n\n1.3 - 2006-07-16\n----------------\n\n- No changes since rc1.\n\n\n1.3-rc1 - 2006-06-02\n--------------------\n\n- Add patch from jenner to handle updating and removal of resources\n  from GenericSetup profiles.\n  [wichert]\n\n\n1.3-beta2 - 2006-05-17\n----------------------\n\n- Included fixes from the 1.2 line.\n  [fschulze]\n\n\n1.3-beta1 - 2006-03-31\n----------------------\n\n- Do not install default CSS and JS on upgrade, only on initial installation.\n  [wichert]\n\n\n1.3-alpha1 - 2006-02-24\n-----------------------\n\n- Added GenericSetup import/export handlers (to support GS-based Plone 2.5\n  portal creation)\n  [rafrombrc]\n\n\n1.2.4 - 2006-09-11\n------------------\n\n- Made enabled checkbox work again.\n  [fschulze]\n\n\n1.2.3 - 2006-09-06\n------------------\n\n- Backported several fixes from 1.3.1:\n  [fschulze]\n\n- Enable use of z3 / Five resources.\n  [ree]\n\n- Mark missing or unaccessible ressources in management screens.\n  [fschulze]\n\n- Moved 'enabled' checkbox into legend before 'id' textbox.\n  [fschulze]\n\n- Don't remove conditional compile instructions for IE from javascripts.\n  [fschulze]\n\n- Fixed error when content is unicode.\n  [rocky]\n\n\n1.2.2 - 2006-05-15\n------------------\n\n- Added missing arguments in resource adding functions.\n  [jenner, fschulze]\n\n\n1.2.1 - 2006-04-13\n------------------\n\n- Fixed traversal of security restricted resources.\n  [jenner, alecm, fschulze]\n\n- Added javascript \"full\" compression, which achieves higher compression ratios\n  by doing variable name packing based on the rules from Dean Edwards packer:\n  http://dean.edwards.name/packer/usage/\n  [fschulze]\n\n- Added keyword encoding for javascript. This greatly reduces the file size of\n  javascript files, but adds a small performance hit on the client for the\n  decoding.\n  [fschulze]\n\n\n1.2 - 2006-02-24\n----------------\n\n- Added compression for CSS and Javascript resources.\n  [fschulze]\n\n- Added better labels and a short explanation to the debugmode-checkbox in the forms.\n  [elvix]\n\n- Renamed 'TAL condition' to 'Condition' in the forms, as it has nothing to do with\n  TAL at all (it is a CMF/TALES expression) It should include a link to CMF Expressions help\n  [elvix]\n\n\n1.1 - 2006-11-22\n----------------\n\n- Fixed cooking of resources to ensure that uncookable resources are not merged.\n  [elro]\n\n- Fixed tests for unauthorized to accept a 401 as an unauthorized error.\n  [elro]\n\n- Fixed setDebugMode to recook resources after being changed.\n  [elro]\n\n\n1.1b1\n-----\n\n- Added checkbox to configure cacheability of resources.\n  [fschulze]\n\n- Made registries cacheable. This is most useful with the RAMCacheManager.\n  Just associate portal_css and portal_javascripts with the RAMCache.\n  [fschulze]\n\n- Apply magic id to all resources when not in debug mode, so invalidation\n  works.\n  [fschulze]\n\n- Made skin aware. This now depends on getCurrentSkinName added in CMF 1.5.5.\n  [elro]\n\n\n1.0.5 - 2005-09-09\n------------------\n\n- Fixed encoding of javascripts.\n  [fschulze]\n\n\n1.0.4 - 2005-09-03\n------------------\n\n- Fixed reordering of resources with javascript.\n  [fschulze]\n\n\n1.0.3 - 2005-08-17\n------------------\n\n- Fixed typo in the migration external method which lead to portal_javascripts\n  not being migrated.\n  [fschulze]\n\n- Small fixes to UI.\n  [limi]\n\n\n1.0.2 - 2005-08-09\n------------------\n\n- Fix for bug #4392, where merging FSfiles could mess up http-status headers\n  and cause weird hanging in browsers.\n  [plonista, fschulze, elvix]\n\n\n1.0.1\n-----\n\n- Don't filter resources in merged overview in ZMI.\n  [fschulze]\n\n- Improved management UI.\n  [limi, fschulze]\n\n- Fixed reinstall bug due to improper resource id lookup.\n  [alecm]\n\n\n1.0 - 2005-08-01\n----------------\n\n- Moved directory with skin layer for Plone 2.0.5 compatibility to product\n  root, so it doesn't interfere with Plone 2.1. The version check on install\n  time didn't seem to be enough.\n  [fschulze]\n\n- getTitle and getMedia will return None now if they are empty, this removes\n  empty title and media attributes from the generated HTML.\n\n- Fixed reordering of resources in ZMI when javascript is enabled.\n  [fschulze, jenner]\n\n- Fixed submitting changes in ZMI for stylesheets on IE.\n  [fschulze]\n\n\n0.95 - 2005-07-03\n-----------------\n\n- Added getResource function. This allows to change properties of each\n  resource. After that, a call to cookResources is needed.\n  [fschulze]\n\n- Added getResourceIds function.\n  [fschulze]\n\n- Added test for context dependancy to inline css rendering.\n  [dom]\n\n- Now uses restrictedTraverse() rather than getattr() for returning resources,\n  to provide support for resources held within the ZODB.\n  [dom]\n\n- Added a \"is merging allowed?\" option (\"cookable\" property) to determine where\n  a resource can be merged (default True). This was added because objects in\n  the ZODB may have variable permissions but be merged together. Whilst the\n  objects are checked at each REQUEST, a new REQUEST won't actually be made\n  each time because of the cache headers set on merged resources. If this\n  worries you, the simplest solution is not to merge such resources, hence this\n  option.\n  [dom]\n\n- Added renameResource function with tests.\n  [fschulze]\n\n- In Plone 2.1 plone_javascripts.js was removed, fixed tests by using\n  jstest.js from our own skin.\n  [dom]\n\n\n0.9\n---\n\n- Fixed function of enabled checkbox when adding css/javascript from ZMI.\n  Added title field to the 'add stylesheet' part in the ZMI.\n  [fschulze]\n\n- Added migration script for old instances. Just create a external method with\n  id 'migrate_resourceregistries', Module Name 'ResourceRegistries.migrate' and\n  Function Name 'migrate' and click on the 'Test' tab.\n  [fschulze]\n\n- Cleaned up imports and whitespaces. Code standardization and small\n  improvements. Fixed ZMI templates XHTML markup.\n  [deo]\n\n- Refactored the two registries to use one common base class.\n  [fschulze]\n\n- Refactored moving functions, so we have more possibilities. The API reflects\n  the IOrderedContainer one.\n  [fschulze]\n\n- Fix order of javascripts, the topmost in the management screen also needs\n  to be the topmost in the resulting source.\n  [fschulze]\n\n- Added debugmode where scripts are not concatenated. This will let things\n  like the javascript console point to the right line-number. And makes it\n  easier to develop, because there is no caching of the scripts.\n  [fschulze]\n\n- Fixed cooking of stylesheets so that composite stylesheets get correct\n  media settings. Thanks a lot to Denis Mishunoff[spliter] for discovery,\n  investigation and suggested fix\n  [elvix]\n\n- Fixed some security declarations.\n  [fschulze]\n\n- Made moving of stylesheets and javascripts in ZMI possible without javascript\n  being enabled in the browser.\n  [fschulze]\n\n- Moved 2.0.5 header.pt to skins/ResourceRegistries_20compatibility and\n  remove ResourceRegistries_20compatibility when Plone != 2.0.x\n  [fschulze]\n\n- Check existance of stylesheets and javascripts before registering. This\n  fixes reinstallation.\n  [fschulze]\n\n- Removed duplicate getScripts function definition in tools/JSRegistry.py\n  [fschulze]\n\n- Fixed JSRegistry for Plone < 2.1 where plone_utils.getSiteEncoding is not\n  available.\n  [fschulze]\n\n- Renamed config.TOOLNAME to config.CSSTOOLNAME\n  and config.TOOLTYPE to config.CSSTOOLTYPE\n  [batlogg]\n\n- Added tests for attributes on stylesheets. About time.\n  [elvix]\n\n- Added title for alternate stylesheets.\n  [fschulze]\n\n- Removing superflous skins directories.\n  [elvix]\n\n- Added new debugmode where stylesheets are not concatenated. This will let\n  things like the DOM inspector in Mozilla point to the right line-number.\n  [ldr] [elvix]\n\n- Added bugfix for handling disabled items when cooking stylesheets.\n  [fschulze]\n\n\n0.8 - 2005-05-21\n----------------\n\n- Renamed to ResourceRegistries instead of the historical and wrong\n  CSSRegistry.\n  [elvix]\n\n- Upgraded JSRegistry to have a more proper ZMI form, now with reordering\n  support.\n  [elvix]\n\n- Changed the order elements are added to the JSRegistry.\n  [elvix]\n\n- Added license/copyright notice to composite files (neccesary for including\n  for third party stuff).\n  [elvix]\n\n- Bugfix fixing ZMI form for CSSRegistry.\n  [fschulze]\n\n\n0.7\n---\n\n- Added to Plone 2.1 migrations, added installation of the default\n  Plone javascripts and stylesheets.\n  [elvix]\n\n- Make sure we intercept all requests for objects, even those already\n  present in the acquisition chain. Override __bobo_traverse__.\n  [elvix]\n\n- Handle cache settings in http headers for served files.\n  [elvix]\n\n- Handle http headers for inline scripts and stylesheets.\n  [elvix]\n\n- Use explicit </script> tag since these pages are being served as\n  text/html. Both IE and firefox will have problems otherwise.\n  [bmh]\n\n\n0.6 and earlier\n---------------\n\n- Added a simple readme with basic documentation.\n  [elvix]\n\n- Started HISTORY.txt (somewhat late perhaps, but better than never).\n  [elvix]\n\n- Cleaned up forms. Better alignment.\n  [elvix]\n\n- Separate JSRegistry and CSSRegistry to two tools.\n  [elvix]\n\n- Lots of changes, numerous fixes.\n  [elvix]\n\n\nSnowsprint 2005\n---------------\n\n- Designed and built first version of the CSSregistry.\n  [HammerToe, elvix]\n\n\n", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://pypi.python.org/pypi/Products.ResourceRegistries", "keywords": "CSS Javascript Zope Packer", "license": "GPL version 2", "maintainer": "", "maintainer_email": "", "name": "Products.ResourceRegistries", "package_url": "https://pypi.org/project/Products.ResourceRegistries/", "platform": "", "project_url": "https://pypi.org/project/Products.ResourceRegistries/", "project_urls": {"Homepage": "https://pypi.python.org/pypi/Products.ResourceRegistries"}, "release_url": "https://pypi.org/project/Products.ResourceRegistries/3.0.7/", "requires_dist": ["setuptools", "six", "zope.component", "zope.interface", "zope.viewlet", "Products.CMFCore", "plone.protect (>=3.0.0a1)", "Products.GenericSetup", "Acquisition", "DateTime", "ZODB3", "Zope2", "plone.app.registry", "zope.contentprovider; extra == 'test'"], "requires_python": "", "summary": "Registry for managing CSS and JS", "version": "3.0.7", "yanked": false, "html_description": "<div class=\"project-description\">\n            <div id=\"overview\">\n<h2>Overview</h2>\n<p>A registry for linked Stylesheet and Javascript files.</p>\n<p>This registry is mainly aimed at solving the following usecases:</p>\n<ul>\n<li>Enable product authors to register stylesheets with their product\ninstallers without having to resort to override either header.pt or\nploneCustom.css creating potential conflicts with other products.</li>\n<li>Enable more componentialization of the stylesheets provided with Plone\n(and other products) without having to increase the number of http\nrequests for a Plone page.</li>\n<li>Enable condition checking on stylesheets. Great for variable\nlook-and-feel for groups/roles/folders/departments/content-types/etc</li>\n<li>Enable inline dynamic stylesheets. For those style rules that should\nvary for each request. Mainly used for things like header-bar-\nbackgroundimages, department colors etc.</li>\n<li>Enable developers to activate/deactivate their styles in a simpler way</li>\n<li>Enable compression to safe bandwidth and download time</li>\n</ul>\n</div>\n<div id=\"usage\">\n<h2>Usage</h2>\n<p>The CSSRegistry and JSRegistry are configured through the ZMI. They can be\nfound in the ZMI of your plonesite as ‘portal_css’ and ‘portal_javascript’.</p>\n<p>Add links to stylesheets that exist in your skins paths, by ids;  like\n‘plone.css’, ‘ploneCustom.css’ etc.</p>\n<p>Linked stylesheets take some parameters:</p>\n<p>id – The id mentioned above. the Zope id of the stylesheet to be used.</p>\n<p>bundle – A resource bundle is like a tag, which can be applied to each\nresource. The default (implicit) bundle is called ‘default’, but other names\ncan be used. Bundles are associated with themes (skins) on the ‘Bundles’ tab\nin the ZMI. Note that the same association applies to all resource registries,\ni.e. this is a global setting. Bundles act like a filter - only resources in\nthe bundles listed for the current theme will be included.</p>\n<p>expression – A CMF expression to be evaluated to check if the stylesheet\nshould be included in output or not.</p>\n<p>authenticated – Restrict the resource to authenticated users. If this is\nset, the expression is not evaluated.</p>\n<p>conditionalcomment – A small string to be included in a conditional comment\naround the resource. For example, entering simply ‘IE’ in the field will\nresult in a conditional comment of: &lt;!–[if IE]&gt;…&lt;![endif]–&gt; This behavior\nis currently only enabled for the CSS Registry. For more information see:\n<a href=\"http://msdn.microsoft.com/en-us/library/ms537512.aspx\" rel=\"nofollow\">http://msdn.microsoft.com/en-us/library/ms537512.aspx</a></p>\n<p>media – The media for which the stylesheet should apply, normally empty or\n‘all’. other possible values are ‘screen’, ‘print’ etc.</p>\n<p>rel – Link relation. defaults to ‘stylesheet’, and should almost always\nstay that way. For designating alternative stylesheets.</p>\n<p>title – the title for alternate stylesheets</p>\n<p>rendering – How to link the stylesheet from the html page:</p>\n<ul>\n<li>‘import’ - the default. normal css import</li>\n<li><dl>\n<dt>‘link’ - works better for old browsers and is needed for alternate</dt>\n<dd>stylesheets</dd>\n</dl>\n</li>\n<li><dl>\n<dt>‘inline’ - render the stylesheet inline instead of linking it</dt>\n<dd>externally.\nShouldn’t be used at all!\nIt isn’t possible to create sites which validate if you do.\nFor more information see:\n<a href=\"http://developer.mozilla.org/en/docs/Properly_Using_CSS_and_JavaScript_in_XHTML_Documents\" rel=\"nofollow\">http://developer.mozilla.org/en/docs/Properly_Using_CSS_and_JavaScript_in_XHTML_Documents</a></dd>\n</dl>\n</li>\n</ul>\n<p>compression – Whether and how much the resource should be compressed:</p>\n<ul>\n<li>‘none’ - the original content will not be changed</li>\n<li><dl>\n<dt>‘safe’ - the content will be compressed in a way which should be safe</dt>\n<dd>for any workarounds for browser bugs. Conditional code for\nInternet Explorer is preserved since ResourceRegistries\n1.2.3 and 1.3.1.</dd>\n</dl>\n</li>\n<li><dl>\n<dt>‘full’ - the content will be compressed with some additional rules.</dt>\n<dd>For css all comments and most newlines are removed, this may\nbreak special browser hacks, so use with care.\nFor javascript this encodes variables with special prefixes\naccording to the rules described here (Special Characters):\n<a href=\"http://dean.edwards.name/packer/usage/\" rel=\"nofollow\">http://dean.edwards.name/packer/usage/</a>\nThe source code needs to be written according to those rules,\notherwise it’s more than likely that it will break.</dd>\n</dl>\n</li>\n<li>‘safe-encode’ - only available for javascript</li>\n<li><dl>\n<dt>‘full-encode’ - only available for javascript</dt>\n<dd>Additionally encodes keywords. This heavily compresses the\njavascript, but it needs to be decoded on the fly in the\nbrowser on each load. Depending on the size of the scripts\nthis could lead to timeouts in Firefox.\nUse with special care!</dd>\n</dl>\n</li>\n</ul>\n<p>If several stylesheets listed directly after each other in the registry have\nthe same parameters and expression, they will be concatenated into a larger,\ncomposite, stylesheet on rendering. - This can be useful for splitting\nstylesheets into smaller components for overrideing, while preserving\ncacheability and minimising the number of http-requests to Plone.</p>\n<p>This tool was started at the excellent SnowSprint 2005 - Organised by\nTelesis in the Austrian Alps. Thanks, Jodok! :)</p>\n</div>\n<div id=\"credits\">\n<h2>Credits</h2>\n<ul>\n<li>Florian Schulze – Independent</li>\n<li>Laurence Rowe – Independent</li>\n<li>Geir Baekholt – <a href=\"http://www.jarn.com\" rel=\"nofollow\">Jarn AS</a></li>\n<li>Matt Hamilton – <a href=\"http://www.netsight.co.uk\" rel=\"nofollow\">Netsight Internet Solutions</a></li>\n</ul>\n<p>Jarn AS</p>\n<ul>\n<li><a href=\"http://www.jarn.com\" rel=\"nofollow\">http://www.jarn.com</a></li>\n<li><a href=\"mailto:info%40jarn.com\">info<span>@</span>jarn<span>.</span>com</a></li>\n</ul>\n<p>Netsight Internet Solutions</p>\n<ul>\n<li><a href=\"http://www.netsight.co.uk\" rel=\"nofollow\">http://www.netsight.co.uk</a></li>\n<li><a href=\"mailto:info%40netsight.co.uk\">info<span>@</span>netsight<span>.</span>co<span>.</span>uk</a></li>\n</ul>\n</div>\n<div id=\"changelog\">\n<h2>Changelog</h2>\n<div id=\"id1\">\n<h3>3.0.7 (2018-04-08)</h3>\n<p>Bug fixes:</p>\n<ul>\n<li>Fix relative import for py3\n[pbauer]</li>\n</ul>\n</div>\n<div id=\"id2\">\n<h3>3.0.6 (2018-02-05)</h3>\n<p>Bug fixes:</p>\n<ul>\n<li>Add Python 2 / 3 compatibility.  [maurits]</li>\n</ul>\n</div>\n<div id=\"id3\">\n<h3>3.0.5 (2016-11-17)</h3>\n<p>Bug fixes:</p>\n<ul>\n<li>Fix import from Globals that is removed in Zope4.\n[pbauer]</li>\n<li>Remove tests, since this contains only stubs\n[tomgross]</li>\n</ul>\n</div>\n<div id=\"id4\">\n<h3>3.0.4 (2016-08-18)</h3>\n<p>Fixes:</p>\n<ul>\n<li><tt>_setId</tt> was incorrectly rising <tt>ValueError</tt> making it impossible to rename an external resource.\n[hvelarde]</li>\n<li>Use zope.interface decorator.\n[gforcada]</li>\n</ul>\n</div>\n<div id=\"id5\">\n<h3>3.0.3 (2015-09-22)</h3>\n<ul>\n<li>bugfix: Handle theme names containing a <cite>.</cite> properly in <tt>manage_bundlesForm</tt>\n[fRiSi]</li>\n</ul>\n</div>\n<div id=\"id6\">\n<h3>3.0.2 (2015-05-04)</h3>\n<ul>\n<li>Comment out views from old resource registry so it does not render\nthem on Plone 5.  Meanwhile we don’t remove the product.  It is\nplanned to be removed on Plone 5.1.\n[bloodbare]</li>\n</ul>\n</div>\n<div id=\"id7\">\n<h3>3.0.1 (2014-10-23)</h3>\n<ul>\n<li>Use <tt>application/javascript</tt> instead of <tt><span class=\"pre\">application/x-javascript</span></tt> for\nthe <tt><span class=\"pre\">Content-Type</span></tt> http header of JavaScript resources. Also see:\n<a href=\"http://stackoverflow.com/questions/9664282\" rel=\"nofollow\">http://stackoverflow.com/questions/9664282</a>\n[thet]</li>\n<li>bugfix: do not convert URIs such as\nurl(<a>data:image/svg+xml;base64,PD94bWwgdmVyc2lv</a>) to absolute urls\nsee <a href=\"https://github.com/plone/Products.ResourceRegistries/pull/16\" rel=\"nofollow\">https://github.com/plone/Products.ResourceRegistries/pull/16</a>\n[cillianderoiste]</li>\n<li>Include <tt><span class=\"pre\">insert-after</span></tt> as an attribute when exporting ResourceRegistries.\n[saily]</li>\n</ul>\n</div>\n<div id=\"id8\">\n<h3>3.0 (2014-04-05)</h3>\n<ul>\n<li>add csrf token to delete urls for resources\n[vangheem]</li>\n<li>Properly handle redirections from login view; resources used to be erased\non authentication redirect for POST action\n[mihneasim]</li>\n<li>Replace troublesome HTTP_REFERER redirects, they can lead to infinite\nredirects on expired session re-login\n[mihneasim]</li>\n<li>Don’t try to traverse to remote objects starting with ‘//’, triggered\nfrom plone.css\n[eleddy]</li>\n</ul>\n</div>\n<div id=\"id9\">\n<h3>2.2.9 (2013-06-13)</h3>\n<ul>\n<li>Allow users to add resources starting with ‘//’, the proper way to link\nto external resources when serving over http and https. This makes it\nmuch easier to manage content on CDNs.\n[eleddy]</li>\n</ul>\n</div>\n<div id=\"id10\">\n<h3>2.2.8 (2013-05-23)</h3>\n<ul>\n<li>Avoid recursive call of _migrateCookedResouces method in BaseTool which\nprevented the old concatenated resource storage from beeing migrated.\nThe problem emerged when migrating from Plone 4.2 to 4.3.\n[thet]</li>\n</ul>\n</div>\n<div id=\"id11\">\n<h3>2.2.7 (2013-03-05)</h3>\n<ul>\n<li>Fixed some spurious test failures for Expires being off by\nminus one second.\n[maurits]</li>\n</ul>\n</div>\n<div id=\"id12\">\n<h3>2.2.6 (2013-01-17)</h3>\n<ul>\n<li>Raise width of resource-id input fields in ZMI from 30 to 80, so that browser\nresource ids can be shown as whole.\n[thet]</li>\n<li>Fixed spurious test failures for Expires being off by one second.\n[maurits]</li>\n</ul>\n</div>\n<div id=\"id13\">\n<h3>2.2.5 (2013-01-13)</h3>\n<ul>\n<li>Detect when CSS configuration will cause them to be marked as alternate\nby browsers and warn the user.\n[MatthewWilkes]</li>\n</ul>\n</div>\n<div id=\"id14\">\n<h3>2.2.4 (2012-12-09)</h3>\n<ul>\n<li>Add some space between up/down and remove links in ZMI\n[maartenking]</li>\n</ul>\n</div>\n<div id=\"id15\">\n<h3>2.2.3 (2012-10-16)</h3>\n<ul>\n<li>Don’t break if the site doesn’t have a portal_kss registry.\n[davisagli]</li>\n</ul>\n</div>\n<div id=\"id16\">\n<h3>2.2.2 (2012-08-29)</h3>\n<ul>\n<li>Changed deprecated getSiteEncoding to hardcoded <cite>utf-8</cite>\n[tom_gross]</li>\n</ul>\n</div>\n<div id=\"id17\">\n<h3>2.2.1 (2012-08-11)</h3>\n<ul>\n<li>Make it possible to change the default bundles for a theme by\nassigning bundles to ‘(default)’\n[davisagli]</li>\n</ul>\n</div>\n<div id=\"id18\">\n<h3>2.2 (2012-07-02)</h3>\n<ul>\n<li>Change BaseRegistryTool.deferredGetContent method to use\nOFS.File.update_data instead of OFS.File.manage_upload. The\nmanage_upload method is a “ZMI” API.  By calling manage_upload\nan ObjectModifiedEvent would be generated for every resource\nserved from the registry.  Let’s do less work.\n[runyaga]</li>\n</ul>\n</div>\n<div id=\"id19\">\n<h3>2.1.2 (2012-05-25)</h3>\n<ul>\n<li>Fix test failure under Plone 4.2.\n[hannosch]</li>\n<li>using hashlib.md5 (fixing a deprecation warning)\n[ajung]</li>\n</ul>\n</div>\n<div id=\"id20\">\n<h3>2.1.1 (2012-05-07)</h3>\n<ul>\n<li>Added theme-parameter for getResourceContent for JavaScriptRegistry.\nEven if it is unused it now allows the same arguments as the\nBaseRegistry\n[tom_gross]</li>\n<li>Added support for OFS.Image.File-objects using OFS.Image.PData\nThis fixes <a href=\"https://dev.plone.org/ticket/12479\" rel=\"nofollow\">https://dev.plone.org/ticket/12479</a>\n[datakurre]</li>\n</ul>\n</div>\n<div id=\"id21\">\n<h3>2.1 (2012-04-18)</h3>\n<ul>\n<li><p>Use iterative magic number generation based on the properties of all\nincluded resources (for each concatenated resource).</p>\n<p>This fixes an issue with external caches where resources for\ndifferent content would sometimes get assigned the same resource id\n(due to the previous implementation using a random integer), making\nit impossible to cache a resource correctly without additional\ninformation.\n[malthe]</p>\n</li>\n</ul>\n</div>\n<div id=\"a1-2011-06-28\">\n<h3>2.1a1 (2011-06-28)</h3>\n<ul>\n<li>Add bundle concept - a bundle is a string tag against a resource, which can\nbe used to filter resources by theme. Each theme has a list of enabled\nbundles, managed on the ‘Bundles’ tab in the ZMI (note that this is global).\n[optilude]</li>\n<li>Fix handling of the purge attribute on import.\n[rossp]</li>\n</ul>\n</div>\n<div id=\"id22\">\n<h3>2.0.8 (2012-03-14)</h3>\n<ul>\n<li>Add time element. This is necessary for the generated ids to update\non any save, to reflect possible updates in the served content.\n[malthe]</li>\n</ul>\n</div>\n<div id=\"id23\">\n<h3>2.0.7 (2012-03-14)</h3>\n<ul>\n<li>Fixed ZMI screens to render for resources containing query strings in their\nids, like found in the plone.session refresh support.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id24\">\n<h3>2.0.6 (2011-11-24)</h3>\n<ul>\n<li>Fixed “AttributeError: ‘FileResourceXX’ object has no attribute ‘POST’\nwhen displaying inline resources when using a POST request.\nFixes <a href=\"http://dev.plone.org/ticket/8998\" rel=\"nofollow\">http://dev.plone.org/ticket/8998</a>\n[maurits]</li>\n</ul>\n</div>\n<div id=\"id25\">\n<h3>2.0.5 - 2011-07-19</h3>\n<ul>\n<li>Switched &lt;link rel=”kinetic-stylesheet” type=”text/css” /&gt; to &lt;link\nrel=”stylesheet” data-rel=”kinetic-stylesheet” type=”text/kss” /&gt; to fix HTML5\nvalidation. References <a href=\"http://dev.plone.org/plone/ticket/11300\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/11300</a>\n[spliter]</li>\n<li>Add MANIFEST.in.\n[WouterVH]</li>\n</ul>\n</div>\n<div id=\"id26\">\n<h3>2.0.4 - 2011-04-15</h3>\n<ul>\n<li>Bugfix for #9849. Incomplete caching.\n[do3cc]</li>\n</ul>\n</div>\n<div id=\"id27\">\n<h3>2.0.3 - 2011-03-02</h3>\n<ul>\n<li>Support merging of resources that return IStreamIterators\n[optilude]</li>\n</ul>\n</div>\n<div id=\"id28\">\n<h3>2.0.2 - 2010-07-18</h3>\n<ul>\n<li>Update license to GPL version 2 only.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id29\">\n<h3>2.0.1 - 2010-07-15</h3>\n<ul>\n<li>Silence the <cite>Nothing to import.</cite> log messages.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id30\">\n<h3>2.0 - 2010-07-01</h3>\n<ul>\n<li>Changed the registries moveResourceAfter and moveResourceBefore methods to\ngracefully handle missing destination ids. This is useful for GenericSetup\nupgrade steps to work even if the resources specified in “insert-after” or\n“insert-before” do not exist.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"b5-2010-06-13\">\n<h3>2.0b5 - 2010-06-13</h3>\n<ul>\n<li>Avoid deprecation warnings under Zope 2.13.\n[hannosch]</li>\n<li>Adjusted tests to match new content-type for JavaScript in Zope 2.12.7+.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"b4-2010-06-03\">\n<h3>2.0b4 - 2010-06-03</h3>\n<ul>\n<li>Add purge support to export/import handlers.\n[elro]</li>\n<li>Fix the authenticated checkbox on the kss form.\n[elro]</li>\n</ul>\n</div>\n<div id=\"b3-2010-05-01\">\n<h3>2.0b3 - 2010-05-01</h3>\n<ul>\n<li>Add an option ‘applyPrefix’ to stylesheets. This can be set in the UI, in\nthe various constructor methods, or as an attribute in a cssregistry.xml\nfile. It defaults to false. It has no effect in debug mode. In non-debug-\nmode, however, it will parse a stylesheet for ‘url()’ statements that\ncontain <em>relative</em> paths. These will be prefixed with the Plone site path.\nIf the stylesheet id contains a path (e.g. ‘++resource++foo/css/bar.css’)\nthis will be used in the prefix as well. The goal is to make relative paths\ninternal to a resource directory work, even when resource merging is used.\nPreviously, it’d break because resource merging changes the URL.\n[optilude]</li>\n</ul>\n</div>\n<div id=\"b2-2010-01-24\">\n<h3>2.0b2 - 2010-01-24</h3>\n<ul>\n<li>Apply a marker interface ICookedFile to the files created on the fly for\ncooked/concatenated resources returned by ResourceRegistries. This makes\nit easier to detect these for caching purposes and treat them differently\nto in-ZODB files, which may also be instances of OFS.Image.File.\n[optilude]</li>\n</ul>\n</div>\n<div id=\"b1-2009-12-27\">\n<h3>2.0b1 - 2009-12-27</h3>\n<ul>\n<li>Marked zope.component as a real dependency of this package.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"a2-2009-12-20\">\n<h3>2.0a2 - 2009-12-20</h3>\n<ul>\n<li>Cleaned up some old charset related fallback code.\n[hannosch]</li>\n<li>Changed the development mode to be a non-persistent setting. By default it\nfollows the Zope development mode (bin/instance fg vs. bin/instance console).\nThe setting can be changed during process runtime.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"a1-2009-11-16\">\n<h3>2.0a1 - 2009-11-16</h3>\n<ul>\n<li>Declare ‘screen’ to be the default for the media attribute instead of None.\nIt is the most commonly used one in Plone’s own themes.\n[hannosch]</li>\n<li>Fixed typo in update process of authenticated resources. Fixes #9599\n[naro]</li>\n<li>Fixed JS packer to be a little less greedy about protecting regular\nexpressions. This fixes #8790.\n[dunlapm]</li>\n<li>Changed the order of CSS/JS rendering, CSS now renders first to allow the\nbrowser to get it as soon as possible, to avoid the “flash of unstyled\ncontent”\n[limi]</li>\n<li>Removed some whitespace in the rendering templates for JS, CSS and KSS to make\nthe source rendering more readable. These are very small and understandable\ntemplates, so we’d rather have some noise there than on the front end.\n[limi]</li>\n<li>Removed the <cite>autogroupingmode</cite> feature. In practice it turned out to work\nnot so well and caused hard to debug problems.\n[hannosch]</li>\n<li>Automatically set the registries into development mode if Zope itself runs\nin development mode.\n[hannosch]</li>\n<li>Get the tests working again under Plone 5 and make sure we handle\nzope.app.publisher file resources correctly under repoze.zope2.\n[hannosch]</li>\n<li>Added missing InitializeClass call for BaseRegistryTool.\n[davisagli]</li>\n<li>Changed default values for resources to more sensible values.\n[hannosch]</li>\n<li>Restructured documentation files.\n[hannosch]</li>\n<li>Added <cite>authenticated</cite> as a new option to all resources. If a resource is\nmarked this way, it will only be shown for authenticated users. This makes\nthe most common use-case of restricting resources to logged-in users easier\nand allows to optimize the internal API for speed for this use-case. An\nexpression on a resource is ignored if the authenticated flag is set.\n[hannosch]</li>\n<li>Removed BBB imports and code. We require Zope 2.12 now.\n[hannosch]</li>\n<li>Handle a missing portal_kss tool gracefully in the kineticstylesheets\nviewlet.\n[hannosch]</li>\n<li>Added BBB imports to make sure the InitializeClass can be imported in\nZope versions before 2.12.\n[hannosch]</li>\n<li>Avoid dependency on the zope.app.zapi package.\n[hannosch]</li>\n<li>Declare package dependencies, fixed deprecation warnings for use of\nGlobals and changed error raising to be forward compatible.\n[hannosch]</li>\n<li>Change the fix for #7522 made in 1.4.3. For inline resources we pass\nUnicode down into the page templates. The TAL machinery expects to get\nUnicode and not encoded strings.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id31\">\n<h3>1.5.3 - 2009-05-17</h3>\n<ul>\n<li>Allow setting of debug mode in registries through Generic Setup\nprofiles. This closes <a href=\"http://dev.plone.org/plone/ticket/8712\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/8712</a>\n[dunlapm]</li>\n<li>Fixed error with inline z3resources not being able to handle a POST\nrequest. This fixes <a href=\"http://dev.plone.org/plone/ticket/8998\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/8998</a>\n[dunlapm]</li>\n</ul>\n</div>\n<div id=\"id32\">\n<h3>1.5.2 - 2009-04-21</h3>\n<ul>\n<li>Fixed error with the conditional comment being lost when adding a new\nResource when adding a new entry to the JS or CSS registries.\n[dunlapm]</li>\n<li>Fixed error with GS Export/Import. Fixes\n<a href=\"http://dev.plone.org/plone/ticket/9154\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/9154</a>\n[dunlapm]</li>\n</ul>\n</div>\n<div id=\"id33\">\n<h3>1.5.1 - 2009-04-14</h3>\n<ul>\n<li>Put CDATA start and end markers in a javascript comment. Fixes\n<a href=\"http://dev.plone.org/plone/ticket/9128\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/9128</a>\n[wichert]</li>\n</ul>\n</div>\n<div id=\"id34\">\n<h3>1.5.0 - 2009-03-01</h3>\n<ul>\n<li>Removed the uppermost Save button from the ZMI pages for registries.\nClicking this button before the registry page has finished loading could\nlead to data loss.\n[dunlapm, fschulze]</li>\n<li>Resources beginning with “<a href=\"http://\" rel=\"nofollow\">http://</a>” or “<a href=\"https://\" rel=\"nofollow\">https://</a>” are now valid and may be\nincluded as resources. Registries will automatically disable merging,\ncaching, compression, and inline rendering of external resources. This\ncloses <a href=\"http://dev.plone.org/plone/ticket/8312\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/8312</a>\n[dunlapm, fschulze]</li>\n<li>Added option to have a conditional comment attached to a given resource.\nCurrently the UI only supports this behavior with the CSS and JavaScript\nRegistries, but the underpinnings for the KSS registry is in place.\nThis closes <a href=\"http://dev.plone.org/plone/ticket/5521\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/5521</a>\n[dunlapm, fschulze]</li>\n<li>Do not try to export the <cite>cooked_expression</cite> into the GenericSetup\nprofiles. It is only an internal optimization and the value is reflected\nin the <cite>expression</cite> value.\n[hannosch]</li>\n<li>Store the cooked expressions as a real persistent expression object,\ninstead of compiling the expression on every view.\n[hannosch]</li>\n<li>Added ‘context’ as an alias for ‘object’ in action expressions.\n[davisagli, hannosch]</li>\n</ul>\n</div>\n<div id=\"id35\">\n<h3>1.4.3 - 2008-10-08</h3>\n<ul>\n<li>Eggified into Products.ResourceRegistries.</li>\n<li>Fixed error where non-traversable resources could be registered. This closes\n<a href=\"http://dev.plone.org/plone/ticket/8153\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/8153</a>\n[dunlapm]</li>\n<li>Ensure that resources can be removed in xml.\n[maurits]</li>\n<li>Purge old zope2 Interface interfaces for Zope 2.12 compatibility.\n[elro]</li>\n<li>Encode inline resources using the site encoding.\nFixes <a href=\"http://dev.plone.org/plone/ticket/7522\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/7522</a>\n[wichert]</li>\n<li>Fixed potential Acquisition problems in viewlets.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"id36\">\n<h3>1.4.2 - 2008-03-06</h3>\n<ul>\n<li>Properly encode the resource id. This fixes moving of resource without JS\nand removing recources which contain special chars like plus signs.\nFixes <a href=\"http://dev.plone.org/plone/ticket/7482\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/7482</a>\n[fschulze]</li>\n<li>Revert part of r7143: returning NotFound from a API call is never\nthe right thing to do since it makes the publisher show a object-not-found\npage, hiding the real error. Restore the old behaviour and raise a\nValueError instead. This fixes mysterious not-found errors from\nGenericSetup imports.\n[wichert]</li>\n<li>Support Z3 template resources (not just file and image resources).\n[mj]</li>\n</ul>\n</div>\n<div id=\"id37\">\n<h3>1.4.1 - 2007-10-10</h3>\n<ul>\n<li>Added ‘/’ to the strings that are filtered out in\nBaseRegistry.generateId(). This fixes #7048.\n[davconvent]</li>\n</ul>\n</div>\n<div id=\"id38\">\n<h3>1.4.0 - 2007-08-16</h3>\n<ul>\n<li>Add support for automatic grouping mode to the GenericSetup export/import\ncode.\n[wichert]</li>\n</ul>\n</div>\n<div id=\"rc1-2007-07-09\">\n<h3>1.4.0-rc1 - 2007-07-09</h3>\n<ul>\n<li>Added a new automatic grouping mode feature. It is turned off by default.\nWhen enabled the resources will first be sorted into groups with the same\nmerging-relevant settings and after that merged. In the groups the order of\nthe resources in the registries will be preserved.\n[hannosch]</li>\n<li>Changed the exportimport handlers to only cook the resources once at the end\nand not after each new resource has been added.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"beta5-2007-05-02\">\n<h3>1.4.0-beta5 - 2007-05-02</h3>\n<ul>\n<li>Fixed setting of cache headers when the registry is associated with a\nRAMCache.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"beta4-2007-04-30\">\n<h3>1.4.0-beta4 - 2007-04-30</h3>\n<ul>\n<li>Switched back to getToolByName.\n[wichert]</li>\n<li>Added portal_kss as registry for kss files.\n[fschulze]</li>\n<li>Slightly optimized the viewlet manager templates.\n[hannosch]</li>\n</ul>\n</div>\n<div id=\"beta3-2007-03-25\">\n<h3>1.4.0-beta3 - 2007-03-25</h3>\n<ul>\n<li>Replace usage of getToolByNames with getUtility.\n[wichert, hannosch]</li>\n</ul>\n</div>\n<div id=\"beta2-2007-03-01\">\n<h3>1.4.0-beta2 - 2007-03-01</h3>\n<ul>\n<li>Reverted fix of tests, because Zope was wrong.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"beta1-2007-02-27\">\n<h3>1.4.0-beta1 - 2007-02-27</h3>\n<ul>\n<li>Fixed test failures caused by changes in Zope 2.10.\n[fschulze]</li>\n<li>Ported bugfixes from 1.3 line.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"alpha2-2007-02-11\">\n<h3>1.4.0-alpha2 - 2007-02-11</h3>\n<ul>\n<li>Started to use views and viewlet managers.\n[fschulze]</li>\n<li>Removed compatibility stuff for Plone version lower than 3.0.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id39\">\n<h3>1.3.8 - 2007-04-16</h3>\n<ul>\n<li>Cook resources after GS profile import.\n[fschulze]</li>\n<li>Added missing enabled property handling to updateScript.\n[fschulze]</li>\n<li>Fixed typo which prevented position-after/insert-after in GS profiles to\nwork.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id40\">\n<h3>1.3.7 - 2007-03-25</h3>\n<ul>\n<li>For compatibility with GenericSetup conventions, the import steps now\nsupport ‘insert-before’ and  ‘insert-after’ as aliases for\n‘position-before’ and ‘position-after’, while ‘insert-top’ and\n‘insert-bottom’ are aliases for ‘position-top’ and ‘position-bottom’,\nrespectively.\n[mj]</li>\n</ul>\n</div>\n<div id=\"id41\">\n<h3>1.3.6 - 2007-02-27</h3>\n<ul>\n<li>Invalidate cache when cooking resources if the registry is assigned to a\nRAMCache or similar cache manager.</li>\n<li>Fixed string replacement during packing when several resources got packed\nin different threads at once, which resulted in exchanged strings.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id42\">\n<h3>1.3.5 - 2007-02-11</h3>\n<ul>\n<li>Fixed string protection for strings which mix single and double quotes.\n[fschulze]</li>\n<li>Made packer.py usable as a standalone commandline tool.\n[fschulze]</li>\n<li>Fixed several issues in ‘full’ compression.\n[fschulze]</li>\n<li>Extended the GenericSetup import step to support positioning of resources:\nthe ‘position-before’ and ‘position-after’ attributes cause the resource\nto be positioned before or after resource named in the attribute.\n‘position-top’ and ‘position-bottom’ move a resource to the top or bottom.\n[mj]</li>\n</ul>\n</div>\n<div id=\"id43\">\n<h3>1.3.4 - 2007-01-03</h3>\n<ul>\n<li>Improved IE conditional compilation protection, it now works in “full”\ncompression.\n[fschulze]</li>\n<li>Improved regular expression for strings.\n[fschulze]</li>\n<li>Fixed order of oneline and multiline comment removal in javascript packer.\n[fschulze]</li>\n<li>Fixed validation warning about multiple comments when rendering resources\ninline.\n[fschulze]</li>\n<li>Made css “full” packing more aggressive.\n[fschulze]</li>\n<li>Cleaned up testing framework and made all tests run properly.\n[fschulze, hannosch]</li>\n</ul>\n</div>\n<div id=\"id44\">\n<h3>1.3.3 - 2006-12-13</h3>\n<ul>\n<li>Don’t wrap None in aquisition wrapper if resource is not found.\n[tesdal]</li>\n</ul>\n</div>\n<div id=\"id45\">\n<h3>1.3.2 - 2006-09-11</h3>\n<ul>\n<li>Made GenericSetup importer not fail on repeated imports.\n[alecm]</li>\n<li>Made enabled checkbox work again.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id46\">\n<h3>1.3.1 - 2006-08-17</h3>\n<ul>\n<li>Enable use of z3 / Five resources.\n[ree]</li>\n<li>Mark missing or unaccessible ressources in management screens.\n[fschulze]</li>\n<li>Moved ‘enabled’ checkbox into legend before ‘id’ textbox.\n[fschulze]</li>\n<li>Don’t remove conditional compile instructions for IE from javascripts.\n[fschulze]</li>\n<li>Fixed error when content is unicode.\n[rocky]</li>\n</ul>\n</div>\n<div id=\"id47\">\n<h3>1.3 - 2006-07-16</h3>\n<ul>\n<li>No changes since rc1.</li>\n</ul>\n</div>\n<div id=\"rc1-2006-06-02\">\n<h3>1.3-rc1 - 2006-06-02</h3>\n<ul>\n<li>Add patch from jenner to handle updating and removal of resources\nfrom GenericSetup profiles.\n[wichert]</li>\n</ul>\n</div>\n<div id=\"beta2-2006-05-17\">\n<h3>1.3-beta2 - 2006-05-17</h3>\n<ul>\n<li>Included fixes from the 1.2 line.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"beta1-2006-03-31\">\n<h3>1.3-beta1 - 2006-03-31</h3>\n<ul>\n<li>Do not install default CSS and JS on upgrade, only on initial installation.\n[wichert]</li>\n</ul>\n</div>\n<div id=\"alpha1-2006-02-24\">\n<h3>1.3-alpha1 - 2006-02-24</h3>\n<ul>\n<li>Added GenericSetup import/export handlers (to support GS-based Plone 2.5\nportal creation)\n[rafrombrc]</li>\n</ul>\n</div>\n<div id=\"id48\">\n<h3>1.2.4 - 2006-09-11</h3>\n<ul>\n<li>Made enabled checkbox work again.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id49\">\n<h3>1.2.3 - 2006-09-06</h3>\n<ul>\n<li>Backported several fixes from 1.3.1:\n[fschulze]</li>\n<li>Enable use of z3 / Five resources.\n[ree]</li>\n<li>Mark missing or unaccessible ressources in management screens.\n[fschulze]</li>\n<li>Moved ‘enabled’ checkbox into legend before ‘id’ textbox.\n[fschulze]</li>\n<li>Don’t remove conditional compile instructions for IE from javascripts.\n[fschulze]</li>\n<li>Fixed error when content is unicode.\n[rocky]</li>\n</ul>\n</div>\n<div id=\"id50\">\n<h3>1.2.2 - 2006-05-15</h3>\n<ul>\n<li>Added missing arguments in resource adding functions.\n[jenner, fschulze]</li>\n</ul>\n</div>\n<div id=\"id51\">\n<h3>1.2.1 - 2006-04-13</h3>\n<ul>\n<li>Fixed traversal of security restricted resources.\n[jenner, alecm, fschulze]</li>\n<li>Added javascript “full” compression, which achieves higher compression ratios\nby doing variable name packing based on the rules from Dean Edwards packer:\n<a href=\"http://dean.edwards.name/packer/usage/\" rel=\"nofollow\">http://dean.edwards.name/packer/usage/</a>\n[fschulze]</li>\n<li>Added keyword encoding for javascript. This greatly reduces the file size of\njavascript files, but adds a small performance hit on the client for the\ndecoding.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id52\">\n<h3>1.2 - 2006-02-24</h3>\n<ul>\n<li>Added compression for CSS and Javascript resources.\n[fschulze]</li>\n<li>Added better labels and a short explanation to the debugmode-checkbox in the forms.\n[elvix]</li>\n<li>Renamed ‘TAL condition’ to ‘Condition’ in the forms, as it has nothing to do with\nTAL at all (it is a CMF/TALES expression) It should include a link to CMF Expressions help\n[elvix]</li>\n</ul>\n</div>\n<div id=\"id53\">\n<h3>1.1 - 2006-11-22</h3>\n<ul>\n<li>Fixed cooking of resources to ensure that uncookable resources are not merged.\n[elro]</li>\n<li>Fixed tests for unauthorized to accept a 401 as an unauthorized error.\n[elro]</li>\n<li>Fixed setDebugMode to recook resources after being changed.\n[elro]</li>\n</ul>\n</div>\n<div id=\"b1\">\n<h3>1.1b1</h3>\n<ul>\n<li>Added checkbox to configure cacheability of resources.\n[fschulze]</li>\n<li>Made registries cacheable. This is most useful with the RAMCacheManager.\nJust associate portal_css and portal_javascripts with the RAMCache.\n[fschulze]</li>\n<li>Apply magic id to all resources when not in debug mode, so invalidation\nworks.\n[fschulze]</li>\n<li>Made skin aware. This now depends on getCurrentSkinName added in CMF 1.5.5.\n[elro]</li>\n</ul>\n</div>\n<div id=\"id54\">\n<h3>1.0.5 - 2005-09-09</h3>\n<ul>\n<li>Fixed encoding of javascripts.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id55\">\n<h3>1.0.4 - 2005-09-03</h3>\n<ul>\n<li>Fixed reordering of resources with javascript.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id56\">\n<h3>1.0.3 - 2005-08-17</h3>\n<ul>\n<li>Fixed typo in the migration external method which lead to portal_javascripts\nnot being migrated.\n[fschulze]</li>\n<li>Small fixes to UI.\n[limi]</li>\n</ul>\n</div>\n<div id=\"id57\">\n<h3>1.0.2 - 2005-08-09</h3>\n<ul>\n<li>Fix for bug #4392, where merging FSfiles could mess up http-status headers\nand cause weird hanging in browsers.\n[plonista, fschulze, elvix]</li>\n</ul>\n</div>\n<div id=\"id58\">\n<h3>1.0.1</h3>\n<ul>\n<li>Don’t filter resources in merged overview in ZMI.\n[fschulze]</li>\n<li>Improved management UI.\n[limi, fschulze]</li>\n<li>Fixed reinstall bug due to improper resource id lookup.\n[alecm]</li>\n</ul>\n</div>\n<div id=\"id59\">\n<h3>1.0 - 2005-08-01</h3>\n<ul>\n<li>Moved directory with skin layer for Plone 2.0.5 compatibility to product\nroot, so it doesn’t interfere with Plone 2.1. The version check on install\ntime didn’t seem to be enough.\n[fschulze]</li>\n<li>getTitle and getMedia will return None now if they are empty, this removes\nempty title and media attributes from the generated HTML.</li>\n<li>Fixed reordering of resources in ZMI when javascript is enabled.\n[fschulze, jenner]</li>\n<li>Fixed submitting changes in ZMI for stylesheets on IE.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id60\">\n<h3>0.95 - 2005-07-03</h3>\n<ul>\n<li>Added getResource function. This allows to change properties of each\nresource. After that, a call to cookResources is needed.\n[fschulze]</li>\n<li>Added getResourceIds function.\n[fschulze]</li>\n<li>Added test for context dependancy to inline css rendering.\n[dom]</li>\n<li>Now uses restrictedTraverse() rather than getattr() for returning resources,\nto provide support for resources held within the ZODB.\n[dom]</li>\n<li>Added a “is merging allowed?” option (“cookable” property) to determine where\na resource can be merged (default True). This was added because objects in\nthe ZODB may have variable permissions but be merged together. Whilst the\nobjects are checked at each REQUEST, a new REQUEST won’t actually be made\neach time because of the cache headers set on merged resources. If this\nworries you, the simplest solution is not to merge such resources, hence this\noption.\n[dom]</li>\n<li>Added renameResource function with tests.\n[fschulze]</li>\n<li>In Plone 2.1 plone_javascripts.js was removed, fixed tests by using\njstest.js from our own skin.\n[dom]</li>\n</ul>\n</div>\n<div id=\"id61\">\n<h3>0.9</h3>\n<ul>\n<li>Fixed function of enabled checkbox when adding css/javascript from ZMI.\nAdded title field to the ‘add stylesheet’ part in the ZMI.\n[fschulze]</li>\n<li>Added migration script for old instances. Just create a external method with\nid ‘migrate_resourceregistries’, Module Name ‘ResourceRegistries.migrate’ and\nFunction Name ‘migrate’ and click on the ‘Test’ tab.\n[fschulze]</li>\n<li>Cleaned up imports and whitespaces. Code standardization and small\nimprovements. Fixed ZMI templates XHTML markup.\n[deo]</li>\n<li>Refactored the two registries to use one common base class.\n[fschulze]</li>\n<li>Refactored moving functions, so we have more possibilities. The API reflects\nthe IOrderedContainer one.\n[fschulze]</li>\n<li>Fix order of javascripts, the topmost in the management screen also needs\nto be the topmost in the resulting source.\n[fschulze]</li>\n<li>Added debugmode where scripts are not concatenated. This will let things\nlike the javascript console point to the right line-number. And makes it\neasier to develop, because there is no caching of the scripts.\n[fschulze]</li>\n<li>Fixed cooking of stylesheets so that composite stylesheets get correct\nmedia settings. Thanks a lot to Denis Mishunoff[spliter] for discovery,\ninvestigation and suggested fix\n[elvix]</li>\n<li>Fixed some security declarations.\n[fschulze]</li>\n<li>Made moving of stylesheets and javascripts in ZMI possible without javascript\nbeing enabled in the browser.\n[fschulze]</li>\n<li>Moved 2.0.5 header.pt to skins/ResourceRegistries_20compatibility and\nremove ResourceRegistries_20compatibility when Plone != 2.0.x\n[fschulze]</li>\n<li>Check existance of stylesheets and javascripts before registering. This\nfixes reinstallation.\n[fschulze]</li>\n<li>Removed duplicate getScripts function definition in tools/JSRegistry.py\n[fschulze]</li>\n<li>Fixed JSRegistry for Plone &lt; 2.1 where plone_utils.getSiteEncoding is not\navailable.\n[fschulze]</li>\n<li>Renamed config.TOOLNAME to config.CSSTOOLNAME\nand config.TOOLTYPE to config.CSSTOOLTYPE\n[batlogg]</li>\n<li>Added tests for attributes on stylesheets. About time.\n[elvix]</li>\n<li>Added title for alternate stylesheets.\n[fschulze]</li>\n<li>Removing superflous skins directories.\n[elvix]</li>\n<li>Added new debugmode where stylesheets are not concatenated. This will let\nthings like the DOM inspector in Mozilla point to the right line-number.\n[ldr] [elvix]</li>\n<li>Added bugfix for handling disabled items when cooking stylesheets.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id62\">\n<h3>0.8 - 2005-05-21</h3>\n<ul>\n<li>Renamed to ResourceRegistries instead of the historical and wrong\nCSSRegistry.\n[elvix]</li>\n<li>Upgraded JSRegistry to have a more proper ZMI form, now with reordering\nsupport.\n[elvix]</li>\n<li>Changed the order elements are added to the JSRegistry.\n[elvix]</li>\n<li>Added license/copyright notice to composite files (neccesary for including\nfor third party stuff).\n[elvix]</li>\n<li>Bugfix fixing ZMI form for CSSRegistry.\n[fschulze]</li>\n</ul>\n</div>\n<div id=\"id63\">\n<h3>0.7</h3>\n<ul>\n<li>Added to Plone 2.1 migrations, added installation of the default\nPlone javascripts and stylesheets.\n[elvix]</li>\n<li>Make sure we intercept all requests for objects, even those already\npresent in the acquisition chain. Override __bobo_traverse__.\n[elvix]</li>\n<li>Handle cache settings in http headers for served files.\n[elvix]</li>\n<li>Handle http headers for inline scripts and stylesheets.\n[elvix]</li>\n<li>Use explicit &lt;/script&gt; tag since these pages are being served as\ntext/html. Both IE and firefox will have problems otherwise.\n[bmh]</li>\n</ul>\n</div>\n<div id=\"and-earlier\">\n<h3>0.6 and earlier</h3>\n<ul>\n<li>Added a simple readme with basic documentation.\n[elvix]</li>\n<li>Started HISTORY.txt (somewhat late perhaps, but better than never).\n[elvix]</li>\n<li>Cleaned up forms. Better alignment.\n[elvix]</li>\n<li>Separate JSRegistry and CSSRegistry to two tools.\n[elvix]</li>\n<li>Lots of changes, numerous fixes.\n[elvix]</li>\n</ul>\n</div>\n<div id=\"snowsprint-2005\">\n<h3>Snowsprint 2005</h3>\n<ul>\n<li>Designed and built first version of the CSSregistry.\n[HammerToe, elvix]</li>\n</ul>\n</div>\n</div>\n\n          </div>"}, "last_serial": 3746483, "releases": {"1.4.3": [{"comment_text": "", "digests": {"md5": "01c1eee740b16533abaa8422dbf6ac5f", "sha256": "d06da4b1f32b29be79d9ff7170fdcab53c6b08d047339f28093db500feb9cb64"}, "downloads": -1, "filename": "Products.ResourceRegistries-1.4.3.zip", "has_sig": false, "md5_digest": "01c1eee740b16533abaa8422dbf6ac5f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 92356, "upload_time": "2008-10-08T21:18:50", "upload_time_iso_8601": "2008-10-08T21:18:50Z", "url": "https://files.pythonhosted.org/packages/46/c8/677e48fef437afe29e86d3f54186b7db70af21163cf76f9d51f6424147db/Products.ResourceRegistries-1.4.3.zip", "yanked": false}], "1.5.0": [{"comment_text": "", "digests": {"md5": "3a0415161853bb48ee1d59e200fcf77e", "sha256": "b98cb2b4c9d4f0c5591422aa128ca36bb572f5d1703d4a0093606efd3e316e53"}, "downloads": -1, "filename": "Products.ResourceRegistries-1.5.0.zip", "has_sig": false, "md5_digest": "3a0415161853bb48ee1d59e200fcf77e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 110900, "upload_time": "2009-03-01T19:42:02", "upload_time_iso_8601": "2009-03-01T19:42:02.315405Z", "url": "https://files.pythonhosted.org/packages/85/d5/4b13b07b2c09a6552ecb338711cb3ab0260e723f3d220fabc2fa81256ffc/Products.ResourceRegistries-1.5.0.zip", "yanked": false}], "1.5.1": [{"comment_text": "", "digests": {"md5": "ec30dd232fbfcd68b851e10ad4ff4e08", "sha256": "db29ccaeea2fc9967bd7cb3379a1c56813263318f581ab3856eb34ecc958241c"}, "downloads": -1, "filename": "Products.ResourceRegistries-1.5.1.zip", "has_sig": false, "md5_digest": "ec30dd232fbfcd68b851e10ad4ff4e08", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 111097, "upload_time": "2009-04-14T19:23:53", "upload_time_iso_8601": "2009-04-14T19:23:53.750983Z", "url": "https://files.pythonhosted.org/packages/c7/e1/a2f588d6e23fa70361cd37594bc2d5db2429a141a3dc8736e7a8f14a519f/Products.ResourceRegistries-1.5.1.zip", "yanked": false}], "1.5.2": [{"comment_text": "", "digests": {"md5": "ee415a6cfd1b4e138c1c51818663690e", "sha256": "d1ecf89d6914cd1013f0bf11fa13fa599b1c1aae3be36d095c9e47746de0ba1b"}, "downloads": -1, "filename": "Products.ResourceRegistries-1.5.2.zip", "has_sig": false, "md5_digest": "ee415a6cfd1b4e138c1c51818663690e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 111283, "upload_time": "2009-04-21T12:16:04", "upload_time_iso_8601": "2009-04-21T12:16:04.666174Z", "url": "https://files.pythonhosted.org/packages/5a/35/4ff1700f1b531dd9054f5d3207281315322e7c5b942e3e7648b1e282b482/Products.ResourceRegistries-1.5.2.zip", "yanked": false}], "1.5.3": [{"comment_text": "", "digests": {"md5": "ad32640d0d26939e0a8778ea3006761f", "sha256": "f78040c6ee61948005584d2c2d46ccab7023e8560f37c3cbdf368ccca18d6b31"}, "downloads": -1, "filename": "Products.ResourceRegistries-1.5.3.zip", "has_sig": false, "md5_digest": "ad32640d0d26939e0a8778ea3006761f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 111583, "upload_time": "2009-05-17T18:14:08", "upload_time_iso_8601": "2009-05-17T18:14:08.053853Z", "url": "https://files.pythonhosted.org/packages/5a/f4/389a2e8769ecfa9fab87dc9718261a1e489ae7e94f850ac5262fd13032aa/Products.ResourceRegistries-1.5.3.zip", "yanked": false}], "1.5.4": [{"comment_text": "", "digests": {"md5": "8619b917eb22bc3a089cce0ccd1dfc87", "sha256": "ba2a65eb0135c236727669c0e8d28e5e5fd63a890178b9bc38c0a60169e68f28"}, "downloads": -1, "filename": "Products.ResourceRegistries-1.5.4.tar.gz", "has_sig": false, "md5_digest": "8619b917eb22bc3a089cce0ccd1dfc87", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 56052, "upload_time": "2009-12-08T22:44:52", "upload_time_iso_8601": "2009-12-08T22:44:52.235274Z", "url": "https://files.pythonhosted.org/packages/29/de/54fca22ef961040e6e0924e21d1a73ee9ea00ebfd6975add13991227a16d/Products.ResourceRegistries-1.5.4.tar.gz", "yanked": false}], "1.5.4.1": [{"comment_text": "", "digests": {"md5": "719b431ded6d9811b6fd91f1d0ff4dd9", "sha256": "1de16b7d349d7262eb6ed2e7a1c80db892251d3b10d5a7a4db617049823979af"}, "downloads": -1, "filename": "Products.ResourceRegistries-1.5.4.1.tar.gz", "has_sig": false, "md5_digest": "719b431ded6d9811b6fd91f1d0ff4dd9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 76664, "upload_time": "2009-12-08T22:49:40", "upload_time_iso_8601": "2009-12-08T22:49:40.652781Z", "url": "https://files.pythonhosted.org/packages/f9/c0/26132627b077536ac4783b52e6d53ba009f93225d217e6365d50dec65f04/Products.ResourceRegistries-1.5.4.1.tar.gz", "yanked": false}], "1.5.5": [{"comment_text": "", "digests": {"md5": "825baa3883af961465d57dd596306a49", "sha256": "1d7a28e2b168dea2c455df7e3d41b562d93b7bb5dde732eb38fc45cde19b0cad"}, "downloads": -1, "filename": "Products.ResourceRegistries-1.5.5.zip", "has_sig": false, "md5_digest": "825baa3883af961465d57dd596306a49", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 116131, "upload_time": "2010-06-18T01:18:05", "upload_time_iso_8601": "2010-06-18T01:18:05.305770Z", "url": "https://files.pythonhosted.org/packages/55/94/4d56e887fa19a93c886c334e8a2fd9873389a2d153c198fcf69ed56ad57a/Products.ResourceRegistries-1.5.5.zip", "yanked": false}], "1.5.6": [{"comment_text": "", "digests": {"md5": "2aed86ffaea956ab932e982aba74f62d", "sha256": "72ac6b075e9741d4b9593091b121c6da2b0c5f2bb03b344605654191a3e26f6f"}, "downloads": -1, "filename": "Products.ResourceRegistries-1.5.6.zip", "has_sig": false, "md5_digest": "2aed86ffaea956ab932e982aba74f62d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 116046, "upload_time": "2010-06-21T18:02:29", "upload_time_iso_8601": "2010-06-21T18:02:29.588783Z", "url": "https://files.pythonhosted.org/packages/d0/f6/60afbbe23478f8dce1724cc49d156814eb70f7f9b8c5f7f0e17ebdeccffa/Products.ResourceRegistries-1.5.6.zip", "yanked": false}], "1.5.7": [{"comment_text": "", "digests": {"md5": "c28fa5350909ee237337b15abf0aac41", "sha256": "bad98e9df54b34f5d2187caad3db7c3a861d85ad484a937c08b5fd4f434f59b0"}, "downloads": -1, "filename": "Products.ResourceRegistries-1.5.7.zip", "has_sig": false, "md5_digest": "c28fa5350909ee237337b15abf0aac41", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 116292, "upload_time": "2011-04-15T15:27:25", "upload_time_iso_8601": "2011-04-15T15:27:25.567300Z", "url": "https://files.pythonhosted.org/packages/d0/80/4a80a037484ce4b046c4437a3182e062a9d69d020f63faa26efd5f54f68d/Products.ResourceRegistries-1.5.7.zip", "yanked": false}], "2.0": [{"comment_text": "", "digests": {"md5": "34de8acf446d1099746758fc68bd4915", "sha256": "42f5d189645a599595f47830db8dcf637126da4c5fdd1cc365b0b5e03faf4d24"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0.zip", "has_sig": false, "md5_digest": "34de8acf446d1099746758fc68bd4915", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 119133, "upload_time": "2010-07-01T20:04:46", "upload_time_iso_8601": "2010-07-01T20:04:46.647775Z", "url": "https://files.pythonhosted.org/packages/2e/c7/3fcf81ad09873e7a3f247db23a9a0705110d041675cd457d53a3b4d5db4f/Products.ResourceRegistries-2.0.zip", "yanked": false}], "2.0.1": [{"comment_text": "", "digests": {"md5": "c6a416b4e77b60921c11eb72ff392eeb", "sha256": "bc248eac9e02ba7a66928dfe7ffcea9a48b486362f26914b62047e1be51843f5"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0.1.zip", "has_sig": false, "md5_digest": "c6a416b4e77b60921c11eb72ff392eeb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 119530, "upload_time": "2010-07-15T21:44:06", "upload_time_iso_8601": "2010-07-15T21:44:06.919622Z", "url": "https://files.pythonhosted.org/packages/4e/56/6c76cce83bc87a4d92aa16d964a5399c6bea409296e14487a150615c8877/Products.ResourceRegistries-2.0.1.zip", "yanked": false}], "2.0.2": [{"comment_text": "", "digests": {"md5": "8aaafc04154385c82e1fa9a409cdc3a8", "sha256": "cb2eb9e5524f128be2bdbe4bb01ab0244bd483be3fda8a5a575c93eb45ff522c"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0.2.zip", "has_sig": false, "md5_digest": "8aaafc04154385c82e1fa9a409cdc3a8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 120644, "upload_time": "2010-07-18T13:48:55", "upload_time_iso_8601": "2010-07-18T13:48:55.826729Z", "url": "https://files.pythonhosted.org/packages/78/9a/52abed8fb50d35e08e74f346c36fda40aa4b16cc767aefe20278cba4d98b/Products.ResourceRegistries-2.0.2.zip", "yanked": false}], "2.0.3": [{"comment_text": "", "digests": {"md5": "0b275fcb1bb8a44c2126a45a688ab304", "sha256": "58390d8b9ad63f0c2fc375a7c0ce6e009543eb64bf4599aabc6382aa69b8b4e8"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0.3.zip", "has_sig": false, "md5_digest": "0b275fcb1bb8a44c2126a45a688ab304", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 121656, "upload_time": "2011-03-02T16:49:00", "upload_time_iso_8601": "2011-03-02T16:49:00.341154Z", "url": "https://files.pythonhosted.org/packages/97/42/9554ed2085a8740ef5e6c1551ecea067c6ad19a335ce284b8ef627b806ff/Products.ResourceRegistries-2.0.3.zip", "yanked": false}], "2.0.4": [{"comment_text": "", "digests": {"md5": "1fd8b0a781ca96fae10b21d141f446f1", "sha256": "42afab9983787cfc3b2761276d65cbc56fd2c7ba1d1499750c8133a5a46e6f8b"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0.4.tar.gz", "has_sig": false, "md5_digest": "1fd8b0a781ca96fae10b21d141f446f1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 87180, "upload_time": "2011-04-15T15:33:32", "upload_time_iso_8601": "2011-04-15T15:33:32.520689Z", "url": "https://files.pythonhosted.org/packages/9d/5f/76d11f99cc77d3a5a774215ad1195a659f3cca16f5a61a9519cb62ca01d5/Products.ResourceRegistries-2.0.4.tar.gz", "yanked": false}], "2.0.5": [{"comment_text": "", "digests": {"md5": "b7cc13da15aaad822df57c04b4135d35", "sha256": "37c3533d35ba225447b0567d3377e5ee2ccf687f9326270735f39aeedbf125ab"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0.5.zip", "has_sig": false, "md5_digest": "b7cc13da15aaad822df57c04b4135d35", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 123037, "upload_time": "2011-07-19T15:26:30", "upload_time_iso_8601": "2011-07-19T15:26:30.891621Z", "url": "https://files.pythonhosted.org/packages/b3/b9/7e7cb5f071c3b2b5c531975a56579a29f380f386ec3a905a896aa3753731/Products.ResourceRegistries-2.0.5.zip", "yanked": false}], "2.0.6": [{"comment_text": "", "digests": {"md5": "36000e61b18c0b64abbf6c42b1df331b", "sha256": "8c53aa900bdbebf2aad057a45ffa12705b216ff1fa56aca832c21cfb560e8e25"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0.6.zip", "has_sig": false, "md5_digest": "36000e61b18c0b64abbf6c42b1df331b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 123591, "upload_time": "2011-11-24T22:45:05", "upload_time_iso_8601": "2011-11-24T22:45:05.373814Z", "url": "https://files.pythonhosted.org/packages/18/1f/dd6f31477ce2ba25bf1ffab37b72824aab61a3e3f7e233b88373cdd1ebaa/Products.ResourceRegistries-2.0.6.zip", "yanked": false}], "2.0.7": [{"comment_text": "", "digests": {"md5": "6c37aa1d022d35ee7c729c9ef5ba3626", "sha256": "0cb309363f8b719774ad6cea069cba75cd1d33ec0a8a20ce7988d30415e3e826"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0.7.tar.gz", "has_sig": false, "md5_digest": "6c37aa1d022d35ee7c729c9ef5ba3626", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 87190, "upload_time": "2012-03-21T17:24:52", "upload_time_iso_8601": "2012-03-21T17:24:52.124496Z", "url": "https://files.pythonhosted.org/packages/8c/61/fbbd38946d381f8b981c00014d03d5987b407626ad3e5e1f6d40e4371880/Products.ResourceRegistries-2.0.7.tar.gz", "yanked": false}], "2.0.8": [{"comment_text": "", "digests": {"md5": "23c27beb5f1203b4367850019c3ab260", "sha256": "91a7f5d7584a00593b042408f61b9798f4f6c29572f548c41c6584c1e392634f"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0.8.tar.gz", "has_sig": false, "md5_digest": "23c27beb5f1203b4367850019c3ab260", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 87776, "upload_time": "2012-03-21T21:20:02", "upload_time_iso_8601": "2012-03-21T21:20:02.834887Z", "url": "https://files.pythonhosted.org/packages/eb/e3/96b03c85ebda466029c4e0b37c3edb7f523dc713dbf6757768b7d445f23b/Products.ResourceRegistries-2.0.8.tar.gz", "yanked": false}], "2.0.9": [{"comment_text": "", "digests": {"md5": "bd6f31bb793ac5894b89763a2ac45ca0", "sha256": "9336cc6e08aedd5550a3637af673ab3564596721984d3471a44a6e0175fdf86c"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0.9.zip", "has_sig": false, "md5_digest": "bd6f31bb793ac5894b89763a2ac45ca0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 124937, "upload_time": "2012-04-19T02:29:02", "upload_time_iso_8601": "2012-04-19T02:29:02.650295Z", "url": "https://files.pythonhosted.org/packages/be/7c/f1eb5757ecf87c28e610ee2b1994df12cab70fd1c7ac19e3038e240fadeb/Products.ResourceRegistries-2.0.9.zip", "yanked": false}], "2.0a1": [{"comment_text": "", "digests": {"md5": "a2e2e31f2256051b17f6095d8cacbbed", "sha256": "966d6144d700026afd87340419edb2f3f7716159d28721c18567319ecfa5c494"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0a1.zip", "has_sig": false, "md5_digest": "a2e2e31f2256051b17f6095d8cacbbed", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 119004, "upload_time": "2009-11-16T14:04:51", "upload_time_iso_8601": "2009-11-16T14:04:51.103410Z", "url": "https://files.pythonhosted.org/packages/93/85/f8ea3df3df1397f5ecfafc04dc6ae840f574f8638ecb9ed25d1f6485d0fa/Products.ResourceRegistries-2.0a1.zip", "yanked": false}], "2.0a2": [{"comment_text": "", "digests": {"md5": "043019ed00f402cc84665bf65095fe85", "sha256": "ced619551bd08ce4b3fabc71634e36e78760f02c0094aef08d0e95e111f43c33"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0a2.zip", "has_sig": false, "md5_digest": "043019ed00f402cc84665bf65095fe85", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 113382, "upload_time": "2009-12-20T21:49:03", "upload_time_iso_8601": "2009-12-20T21:49:03.416909Z", "url": "https://files.pythonhosted.org/packages/00/b3/cef062e55b33f387c313e01e182046880d338ea06c0d67c7f946f2289da6/Products.ResourceRegistries-2.0a2.zip", "yanked": false}], "2.0b1": [{"comment_text": "", "digests": {"md5": "147ec99ad07acd7eca720ebfdf35fdd9", "sha256": "e2e7300153342224ae63c00e41aceb905e7913ba5201272d142d19bf931015e3"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0b1.zip", "has_sig": false, "md5_digest": "147ec99ad07acd7eca720ebfdf35fdd9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 113455, "upload_time": "2009-12-27T16:45:18", "upload_time_iso_8601": "2009-12-27T16:45:18.039161Z", "url": "https://files.pythonhosted.org/packages/6e/3b/ad31b7bf1720d2c0748ca6946de47454ddadea90beb732c01d4fb6b991b4/Products.ResourceRegistries-2.0b1.zip", "yanked": false}], "2.0b2": [{"comment_text": "", "digests": {"md5": "655e095779573d082fb293c4ecb2d32c", "sha256": "686f000ff692d629e6759130ef1cd8ee7e48e9316915de15216a18b1a3828169"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0b2.zip", "has_sig": false, "md5_digest": "655e095779573d082fb293c4ecb2d32c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 114402, "upload_time": "2010-01-24T17:08:05", "upload_time_iso_8601": "2010-01-24T17:08:05.308359Z", "url": "https://files.pythonhosted.org/packages/e8/8b/1ace826f75465f4a2c0c5a8fdafe14ba45d75663fae0780074d549570a5c/Products.ResourceRegistries-2.0b2.zip", "yanked": false}], "2.0b3": [{"comment_text": "", "digests": {"md5": "e063012d81c453e670140efd07b7a30c", "sha256": "397bb3ae348956c4cc02a184f89e59522d03bcbaef54862b22af042145ff7d2e"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0b3.zip", "has_sig": false, "md5_digest": "e063012d81c453e670140efd07b7a30c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 118513, "upload_time": "2010-05-02T04:08:56", "upload_time_iso_8601": "2010-05-02T04:08:56.360129Z", "url": "https://files.pythonhosted.org/packages/18/38/a8a0b183236cf38b03cc73fd0426e8ae35757da886289816ddb12c89f365/Products.ResourceRegistries-2.0b3.zip", "yanked": false}], "2.0b4": [{"comment_text": "", "digests": {"md5": "5087c031db9f338ac53559a888abf84e", "sha256": "30ba934d58a9d2c968edfc190b29043521da16a7f6b15e1e6d6e52ca0cbae4ba"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0b4.zip", "has_sig": false, "md5_digest": "5087c031db9f338ac53559a888abf84e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 118888, "upload_time": "2010-06-03T16:44:31", "upload_time_iso_8601": "2010-06-03T16:44:31.026744Z", "url": "https://files.pythonhosted.org/packages/53/ca/03c0ed3c1e4750df1ebfb2e86af1aa1a580f7f93d5a4d2f7b923ef8025fc/Products.ResourceRegistries-2.0b4.zip", "yanked": false}], "2.0b5": [{"comment_text": "", "digests": {"md5": "06d0d3d6ab536eff6eaa3966442ae9be", "sha256": "5d8fee1247a93a09503a5a477643ac062a9ed176c410c0061bd0960bc37d6afc"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.0b5.zip", "has_sig": false, "md5_digest": "06d0d3d6ab536eff6eaa3966442ae9be", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 119126, "upload_time": "2010-06-13T15:33:31", "upload_time_iso_8601": "2010-06-13T15:33:31.594636Z", "url": "https://files.pythonhosted.org/packages/b8/7f/7e870e4707bb5722b5929f3e130a3c910244b488e9b349c644d80f1e1df2/Products.ResourceRegistries-2.0b5.zip", "yanked": false}], "2.1": [{"comment_text": "", "digests": {"md5": "df1e7d428d78cb65fdb6f38b2440c019", "sha256": "37cbbbe1f023fe8ac1086161de7f4c08abc8d86b21d682928a5412f2c5837f2e"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.1.zip", "has_sig": false, "md5_digest": "df1e7d428d78cb65fdb6f38b2440c019", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 131209, "upload_time": "2012-04-19T02:12:19", "upload_time_iso_8601": "2012-04-19T02:12:19.512341Z", "url": "https://files.pythonhosted.org/packages/71/5b/ebf06dc45c94da1f9c04d3f4f0597c84a3e538440606539d33ee7ff82042/Products.ResourceRegistries-2.1.zip", "yanked": false}], "2.1.1": [{"comment_text": "", "digests": {"md5": "2ca8f85a1b89e181d0d6d12a4979985b", "sha256": "6f92cfef7cd6dca2c5628c8e5e71f56387404f21ff0be91d4cf132fd8c84b6ef"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.1.1.zip", "has_sig": false, "md5_digest": "2ca8f85a1b89e181d0d6d12a4979985b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 132160, "upload_time": "2012-05-08T03:31:37", "upload_time_iso_8601": "2012-05-08T03:31:37.140220Z", "url": "https://files.pythonhosted.org/packages/da/ec/60aef80a85943a19ec9fb158abcdb936ec691cf88301ec48c4f4261de7e0/Products.ResourceRegistries-2.1.1.zip", "yanked": false}], "2.1.2": [{"comment_text": "", "digests": {"md5": "e4e17b7289399ba3ed64f245d9c5978b", "sha256": "bef2d02ab94878ce5bef4cb7ec278b6a42c537c0f007f2b4a4c069569209e822"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.1.2.zip", "has_sig": false, "md5_digest": "e4e17b7289399ba3ed64f245d9c5978b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 132338, "upload_time": "2012-05-25T22:35:46", "upload_time_iso_8601": "2012-05-25T22:35:46.240269Z", "url": "https://files.pythonhosted.org/packages/a6/79/a00f6d2d9589fde8a495785728f538460f50d00b201b12d5275839823b6c/Products.ResourceRegistries-2.1.2.zip", "yanked": false}], "2.1a1": [{"comment_text": "", "digests": {"md5": "8c5ed8045049555f094aa42a232688b9", "sha256": "6ba947a5ede01a94cf338c8ad74a291e64370e994de15ee20ffbe2f2d7a573bb"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.1a1.tar.gz", "has_sig": false, "md5_digest": "8c5ed8045049555f094aa42a232688b9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 90690, "upload_time": "2011-06-28T22:36:56", "upload_time_iso_8601": "2011-06-28T22:36:56.758905Z", "url": "https://files.pythonhosted.org/packages/5f/0e/d4ad82f4399434d6c034fbc3781c533aa22896bcab0319d095b3ba6befac/Products.ResourceRegistries-2.1a1.tar.gz", "yanked": false}], "2.2": [{"comment_text": "", "digests": {"md5": "9fa0e7bc901f681d2ee9ca4b16b7b89e", "sha256": "ccd1fcba2f81c1e8967045be1dd88b0d1fc1d2876633dc7a200a92ff1f5d1295"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.zip", "has_sig": false, "md5_digest": "9fa0e7bc901f681d2ee9ca4b16b7b89e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 132431, "upload_time": "2012-07-03T04:01:44", "upload_time_iso_8601": "2012-07-03T04:01:44.001799Z", "url": "https://files.pythonhosted.org/packages/a8/e4/9133a5792a15548deec0d605cf435da5c117137ba99bde99e7b073d5ea4a/Products.ResourceRegistries-2.2.zip", "yanked": false}], "2.2.1": [{"comment_text": "", "digests": {"md5": "24da5c222c139c55586425bd929cc7ae", "sha256": "acd2a0afe55388c514be4679f12a0b2752536eb7c979839aefd84c5126465a74"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.1.zip", "has_sig": false, "md5_digest": "24da5c222c139c55586425bd929cc7ae", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 133003, "upload_time": "2012-08-11T19:50:42", "upload_time_iso_8601": "2012-08-11T19:50:42.354412Z", "url": "https://files.pythonhosted.org/packages/51/a3/0c87e7decf2b56694ce409bcaadb55408ec470026ca675683874c07550c9/Products.ResourceRegistries-2.2.1.zip", "yanked": false}], "2.2.10": [{"comment_text": "", "digests": {"md5": "207878a7c4b1583fe3cd609116e40bee", "sha256": "e0a233d6f258e460aca34206a2755ad903d9ec703ab60e820f8ff78645fc95a3"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.10.zip", "has_sig": false, "md5_digest": "207878a7c4b1583fe3cd609116e40bee", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 135529, "upload_time": "2014-01-27T23:23:42", "upload_time_iso_8601": "2014-01-27T23:23:42.247590Z", "url": "https://files.pythonhosted.org/packages/fe/31/60994813366c6e4146477eaf70c3860ddbae7c29d2dfab936ebde5425f56/Products.ResourceRegistries-2.2.10.zip", "yanked": false}], "2.2.11": [{"comment_text": "", "digests": {"md5": "23ddb8c19ecaabcbeb8ee7a6c57cff3d", "sha256": "7268ab10d24afff81243546c434c314f773a14b7dc837cca5dcc32ebe200326e"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.11.zip", "has_sig": false, "md5_digest": "23ddb8c19ecaabcbeb8ee7a6c57cff3d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 135998, "upload_time": "2014-10-14T01:06:42", "upload_time_iso_8601": "2014-10-14T01:06:42.836558Z", "url": "https://files.pythonhosted.org/packages/9d/8a/387760bae5fd39b719ba7757064ec01ce7e7f3952a9706ed2de81e004879/Products.ResourceRegistries-2.2.11.zip", "yanked": false}], "2.2.12": [{"comment_text": "", "digests": {"md5": "048932691153b6dca6fe1dd1cb785c1e", "sha256": "bbb99ce917fb0f76f850075470318113c9d1396dcc41c16070a33c9607dd68f2"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.12.tar.gz", "has_sig": false, "md5_digest": "048932691153b6dca6fe1dd1cb785c1e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 98168, "upload_time": "2016-06-21T14:56:25", "upload_time_iso_8601": "2016-06-21T14:56:25.811769Z", "url": "https://files.pythonhosted.org/packages/2a/b8/8a69fe567f5827d2f8dfec00cc4ac338a2d1fac08806ca71432be29883b5/Products.ResourceRegistries-2.2.12.tar.gz", "yanked": false}], "2.2.13": [{"comment_text": "", "digests": {"md5": "091dc756d98d84e2dcd9a89fbe45d6d2", "sha256": "760d78defa3bb214d7abb92adef4b12390f3ff86ad21c06407abc3413ef62e9b"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.13.tar.gz", "has_sig": false, "md5_digest": "091dc756d98d84e2dcd9a89fbe45d6d2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 98768, "upload_time": "2017-03-09T21:21:39", "upload_time_iso_8601": "2017-03-09T21:21:39.326661Z", "url": "https://files.pythonhosted.org/packages/03/e3/521c622afa5a2dd879ddfab240d58a414583fc513d0e243ef476852b4019/Products.ResourceRegistries-2.2.13.tar.gz", "yanked": false}], "2.2.2": [{"comment_text": "", "digests": {"md5": "7df2d7f55fcce46345a62a599a3700b5", "sha256": "9200610a4cd46bf2a8c5432cda4593b1e5f60b31e270dd518670391e83bc9764"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.2.zip", "has_sig": false, "md5_digest": "7df2d7f55fcce46345a62a599a3700b5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 132676, "upload_time": "2012-08-30T01:08:00", "upload_time_iso_8601": "2012-08-30T01:08:00.773423Z", "url": "https://files.pythonhosted.org/packages/1a/c5/c602122c7592ee1a3bc9e8bb4e1b33ff93bef5c3bbd566401805534e3602/Products.ResourceRegistries-2.2.2.zip", "yanked": false}], "2.2.3": [{"comment_text": "", "digests": {"md5": "5007791edf82d05f90ce78095df27b1c", "sha256": "b986e354c23d160ecc336c75ba09896e10b01d62f2fb67cdd0a8592c1ca6a3c5"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.3.zip", "has_sig": false, "md5_digest": "5007791edf82d05f90ce78095df27b1c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 132880, "upload_time": "2012-10-16T14:42:51", "upload_time_iso_8601": "2012-10-16T14:42:51.786370Z", "url": "https://files.pythonhosted.org/packages/99/4f/d117792c9f185305b66e05583d3c0b18e7d140f1fbd1bc6dcdc7652d4396/Products.ResourceRegistries-2.2.3.zip", "yanked": false}], "2.2.4": [{"comment_text": "", "digests": {"md5": "6a7c24c2d266ba1571647063f4261f91", "sha256": "4273f847152f20bb0a07996f05273071e60e8f73719e401c630b0d4dabccdf0f"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.4.zip", "has_sig": false, "md5_digest": "6a7c24c2d266ba1571647063f4261f91", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 132951, "upload_time": "2012-12-10T02:23:01", "upload_time_iso_8601": "2012-12-10T02:23:01.961654Z", "url": "https://files.pythonhosted.org/packages/06/6d/17d5e0530b0a92a7d297328837edbecdd58e22de8c1c385adbbf54734982/Products.ResourceRegistries-2.2.4.zip", "yanked": false}], "2.2.5": [{"comment_text": "", "digests": {"md5": "bdd8015ceea9fa3d9e07a45312cb9d82", "sha256": "ebd7c12c575d81bcf6225d1a46b0b7c0e4cfd501cbb60c2d496041f29a2c9643"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.5.zip", "has_sig": false, "md5_digest": "bdd8015ceea9fa3d9e07a45312cb9d82", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 133509, "upload_time": "2013-01-13T19:16:01", "upload_time_iso_8601": "2013-01-13T19:16:01.473816Z", "url": "https://files.pythonhosted.org/packages/a6/32/26071f33cfd8e6ac1a139240dd0750b8131951653cfcd3b3ad5f0046bb24/Products.ResourceRegistries-2.2.5.zip", "yanked": false}], "2.2.6": [{"comment_text": "", "digests": {"md5": "9cf6efbcf2a6510033c06e1d3af94080", "sha256": "9fa8faccaa8f0bf563328f27edaf067d5b491ef16146ff4c340f030de9ac5368"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.6.zip", "has_sig": false, "md5_digest": "9cf6efbcf2a6510033c06e1d3af94080", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 134142, "upload_time": "2013-01-17T21:42:57", "upload_time_iso_8601": "2013-01-17T21:42:57.928201Z", "url": "https://files.pythonhosted.org/packages/10/37/c3ce44980b28d7cb2cfc9cbe4eee4dcb529039881f934d7d78168ce7802e/Products.ResourceRegistries-2.2.6.zip", "yanked": false}], "2.2.7": [{"comment_text": "", "digests": {"md5": "954e31a168a1eb3153e2fd4e590bb9ba", "sha256": "cb66e2f232042cee3468edf97b13aa8efa40fa477bac7a3b0a16352a71d0e88d"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.7.zip", "has_sig": false, "md5_digest": "954e31a168a1eb3153e2fd4e590bb9ba", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 134220, "upload_time": "2013-03-05T23:45:30", "upload_time_iso_8601": "2013-03-05T23:45:30.524997Z", "url": "https://files.pythonhosted.org/packages/2f/ec/5d2165b2df0db755b44cf100c6e080f27b76c2ee48160850f8a1292abc46/Products.ResourceRegistries-2.2.7.zip", "yanked": false}], "2.2.8": [{"comment_text": "", "digests": {"md5": "dddf7391091834b2ef79f8ee1e19c043", "sha256": "b4cd28880346a3a3cc12516694f6a46e871c7f8736846fe77b307609fb5a006e"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.8.zip", "has_sig": false, "md5_digest": "dddf7391091834b2ef79f8ee1e19c043", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 134534, "upload_time": "2013-05-24T00:24:15", "upload_time_iso_8601": "2013-05-24T00:24:15.067087Z", "url": "https://files.pythonhosted.org/packages/02/b8/0fd9d8f5ee95ec5bf0ac8527205cc3830e6c91d4c1d24f0ea4957e77c8ef/Products.ResourceRegistries-2.2.8.zip", "yanked": false}], "2.2.9": [{"comment_text": "", "digests": {"md5": "8dd4f36eb894d868366b51941f6f0966", "sha256": "a8ce3485c028c7c2a7e6b0316f1eabaf8c42902a4980266d8c04e9ab6d322224"}, "downloads": -1, "filename": "Products.ResourceRegistries-2.2.9.zip", "has_sig": false, "md5_digest": "8dd4f36eb894d868366b51941f6f0966", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 134914, "upload_time": "2013-06-14T01:54:53", "upload_time_iso_8601": "2013-06-14T01:54:53.376568Z", "url": "https://files.pythonhosted.org/packages/bb/e2/2b835cc1e1ce9353be8b2ae3fa52229dc970ef4586aa56f09c6586676465/Products.ResourceRegistries-2.2.9.zip", "yanked": false}], "3.0": [{"comment_text": "", "digests": {"md5": "1c006eb8d9cd47358a17a2a95b47ca66", "sha256": "4a80d797c8c6aaa9caba4f70073771852c661d0ee783b3cc6f7276c515220e87"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.zip", "has_sig": false, "md5_digest": "1c006eb8d9cd47358a17a2a95b47ca66", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 135215, "upload_time": "2014-04-05T14:37:52", "upload_time_iso_8601": "2014-04-05T14:37:52.520994Z", "url": "https://files.pythonhosted.org/packages/95/82/42f7a84f4e0ab5767003bb3181c989c34fe0ee567fe3ee61a63bf0d526cc/Products.ResourceRegistries-3.0.zip", "yanked": false}], "3.0.1": [{"comment_text": "", "digests": {"md5": "1ca1176c50b153ca61bd33dd0879fda8", "sha256": "df40eab673a5b04b680ddd865e60020db68f0765c15cdc5cf71860da26ecd9c3"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.1.zip", "has_sig": false, "md5_digest": "1ca1176c50b153ca61bd33dd0879fda8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 136714, "upload_time": "2014-10-24T02:11:13", "upload_time_iso_8601": "2014-10-24T02:11:13.879042Z", "url": "https://files.pythonhosted.org/packages/bf/b8/509c8d760cd12433d57b18b59b254c33020d4592410f9f2fca6b7f1d6d36/Products.ResourceRegistries-3.0.1.zip", "yanked": false}], "3.0.2": [{"comment_text": "", "digests": {"md5": "51a82a5576b7e1375035bc7b6a2df663", "sha256": "255757a84aca120a891af72aa94608bae3e9cce05d4cc67b47bd2a7881982933"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.2.tar.gz", "has_sig": false, "md5_digest": "51a82a5576b7e1375035bc7b6a2df663", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 98897, "upload_time": "2015-05-04T15:23:57", "upload_time_iso_8601": "2015-05-04T15:23:57.586854Z", "url": "https://files.pythonhosted.org/packages/75/e5/7b05cb041ecaedd71222d49349adc1e65bfeaef1372f01fc0633a793a8f8/Products.ResourceRegistries-3.0.2.tar.gz", "yanked": false}], "3.0.3": [{"comment_text": "", "digests": {"md5": "d9ee28512fa4f961897962299d0f7d88", "sha256": "9243863ade684132518ee8eee5ab9f0eb65ac4196b5000ac764e91f6d6eb7669"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.3.tar.gz", "has_sig": false, "md5_digest": "d9ee28512fa4f961897962299d0f7d88", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 99172, "upload_time": "2015-09-22T15:08:25", "upload_time_iso_8601": "2015-09-22T15:08:25.665940Z", "url": "https://files.pythonhosted.org/packages/62/53/444de841fc01fbd18f509a17dd46546e54a06b82b647eb2d43ef4fd6fe05/Products.ResourceRegistries-3.0.3.tar.gz", "yanked": false}], "3.0.4": [{"comment_text": "", "digests": {"md5": "bf2d0062a92df78944c495c036c0f2b0", "sha256": "180ce15dd1531b74cb949095a196b13d5f61b3d671a7d3484de8d548a49bf5a2"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.4.tar.gz", "has_sig": false, "md5_digest": "bf2d0062a92df78944c495c036c0f2b0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 99469, "upload_time": "2016-08-18T00:46:17", "upload_time_iso_8601": "2016-08-18T00:46:17.037815Z", "url": "https://files.pythonhosted.org/packages/a0/ad/43cfe2fe958bed2199ae9bff960102e692cbcc697ebb9bd04cc02cb79bf5/Products.ResourceRegistries-3.0.4.tar.gz", "yanked": false}], "3.0.5": [{"comment_text": "", "digests": {"md5": "89d9cbfc382f9957b971f52bc5940a64", "sha256": "ab78ce51082501953bd3de767aa77c591f793237b404e6237e35c26826135935"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.5.tar.gz", "has_sig": false, "md5_digest": "89d9cbfc382f9957b971f52bc5940a64", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 79196, "upload_time": "2016-11-17T19:02:27", "upload_time_iso_8601": "2016-11-17T19:02:27.752568Z", "url": "https://files.pythonhosted.org/packages/51/1d/95204a13069a66eb2e3beb1a6665954162cb51a511a2e180121b253beeb1/Products.ResourceRegistries-3.0.5.tar.gz", "yanked": false}], "3.0.6": [{"comment_text": "", "digests": {"md5": "0f06cf1b69828e8f057a741c1d918da3", "sha256": "c6f48b196f51a97f600fe6c0689cbbac36060e8875f3acd2f60675f2fb8a30c8"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.6-py2-none-any.whl", "has_sig": false, "md5_digest": "0f06cf1b69828e8f057a741c1d918da3", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 84372, "upload_time": "2018-02-04T23:51:46", "upload_time_iso_8601": "2018-02-04T23:51:46.873419Z", "url": "https://files.pythonhosted.org/packages/8c/fe/4783108fa414a61e9da42aac2360702b02170b6ce15282025d8380c3166c/Products.ResourceRegistries-3.0.6-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4b62e1a13953c5e59700e7705103745f", "sha256": "1d51623547ec23741f03dd02a2ec3a0671ca928bb3644f06ebf1eba8a90a4020"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.6.tar.gz", "has_sig": false, "md5_digest": "4b62e1a13953c5e59700e7705103745f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 78567, "upload_time": "2018-02-04T23:51:48", "upload_time_iso_8601": "2018-02-04T23:51:48.850805Z", "url": "https://files.pythonhosted.org/packages/8e/c3/3f72e83b36e775bfea8a3f82bf6a3e1ddac870cc5a2c6b9fdd8388347c0b/Products.ResourceRegistries-3.0.6.tar.gz", "yanked": false}], "3.0.7": [{"comment_text": "", "digests": {"md5": "a9b9adbd5016a130f17537e71791a240", "sha256": "091cc9c4342023c3df1dcaaf0bc2c9b76627e7287f18b9aba16e8c6fb2930331"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.7-py2-none-any.whl", "has_sig": false, "md5_digest": "a9b9adbd5016a130f17537e71791a240", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 84350, "upload_time": "2018-04-08T18:42:52", "upload_time_iso_8601": "2018-04-08T18:42:52.925700Z", "url": "https://files.pythonhosted.org/packages/47/30/a32afd9597bd9e05d054f6f7b131e165141be84a0d2dc0b0732d8ffa95e7/Products.ResourceRegistries-3.0.7-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "dfe40acda620563be21115db8fe03360", "sha256": "521ff42a1a87d52d3fe79e553b79b928c8214ee1b0312396fb83137751357698"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.7.tar.gz", "has_sig": false, "md5_digest": "dfe40acda620563be21115db8fe03360", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 81425, "upload_time": "2018-04-08T18:42:57", "upload_time_iso_8601": "2018-04-08T18:42:57.006970Z", "url": "https://files.pythonhosted.org/packages/0c/f9/2c097c2699a13cc980e3f269d75eac9796682a2c6d22a10d7c7549e4ef22/Products.ResourceRegistries-3.0.7.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "a9b9adbd5016a130f17537e71791a240", "sha256": "091cc9c4342023c3df1dcaaf0bc2c9b76627e7287f18b9aba16e8c6fb2930331"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.7-py2-none-any.whl", "has_sig": false, "md5_digest": "a9b9adbd5016a130f17537e71791a240", "packagetype": "bdist_wheel", "python_version": "py2", "requires_python": null, "size": 84350, "upload_time": "2018-04-08T18:42:52", "upload_time_iso_8601": "2018-04-08T18:42:52.925700Z", "url": "https://files.pythonhosted.org/packages/47/30/a32afd9597bd9e05d054f6f7b131e165141be84a0d2dc0b0732d8ffa95e7/Products.ResourceRegistries-3.0.7-py2-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "dfe40acda620563be21115db8fe03360", "sha256": "521ff42a1a87d52d3fe79e553b79b928c8214ee1b0312396fb83137751357698"}, "downloads": -1, "filename": "Products.ResourceRegistries-3.0.7.tar.gz", "has_sig": false, "md5_digest": "dfe40acda620563be21115db8fe03360", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 81425, "upload_time": "2018-04-08T18:42:57", "upload_time_iso_8601": "2018-04-08T18:42:57.006970Z", "url": "https://files.pythonhosted.org/packages/0c/f9/2c097c2699a13cc980e3f269d75eac9796682a2c6d22a10d7c7549e4ef22/Products.ResourceRegistries-3.0.7.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:17:46 2020"}