{"info": {"author": "Kupu Team", "author_email": "kupu-dev@codespeak.net", "bugtrack_url": null, "classifiers": ["Framework :: Plone", "Programming Language :: JavaScript", "Programming Language :: Python"], "description": "====\nKupu\n====\n\nWhat is Kupu?\n-------------\n\nKupu is a cross-browser WYWSIWYG editor. It allows the comfortable\nediting of the body of an HTML document. It's client-side (browser)\nrequirements are one of:\n\n  - Mozilla 1.3.1 or higher\n\n  - Internet Explorer 5.5 or higher\n\n  - Netscape Navigator 7.1 or higher\n  \n  - Opera 9 or higher\n\nServer-side there are hardly any requirements, except for some way of\nprocessing data (CGI or something more fancy like PHP, ASP or Python\nscripts in Zope).\n\nKupu is particularly suited for content migration as well as editing.\nContent copied from an existing web page is pasted with all formatting\nintact. This includes structure such as headings and lists, plus links,\nimage references, text styling, and other aspects. Copying text from a\nword processor with an HTML clipboard - such as MS Word - works exactly\nthe same.\n\nKupu will clean up the content before it is sent to the server, and can\nsend data to the server asynchronously using PUT (which allows the data \nto be saved without reloading the page) as well as in a form.\n\nKupu can be customized on many different levels, allowing a lot of changes\nfrom CSS, but also providing a JavaScript extension API.\n\n\nMore documentation...\n---------------------\n\nGeneral information\n\n  o Authors: see CREDITS.txt\n\n  o License: see LICENSE.txt\n\n  o Frequently asked questions: see FAQ.txt\n\nInstallation\n\n  o general: see INSTALL.txt\n\n  o Zope 2.x: see ZOPE2.txt\n\n  o Plone 2.x: see PLONE2.txt\n\nDeveloping\n\n  o Customizing kupu: see CUSTOMIZING.txt\n\n  o Extending kupu: see EXTENDING.txt\n\n  o Java Script API: see JSAPI.txt\n\n  o Old browser support: see OLDBROWSERS.txt\n\n  o Templating system: see TEMPLATE-SYSTEM.txt\n\n  o Library Feature Specification: see LIBRARIES.txt\n\n\nHomepage\n--------\n\nKupu has a homepage at http://kupu.oscom.org\n\n\nReporting bugs\n--------------\n\nPlease report bugs to the issue tracker available at:\nhttp://codespeak.net/issues/kupu/ (mind the trailing slash).\n\n\nMailing list\n------------\n\nThere is a mailing lists for Kupu development: kupu-dev@codespeak.net\n\n\nLicense\n-------\n\nUnless otherwise stated, kupu is released under the Kupu License. See\nLICENSE.txt for the license text.\n\nThe Sarissa ECMAScript library shipped in this distribution\n(common/sarissa.js) is the work of Manos Batsis and distributed under\nthe Kupu License with his kind permission. See the Sarissa homepage at\nhttp://sarissa.sourceforge.net for more information.\n\n\n============\nKupu changes\n============\n\n- 1.5.2 (2013-08-14)\n\n  - Make getWysiwygmacros unpublishable.\n    [davisagli]\n\n- 1.5.1 (2012-12-09)\n\n  - Avoid possible DoS of spellchecker by prefixing each line with ^.\n    This fixes https://plone.org/products/plone/security/advisories/20121106/12\n    [davisagli]\n\n  - Compatibility fixes for IE9+.\n\n    This fixes http://dev.plone.org/ticket/11824.\n    [malthe]\n\n  - Convert GenericSetup profile registration to ZCML, to add compatibility\n    with GenericSetup version after 1.6.2 and also move an interface to the\n    correct place.\n    [hannosch]\n\n  - Copy in minimalpath from CMFCore as it has been removed from CMFCore 2.3.\n    [elro]\n\n- 1.5.0\n\n  - Fix warnings due to missing i18n domain in configure.zcml.\n    [davisagli]\n\n- 1.5.0b1 (2011-01-04)\n\n  - Set Site Administrator role as default permission for Plone 4.1.\n    [elro]\n\n  - Depend on ``Products.CMFPlone`` instead of ``Plone``.\n    [elro]\n\n  - Use of the resolveuid Python script to resolve URLs in the form\n    resolveuid/<UID> has been removed. These are now resolved by a browser view\n    in plone.outputfilters.\n    [davisagli]\n\n  - Use of the kupu_captioned_image template to customize the caption added to\n    images is deprecated. Use the similar template in plone.outputfilters\n    instead.\n    [davisagli]\n\n  - Use plone.uuid to look up content UUIDs, if available.\n    [davisagli]\n\n  - Use the resolveuid and captioning transform from plone.outputfilters\n    instead of implementing our own.\n    [davisagli]\n\n  - Remove use of tabindex iterator, which is no longer available in Plone 4.\n    This fixes http://dev.plone.org/plone/ticket/11138.\n    [encolpe, davisagli]\n\n  - Add definitions to zmi_links template to fix it in Plone 4. This fixes\n    http://dev.plone.org/plone/ticket/11182.\n    [ctxlken, davisagli]\n  \n  - Releases are now being made from the Plone collective svn.\n\n- 1.4.16\n\n  - Kupu didn't not transform resolveuid to friendly url in area tags\n    (Plone ticket 9402).\n\n  - Updated getWysiwygmacros to respect Plone 4's default_editor property.\n\n  - Remove Kupu from the available editors list on uninstall.\n\n  - Add Kupu to the available editors list when installed via the\n    GenericSetup profile.\n\n  - Converted GenericSetup import and export step registrations to ZCML.\n\n  - Added icon_expr to the Plone configlet action registration, for\n    forward-compatibility with Plone 4.\n\n- 1.4.15\n\n  - Don't assume there is only one kupu widget on the page. Made each config node unique. (DannyB)\n\n- 1.4.14\n\n  - Fix kupu_xmlconfig to not assume all needed variables are already\n    in scope. This fixes \n    http://dev.plone.org/old/plone/attachment/ticket/9266\n\n  - Do not assume that kupu is always used in Plone. This fixes\n    http://dev.plone.org/plone/ticket/9053\n\n  - Removed bogus `global_defines` call from kupu_xmlconfig.pt, which was\n    both expensive and failed for certain kind of non-content contexts.\n\n  - Fixed kupuconfig quoting to work with kss (Plone ticket 9240).\n\n- 1.4.13\n\n  - Patch from Andy Altepeter: kupu updatestate patch\n\n  - Patch from Gerhard Weis: small js-bugfix in kupudrawers.js\n\n  - Wrap the inline xml configuration with javascript document.write\n    in the plone integration, so edit pages are valid (x)html.\n\n  - Changed undefined variable ${portal_url} to ${context/portal_url} in\n    page templates.\n\n  - Declare package dependencies and fixed deprecation warnings for use of\n    Globals.\n\n  - Remove conditional comments when editing in IE (otherwise IE converts\n    them to visible text)\n\n  - Added a `kupu_enabled` browser view, which can be used instead of the\n    isKupuEnabled method of the plonelibrarytool.\n    [hannosch]\n\n  - Changed the default titlelength for cropping titles in the link drawer to\n    255 instead of 60.\n\n  - Correct dependency for the Plone egg.\n\n  - Plone tickets\n\n    * 8612 strangely numbered column headings (Col 01 | Col 11 | Col 21 | Col 31 etc.)\n    * 9190 Please make new release for Kupu to apply updated translation\n\n\n- 1.4.12\n\n  - Plone tickets\n\n    * 8280 HTML source preview bug with Kupu 1.4.10 and Firefox 3\n    * 8287 html2caption is vulnerable to being fooled by acquisitions\n    * 8546 kupu AttributeError captioning\n\n- 1.4.11\n\n  - French translations broke drawers\n\n  - Added full undo/redo support using 'diff_match_patch.js'.\n\n  - Plone tickets\n\n    * 8327 Kupu CSS inserted below ploneCustom.css in the CSS registry\n\n- 1.4.10\n\n  - Update emptypage.pt to include a hint for deliverance that edited\n    pages should not be themed. [wiggy]\n\n  - Purged old Zope2 Interface interfaces for compatibility with Zope 2.12 and Plone 4, while maintaining compatibility\n    with pre Plone 4 versions of Products.PortalTransforms.\n    [elro]\n\n  - Plone tickets\n\n    * 7779 imageuploader doesn t show the input for file if not in english\n    * 7958 Kupu: Insert image: KeyError: 'info' (Error 503 loading kupucollection.xml?resource_type=mediaobject)\n    * 7990 Internal link drawer broken for editors\n    * 8003 Fixed Kupu translation msgids containing html.\n    * 8009 Pasting from OpenOffice broken / mishandled comments\n    * 8014 kupu zmi_docs#images link broken\n    * 8039 Kupu locks up on adding images when user does not have manager privileges\n    * 8080 After uploading image, the \"Insert Image\" dialog remains open\n    * 8129 \"TypeError: string indices must be integers\" error on plonedrawers.py when installing\n\n- 1.4.9\n\n  - Manage anchors didn't add an anchor correctly if there was an\n    anchor used for a link inside the element.\n\n  - timte fixed a possible unicode decode error\n\n  - Image upload now has same style options as image insertion.\n\n  - Plone tickets\n\n    * 6915 Kupu can't find anchors inside table cells\n    * 7409 \"edit without kupu\" does not appear on edit form (the fix for this make the link appear but only in source mode).\n    * 7804 KupuLibraryTool spellcheck method is missing a docstring\n    * 7893 Workaround for bad KSS form submissions\n    * 7916 Kupu breaks strong/em tags with class names, on firefox\n    * 7939 Kupu breaks on Firefox 3.0b4 in OSX\n\n- 1.4.8\n\n  - Tabbing key now takes you to next/previous field. However, plone\n    ticket #7727 might result in tab behaviour changing again.\n\n  - Plone tickets\n\n    * 7473 Kupu full screen mode looks broken\n    * 7494 Insert internal link using IE links in the wrong place\n    * 7680 Kupu stripping out anchor to top of current page\n    * 7713 Kupu browser \"Home\" link goes to Plone root and not content\n      root.\n    * 7728 turning on \"Link using UIDs\" breaks indexing of rich text\n      fields that contain unicode characters out of the 128 range\n\n- 1.4.7\n\n  - Added metadata.xml file to the Plone GenericSetup profile.\n\n  - Style whitelist and class blacklist now work when there is only\n    one entry in the list.\n\n  - Span tags with no attributes after filtering are removed.\n\n- 1.4.6\n\n  - Fixed ReftextField error introduced in 1.4.5\n\n- 1.4.5\n\n  - Fixed unit tests for the transform (they now use a real image instead of a mockup)\n\n  - Fixed the transform to preserve links around images.\n\n  - Images may only be resized if 'height' and 'width' are permitted\n    image attributes. Resizing images in Firefox sets those\n    attributes rather than the style attribute.\n\n  - Plone tickets\n\n    * 5765 Kupu in IE unable to make a link from selected image\n    * 6430 Kupu: changes to images resized by handle-dragging are\n      lost (not saved)\n    * 6835 Drag image breaks in Kupu\n    * 7293 kupu import step has the wrong dependencies in a portal\n      setup export\n    * 7377 Making an Image a Link within Kupu renders the link tag at\n      the top of the content page\n    * 7387 Kupu-Commit Selected Changes button missing when\n      converting UID=>Relative Link\n    * 7426 Kupu 1.4.4 installed with Plone 3.0.3 for PowerPC presents\n      itself in Safari 3.0.4, but content in Kupu window can't be edited \n    * 7428 Searching for non-ascii character in kupu Insert Link\n      dialog causes Error 500 \n    * 7419 Plone and/or Kupu should at least WARN an editor of an\n      image that changes may be lost at Save time\n\n- 1.4.4\n\n  - Enabled Safari support (needs webkit nightly build and Safari 3)\n\n  - Plone tickets\n\n    * 7099 Kupu error on multi-schemata archetypes content\n    * 7258 Missing translation msgids for kupu\n    * 7224 Kupu: error in iframe tabindex attribute\n    * 7229 kupu 1.4.3 css correction to display redo button icon in editing interface\n    * 7285 Kupu Accesskey for Save conflict with Firefox History Menu\n    * 7305 Page creation and kupu upload image returns an error if Kupu link uid's is turned on.\n    * 7315 Kupu table of contents generator doesn't allow multiple paragraph styles to be selected in IE7\n\n- 1.4.3\n\n  - Kupu now uses sarissa 0.9.8.1 (still a differences in\n    sarissa_ieemu_xpath.js, but these are purely cosmetic so that jslint\n    runs cleanly).\n\n  - Plone tickets\n\n    * 6970: can't upgrade to Kupu 1.4.1\n    * 6975: Cannot save HTML field as NULL\n    * 7119: 'Edit without visual editor' link doesn't show up in Plone 2.5.3\n    * 7139: Kupu Manage Anchors not working in inline edit\n    * 7140: kupu fails with danish letters in title.\n    * 7143: UnicodeError inserting image\n    * 7158: Kupu Edit already inserted image: Preview and sizes get wrong urls\n\n- 1.4.2\n\n  - Florian fixed some encoding errors\n\n  - Plone tickets\n\n    * 7074: Search for image errors in Kupu\n\n- 1.4.1\n\n  Limi asked for some last minute changes for Plone 3:\n\n  - Embed doesn't work out of the box in Plone 3, so shouldn't be shown\n    by default (it will only lead to a lot of user frustration).\n\n  - The anchor/table of contents generation is done differently in Plone\n    3, so should be off by default (turning on buttons is easy in Kupu\n    now).\n\n  - Insert image/link should default to current folder instead of\n    Recent, since the Upload button isn't visible if not (which is the\n    most common use case)\n\n  - Place the delete link/image button after the pulldown (so it doesn't\n    push around the toolbar elements)\n\n  - Default table styles now include \"grid listing\" and \"invisible\".\n\n  - Paragraph styles now labelled just styles and include: highlight, page break, clear floats\n\n  - Create headings now on by default.\n\n- 1.4\n\n  - The icons in the toolbar for Plone now use CSS sprites. This means that\n    instead of having 30 files each being 16x16, we put all the icons  \n    in one file, and reference the file once. Then we use CSS positioning to  \n    pull out the right icon.This has a major impact on how quickly Kupu\n    performs its initial load ??? as HTTP roundtripping is very time-consuming.\n    Before, Kupu did 17 HTTP requests for its initial image loading, now it\n    only does one.\n\n  - Fixed a KeyError exception when importing a GenericSetup profile.\n\n  - Minor styling changes to the image upload form.\n\n  - Plone tickets\n\n    * 6486: formUnload protection invoked for inline kupu editor even after Save\n\n    * 6833: Error 500 loading kupu_migration.xml\n\n- 1.4rc2\n\n  - Fixed broken code for determining the width of captioned images.\n    Also removed the hardwired html for the transform and use a\n    template instead (so it can be customised).\n\n  - Default image size is now configurable\n\n  - Plone tickets\n\n    * 6756: Kupu Pull-quote style not working in IE\n\n    * 6739 Hide the \"edit without visual editor\" link when there is only one format available\n\n    * 6535: Can't upload image via visual editor in inline edit\n\n    * 6801 'contentUsesKupu' shouldn't expect string type\n\n    * 6759: Kupu caption CSS needs some love.\n\n- 1.4rc1\n\n  - Added a 'manage anchors' tab to the anchor drawer\n\n  - Big cleanup of i18n attributes\n\n  - Updated the Japanese translation files, thx to Tyam.\n\n  - Added in some support for inserting Flash content.\n\n  - Media objects may now have a list of classes (specific to the portal type).\n\n  - Image drawer layout has been tidied up.\n\n  - Anchors in the link drawer now have a slightly cleaner ui.\n\n  - Drawer actions which do server requests now display a wait cursor.\n\n  - Removed the tabindex from all the toolbar buttons and added it to\n    the iframe: this means you can tab into kupu from above without\n    dying of old age as you try to get past the toolbar. Added a\n    handler for the tab key so that pressing tab will take you to the\n    next tabstop in the form.\n\n  - Only single trailing <br> tags are stripped from p and div tags: multiple\n    <br> tags are left unchanged (so those people who insist on using\n    the to generate whitespace still can).\n\n  - Plone tickets:\n\n    * 5622 Add a class (even if empty) to internal LinkDrawer\n\n    * 6283 Do not allow bigger images than Preview by default from Kupu\n\n    * 6440 Browser error: exception element has no properties while\n      registering an event handler for element null, event click, method\n      function ()\n\n    * 6720 i18n error in kupu collection\n\n    * 5985 Kupu should not strip the dir attribute by default.\n\n    * 5985 Range.intersectsNode declared obsolete\n\n    * 5189 patch to support embed tag\n\n    * 5420 \"Edit with kupu\" broken for fields on custom fieldset\n\n    * 6056 Extra line breaks added in pre tags\n\n    * 6103 resolveuid does not check input values and throws deep\n      \"list index out of bound\" error in ZopeGuards.py\n\n    * 6536 Formatting of captioned images is messed up\n\n    * 6548 Links tab on kupu control panel gives traceback, cannot\n      find kupu_references\n\n    * 6598 Default linkables in Kupu: folder is not, plone site is not, ATRelativePathCriterion is\n\n    * 4887 Fix for \"editing defaults to kupu, even when javascript turned off\" reverted as it breaks inline editing.\n\n- 1.4 Beta 6\n\n  - Removed the getToolByName deprecation workround since\n    getToolByName is now officially undeprecated again.\n\n  - Removed most of the illegally nested forms produced by the xsl. \n    I hope this will stop IE6 crashing. The image upload form is still\n    there as it is going to take more major surgery to get rid of that \n    one.\n\n- 1.4 Beta 5\n\n  - Adjusted some more Plone tests to work on Plone 3.0.\n\n  - Kupu is automatically suppressed when the content being edited\n    starts with an html comment (<!--).\n\n  - getToolByName directed through a local kupu implementation in an\n    attempt to suppress CMFCore deprecation warning. (This is the wrong\n    way round, we should really call queryUtility everywhere in kupu and\n    have the mapping fallback to getToolByName, but it should do for now)\n\n  - Table of contents numbering is now optional.\n\n  - Disabled undo/redo, sub/superscript and unordered list buttons\n\n  - Link checker now recognises attributes with whitespace round '='.\n\n- 1.4 Beta 4\n\n  - Adjusted some Plone tests to work on Plone 3.0.\n\n  - Added 'remove table' button to table drawer and tool box.\n\n  - the uid/captioning transform now has a hook which gets called if\n    kupu fails to resolve the uid.  Use this for any fallback processing\n    (e.g. lookup the uid catalog in a different plone site, or just return\n    a default error page.\n\n  - Fixed NonXHTMLTagFilter default filterdata: 'big', 'small' and 'tt' are\n    valid XHTML tags, 'h7' not.\n\n  - Fixed some small issues in XhtmlValidation elements.\n\n  - Improved KSS integration:\n\n\t* Added an invisible save button to Plone toolbar: KSS will link up\n\t  events and make it visible when editing inline.\n\n\t* Fixed site error on empty page (Plone 3 compatibility)\n\n  - HTML cleanup improved: spurious <br/> tags removed.\n\n- 1.4 Beta 3\n\n  - Fixed a bug where createLink deleted the selected text.\n\n  - Paragraph styles may now be replaced as well as added to in a\n    widget definition.\n\n  - Toolbar buttons may be hidden globally, according to an \n    expression, or from a widget definition.\n\n  - Support for generic setup added (when present, older systems may\n    continue to use the quickinstaller) \n\n  - Resource definitions can now optionally add any new Plone types to\n    the resource. This means that all custom types will be 'linkable'\n    unless otherwise configured.\n\n  - A modified version of jslint is included in the kupu\n    sources (with the ability to suppress a lot of the warnings).\n\n  - The javascript files used by Plone (and some of the other ones)\n    now run through jslint without warnings. This means they can be\n    compressed by programs which remove line endings in an unsafe\n    manner.\n\n- 1.4 Beta 2\n\n  - Paragraph styling now permitted inside a table again (contributed\n    by George Lee).\n\n  - Fixed a bug where changing a TR style while the selection covered\n    more than one row corrupted the DOM.\n\n  - New style option '(remove style)' always present and removes the\n    closest style round the selection (i.e. a span or block tag, or \n    removes the className if it hits a table tag with a class).\n\n  - Added a link maintenance page. Checks for bad links (i.e. those \n    kupu doesn't understand), also converts links from relative paths\n    to resolveuid and back again.\n\n- 1.4 Beta 1\n\n  - Fixed some problems with handling of multi-valued form fields in the\n    ExternalSource tool code for Silva.\n\n  - Merged Plone style code back into common code.\n\n  - Redid the table style code to work better. The style pulldown now\n    displays either paragraph styles or table styles, not both\n    together.\n\n  - Added code to manipulate anchors. New drawer to insert anchor\n    links either singly or as a table. (Plone and HMTL forms).\n\n  - Changes to drawer layout to look prettier and to allow direct\n    linking to folders.\n\n  - Support for AT reference browsing using the Kupu UI. This means\n    that Kupu on Plone now requires Archetypes 1.3+\n\n  - Plone sample customisation now gets run on installation if there\n    isn't a customised version. This means that the defaults for the\n    tool don't all need to be hardwired.\n\n  - Plone configlet now makes it easier to enable linkbyuid and\n    captioning options.\n\n  - HTML view now does filtering by default in Plone (can be turned\n    off in the configlet). This also means that after pasting from e.g.\n    Word the HTML can be cleaned up simply by toggling source view\n    on/off.\n\n- 1.3.8\n\n  - HTML view now does filtering by default in Plone (can be turned\n    off in the configlet). This also means that after pasting from e.g.\n    Word the HTML can be cleaned up simply by toggling source view\n    on/off.\n\n\n- 1.3.6\n\n  - Plone\n\n      * Enabled selection of image sizes in standard libraries.\n\n  - Silva\n\n    * Fixed multi-value form element support in ExternalSource tool.\n\n  - General\n\n      * Added optional list of server provided image sizes.\n\n- 1.3.5\n\n  - Silva\n\n    * Some minor glitches, button names changed, some names converted from\n      upper- to lowercase, etc.\n\n- 1.3.4\n\n  - Silva \n\n      * Fixed some small issues in external sources support.\n\n      * Fixed some problems with tables, table column alignment and relative\n        width settings should not clash anymore.\n\n  - General\n\n      * Zope related: changed imports so they try to import Zope2 rather than\n        Zope (with Zope as a fallback) to not have Zope 2.8.x issue warnings.\n\n- 1.3.3\n\n  - Plone\n\n      * Text is no longer automatically forced into a paragraph as\n        this caused problems on Mozilla when editing at the end of the\n        file. The style pulldown now distinguishes text with 'no\n        style' from 'Normal'.\n\n      * Fixes to Plone issues:\n\n        4434 - 'int' object is not callable on editing\n\n        4896 - Kupu interface invisible if color changed\n\n        4911 - Kupu creates incorrect relative link in new page\n\n        4801 - Kupu Links: search for private objects fails\n\n        4622 - It's not possible to insert link to local folder using kupu\n\n        4873 - Kupu removes u-tag\n\n      * Added some table styles to the sample customisation.\n\n- 1.3.2\n\n  - Zope 2\n  \n    * Updated Zope 2 distribution, it was broken in several ways.\n\n  - Silva\n    \n    * Fixed problem with ExternalSources, which made that sources could not be\n      added to a page (clicking 'add' would not do anything).\n\n- 1.3.1\n\n  - Silva:\n    \n    * Fixed problem with IE that turned all src attributes (images) and hrefs\n      (links) into absolute URLs, failing miserably on Zope/Silva setups.\n\n    * Fixed bug with IE that made that all possible attributes were stored\n      on external source elements.\n\n  - Plone\n\n    * Fix error opening drawers when there is non-AT content around.\n\n    * Fix for content type not being set on AT content with only one allowed type.\n\n    * Fix for error when converting content from another format such as reST.\n\n  - Fix for style whitelist not working on Mozilla/Firefox (N.B. xml config schema has been changed)\n\n- 1.3\n\n  - Disabled entity escaping since it causes problems with Plone indexing.\n    (this should be fixed properly in Plone's PortalTransform code).\n\n  - Plone:\n\n    * removed the hardwired styles Heading, Subheading and\n      Formatted, added them by default on installation (but if you are\n      upgrading you may have to add them explicitly).\n\n    * Fixed a bug which prevented editing legacy (non-AT) content.\n\n    * Turned linkByUid off by default. Made resolveuid.py do a status 301 (moved permanently) redirection.\n\n    * Fixed linking to folder types which was broken when Plone 2.1 support was added.\n\n  - More i18n work.\n\n  - table classnames now take an optional caption.\n\n  - Style pulldown no longer goes wrong inside tables.\n\n  - Fixed font size issue. Plone documentContent class is now applied\n    to the editor body tag, so scaling and background color are picked\n    up automatically.\n\n- 1.3rc1\n\n  - Added support for i18n - the Kupu interface can now be displayed in\n    multiple languages (provided language catalogs are available).\n\n  - Lots of changes for Plone 2.1 compatability.\n\n    * Drawers use catalog lookups to avoid loading objects.\n\n    * ResourceRegistry used to load js and css.\n\n    * Sarissa upgraded, and not loaded when ResourceRegistry is\n      present.\n\n    * Drawer layouts tidied up.\n\n    * Drawers i18n enabled.\n\n- Post 1.2.1\n\n  - Tidied up zoom mode. Added kupu-fulleditor-zoomed class to body\n    when zoomed so you can use css to hide other controls on page (IE\n    ignores z-index on SELECT boxes).\n\n  - Further adjustment for issue 70 to give slightly prettier\n    formatting.\n\n- 1.2.1\n\n  - Fixed some context bugs with External Sources (Silva specific), now Kupu\n    uses the same functionality to find code sources as the rest of Silva\n    does.\n\n  The following issue has been resolved:\n\n  - 70: Content duplication (when pasting into IE from Microsoft Word or Works).\n\n- 1.2 final\n\n  - Linking to the current folder produced an empty link. Now it links to \".\"\n\n  - Changed how kupu in Plone handles non-HTML content e.g. STX. Now it won't\n    load for fields in Archetypes content if the content type isn't HTML (but \n    it does put in a link allowing you to force a conversion). See\n    http://plone.org/collector/3900\n\n  - Added support for spell checking.\n\n- Since 1.2rc1\n\n  - Creating links was broken by the fixes to #146, rewrote link\n    creation to be more robust and predictable.\n\n  - Changed 'halign' as the attribute to set the alignment of tables\n    and tablecells to 'align'.\n\n  Apache Lenya enhancements:\n  \n  * improved handling of image assets\n  * enabled roundtrip of image editing between Kupu and BXE\n    (http://issues.apache.org/bugzilla/show_bug.cgi?id=29164)\n  * fixed bug that inserted multiple meta charset entries per save.\n  * slight wording changes here and there\n  \n- Kupu 1.2rc1\n\n  The following issues have been resolved (see the `issue tracker`_\n  for details of the numbered ones):\n\n  - 153: Exit from bulleted list: next paragraph becomes a list item\n  - 152: Install.py does not work with CMF\n  - 151: This function requires better XML support in your browser\n  - 150: Javscript error in IE when viewing empty html source and style select changed\n  - 149: When using Zoom on Plone site, the right portlets are not disabled\n  - 146: kupu 1.2b tagName is null or not an object javascript error in IE\n  - 143: Invalid request error when trying to edit raw HTML using Safari\n  - 141: Inserting links in Gecko browsers sometimes replaced the selected\n    text with the link title.\n  - 94: Using kupu with Plone via SSL gives error on IE\n    (this was already marked as resolved but had recurred).\n  - Fixed 'phantom whitespace' problem. Saved format was 'text/html'\n    which non-AT content types interpret as an alias for 'stx'. Now\n    sets format to 'html' for non-AT content types.\n  - Opening a drawer gave error 404 on Plone systems when Archetypes \n    was not installed.\n\n\n.. _`issue tracker`: http://codespeak.net/issues/kupu/\n\n- Kupu 1.2 beta 1\n\n  * Added image upload.\n\n  * Added support for CSS 'float' for images.\n\n  * Fixed some documentation that said Netscape 7.0 was supported, which\n    it never was, the minimal Netscape version required to use Kupu has\n    always been 7.1\n\n  * Fixed problem where empty title tags broke rendering on IE after a save.\n\n  * Configurable filtering with whitelists and blacklists which\n    significantly speeds up save time on IE.\n\n  * Zoom mode to make Kupu fill the browser window.\n\n  * BeforeUnload handler added which controls all form fields.\n\n  * Plone enhancements:\n\n    - Drawer support now fully integrated.\n    - Customisation by control panel or Python script.\n    - Paragraph styles may be defined globally or for Archetypes\n      fields.\n    - Links to Archetypes objects done by UID.\n    - Optionally Archetypes can store references for links created by\n      Kupu.\n    - Optional output transform to hide UIDs and add captions to\n      images.\n    - Kupu and Epoz can now coexist on the same Plone site.\n\n- Kupu 1.1\n\n  * Re-added experimental dist with inspector.\n\n  * Moved drawers to the experimental dist.\n\n  * Some fixes in the Citation tool and External Source tools\n\n  * Fixed bug that made Kupu break on certain type of meta-tags in the\n    editable document.\n\n  * Moved definition list tool to the main and form dist.\n\n  * Made Damian Gajda's SourceEditTool replace the switchSourceEdit function.\n\n- Kupu 1.1 beta 2 (2004-05-27)\n\n  * Added source editing for Silva.\n\n  * Fixed the Image tool in Silva: URL's are now editable and will be made\n    relative if at all possible.\n\n  * Fixed some small bugs for Silva.\n\n  * Assured proper hiding of RemoveElementButtons in IE.\n\n  * Updated unit tests to reflect new ECMAUnit API\n\n- Kupu 1.1 beta 1 (2004-05-21)\n\n  * Added Selection object that provides a cross-browser API for working\n    with the document's selection and cursor. This can be used to e.g. add\n    and manipulate arbitrary elements (it's used for instance in Silva's \n    definition lists code).\n\n  * Templates for different systems are now generated with an\n    XML/XSLT-based templating system.\n\n  * Added state for buttons, if one is inside a tag controlled by a button\n    the button gets a new class (this way when inside e.g. a bold tag the\n    bold button can look pressed).\n\n  * Added access key functionality.\n\n  * Implemented a new way of inserting images and linking to\n    documents, library drawers. Drawers are windows that open up\n    inside the browser without invoking a browser popup. Library\n    drawers load information about linkable/insertable objects from\n    the server via standardized XML.\n\n  * Some core functionality is now covered by unit tests, based on the\n    JavaScript testing framework ECMAUnit.\n\n  * Fixed bug in preserving selection in IE.\n\n  * Added double-click catching, now double-clicking stuff results in correct\n    behaviour.\n\n  * Added a few useful helpers, such as a strip() method to String objects.\n\n- 1.0.3 (2004-03-25)\n\n  * Renamed epoz to kupu to end the name confusion with Maik\n    Jablonski's editor once and for all. Thanks to Eric Casteleijn for\n    the name suggestion.\n\n  * Kupu is distributed under the BSD-style Kupu license. See\n    LICENSE.txt for license text.\n\n  * Kupu is an official OSCOM project now. Its new homepage is\n    available at http://kupu.oscom.org. The development home remains\n    with Codespeak.\n\n  * Improved preliminary Plone support. Thanks to Duncan G. Booth for\n    this work.\n\n  * Fixed bug that made IE throw an exception on re-selecting text in\n    a removed element.\n\n  * Removed the 'locales' directory for the time being. We will\n    support i18n in the future, but not in this Zope-specific way.\n\n- 1.0.2 (2004-03-06)\n\n  * Added POST support\n\n  * Finally added some more documentation, made some older docs less \n    Zope specific\n\n  * Added toolboxes, a plugin for tools, to seperate functionality from\n    view dependencies (this means a change in initEpoz, so custom versions\n    need to be updated!)\n\n  * Chopped epozeditor.js into several pieces (this means all existing\n    installations need to be updated!)\n\n  * Table editing in IE 5.5 is fixed, the tables don't end up\n    in the parent document anymore\n\n  * Fixed some subtle bug that caused the parent element of the\n    selection to be the selected element instead of the element\n    itself when a selection spanned a full element (thanks Igor\n    Stroh for the IE fix!)\n\n  * Cleaned up the HTML files and pagetemplates, there's now only 1 piece\n    of JavaScript for initialization.\n\n  * Added experimental context menu\n\n  * Added experimental inspector tool\n\n  * A lot of small bugfixes...\n\n- 1.0.1 (2003-12-10)\n  \n  * Fixed bug that caused saving to fail in Mozilla 1.3.1\n\n  * Fixed bug that prevented Zope from booting when Epoz and Plone were\n    installed on the same instance\n\n  * Added an example pagetemplate for Zope 2 integration\n\n- 1.0 final (2003-11-21)\n\n  * Fixed text style support for IE\n\n  * Renamed epoztoolbar macro to epoz_toolbar for consistency\n\n  * Added style sheet and headers to prevent caching in the\n    example document fulldoc.html\n\n- 1.0 beta 1 (2003-11-14)\n\n  * Some API cleanups done\n\n  * Added some code to 'disable' the editor during init and save\n    [Issue 11]\n\n  * Added Silva-specific JavaScript, also as an example for large\n    customizations\n\n  * Fixed major problem with IE that removed the selection from the\n    iframe as soon as some other element got clicked (resulting in\n    actions to be performed on the wrong location). [issue 31]\n\n  * Fixed colorchooser in IE, also fixed background color support.\n\n- 1.0 alpha 2 (2003-11-07)\n\n  * Refactored epozeditor.js to a MVC-style component architecture.\n    [Issue 26]\n\n  * Added a path tool [Issue 24]\n\n  * Added epoz logo\n\n- 1.0 alpha 1 (2003-10-24)\n\n  * Fix useCSS (generates a Midas error)\n\n  * When in a list, a style picker will appear for the shape of the\n    list symbols.\n\n  *  Dumb down the link and image toolboxes\n\n  * Let the iframe src work from Apache via a tal:attributes to\n    replace the src with nothing when served from Zope\n\n  * Added new attributes on <iframe> to configure the Epoz instance:\n\n    - dst specifices the URL to PUT to.\n  \n    - usecss is either 0 or 1, to tell Midas whether to use CSS or\n      element styles like <b>.\n\n    - reloadsrc is either 0 or 1, to tell Epoz whether the server\n      wants the editor to reload the source after saving.  This is\n      true in Silva, which transforms the XHTML after saving.\n\n  * Improved error message that appears if an async save fails.\n\n  * Added plain Zope2 integration (philikon)\n\n  * Added functionality for editing tables (adding and deleting\n    rows and columns, setting alignment etc.)\n\n  * Fixed bug in link code, the url is now added to the link \n    correctly and can also be modified\n\n  * Replaced some timeout code with a poll loop, which should work\n    better in extreme situations (slow setup, large documents etc.)\n\n  * When the cursor is in a list, a drop-down appears to set the style\n    of the list symbols (e.g. disc for ul, roman numerals for ol)", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "UNKNOWN", "keywords": "", "license": "Kupu License", "maintainer": null, "maintainer_email": null, "name": "Products.kupu", "package_url": "https://pypi.org/project/Products.kupu/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/Products.kupu/", "project_urls": {"Download": "UNKNOWN", "Homepage": "UNKNOWN"}, "release_url": "https://pypi.org/project/Products.kupu/1.5.2/", "requires_dist": null, "requires_python": null, "summary": "UNKNOWN", "version": "1.5.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <div id=\"kupu\">\n<h2>Kupu</h2>\n<div id=\"what-is-kupu\">\n<h3>What is Kupu?</h3>\n<p>Kupu is a cross-browser WYWSIWYG editor. It allows the comfortable\nediting of the body of an HTML document. It’s client-side (browser)\nrequirements are one of:</p>\n<blockquote>\n<ul>\n<li>Mozilla 1.3.1 or higher</li>\n<li>Internet Explorer 5.5 or higher</li>\n<li>Netscape Navigator 7.1 or higher</li>\n<li>Opera 9 or higher</li>\n</ul>\n</blockquote>\n<p>Server-side there are hardly any requirements, except for some way of\nprocessing data (CGI or something more fancy like PHP, ASP or Python\nscripts in Zope).</p>\n<p>Kupu is particularly suited for content migration as well as editing.\nContent copied from an existing web page is pasted with all formatting\nintact. This includes structure such as headings and lists, plus links,\nimage references, text styling, and other aspects. Copying text from a\nword processor with an HTML clipboard - such as MS Word - works exactly\nthe same.</p>\n<p>Kupu will clean up the content before it is sent to the server, and can\nsend data to the server asynchronously using PUT (which allows the data\nto be saved without reloading the page) as well as in a form.</p>\n<p>Kupu can be customized on many different levels, allowing a lot of changes\nfrom CSS, but also providing a JavaScript extension API.</p>\n</div>\n<div id=\"more-documentation\">\n<h3>More documentation…</h3>\n<p>General information</p>\n<blockquote>\n<p>o Authors: see CREDITS.txt</p>\n<p>o License: see LICENSE.txt</p>\n<p>o Frequently asked questions: see FAQ.txt</p>\n</blockquote>\n<p>Installation</p>\n<blockquote>\n<p>o general: see INSTALL.txt</p>\n<p>o Zope 2.x: see ZOPE2.txt</p>\n<p>o Plone 2.x: see PLONE2.txt</p>\n</blockquote>\n<p>Developing</p>\n<blockquote>\n<p>o Customizing kupu: see CUSTOMIZING.txt</p>\n<p>o Extending kupu: see EXTENDING.txt</p>\n<p>o Java Script API: see JSAPI.txt</p>\n<p>o Old browser support: see OLDBROWSERS.txt</p>\n<p>o Templating system: see TEMPLATE-SYSTEM.txt</p>\n<p>o Library Feature Specification: see LIBRARIES.txt</p>\n</blockquote>\n</div>\n<div id=\"homepage\">\n<h3>Homepage</h3>\n<p>Kupu has a homepage at <a href=\"http://kupu.oscom.org\" rel=\"nofollow\">http://kupu.oscom.org</a></p>\n</div>\n<div id=\"reporting-bugs\">\n<h3>Reporting bugs</h3>\n<p>Please report bugs to the issue tracker available at:\n<a href=\"http://codespeak.net/issues/kupu/\" rel=\"nofollow\">http://codespeak.net/issues/kupu/</a> (mind the trailing slash).</p>\n</div>\n<div id=\"mailing-list\">\n<h3>Mailing list</h3>\n<p>There is a mailing lists for Kupu development: <a href=\"mailto:kupu-dev%40codespeak.net\">kupu-dev<span>@</span>codespeak<span>.</span>net</a></p>\n</div>\n<div id=\"license\">\n<h3>License</h3>\n<p>Unless otherwise stated, kupu is released under the Kupu License. See\nLICENSE.txt for the license text.</p>\n<p>The Sarissa ECMAScript library shipped in this distribution\n(common/sarissa.js) is the work of Manos Batsis and distributed under\nthe Kupu License with his kind permission. See the Sarissa homepage at\n<a href=\"http://sarissa.sourceforge.net\" rel=\"nofollow\">http://sarissa.sourceforge.net</a> for more information.</p>\n</div>\n</div>\n<div id=\"kupu-changes\">\n<h2>Kupu changes</h2>\n<ul>\n<li><p>1.5.2 (2013-08-14)</p>\n<ul>\n<li>Make getWysiwygmacros unpublishable.\n[davisagli]</li>\n</ul>\n</li>\n<li><p>1.5.1 (2012-12-09)</p>\n<ul>\n<li><p>Avoid possible DoS of spellchecker by prefixing each line with ^.\nThis fixes <a href=\"https://plone.org/products/plone/security/advisories/20121106/12\" rel=\"nofollow\">https://plone.org/products/plone/security/advisories/20121106/12</a>\n[davisagli]</p>\n</li>\n<li><p>Compatibility fixes for IE9+.</p>\n<p>This fixes <a href=\"http://dev.plone.org/ticket/11824\" rel=\"nofollow\">http://dev.plone.org/ticket/11824</a>.\n[malthe]</p>\n</li>\n<li><p>Convert GenericSetup profile registration to ZCML, to add compatibility\nwith GenericSetup version after 1.6.2 and also move an interface to the\ncorrect place.\n[hannosch]</p>\n</li>\n<li><p>Copy in minimalpath from CMFCore as it has been removed from CMFCore 2.3.\n[elro]</p>\n</li>\n</ul>\n</li>\n<li><p>1.5.0</p>\n<ul>\n<li>Fix warnings due to missing i18n domain in configure.zcml.\n[davisagli]</li>\n</ul>\n</li>\n<li><p>1.5.0b1 (2011-01-04)</p>\n<ul>\n<li>Set Site Administrator role as default permission for Plone 4.1.\n[elro]</li>\n<li>Depend on <tt>Products.CMFPlone</tt> instead of <tt>Plone</tt>.\n[elro]</li>\n<li>Use of the resolveuid Python script to resolve URLs in the form\nresolveuid/&lt;UID&gt; has been removed. These are now resolved by a browser view\nin plone.outputfilters.\n[davisagli]</li>\n<li>Use of the kupu_captioned_image template to customize the caption added to\nimages is deprecated. Use the similar template in plone.outputfilters\ninstead.\n[davisagli]</li>\n<li>Use plone.uuid to look up content UUIDs, if available.\n[davisagli]</li>\n<li>Use the resolveuid and captioning transform from plone.outputfilters\ninstead of implementing our own.\n[davisagli]</li>\n<li>Remove use of tabindex iterator, which is no longer available in Plone 4.\nThis fixes <a href=\"http://dev.plone.org/plone/ticket/11138\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/11138</a>.\n[encolpe, davisagli]</li>\n<li>Add definitions to zmi_links template to fix it in Plone 4. This fixes\n<a href=\"http://dev.plone.org/plone/ticket/11182\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/11182</a>.\n[ctxlken, davisagli]</li>\n<li>Releases are now being made from the Plone collective svn.</li>\n</ul>\n</li>\n<li><p>1.4.16</p>\n<ul>\n<li>Kupu didn’t not transform resolveuid to friendly url in area tags\n(Plone ticket 9402).</li>\n<li>Updated getWysiwygmacros to respect Plone 4’s default_editor property.</li>\n<li>Remove Kupu from the available editors list on uninstall.</li>\n<li>Add Kupu to the available editors list when installed via the\nGenericSetup profile.</li>\n<li>Converted GenericSetup import and export step registrations to ZCML.</li>\n<li>Added icon_expr to the Plone configlet action registration, for\nforward-compatibility with Plone 4.</li>\n</ul>\n</li>\n<li><p>1.4.15</p>\n<ul>\n<li>Don’t assume there is only one kupu widget on the page. Made each config node unique. (DannyB)</li>\n</ul>\n</li>\n<li><p>1.4.14</p>\n<ul>\n<li>Fix kupu_xmlconfig to not assume all needed variables are already\nin scope. This fixes\n<a href=\"http://dev.plone.org/old/plone/attachment/ticket/9266\" rel=\"nofollow\">http://dev.plone.org/old/plone/attachment/ticket/9266</a></li>\n<li>Do not assume that kupu is always used in Plone. This fixes\n<a href=\"http://dev.plone.org/plone/ticket/9053\" rel=\"nofollow\">http://dev.plone.org/plone/ticket/9053</a></li>\n<li>Removed bogus <cite>global_defines</cite> call from kupu_xmlconfig.pt, which was\nboth expensive and failed for certain kind of non-content contexts.</li>\n<li>Fixed kupuconfig quoting to work with kss (Plone ticket 9240).</li>\n</ul>\n</li>\n<li><p>1.4.13</p>\n<ul>\n<li>Patch from Andy Altepeter: kupu updatestate patch</li>\n<li>Patch from Gerhard Weis: small js-bugfix in kupudrawers.js</li>\n<li>Wrap the inline xml configuration with javascript document.write\nin the plone integration, so edit pages are valid (x)html.</li>\n<li>Changed undefined variable ${portal_url} to ${context/portal_url} in\npage templates.</li>\n<li>Declare package dependencies and fixed deprecation warnings for use of\nGlobals.</li>\n<li>Remove conditional comments when editing in IE (otherwise IE converts\nthem to visible text)</li>\n<li>Added a <cite>kupu_enabled</cite> browser view, which can be used instead of the\nisKupuEnabled method of the plonelibrarytool.\n[hannosch]</li>\n<li>Changed the default titlelength for cropping titles in the link drawer to\n255 instead of 60.</li>\n<li>Correct dependency for the Plone egg.</li>\n<li>Plone tickets<ul>\n<li>8612 strangely numbered column headings (Col 01 | Col 11 | Col 21 | Col 31 etc.)</li>\n<li>9190 Please make new release for Kupu to apply updated translation</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4.12</p>\n<ul>\n<li>Plone tickets<ul>\n<li>8280 HTML source preview bug with Kupu 1.4.10 and Firefox 3</li>\n<li>8287 html2caption is vulnerable to being fooled by acquisitions</li>\n<li>8546 kupu AttributeError captioning</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4.11</p>\n<ul>\n<li>French translations broke drawers</li>\n<li>Added full undo/redo support using ‘diff_match_patch.js’.</li>\n<li>Plone tickets<ul>\n<li>8327 Kupu CSS inserted below ploneCustom.css in the CSS registry</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4.10</p>\n<ul>\n<li>Update emptypage.pt to include a hint for deliverance that edited\npages should not be themed. [wiggy]</li>\n<li>Purged old Zope2 Interface interfaces for compatibility with Zope 2.12 and Plone 4, while maintaining compatibility\nwith pre Plone 4 versions of Products.PortalTransforms.\n[elro]</li>\n<li>Plone tickets<ul>\n<li>7779 imageuploader doesn t show the input for file if not in english</li>\n<li>7958 Kupu: Insert image: KeyError: ‘info’ (Error 503 loading kupucollection.xml?resource_type=mediaobject)</li>\n<li>7990 Internal link drawer broken for editors</li>\n<li>8003 Fixed Kupu translation msgids containing html.</li>\n<li>8009 Pasting from OpenOffice broken / mishandled comments</li>\n<li>8014 kupu zmi_docs#images link broken</li>\n<li>8039 Kupu locks up on adding images when user does not have manager privileges</li>\n<li>8080 After uploading image, the “Insert Image” dialog remains open</li>\n<li>8129 “TypeError: string indices must be integers” error on plonedrawers.py when installing</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4.9</p>\n<ul>\n<li>Manage anchors didn’t add an anchor correctly if there was an\nanchor used for a link inside the element.</li>\n<li>timte fixed a possible unicode decode error</li>\n<li>Image upload now has same style options as image insertion.</li>\n<li>Plone tickets<ul>\n<li>6915 Kupu can’t find anchors inside table cells</li>\n<li>7409 “edit without kupu” does not appear on edit form (the fix for this make the link appear but only in source mode).</li>\n<li>7804 KupuLibraryTool spellcheck method is missing a docstring</li>\n<li>7893 Workaround for bad KSS form submissions</li>\n<li>7916 Kupu breaks strong/em tags with class names, on firefox</li>\n<li>7939 Kupu breaks on Firefox 3.0b4 in OSX</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4.8</p>\n<ul>\n<li>Tabbing key now takes you to next/previous field. However, plone\nticket #7727 might result in tab behaviour changing again.</li>\n<li>Plone tickets<ul>\n<li>7473 Kupu full screen mode looks broken</li>\n<li>7494 Insert internal link using IE links in the wrong place</li>\n<li>7680 Kupu stripping out anchor to top of current page</li>\n<li>7713 Kupu browser “Home” link goes to Plone root and not content\nroot.</li>\n<li>7728 turning on “Link using UIDs” breaks indexing of rich text\nfields that contain unicode characters out of the 128 range</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4.7</p>\n<ul>\n<li>Added metadata.xml file to the Plone GenericSetup profile.</li>\n<li>Style whitelist and class blacklist now work when there is only\none entry in the list.</li>\n<li>Span tags with no attributes after filtering are removed.</li>\n</ul>\n</li>\n<li><p>1.4.6</p>\n<ul>\n<li>Fixed ReftextField error introduced in 1.4.5</li>\n</ul>\n</li>\n<li><p>1.4.5</p>\n<ul>\n<li>Fixed unit tests for the transform (they now use a real image instead of a mockup)</li>\n<li>Fixed the transform to preserve links around images.</li>\n<li>Images may only be resized if ‘height’ and ‘width’ are permitted\nimage attributes. Resizing images in Firefox sets those\nattributes rather than the style attribute.</li>\n<li>Plone tickets<ul>\n<li>5765 Kupu in IE unable to make a link from selected image</li>\n<li>6430 Kupu: changes to images resized by handle-dragging are\nlost (not saved)</li>\n<li>6835 Drag image breaks in Kupu</li>\n<li>7293 kupu import step has the wrong dependencies in a portal\nsetup export</li>\n<li>7377 Making an Image a Link within Kupu renders the link tag at\nthe top of the content page</li>\n<li>7387 Kupu-Commit Selected Changes button missing when\nconverting UID=&gt;Relative Link</li>\n<li>7426 Kupu 1.4.4 installed with Plone 3.0.3 for PowerPC presents\nitself in Safari 3.0.4, but content in Kupu window can’t be edited</li>\n<li>7428 Searching for non-ascii character in kupu Insert Link\ndialog causes Error 500</li>\n<li>7419 Plone and/or Kupu should at least WARN an editor of an\nimage that changes may be lost at Save time</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4.4</p>\n<ul>\n<li>Enabled Safari support (needs webkit nightly build and Safari 3)</li>\n<li>Plone tickets<ul>\n<li>7099 Kupu error on multi-schemata archetypes content</li>\n<li>7258 Missing translation msgids for kupu</li>\n<li>7224 Kupu: error in iframe tabindex attribute</li>\n<li>7229 kupu 1.4.3 css correction to display redo button icon in editing interface</li>\n<li>7285 Kupu Accesskey for Save conflict with Firefox History Menu</li>\n<li>7305 Page creation and kupu upload image returns an error if Kupu link uid’s is turned on.</li>\n<li>7315 Kupu table of contents generator doesn’t allow multiple paragraph styles to be selected in IE7</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4.3</p>\n<ul>\n<li>Kupu now uses sarissa 0.9.8.1 (still a differences in\nsarissa_ieemu_xpath.js, but these are purely cosmetic so that jslint\nruns cleanly).</li>\n<li>Plone tickets<ul>\n<li>6970: can’t upgrade to Kupu 1.4.1</li>\n<li>6975: Cannot save HTML field as NULL</li>\n<li>7119: ‘Edit without visual editor’ link doesn’t show up in Plone 2.5.3</li>\n<li>7139: Kupu Manage Anchors not working in inline edit</li>\n<li>7140: kupu fails with danish letters in title.</li>\n<li>7143: UnicodeError inserting image</li>\n<li>7158: Kupu Edit already inserted image: Preview and sizes get wrong urls</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4.2</p>\n<ul>\n<li>Florian fixed some encoding errors</li>\n<li>Plone tickets<ul>\n<li>7074: Search for image errors in Kupu</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4.1</p>\n<p>Limi asked for some last minute changes for Plone 3:</p>\n<ul>\n<li>Embed doesn’t work out of the box in Plone 3, so shouldn’t be shown\nby default (it will only lead to a lot of user frustration).</li>\n<li>The anchor/table of contents generation is done differently in Plone\n3, so should be off by default (turning on buttons is easy in Kupu\nnow).</li>\n<li>Insert image/link should default to current folder instead of\nRecent, since the Upload button isn’t visible if not (which is the\nmost common use case)</li>\n<li>Place the delete link/image button after the pulldown (so it doesn’t\npush around the toolbar elements)</li>\n<li>Default table styles now include “grid listing” and “invisible”.</li>\n<li>Paragraph styles now labelled just styles and include: highlight, page break, clear floats</li>\n<li>Create headings now on by default.</li>\n</ul>\n</li>\n<li><p>1.4</p>\n<ul>\n<li>The icons in the toolbar for Plone now use CSS sprites. This means that\ninstead of having 30 files each being 16x16, we put all the icons\nin one file, and reference the file once. Then we use CSS positioning to\npull out the right icon.This has a major impact on how quickly Kupu\nperforms its initial load ??? as HTTP roundtripping is very time-consuming.\nBefore, Kupu did 17 HTTP requests for its initial image loading, now it\nonly does one.</li>\n<li>Fixed a KeyError exception when importing a GenericSetup profile.</li>\n<li>Minor styling changes to the image upload form.</li>\n<li>Plone tickets<ul>\n<li>6486: formUnload protection invoked for inline kupu editor even after Save</li>\n<li>6833: Error 500 loading kupu_migration.xml</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4rc2</p>\n<ul>\n<li>Fixed broken code for determining the width of captioned images.\nAlso removed the hardwired html for the transform and use a\ntemplate instead (so it can be customised).</li>\n<li>Default image size is now configurable</li>\n<li>Plone tickets<ul>\n<li>6756: Kupu Pull-quote style not working in IE</li>\n<li>6739 Hide the “edit without visual editor” link when there is only one format available</li>\n<li>6535: Can’t upload image via visual editor in inline edit</li>\n<li>6801 ‘contentUsesKupu’ shouldn’t expect string type</li>\n<li>6759: Kupu caption CSS needs some love.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4rc1</p>\n<ul>\n<li>Added a ‘manage anchors’ tab to the anchor drawer</li>\n<li>Big cleanup of i18n attributes</li>\n<li>Updated the Japanese translation files, thx to Tyam.</li>\n<li>Added in some support for inserting Flash content.</li>\n<li>Media objects may now have a list of classes (specific to the portal type).</li>\n<li>Image drawer layout has been tidied up.</li>\n<li>Anchors in the link drawer now have a slightly cleaner ui.</li>\n<li>Drawer actions which do server requests now display a wait cursor.</li>\n<li>Removed the tabindex from all the toolbar buttons and added it to\nthe iframe: this means you can tab into kupu from above without\ndying of old age as you try to get past the toolbar. Added a\nhandler for the tab key so that pressing tab will take you to the\nnext tabstop in the form.</li>\n<li>Only single trailing &lt;br&gt; tags are stripped from p and div tags: multiple\n&lt;br&gt; tags are left unchanged (so those people who insist on using\nthe to generate whitespace still can).</li>\n<li>Plone tickets:<ul>\n<li>5622 Add a class (even if empty) to internal LinkDrawer</li>\n<li>6283 Do not allow bigger images than Preview by default from Kupu</li>\n<li>6440 Browser error: exception element has no properties while\nregistering an event handler for element null, event click, method\nfunction ()</li>\n<li>6720 i18n error in kupu collection</li>\n<li>5985 Kupu should not strip the dir attribute by default.</li>\n<li>5985 Range.intersectsNode declared obsolete</li>\n<li>5189 patch to support embed tag</li>\n<li>5420 “Edit with kupu” broken for fields on custom fieldset</li>\n<li>6056 Extra line breaks added in pre tags</li>\n<li>6103 resolveuid does not check input values and throws deep\n“list index out of bound” error in ZopeGuards.py</li>\n<li>6536 Formatting of captioned images is messed up</li>\n<li>6548 Links tab on kupu control panel gives traceback, cannot\nfind kupu_references</li>\n<li>6598 Default linkables in Kupu: folder is not, plone site is not, ATRelativePathCriterion is</li>\n<li>4887 Fix for “editing defaults to kupu, even when javascript turned off” reverted as it breaks inline editing.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.4 Beta 6</p>\n<ul>\n<li>Removed the getToolByName deprecation workround since\ngetToolByName is now officially undeprecated again.</li>\n<li>Removed most of the illegally nested forms produced by the xsl.\nI hope this will stop IE6 crashing. The image upload form is still\nthere as it is going to take more major surgery to get rid of that\none.</li>\n</ul>\n</li>\n<li><p>1.4 Beta 5</p>\n<ul>\n<li>Adjusted some more Plone tests to work on Plone 3.0.</li>\n<li>Kupu is automatically suppressed when the content being edited\nstarts with an html comment (&lt;!–).</li>\n<li>getToolByName directed through a local kupu implementation in an\nattempt to suppress CMFCore deprecation warning. (This is the wrong\nway round, we should really call queryUtility everywhere in kupu and\nhave the mapping fallback to getToolByName, but it should do for now)</li>\n<li>Table of contents numbering is now optional.</li>\n<li>Disabled undo/redo, sub/superscript and unordered list buttons</li>\n<li>Link checker now recognises attributes with whitespace round ‘=’.</li>\n</ul>\n</li>\n<li><p>1.4 Beta 4</p>\n<ul>\n<li><p>Adjusted some Plone tests to work on Plone 3.0.</p>\n</li>\n<li><p>Added ‘remove table’ button to table drawer and tool box.</p>\n</li>\n<li><p>the uid/captioning transform now has a hook which gets called if\nkupu fails to resolve the uid.  Use this for any fallback processing\n(e.g. lookup the uid catalog in a different plone site, or just return\na default error page.</p>\n</li>\n<li><p>Fixed NonXHTMLTagFilter default filterdata: ‘big’, ‘small’ and ‘tt’ are\nvalid XHTML tags, ‘h7’ not.</p>\n</li>\n<li><p>Fixed some small issues in XhtmlValidation elements.</p>\n</li>\n<li><p>Improved KSS integration:</p>\n<blockquote>\n<ul>\n<li>Added an invisible save button to Plone toolbar: KSS will link up\nevents and make it visible when editing inline.</li>\n<li>Fixed site error on empty page (Plone 3 compatibility)</li>\n</ul>\n</blockquote>\n</li>\n<li><p>HTML cleanup improved: spurious &lt;br/&gt; tags removed.</p>\n</li>\n</ul>\n</li>\n<li><p>1.4 Beta 3</p>\n<ul>\n<li>Fixed a bug where createLink deleted the selected text.</li>\n<li>Paragraph styles may now be replaced as well as added to in a\nwidget definition.</li>\n<li>Toolbar buttons may be hidden globally, according to an\nexpression, or from a widget definition.</li>\n<li>Support for generic setup added (when present, older systems may\ncontinue to use the quickinstaller)</li>\n<li>Resource definitions can now optionally add any new Plone types to\nthe resource. This means that all custom types will be ‘linkable’\nunless otherwise configured.</li>\n<li>A modified version of jslint is included in the kupu\nsources (with the ability to suppress a lot of the warnings).</li>\n<li>The javascript files used by Plone (and some of the other ones)\nnow run through jslint without warnings. This means they can be\ncompressed by programs which remove line endings in an unsafe\nmanner.</li>\n</ul>\n</li>\n<li><p>1.4 Beta 2</p>\n<ul>\n<li>Paragraph styling now permitted inside a table again (contributed\nby George Lee).</li>\n<li>Fixed a bug where changing a TR style while the selection covered\nmore than one row corrupted the DOM.</li>\n<li>New style option ‘(remove style)’ always present and removes the\nclosest style round the selection (i.e. a span or block tag, or\nremoves the className if it hits a table tag with a class).</li>\n<li>Added a link maintenance page. Checks for bad links (i.e. those\nkupu doesn’t understand), also converts links from relative paths\nto resolveuid and back again.</li>\n</ul>\n</li>\n<li><p>1.4 Beta 1</p>\n<ul>\n<li>Fixed some problems with handling of multi-valued form fields in the\nExternalSource tool code for Silva.</li>\n<li>Merged Plone style code back into common code.</li>\n<li>Redid the table style code to work better. The style pulldown now\ndisplays either paragraph styles or table styles, not both\ntogether.</li>\n<li>Added code to manipulate anchors. New drawer to insert anchor\nlinks either singly or as a table. (Plone and HMTL forms).</li>\n<li>Changes to drawer layout to look prettier and to allow direct\nlinking to folders.</li>\n<li>Support for AT reference browsing using the Kupu UI. This means\nthat Kupu on Plone now requires Archetypes 1.3+</li>\n<li>Plone sample customisation now gets run on installation if there\nisn’t a customised version. This means that the defaults for the\ntool don’t all need to be hardwired.</li>\n<li>Plone configlet now makes it easier to enable linkbyuid and\ncaptioning options.</li>\n<li>HTML view now does filtering by default in Plone (can be turned\noff in the configlet). This also means that after pasting from e.g.\nWord the HTML can be cleaned up simply by toggling source view\non/off.</li>\n</ul>\n</li>\n<li><p>1.3.8</p>\n<ul>\n<li>HTML view now does filtering by default in Plone (can be turned\noff in the configlet). This also means that after pasting from e.g.\nWord the HTML can be cleaned up simply by toggling source view\non/off.</li>\n</ul>\n</li>\n<li><p>1.3.6</p>\n<ul>\n<li><p>Plone</p>\n<blockquote>\n<ul>\n<li>Enabled selection of image sizes in standard libraries.</li>\n</ul>\n</blockquote>\n</li>\n<li><p>Silva</p>\n<ul>\n<li>Fixed multi-value form element support in ExternalSource tool.</li>\n</ul>\n</li>\n<li><p>General</p>\n<blockquote>\n<ul>\n<li>Added optional list of server provided image sizes.</li>\n</ul>\n</blockquote>\n</li>\n</ul>\n</li>\n<li><p>1.3.5</p>\n<ul>\n<li>Silva<ul>\n<li>Some minor glitches, button names changed, some names converted from\nupper- to lowercase, etc.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.3.4</p>\n<ul>\n<li><p>Silva</p>\n<blockquote>\n<ul>\n<li>Fixed some small issues in external sources support.</li>\n<li>Fixed some problems with tables, table column alignment and relative\nwidth settings should not clash anymore.</li>\n</ul>\n</blockquote>\n</li>\n<li><p>General</p>\n<blockquote>\n<ul>\n<li>Zope related: changed imports so they try to import Zope2 rather than\nZope (with Zope as a fallback) to not have Zope 2.8.x issue warnings.</li>\n</ul>\n</blockquote>\n</li>\n</ul>\n</li>\n<li><p>1.3.3</p>\n<ul>\n<li><p>Plone</p>\n<blockquote>\n<ul>\n<li><p>Text is no longer automatically forced into a paragraph as\nthis caused problems on Mozilla when editing at the end of the\nfile. The style pulldown now distinguishes text with ‘no\nstyle’ from ‘Normal’.</p>\n</li>\n<li><p>Fixes to Plone issues:</p>\n<p>4434 - ‘int’ object is not callable on editing</p>\n<p>4896 - Kupu interface invisible if color changed</p>\n<p>4911 - Kupu creates incorrect relative link in new page</p>\n<p>4801 - Kupu Links: search for private objects fails</p>\n<p>4622 - It’s not possible to insert link to local folder using kupu</p>\n<p>4873 - Kupu removes u-tag</p>\n</li>\n<li><p>Added some table styles to the sample customisation.</p>\n</li>\n</ul>\n</blockquote>\n</li>\n</ul>\n</li>\n<li><p>1.3.2</p>\n<ul>\n<li>Zope 2<ul>\n<li>Updated Zope 2 distribution, it was broken in several ways.</li>\n</ul>\n</li>\n<li>Silva<ul>\n<li>Fixed problem with ExternalSources, which made that sources could not be\nadded to a page (clicking ‘add’ would not do anything).</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>1.3.1</p>\n<ul>\n<li>Silva:<ul>\n<li>Fixed problem with IE that turned all src attributes (images) and hrefs\n(links) into absolute URLs, failing miserably on Zope/Silva setups.</li>\n<li>Fixed bug with IE that made that all possible attributes were stored\non external source elements.</li>\n</ul>\n</li>\n<li>Plone<ul>\n<li>Fix error opening drawers when there is non-AT content around.</li>\n<li>Fix for content type not being set on AT content with only one allowed type.</li>\n<li>Fix for error when converting content from another format such as reST.</li>\n</ul>\n</li>\n<li>Fix for style whitelist not working on Mozilla/Firefox (N.B. xml config schema has been changed)</li>\n</ul>\n</li>\n<li><p>1.3</p>\n<ul>\n<li>Disabled entity escaping since it causes problems with Plone indexing.\n(this should be fixed properly in Plone’s PortalTransform code).</li>\n<li>Plone:<ul>\n<li>removed the hardwired styles Heading, Subheading and\nFormatted, added them by default on installation (but if you are\nupgrading you may have to add them explicitly).</li>\n<li>Fixed a bug which prevented editing legacy (non-AT) content.</li>\n<li>Turned linkByUid off by default. Made resolveuid.py do a status 301 (moved permanently) redirection.</li>\n<li>Fixed linking to folder types which was broken when Plone 2.1 support was added.</li>\n</ul>\n</li>\n<li>More i18n work.</li>\n<li>table classnames now take an optional caption.</li>\n<li>Style pulldown no longer goes wrong inside tables.</li>\n<li>Fixed font size issue. Plone documentContent class is now applied\nto the editor body tag, so scaling and background color are picked\nup automatically.</li>\n</ul>\n</li>\n<li><p>1.3rc1</p>\n<ul>\n<li>Added support for i18n - the Kupu interface can now be displayed in\nmultiple languages (provided language catalogs are available).</li>\n<li>Lots of changes for Plone 2.1 compatability.<ul>\n<li>Drawers use catalog lookups to avoid loading objects.</li>\n<li>ResourceRegistry used to load js and css.</li>\n<li>Sarissa upgraded, and not loaded when ResourceRegistry is\npresent.</li>\n<li>Drawer layouts tidied up.</li>\n<li>Drawers i18n enabled.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li><p>Post 1.2.1</p>\n<ul>\n<li>Tidied up zoom mode. Added kupu-fulleditor-zoomed class to body\nwhen zoomed so you can use css to hide other controls on page (IE\nignores z-index on SELECT boxes).</li>\n<li>Further adjustment for issue 70 to give slightly prettier\nformatting.</li>\n</ul>\n</li>\n<li><p>1.2.1</p>\n<ul>\n<li>Fixed some context bugs with External Sources (Silva specific), now Kupu\nuses the same functionality to find code sources as the rest of Silva\ndoes.</li>\n</ul>\n<p>The following issue has been resolved:</p>\n<ul>\n<li>70: Content duplication (when pasting into IE from Microsoft Word or Works).</li>\n</ul>\n</li>\n<li><p>1.2 final</p>\n<ul>\n<li>Linking to the current folder produced an empty link. Now it links to “.”</li>\n<li>Changed how kupu in Plone handles non-HTML content e.g. STX. Now it won’t\nload for fields in Archetypes content if the content type isn’t HTML (but\nit does put in a link allowing you to force a conversion). See\n<a href=\"http://plone.org/collector/3900\" rel=\"nofollow\">http://plone.org/collector/3900</a></li>\n<li>Added support for spell checking.</li>\n</ul>\n</li>\n<li><p>Since 1.2rc1</p>\n<ul>\n<li>Creating links was broken by the fixes to #146, rewrote link\ncreation to be more robust and predictable.</li>\n<li>Changed ‘halign’ as the attribute to set the alignment of tables\nand tablecells to ‘align’.</li>\n</ul>\n<p>Apache Lenya enhancements:</p>\n<ul>\n<li>improved handling of image assets</li>\n<li>enabled roundtrip of image editing between Kupu and BXE\n(<a href=\"http://issues.apache.org/bugzilla/show_bug.cgi?id=29164\" rel=\"nofollow\">http://issues.apache.org/bugzilla/show_bug.cgi?id=29164</a>)</li>\n<li>fixed bug that inserted multiple meta charset entries per save.</li>\n<li>slight wording changes here and there</li>\n</ul>\n</li>\n<li><p>Kupu 1.2rc1</p>\n<p>The following issues have been resolved (see the <a href=\"http://codespeak.net/issues/kupu/\" rel=\"nofollow\">issue tracker</a>\nfor details of the numbered ones):</p>\n<ul>\n<li>153: Exit from bulleted list: next paragraph becomes a list item</li>\n<li>152: Install.py does not work with CMF</li>\n<li>151: This function requires better XML support in your browser</li>\n<li>150: Javscript error in IE when viewing empty html source and style select changed</li>\n<li>149: When using Zoom on Plone site, the right portlets are not disabled</li>\n<li>146: kupu 1.2b tagName is null or not an object javascript error in IE</li>\n<li>143: Invalid request error when trying to edit raw HTML using Safari</li>\n<li>141: Inserting links in Gecko browsers sometimes replaced the selected\ntext with the link title.</li>\n<li>94: Using kupu with Plone via SSL gives error on IE\n(this was already marked as resolved but had recurred).</li>\n<li>Fixed ‘phantom whitespace’ problem. Saved format was ‘text/html’\nwhich non-AT content types interpret as an alias for ‘stx’. Now\nsets format to ‘html’ for non-AT content types.</li>\n<li>Opening a drawer gave error 404 on Plone systems when Archetypes\nwas not installed.</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>Kupu 1.2 beta 1<ul>\n<li>Added image upload.</li>\n<li>Added support for CSS ‘float’ for images.</li>\n<li>Fixed some documentation that said Netscape 7.0 was supported, which\nit never was, the minimal Netscape version required to use Kupu has\nalways been 7.1</li>\n<li>Fixed problem where empty title tags broke rendering on IE after a save.</li>\n<li>Configurable filtering with whitelists and blacklists which\nsignificantly speeds up save time on IE.</li>\n<li>Zoom mode to make Kupu fill the browser window.</li>\n<li>BeforeUnload handler added which controls all form fields.</li>\n<li>Plone enhancements:<ul>\n<li>Drawer support now fully integrated.</li>\n<li>Customisation by control panel or Python script.</li>\n<li>Paragraph styles may be defined globally or for Archetypes\nfields.</li>\n<li>Links to Archetypes objects done by UID.</li>\n<li>Optionally Archetypes can store references for links created by\nKupu.</li>\n<li>Optional output transform to hide UIDs and add captions to\nimages.</li>\n<li>Kupu and Epoz can now coexist on the same Plone site.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Kupu 1.1<ul>\n<li>Re-added experimental dist with inspector.</li>\n<li>Moved drawers to the experimental dist.</li>\n<li>Some fixes in the Citation tool and External Source tools</li>\n<li>Fixed bug that made Kupu break on certain type of meta-tags in the\neditable document.</li>\n<li>Moved definition list tool to the main and form dist.</li>\n<li>Made Damian Gajda’s SourceEditTool replace the switchSourceEdit function.</li>\n</ul>\n</li>\n<li>Kupu 1.1 beta 2 (2004-05-27)<ul>\n<li>Added source editing for Silva.</li>\n<li>Fixed the Image tool in Silva: URL’s are now editable and will be made\nrelative if at all possible.</li>\n<li>Fixed some small bugs for Silva.</li>\n<li>Assured proper hiding of RemoveElementButtons in IE.</li>\n<li>Updated unit tests to reflect new ECMAUnit API</li>\n</ul>\n</li>\n<li>Kupu 1.1 beta 1 (2004-05-21)<ul>\n<li>Added Selection object that provides a cross-browser API for working\nwith the document’s selection and cursor. This can be used to e.g. add\nand manipulate arbitrary elements (it’s used for instance in Silva’s\ndefinition lists code).</li>\n<li>Templates for different systems are now generated with an\nXML/XSLT-based templating system.</li>\n<li>Added state for buttons, if one is inside a tag controlled by a button\nthe button gets a new class (this way when inside e.g. a bold tag the\nbold button can look pressed).</li>\n<li>Added access key functionality.</li>\n<li>Implemented a new way of inserting images and linking to\ndocuments, library drawers. Drawers are windows that open up\ninside the browser without invoking a browser popup. Library\ndrawers load information about linkable/insertable objects from\nthe server via standardized XML.</li>\n<li>Some core functionality is now covered by unit tests, based on the\nJavaScript testing framework ECMAUnit.</li>\n<li>Fixed bug in preserving selection in IE.</li>\n<li>Added double-click catching, now double-clicking stuff results in correct\nbehaviour.</li>\n<li>Added a few useful helpers, such as a strip() method to String objects.</li>\n</ul>\n</li>\n<li>1.0.3 (2004-03-25)<ul>\n<li>Renamed epoz to kupu to end the name confusion with Maik\nJablonski’s editor once and for all. Thanks to Eric Casteleijn for\nthe name suggestion.</li>\n<li>Kupu is distributed under the BSD-style Kupu license. See\nLICENSE.txt for license text.</li>\n<li>Kupu is an official OSCOM project now. Its new homepage is\navailable at <a href=\"http://kupu.oscom.org\" rel=\"nofollow\">http://kupu.oscom.org</a>. The development home remains\nwith Codespeak.</li>\n<li>Improved preliminary Plone support. Thanks to Duncan G. Booth for\nthis work.</li>\n<li>Fixed bug that made IE throw an exception on re-selecting text in\na removed element.</li>\n<li>Removed the ‘locales’ directory for the time being. We will\nsupport i18n in the future, but not in this Zope-specific way.</li>\n</ul>\n</li>\n<li>1.0.2 (2004-03-06)<ul>\n<li>Added POST support</li>\n<li>Finally added some more documentation, made some older docs less\nZope specific</li>\n<li>Added toolboxes, a plugin for tools, to seperate functionality from\nview dependencies (this means a change in initEpoz, so custom versions\nneed to be updated!)</li>\n<li>Chopped epozeditor.js into several pieces (this means all existing\ninstallations need to be updated!)</li>\n<li>Table editing in IE 5.5 is fixed, the tables don’t end up\nin the parent document anymore</li>\n<li>Fixed some subtle bug that caused the parent element of the\nselection to be the selected element instead of the element\nitself when a selection spanned a full element (thanks Igor\nStroh for the IE fix!)</li>\n<li>Cleaned up the HTML files and pagetemplates, there’s now only 1 piece\nof JavaScript for initialization.</li>\n<li>Added experimental context menu</li>\n<li>Added experimental inspector tool</li>\n<li>A lot of small bugfixes…</li>\n</ul>\n</li>\n<li>1.0.1 (2003-12-10)<ul>\n<li>Fixed bug that caused saving to fail in Mozilla 1.3.1</li>\n<li>Fixed bug that prevented Zope from booting when Epoz and Plone were\ninstalled on the same instance</li>\n<li>Added an example pagetemplate for Zope 2 integration</li>\n</ul>\n</li>\n<li>1.0 final (2003-11-21)<ul>\n<li>Fixed text style support for IE</li>\n<li>Renamed epoztoolbar macro to epoz_toolbar for consistency</li>\n<li>Added style sheet and headers to prevent caching in the\nexample document fulldoc.html</li>\n</ul>\n</li>\n<li>1.0 beta 1 (2003-11-14)<ul>\n<li>Some API cleanups done</li>\n<li>Added some code to ‘disable’ the editor during init and save\n[Issue 11]</li>\n<li>Added Silva-specific JavaScript, also as an example for large\ncustomizations</li>\n<li>Fixed major problem with IE that removed the selection from the\niframe as soon as some other element got clicked (resulting in\nactions to be performed on the wrong location). [issue 31]</li>\n<li>Fixed colorchooser in IE, also fixed background color support.</li>\n</ul>\n</li>\n<li>1.0 alpha 2 (2003-11-07)<ul>\n<li>Refactored epozeditor.js to a MVC-style component architecture.\n[Issue 26]</li>\n<li>Added a path tool [Issue 24]</li>\n<li>Added epoz logo</li>\n</ul>\n</li>\n<li>1.0 alpha 1 (2003-10-24)<ul>\n<li>Fix useCSS (generates a Midas error)</li>\n<li>When in a list, a style picker will appear for the shape of the\nlist symbols.</li>\n<li>Dumb down the link and image toolboxes</li>\n<li>Let the iframe src work from Apache via a tal:attributes to\nreplace the src with nothing when served from Zope</li>\n<li>Added new attributes on &lt;iframe&gt; to configure the Epoz instance:<ul>\n<li>dst specifices the URL to PUT to.</li>\n<li>usecss is either 0 or 1, to tell Midas whether to use CSS or\nelement styles like &lt;b&gt;.</li>\n<li>reloadsrc is either 0 or 1, to tell Epoz whether the server\nwants the editor to reload the source after saving.  This is\ntrue in Silva, which transforms the XHTML after saving.</li>\n</ul>\n</li>\n<li>Improved error message that appears if an async save fails.</li>\n<li>Added plain Zope2 integration (philikon)</li>\n<li>Added functionality for editing tables (adding and deleting\nrows and columns, setting alignment etc.)</li>\n<li>Fixed bug in link code, the url is now added to the link\ncorrectly and can also be modified</li>\n<li>Replaced some timeout code with a poll loop, which should work\nbetter in extreme situations (slow setup, large documents etc.)</li>\n<li>When the cursor is in a list, a drop-down appears to set the style\nof the list symbols (e.g. disc for ul, roman numerals for ol)</li>\n</ul>\n</li>\n</ul>\n</div>\n\n          </div>"}, "last_serial": 840278, "releases": {"1.4.12": [{"comment_text": "", "digests": {"md5": "3f367d0c680734249aadecfd49eb377f", "sha256": "f896850c61d98d14cb6edce5d134e30133feb6fa4853ca995df2200b62896d40"}, "downloads": -1, "filename": "Products.kupu-1.4.12.zip", "has_sig": false, "md5_digest": "3f367d0c680734249aadecfd49eb377f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1403469, "upload_time": "2008-10-06T16:07:27", "upload_time_iso_8601": "2008-10-06T16:07:27Z", "url": "https://files.pythonhosted.org/packages/59/00/8c7ff2337cb7472158b7e9ce413f2044d7152fbe73965383ff784e7cfe0a/Products.kupu-1.4.12.zip", "yanked": false}], "1.4.12.1": [{"comment_text": "", "digests": {"md5": "8ff2d20b074923ef9caab3835d481a10", "sha256": "b99e0dd9fc08c13ba5e20196712004da5d6750603050dc160c9d8e97176ddd30"}, "downloads": -1, "filename": "Products.kupu-1.4.12.1.zip", "has_sig": false, "md5_digest": "8ff2d20b074923ef9caab3835d481a10", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1406405, "upload_time": "2008-10-09T11:57:15", "upload_time_iso_8601": "2008-10-09T11:57:15Z", "url": "https://files.pythonhosted.org/packages/ed/53/f4835947883947286ec9617540d5b2fcf39cff2fe388bc28637604802529/Products.kupu-1.4.12.1.zip", "yanked": false}], "1.4.13": [{"comment_text": "", "digests": {"md5": "3253ac8f0cadd3e7d790171e249eea28", "sha256": "6f55a8485be1d3f642b298cd668c5affdd133deb0b8182046e716ac0f994525f"}, "downloads": -1, "filename": "Products.kupu-1.4.13.zip", "has_sig": false, "md5_digest": "3253ac8f0cadd3e7d790171e249eea28", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1433449, "upload_time": "2009-05-22T18:12:06", "upload_time_iso_8601": "2009-05-22T18:12:06.953282Z", "url": "https://files.pythonhosted.org/packages/b1/03/41f6c55ab208f237a94cb7789ef947ad8b33f1dba5099721a737a9ef099a/Products.kupu-1.4.13.zip", "yanked": false}], "1.4.14": [{"comment_text": "", "digests": {"md5": "f2a2f01770bac2c53347412bbef4a8ea", "sha256": "5c004c92ef41685e668d5e2a6a1695c333e95dd16c1c8424590a0832e1c2f510"}, "downloads": -1, "filename": "Products.kupu-1.4.14.zip", "has_sig": false, "md5_digest": "f2a2f01770bac2c53347412bbef4a8ea", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1433945, "upload_time": "2009-07-06T19:32:32", "upload_time_iso_8601": "2009-07-06T19:32:32.529301Z", "url": "https://files.pythonhosted.org/packages/fc/29/46c45025120e33d37f543d4ca0f2c84ba76ab862f4c481378b91afced8f9/Products.kupu-1.4.14.zip", "yanked": false}], "1.4.15": [{"comment_text": "", "digests": {"md5": "141dccc19ff902fdc55b7c01b941fa8f", "sha256": "12d65631b6f2d98074738510bcd093740f88c00a4420e6140f1e8a333f54fda0"}, "downloads": -1, "filename": "Products.kupu-1.4.15.zip", "has_sig": false, "md5_digest": "141dccc19ff902fdc55b7c01b941fa8f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1433700, "upload_time": "2009-07-27T09:58:14", "upload_time_iso_8601": "2009-07-27T09:58:14.900595Z", "url": "https://files.pythonhosted.org/packages/0c/51/b8d015588db94fe3b0c41ecdd254dbbbb3e8fae5211cf9a8ca83ef6086dc/Products.kupu-1.4.15.zip", "yanked": false}], "1.4.16": [{"comment_text": "", "digests": {"md5": "3a6e185d05c849842e4adf87412aa356", "sha256": "cde5ca24b5dcfd5477fef873e1e670726fe1bf0147f3667c4523b5ac2e35313f"}, "downloads": -1, "filename": "Products.kupu-1.4.16.zip", "has_sig": false, "md5_digest": "3a6e185d05c849842e4adf87412aa356", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1462817, "upload_time": "2009-11-19T16:34:16", "upload_time_iso_8601": "2009-11-19T16:34:16.802564Z", "url": "https://files.pythonhosted.org/packages/f0/09/b6012b8cd14a5898448e7c573e8bfd1d70a7fd81c615390b8b4993467a3b/Products.kupu-1.4.16.zip", "yanked": false}], "1.4.17": [{"comment_text": "", "digests": {"md5": "47f766ad9e1ab194f7e760204489b191", "sha256": "d051cddb68a6fdebb13910723999429d01ce61f6c8c0f8a90c645bc95bef7e9e"}, "downloads": -1, "filename": "Products.kupu-1.4.17.zip", "has_sig": false, "md5_digest": "47f766ad9e1ab194f7e760204489b191", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1470586, "upload_time": "2011-01-03T17:31:36", "upload_time_iso_8601": "2011-01-03T17:31:36.613937Z", "url": "https://files.pythonhosted.org/packages/5f/dd/8e67e1d1758a89a38ec3ab72063bc2fe8ee4257c3223d4d6f23e99659ce1/Products.kupu-1.4.17.zip", "yanked": false}], "1.4.18": [{"comment_text": "", "digests": {"md5": "24601732d0f83e01f9d74f64da1ec7e8", "sha256": "a02ad6ffc97c2f1de18a7bd2130bbe3482b9e745261e8d503a01fc5c2bcafaaa"}, "downloads": -1, "filename": "Products.kupu-1.4.18.zip", "has_sig": false, "md5_digest": "24601732d0f83e01f9d74f64da1ec7e8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1461291, "upload_time": "2011-08-05T15:57:19", "upload_time_iso_8601": "2011-08-05T15:57:19.053972Z", "url": "https://files.pythonhosted.org/packages/43/09/12731c542295d52bf648f270f3b100548319a8db8520363f9253ffa544d1/Products.kupu-1.4.18.zip", "yanked": false}], "1.5.0": [{"comment_text": "", "digests": {"md5": "0952b721f77fdb38bd0bbc0a52943cbd", "sha256": "09911c5b0c28445ed7e93a66f243aa9f7fa38d67ab130c5b51de75aa2ae6ea09"}, "downloads": -1, "filename": "Products.kupu-1.5.0.zip", "has_sig": false, "md5_digest": "0952b721f77fdb38bd0bbc0a52943cbd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1465698, "upload_time": "2011-04-07T17:42:31", "upload_time_iso_8601": "2011-04-07T17:42:31.426172Z", "url": "https://files.pythonhosted.org/packages/8f/14/d68b9447484bca6bdd9554988c087d3ea2594a0f0baaba4b67c3911f96c6/Products.kupu-1.5.0.zip", "yanked": false}], "1.5.0b1": [{"comment_text": "", "digests": {"md5": "d6cb6857da9f077bd8d3b987b598529d", "sha256": "1f4e771cfaf9e2535afefb9d23e4f2e2a7b9e2f13a52eb65a8cb50a403fc92c4"}, "downloads": -1, "filename": "Products.kupu-1.5.0b1.zip", "has_sig": false, "md5_digest": "d6cb6857da9f077bd8d3b987b598529d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1468507, "upload_time": "2011-01-04T19:33:48", "upload_time_iso_8601": "2011-01-04T19:33:48.542944Z", "url": "https://files.pythonhosted.org/packages/43/5b/f11c7cb92f3930cf39aab4eb80f2e4e51d24a76dd53a1f4f03d1504e60eb/Products.kupu-1.5.0b1.zip", "yanked": false}], "1.5.1": [{"comment_text": "", "digests": {"md5": "b884fcc7f510426974d8d3c4333da4f4", "sha256": "d0b3fb0127114e9c6cc34b2b092d85f149a2337655a77a70e553ee0bda16efa1"}, "downloads": -1, "filename": "Products.kupu-1.5.1.zip", "has_sig": false, "md5_digest": "b884fcc7f510426974d8d3c4333da4f4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1756554, "upload_time": "2012-12-09T10:12:04", "upload_time_iso_8601": "2012-12-09T10:12:04.174512Z", "url": "https://files.pythonhosted.org/packages/4e/80/d1d7cdb55540ce9bf0dec2b7160fef567ecafefa4beba60cdcbb1645e070/Products.kupu-1.5.1.zip", "yanked": false}], "1.5.2": [{"comment_text": "", "digests": {"md5": "e1396fab6793bd19de44bf52760d7e12", "sha256": "5f6837a4d8228a6ceed72d106e559260d3d322e3971daabb0cc52726ab566d08"}, "downloads": -1, "filename": "Products.kupu-1.5.2.zip", "has_sig": false, "md5_digest": "e1396fab6793bd19de44bf52760d7e12", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1457943, "upload_time": "2013-08-14T20:11:39", "upload_time_iso_8601": "2013-08-14T20:11:39.028137Z", "url": "https://files.pythonhosted.org/packages/79/31/de1e83c600a27e7972e9a247c6473db378526cc889fcad4f81a700d03e24/Products.kupu-1.5.2.zip", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "e1396fab6793bd19de44bf52760d7e12", "sha256": "5f6837a4d8228a6ceed72d106e559260d3d322e3971daabb0cc52726ab566d08"}, "downloads": -1, "filename": "Products.kupu-1.5.2.zip", "has_sig": false, "md5_digest": "e1396fab6793bd19de44bf52760d7e12", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1457943, "upload_time": "2013-08-14T20:11:39", "upload_time_iso_8601": "2013-08-14T20:11:39.028137Z", "url": "https://files.pythonhosted.org/packages/79/31/de1e83c600a27e7972e9a247c6473db378526cc889fcad4f81a700d03e24/Products.kupu-1.5.2.zip", "yanked": false}], "timestamp": "Fri May  8 03:18:14 2020"}