{"info": {"author": "Groundwire", "author_email": "info@groundwire.org", "bugtrack_url": null, "classifiers": ["Development Status :: 6 - Mature", "Framework :: Plone"], "description": "Introduction\n============\n\nPress Room is a simple add-on product which can be used to easily manage an\nonline Press Room within your Plone site.  It adds 4 new content types to your\nPlone site including a Press Release, a Press Clip (i.e. an outside news\npiece), and a Press Contact (someone who might be available to speak to the\npress.)\n\nIt also provides a Press Room, a folderish content type with a nice default\nview and some automatically created folders and Collections (aka Smart Folders)\nto help you organize and present your press materials.\n\nSome press rooms we observed in making this product are found at microsoft.com,\nintel.com, nrdc.org, sierraclub.org, and google.com.  Our goal was to make\nsomething suitable for many kinds of organizations, including nonprofits,\nbusinesses, educational institutions, and more.\n\nFeatures\n========\n\nPress Releases\n--------------\n\n    * Headline\n    * Subheadline\n    * Release date & timing\n    * Location\n    * Image\n    * Related press contacts (see below)\n    * Related content items elsewhere on your site\n\nPress Clips\n-----------\n\nPublished media stories about your organization or of general interest.\n\n    * Date of story\n    * Publication\n    * Reporter\n    * Excerpted text\n    * Hyperlink to original story\n\nPress Contacts\n--------------\n\nPeople with whom reporters can follow up. Press Contacts can be associated\nwith Press Releases.\n\n    * Name\n    * Description\n    * Job Title\n    * Email Address\n    * City\n    * State/Province\n    * Organization\n    * Phone number\n\nPress Room provides a master \"Press Room\" view showing a configurable number\nof Releases, Clips and Contacts (any of which can also be hidden).\n\nPress Room also makes available RSS feeds of Press Releases and Press Clips.\n\nPress Rooms in Action\n=====================\n\n    * `People for Puget Sound`_\n    * `Conservation Northwest`_\n    * `Sierra Club of BC`_\n    * `Ecojustice Canada`_\n\n.. _`People for Puget Sound`: http://www.pugetsound.org/pressroom\n.. _`Conservation Northwest`: http://www.conservationnw.org/pressroom\n.. _`Sierra Club of BC`: http://www.sierraclub.bc.ca/quick-links/media-centre\n.. _`Ecojustice Canada`: http://www.ecojustice.ca/media-centre\n\nCurrent Status of Press Room\n============================\n\nThis release of PressRoom has been tested with Plone 2.5.5, Plone 3.3.2, and\nPlone 4.0b1. We assume it will work for most Plone releases 2.5 through 4.0b1.\nIf you have a Plone 2.1 site, please see the PressRoom 1.1 line.  We are\ncommitted to supporting the two most current Plone releases at a time.\n\nKnown bugs and issues are listed at http://plone.org/products/pressroom/issues\n\nSuggestions welcome!  (Code even more welcome!)\n\nRoadmap: http://plone.org/products/pressroom/roadmap\n\nInstallation\n============\n\nInstall in the usual way, by:\n\n * Adding the Products.PressRoom egg to your buildout\n * Browse to your plone site --> site setup --> add/remove products\n * Click install (or you can use the QuickInstaller tool in the Zope Management Interface)\n\nUsage\n=====\n\nWe recommend creating a Press Room object in the root of your site.\nThen begin creating Press Releases, Press Clips and Press Contacts in your\nPress Room.  \n \nThe \"Add Press (item)\" links in the Press Room will shortcut you to subfolders\nintended to store these items.  Only items stored in their appropriate\nsubfolder will be shown in the Press Room view.\n \nYou may create Press Releases, Clips and Contacts elsewhere in your site, but\nthese will not be shown in the Press Room view.\n \nYou might find it useful to suppress the ability to add normal News Items if\nPress Room replaces that need.  You can do that by going into the portal_types\ntool in the ZMI and unchecking \"implicitly addable\" for News Items.\n\nNote that in Plone 3.0+, the infrastructure supporting each Press Room by\ndefault is created as \"private\".  The Press Room provides a button to publish\nall of these.  That button will NOT publish any actual Releases, Clips or\nContacts -- just the folders that contain them and the Collections that\naggregate them.\n\nUpgrading Folders\n=================\n\nAs of Press Room 3.2, the containers for Press Clips and Press Releases are\nLarge Plone Folders. Before 3.2, Press Room used normal folders, which become\ninefficient when containing more than about a hundred items.  To upgrade an\nolder Press Room, navigate to the Press Room and append \"/@@upgrade-folders\" to\nthe url. A message will return with the results of the upgrade. Note that your\nPress Room subfolders must retain their original ids ('press-clips' and\n'press-releases') in order to be upgraded.\n\nNote also that, by default, Large Plone Folders are not normally addable in a\nPlone site. To allow the creation of the two used in a new Press Room, we\nbriefly enable them (if they weren't already) and after adding them, we disable\nthem again. That means that attempts to rename them will cause a cryptic error\nabout disallowed types. To get around that, simply navigate to portal_types in\nthe ZMI, click into Large Plone Folders, and check the \"Implicitly addable\"\ncheckbox.\n\nIn Plone 4, standard folders are BTree-based and can better handle large numbers\nof items, so Large Plone Folders are no longer used.  Folders that were already\nupgraded to Large Plone Folders in Plone 3 can remain that way.\n\nCredits\r\n=======\r\n\r\nPress Room was designed and created by Groundwire (formerly ONE/Northwest)\r\n(http://www.onenw.org), with contributions from:\r\n\r\n * Trey Beck - trey.beck@ohtogo.com\r\n * Andrew Burkhalter - andrewburkhalter@gmail.com\r\n * Johnpaul Burbank - jpburbank@tegus.ca\r\n * Jon Stahl - jon@groundwire.org\r\n * Jon Baldivieso - jonb@groundwire.org\r\n * David Glick - davidglick@groundwire.org\r\n * naro - i18n work, Czech translation\r\n * Thanks to Green Media Toolshed (http://www.greenmediatoolshed.org) for advice on nomenclature.\r\n\nHistory\n=======\n\n3.18 (2011-10-21)\n- subhead field must not be languageIndependent - there\n  is no need why the subheading should not be translatable\n  [ajung]\n\n3.17 (2011-08-29)\n - Use a separate add permission for each type, and grant them to the Site\n   Administrator role by default. [davisagli]\n\n3.16 (2011-05-05)\n - use archetypes.referencebrowserwidget if available [ajung]\n\n3.15 (2011-04-19)\n - general cleanup of the uninstall code [ajung]\n\n3.14 (2011-04-08)\n - fixed improper return statement in Extensions/utils.py [ajung]\n\n3.13 (2010-10-22)\n - Replace the description field of press contacts with a rich-text text\n   field.  The old description is still used if no text is set.\n   [davisagli]\n\n3.12 (2010-10-19)\n - Fix some improper TAL. [jbaldivieso]\n\n3.11 (2010-09-21)\n - Fix normalizeString usage in Plone 3. [davisagli]\n\n3.10 (2010-09-16)\n - Avoid running the final import step except as part of the PressRoom\n   profile. [davisagli]\n\n3.9 (2010-??-??)\n - Made folder_listing_pressroom template Plone 4 compatible. [yomatters]\n\n3.8 (2010-07-23)\n - Made Press Room draw on collections for content. [yomatters]\n\n3.7 (2010-07-16)\n - Fixed invalid TAL. [davisagli]\n\n3.6 (2010-07-16)\n - Use a forward-compatible way of checking isViewTemplate. [davisagli]\n\n3.5 (2010-07-16)\n - Use context.portal_workflow instead of wtool in templates. [davisagli]\n\n3.4 (2010-07-16)\n - Fix some missing global variables in Plone 4. [davisagli]\n\n3.3 (2010-03-09)\n - Make PressRoom compatible with Plone 4, TinyMCE. [nvasseur, davisagli]\n\n3.2-final\n - Fixed handling of the PressRoom add permission for contributors and in\n   the main pressroom view shortcut links. [davisagli]\n - Fixed a Unicode bug in vCard download [naro]\n - more translation work [naro, tabacha]\n\n3.2-beta-2\n - Fixed the German translations to really be German. [jbaldivieso]\n\n3.2-beta-1\n - Switched to Large Plone Folders for storing Press Releases and Clips. Provided\n   a migration script for upgrading older Press Rooms. (This was Roadmap\n   item #3.) [jbaldivieso]\n - Returned Press Contacts for purposes of press room presentation in the order in which\n   they're stored in the press-contacts folder. [jbaldivieso]\n - Added German translation, thanks to Sven Anders [jbaldivieso]\n - Added Publication to pressroom_view listing of Press Clips [jonstahl]\n - Changed date & publication spans in pressrom_view to divs [jonstahl]\n - Removed \"Up one folder\" from Press Room subfolder views [jonstahl]\n - Made CSS not conditional on pressroom types (it was hard to style pressroom\n   subfolders, which aren't custom types; also it's more efficient to have that\n   readily combinable with other stylesheets in the Resource Registry) [jonstahl]\n\n3.1\n - Added basque translation [erral]\n - Fixed an upgrade error (issue #42) and the i18n coverage in pressroom_view (issue #43).\n - Added a cell phone field to press contacts. Enhanced the way they are displayed throughout the\n   Press Room (issue #11). Also Press Contacts can be downloaded as vCards for use in address\n   books/email clients. [jbaldivieso]\n\n3.0\n - moved pressroom_view logic into view [jbaldivieso]\n - bifurcated the pressroom_content skin directory into 2.5 and 3.0 versions to\n   support KSS in 3.0 sites [jbaldivieso]\n - moved as much of the initialization into GenericSetup as possible, without sacrificing\n   normal quickinstaller-based installation in Plone 2.5. [jbaldivieso]\n - created a workaround for PressRooms created using the new Simple Publication WF.\n   Users are warned if the releases/clips/contacts folders are private, and a button\n   is provided to publish the pressroom, the three subfolders, and their respective\n   Collections. [jbaldivieso]\n\n1.1\n - Italian translation file [rlemmi - thanks!]\n - Corrected help text on press clip publication [jonstahl]\n - Moved press clip description above byline [jonstahl]\n - Nicer handling of link to press clip original story. [jonstahl]\n - Added uninstall method to remove PR cruft. [jbaldivieso]\n - Made master Press Room view listing of contacts respect contacts' order in the\n   contacts folder [jonstahl]\n - added i18n for the plone domain (content type names) and fixed translation\n   in the Press room default subfolder titles and descriptions\n - added i18n in pressroom domain, added Czech translation [naro - thanks!]\n - removed condition on pressroom_folder_listing that prevented bylines from being\n   shown to anonymous users [jonstahl]\n - added i18n tags to page templates [jonstahl]\n\n1.0.3\n - Changed the id on the created press contact smart folder from \"roster\" to \"press-contacts\"\n   due to the former being a reserver id within the context of a member folder.  Fixes issue\n   #26 [andrewb]\n - Changing some tests that were based on the assumption that we were ordering catalog results\n   on effective rather than the more logical storydate and releaseDate schema fields [andrewb]\n - Adding test coverage to prove that a storydate and releaseDate *should* be required on the\n   PressRelease & PressClip content types due to the sorting that's done in the default\n   catalog queries [andrewb]\n - Making storydate and releaseDate required fields within the schema declaration per the\n   testing coverage in the previous line [andrewb]\n - The \"More press clips/release\" text only shows up when there actually *are* more of\n   those items [andrewb]\n - Removed trailing slashes in links from main press room and press room subfolder views [jonstahl]\n - Added | between email and phone number for press contacts [jonstahl]\n - Spam-protected email adddress of press contacts [jonstahl]\n - Changed CSS selector for press contacts from #press-contacts to #press-contacts-box to\n   resolve conflict with auto-generated listing in folder_contents [jonstahl]\n\n1.0.2\n - Fixed a missing global define.  [jonstahl]\n\n1.0.1\n - Fixed dumb tab issue. [jonstahl]\n\n1.0 final \n - Fixed smart folder index fields to include getReleaseDate and getStoryDate\n\n1.0 beta\n - Subclassed ATFolder instead of OrderedBaseFolder so that display menu works properly [jonstahl]\n - Added views for clip, release, contact folders [burbank]\n\n0.8.1\n - Resolved compatibility issues with LinguaPlone and PressRoom due to subclassing of\n   i18N-unaware type for the PressRoom type\n\n0.8 \n - Initial release to plone.org products area (CHANGES regime not in place so do the following:   \n   \"svn diff --verbose -r 23865:27132\" against the collective repository to determine what\n   has changed)\n\n0.1 \n - Initial release and migration to Collective", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://plone.org/products/pressroom", "keywords": "plone press media news release", "license": "GPL", "maintainer": null, "maintainer_email": null, "name": "Products.PressRoom", "package_url": "https://pypi.org/project/Products.PressRoom/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/Products.PressRoom/", "project_urls": {"Download": "UNKNOWN", "Homepage": "http://plone.org/products/pressroom"}, "release_url": "https://pypi.org/project/Products.PressRoom/3.18/", "requires_dist": null, "requires_python": null, "summary": "Allows users to instantly create a polished, professional press room, featuring press releases, press clips and press contacts.  Manage an online Press Room within your Plone site.", "version": "3.18", "yanked": false, "html_description": "<div class=\"project-description\">\n            Introduction<br>============<br><br>Press Room is a simple add-on product which can be used to easily manage an<br>online Press Room within your Plone site.  It adds 4 new content types to your<br>Plone site including a Press Release, a Press Clip (i.e. an outside news<br>piece), and a Press Contact (someone who might be available to speak to the<br>press.)<br><br>It also provides a Press Room, a folderish content type with a nice default<br>view and some automatically created folders and Collections (aka Smart Folders)<br>to help you organize and present your press materials.<br><br>Some press rooms we observed in making this product are found at microsoft.com,<br>intel.com, nrdc.org, sierraclub.org, and google.com.  Our goal was to make<br>something suitable for many kinds of organizations, including nonprofits,<br>businesses, educational institutions, and more.<br><br>Features<br>========<br><br>Press Releases<br>--------------<br><br>    * Headline<br>    * Subheadline<br>    * Release date &amp; timing<br>    * Location<br>    * Image<br>    * Related press contacts (see below)<br>    * Related content items elsewhere on your site<br><br>Press Clips<br>-----------<br><br>Published media stories about your organization or of general interest.<br><br>    * Date of story<br>    * Publication<br>    * Reporter<br>    * Excerpted text<br>    * Hyperlink to original story<br><br>Press Contacts<br>--------------<br><br>People with whom reporters can follow up. Press Contacts can be associated<br>with Press Releases.<br><br>    * Name<br>    * Description<br>    * Job Title<br>    * Email Address<br>    * City<br>    * State/Province<br>    * Organization<br>    * Phone number<br><br>Press Room provides a master \"Press Room\" view showing a configurable number<br>of Releases, Clips and Contacts (any of which can also be hidden).<br><br>Press Room also makes available RSS feeds of Press Releases and Press Clips.<br><br>Press Rooms in Action<br>=====================<br><br>    * `People for Puget Sound`_<br>    * `Conservation Northwest`_<br>    * `Sierra Club of BC`_<br>    * `Ecojustice Canada`_<br><br>.. _`People for Puget Sound`: http://www.pugetsound.org/pressroom<br>.. _`Conservation Northwest`: http://www.conservationnw.org/pressroom<br>.. _`Sierra Club of BC`: http://www.sierraclub.bc.ca/quick-links/media-centre<br>.. _`Ecojustice Canada`: http://www.ecojustice.ca/media-centre<br><br>Current Status of Press Room<br>============================<br><br>This release of PressRoom has been tested with Plone 2.5.5, Plone 3.3.2, and<br>Plone 4.0b1. We assume it will work for most Plone releases 2.5 through 4.0b1.<br>If you have a Plone 2.1 site, please see the PressRoom 1.1 line.  We are<br>committed to supporting the two most current Plone releases at a time.<br><br>Known bugs and issues are listed at http://plone.org/products/pressroom/issues<br><br>Suggestions welcome!  (Code even more welcome!)<br><br>Roadmap: http://plone.org/products/pressroom/roadmap<br><br>Installation<br>============<br><br>Install in the usual way, by:<br><br> * Adding the Products.PressRoom egg to your buildout<br> * Browse to your plone site --&gt; site setup --&gt; add/remove products<br> * Click install (or you can use the QuickInstaller tool in the Zope Management Interface)<br><br>Usage<br>=====<br><br>We recommend creating a Press Room object in the root of your site.<br>Then begin creating Press Releases, Press Clips and Press Contacts in your<br>Press Room.  <br> <br>The \"Add Press (item)\" links in the Press Room will shortcut you to subfolders<br>intended to store these items.  Only items stored in their appropriate<br>subfolder will be shown in the Press Room view.<br> <br>You may create Press Releases, Clips and Contacts elsewhere in your site, but<br>these will not be shown in the Press Room view.<br> <br>You might find it useful to suppress the ability to add normal News Items if<br>Press Room replaces that need.  You can do that by going into the portal_types<br>tool in the ZMI and unchecking \"implicitly addable\" for News Items.<br><br>Note that in Plone 3.0+, the infrastructure supporting each Press Room by<br>default is created as \"private\".  The Press Room provides a button to publish<br>all of these.  That button will NOT publish any actual Releases, Clips or<br>Contacts -- just the folders that contain them and the Collections that<br>aggregate them.<br><br>Upgrading Folders<br>=================<br><br>As of Press Room 3.2, the containers for Press Clips and Press Releases are<br>Large Plone Folders. Before 3.2, Press Room used normal folders, which become<br>inefficient when containing more than about a hundred items.  To upgrade an<br>older Press Room, navigate to the Press Room and append \"/@@upgrade-folders\" to<br>the url. A message will return with the results of the upgrade. Note that your<br>Press Room subfolders must retain their original ids ('press-clips' and<br>'press-releases') in order to be upgraded.<br><br>Note also that, by default, Large Plone Folders are not normally addable in a<br>Plone site. To allow the creation of the two used in a new Press Room, we<br>briefly enable them (if they weren't already) and after adding them, we disable<br>them again. That means that attempts to rename them will cause a cryptic error<br>about disallowed types. To get around that, simply navigate to portal_types in<br>the ZMI, click into Large Plone Folders, and check the \"Implicitly addable\"<br>checkbox.<br><br>In Plone 4, standard folders are BTree-based and can better handle large numbers<br>of items, so Large Plone Folders are no longer used.  Folders that were already<br>upgraded to Large Plone Folders in Plone 3 can remain that way.<br><br>Credits\n<br>=======\n<br>\n<br>Press Room was designed and created by Groundwire (formerly ONE/Northwest)\n<br>(http://www.onenw.org), with contributions from:\n<br>\n<br> * Trey Beck - trey.beck@ohtogo.com\n<br> * Andrew Burkhalter - andrewburkhalter@gmail.com\n<br> * Johnpaul Burbank - jpburbank@tegus.ca\n<br> * Jon Stahl - jon@groundwire.org\n<br> * Jon Baldivieso - jonb@groundwire.org\n<br> * David Glick - davidglick@groundwire.org\n<br> * naro - i18n work, Czech translation\n<br> * Thanks to Green Media Toolshed (http://www.greenmediatoolshed.org) for advice on nomenclature.\n<br><br>History<br>=======<br><br>3.18 (2011-10-21)<br>- subhead field must not be languageIndependent - there<br>  is no need why the subheading should not be translatable<br>  [ajung]<br><br>3.17 (2011-08-29)<br> - Use a separate add permission for each type, and grant them to the Site<br>   Administrator role by default. [davisagli]<br><br>3.16 (2011-05-05)<br> - use archetypes.referencebrowserwidget if available [ajung]<br><br>3.15 (2011-04-19)<br> - general cleanup of the uninstall code [ajung]<br><br>3.14 (2011-04-08)<br> - fixed improper return statement in Extensions/utils.py [ajung]<br><br>3.13 (2010-10-22)<br> - Replace the description field of press contacts with a rich-text text<br>   field.  The old description is still used if no text is set.<br>   [davisagli]<br><br>3.12 (2010-10-19)<br> - Fix some improper TAL. [jbaldivieso]<br><br>3.11 (2010-09-21)<br> - Fix normalizeString usage in Plone 3. [davisagli]<br><br>3.10 (2010-09-16)<br> - Avoid running the final import step except as part of the PressRoom<br>   profile. [davisagli]<br><br>3.9 (2010-??-??)<br> - Made folder_listing_pressroom template Plone 4 compatible. [yomatters]<br><br>3.8 (2010-07-23)<br> - Made Press Room draw on collections for content. [yomatters]<br><br>3.7 (2010-07-16)<br> - Fixed invalid TAL. [davisagli]<br><br>3.6 (2010-07-16)<br> - Use a forward-compatible way of checking isViewTemplate. [davisagli]<br><br>3.5 (2010-07-16)<br> - Use context.portal_workflow instead of wtool in templates. [davisagli]<br><br>3.4 (2010-07-16)<br> - Fix some missing global variables in Plone 4. [davisagli]<br><br>3.3 (2010-03-09)<br> - Make PressRoom compatible with Plone 4, TinyMCE. [nvasseur, davisagli]<br><br>3.2-final<br> - Fixed handling of the PressRoom add permission for contributors and in<br>   the main pressroom view shortcut links. [davisagli]<br> - Fixed a Unicode bug in vCard download [naro]<br> - more translation work [naro, tabacha]<br><br>3.2-beta-2<br> - Fixed the German translations to really be German. [jbaldivieso]<br><br>3.2-beta-1<br> - Switched to Large Plone Folders for storing Press Releases and Clips. Provided<br>   a migration script for upgrading older Press Rooms. (This was Roadmap<br>   item #3.) [jbaldivieso]<br> - Returned Press Contacts for purposes of press room presentation in the order in which<br>   they're stored in the press-contacts folder. [jbaldivieso]<br> - Added German translation, thanks to Sven Anders [jbaldivieso]<br> - Added Publication to pressroom_view listing of Press Clips [jonstahl]<br> - Changed date &amp; publication spans in pressrom_view to divs [jonstahl]<br> - Removed \"Up one folder\" from Press Room subfolder views [jonstahl]<br> - Made CSS not conditional on pressroom types (it was hard to style pressroom<br>   subfolders, which aren't custom types; also it's more efficient to have that<br>   readily combinable with other stylesheets in the Resource Registry) [jonstahl]<br><br>3.1<br> - Added basque translation [erral]<br> - Fixed an upgrade error (issue #42) and the i18n coverage in pressroom_view (issue #43).<br> - Added a cell phone field to press contacts. Enhanced the way they are displayed throughout the<br>   Press Room (issue #11). Also Press Contacts can be downloaded as vCards for use in address<br>   books/email clients. [jbaldivieso]<br><br>3.0<br> - moved pressroom_view logic into view [jbaldivieso]<br> - bifurcated the pressroom_content skin directory into 2.5 and 3.0 versions to<br>   support KSS in 3.0 sites [jbaldivieso]<br> - moved as much of the initialization into GenericSetup as possible, without sacrificing<br>   normal quickinstaller-based installation in Plone 2.5. [jbaldivieso]<br> - created a workaround for PressRooms created using the new Simple Publication WF.<br>   Users are warned if the releases/clips/contacts folders are private, and a button<br>   is provided to publish the pressroom, the three subfolders, and their respective<br>   Collections. [jbaldivieso]<br><br>1.1<br> - Italian translation file [rlemmi - thanks!]<br> - Corrected help text on press clip publication [jonstahl]<br> - Moved press clip description above byline [jonstahl]<br> - Nicer handling of link to press clip original story. [jonstahl]<br> - Added uninstall method to remove PR cruft. [jbaldivieso]<br> - Made master Press Room view listing of contacts respect contacts' order in the<br>   contacts folder [jonstahl]<br> - added i18n for the plone domain (content type names) and fixed translation<br>   in the Press room default subfolder titles and descriptions<br> - added i18n in pressroom domain, added Czech translation [naro - thanks!]<br> - removed condition on pressroom_folder_listing that prevented bylines from being<br>   shown to anonymous users [jonstahl]<br> - added i18n tags to page templates [jonstahl]<br><br>1.0.3<br> - Changed the id on the created press contact smart folder from \"roster\" to \"press-contacts\"<br>   due to the former being a reserver id within the context of a member folder.  Fixes issue<br>   #26 [andrewb]<br> - Changing some tests that were based on the assumption that we were ordering catalog results<br>   on effective rather than the more logical storydate and releaseDate schema fields [andrewb]<br> - Adding test coverage to prove that a storydate and releaseDate *should* be required on the<br>   PressRelease &amp; PressClip content types due to the sorting that's done in the default<br>   catalog queries [andrewb]<br> - Making storydate and releaseDate required fields within the schema declaration per the<br>   testing coverage in the previous line [andrewb]<br> - The \"More press clips/release\" text only shows up when there actually *are* more of<br>   those items [andrewb]<br> - Removed trailing slashes in links from main press room and press room subfolder views [jonstahl]<br> - Added | between email and phone number for press contacts [jonstahl]<br> - Spam-protected email adddress of press contacts [jonstahl]<br> - Changed CSS selector for press contacts from #press-contacts to #press-contacts-box to<br>   resolve conflict with auto-generated listing in folder_contents [jonstahl]<br><br>1.0.2<br> - Fixed a missing global define.  [jonstahl]<br><br>1.0.1<br> - Fixed dumb tab issue. [jonstahl]<br><br>1.0 final <br> - Fixed smart folder index fields to include getReleaseDate and getStoryDate<br><br>1.0 beta<br> - Subclassed ATFolder instead of OrderedBaseFolder so that display menu works properly [jonstahl]<br> - Added views for clip, release, contact folders [burbank]<br><br>0.8.1<br> - Resolved compatibility issues with LinguaPlone and PressRoom due to subclassing of<br>   i18N-unaware type for the PressRoom type<br><br>0.8 <br> - Initial release to plone.org products area (CHANGES regime not in place so do the following:   <br>   \"svn diff --verbose -r 23865:27132\" against the collective repository to determine what<br>   has changed)<br><br>0.1 <br> - Initial release and migration to Collective\n          </div>"}, "last_serial": 993914, "releases": {"3.10": [{"comment_text": "", "digests": {"md5": "6bfeb847749c07f2e08a3b4a8c8fce5a", "sha256": "b8305c8fc5268a5b9740053cd7d284d93d3cc585f0e287b557d3701779320b1f"}, "downloads": -1, "filename": "Products.PressRoom-3.10.zip", "has_sig": false, "md5_digest": "6bfeb847749c07f2e08a3b4a8c8fce5a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 123328, "upload_time": "2010-09-16T20:13:35", "upload_time_iso_8601": "2010-09-16T20:13:35.548944Z", "url": "https://files.pythonhosted.org/packages/5c/c2/519d7b1bc812ff2f689ff3816f293884a9f0024de0df6d344c13aabdc295/Products.PressRoom-3.10.zip", "yanked": false}], "3.11": [{"comment_text": "", "digests": {"md5": "26821d18fdeb9288c682e0e713bce981", "sha256": "3a7898d684aa94f85fcdd2fab96d9e624ce90fe8d909f6977ab8f09801322c2e"}, "downloads": -1, "filename": "Products.PressRoom-3.11.zip", "has_sig": true, "md5_digest": "26821d18fdeb9288c682e0e713bce981", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 123498, "upload_time": "2010-09-21T23:16:53", "upload_time_iso_8601": "2010-09-21T23:16:53.043657Z", "url": "https://files.pythonhosted.org/packages/6f/a3/a88af346fd5c2235cef3dd2fb0f761a41e138fe4945c8fbde7ce2d9abe94/Products.PressRoom-3.11.zip", "yanked": false}], "3.12": [{"comment_text": "", "digests": {"md5": "4be8749683436d6f1d094934ef2fe071", "sha256": "e756603bb79d8d5137bce87af872c1f325ac5659463135bc121bc7cc2a587f2d"}, "downloads": -1, "filename": "Products.PressRoom-3.12.zip", "has_sig": false, "md5_digest": "4be8749683436d6f1d094934ef2fe071", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 123453, "upload_time": "2010-10-19T21:05:05", "upload_time_iso_8601": "2010-10-19T21:05:05.756489Z", "url": "https://files.pythonhosted.org/packages/16/cc/b39d2136ae70ee404694c73ccb55d288cc4e75432500876e7306fd1af3c6/Products.PressRoom-3.12.zip", "yanked": false}], "3.13": [{"comment_text": "", "digests": {"md5": "a615d43fe372a09ae5ac4e5be997ca16", "sha256": "bd7e65d4840a47de204742b220adf40edb42a3463b4168b2003fe424340aa89f"}, "downloads": -1, "filename": "Products.PressRoom-3.13.zip", "has_sig": true, "md5_digest": "a615d43fe372a09ae5ac4e5be997ca16", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 124113, "upload_time": "2010-10-22T21:54:26", "upload_time_iso_8601": "2010-10-22T21:54:26.509624Z", "url": "https://files.pythonhosted.org/packages/dd/82/09576bb7de6055fc2189c4b72186770b17f5870b6c1d609e8516ee8b358e/Products.PressRoom-3.13.zip", "yanked": false}], "3.14": [{"comment_text": "", "digests": {"md5": "1a4ecf12b85715eba871fa5ce31899e0", "sha256": "a6d557ab1d05ad7e86f7c4f0ddf1a7d9271a0cfd90527fa9076c449cec48ef45"}, "downloads": -1, "filename": "Products.PressRoom-3.14.tar.gz", "has_sig": false, "md5_digest": "1a4ecf12b85715eba871fa5ce31899e0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 64091, "upload_time": "2011-04-08T17:37:04", "upload_time_iso_8601": "2011-04-08T17:37:04.611119Z", "url": "https://files.pythonhosted.org/packages/1c/13/cd4b3789793a0364e57a198b69acda8c6d9df4ec6fa0d95745767b10a9ce/Products.PressRoom-3.14.tar.gz", "yanked": false}], "3.15": [{"comment_text": "", "digests": {"md5": "eb82eb2b5c2ad807eb2c11c0c274b45f", "sha256": "318d7d72d7a0aa57cb661b88c067cc100ebefdf5aec04fdd96f3f779ed85ec9f"}, "downloads": -1, "filename": "Products.PressRoom-3.15.tar.gz", "has_sig": false, "md5_digest": "eb82eb2b5c2ad807eb2c11c0c274b45f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 68654, "upload_time": "2011-04-18T08:33:25", "upload_time_iso_8601": "2011-04-18T08:33:25.282247Z", "url": "https://files.pythonhosted.org/packages/bc/7c/fd51a956f102d68626da3521bd5bff2867e4886bd79bf8d143bba4d1d3ce/Products.PressRoom-3.15.tar.gz", "yanked": false}], "3.16": [{"comment_text": "", "digests": {"md5": "1562fd18a04ed337a983b3c323fbae24", "sha256": "0af0d38be39a891b531e1f6baeea858f745f538e7e172eeb508c8ff03c3b45cd"}, "downloads": -1, "filename": "Products.PressRoom-3.16.tar.gz", "has_sig": false, "md5_digest": "1562fd18a04ed337a983b3c323fbae24", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 68798, "upload_time": "2011-05-05T09:37:39", "upload_time_iso_8601": "2011-05-05T09:37:39.295832Z", "url": "https://files.pythonhosted.org/packages/f9/97/675399db77e85f4e712adb9c283205dc878a450739be5439b10a782a13e3/Products.PressRoom-3.16.tar.gz", "yanked": false}], "3.17": [{"comment_text": "", "digests": {"md5": "99695ddbd176398307b26b8bec99a360", "sha256": "5166042430d1e6d825a48069c6b6a44dcb772c5f3c4d0e799d0d6561792d47e2"}, "downloads": -1, "filename": "Products.PressRoom-3.17.zip", "has_sig": false, "md5_digest": "99695ddbd176398307b26b8bec99a360", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 124649, "upload_time": "2011-08-29T23:31:10", "upload_time_iso_8601": "2011-08-29T23:31:10.604108Z", "url": "https://files.pythonhosted.org/packages/33/c4/31d7b18877474abb5774054458f5708ecad0f9cf83ab86232505fa5d962f/Products.PressRoom-3.17.zip", "yanked": false}], "3.18": [{"comment_text": "", "digests": {"md5": "340693e77ccaa4cd0e11bc568c41fc6f", "sha256": "bac2c9695bc8435190cb09b47813617d124d00e3c56594e0ce41539d69cc6366"}, "downloads": -1, "filename": "Products.PressRoom-3.18.zip", "has_sig": false, "md5_digest": "340693e77ccaa4cd0e11bc568c41fc6f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 124965, "upload_time": "2011-10-21T17:38:46", "upload_time_iso_8601": "2011-10-21T17:38:46.782627Z", "url": "https://files.pythonhosted.org/packages/18/ec/49747dfada3f4d98889519df2a685059f20f42672cf084ca127d0c4d5933/Products.PressRoom-3.18.zip", "yanked": false}], "3.2": [{"comment_text": "", "digests": {"md5": "a833f7e3c29b783f66e6141e02628c02", "sha256": "e1ef08c6685c2f2c6515f8c749f77473d2c97cf69e6e40617527d6c19adf1d78"}, "downloads": -1, "filename": "Products.PressRoom-3.2.tar.gz", "has_sig": false, "md5_digest": "a833f7e3c29b783f66e6141e02628c02", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 64727, "upload_time": "2009-08-26T05:15:03", "upload_time_iso_8601": "2009-08-26T05:15:03.357998Z", "url": "https://files.pythonhosted.org/packages/5e/8b/cf5ae33d982289d8f47aecd88a4c82e849f6a3fa9042e9cd447ae9298e25/Products.PressRoom-3.2.tar.gz", "yanked": false}], "3.3": [{"comment_text": "", "digests": {"md5": "cb0fd84afdfe849e7c61c46632536fef", "sha256": "037233785dfb92845444b59963b64756288be31b1595287b21a1038c03d1c33a"}, "downloads": -1, "filename": "Products.PressRoom-3.3.zip", "has_sig": true, "md5_digest": "cb0fd84afdfe849e7c61c46632536fef", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 121430, "upload_time": "2010-03-10T02:07:57", "upload_time_iso_8601": "2010-03-10T02:07:57.059867Z", "url": "https://files.pythonhosted.org/packages/8f/c6/6ce8de5695a0a0668c608cffe592b22424f5acab7052bae2ca9ae5dc4d83/Products.PressRoom-3.3.zip", "yanked": false}], "3.4": [{"comment_text": "", "digests": {"md5": "14aa524b03e83d9d4e9ee87c4e4687de", "sha256": "bdef229e1da61070b380de6a9d4399fc492cf8aebd986edb27458cc6ede12ae4"}, "downloads": -1, "filename": "Products.PressRoom-3.4.zip", "has_sig": true, "md5_digest": "14aa524b03e83d9d4e9ee87c4e4687de", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 121974, "upload_time": "2010-07-16T22:43:36", "upload_time_iso_8601": "2010-07-16T22:43:36.221617Z", "url": "https://files.pythonhosted.org/packages/09/85/07e211260ecdbb6944ce479ba82d336bffc555afdf0f5692d26c3a354303/Products.PressRoom-3.4.zip", "yanked": false}], "3.5": [{"comment_text": "", "digests": {"md5": "d0d1af399168e0ab611769021718f60b", "sha256": "61628cedbcd1e92b25d55872fdbf3535d0f997a57b94f42294d759db5369d1b4"}, "downloads": -1, "filename": "Products.PressRoom-3.5.zip", "has_sig": true, "md5_digest": "d0d1af399168e0ab611769021718f60b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 122114, "upload_time": "2010-07-16T22:56:53", "upload_time_iso_8601": "2010-07-16T22:56:53.011962Z", "url": "https://files.pythonhosted.org/packages/ee/67/4ab905ec670e92c395656c2bf4c6006bd9512c5344753bb4c59963e0de4c/Products.PressRoom-3.5.zip", "yanked": false}], "3.6": [{"comment_text": "", "digests": {"md5": "a9a2766b4c6110473e2de7e512fcbb83", "sha256": "fbdceaae21ad919d975a1db0d8ee1e2e929200eef0fe6df1b1d81287bc2afb5e"}, "downloads": -1, "filename": "Products.PressRoom-3.6.zip", "has_sig": true, "md5_digest": "a9a2766b4c6110473e2de7e512fcbb83", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 122246, "upload_time": "2010-07-16T23:30:19", "upload_time_iso_8601": "2010-07-16T23:30:19.703750Z", "url": "https://files.pythonhosted.org/packages/d7/03/036dccee44cb02413a8a1bbf019670f5d3f0e00784da27d1836fd993d350/Products.PressRoom-3.6.zip", "yanked": false}], "3.7": [{"comment_text": "", "digests": {"md5": "ca1c4b2743bfc90ec0a23bf1a4803214", "sha256": "a2b57e2618839f9a822be7a497880b38743b28fffaa9cc235b603dd3e6f5bd87"}, "downloads": -1, "filename": "Products.PressRoom-3.7.zip", "has_sig": true, "md5_digest": "ca1c4b2743bfc90ec0a23bf1a4803214", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 122290, "upload_time": "2010-07-17T00:01:35", "upload_time_iso_8601": "2010-07-17T00:01:35.594254Z", "url": "https://files.pythonhosted.org/packages/54/67/e509cd8960a1e32b4c52cf5ddc02c1249ba989aa340dabc15e702f7b7da2/Products.PressRoom-3.7.zip", "yanked": false}], "3.8": [{"comment_text": "", "digests": {"md5": "8fea95be744a861a4614338c5b209781", "sha256": "39bf53a1cb31021010e0361334b5cd38b7813f58e1d56cf11bfdd7a541ee6357"}, "downloads": -1, "filename": "Products.PressRoom-3.8.zip", "has_sig": false, "md5_digest": "8fea95be744a861a4614338c5b209781", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 122540, "upload_time": "2010-07-24T00:11:00", "upload_time_iso_8601": "2010-07-24T00:11:00.317336Z", "url": "https://files.pythonhosted.org/packages/ac/a3/a6a2adefdaaba9108e7b23d2cfc18715c4ea3ad85b461d45410610cbf518/Products.PressRoom-3.8.zip", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "340693e77ccaa4cd0e11bc568c41fc6f", "sha256": "bac2c9695bc8435190cb09b47813617d124d00e3c56594e0ce41539d69cc6366"}, "downloads": -1, "filename": "Products.PressRoom-3.18.zip", "has_sig": false, "md5_digest": "340693e77ccaa4cd0e11bc568c41fc6f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 124965, "upload_time": "2011-10-21T17:38:46", "upload_time_iso_8601": "2011-10-21T17:38:46.782627Z", "url": "https://files.pythonhosted.org/packages/18/ec/49747dfada3f4d98889519df2a685059f20f42672cf084ca127d0c4d5933/Products.PressRoom-3.18.zip", "yanked": false}], "timestamp": "Fri May  8 03:17:50 2020"}