{"info": {"author": "Morten W. Petersen", "author_email": "morphex@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Framework :: Zope2", "Intended Audience :: Developers", "Intended Audience :: End Users/Desktop", "License :: OSI Approved :: GNU General Public License v2 (GPLv2)", "Natural Language :: English", "Operating System :: OS Independent", "Programming Language :: Python", "Topic :: Internet :: WWW/HTTP", "Topic :: Software Development :: Bug Tracking"], "description": "What is it?\n\n  The Issue Dealer is a tool for managing issues, currently\n  it focuses on the information in, and structuring of, issues.\n\n  It can be used as a generic issue tracker, a knowledge management\n  tool, a weblog or an outliner.\n\n  It also contains an experimental framework for creating content\n  classes through the web.\n\n  It has been tested to work with 2.13.22 but is believed to\n  work with older versions of Zope as well.\n\nWhy have you created it?\n\n  Initially the company I work for (Nidelven IT) needed a tool that\n  could help organize and share information.  It started as a basic\n  'folder and document' archive on my computer, now it's evolving\n  into an advanced (but simple to use!) information management and\n  distribution system.\n\n  Some years ago I took it over as a personal project, and since I've\n  spent so much time on it already and it works well for its purpose\n  and that the LAF system is interesting, I'm going to keep updating\n  it. I don't know what the future for Zope 2 will be, but seeing how\n  different systems can survive I wouldn't be surprised if Zope 2 is\n  well maintained 5-10 years down the road.\n\nWhy is it free?\n\n  It started out free, and distributing it under the GPL version 2 is\n  practical, as it is a well-known software license .\n\n  I'd like to start a community around this application eventually, so\n  if you think this is an interesting application, get in touch and\n  maybe we can do something together.\n\nHow are you developing it?\n\n  The project has recently been moved to GitHub, and will be located\n  there for the forseeable future.  Bug-tracking etc. hasn't been\n  setup, but emails and patches are welcome, as are suggestions on\n  where to manage the project from.\n\nWhat happens next?\n\n  The focus for the 1.0 release is to make the application manage\n  information, the focus for the 2.0 release is a complete LAF\n  system.\n\nIs it secure?\n\n  Yes and no.  It is has been built so that access can be restricted\n  to different features and levels, but once someone has access to\n  viewing, adding, editing or something else, you should assume that\n  they can access any part of the system.\n\nDoes it scale?\n\n  Probably not.  This product is primarily focused on small groups of\n  people, and hasn't been stress-tested with big groups of users.\n\nWhat are the main features?\n\n  The main features of the Issue Dealer are:\n\n    Issue Tracking\n\n      - Tracks issues which can be of the type goal, idea, info,\n        problem, question and undefined\n\n      - Can notify users of new issues or changes to issues assigned\n        to them\n\n    Information management\n\n      - Enables structuring and searching of data\n\n      - Advanced search, with saved searches (filters)\n\n    Publishing\n\n      - A weblog publisher\n\n        - Can publish issues to other weblogs\n\n      - A local weblog publisher\n\n        - Acts as a weblog server\n\n        - Supports Atom-enabled clients\n\n        - Enables many forms of subscriptions, through Atom as well as\n          email\n\n      - WebDAV publisher\n\n        - Can publish issues along with their images to WebDAV-enabled\n          servers\n\n      - FAQ publisher\n\n        - Generates FAQs based on questions and solutions\n\n      - Category publisher\n\n        - Publishes issues as categories; these categories can in turn\n          be used in feedback forms on websites, as the publisher\n          accepts incoming issues as well\n\n      - Tree publisher\n\n        - Publishes and issues and its contents to a given URL as a\n          static page\n\n    Advanced HTML/CSS interface\n\n      - Many different views of issues in simple interfaces making the\n        issues easy to work with\n\n      - WYSIWYG editing with support for images\n\n\n0.9.133- (2015-02-12)\n\n  - Various fixes to make IssueDealer work.\n\n0.9.132 (2015-02-12)\n\n  - Making the IssueDealer Zope 2.13.22 compatible.\n\n  - Fixing bug where atom feed failed.\n\n  - Fixing bug where creating an IssueDealer instance failed.\n\n  - Updated readme.\n\n  - Updated copyright time.\n\n0.9.131 (2012-08-22)\n\n  - Fixing bug where KeyError was raised under update_catalog\n\n  - Fixing bug where AttributeError was raised under update_catalog\n\n  - Fixing hyperlinking of URLs in text issues, adding $ as part of a\n    valid URL\n\n  - Disabling advanced search\n\n0.9.130 (2012-08-22)\n\n  - Re-enabling various issue formats\n  - Sorting issues in weblog atom feed based on modification date\n  - Adding try-except for enclosures in atom feed\n  - Escaping HTML entities in weblog for atom feed\n\n0.9.129:\n\n  - Repackaging as an egg for dependant packages\n  - Fixing CatalogAware imports\n  - Making use of ZCTextIndex instead of TextIndex\n  - Adding stub utilities.hyperlink_urls method\n  - Added separate tools to hide/display issue info\n  - Disabled changing issue format (conversion tools broken)\n  - Disabled HTML editing (editor broken)\n\n0.9.128:\n\n  - Experimenting with various changes\n  - Implemented lightweight application framework\n\n0.9.127:\n\n  - Added method for generating nonces\n  - Added experimental search interface\n\n0.9.126:\n\n  - Fixed bug where verification of email wouldn't work\n  - Fixing up on Epoz\n\n0.9.125:\n\n  - Fixed bug where searching for the word \"zope\"\n    would return all issues.\n  - Adding count for contained action issues in\n    calendar listings\n  - Making IssueDealerEpoz forwards compatible,\n    with Zope 2.11\n  - Fixed bug where it wasn't possible to add\n    multiple issues\n  - Fixed render_owner bug in session index\n\n0.9.124:\n\n  - Added issue past due date to notification email\n  - Added documentation on how to setup notifications\n  - Implemented past due date listing of events\n\n0.9.123:\n\n  - Fixed bug where search_string wasn't found (due to\n    double ??)\n  - Fixed bug where some URLs included in a text were\n    not detected properly\n\n0.9.122:\n\n  - Changed things around so that issues can have\n    multiple owners\n  - Implemented support for setting owner on incoming\n    mail issues\n\n0.9.121:\n\n  - Added support for removing and adding tags to\n    multiple issues at once.\n  - Fixed bug where mail messages going through\n    verification lost their from info.\n\n0.9.120:\n\n  - Added support for tagging incoming issues through\n    the mail handler.\n\n0.9.119:\n\n  - Added ability to reschedule events directly in the\n    calendar view\n\n0.9.118:\n\n  - Implemented filter for viewing owned/unowned issues\n    on the calendar view\n  - Made calendar view remember the date range viewed\n    when changing display preferences\n\n0.9.117:\n\n  - Fixed bug where transforming the format of\n    non-action issues would raise a KeyError\n\n0.9.116:\n\n  - Fixed bug where regular (non-action) issues would\n    pop-up a message about non-existing calendars\n\n0.9.115:\n\n  - Added calendar selection widget for due dates\n  - Fixed bug where due with either hour or minute\n    set to 0 would remove all time/hour information\n\n0.9.114:\n\n  - Making upgrades from \"very old\" versions of\n    the Issue Dealer possible\n  - Removed try/except in catalog_update so that\n    we can get told what's wrong\n  - Implemented calendar view (for action items with due date)\n\n0.9.113:\n\n  - Cleaning up print statements\n  - Fixed RDF bug on filter listing\n  - Implemented full support for tags\n  - Fixed bug where users couldn't validate their email\n\n0.9.112:\n\n  - Updated copyright period on footer\n  - Added tag support to issues\n  - Fixed bug where HTML mail messages were stored\n    without to/cc\n  - Added cleaning of incoming HTML messages\n  - Overriding AbstractFormatter to format <br />\n    tags properly in text\n  - Added feedparser for paranoid cleaning of HTML\n  - Implemented spam protection scheme for mail handler\n\n0.9.111:\n\n  - Minor fixes for escaping HTML content in the mail handler\n  - Implemented threading support for mail handling\n  - Implemented skipping of sending of messages to recipients\n    already on To/Cc\n\n0.9.110:\n\n  - Made the Issue Dealer work with non-standard product locations\n  - Implemented mail gateway (mailing list/mail archive interface)\n\n0.9.109:\n\n  - Removed the undefined issue type, replacing it with info\n  - Fixed bug where update_catalog would choke on images without\n    callable ids.\n\n0.9.108:\n\n  - Added ability to strip <script> tags when importing webpages\n  - Fixed bug where missing objects would raise IndexError in the \n    tree_view\n\n0.9.107:\n\n  - Improved last_modified_by code.\n  - Fixed numerous bugs related to security\n\n0.9.106:\n\n  - Added email notifications users who (un)subscribe to the weblog\n  - Added last modified by attribute to issues\n\n0.9.105:\n\n  - Removed old, redundant code\n  - Removed the alternative type\n  - Made session related issues directly add/editable\n  - Improved the exporting/importing of issues\n  - Fixed relation listing bug\n  - Re-fixed bug where notifications failed because of\n    a wrong set of arguments to display function\n\n0.9.104:\n\n  - Made relations able to carry dependencies between issues\n\n0.9.103:\n\n  - Added option where errors in notifications aren't swallowed\n\n0.9.102:\n\n  - Fixed bug where closing issues containing files would raise a RuntimeError\n\n0.9.101:\n\n  - Fixed bug where notifications didn't work properly\n  - Added more functional tests\n\n0.9.100:\n\n  - Fixed bug where catalog creation didn't work correctly\n\n0.9.99:\n\n  - Major code improvements and cleanups\n  - Added restrictions on who's able to rename issues and relations\n  - Removed RSS links on local weblog publisher\n  - Added information on how to install mxTidy\n  - Improved functional tests\n  - Fixed bug where iframe support was incorrectly determined\n  - Removed all traces of RSS, using RDF instead\n  - Added screen for viewing weblog subscribers\n\n0.9.98:\n\n  - Added a new screen for adding relations interactively\n  - Improved handling of comments on the weblog (they are now searchable)\n\n0.9.97:\n\n  - Fixed bug where issue tree was rendered unusable\n  - Fixed unauthorized bug on local weblog publisher blog entry\n\n0.9.96:\n\n  - Updated copyright notice\n  - Refactored code, removed old code\n  - Made anonymous views much easier on the database\n  - Removed old update code\n  - Removed code that requires database writes when\n    viewing objects\n  - Plugged potential security hole in the local weblog publisher\n\n0.9.95:\n\n  - Removed old Epoz/Plone cruft\n  - Updated code so that all warnings are removed\n  - Cleaned up code\n  - Starting support for Five/CMF\n\n0.9.94:\n\n  - Added feedback to rename view if input is missing.\n  - Various minor template tweaks\n  - Various improvements to the weblog comment handling\n  - Fixed bug where settings page was not viewable under relations\n    in local_weblog_publisher\n\n0.9.93:\n\n  - Updated atom feed, to version 1.0\n  - Added support for enclosures\n  - Added access keys (s for search, a for add, e for edit)\n\n0.9.92:\n\n  - Fixed bug where running update_catalog would encode content\n    the wrong way.\n\n0.9.91:\n\n  - Added ability to add files directly when editing issues\n  - Added support for publishing files through the weblog publisher\n\n0.9.90:\n\n  - Added ability to filter atom feeds with category\n\n0.9.89:\n\n  - Several fixes related to public access\n  - Added ability to add multiple issues at once\n\n0.9.88:\n\n  - Refactored code\n  - Added ID to issue details\n  - Fixed bug where publishing issues via the publish button would\n    raise an AttributeError\n\n0.9.87:\n\n  - Added ability to strip tags out of imported web pages\n  - Fixed full view ability bug on root\n  - Fixed bug where goal a level down would raise AttributeError if\n    re-opened\n  - Fixed bug where large imports would fail with an AttributeError\n\n0.9.86:\n\n  - Added due date to action issues\n  - Minor tweaks to issue layout\n\n0.9.85:\n\n  - Layout tweaks, reorganizing navigation bar\n  - Enabled renaming of the category publisher\n  - Making publishing of multiple issues from root possible\n\n0.9.84:\n\n  - Enabled full screen view of issue contents\n  - Added passphrase protection scheme to weblog comments\n\n0.9.83:\n\n  - Modified link saver to enable browsing to destination category\n  - Fixed broken permissions page\n  - Removed link category level options on settings page\n  - Fixed bug where broken image tags would raise an error when\n    editing issues\n\n0.9.82:\n\n  - Added support for viewing issue contents embedded in iframes\n  - Refactored permissions into a separate module\n\n0.9.81:\n\n  - Implemented asynchronous pings on the weblog\n\n0.9.80:\n\n  - Implemented XML import/export feature for issues and relations\n\n0.9.79:\n\n  - Relicensed the Issue Dealer to GPL license\n\n0.9.78:\n\n  - Added category interface for the weblog publisher\n\n0.9.77:\n\n  - Added build options on the UNIX installer so that Issue Dealer\n    should run smoothly on *BSD and Mac OS X\n  - Search results are now more sensitive to context\n\n0.9.76:\n\n  - Fixed bug where emails sent to weblog subscribers would be\n    rendered incorrectly\n  - Made IssueDealer compatible with Zope 2.8\n\n0.9.75:\n\n  - Fixed bug where TypeError would be raised in local weblog\n    publisher on direct issue publishing\n  - Added ability to upload files\n\n0.9.74:\n\n  - Added option to delete catalog\n  - Cleaned up text files\n  - Added info on how to handle problems\n\n0.9.73:\n\n  - Cleaned up weblog code\n  - Refactored weblog templates for easier customization, enabled easy\n    access to all weblog templates through the browser\n\n0.9.72:\n\n  - Fixed bug where WebDAV publishing raised TypeError on strings\n  - Made weblog subscription notification more robust\n  - Made relation listing a bit more robust\n  - Added link back to issue from relation\n  - Fixed bug where issue submitted via a category publisher could end\n    up in the wrong relation\n  - Fixed broken rendering of reStructured text as HTML\n\n0.9.71:\n\n  - Fixed bug where issues in HTML format got wrong encoding\n  - Enabled email subscriptions on weblogs\n  - Fixed bug where text-contents would be cut short, removed\n    option for specifying maximum size for issues\n\n0.9.70:\n\n  - Providing a better interface for importing webpages\n  - Fixed various bugs in web import framework\n  - Web pages are now imported with titles\n  - Implemented support for renaming groups of issues\n  - Made unique id generator a bit more unique\n  - Added RSS feed for context-based filter results\n\n0.9.69:\n\n  - Massive speedups on the local weblog publisher\n\n0.9.68:\n\n  - Made shortcut from tree view to tree publisher, and added some options\n  - Removed issue quick-add\n\n0.9.67:\n\n  - Added From and To header on emails generated by notifications\n  - Added support for importers, and a web page importer\n\n0.9.66:\n\n  - Fixed bug where UnboundLocalError would be raised in check_notifications\n  - Made entire application UTF-8 instead of mix between ISO-8859-1 and UTF-8\n  - Fixed bug where issues in relations were listed as relations\n\n0.9.65:\n\n  - Fixed bug where publishing an issue would raise an IndexError\n  - Added Tree publisher, which publishes issues in a tree form\n\n0.9.64:\n\n  - Implemented Issue Dealer Category publisher (used in for example\n    submission forms)\n  - Implemented Publish button for easy publishing of multiple issues\n  - Fixed bug where local weblog publisher's modified date wasn't\n    updated on edit\n  - Implemented (de)select all checkbox for faster issue and relation\n    selection\n\n0.9.63:\n\n  - Made weblog issues in category and regular search ordered by date\n  - Fixed bug where incorrect inherited hook was called in image.manage_beforeDelete\n\n0.9.62:\n\n  - Added categories to local weblog publisher\n  - Fixed bug where search page template would raise a parse error\n  - Calling OFS.Image's add/delete/clone hooks in custom image implementation\n\n0.9.61:\n\n  - Renamed config.py to id_config.py to prevent naming conflicts with\n    other modules on the win32 platform\n  - Added view link on local weblog publisher\n  - Fixed bug where expanding and collapsing of issues in the tree\n    view wouldn't work properly\n\n0.9.60:\n\n  - Fixed buggy notifications (where leaving the notifications\n    running would hang Zope)\n  - Updated documentation\n  - Re-implemented the browse mode\n  - Added creator to blog entry views\n\n0.9.59:\n\n  - Fixed bug where objects from a collapsed level would be displayed\n    in the tree view\n  - Fixed bug where reported new/changed issues owned would be\n    reported if they were in session\n  - Fixed bug where public_url wouldn't be set automatically in\n    update_catalog\n  - Made the mail notification code more robust (trapping any\n    exceptions raised when sending an email)\n\n0.9.58:\n\n  - Fixed bug where a missing slash on the WebDAV publishing\n    location would raise an IndexError\n  - Added notifications for new and changed issues in session\n  - Implemented support for automatic notification with threading\n  - Created a separate configuration file for application-wide settings\n\n0.9.57:\n\n  - Fixed bug where the save link menus raised a TypeError\n  - Fixed bug where collapsing an issue expanded by level\n    would raise an ValueError\n  - Fixed bug where using previous, next and batch links\n    would break the navigation links\n  - Added batches to browse view\n  - Fixed bug where issue location wouldn't be displayed\n    in the browse view\n  - Fixed bug where expanding the issue tree by level\n    would't work below the issue dealer\n\n0.9.56:\n\n  - Fixed minor bugs related to the new batching algorhitms\n  - Added expand/collapse level controls on tree view\n  - Now removing session-based items from menu for anonymous users\n\n0.9.55:\n\n  - Removed support for CMF (see readme files for more info)\n  - Upgraded HTML editing area\n\n0.9.54:\n\n  - Added support for renaming the weblog (for nice URLs)\n  - Added batching to the weblog entry view and search results\n  - Fixed bug where shared/public access to publishing issues\n    was denied (please set the permissions again for the fix to\n    take effect)\n\n0.9.53:\n\n  - Implemented a full featured test version of the Atom API for the\n    weblog publisher\n\n0.9.52:\n\n  - Fixed bug where add menu wasn't available at the Issue Dealer root\n  - Implemented branching in the tree view\n  - Added RSS feeds of filter results\n\n0.9.51:\n\n  - Implemented rss/atom alternate link on the weblog publisher\n  - Fixed bug where weblog title wasn't escaped properly in feeds\n  - Refactored publisher listing code to its own method\n  - Enabled ZODB customization of blog, blog_entry and search templates\n\n0.9.50:\n\n  - Implemented notifications for new and changed issues\n\n0.9.49:\n\n  - Added an empty contentValues method for Issue Dealer objects\n    which fixes bugs for CMF applications that rely on objects\n    having contentValues defined.\n  - Removed the filter view in CMF as filters can't be created\n    at the moment\n  - Enabled WYSIWYG editing of Issues in CMF\n  - Disabled bug where comments could be posted on the weblog\n    even if they were disabled\n\n0.9.48:\n\n  - Major improvements to the link saving interface, session\n    issues and issues down to a specified level will now be\n    available in the category selection\n\n0.9.47:\n\n  - Fixed bug where it wasn't possible to comment on issues\n    that didn't have 'internal' comments\n  - Enabled HTML rendering of issues in Atom and RSS feeds\n  - Fixed a number of small bugs related to weblog publishers\n    which didn't have a weblog_url defined\n\n0.9.46:\n\n  - Added support for comments on the weblog publisher\n\n0.9.45:\n\n  - Fixed created/modified date bug on weblog publisher\n\n0.9.44:\n\n  - Small tweaks to the design\n  - Re-implemented support for relations in tree view\n  - Refactored object listing code\n  - Re-added ordering capability to the tree view\n  - Code refactoring and cleaning\n\n0.9.43:\n\n  - Added greatly improved link-saver, links can now be\n    edited and saved to a specific category\n  - Updated CSS with proper credits, giving credit where due\n\n0.9.42:\n\n  - Now highlighting issue/relation listing on mouseover\n  - Removed about button in remote\n  - Fixed a number of small bugs in the WebDAV publisher\n  - Removed link adding code pending improved version\n\n0.9.41:\n\n  - Made index view of images protected by View Issue Dealer permission\n  - Improved the editing interfaces for the weblog publisher\n  - Fixed minor CSS bug on the search page\n  - Removed old DTML code from page templates\n  - Fixed character bug where ordering arrows would\n    be rendered as funky signs  \n  - Added atom feeds to the weblog publisher (as atom.xml)\n  - Weblogs are now re-indexed when edited\n  - Implemented full support for weblog url\n  - Fixed long-standing bug where images would disappear\n    from the weblog after a catalog update\n  - Fixed long-standing bug where structured text was\n    rendered as ascii in HTML mode\n  - Removed bundled docutils, using Zope's bundled\n    version instead\n  - Removed dependency on sessions\n\n0.9.40:\n\n  - Added instructions for how to make the Issue Dealer work\n    with a stock CMF site\n  - Fixed and re-enabled the FAQ generator\n  - Added a navigation outline to the tree view, made some\n    tweaks to the layout\n\n0.9.39:\n\n  - Implemented support for relations in CMF/Plone\n  - Fixed minor design bugs introduced by CMF/Plone compatability\n  - Minor tweak to the weblog template, for standards compliance\n  - Fixed URL handling in weblog title\n  - Removed permissions in CMF/Plone (which is handled by state)\n  - Removed addable types in CMF/Plone (there aren't any)\n  - Added edit page for the Issue Dealer instance\n\n0.9.38:\n\n  - First step towards making the Issue Dealer CMF/Plone compatible\n    (basic functionality is now working).\n  - Fixed broken session editing\n\n0.9.37:\n\n  - Small layout tweaks for Opera\n  - Fixed relation listing bug (oddly numbered relations wouldn't\n    show)\n  - Implemented support for changing states for relations\n  - Added relate link on session menu\n  - Only listing the 10 most recent issues in the weblog RSS feed\n\n0.9.36:\n\n  - Refactored code\n  - Fixed bugs related to permissions\n  - Created four levels of permissions and access\n  - Added a page for editing permissions; the Issue\n    Dealer can now used for public (anonymous access)\n\n0.9.35:\n\n  - Added support for the multi-ping service pingomatic.com\n  - Removed tree settings from the settings menu\n  - Added size limit to issues listed in search results\n  - Fixed message display bug\n\n0.9.34:\n\n  - Refactored code\n  - Re-enabled the publisher button\n\n0.9.33:\n\n  - Fixed broken issue editing in issue browsing mode\n  - Fixed broken title on weblog entry view\n  - Fixed broken links on session menu\n  - Refactored code\n  - Fixed broken remote on weblog\n\n0.9.32:\n\n  - Fixed bug on the browse template where contents would\n    be rendered as escaped HTML\n  - Fixed broken filters template\n  - Fixed broken search filters\n\n0.9.31:\n\n  - Fixed bug where session objects were unavailable due\n    to a missing catalog statement\n  - Fixed permissions bugs\n  - Fixed search bug where initial result would be empty\n  - Moved most of the interfaces from DTML to page templates\n  - General code cleanup\n\n0.9.30:\n\n  - Made search defaults more sensible\n  - Fixed bug where URLs containing a + were improperly parsed\n    in text formatted issues\n  - Enabled editing of the entire weblog stylesheet\n  - Added a search interface on the weblog entry view\n  - Added extra CSS classes for blog entries\n\n0.9.29:\n\n  - Merged in the WebDAV Publisher from the Enterprise branch\n\n0.9.28:\n\n  - Fixed show/hide closed button bug on the tree view\n  - Fixed broken rendering of contents in browse mode\n  - Fixed broken image editing in browse mode\n\n0.9.27:\n\n  - Fixed search bug where searching in context with VHMs didn't work\n  - Fixed bug where searching on 'proxied' weblog pages didn't work\n  - Fixed bug where the initial search page wouldn't select\n    all possible owners as specified in the user settings\n  - Fixed bug where creating a new catalog with update_catalog\n    would raise a name error\n  - Added sleep argument to update_catalog method, so that\n    resources aren't hogged if there are a lot of issues\n  - Fixed major index bug that blocked the installation\n  - Fixed broken functional tests\n\n0.9.26:\n\n  - Added timezone to weblog publisher\n  - Added column for indicating whether an issue has been published in\n    the publisher menu\n  - Fixed URL bug for RSS\n\n0.9.25:\n\n  - Many upgrades to the HTML editing screen\n  - Added shortcuts for publishing Issues to local weblogs and WebDAV\n    servers\n  - Removed recent changes action from remote (filters\n    can be used instead)\n\n0.9.24:\n\n  - Fixed typo for sort index Created in settings menu\n  - Created a separate Epoz product for the Issue Dealer,\n    so that it doesn't conflict with products that require\n    stock Epoz\n  - Many upgrades to the HTML editing screen\n\n0.9.23:\n\n  - Integrated the local weblog publisher from the Enterprise branch\n  - Added semicolon as a valid URL character\n    (for rendering text as HTML)\n\n0.9.22:\n\n  - Implemented a browsing mode, suitable for batch\n    reading and batch editing of issues\n\n0.9.21:\n\n  - Did a complete security audit on method permissions\n  - Made application level methods private\n  - Fixed message dialogue bug\n  - Code cleanups\n  - Implemented support for multiple user folders\n  - Added drop-down menu for adding issues\n  - Made width and height for issue editing customizable\n\n0.9.20:\n\n  - Implemented dynamic updates based on class version\n  - Implemented support for placeless images\n\n0.9.19:\n\n  - Fixed broken message handling\n  - Fixed broken image links\n\n0.9.18:\n\n  - Added message to user field in the interface\n  - Implemented relative state in search and filters\n  - Added help text on links in remote, removed old\n    help text setting and text on remote\n  - Fixed relation listing, so that the related object\n    is always shown, whether it's a contained relation\n    or a remote one\n  - Fixed broken interface for adding Issue Dealers\n  - Fixed broken HTML editing with Zope on Windows\n  - Improved all listings with application-wide CSS\n  - Added more functional tests\n  - Added about page\n\n0.9.17:\n\n  - Fixed bug where minutes was mixed up with months on\n    date displays.\n  - Fixed ignored state bug in issue search\n\n0.9.16:\n\n  - Added drop down menu for filters, refactored javascript\n    and HTML headers.\n\n0.9.15:\n\n  - Refactored the HTML cleanup code to a separate product\n  - Fixed broken format switching for issues\n  - Made issue textarea font fixed width\n\n0.9.14:\n\n  - Integrated the WYSIWYG editor from the Enterprise branch\n\n0.9.13:\n\n  - Did a full security audit on the code\n  - Made some of the issue attributes optional in the basic view\n  - Implemented a Javascript drop down menu for sessions\n\n0.9.12:\n\n  - Refactored relations\n  - Integrated the weblog publisher from the Enterprise branch\n\n0.9.11:\n\n  - Integrated search filters from the Enterprise branch\n  - Minor CSS tweaks\n\n0.9.10:\n\n  - Implemented search ranking by word score\n  - Fixed typo bug in change state\n  - Fixed rendering of text formatted issues\n  - Improved tree navigation\n  - Improved functional testing\n\n0.9.9:\n\n  - Layout tweaks, for Opera\n  - Refactoring of code\n  - Implemented new scheme for modification time\n  - Color tweaks\n  - Changing navigation behaviour on tree browsing\n  - Redesigning layout on settings page\n\n0.9.8:\n\n  - Fixed settings bug\n  - Improved functional testing\n  - Layout tweaks\n  - Implemented ordering of Issues, in basic and tree view\n  - Implemented setting for sorting of Issues\n\n0.9.7:\n\n  - XHTML cleanup\n  - Removed context navigation from session\n  - Improvements to the search interface\n\n0.9.6:\n\n  - Minor layout tweaks\n  - Removed shortening of titles (broken javascript)\n  - Implemented two-way relations\n  - Added splitter to ZCTextIndex lexicon (see upgrade.txt for more info)\n  - Add Issue button now available on the instance root\n\n0.9.5:\n\n  - Fixed layout in session folder\n  - Added open, close, suspend and discard buttons\n    on the session view\n\n0.9.4:\n\n  - Made the Issue Dealer compatible with Zope instances\n    on RedHat and Debian systems\n  - Layout tweaks\n  - Added shortcuts on session listing\n  - Search results can be sorted by creation time\n  - Fixed broken relation of objects\n\n0.9.3:\n\n  - Made the issue listing in session wider\n  - Updated URL indexing so that it works with \n    Virtual Host Monsters\n  - ZC Text Index is now used as the text index,\n    providing more relevant results on text searches\n  - Made the truncation size for issues user-definable,\n    fixed broken less/more links on issues\n\n0.9.2:\n\n  - Fixed HTML error on search page\n  - Minor tweaks to the layout\n  - Cleaned up CSS\n\n0.9.1:\n\n  - Renamed product to Issue Dealer\n  - Fixed font weight for relation listing\n  - Major improvements to the layout\n  - Moved relation handling to session page\n  - Searching through all types of Issues by default\n\n0.9.0:\n\n  - Major improvements to the interface\n  - Added buttons for quick and multiple editing\n  - Fixed relation adding bug\n\n0.8.18:\n\n  - Implemented support for relations in the tree view\n  - Tweaks on the layout\n  - Made default owner in search configurable\n  - Cleaned up HTML output from docutils\n\n0.8.17:\n\n  - Added menu for quick access to tracked (marked) issues\n  - Added simpler way of relating issues\n  - Added path index to index list, and a test for the bug\n  - Fixed broken tests\n\n0.8.16:\n\n  - Added preference for rendering the entire Issue by default\n  - Made the Issue editing textarea 'higher'\n  - Added different buttons for saving & viewing and\n    saving & continuing to edit\n  - Removed the IssueManager product\n\n0.8.15:\n\n  - Added shortcuts for adding and editing in the tree view\n  - Renamed the project from Issue Manager to Issue Handler, due\n    to Trademark issues\n\n0.8.14:\n\n  - Added ability to search based on Issue owner\n\n0.8.13:\n\n  - Fixed broken handling of preferences\n\n0.8.12:\n\n  - Added unittests for most classes and methods\n  - Added functional tests\n  - Added owner to issue listing \n  - Refactored user settings architecture\n  - Added modification time to search results\n\n0.8.11:\n\n  - Made context search the default\n  - Upgraded example, which was broken on Zope 2.6.x\n\n0.8.10:\n\n  - Improvements to the search interface\n  - Fixed bug for editing session issues\n  - Refactored recent changes page\n  - Refactored code\n\n0.8.9:\n\n  - Fixed minor layout bug in session remote\n  - Fixed bug for listing session issues\n\n0.8.8:\n\n  - Implemented relations\n  - Added button for recent changes in session remote\n\n0.8.7:\n\n  - Added handling of broken text (UnicodeError) in Issues\n  - Added recent changes page\n\n0.8.6:\n\n  - Remembering what kinds of Issues the user is browsing (open or\n    non-open), usability.\n  - Experimenting with behaviour of remote in suspended Issues\n  - Changed the way Issues are listed in sessions\n  - Changed the layout for issue editing\n\n0.8.5.1:\n\n  - Fixed bug that appeared when listing open issues in tree view\n\n0.8.5:\n\n  - HTML-quoted the contents of Issues listed in searchresults\n  - Partially implemented suspended state\n\n0.8.4.1:\n\n  - Fixed minor bug related to session folder creation\n\n0.8.4:\n\n  - Refactored lots of code\n  - Implemented relative state\n  - Implemented session folder and better session handling", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://issuedealer.com", "keywords": "python zope2 cms", "license": "GPL", "maintainer": null, "maintainer_email": null, "name": "Products.IssueDealer", "package_url": "https://pypi.org/project/Products.IssueDealer/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/Products.IssueDealer/", "project_urls": {"Download": "UNKNOWN", "Homepage": "http://issuedealer.com"}, "release_url": "https://pypi.org/project/Products.IssueDealer/0.9.140/", "requires_dist": null, "requires_python": null, "summary": "The Issue Dealer is an application for managing information. It is currently used by organizations and individuals to manage day-to-day tasks and information.", "version": "0.9.140", "yanked": false, "html_description": "<div class=\"project-description\">\n            What is it?<br><br>  The Issue Dealer is a tool for managing issues, currently<br>  it focuses on the information in, and structuring of, issues.<br><br>  It can be used as a generic issue tracker, a knowledge management<br>  tool, a weblog or an outliner.<br><br>  It also contains an experimental framework for creating content<br>  classes through the web.<br><br>  It has been tested to work with 2.13.22 but is believed to<br>  work with older versions of Zope as well.<br><br>Why have you created it?<br><br>  Initially the company I work for (Nidelven IT) needed a tool that<br>  could help organize and share information.  It started as a basic<br>  'folder and document' archive on my computer, now it's evolving<br>  into an advanced (but simple to use!) information management and<br>  distribution system.<br><br>  Some years ago I took it over as a personal project, and since I've<br>  spent so much time on it already and it works well for its purpose<br>  and that the LAF system is interesting, I'm going to keep updating<br>  it. I don't know what the future for Zope 2 will be, but seeing how<br>  different systems can survive I wouldn't be surprised if Zope 2 is<br>  well maintained 5-10 years down the road.<br><br>Why is it free?<br><br>  It started out free, and distributing it under the GPL version 2 is<br>  practical, as it is a well-known software license .<br><br>  I'd like to start a community around this application eventually, so<br>  if you think this is an interesting application, get in touch and<br>  maybe we can do something together.<br><br>How are you developing it?<br><br>  The project has recently been moved to GitHub, and will be located<br>  there for the forseeable future.  Bug-tracking etc. hasn't been<br>  setup, but emails and patches are welcome, as are suggestions on<br>  where to manage the project from.<br><br>What happens next?<br><br>  The focus for the 1.0 release is to make the application manage<br>  information, the focus for the 2.0 release is a complete LAF<br>  system.<br><br>Is it secure?<br><br>  Yes and no.  It is has been built so that access can be restricted<br>  to different features and levels, but once someone has access to<br>  viewing, adding, editing or something else, you should assume that<br>  they can access any part of the system.<br><br>Does it scale?<br><br>  Probably not.  This product is primarily focused on small groups of<br>  people, and hasn't been stress-tested with big groups of users.<br><br>What are the main features?<br><br>  The main features of the Issue Dealer are:<br><br>    Issue Tracking<br><br>      - Tracks issues which can be of the type goal, idea, info,<br>        problem, question and undefined<br><br>      - Can notify users of new issues or changes to issues assigned<br>        to them<br><br>    Information management<br><br>      - Enables structuring and searching of data<br><br>      - Advanced search, with saved searches (filters)<br><br>    Publishing<br><br>      - A weblog publisher<br><br>        - Can publish issues to other weblogs<br><br>      - A local weblog publisher<br><br>        - Acts as a weblog server<br><br>        - Supports Atom-enabled clients<br><br>        - Enables many forms of subscriptions, through Atom as well as<br>          email<br><br>      - WebDAV publisher<br><br>        - Can publish issues along with their images to WebDAV-enabled<br>          servers<br><br>      - FAQ publisher<br><br>        - Generates FAQs based on questions and solutions<br><br>      - Category publisher<br><br>        - Publishes issues as categories; these categories can in turn<br>          be used in feedback forms on websites, as the publisher<br>          accepts incoming issues as well<br><br>      - Tree publisher<br><br>        - Publishes and issues and its contents to a given URL as a<br>          static page<br><br>    Advanced HTML/CSS interface<br><br>      - Many different views of issues in simple interfaces making the<br>        issues easy to work with<br><br>      - WYSIWYG editing with support for images<br><br><br>0.9.133- (2015-02-12)<br><br>  - Various fixes to make IssueDealer work.<br><br>0.9.132 (2015-02-12)<br><br>  - Making the IssueDealer Zope 2.13.22 compatible.<br><br>  - Fixing bug where atom feed failed.<br><br>  - Fixing bug where creating an IssueDealer instance failed.<br><br>  - Updated readme.<br><br>  - Updated copyright time.<br><br>0.9.131 (2012-08-22)<br><br>  - Fixing bug where KeyError was raised under update_catalog<br><br>  - Fixing bug where AttributeError was raised under update_catalog<br><br>  - Fixing hyperlinking of URLs in text issues, adding $ as part of a<br>    valid URL<br><br>  - Disabling advanced search<br><br>0.9.130 (2012-08-22)<br><br>  - Re-enabling various issue formats<br>  - Sorting issues in weblog atom feed based on modification date<br>  - Adding try-except for enclosures in atom feed<br>  - Escaping HTML entities in weblog for atom feed<br><br>0.9.129:<br><br>  - Repackaging as an egg for dependant packages<br>  - Fixing CatalogAware imports<br>  - Making use of ZCTextIndex instead of TextIndex<br>  - Adding stub utilities.hyperlink_urls method<br>  - Added separate tools to hide/display issue info<br>  - Disabled changing issue format (conversion tools broken)<br>  - Disabled HTML editing (editor broken)<br><br>0.9.128:<br><br>  - Experimenting with various changes<br>  - Implemented lightweight application framework<br><br>0.9.127:<br><br>  - Added method for generating nonces<br>  - Added experimental search interface<br><br>0.9.126:<br><br>  - Fixed bug where verification of email wouldn't work<br>  - Fixing up on Epoz<br><br>0.9.125:<br><br>  - Fixed bug where searching for the word \"zope\"<br>    would return all issues.<br>  - Adding count for contained action issues in<br>    calendar listings<br>  - Making IssueDealerEpoz forwards compatible,<br>    with Zope 2.11<br>  - Fixed bug where it wasn't possible to add<br>    multiple issues<br>  - Fixed render_owner bug in session index<br><br>0.9.124:<br><br>  - Added issue past due date to notification email<br>  - Added documentation on how to setup notifications<br>  - Implemented past due date listing of events<br><br>0.9.123:<br><br>  - Fixed bug where search_string wasn't found (due to<br>    double ??)<br>  - Fixed bug where some URLs included in a text were<br>    not detected properly<br><br>0.9.122:<br><br>  - Changed things around so that issues can have<br>    multiple owners<br>  - Implemented support for setting owner on incoming<br>    mail issues<br><br>0.9.121:<br><br>  - Added support for removing and adding tags to<br>    multiple issues at once.<br>  - Fixed bug where mail messages going through<br>    verification lost their from info.<br><br>0.9.120:<br><br>  - Added support for tagging incoming issues through<br>    the mail handler.<br><br>0.9.119:<br><br>  - Added ability to reschedule events directly in the<br>    calendar view<br><br>0.9.118:<br><br>  - Implemented filter for viewing owned/unowned issues<br>    on the calendar view<br>  - Made calendar view remember the date range viewed<br>    when changing display preferences<br><br>0.9.117:<br><br>  - Fixed bug where transforming the format of<br>    non-action issues would raise a KeyError<br><br>0.9.116:<br><br>  - Fixed bug where regular (non-action) issues would<br>    pop-up a message about non-existing calendars<br><br>0.9.115:<br><br>  - Added calendar selection widget for due dates<br>  - Fixed bug where due with either hour or minute<br>    set to 0 would remove all time/hour information<br><br>0.9.114:<br><br>  - Making upgrades from \"very old\" versions of<br>    the Issue Dealer possible<br>  - Removed try/except in catalog_update so that<br>    we can get told what's wrong<br>  - Implemented calendar view (for action items with due date)<br><br>0.9.113:<br><br>  - Cleaning up print statements<br>  - Fixed RDF bug on filter listing<br>  - Implemented full support for tags<br>  - Fixed bug where users couldn't validate their email<br><br>0.9.112:<br><br>  - Updated copyright period on footer<br>  - Added tag support to issues<br>  - Fixed bug where HTML mail messages were stored<br>    without to/cc<br>  - Added cleaning of incoming HTML messages<br>  - Overriding AbstractFormatter to format &lt;br /&gt;<br>    tags properly in text<br>  - Added feedparser for paranoid cleaning of HTML<br>  - Implemented spam protection scheme for mail handler<br><br>0.9.111:<br><br>  - Minor fixes for escaping HTML content in the mail handler<br>  - Implemented threading support for mail handling<br>  - Implemented skipping of sending of messages to recipients<br>    already on To/Cc<br><br>0.9.110:<br><br>  - Made the Issue Dealer work with non-standard product locations<br>  - Implemented mail gateway (mailing list/mail archive interface)<br><br>0.9.109:<br><br>  - Removed the undefined issue type, replacing it with info<br>  - Fixed bug where update_catalog would choke on images without<br>    callable ids.<br><br>0.9.108:<br><br>  - Added ability to strip &lt;script&gt; tags when importing webpages<br>  - Fixed bug where missing objects would raise IndexError in the <br>    tree_view<br><br>0.9.107:<br><br>  - Improved last_modified_by code.<br>  - Fixed numerous bugs related to security<br><br>0.9.106:<br><br>  - Added email notifications users who (un)subscribe to the weblog<br>  - Added last modified by attribute to issues<br><br>0.9.105:<br><br>  - Removed old, redundant code<br>  - Removed the alternative type<br>  - Made session related issues directly add/editable<br>  - Improved the exporting/importing of issues<br>  - Fixed relation listing bug<br>  - Re-fixed bug where notifications failed because of<br>    a wrong set of arguments to display function<br><br>0.9.104:<br><br>  - Made relations able to carry dependencies between issues<br><br>0.9.103:<br><br>  - Added option where errors in notifications aren't swallowed<br><br>0.9.102:<br><br>  - Fixed bug where closing issues containing files would raise a RuntimeError<br><br>0.9.101:<br><br>  - Fixed bug where notifications didn't work properly<br>  - Added more functional tests<br><br>0.9.100:<br><br>  - Fixed bug where catalog creation didn't work correctly<br><br>0.9.99:<br><br>  - Major code improvements and cleanups<br>  - Added restrictions on who's able to rename issues and relations<br>  - Removed RSS links on local weblog publisher<br>  - Added information on how to install mxTidy<br>  - Improved functional tests<br>  - Fixed bug where iframe support was incorrectly determined<br>  - Removed all traces of RSS, using RDF instead<br>  - Added screen for viewing weblog subscribers<br><br>0.9.98:<br><br>  - Added a new screen for adding relations interactively<br>  - Improved handling of comments on the weblog (they are now searchable)<br><br>0.9.97:<br><br>  - Fixed bug where issue tree was rendered unusable<br>  - Fixed unauthorized bug on local weblog publisher blog entry<br><br>0.9.96:<br><br>  - Updated copyright notice<br>  - Refactored code, removed old code<br>  - Made anonymous views much easier on the database<br>  - Removed old update code<br>  - Removed code that requires database writes when<br>    viewing objects<br>  - Plugged potential security hole in the local weblog publisher<br><br>0.9.95:<br><br>  - Removed old Epoz/Plone cruft<br>  - Updated code so that all warnings are removed<br>  - Cleaned up code<br>  - Starting support for Five/CMF<br><br>0.9.94:<br><br>  - Added feedback to rename view if input is missing.<br>  - Various minor template tweaks<br>  - Various improvements to the weblog comment handling<br>  - Fixed bug where settings page was not viewable under relations<br>    in local_weblog_publisher<br><br>0.9.93:<br><br>  - Updated atom feed, to version 1.0<br>  - Added support for enclosures<br>  - Added access keys (s for search, a for add, e for edit)<br><br>0.9.92:<br><br>  - Fixed bug where running update_catalog would encode content<br>    the wrong way.<br><br>0.9.91:<br><br>  - Added ability to add files directly when editing issues<br>  - Added support for publishing files through the weblog publisher<br><br>0.9.90:<br><br>  - Added ability to filter atom feeds with category<br><br>0.9.89:<br><br>  - Several fixes related to public access<br>  - Added ability to add multiple issues at once<br><br>0.9.88:<br><br>  - Refactored code<br>  - Added ID to issue details<br>  - Fixed bug where publishing issues via the publish button would<br>    raise an AttributeError<br><br>0.9.87:<br><br>  - Added ability to strip tags out of imported web pages<br>  - Fixed full view ability bug on root<br>  - Fixed bug where goal a level down would raise AttributeError if<br>    re-opened<br>  - Fixed bug where large imports would fail with an AttributeError<br><br>0.9.86:<br><br>  - Added due date to action issues<br>  - Minor tweaks to issue layout<br><br>0.9.85:<br><br>  - Layout tweaks, reorganizing navigation bar<br>  - Enabled renaming of the category publisher<br>  - Making publishing of multiple issues from root possible<br><br>0.9.84:<br><br>  - Enabled full screen view of issue contents<br>  - Added passphrase protection scheme to weblog comments<br><br>0.9.83:<br><br>  - Modified link saver to enable browsing to destination category<br>  - Fixed broken permissions page<br>  - Removed link category level options on settings page<br>  - Fixed bug where broken image tags would raise an error when<br>    editing issues<br><br>0.9.82:<br><br>  - Added support for viewing issue contents embedded in iframes<br>  - Refactored permissions into a separate module<br><br>0.9.81:<br><br>  - Implemented asynchronous pings on the weblog<br><br>0.9.80:<br><br>  - Implemented XML import/export feature for issues and relations<br><br>0.9.79:<br><br>  - Relicensed the Issue Dealer to GPL license<br><br>0.9.78:<br><br>  - Added category interface for the weblog publisher<br><br>0.9.77:<br><br>  - Added build options on the UNIX installer so that Issue Dealer<br>    should run smoothly on *BSD and Mac OS X<br>  - Search results are now more sensitive to context<br><br>0.9.76:<br><br>  - Fixed bug where emails sent to weblog subscribers would be<br>    rendered incorrectly<br>  - Made IssueDealer compatible with Zope 2.8<br><br>0.9.75:<br><br>  - Fixed bug where TypeError would be raised in local weblog<br>    publisher on direct issue publishing<br>  - Added ability to upload files<br><br>0.9.74:<br><br>  - Added option to delete catalog<br>  - Cleaned up text files<br>  - Added info on how to handle problems<br><br>0.9.73:<br><br>  - Cleaned up weblog code<br>  - Refactored weblog templates for easier customization, enabled easy<br>    access to all weblog templates through the browser<br><br>0.9.72:<br><br>  - Fixed bug where WebDAV publishing raised TypeError on strings<br>  - Made weblog subscription notification more robust<br>  - Made relation listing a bit more robust<br>  - Added link back to issue from relation<br>  - Fixed bug where issue submitted via a category publisher could end<br>    up in the wrong relation<br>  - Fixed broken rendering of reStructured text as HTML<br><br>0.9.71:<br><br>  - Fixed bug where issues in HTML format got wrong encoding<br>  - Enabled email subscriptions on weblogs<br>  - Fixed bug where text-contents would be cut short, removed<br>    option for specifying maximum size for issues<br><br>0.9.70:<br><br>  - Providing a better interface for importing webpages<br>  - Fixed various bugs in web import framework<br>  - Web pages are now imported with titles<br>  - Implemented support for renaming groups of issues<br>  - Made unique id generator a bit more unique<br>  - Added RSS feed for context-based filter results<br><br>0.9.69:<br><br>  - Massive speedups on the local weblog publisher<br><br>0.9.68:<br><br>  - Made shortcut from tree view to tree publisher, and added some options<br>  - Removed issue quick-add<br><br>0.9.67:<br><br>  - Added From and To header on emails generated by notifications<br>  - Added support for importers, and a web page importer<br><br>0.9.66:<br><br>  - Fixed bug where UnboundLocalError would be raised in check_notifications<br>  - Made entire application UTF-8 instead of mix between ISO-8859-1 and UTF-8<br>  - Fixed bug where issues in relations were listed as relations<br><br>0.9.65:<br><br>  - Fixed bug where publishing an issue would raise an IndexError<br>  - Added Tree publisher, which publishes issues in a tree form<br><br>0.9.64:<br><br>  - Implemented Issue Dealer Category publisher (used in for example<br>    submission forms)<br>  - Implemented Publish button for easy publishing of multiple issues<br>  - Fixed bug where local weblog publisher's modified date wasn't<br>    updated on edit<br>  - Implemented (de)select all checkbox for faster issue and relation<br>    selection<br><br>0.9.63:<br><br>  - Made weblog issues in category and regular search ordered by date<br>  - Fixed bug where incorrect inherited hook was called in image.manage_beforeDelete<br><br>0.9.62:<br><br>  - Added categories to local weblog publisher<br>  - Fixed bug where search page template would raise a parse error<br>  - Calling OFS.Image's add/delete/clone hooks in custom image implementation<br><br>0.9.61:<br><br>  - Renamed config.py to id_config.py to prevent naming conflicts with<br>    other modules on the win32 platform<br>  - Added view link on local weblog publisher<br>  - Fixed bug where expanding and collapsing of issues in the tree<br>    view wouldn't work properly<br><br>0.9.60:<br><br>  - Fixed buggy notifications (where leaving the notifications<br>    running would hang Zope)<br>  - Updated documentation<br>  - Re-implemented the browse mode<br>  - Added creator to blog entry views<br><br>0.9.59:<br><br>  - Fixed bug where objects from a collapsed level would be displayed<br>    in the tree view<br>  - Fixed bug where reported new/changed issues owned would be<br>    reported if they were in session<br>  - Fixed bug where public_url wouldn't be set automatically in<br>    update_catalog<br>  - Made the mail notification code more robust (trapping any<br>    exceptions raised when sending an email)<br><br>0.9.58:<br><br>  - Fixed bug where a missing slash on the WebDAV publishing<br>    location would raise an IndexError<br>  - Added notifications for new and changed issues in session<br>  - Implemented support for automatic notification with threading<br>  - Created a separate configuration file for application-wide settings<br><br>0.9.57:<br><br>  - Fixed bug where the save link menus raised a TypeError<br>  - Fixed bug where collapsing an issue expanded by level<br>    would raise an ValueError<br>  - Fixed bug where using previous, next and batch links<br>    would break the navigation links<br>  - Added batches to browse view<br>  - Fixed bug where issue location wouldn't be displayed<br>    in the browse view<br>  - Fixed bug where expanding the issue tree by level<br>    would't work below the issue dealer<br><br>0.9.56:<br><br>  - Fixed minor bugs related to the new batching algorhitms<br>  - Added expand/collapse level controls on tree view<br>  - Now removing session-based items from menu for anonymous users<br><br>0.9.55:<br><br>  - Removed support for CMF (see readme files for more info)<br>  - Upgraded HTML editing area<br><br>0.9.54:<br><br>  - Added support for renaming the weblog (for nice URLs)<br>  - Added batching to the weblog entry view and search results<br>  - Fixed bug where shared/public access to publishing issues<br>    was denied (please set the permissions again for the fix to<br>    take effect)<br><br>0.9.53:<br><br>  - Implemented a full featured test version of the Atom API for the<br>    weblog publisher<br><br>0.9.52:<br><br>  - Fixed bug where add menu wasn't available at the Issue Dealer root<br>  - Implemented branching in the tree view<br>  - Added RSS feeds of filter results<br><br>0.9.51:<br><br>  - Implemented rss/atom alternate link on the weblog publisher<br>  - Fixed bug where weblog title wasn't escaped properly in feeds<br>  - Refactored publisher listing code to its own method<br>  - Enabled ZODB customization of blog, blog_entry and search templates<br><br>0.9.50:<br><br>  - Implemented notifications for new and changed issues<br><br>0.9.49:<br><br>  - Added an empty contentValues method for Issue Dealer objects<br>    which fixes bugs for CMF applications that rely on objects<br>    having contentValues defined.<br>  - Removed the filter view in CMF as filters can't be created<br>    at the moment<br>  - Enabled WYSIWYG editing of Issues in CMF<br>  - Disabled bug where comments could be posted on the weblog<br>    even if they were disabled<br><br>0.9.48:<br><br>  - Major improvements to the link saving interface, session<br>    issues and issues down to a specified level will now be<br>    available in the category selection<br><br>0.9.47:<br><br>  - Fixed bug where it wasn't possible to comment on issues<br>    that didn't have 'internal' comments<br>  - Enabled HTML rendering of issues in Atom and RSS feeds<br>  - Fixed a number of small bugs related to weblog publishers<br>    which didn't have a weblog_url defined<br><br>0.9.46:<br><br>  - Added support for comments on the weblog publisher<br><br>0.9.45:<br><br>  - Fixed created/modified date bug on weblog publisher<br><br>0.9.44:<br><br>  - Small tweaks to the design<br>  - Re-implemented support for relations in tree view<br>  - Refactored object listing code<br>  - Re-added ordering capability to the tree view<br>  - Code refactoring and cleaning<br><br>0.9.43:<br><br>  - Added greatly improved link-saver, links can now be<br>    edited and saved to a specific category<br>  - Updated CSS with proper credits, giving credit where due<br><br>0.9.42:<br><br>  - Now highlighting issue/relation listing on mouseover<br>  - Removed about button in remote<br>  - Fixed a number of small bugs in the WebDAV publisher<br>  - Removed link adding code pending improved version<br><br>0.9.41:<br><br>  - Made index view of images protected by View Issue Dealer permission<br>  - Improved the editing interfaces for the weblog publisher<br>  - Fixed minor CSS bug on the search page<br>  - Removed old DTML code from page templates<br>  - Fixed character bug where ordering arrows would<br>    be rendered as funky signs  <br>  - Added atom feeds to the weblog publisher (as atom.xml)<br>  - Weblogs are now re-indexed when edited<br>  - Implemented full support for weblog url<br>  - Fixed long-standing bug where images would disappear<br>    from the weblog after a catalog update<br>  - Fixed long-standing bug where structured text was<br>    rendered as ascii in HTML mode<br>  - Removed bundled docutils, using Zope's bundled<br>    version instead<br>  - Removed dependency on sessions<br><br>0.9.40:<br><br>  - Added instructions for how to make the Issue Dealer work<br>    with a stock CMF site<br>  - Fixed and re-enabled the FAQ generator<br>  - Added a navigation outline to the tree view, made some<br>    tweaks to the layout<br><br>0.9.39:<br><br>  - Implemented support for relations in CMF/Plone<br>  - Fixed minor design bugs introduced by CMF/Plone compatability<br>  - Minor tweak to the weblog template, for standards compliance<br>  - Fixed URL handling in weblog title<br>  - Removed permissions in CMF/Plone (which is handled by state)<br>  - Removed addable types in CMF/Plone (there aren't any)<br>  - Added edit page for the Issue Dealer instance<br><br>0.9.38:<br><br>  - First step towards making the Issue Dealer CMF/Plone compatible<br>    (basic functionality is now working).<br>  - Fixed broken session editing<br><br>0.9.37:<br><br>  - Small layout tweaks for Opera<br>  - Fixed relation listing bug (oddly numbered relations wouldn't<br>    show)<br>  - Implemented support for changing states for relations<br>  - Added relate link on session menu<br>  - Only listing the 10 most recent issues in the weblog RSS feed<br><br>0.9.36:<br><br>  - Refactored code<br>  - Fixed bugs related to permissions<br>  - Created four levels of permissions and access<br>  - Added a page for editing permissions; the Issue<br>    Dealer can now used for public (anonymous access)<br><br>0.9.35:<br><br>  - Added support for the multi-ping service pingomatic.com<br>  - Removed tree settings from the settings menu<br>  - Added size limit to issues listed in search results<br>  - Fixed message display bug<br><br>0.9.34:<br><br>  - Refactored code<br>  - Re-enabled the publisher button<br><br>0.9.33:<br><br>  - Fixed broken issue editing in issue browsing mode<br>  - Fixed broken title on weblog entry view<br>  - Fixed broken links on session menu<br>  - Refactored code<br>  - Fixed broken remote on weblog<br><br>0.9.32:<br><br>  - Fixed bug on the browse template where contents would<br>    be rendered as escaped HTML<br>  - Fixed broken filters template<br>  - Fixed broken search filters<br><br>0.9.31:<br><br>  - Fixed bug where session objects were unavailable due<br>    to a missing catalog statement<br>  - Fixed permissions bugs<br>  - Fixed search bug where initial result would be empty<br>  - Moved most of the interfaces from DTML to page templates<br>  - General code cleanup<br><br>0.9.30:<br><br>  - Made search defaults more sensible<br>  - Fixed bug where URLs containing a + were improperly parsed<br>    in text formatted issues<br>  - Enabled editing of the entire weblog stylesheet<br>  - Added a search interface on the weblog entry view<br>  - Added extra CSS classes for blog entries<br><br>0.9.29:<br><br>  - Merged in the WebDAV Publisher from the Enterprise branch<br><br>0.9.28:<br><br>  - Fixed show/hide closed button bug on the tree view<br>  - Fixed broken rendering of contents in browse mode<br>  - Fixed broken image editing in browse mode<br><br>0.9.27:<br><br>  - Fixed search bug where searching in context with VHMs didn't work<br>  - Fixed bug where searching on 'proxied' weblog pages didn't work<br>  - Fixed bug where the initial search page wouldn't select<br>    all possible owners as specified in the user settings<br>  - Fixed bug where creating a new catalog with update_catalog<br>    would raise a name error<br>  - Added sleep argument to update_catalog method, so that<br>    resources aren't hogged if there are a lot of issues<br>  - Fixed major index bug that blocked the installation<br>  - Fixed broken functional tests<br><br>0.9.26:<br><br>  - Added timezone to weblog publisher<br>  - Added column for indicating whether an issue has been published in<br>    the publisher menu<br>  - Fixed URL bug for RSS<br><br>0.9.25:<br><br>  - Many upgrades to the HTML editing screen<br>  - Added shortcuts for publishing Issues to local weblogs and WebDAV<br>    servers<br>  - Removed recent changes action from remote (filters<br>    can be used instead)<br><br>0.9.24:<br><br>  - Fixed typo for sort index Created in settings menu<br>  - Created a separate Epoz product for the Issue Dealer,<br>    so that it doesn't conflict with products that require<br>    stock Epoz<br>  - Many upgrades to the HTML editing screen<br><br>0.9.23:<br><br>  - Integrated the local weblog publisher from the Enterprise branch<br>  - Added semicolon as a valid URL character<br>    (for rendering text as HTML)<br><br>0.9.22:<br><br>  - Implemented a browsing mode, suitable for batch<br>    reading and batch editing of issues<br><br>0.9.21:<br><br>  - Did a complete security audit on method permissions<br>  - Made application level methods private<br>  - Fixed message dialogue bug<br>  - Code cleanups<br>  - Implemented support for multiple user folders<br>  - Added drop-down menu for adding issues<br>  - Made width and height for issue editing customizable<br><br>0.9.20:<br><br>  - Implemented dynamic updates based on class version<br>  - Implemented support for placeless images<br><br>0.9.19:<br><br>  - Fixed broken message handling<br>  - Fixed broken image links<br><br>0.9.18:<br><br>  - Added message to user field in the interface<br>  - Implemented relative state in search and filters<br>  - Added help text on links in remote, removed old<br>    help text setting and text on remote<br>  - Fixed relation listing, so that the related object<br>    is always shown, whether it's a contained relation<br>    or a remote one<br>  - Fixed broken interface for adding Issue Dealers<br>  - Fixed broken HTML editing with Zope on Windows<br>  - Improved all listings with application-wide CSS<br>  - Added more functional tests<br>  - Added about page<br><br>0.9.17:<br><br>  - Fixed bug where minutes was mixed up with months on<br>    date displays.<br>  - Fixed ignored state bug in issue search<br><br>0.9.16:<br><br>  - Added drop down menu for filters, refactored javascript<br>    and HTML headers.<br><br>0.9.15:<br><br>  - Refactored the HTML cleanup code to a separate product<br>  - Fixed broken format switching for issues<br>  - Made issue textarea font fixed width<br><br>0.9.14:<br><br>  - Integrated the WYSIWYG editor from the Enterprise branch<br><br>0.9.13:<br><br>  - Did a full security audit on the code<br>  - Made some of the issue attributes optional in the basic view<br>  - Implemented a Javascript drop down menu for sessions<br><br>0.9.12:<br><br>  - Refactored relations<br>  - Integrated the weblog publisher from the Enterprise branch<br><br>0.9.11:<br><br>  - Integrated search filters from the Enterprise branch<br>  - Minor CSS tweaks<br><br>0.9.10:<br><br>  - Implemented search ranking by word score<br>  - Fixed typo bug in change state<br>  - Fixed rendering of text formatted issues<br>  - Improved tree navigation<br>  - Improved functional testing<br><br>0.9.9:<br><br>  - Layout tweaks, for Opera<br>  - Refactoring of code<br>  - Implemented new scheme for modification time<br>  - Color tweaks<br>  - Changing navigation behaviour on tree browsing<br>  - Redesigning layout on settings page<br><br>0.9.8:<br><br>  - Fixed settings bug<br>  - Improved functional testing<br>  - Layout tweaks<br>  - Implemented ordering of Issues, in basic and tree view<br>  - Implemented setting for sorting of Issues<br><br>0.9.7:<br><br>  - XHTML cleanup<br>  - Removed context navigation from session<br>  - Improvements to the search interface<br><br>0.9.6:<br><br>  - Minor layout tweaks<br>  - Removed shortening of titles (broken javascript)<br>  - Implemented two-way relations<br>  - Added splitter to ZCTextIndex lexicon (see upgrade.txt for more info)<br>  - Add Issue button now available on the instance root<br><br>0.9.5:<br><br>  - Fixed layout in session folder<br>  - Added open, close, suspend and discard buttons<br>    on the session view<br><br>0.9.4:<br><br>  - Made the Issue Dealer compatible with Zope instances<br>    on RedHat and Debian systems<br>  - Layout tweaks<br>  - Added shortcuts on session listing<br>  - Search results can be sorted by creation time<br>  - Fixed broken relation of objects<br><br>0.9.3:<br><br>  - Made the issue listing in session wider<br>  - Updated URL indexing so that it works with <br>    Virtual Host Monsters<br>  - ZC Text Index is now used as the text index,<br>    providing more relevant results on text searches<br>  - Made the truncation size for issues user-definable,<br>    fixed broken less/more links on issues<br><br>0.9.2:<br><br>  - Fixed HTML error on search page<br>  - Minor tweaks to the layout<br>  - Cleaned up CSS<br><br>0.9.1:<br><br>  - Renamed product to Issue Dealer<br>  - Fixed font weight for relation listing<br>  - Major improvements to the layout<br>  - Moved relation handling to session page<br>  - Searching through all types of Issues by default<br><br>0.9.0:<br><br>  - Major improvements to the interface<br>  - Added buttons for quick and multiple editing<br>  - Fixed relation adding bug<br><br>0.8.18:<br><br>  - Implemented support for relations in the tree view<br>  - Tweaks on the layout<br>  - Made default owner in search configurable<br>  - Cleaned up HTML output from docutils<br><br>0.8.17:<br><br>  - Added menu for quick access to tracked (marked) issues<br>  - Added simpler way of relating issues<br>  - Added path index to index list, and a test for the bug<br>  - Fixed broken tests<br><br>0.8.16:<br><br>  - Added preference for rendering the entire Issue by default<br>  - Made the Issue editing textarea 'higher'<br>  - Added different buttons for saving &amp; viewing and<br>    saving &amp; continuing to edit<br>  - Removed the IssueManager product<br><br>0.8.15:<br><br>  - Added shortcuts for adding and editing in the tree view<br>  - Renamed the project from Issue Manager to Issue Handler, due<br>    to Trademark issues<br><br>0.8.14:<br><br>  - Added ability to search based on Issue owner<br><br>0.8.13:<br><br>  - Fixed broken handling of preferences<br><br>0.8.12:<br><br>  - Added unittests for most classes and methods<br>  - Added functional tests<br>  - Added owner to issue listing <br>  - Refactored user settings architecture<br>  - Added modification time to search results<br><br>0.8.11:<br><br>  - Made context search the default<br>  - Upgraded example, which was broken on Zope 2.6.x<br><br>0.8.10:<br><br>  - Improvements to the search interface<br>  - Fixed bug for editing session issues<br>  - Refactored recent changes page<br>  - Refactored code<br><br>0.8.9:<br><br>  - Fixed minor layout bug in session remote<br>  - Fixed bug for listing session issues<br><br>0.8.8:<br><br>  - Implemented relations<br>  - Added button for recent changes in session remote<br><br>0.8.7:<br><br>  - Added handling of broken text (UnicodeError) in Issues<br>  - Added recent changes page<br><br>0.8.6:<br><br>  - Remembering what kinds of Issues the user is browsing (open or<br>    non-open), usability.<br>  - Experimenting with behaviour of remote in suspended Issues<br>  - Changed the way Issues are listed in sessions<br>  - Changed the layout for issue editing<br><br>0.8.5.1:<br><br>  - Fixed bug that appeared when listing open issues in tree view<br><br>0.8.5:<br><br>  - HTML-quoted the contents of Issues listed in searchresults<br>  - Partially implemented suspended state<br><br>0.8.4.1:<br><br>  - Fixed minor bug related to session folder creation<br><br>0.8.4:<br><br>  - Refactored lots of code<br>  - Implemented relative state<br>  - Implemented session folder and better session handling\n          </div>"}, "last_serial": 1421556, "releases": {"0.9.129": [{"comment_text": "", "digests": {"md5": "3dee1b48380d56c516be7e6b80627756", "sha256": "d8a471f55c23c5e5da677dd07a1860e4c3bf79474fcaa08dabc4223a707fb7c9"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.129.tar.gz", "has_sig": false, "md5_digest": "3dee1b48380d56c516be7e6b80627756", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280570, "upload_time": "2012-03-07T08:53:28", "upload_time_iso_8601": "2012-03-07T08:53:28.352969Z", "url": "https://files.pythonhosted.org/packages/e7/84/42498066f5ca9458771f9fd91f3b6dd41fb6f6b61a7b59282e61a530e675/Products.IssueDealer-0.9.129.tar.gz", "yanked": false}], "0.9.130": [{"comment_text": "", "digests": {"md5": "a2676a1ce117a155b0f7c39b07d56496", "sha256": "1c988aea5742571f4109c78eb3921071702520574b6d8fbef38af4e3b4fe0936"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.130.tar.gz", "has_sig": false, "md5_digest": "a2676a1ce117a155b0f7c39b07d56496", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 279698, "upload_time": "2012-08-22T08:26:05", "upload_time_iso_8601": "2012-08-22T08:26:05.857128Z", "url": "https://files.pythonhosted.org/packages/57/6d/f7b4a75fe97442de5cf5d2d893fb0314669d43ad6f9132fb870696690621/Products.IssueDealer-0.9.130.tar.gz", "yanked": false}], "0.9.131": [{"comment_text": "", "digests": {"md5": "5fe73937b78e8536af976680081043e1", "sha256": "c1e7711ac3f03e4bf8daf55b39929df260512fc9a650ee9c8c58099055b462b9"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.131.tar.gz", "has_sig": false, "md5_digest": "5fe73937b78e8536af976680081043e1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280093, "upload_time": "2012-08-22T12:56:51", "upload_time_iso_8601": "2012-08-22T12:56:51.603302Z", "url": "https://files.pythonhosted.org/packages/73/11/74d9fd59df764e3020b400e6e509e7f136c3083f692aef3b7a14fc682f30/Products.IssueDealer-0.9.131.tar.gz", "yanked": false}], "0.9.132": [{"comment_text": "", "digests": {"md5": "0a17e18104650878099035616069e008", "sha256": "bc396cbd17f062a317fabe593a87220596029904f2d6e1c5868d6a140c449f9c"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.132.tar.gz", "has_sig": false, "md5_digest": "0a17e18104650878099035616069e008", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280564, "upload_time": "2015-02-12T10:51:10", "upload_time_iso_8601": "2015-02-12T10:51:10.011520Z", "url": "https://files.pythonhosted.org/packages/6f/42/f8b2d3dd500edd3fcc581370531a6a8f8b481cd683b3d31d51ec70b803ff/Products.IssueDealer-0.9.132.tar.gz", "yanked": false}], "0.9.132.1": [{"comment_text": "", "digests": {"md5": "f74b3a16e3ca9f48b20643453ee43078", "sha256": "9592e147d5eba4f6265ee7162a988e62b417161bb3c5ceb206d7812d3b6f5d3c"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.132.1.tar.gz", "has_sig": false, "md5_digest": "f74b3a16e3ca9f48b20643453ee43078", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280654, "upload_time": "2015-02-12T15:10:41", "upload_time_iso_8601": "2015-02-12T15:10:41.079660Z", "url": "https://files.pythonhosted.org/packages/3e/a0/7d5579deffb6ee6ea20dee26492f8bfd2982e9ab718c9ad7efc272d93745/Products.IssueDealer-0.9.132.1.tar.gz", "yanked": false}], "0.9.133": [{"comment_text": "", "digests": {"md5": "4ecf31594becf12a637956d3992dbc85", "sha256": "b28816a65280b6ac06f971dcba8f5ebbfb1007dc0d873e1101b0199e56dcb6fa"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.133.tar.gz", "has_sig": false, "md5_digest": "4ecf31594becf12a637956d3992dbc85", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280588, "upload_time": "2015-02-12T15:12:02", "upload_time_iso_8601": "2015-02-12T15:12:02.584313Z", "url": "https://files.pythonhosted.org/packages/97/ba/0c9f32fb4bb86828a14a5a6e1a0cb7102f2dca53985412ef843dc76d55fd/Products.IssueDealer-0.9.133.tar.gz", "yanked": false}], "0.9.134": [{"comment_text": "", "digests": {"md5": "e63695c7c27dfc82c791984e1ce8a816", "sha256": "aed351a59dbd1536a500612b3a24fbd21755ac3d829541312639aef677f1e277"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.134.tar.gz", "has_sig": false, "md5_digest": "e63695c7c27dfc82c791984e1ce8a816", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280815, "upload_time": "2015-02-12T15:29:22", "upload_time_iso_8601": "2015-02-12T15:29:22.301731Z", "url": "https://files.pythonhosted.org/packages/cb/77/e33899f56008d93586299f31527433c0143bdce25710dc0c56a6f662e17d/Products.IssueDealer-0.9.134.tar.gz", "yanked": false}], "0.9.135": [{"comment_text": "", "digests": {"md5": "f27cf954caa34bd9b6785fcaa9e7b1bd", "sha256": "cfa3af6406e156800a05de7d35cbd09b492b3754852165daf6934b24bd2456aa"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.135.tar.gz", "has_sig": false, "md5_digest": "f27cf954caa34bd9b6785fcaa9e7b1bd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280856, "upload_time": "2015-02-12T15:31:33", "upload_time_iso_8601": "2015-02-12T15:31:33.381444Z", "url": "https://files.pythonhosted.org/packages/8a/c3/2df66924bd0530b04140a028cfc613b27615472ceb9964306f1fd1adf056/Products.IssueDealer-0.9.135.tar.gz", "yanked": false}], "0.9.136": [{"comment_text": "", "digests": {"md5": "6ce1eade4f4d7b12727aa557f404b994", "sha256": "c32fba1acaa218d402b09f3d7ffd0860d89df11a651d8286876215ee45f54906"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.136.tar.gz", "has_sig": false, "md5_digest": "6ce1eade4f4d7b12727aa557f404b994", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280880, "upload_time": "2015-02-12T15:40:19", "upload_time_iso_8601": "2015-02-12T15:40:19.080611Z", "url": "https://files.pythonhosted.org/packages/33/04/8b5c07701da324390fe554648ddb088044e8829b94ea2fe3a144ee1ac05d/Products.IssueDealer-0.9.136.tar.gz", "yanked": false}], "0.9.137": [{"comment_text": "", "digests": {"md5": "6443970a748631b570a96c3cf4c3f996", "sha256": "58152ad0055bc6a8c4357409c87e497b2e283d2c5ec8dc8a0d120212fc5ac66e"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.137.tar.gz", "has_sig": false, "md5_digest": "6443970a748631b570a96c3cf4c3f996", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 281014, "upload_time": "2015-02-12T15:45:37", "upload_time_iso_8601": "2015-02-12T15:45:37.982390Z", "url": "https://files.pythonhosted.org/packages/cd/9b/f78722a7f24a4ca5d7a919db17c51dc07a4a42484e577d630b688d726782/Products.IssueDealer-0.9.137.tar.gz", "yanked": false}], "0.9.138": [{"comment_text": "", "digests": {"md5": "cb0389c3174ed1c20f4eb25095f5aa54", "sha256": "87021557325224a191a92cdd79e5818368b7b26c4d11f5157f204414dd09d0a7"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.138.tar.gz", "has_sig": false, "md5_digest": "cb0389c3174ed1c20f4eb25095f5aa54", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 281009, "upload_time": "2015-02-13T02:23:10", "upload_time_iso_8601": "2015-02-13T02:23:10.780744Z", "url": "https://files.pythonhosted.org/packages/ad/3a/f17e8991fc1d553b13ac73f0051b0800083959540992d554c574311c2466/Products.IssueDealer-0.9.138.tar.gz", "yanked": false}], "0.9.139": [{"comment_text": "", "digests": {"md5": "6718b7b5b5864e13e47b231a46363809", "sha256": "a74aa5abd3dd8f1a1fe59507e81c3c6623b68f0a5580ccd1b2056c7dd27f2b45"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.139.tar.gz", "has_sig": false, "md5_digest": "6718b7b5b5864e13e47b231a46363809", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280998, "upload_time": "2015-02-13T02:24:05", "upload_time_iso_8601": "2015-02-13T02:24:05.516951Z", "url": "https://files.pythonhosted.org/packages/ca/4b/1dd1bc7771615c145e2d167c7a3eba7b083afda5e60c52907da2fba5fcbd/Products.IssueDealer-0.9.139.tar.gz", "yanked": false}], "0.9.140": [{"comment_text": "", "digests": {"md5": "47f72fbbe9382d6f8b89fdb795a932a7", "sha256": "38bc74a1d32b52b6c7c3ad7a597c6130499179398f8131b17554dc7906097b67"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.140.tar.gz", "has_sig": false, "md5_digest": "47f72fbbe9382d6f8b89fdb795a932a7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280823, "upload_time": "2015-02-13T03:09:13", "upload_time_iso_8601": "2015-02-13T03:09:13.296456Z", "url": "https://files.pythonhosted.org/packages/af/f3/2a0949a600025cac81392abd4c46325e2c058e7f26b8e9282e5feea2af4a/Products.IssueDealer-0.9.140.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "47f72fbbe9382d6f8b89fdb795a932a7", "sha256": "38bc74a1d32b52b6c7c3ad7a597c6130499179398f8131b17554dc7906097b67"}, "downloads": -1, "filename": "Products.IssueDealer-0.9.140.tar.gz", "has_sig": false, "md5_digest": "47f72fbbe9382d6f8b89fdb795a932a7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 280823, "upload_time": "2015-02-13T03:09:13", "upload_time_iso_8601": "2015-02-13T03:09:13.296456Z", "url": "https://files.pythonhosted.org/packages/af/f3/2a0949a600025cac81392abd4c46325e2c058e7f26b8e9282e5feea2af4a/Products.IssueDealer-0.9.140.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:18:14 2020"}