{"info": {"author": "Nikos Koukis", "author_email": "nickkouk@gmail.com", "bugtrack_url": null, "classifiers": ["Topic :: Scientific/Engineering :: Bio-Informatics"], "description": "**Pump3000** is a GUI implementation for communicating with the Cavro XP3000 pump series. It was implemented in Python with the use of PySide.\r\n\r\nThe Software was designed and implemented as an individual project of mine for the Systems Biology & Bioengineering Research Laboratory of the Mech. Engineering Department of the National Technical university of Athens", "description_content_type": null, "docs_url": null, "download_url": "https://github.com/bergercookie/Pump3000", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://bergercookie.github.io/Projects/Pump3000/", "keywords": "medical, pump, GUI, PySide, python2, bioengineering, bioinformatics, research project,", "license": "Copyright (c) 2014, Nikolaos Koukis\r\nAll rights reserved.\r\n\r\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\r\n\r\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\r\n\r\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\r\n\r\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\r\nINCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.\r\nIN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\r\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\r\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,\r\nWHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARIS", "maintainer": "Nikos Koukis", "maintainer_email": "nickkouk@gmail.com", "name": "Pump3000", "package_url": "https://pypi.org/project/Pump3000/", "platform": "OSX, Windows", "project_url": "https://pypi.org/project/Pump3000/", "project_urls": {"Download": "https://github.com/bergercookie/Pump3000", "Homepage": "http://bergercookie.github.io/Projects/Pump3000/"}, "release_url": "https://pypi.org/project/Pump3000/1.0/", "requires_dist": null, "requires_python": null, "summary": "Pump3000: A Graphical User Interface for controlling Cavro XP3000 pumps", "version": "1.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><strong>Pump3000</strong> is a GUI implementation for communicating with the Cavro XP3000 pump series. It was implemented in Python with the use of PySide.</p>\n<p>The Software was designed and implemented as an individual project of mine for the Systems Biology &amp; Bioengineering Research Laboratory of the Mech. Engineering Department of the National Technical university of Athens</p>\n\n          </div>"}, "last_serial": 1161138, "releases": {"1.0": []}, "urls": [], "timestamp": "Fri May  8 03:13:37 2020"}