{"info": {"author": "Nadav Brandes", "author_email": "nadav.brandes@mail.huji.ac.il", "bugtrack_url": null, "classifiers": [], "description": "What is PWAS?\n=============\n\nProteome-Wide Association Study (PWAS) is a protein-centric, gene-based method for conducting genetic association studies. PWAS detects protein-coding genes whose functional variabilities are correlated with given phenotypes across a cohort. It employs a machine-learning model to assess the functional damage caused to each protein within each sample (given the sample's genotype). These assessments are summarized as effect score matrices, where each combination of sample (row) and gene (column) is assigned a number between 0 (complete loss of function) to 1 (no effect). PWAS creates two such matrices, for either dominant or recessive inharitance. Following the creation of those matrices, PWAS can then test various phenotypes, looking for associations between the matrix columns (describing the functional variabilities of specific proteins) to phenotype values. In the case of a binary phenotype, a significant association would mean that the protein coded by the gene appears more damaged in cases than in controls (or vice versa).\n\nFor more details read our manuscript: Nadav Brandes, Nathan Linial, Michal Linial, PWAS: Proteome-Wide Association Study, bioRxiv, https://doi.org/10.1101/812289\n\n\nInstallation\n============\n\nDependencies\n------------\n\nPWAS requires Python 3.\n\nDepending on the format of your genetic data, you will have to manually install a relevant Python parser before using PWAS. If you use the PLINK/BED format, you will have to install the `pandas-plink <https://pypi.org/project/pandas-plink/>`_ Python package. If you use the BGEN format, install `bgen_parser <https://github.com/nadavbra/bgen_parser>`_.\n\nPart of PWAS's pipeline also requires other tools (see details below). Specifically, step 2.3 requires a variant assessment tool such as  `FIRM <https://github.com/nadavbra/firm>`_.\n\nUpon installation, PWAS will automatically add the following Python packages:\n\n* numpy\n* scipy\n* pandas\n* matplotlib\n* biopython\n* statsmodels\n\n\nInstall PWAS\n------------\n\nSimply run:\n\n.. code-block:: cshell\n\n   pip install pwas\n\n**Important**: Make sure that the ``pip`` command refers to Python 3. If you are uncertain, consider using ``pip3`` instead.\n\nAlternatively, to install PWAS directly from this GitHub repository, clone the project into a local directory and run from it:\n\n.. code-block:: cshell\n\n   git submodule update --init\n   python3 setup.py install\n\n\nObtaining the reference genome files\n------------------------------------\n\nIf you need to determine the reference allele of each variant (step 2.2 described below), you will need to download the relevant version of the reference genome. Note that if you use FIRM you will have to download these files anyway. \n\nThe reference genome sequences of all human chromosomes (chrXXX.fa.gz files) can be downloaded from UCSC's FTP site at: \n\n* ftp://hgdownload.cse.ucsc.edu/goldenPath/hg19/chromosomes/ (for version hg19)\n* ftp://hgdownload.cse.ucsc.edu/goldenPath/hg38/chromosomes/ (for version hg38/GRCh38)\n\nThe chrXXX.fa.gz files need to be uncompressed to obtain chrXXX.fa files.\n\nIMPORTANT: In version hg19 there's an inconsistency in the reference genome of the M chromosome between UCSC and RegSeq/GENCODE,\nso the file chrM.fa has to be taken from RefSeq (NC_012920.1) instead of UCSC, from: https://www.ncbi.nlm.nih.gov/sviewer/viewer.cgi?tool=portal&save=file&log$=seqview&db=nuccore&report=fasta&sort=&id=251831106&from=begin&to=end&maxplex=1. In GRCh38 all downloaded files should remain as they are.\n\n\nUsage\n=====\n\nOverview\n--------\n\n\nPWAS requires the following input files:\n\n1. Phenotypes and (optionally) covariates in a CSV file\n\n2. Genotype files [Currently only the PLINK/BED and BGEN formats are supported. An effort to also support VCF files is currently underway, and it should be relatively easy to extend the code to support other formats as well.]\n\n\nRunning PWAS consists of the following steps:\n\n1. **Obtain the input genotype & phenotype files**\n\n2. **Determine per-variant effect scores**, which consists of:\n\n   2.1. List all the unique variants in the input genotyping files\n\n   2.2. (Optional) Determine the reference allele of each variant\n\n   2.3. Calculate the effect score of each variant (using the variant assessment tool of your choice)\n\n3. **Aggregate the per-variant into per-gene effect scores**, which consists of:\n\n   3.1. Collect the varaint effect scores per gene\n\n   3.2. Combine the variant effect scores with per-sample genotypes to obtain gene effect scores across the cohort's samples\n\n4. **Find gene-phenotype associations**, which consists of:\n\n   4.1. Run association tests (between a selected phenotype to the calculated gene effect scores)\n\n   4.2. Collect the results and perform multiple-hypothesis testing correction\n\nTo ensure maximal flexibility and allow the integration of PWAS with other tools in a modular way, each of these steps consists of a separate command-line with well-defined inputs and outputs. This means that each of these steps can be skipped at your choice, given that you can provide the inputs necessary for the following steps by some alternative way.\n\n\nStep 1: Obtain the input genotype & phenotype files\n---------------------------------------------------\n\nAs stated, PWAS requires a CSV file with the phenotypic fields of your cohort. This CSV file requires a single column designated for unique sample identifiers (which should correspond to the identifiers in your genotype files). The CSV file should also contain one or more columns for the phenotypes you wish to test, and (preferably) covariates you wish to account for when testing the phenotypes (e.g. sex, age, genetic principal components, genetic batch, etc.). All phenotype and covariate fields must be numeric (i.e. 0s and 1s in the case of binary fields, or any number in the case of continuous fields).\n\nIf you work with the `UK Biobank <https://www.ukbiobank.ac.uk/>`_, you can use the `ukbb_parser package <https://github.com/nadavbra/ukbb_parser>`_ to easily create a CSV dataset with selected phenotype fields (and automatically extracted covariates for genetic association tests) through its `command-line interface <https://github.com/nadavbra/ukbb_parser#command-line-api>`_.\n\nFor example, the following command will create a suitable dataset with 49 prominent phenotypes (both binary/categorical and continuous) and 173 covariates extracted from the UK Biobank (assuming that you have access to the relevant UKBB fields).\n\n.. code-block:: cshell\n\n    wget https://raw.githubusercontent.com/nadavbra/ukbb_parser/master/examples/phenotype_specs.py\n    create_ukbb_phenotype_dataset --phenotype-specs-file=./phenotype_specs.py --output-dataset-file=./ukbb_dataset.csv --output-covariates-columns-file=./ukbb_covariate_columns.json\n\nOn top of the CSV of phenotypes, you will also need a CSV file specifying all the relevant genotyping files. This meta file is expected to list all the relevant genotype sources (one per row), having the following headers:\n\n* **name**: A unique identifier of the genotype source (e.g. the name of the chromosome or genomic segment)\n* **format**: The format of the genotype source (currently supporting only *plink* and *bgen*).\n\nGenotype sources of *plink* format are expected to have three additional columns: **bed_file_path**, **bim_file_path** and **fam_file_path** (for the BED, BIM and FAM files, respectively). Likewise, genotype sources of *bgen* format are expected to have the following three columns: **bgen_file_path**, **bgi_file_path** and **sample_file_path** (for the .bgen, .bgen.bgi and .sample files, respectively).\n\nGenerating the meta CSV file of the genotype sources for the UK Biobank dataset can be easily achieved with the same ukbb_parser package. For example, the following command would generate the file for the imputated genotypes in BGEN format:\n\n.. code-block:: cshell\n\n    create_ukbb_genotype_spec_file --genotyping-type=imputation --output-file=./ukbb_imputation_genotyping_spec.csv\n\n**Very important note**: There's actually a good reason to choosing the UK Biobank's imputed genotypes over their raw markers. Unlike vanilla GWAS and other gene-based method (e.g. SKAT), for which it's sufficient to have some sampling of the variants in each Linkage Disequilibrium block, PWAS actually requires full knowledge of all the variants present in each sample. The underlying reason is that PWAS actually tries to figure out what happenes to the genes (from functional perspective), and missing variants (with functional relevance) are likely to diminish its statistical power to uncover true associations. For this reason, PWAS is expected to work best with complete, unbiased genotyping (e.g. provided by whole-exome sequencing). If your genetic data was collected by SNP-array genotypes, then you will at least have to try to complete the misssing variants through imputation.  \n\n\nStep 2: Determine per-variant effect scores\n-------------------------------------------\n\n\nStep 2.1: List all the unique variants in the input genotyping files\n--------------------------------------------------------------------\n\nTo combine all the varaint descriptions across the input genotype sources into a unified list, simply use the ``list_all_variants`` command provided by PWAS.\n\nFor example, to list all the unique imputed variants in the UK Biobank, run:\n\n.. code-block:: cshell\n\n    list_all_variants --genotyping-spec-file=./ukbb_imputation_genotyping_spec.csv --output-file=./ukbb_imputed_variants.csv --verbose\n\n\nStep 2.2 (optional): Determine the reference allele of each variant\n-------------------------------------------------------------------\n\nIn most genetic datasets it is the convention that the first allele listed in each variant is the reference allele and the second is the alternative alleles. However, in some datasets (including the UK Biobank) this convention is sometimes broken. In order to function properly, PWAS needs to know which of the two alleles listed in each variant is the reference allele. If you are not sure whether this convention holds in your dataset, it is recommended that you determine the reference alleles, just to be on the safe side. The ``determine_ref_alleles`` command (provided by PWAS) will compare each variant against the reference genome to validate which of the two variants is the reference allele.\n\nFor example, to determine the reference alleles of the imputed UKBB variants, run:\n\n.. code-block:: cshell\n\n    determine_ref_alleles --variants-file=./ukbb_imputed_variants.csv --ref-genome-dir=/path/to/hg19/ --chrom-col=chromosome --pos-col=position --allele1-col=allele1 --allele2-col=allele2 --override --verbose\n\nwhere the --ref-genome-dir option should point to a directory with the sequences of the relevant version of the human reference genome (hg19 in the case of the UKBB). This directory is expected to have one (uncompressed) FASTA file per chromosome (e.g. chr1.fa, chr2.fa, ..., chr22.fa, chrX.fa, chrY.fa, chrM.fa). See the `Obtaining the reference genome files <#obtaining-the-reference-genome-files>`_ section above.\n\n\nStep 2.3: Calculate the effect score of each variant\n----------------------------------------------------\n\nA crucial step in determining the functional status of genes is to first determine the predicted functional effects of individual variants. PWAS requires that each variant will be assigned an effect score between 0 (indicating complete loss of function of the gene) to 1 (indicating no effect). PWAS has been designed and tested to work with `FIRM <https://github.com/nadavbra/firm>`_, a machine-learning framework for predicting the functional impact of variants affecting protein sequences at the molecular-level. However, PWAS is completely generic and could, in principle, work with any variant assessment tool (e.g. `CADD <https://cadd.gs.washington.edu/>`_). In fact, since all of PWAS's calculations are derived from the per-variant effect scores, and it's actually agnostic to their interpretation, you can even assign scores to non-coding genes or use scores that capture other biological properties of mutations (even though PWAS was originally designed for discovering proteomic associations).\n\nWhatever tool you end up using, you will need to produce a `JSON-lines <http://jsonlines.org/>`_ file. Each row in the file is expected to describe the effects of the variants in the corresponding row in the variants CSV file (in particular, the two files are expected to have the same number of lines, except the headers line that is only expected in the CSV file, but not in the JSON-lines file). Each row in the file is expected to be a JSON-formatted dictionary, mapping each gene index (a running integer index arbitrarily assigned to each gene) into the variant's list of effects on the gene, each is a pair of i) effect description (string) and ii) effect score (float, between 0 to 1).\n\nFor example, to calculate the effect scores of UKBB's imputed variants with FIRM (following its installation), run:\n\n.. code-block:: cshell\n\n    firm_determine_extended_gene_effects_and_scores --variants-csv-file=./ukbb_imputed_variants.csv --output-effects-file=./ukbb_imputation_effects.jsonl --genes-dir=./ --ref-genome=GRCh37 --chrom-col=chromosome --pos-col=position --allele1-col=allele1 --allele2-col=allele2 --is-allele1-ref-col=is_allele1_ref\n\n\nStep 3: Aggregate the per-variant into per-gene effect scores\n-------------------------------------------------------------\n\n\nStep 3.1: Collect the varaint effect scores per gene\n----------------------------------------------------\n\nHaving completed step 2, you should now have: i) a CSV file listing all the variants genotyped in your cohort, and ii) a JSON-lines file specifying all the effects of these variants on genes, where each variant-gene effect is assigned a functional score. In order to aggregate the per-variant effect scores into per-gene scores, PWAS first needs the variant effects to be organized per gene. It requires a seperate CSV file per gene listing all the variants affecting that gene. These CSV files should have, on top of all the columns in the original CSV file (that lists all the variants), an additional *effect_score* column with the effect score of each of the variants (with respect to the file's gene).\n\nTo generate the per-gene files, simply use the ``organize_variant_effects_per_gene`` command provided by PWAS.\n\nFor example, the following will generate the required per-gene CSV files for the imputed variants in the UKBB:\n\n.. code-block:: cshell\n\n    mkdir ./ukbb_imputation_variants_per_gene\n    organize_variant_effects_per_gene --variants-file=./ukbb_imputed_variants.csv --effects-file=./ukbb_imputation_effects.jsonl --gene-variants-dir=./ukbb_imputation_variants_per_gene/\n\n\nStep 3.2: Calculate the gene effect scores\n------------------------------------------\n\nNow here comes PWAS's magic sauce. We are going to aggregate the per-variant effect scores into per-gene (dominant and recessive) effect scores, while taking into account each sample's unique genotype. The relevant PWAS command is ``calc_gene_effect_scores``.\n\nFor example, the following command will calculate the gene effect scores for all of the UK Biobank's samples, based on their imputed genotypes:\n\n.. code-block:: cshell\n\n   mkdir ./ukbb_imputation_gene_effect_scores/\n   calc_gene_effect_scores --genotyping-spec-file=./ukbb_imputation_genotyping_spec.csv --gene-variants-dir=./ukbb_imputation_variants_per_gene/ --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --is-allele1-ref-col=is_allele1_ref\n\nSince this process is computationally intensive (with respect to storage and CPU), it might be a good idea to distribute it across multiple tasks (and potentially sending them to run on a cluster). Luckily for you, this command is already equipped with built-in distribution functionality. For a full explanation on all the different options to distribute the command, please refer to its help message. \n\nIn our example, we can distribute the process into 1,000 tasks and send them to run on a cluster managed by SLURM, by running:\n\n.. code-block:: cshell\n\n   sbatch --array=0-999 --mem=32g -c1 --time=1-0 --wrap=\"calc_gene_effect_scores --genotyping-spec-file=./ukbb_imputation_genotyping_spec.csv --gene-variants-dir=./ukbb_imputation_variants_per_gene/ --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --is-allele1-ref-col=is_allele1_ref --task-index-env-variable=SLURM_ARRAY_TASK_ID --total-tasks-env-variable=SLURM_ARRAY_TASK_COUNT\"\n\nOnce the jobs have successfully finished, you should have a CSV file per gene, with the effect scores of each sample.\n\nIt might be a good idea to validate that you have the correct number of CSV files (i.e. the same as the number of CSV files listing the per-gene variants):\n\n.. code-block:: cshell\n\n   ls -l ./ukbb_imputation_variants_per_gene/ | wc -l\n   ls -l ./ukbb_imputation_gene_effect_scores/ | wc -l\n\nThe algorithm that aggregates the variant effect scores into gene effect scores is actually dependent on 5 parameters that the ``calc_gene_effect_scores`` command allows you to specifiy, although the default values are likely a sensible choice. For the full mathematical details of the aggregation algorithm, and the meaning of those parameters, please refer to our paper.\n\n\nStep 4: Find gene-phenotype associations\n----------------------------------------\n\n\nStep 4.1: Run association tests\n--------------------------------\n\nHaving gone through step 1, you should have a CSV file with phenotypes and covariates, and having completed step 3 you shoud also have per-gene CSV files with the gene effect scores. The last step of PWAS is to simply look for statistical correlations between the phenotypes to the gene scores, in order to uncover gene-phenotype associations (with resepct to the functional variability captured by the pre-calculated gene effect scores, which, in the default case where FIRM has been used as the variant assessment tool, reflect the estimated fucntions of the proteins coded by those genes). In fact, this step consists of nothing more than routine statistical methods (linear and logistic regression), and you could, in principle, use any statistics software of your choice (e.g. PLINK, R, etc.). Still, PWAS comes with its own built-in implementation which also provides, on top p-values, some additional unique metrics. Unless you feel very confident that you know what you are doing, it is recommended that you just use the implementation of PWAS, as provided by the ``pwas_test_genes`` command.\n\nTo continue our ongoing UKBB example, let's say we want to find PWAS associations for type-II diabetes. Then simply run:\n\n.. code-block:: cshell\n\n   mkdir ./ukbb_imputation_per_gene_type2_diabetes_pwas_results\n   pwas_test_genes --dataset-file=./ukbb_dataset.csv --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --per-gene-pwas-results-dir=./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ --sample-id-col=eid --phenotype-col=\"Type 2 diabetes\" --covariate-cols-json-file=./ukbb_covariate_columns.json\n\nThis process will go through each gene in ``./ukbb_imputation_gene_effect_scores/`` and run a logistic regression test of the \"Type 2 diabetes\" column in ``./ukbb_dataset.csv`` against the gene's effect scores (while also taking into account the covariates in the columns specified by ``./ukbb_covariate_columns.json``). It will save the resulted summary statistics of each gene as a separate CSV file in ``./ukbb_imputation_per_gene_type2_diabetes_pwas_results/``.\n\nThis process too can be computationally intenstive (in terms of CPU time), especially for large datasets (with many samples and covariates) such as the UKBB. Fortunately, the ``pwas_test_genes`` command comes with a built-in functionality that allows one to distribute it across many computing resources. For full details on that, please refer to its help message. As an example, if you want to distribute the process across 1,000 tasks and send them to run on a cluster managed by SLURM, simply run:\n\n.. code-block:: cshell\n\n   sbatch --array=0-999 --mem=32g -c1 --time=1-0 --wrap=\"pwas_test_genes --dataset-file=./ukbb_dataset.csv --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --per-gene-pwas-results-dir=./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ --sample-id-col=eid --phenotype-col='Type 2 diabetes' --covariate-cols-json-file=./ukbb_covariate_columns.json --task-index-env-variable=SLURM_ARRAY_TASK_ID --total-tasks-env-variable=SLURM_ARRAY_TASK_COUNT\"\n\nHere too, once everything is done and over with, it will be a good idea to validate that you've got the right number of files. These two command are expected to give you the same number:\n\n.. code-block:: cshell\n\n   ls -l ./ukbb_imputation_gene_effect_scores/ | wc -l\n   ls -l ./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ | wc -l\n\n\nStep 4.2: Collect the results and perform multiple-hypothesis testing correction\n--------------------------------------------------------------------------------\n\nTo collect the summary statistics calculated in the previous step (which are currently spread across many CSV files) and perform multiple-hypothesis testing correction, simply use the ``combine_pwas_results`` command.\n\nIn our ongoing example, just run:\n\n.. code-block:: cshell\n\n   combine_pwas_results --genes-file=./genes_hg19.csv --per-gene-pwas-results-dir=./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ --results-file=./ukbb_imputation_type2_diabetes_pwas_results.csv\n\nThe file ``./genes_hg19.csv`` should have been generated by FIRM when you used it to estimate the variant effect scores. It is necessary to provide the details of all the genes which, up until this point, PWAS represented by nothing more than indices. PWAS is actually agnostic to the content of this file, and it simply concatenates it, as is, before the summary statistics of each gene.\n\nWhen the process is finished, you will have the file ``./ukbb_imputation_type2_diabetes_pwas_results.csv`` with the complete summary statistics of all tested genes. And that's the end of it - you are now the proud owner of freshly generated PWAS results!\n\n\nRecap (the complete pipeline)\n-----------------------------\n\nFor quicker future reference, here's the complete pipeline for running PWAS for type-II diabetes over the imputed genotypes provided by the UK Biobank.\n\nFirst, to generate the necessary phenotype & genotype files from the UKBB dataset, use the ``ukbb_parser`` package:\n\n.. code-block:: cshell\n\n    wget https://raw.githubusercontent.com/nadavbra/ukbb_parser/master/examples/phenotype_specs.py\n    create_ukbb_phenotype_dataset --phenotype-specs-file=./phenotype_specs.py --output-dataset-file=./ukbb_dataset.csv --output-covariates-columns-file=./ukbb_covariate_columns.json\n   create_ukbb_genotype_spec_file --genotyping-type=imputation --output-file=./ukbb_imputation_genotyping_spec.csv\n\nSecond, you will have to list all the dataset's variants and determine the reference allele of each variant:\n\n.. code-block:: cshell\n\n   list_all_variants --genotyping-spec-file=./ukbb_imputation_genotyping_spec.csv --output-file=./ukbb_imputed_variants.csv --verbose\n   determine_ref_alleles --variants-file=./ukbb_imputed_variants.csv --ref-genome-dir=/path/to/hg19/ --chrom-col=chromosome --pos-col=position --allele1-col=allele1 --allele2-col=allele2 --override --verbose\n\nAnd then calculate the variant effect scores (here using FIRM):\n\n.. code-block:: cshell\n\n   firm_determine_extended_gene_effects_and_scores --variants-csv-file=./ukbb_imputed_variants.csv --output-effects-file=./ukbb_imputation_effects.jsonl --genes-dir=./ --ref-genome=GRCh37 --chrom-col=chromosome --pos-col=position --allele1-col=allele1 --allele2-col=allele2 --is-allele1-ref-col=is_allele1_ref\n\nNext, you will need to organize the variant effect scores per gene and aggregate them into gene effect scores (distributing that process on a cluster to speed things up):\n\n.. code-block:: cshell\n\n   mkdir ./ukbb_imputation_variants_per_gene\n   organize_variant_effects_per_gene --variants-file=./ukbb_imputed_variants.csv --effects-file=./ukbb_imputation_effects.jsonl --gene-variants-dir=./ukbb_imputation_variants_per_gene/\n   mkdir ./ukbb_imputation_gene_effect_scores/\n   sbatch --array=0-999 --mem=32g -c1 --time=1-0 --wrap=\"calc_gene_effect_scores --genotyping-spec-file=./ukbb_imputation_genotyping_spec.csv --gene-variants-dir=./ukbb_imputation_variants_per_gene/ --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --is-allele1-ref-col=is_allele1_ref --task-index-env-variable=SLURM_ARRAY_TASK_ID --total-tasks-env-variable=SLURM_ARRAY_TASK_COUNT\"\n\nAnd validate that you got the correct number of files:\n\n.. code-block:: cshell\n\n   ls -l ./ukbb_imputation_variants_per_gene/ | wc -l\n   ls -l ./ukbb_imputation_gene_effect_scores/ | wc -l\n\nLastly, run the actual association tests (again using a cluster):\n\n.. code-block:: cshell\n\n   mkdir ./ukbb_imputation_per_gene_type2_diabetes_pwas_results\n   sbatch --array=0-999 --mem=32g -c1 --time=1-0 --wrap=\"pwas_test_genes --dataset-file=./ukbb_dataset.csv --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --per-gene-pwas-results-dir=./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ --sample-id-col=eid --phenotype-col='Type 2 diabetes' --covariate-cols-json-file=./ukbb_covariate_columns.json --task-index-env-variable=SLURM_ARRAY_TASK_ID --total-tasks-env-variable=SLURM_ARRAY_TASK_COUNT\"\n\nValidate that you've got all the files:\n\n.. code-block:: cshell\n\n   ls -l ./ukbb_imputation_gene_effect_scores/ | wc -l\n   ls -l ./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ | wc -l\n\nAnd combine the results to get the final summary statistics file:\n\n.. code-block:: cshell\n\n   combine_pwas_results --genes-file=./genes_hg19.csv --per-gene-pwas-results-dir=./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ --results-file=./ukbb_imputation_type2_diabetes_pwas_results.csv\n\n\nCite us\n=======\n\nIf you use PWAS as part of work contributing to a scientific publication, we ask that you cite our preprint: Nadav Brandes, Nathan Linial, Michal Linial, PWAS: Proteome-Wide Association Study, bioRxiv, https://doi.org/10.1101/812289\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/nadavbra/pwas", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "pwas", "package_url": "https://pypi.org/project/pwas/", "platform": "", "project_url": "https://pypi.org/project/pwas/", "project_urls": {"Homepage": "https://github.com/nadavbra/pwas"}, "release_url": "https://pypi.org/project/pwas/1.0.2/", "requires_dist": ["numpy", "scipy", "pandas", "matplotlib", "biopython", "statsmodels"], "requires_python": "", "summary": "Proteome-Wide Association Study (PWAS) is a protein-centric, gene-based method for conducting genetic association studies.", "version": "1.0.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>What is PWAS?</h1>\n<p>Proteome-Wide Association Study (PWAS) is a protein-centric, gene-based method for conducting genetic association studies. PWAS detects protein-coding genes whose functional variabilities are correlated with given phenotypes across a cohort. It employs a machine-learning model to assess the functional damage caused to each protein within each sample (given the sample's genotype). These assessments are summarized as effect score matrices, where each combination of sample (row) and gene (column) is assigned a number between 0 (complete loss of function) to 1 (no effect). PWAS creates two such matrices, for either dominant or recessive inharitance. Following the creation of those matrices, PWAS can then test various phenotypes, looking for associations between the matrix columns (describing the functional variabilities of specific proteins) to phenotype values. In the case of a binary phenotype, a significant association would mean that the protein coded by the gene appears more damaged in cases than in controls (or vice versa).</p>\n<p>For more details read our manuscript: Nadav Brandes, Nathan Linial, Michal Linial, PWAS: Proteome-Wide Association Study, bioRxiv, <a href=\"https://doi.org/10.1101/812289\" rel=\"nofollow\">https://doi.org/10.1101/812289</a></p>\n<h1>Installation</h1>\n<h2>Dependencies</h2>\n<p>PWAS requires Python 3.</p>\n<p>Depending on the format of your genetic data, you will have to manually install a relevant Python parser before using PWAS. If you use the PLINK/BED format, you will have to install the <code>pandas-plink &lt;https://pypi.org/project/pandas-plink/&gt;</code>_ Python package. If you use the BGEN format, install <code>bgen_parser &lt;https://github.com/nadavbra/bgen_parser&gt;</code>_.</p>\n<p>Part of PWAS's pipeline also requires other tools (see details below). Specifically, step 2.3 requires a variant assessment tool such as  <code>FIRM &lt;https://github.com/nadavbra/firm&gt;</code>_.</p>\n<p>Upon installation, PWAS will automatically add the following Python packages:</p>\n<ul>\n<li>numpy</li>\n<li>scipy</li>\n<li>pandas</li>\n<li>matplotlib</li>\n<li>biopython</li>\n<li>statsmodels</li>\n</ul>\n<h2>Install PWAS</h2>\n<p>Simply run:</p>\n<p>.. code-block:: cshell</p>\n<p>pip install pwas</p>\n<p><strong>Important</strong>: Make sure that the <code>pip</code> command refers to Python 3. If you are uncertain, consider using <code>pip3</code> instead.</p>\n<p>Alternatively, to install PWAS directly from this GitHub repository, clone the project into a local directory and run from it:</p>\n<p>.. code-block:: cshell</p>\n<p>git submodule update --init\npython3 setup.py install</p>\n<h2>Obtaining the reference genome files</h2>\n<p>If you need to determine the reference allele of each variant (step 2.2 described below), you will need to download the relevant version of the reference genome. Note that if you use FIRM you will have to download these files anyway.</p>\n<p>The reference genome sequences of all human chromosomes (chrXXX.fa.gz files) can be downloaded from UCSC's FTP site at:</p>\n<ul>\n<li><a>ftp://hgdownload.cse.ucsc.edu/goldenPath/hg19/chromosomes/</a> (for version hg19)</li>\n<li><a>ftp://hgdownload.cse.ucsc.edu/goldenPath/hg38/chromosomes/</a> (for version hg38/GRCh38)</li>\n</ul>\n<p>The chrXXX.fa.gz files need to be uncompressed to obtain chrXXX.fa files.</p>\n<p>IMPORTANT: In version hg19 there's an inconsistency in the reference genome of the M chromosome between UCSC and RegSeq/GENCODE,\nso the file chrM.fa has to be taken from RefSeq (NC_012920.1) instead of UCSC, from: <a href=\"https://www.ncbi.nlm.nih.gov/sviewer/viewer.cgi?tool=portal&amp;save=file&amp;log%24=seqview&amp;db=nuccore&amp;report=fasta&amp;sort=&amp;id=251831106&amp;from=begin&amp;to=end&amp;maxplex=1\" rel=\"nofollow\">https://www.ncbi.nlm.nih.gov/sviewer/viewer.cgi?tool=portal&amp;save=file&amp;log$=seqview&amp;db=nuccore&amp;report=fasta&amp;sort=&amp;id=251831106&amp;from=begin&amp;to=end&amp;maxplex=1</a>. In GRCh38 all downloaded files should remain as they are.</p>\n<h1>Usage</h1>\n<h2>Overview</h2>\n<p>PWAS requires the following input files:</p>\n<ol>\n<li>\n<p>Phenotypes and (optionally) covariates in a CSV file</p>\n</li>\n<li>\n<p>Genotype files [Currently only the PLINK/BED and BGEN formats are supported. An effort to also support VCF files is currently underway, and it should be relatively easy to extend the code to support other formats as well.]</p>\n</li>\n</ol>\n<p>Running PWAS consists of the following steps:</p>\n<ol>\n<li>\n<p><strong>Obtain the input genotype &amp; phenotype files</strong></p>\n</li>\n<li>\n<p><strong>Determine per-variant effect scores</strong>, which consists of:</p>\n<p>2.1. List all the unique variants in the input genotyping files</p>\n<p>2.2. (Optional) Determine the reference allele of each variant</p>\n<p>2.3. Calculate the effect score of each variant (using the variant assessment tool of your choice)</p>\n</li>\n<li>\n<p><strong>Aggregate the per-variant into per-gene effect scores</strong>, which consists of:</p>\n<p>3.1. Collect the varaint effect scores per gene</p>\n<p>3.2. Combine the variant effect scores with per-sample genotypes to obtain gene effect scores across the cohort's samples</p>\n</li>\n<li>\n<p><strong>Find gene-phenotype associations</strong>, which consists of:</p>\n<p>4.1. Run association tests (between a selected phenotype to the calculated gene effect scores)</p>\n<p>4.2. Collect the results and perform multiple-hypothesis testing correction</p>\n</li>\n</ol>\n<p>To ensure maximal flexibility and allow the integration of PWAS with other tools in a modular way, each of these steps consists of a separate command-line with well-defined inputs and outputs. This means that each of these steps can be skipped at your choice, given that you can provide the inputs necessary for the following steps by some alternative way.</p>\n<h2>Step 1: Obtain the input genotype &amp; phenotype files</h2>\n<p>As stated, PWAS requires a CSV file with the phenotypic fields of your cohort. This CSV file requires a single column designated for unique sample identifiers (which should correspond to the identifiers in your genotype files). The CSV file should also contain one or more columns for the phenotypes you wish to test, and (preferably) covariates you wish to account for when testing the phenotypes (e.g. sex, age, genetic principal components, genetic batch, etc.). All phenotype and covariate fields must be numeric (i.e. 0s and 1s in the case of binary fields, or any number in the case of continuous fields).</p>\n<p>If you work with the <code>UK Biobank &lt;https://www.ukbiobank.ac.uk/&gt;</code><em>, you can use the <code>ukbb_parser package &lt;https://github.com/nadavbra/ukbb_parser&gt;</code></em> to easily create a CSV dataset with selected phenotype fields (and automatically extracted covariates for genetic association tests) through its <code>command-line interface &lt;https://github.com/nadavbra/ukbb_parser#command-line-api&gt;</code>_.</p>\n<p>For example, the following command will create a suitable dataset with 49 prominent phenotypes (both binary/categorical and continuous) and 173 covariates extracted from the UK Biobank (assuming that you have access to the relevant UKBB fields).</p>\n<p>.. code-block:: cshell</p>\n<pre><code>wget https://raw.githubusercontent.com/nadavbra/ukbb_parser/master/examples/phenotype_specs.py\ncreate_ukbb_phenotype_dataset --phenotype-specs-file=./phenotype_specs.py --output-dataset-file=./ukbb_dataset.csv --output-covariates-columns-file=./ukbb_covariate_columns.json\n</code></pre>\n<p>On top of the CSV of phenotypes, you will also need a CSV file specifying all the relevant genotyping files. This meta file is expected to list all the relevant genotype sources (one per row), having the following headers:</p>\n<ul>\n<li><strong>name</strong>: A unique identifier of the genotype source (e.g. the name of the chromosome or genomic segment)</li>\n<li><strong>format</strong>: The format of the genotype source (currently supporting only <em>plink</em> and <em>bgen</em>).</li>\n</ul>\n<p>Genotype sources of <em>plink</em> format are expected to have three additional columns: <strong>bed_file_path</strong>, <strong>bim_file_path</strong> and <strong>fam_file_path</strong> (for the BED, BIM and FAM files, respectively). Likewise, genotype sources of <em>bgen</em> format are expected to have the following three columns: <strong>bgen_file_path</strong>, <strong>bgi_file_path</strong> and <strong>sample_file_path</strong> (for the .bgen, .bgen.bgi and .sample files, respectively).</p>\n<p>Generating the meta CSV file of the genotype sources for the UK Biobank dataset can be easily achieved with the same ukbb_parser package. For example, the following command would generate the file for the imputated genotypes in BGEN format:</p>\n<p>.. code-block:: cshell</p>\n<pre><code>create_ukbb_genotype_spec_file --genotyping-type=imputation --output-file=./ukbb_imputation_genotyping_spec.csv\n</code></pre>\n<p><strong>Very important note</strong>: There's actually a good reason to choosing the UK Biobank's imputed genotypes over their raw markers. Unlike vanilla GWAS and other gene-based method (e.g. SKAT), for which it's sufficient to have some sampling of the variants in each Linkage Disequilibrium block, PWAS actually requires full knowledge of all the variants present in each sample. The underlying reason is that PWAS actually tries to figure out what happenes to the genes (from functional perspective), and missing variants (with functional relevance) are likely to diminish its statistical power to uncover true associations. For this reason, PWAS is expected to work best with complete, unbiased genotyping (e.g. provided by whole-exome sequencing). If your genetic data was collected by SNP-array genotypes, then you will at least have to try to complete the misssing variants through imputation.</p>\n<h2>Step 2: Determine per-variant effect scores</h2>\n<h2>Step 2.1: List all the unique variants in the input genotyping files</h2>\n<p>To combine all the varaint descriptions across the input genotype sources into a unified list, simply use the <code>list_all_variants</code> command provided by PWAS.</p>\n<p>For example, to list all the unique imputed variants in the UK Biobank, run:</p>\n<p>.. code-block:: cshell</p>\n<pre><code>list_all_variants --genotyping-spec-file=./ukbb_imputation_genotyping_spec.csv --output-file=./ukbb_imputed_variants.csv --verbose\n</code></pre>\n<h2>Step 2.2 (optional): Determine the reference allele of each variant</h2>\n<p>In most genetic datasets it is the convention that the first allele listed in each variant is the reference allele and the second is the alternative alleles. However, in some datasets (including the UK Biobank) this convention is sometimes broken. In order to function properly, PWAS needs to know which of the two alleles listed in each variant is the reference allele. If you are not sure whether this convention holds in your dataset, it is recommended that you determine the reference alleles, just to be on the safe side. The <code>determine_ref_alleles</code> command (provided by PWAS) will compare each variant against the reference genome to validate which of the two variants is the reference allele.</p>\n<p>For example, to determine the reference alleles of the imputed UKBB variants, run:</p>\n<p>.. code-block:: cshell</p>\n<pre><code>determine_ref_alleles --variants-file=./ukbb_imputed_variants.csv --ref-genome-dir=/path/to/hg19/ --chrom-col=chromosome --pos-col=position --allele1-col=allele1 --allele2-col=allele2 --override --verbose\n</code></pre>\n<p>where the --ref-genome-dir option should point to a directory with the sequences of the relevant version of the human reference genome (hg19 in the case of the UKBB). This directory is expected to have one (uncompressed) FASTA file per chromosome (e.g. chr1.fa, chr2.fa, ..., chr22.fa, chrX.fa, chrY.fa, chrM.fa). See the <code>Obtaining the reference genome files &lt;#obtaining-the-reference-genome-files&gt;</code>_ section above.</p>\n<h2>Step 2.3: Calculate the effect score of each variant</h2>\n<p>A crucial step in determining the functional status of genes is to first determine the predicted functional effects of individual variants. PWAS requires that each variant will be assigned an effect score between 0 (indicating complete loss of function of the gene) to 1 (indicating no effect). PWAS has been designed and tested to work with <code>FIRM &lt;https://github.com/nadavbra/firm&gt;</code><em>, a machine-learning framework for predicting the functional impact of variants affecting protein sequences at the molecular-level. However, PWAS is completely generic and could, in principle, work with any variant assessment tool (e.g. <code>CADD &lt;https://cadd.gs.washington.edu/&gt;</code></em>). In fact, since all of PWAS's calculations are derived from the per-variant effect scores, and it's actually agnostic to their interpretation, you can even assign scores to non-coding genes or use scores that capture other biological properties of mutations (even though PWAS was originally designed for discovering proteomic associations).</p>\n<p>Whatever tool you end up using, you will need to produce a <code>JSON-lines &lt;http://jsonlines.org/&gt;</code>_ file. Each row in the file is expected to describe the effects of the variants in the corresponding row in the variants CSV file (in particular, the two files are expected to have the same number of lines, except the headers line that is only expected in the CSV file, but not in the JSON-lines file). Each row in the file is expected to be a JSON-formatted dictionary, mapping each gene index (a running integer index arbitrarily assigned to each gene) into the variant's list of effects on the gene, each is a pair of i) effect description (string) and ii) effect score (float, between 0 to 1).</p>\n<p>For example, to calculate the effect scores of UKBB's imputed variants with FIRM (following its installation), run:</p>\n<p>.. code-block:: cshell</p>\n<pre><code>firm_determine_extended_gene_effects_and_scores --variants-csv-file=./ukbb_imputed_variants.csv --output-effects-file=./ukbb_imputation_effects.jsonl --genes-dir=./ --ref-genome=GRCh37 --chrom-col=chromosome --pos-col=position --allele1-col=allele1 --allele2-col=allele2 --is-allele1-ref-col=is_allele1_ref\n</code></pre>\n<h2>Step 3: Aggregate the per-variant into per-gene effect scores</h2>\n<h2>Step 3.1: Collect the varaint effect scores per gene</h2>\n<p>Having completed step 2, you should now have: i) a CSV file listing all the variants genotyped in your cohort, and ii) a JSON-lines file specifying all the effects of these variants on genes, where each variant-gene effect is assigned a functional score. In order to aggregate the per-variant effect scores into per-gene scores, PWAS first needs the variant effects to be organized per gene. It requires a seperate CSV file per gene listing all the variants affecting that gene. These CSV files should have, on top of all the columns in the original CSV file (that lists all the variants), an additional <em>effect_score</em> column with the effect score of each of the variants (with respect to the file's gene).</p>\n<p>To generate the per-gene files, simply use the <code>organize_variant_effects_per_gene</code> command provided by PWAS.</p>\n<p>For example, the following will generate the required per-gene CSV files for the imputed variants in the UKBB:</p>\n<p>.. code-block:: cshell</p>\n<pre><code>mkdir ./ukbb_imputation_variants_per_gene\norganize_variant_effects_per_gene --variants-file=./ukbb_imputed_variants.csv --effects-file=./ukbb_imputation_effects.jsonl --gene-variants-dir=./ukbb_imputation_variants_per_gene/\n</code></pre>\n<h2>Step 3.2: Calculate the gene effect scores</h2>\n<p>Now here comes PWAS's magic sauce. We are going to aggregate the per-variant effect scores into per-gene (dominant and recessive) effect scores, while taking into account each sample's unique genotype. The relevant PWAS command is <code>calc_gene_effect_scores</code>.</p>\n<p>For example, the following command will calculate the gene effect scores for all of the UK Biobank's samples, based on their imputed genotypes:</p>\n<p>.. code-block:: cshell</p>\n<p>mkdir ./ukbb_imputation_gene_effect_scores/\ncalc_gene_effect_scores --genotyping-spec-file=./ukbb_imputation_genotyping_spec.csv --gene-variants-dir=./ukbb_imputation_variants_per_gene/ --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --is-allele1-ref-col=is_allele1_ref</p>\n<p>Since this process is computationally intensive (with respect to storage and CPU), it might be a good idea to distribute it across multiple tasks (and potentially sending them to run on a cluster). Luckily for you, this command is already equipped with built-in distribution functionality. For a full explanation on all the different options to distribute the command, please refer to its help message.</p>\n<p>In our example, we can distribute the process into 1,000 tasks and send them to run on a cluster managed by SLURM, by running:</p>\n<p>.. code-block:: cshell</p>\n<p>sbatch --array=0-999 --mem=32g -c1 --time=1-0 --wrap=\"calc_gene_effect_scores --genotyping-spec-file=./ukbb_imputation_genotyping_spec.csv --gene-variants-dir=./ukbb_imputation_variants_per_gene/ --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --is-allele1-ref-col=is_allele1_ref --task-index-env-variable=SLURM_ARRAY_TASK_ID --total-tasks-env-variable=SLURM_ARRAY_TASK_COUNT\"</p>\n<p>Once the jobs have successfully finished, you should have a CSV file per gene, with the effect scores of each sample.</p>\n<p>It might be a good idea to validate that you have the correct number of CSV files (i.e. the same as the number of CSV files listing the per-gene variants):</p>\n<p>.. code-block:: cshell</p>\n<p>ls -l ./ukbb_imputation_variants_per_gene/ | wc -l\nls -l ./ukbb_imputation_gene_effect_scores/ | wc -l</p>\n<p>The algorithm that aggregates the variant effect scores into gene effect scores is actually dependent on 5 parameters that the <code>calc_gene_effect_scores</code> command allows you to specifiy, although the default values are likely a sensible choice. For the full mathematical details of the aggregation algorithm, and the meaning of those parameters, please refer to our paper.</p>\n<h2>Step 4: Find gene-phenotype associations</h2>\n<h2>Step 4.1: Run association tests</h2>\n<p>Having gone through step 1, you should have a CSV file with phenotypes and covariates, and having completed step 3 you shoud also have per-gene CSV files with the gene effect scores. The last step of PWAS is to simply look for statistical correlations between the phenotypes to the gene scores, in order to uncover gene-phenotype associations (with resepct to the functional variability captured by the pre-calculated gene effect scores, which, in the default case where FIRM has been used as the variant assessment tool, reflect the estimated fucntions of the proteins coded by those genes). In fact, this step consists of nothing more than routine statistical methods (linear and logistic regression), and you could, in principle, use any statistics software of your choice (e.g. PLINK, R, etc.). Still, PWAS comes with its own built-in implementation which also provides, on top p-values, some additional unique metrics. Unless you feel very confident that you know what you are doing, it is recommended that you just use the implementation of PWAS, as provided by the <code>pwas_test_genes</code> command.</p>\n<p>To continue our ongoing UKBB example, let's say we want to find PWAS associations for type-II diabetes. Then simply run:</p>\n<p>.. code-block:: cshell</p>\n<p>mkdir ./ukbb_imputation_per_gene_type2_diabetes_pwas_results\npwas_test_genes --dataset-file=./ukbb_dataset.csv --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --per-gene-pwas-results-dir=./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ --sample-id-col=eid --phenotype-col=\"Type 2 diabetes\" --covariate-cols-json-file=./ukbb_covariate_columns.json</p>\n<p>This process will go through each gene in <code>./ukbb_imputation_gene_effect_scores/</code> and run a logistic regression test of the \"Type 2 diabetes\" column in <code>./ukbb_dataset.csv</code> against the gene's effect scores (while also taking into account the covariates in the columns specified by <code>./ukbb_covariate_columns.json</code>). It will save the resulted summary statistics of each gene as a separate CSV file in <code>./ukbb_imputation_per_gene_type2_diabetes_pwas_results/</code>.</p>\n<p>This process too can be computationally intenstive (in terms of CPU time), especially for large datasets (with many samples and covariates) such as the UKBB. Fortunately, the <code>pwas_test_genes</code> command comes with a built-in functionality that allows one to distribute it across many computing resources. For full details on that, please refer to its help message. As an example, if you want to distribute the process across 1,000 tasks and send them to run on a cluster managed by SLURM, simply run:</p>\n<p>.. code-block:: cshell</p>\n<p>sbatch --array=0-999 --mem=32g -c1 --time=1-0 --wrap=\"pwas_test_genes --dataset-file=./ukbb_dataset.csv --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --per-gene-pwas-results-dir=./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ --sample-id-col=eid --phenotype-col='Type 2 diabetes' --covariate-cols-json-file=./ukbb_covariate_columns.json --task-index-env-variable=SLURM_ARRAY_TASK_ID --total-tasks-env-variable=SLURM_ARRAY_TASK_COUNT\"</p>\n<p>Here too, once everything is done and over with, it will be a good idea to validate that you've got the right number of files. These two command are expected to give you the same number:</p>\n<p>.. code-block:: cshell</p>\n<p>ls -l ./ukbb_imputation_gene_effect_scores/ | wc -l\nls -l ./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ | wc -l</p>\n<h2>Step 4.2: Collect the results and perform multiple-hypothesis testing correction</h2>\n<p>To collect the summary statistics calculated in the previous step (which are currently spread across many CSV files) and perform multiple-hypothesis testing correction, simply use the <code>combine_pwas_results</code> command.</p>\n<p>In our ongoing example, just run:</p>\n<p>.. code-block:: cshell</p>\n<p>combine_pwas_results --genes-file=./genes_hg19.csv --per-gene-pwas-results-dir=./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ --results-file=./ukbb_imputation_type2_diabetes_pwas_results.csv</p>\n<p>The file <code>./genes_hg19.csv</code> should have been generated by FIRM when you used it to estimate the variant effect scores. It is necessary to provide the details of all the genes which, up until this point, PWAS represented by nothing more than indices. PWAS is actually agnostic to the content of this file, and it simply concatenates it, as is, before the summary statistics of each gene.</p>\n<p>When the process is finished, you will have the file <code>./ukbb_imputation_type2_diabetes_pwas_results.csv</code> with the complete summary statistics of all tested genes. And that's the end of it - you are now the proud owner of freshly generated PWAS results!</p>\n<h2>Recap (the complete pipeline)</h2>\n<p>For quicker future reference, here's the complete pipeline for running PWAS for type-II diabetes over the imputed genotypes provided by the UK Biobank.</p>\n<p>First, to generate the necessary phenotype &amp; genotype files from the UKBB dataset, use the <code>ukbb_parser</code> package:</p>\n<p>.. code-block:: cshell</p>\n<pre><code>wget https://raw.githubusercontent.com/nadavbra/ukbb_parser/master/examples/phenotype_specs.py\ncreate_ukbb_phenotype_dataset --phenotype-specs-file=./phenotype_specs.py --output-dataset-file=./ukbb_dataset.csv --output-covariates-columns-file=./ukbb_covariate_columns.json\n</code></pre>\n<p>create_ukbb_genotype_spec_file --genotyping-type=imputation --output-file=./ukbb_imputation_genotyping_spec.csv</p>\n<p>Second, you will have to list all the dataset's variants and determine the reference allele of each variant:</p>\n<p>.. code-block:: cshell</p>\n<p>list_all_variants --genotyping-spec-file=./ukbb_imputation_genotyping_spec.csv --output-file=./ukbb_imputed_variants.csv --verbose\ndetermine_ref_alleles --variants-file=./ukbb_imputed_variants.csv --ref-genome-dir=/path/to/hg19/ --chrom-col=chromosome --pos-col=position --allele1-col=allele1 --allele2-col=allele2 --override --verbose</p>\n<p>And then calculate the variant effect scores (here using FIRM):</p>\n<p>.. code-block:: cshell</p>\n<p>firm_determine_extended_gene_effects_and_scores --variants-csv-file=./ukbb_imputed_variants.csv --output-effects-file=./ukbb_imputation_effects.jsonl --genes-dir=./ --ref-genome=GRCh37 --chrom-col=chromosome --pos-col=position --allele1-col=allele1 --allele2-col=allele2 --is-allele1-ref-col=is_allele1_ref</p>\n<p>Next, you will need to organize the variant effect scores per gene and aggregate them into gene effect scores (distributing that process on a cluster to speed things up):</p>\n<p>.. code-block:: cshell</p>\n<p>mkdir ./ukbb_imputation_variants_per_gene\norganize_variant_effects_per_gene --variants-file=./ukbb_imputed_variants.csv --effects-file=./ukbb_imputation_effects.jsonl --gene-variants-dir=./ukbb_imputation_variants_per_gene/\nmkdir ./ukbb_imputation_gene_effect_scores/\nsbatch --array=0-999 --mem=32g -c1 --time=1-0 --wrap=\"calc_gene_effect_scores --genotyping-spec-file=./ukbb_imputation_genotyping_spec.csv --gene-variants-dir=./ukbb_imputation_variants_per_gene/ --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --is-allele1-ref-col=is_allele1_ref --task-index-env-variable=SLURM_ARRAY_TASK_ID --total-tasks-env-variable=SLURM_ARRAY_TASK_COUNT\"</p>\n<p>And validate that you got the correct number of files:</p>\n<p>.. code-block:: cshell</p>\n<p>ls -l ./ukbb_imputation_variants_per_gene/ | wc -l\nls -l ./ukbb_imputation_gene_effect_scores/ | wc -l</p>\n<p>Lastly, run the actual association tests (again using a cluster):</p>\n<p>.. code-block:: cshell</p>\n<p>mkdir ./ukbb_imputation_per_gene_type2_diabetes_pwas_results\nsbatch --array=0-999 --mem=32g -c1 --time=1-0 --wrap=\"pwas_test_genes --dataset-file=./ukbb_dataset.csv --gene-effect-scores-dir=./ukbb_imputation_gene_effect_scores/ --per-gene-pwas-results-dir=./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ --sample-id-col=eid --phenotype-col='Type 2 diabetes' --covariate-cols-json-file=./ukbb_covariate_columns.json --task-index-env-variable=SLURM_ARRAY_TASK_ID --total-tasks-env-variable=SLURM_ARRAY_TASK_COUNT\"</p>\n<p>Validate that you've got all the files:</p>\n<p>.. code-block:: cshell</p>\n<p>ls -l ./ukbb_imputation_gene_effect_scores/ | wc -l\nls -l ./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ | wc -l</p>\n<p>And combine the results to get the final summary statistics file:</p>\n<p>.. code-block:: cshell</p>\n<p>combine_pwas_results --genes-file=./genes_hg19.csv --per-gene-pwas-results-dir=./ukbb_imputation_per_gene_type2_diabetes_pwas_results/ --results-file=./ukbb_imputation_type2_diabetes_pwas_results.csv</p>\n<h1>Cite us</h1>\n<p>If you use PWAS as part of work contributing to a scientific publication, we ask that you cite our preprint: Nadav Brandes, Nathan Linial, Michal Linial, PWAS: Proteome-Wide Association Study, bioRxiv, <a href=\"https://doi.org/10.1101/812289\" rel=\"nofollow\">https://doi.org/10.1101/812289</a></p>\n\n          </div>"}, "last_serial": 6776852, "releases": {"1.0.0": [{"comment_text": "", "digests": {"md5": "4cadc875732f3521b1eb6831802b8314", "sha256": "2f3997f2da9716334b217c480e89f39b11e9a538fbcf6e3be8d07e484989c738"}, "downloads": -1, "filename": "pwas-1.0.0-py3.7.egg", "has_sig": false, "md5_digest": "4cadc875732f3521b1eb6831802b8314", "packagetype": "bdist_egg", "python_version": "3.7", "requires_python": null, "size": 60543, "upload_time": "2020-03-09T13:00:38", "upload_time_iso_8601": "2020-03-09T13:00:38.682120Z", "url": "https://files.pythonhosted.org/packages/f7/52/c90867f47568ca8ce5a7303b89127e807778836adafec6c0f7df4e2be7a1/pwas-1.0.0-py3.7.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "b3757e85cfb2339b8f7333b9d961d437", "sha256": "b967fbc169dc5250220b3354ca68d562f4e1578d6ac2d9ea50544ccbfa54ac45"}, "downloads": -1, "filename": "pwas-1.0.0.tar.gz", "has_sig": false, "md5_digest": "b3757e85cfb2339b8f7333b9d961d437", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 25581, "upload_time": "2020-02-17T10:00:50", "upload_time_iso_8601": "2020-02-17T10:00:50.318799Z", "url": "https://files.pythonhosted.org/packages/b6/ca/1f2dadba1c29d50291b73f9e2df966216c1c55d019069e34534926cc08eb/pwas-1.0.0.tar.gz", "yanked": false}], "1.0.2": [{"comment_text": "", "digests": {"md5": "116edc75209dc888de299eb629c8d027", "sha256": "8da56f9066e6801d36e736826f9125d533abd6c0156fe1237d516bb34d165eba"}, "downloads": -1, "filename": "pwas-1.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "116edc75209dc888de299eb629c8d027", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 40056, "upload_time": "2020-03-09T13:00:37", "upload_time_iso_8601": "2020-03-09T13:00:37.194295Z", "url": "https://files.pythonhosted.org/packages/b1/cf/5e61f45c347d34f40fa65b0769d16dbc68dfa7137d8bc4b081e29f9fef21/pwas-1.0.2-py3-none-any.whl", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "116edc75209dc888de299eb629c8d027", "sha256": "8da56f9066e6801d36e736826f9125d533abd6c0156fe1237d516bb34d165eba"}, "downloads": -1, "filename": "pwas-1.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "116edc75209dc888de299eb629c8d027", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 40056, "upload_time": "2020-03-09T13:00:37", "upload_time_iso_8601": "2020-03-09T13:00:37.194295Z", "url": "https://files.pythonhosted.org/packages/b1/cf/5e61f45c347d34f40fa65b0769d16dbc68dfa7137d8bc4b081e29f9fef21/pwas-1.0.2-py3-none-any.whl", "yanked": false}], "timestamp": "Fri May  8 03:12:54 2020"}