{"info": {"author": "Ronald Oussoren", "author_email": "ronaldoussoren@mac.com", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Console", "Environment :: MacOS X :: Cocoa", "Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Natural Language :: English", "Operating System :: MacOS :: MacOS X", "Programming Language :: Objective C", "Programming Language :: Python", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3.8", "Topic :: Software Development :: Build Tools", "Topic :: Software Development :: Libraries :: Python Modules", "Topic :: Software Development :: User Interfaces"], "description": "py2app is a Python setuptools command which will allow\nyou to make standalone Mac OS X application bundles\nand plugins from Python scripts.\n\npy2app is similar in purpose and design to py2exe for\nWindows.\n\nNOTE: py2app must be used on OSX to build applications,\nit cannot create Mac applications on other platforms.\n\nProject links\n-------------\n\n* `Documentation <https://py2app.readthedocs.io/en/latest/>`_\n\n* `Issue Tracker <https://github.com/ronaldoussoren/py2app/issues>`_\n\n* `Repository <https://github.com/ronaldoussoren/py2app/>`_\n\nRelease history\n===============\n\n\n\npy2app 0.21\n-----------\n\n* PR 277 (Christian Clauss): Fix some Python 3 issues\n\n* #276: Rebuilt the binary stubs on a 10.12 machine to fix launching\n\npy2app 0.20\n-----------\n\n* Migrate to GitHub\n\n* #274: Fix an issue in the PyQt5 recipe\n\n* Fix issue with emulate-shell-environment option on macOS 10.15 (Catalina)\n\n* #269: Py2app didn't work with Python 3.8\n\npy2app 0.19\n-----------\n\n* #251: Add recipe for \"botocore\"\n\n* #253: \"python setup.py py2app -A\" creates invalid bundle from \"venv\" virtual environments\n\n* Updated recipe for PySide2 and new recipe for Shiboken2\n\n  Patch by Alberto Sottile.\n\npy2app 0.18\n-----------\n\n* #250: Add recipe for \"six.moves\", which also works when the six\n  library is vendored by other packages\n\npy2app 0.17\n-----------\n\n* #247: The new tkinter recipe didn't work properly for installations\n  that do use a framework install of Tcl/Tk.\n\npy2app 0.16\n-----------\n\n* #244: Copy the Tcl/Tk support libraries into the application bundle for\n  Python builds using a classic unix install of Tcl/Tk instead of a framework\n  build.\n\n  This results in working app bundles when a Python.org installation that\n  includes Tcl/Tk (such as Python 3.7).\n\n* Don't copy numpy into application just because the application uses\n  Pillow.\n\n* Add recipe for Pyside\n\n  Patch by Alberto Sottile\n\npy2app 0.15\n-----------\n\n* Fixed issues for Python 3.7, in particular changes in the plistlib library\n  (Issue #242, #239)\n\n* Updated dependencies on macholib, altgraph and modulegraph\n\n**Due to a bug in CPython 3.7.0 using -O does not work with that version of CPython**\n\npy2app 0.14.1\n-------------\n\n* Updated dependencies\n\n* Updated PyPI metadata\n\npy2app 0.14\n-----------\n\nFeatures:\n\n* Started using flake8 to improve coding style\n\nBug fixes:\n\n* Issue #222: The fix for issue #179 broke the argv emulator\n\n* Issue #226: Py2app could fail while reporting on possibly missing modules\n\n* Issue #228: The python executable included in the app bundle as ``sys.exectuable`` was not executable\n\n\npy2app 0.13\n-----------\n\nBug fixes:\n\n* Issue 185 in PyObjC's tracker: sysconfig using ``__import__`` in Python 3.6 or\n  later, which confuses modulegraph.\n\n* Pull request #17: Location of site-packages in the \"--user\" location has changed\n\n  Patch by Matt Mukerjee\n\nFeatures:\n\n* (None yet)\n\npy2app 0.12\n-----------\n\n* Pull request #15 by Armin Samii: Safer symlink and file copying\n\n* Update recipes: a number of recipe names conflicted with toplevel\n  modules imported by recipes. This causes problems on Python 2.7 (without\n  absolute imports)\n\npy2app 0.11\n-----------\n\n- Make sure the stdout/stderr streams of the main binary of the application\n  are unbuffered.\n\n  See `issue #177 in PyObjC's repository <https://github.com/ronaldoussoren/pyobjc/issues/177/on-python3-print-does-not-automatically>`_ for more information.\n\n- Fix issue #201: py2app is not compatible with pyvenv virtualenvs\n\n  With additional fix by Oskari Timperi.\n\n- Fix issue #179: the stdout/stderr streams are no longer forwarded to console.app using ASL (by default),\n  use \"--redirect-stdout-to-asl\" to enable the redirection functionality.\n\n  Note that for unclear reasons the redirection doesn't work on OSX 10.12 at the moment.\n\n- Fix issue #188: Troubles with lxml.isoschematron\n\n  The package 'lxml.isoschematron' is not zip-safe and tries to load resources using the normal\n  filesystem APIs, which doesn't work when the package is part of a zipfile.\n\n- py2applet now longer uses \"argv_emulation\" by default, that results in too many problems.\n\n- Issue #174: clean up the summary about missing modules by removing warnings about things that aren't modules.\n\n  Also notes when an module is likely an alias for some other module. These changes should remove a lot\n  of false postive warnings from the output of py2app.\n\n- Fix issue #161: opengl recipe uses \"file\" function that isn't present on Python 3\n\n- Add \"qt5\" recipe that does the right thing for the PyQt5 wheel on PyPI (tested with PyQt5 5.6)\n\n- Add support for \"@loader_path\" in the link commands of C extension.\n\n  This makes it possible to use wheels that were processed by `delocate-listdeps <https://github.com/matthew-brett/delocate>`_\n  when building application bundles.\n\n- Do not report imports that are expected to be missing\n\n  Patch by Barry Scott.\n\npy2app 0.10\n-----------\n\n- The recipe for virtualenv calls a modulegraph method that was made\n  private in a recent release and hence no longer worked with py2app 0.9.\n\n  Update the recipe to work around this.\n\n\npy2app 0.9\n----------\n\n- issue #146, #147: The \"python\" binary in MyApp.app/Contents/MacOS was\n  the small stub exetable from framework builds, instead of the actual\n  command-line interpreter. The result is that you couldn't use\n  ``sys.executable`` to start a new interpreter, which (amongst others)\n  breaks multiprocessing.\n\n- pull request #7: Add support for PyQt5 to the sip recipe. Patch by\n  Mark Montague.\n\n- pull request #4: Copying PySide plugins was broken due to bad\n  indentation.\n\n- pull request #5: py2app was broken for python versions that\n  don't use _sysconfigdata.\n\n- issue #135: Don't sleep for a second after compiling a XIB file\n\n- issue #134: Remove target location before copying files into\n  the bundle.\n\n- issue #133: Ensure that the application's \"Framework\" folder\n  is on the search path for ``ctypes.util.find_library``.\n\n- issue #132: Depend on modulegraph 0.12 to avoid build errors\n  when the python code contains references to compatibility modules\n  that contain SyntaxErrors for the current python version.\n\n- Explicitly report modules that cannot be found at the end of\n  the run (for non-alias builds)\n\n  Note: This is just a warning, missing modules are not necessarily\n  a problem because modulegraph can detect imports for modules that\n  aren't used on OSX (for example)\n\n- Report modules that contain syntax errors at the end of\n  the run (for non-alias builds)\n\n  Note: This is just a warning, syntax errors be valid when the\n  dependency tree contains modules for the other major release\n  of python (e.g a compat_py2 module that contains compatibility\n  code for Python 2 and contains code that isn't valid Python 3)\n\npy2app 0.8.1\n------------\n\n- Loading scripts didn't work when --no-chdir was used\n\n  Reported by Barry Scott in private mail.\n\npy2app 0.8\n-----------\n\npy2app 0.8 is a feature release\n\n\n- Fixed argv emulator on OSX 10.9, the way the code detected that the application\n  was launched through the Finder didn't work on that OSX release.\n\n- The launcher binary is now linked with Cocoa, that should avoid some problems\n  with sandboxed applications (in particular: standard open panels don't seem\n  to work properly in a sandboxed application when the main binary is not\n  linked to AppKit)\n\n- Don't copy Python's Makefile, Setup file and the like into a bundle when\n  sysconfig and distutils.sysconfig don't need these files (basicly, when\n  using any recent python version).\n\n- Fix some issues with virtualenv support:\n\n  * detection of system installs of Python didn't work properly when using\n    a virtualenv. Because of this py2app did not create a \"semi-standalone\"\n    bundle when using a virtualenv created with /usr/bin/python.\n\n  * \"semi-standalone\" bundles created from a virtualenv included more files\n    when they should (in particular bits of the stdlib)\n\n- Issue #92: Add option '--force-system-tk' which ensures that the _tkinter\n  extension (used by Tkinter) is linked against the Apple build of Tcl/Tk,\n  even when it is linked to another framework in Python's std. library.\n\n  This will cause a build error when tkinter is linked with a major version of\n  Tcl/Tk that is not present in /System/Library/Frameworks.\n\n- Issue #80: Add support for copying system plugins into the application\n  bundle.\n\n  Py2app now supports a new option *include_plugins*. The value of this\n  is a list of paths to plugins that should be copied into the application\n  bundle.\n\n  Items in the list are either paths, or a tuple with the plugin type\n  and the path::\n\n      include_plugins=[\n        \"MyPlugins/MyDocument.qlgenerator\",\n        (\"SystemConfiguration\", \"MyPlugins/MyConfig.plugin\"),\n      ]\n\n  Py2app currently knows about the following plugin suffixes:\n  ``.qlgenerator``, ``.mdimporter``, ``.xpc``, ``.service``,\n  ``.prefPane``, ``.iaplugin`` and ``.action``. These plugins\n  can be added without specifying the plugin type.\n\n- Issue #83: Setup.py now refuses to install when the current\n  platform is not Mac OS X.\n\n  This makes it clear that the package is only supported on OSX and\n  avoids confusing errors later on.\n\n- Issue #39: It is now possible to have subpackages on\n  in the \"packages\" option of py2app.\n\n- Issue #37: Add recipe for pyEnchant\n\n  ..note::\n\n    The recipe only works for installations of pyEnchant\n    where pyEnchant is stored in the installation (such\n    as the binary eggs on PyPI), not for installations\n    that either use the \"PYENCHANT_LIBRARY_PATH\" environment\n    variable or MacPorts.\n\n- Issue #90: Removed the 'email' recipe, but require a new enough version\n  of modulegraph instead. Because of this py2app now requires modulegraph\n  0.11 or later.\n\npy2app 0.7.4\n------------\n\n- Issue #77: the stdout/stderr streams of application and plugin bundles did not\n  end up in Console.app on OSX 10.8 (as they do on earlier releases of OSX). This\n  is due to a change in OSX.\n\n  With this version the application executable converts writes to the stdout\n  and stderr streams to the ASL logging subsystem with the options needed to\n  end up in the default view of Console.app.\n\n  NOTE: The stdout and stderr streams of plugin bundles are not redirected, as it\n  is rather bad form to change the global environment of the host application.\n\n- The i386, x86_64 and intel stub binaries are now compiled with clang on OSX 10.8,\n  instead of an older version of GCC. The other stub versions still are compiled\n  on OSX 10.6.\n\n- Issue #111: The site.py generated by py2app now contains a USER_SITE variable\n  (with a default value of ``None``) because some software tries to import the\n  value.\n\n- Py2app didn't preserve timestamps for files copied into application bundles,\n  and this can cause a bytecompiled file to appear older than the corresponding\n  source file (for packages copied in the bundle using the 'packages' option).\n\n  Related to issue #101\n\n- Py2app also didn't copy file permissions for files copied into application\n  bundles, which isn't a problem in general but did cause binaries to lose\n  there executable permissions (as noted on Stackoverflow)\n\n- Issue #101: Set \"PYTHONDONTWRITEBYTECODE\" in the environment before\n  calling Py_Initialize to ensure that the interpreter won't try to\n  write bytecode files (which can cause problems when using sandboxed\n  applications).\n\n- Issue #105: py2app can now create app and plugin bundles when the main script\n  has an encoding other than ASCII, in particular for Python 3.\n\n- Issue #106: Ensure that the PIL recipe works on Python 3. PIL itself isn't\n  ported yet, but Pillow does work with Python 3.\n\n- \"python setup.py install\" now fails unless the machine is running Mac OS X.\n\n  I've seen a number of reports of users that try to use py2app on Windows\n  or Linux to build OSX applications. That doesn't work, py2app now fails\n  during installation do make this clear.\n\n- Disabled the 'email' recipe for python 3.x as it isn't needed there.\n\n- Issue #91: Added a recipe for `lxml <http://lxml.de/>`, needed because\n  lxml performs a number of imports from an extension and those cannot\n  be detected automaticly by modulegraph.\n\n- Issue #94: The site-packages zipfile in the application bundle now contains\n  zipfile entries for directories as well. This is needed to work around\n  a bug in the zipimporter for Python 3.3: it won't consider 'pkg/foo.py' to be\n  in namespace package 'pkg' unless there is a zipfile entry for the 'pkg'\n  folder (or there is a 'pkg/__init__.py' entry).\n\n- Issue #97: Fixes a problem with the pyside and sip recipes when the 'qt_plugins'\n  option is used for 'image_plugins'.\n\n- Issue #96: py2app should work with python 2.6 again (previous releases didn't\n  work due to using the sysconfig module introduced in python 2.7)\n\n- Issue #99: appstore requires a number of symlinks in embedded frameworks.\n\n  (Version 0.7 already added a link Python.frameworks/Versions/Current, this\n  versions also adds Python.framework/Python and Python.framework/Resources with\n  the value required by the appstore upload tool).\n\n- Py2app copied stdlib packages into the app bundle for semi-standalone builds\n  when they are mentioned in the '--packages' option (either explicitly or\n  by a recipe). This was unintentional, semi-standlone builds should rely on\n  the external Python framework for the stdlib.\n\n  .. note::\n\n     Because of this bug parts of the stdlib of ``/usr/bin/python`` could be\n     copied into app bundles created with py2app.\n\npy2app 0.7.3\n------------\n\npy2app 0.7.3 is a bugfix release\n\n- Issue #82: Remove debug print statement from py2app.util.LOADER that\n  caused problems with Python 3.\n\n- Issue #81: Py2app now fails with an error when trying to build a bundle\n  for a unix-style shared library build of Python (``--enable-shared``) unless\n  you are using a recent enough patchlevel of python (2.7.4, 3.2.3, 3.3.1,\n  3.4.0, all of them are not released yet).\n\n  The build failure was added to avoid a very confusing error when trying\n  to start the generated application due to a bug in the way python reads\n  the environment (for shared library builds on Mac OS X).\n\n- Py2app will also give an error message when the python binary does not\n  have a shared library (or framework) at all.\n\n- Issue #87: Ignore '.git' and '.hg' directories while copying package data\n  ('.svn' and 'CVS' were already ignored).\n\n- Issue #65: the fix in 0.7 to avoid copying a symlinked library twice caused\n  problems for some users because only one of the file names ended up in the\n  application bundle. This release ensures that both names exist (one as a\n  symbolic name to the other).\n\n- Issue #88: Ensure that the fix for #65 won't try to create a symlink that\n  points to itself. This could for example occur with homebrew, where the\n  exposed lib directory contains symlinks to a cellar, while tye install_name\n  does mention the \"public\" lib directory::\n\n     $ ls -l /opt/homebrew/lib\n     ...\n     libglib-2.0.0.dylib -> ../Cellar/glib/2.32.4/lib/libglib-2.0.0.dylib\n     ...\n\n     $ otool -vL /opt/homebrew/lib/libglib-2.0.0.dylib\n     /opt/homebrew/lib/libglib-2.0.0.dylib:\n        /opt/homebrew/lib/libglib-2.0.0.dylib (compatibility version 3201.0.0, current version 3201.4.0)\n        time stamp 1 Thu Jan  1 01:00:01 1970\n     ...\n\n\n\npy2app 0.7.2\n------------\n\npy2app 0.7.2 is a bugfix release\n\n- Issue #75: Don't remove ``--dist-dir``, but only remove the old version\n  of the objects we're trying to build (if that exists).\n\n  This once again makes it possible to have a number of setup.py files that\n  build plugins into the same target folder (such as the plugins folder\n  of an application)\n\n- Issue #78: Packages added using the ``--packages`` option didn't end up\n  on ``sys.path`` for semi-standalone applications.\n\n  Reported by Steve Strassmann\n\n- Issue #76: Semi-standalone packages using extensions modules coudn't use\n  extensions unless they also used the ``--site-packages`` option (and\n  the extensions are in the site-packages directory).\n\n  Fixes some problems with PyQt and wxWidgets when using the system installation\n  of Python.\n\n  Patch by Dan Horner.\n\n- It is currently not possible to use a subpackage (\"foo.bar\") in the list\n  of packages for the \"packages\" option. Py2app now explicitly checks for this\n  and prints an error message instead of building an application that doesn't\n  work.\n\n  Issue: #39\n\n\npy2app 0.7.1\n------------\n\npy2app 0.7.1 is a bugfix release\n\n- Always include 'pkg_resources', this is needed to correctly work with\n  setuptools namespace packages, the __init__.py files of those contain\n  ``__import__('pkg_resources')`` and that call isn't recognized as an import\n  by the bytecode scanner.\n\n- Issue #67: py2applet didn't work with python 3 due to the use of 'raw_input'\n\n  Reported by Andrew Barnert.\n\n- Issue #68: the \"extra-scripts\" feature introduced in 0.7 couldn't copy scripts\n  that aren't in the same directory as \"setup.py\".\n\n  Reported by Andrew Barnert.\n\n- For semi-standalone applications the \"lib-dynload\" directory inside the\n  application was not on \"sys.path\", which resulted in launch failures\n  when using an extension that is not in the stdlib.\n\n- Issue #70: application fails to launch when script uses Windows line endings\n\n  Reported by Luc Jean.\n\npy2app 0.7\n------------\n\npy2app 0.7 is a bugfix release\n\n- Issue #65: generated bundle would crash when two libraries linked to the\n  same library using different names (one refering to the real name, the other\n  to a symlink).\n\n  An example if this is an application using wxWidgets when wxWidgets is installed\n  using homebrew.\n\n  Reported by \"Bouke\".\n\n- Issue #13: It is now possible to add helper scripts to a bundle, for\n  example for creating a GUI that starts a helper script in the background.\n\n  This can be done by using the option \"--extra-scripts\", the value of which is a list\n  of script files (\".py\" or \".pyw\" files).\n\n- Smarter matplotlib recipe, it is now possible to specify which backends should\n  be included. Issue #44, reported by Adam Kovics.\n\n  The argument to ``--matplotlib-backends`` (or 'matplotlib_backends' in setup.py)\n  is a list of plugins to include. Use '-' to not include backends other than those\n  found by the import statement analysis, and '*' to include all backends (without\n  necessarily including all of matplotlib)\n\n  As an example, use ``--matplotlib-backends=wxagg`` to include just the wxagg\n  backend.\n\n  Default is to include the entire matplotlib package.\n\n- The packages included by a py2app recipe weren't processed by modulegraph and\n  hence their dependencies were not always included.\n\n- Fix virtualenv support: alias builds in a virtual environment failed to work.\n\n  (There are still issues with semi-standalone and alias plugin bundles in\n  a virtualenv environment).\n\n- issue #18: improved PyQt and PySide support.\n\n  Py2app now has a new option named \"--qt-plugins\" (or \"qt_plugins\" in setup.py),\n  this option specify a list of plugins that should be included in the\n  application bundle. The items of the list can have a number of forms:\n\n  * \"plugintype/libplugin.dylib\"\n\n    Specify one particular plugin\n\n  * \"plugintype/\\*foo\\*\"\n\n    Specify one or more plugins using a glob pattern\n\n  * \"plugintype\"\n\n    Include all plugins of a type, equivalent to \"plugintype/\\*\".\n\n  The plugins are copied into \"Resources/qt_plugins\" and py2app adds a \"qt.conf\"\n  file that points to that location for plugins.\n\n- issue #49: package data that is a zipfile is now correctly copied into\n  the bundle instead of extracting the archive.\n\n- issue #59: compile site.py to ensure that the generated bundle doesn't\n  change on first run.\n\n  This is nice to have in general, and essential when using code signing\n  because the signature will break when a new file is added after signing.\n\n  Reported by Michael McCracken.\n\n- issue #60: recipe for \"email\" package was not loaded\n\n  Reported by Chris Beaumont\n\n- issue #46: py2app no longer warns about the Qt license. We don't warn about\n  other possibly GPL licensed software either and py2app is not\n  a license-enforcement tool.\n\n  Reported by briank_in_la.\n\n- Generated bundles always started with python optimization active\n  (that is, as if running as 'python -O').\n\n- Fix issue #53: py2app would crash if a data file happened to\n  be a zipfile.\n\n- py2app copies data files in the directory for a package into\n  the application bundle. It also did this for directories that\n  represent subpackages, which made it impossible to exclude\n  subpackages.\n\n- added recipe for wxPython because some subpackages of wxPython\n  use ``__path__`` trickery that confuses modulegraph.\n\n- recipes can now return a list of additional entries for the\n  'includes' list.\n\n- rewritten the recipe for matplotlib. The recipe no longer includes\n  the entire package, but just the \"mpl-data\" directory.\n\n  WARNING: This recipe has had limited testing.\n\n- fix mixed indentation (tabs and spaces) in argv_emulation.py,\n  which caused installation failures on python 3.x (issue #40)\n\n- Issue #43: py2app now creates a symlink named \"Current\" in the\n  'Versions' directory of the embedded Python framework to comply\n  with a requirement for the Mac App-store.\n\n- on some OSX releases the application receives both the\n  \"open application\" and \"open documents\" Apple Events during startup,\n  which broke an assumption in argv_emulation.py.\n\n- py2app is more strict w.r.t. explictly closing files, this avoids\n  ResourceWarnings for unclosed files.\n\n- fix test issue with semi-standalone builds on Python 3.2\n\n- added recipe for pyzmq\n\n- Don't use the version information from Python.framework's Info.plist,\n  but use ``sys.version_info``. This fixes a build problem with EPD.\n\n- Ignore some more files when copying package data:\n\n  - VIM swap files (``.foo.py.swp``)\n\n  - Backup files for a number of tools: ``foo.orig`` and ``foo~``\n\npy2app 0.6.4\n------------\n\npy2app 0.6.4 is a bugfix and minor feature release\n\n- Issue #28: the argv emulator crashes in 64-bit mode on OSX 10.5\n\n  Fixing this issue required yet another rewrite of the argv_emulator\n  code.\n\n- Added option '--arch=VALUE' which can be used to select the set of\n  architectures for the main executable. This defaults to the set of\n  architectures supported by the python interpreter and can be used to\n  drop support for some architectures (for example when you're using a\n  python binary that supports both 32-bit and 64-bit code and use a\n  GUI library that does not yet work in 64-bit mode).\n\n  Valid values for the argument are archectures used in the list below\n  and the following groups of architectures:\n\n  * fat:        i386, ppc\n\n  * fat3:       i386, x86_64, ppc\n\n  * univeral:   i386, x86_64, ppc, ppc64\n\n  * intel:      i386, x86_64\n\n\n\n- Issue #32: fix crash when application uses PySide\n\n  This is partially fixed in macholib (release 1.4.3)\n\n- The '-O' flag of py2app now defaults to the python optimization level\n  when using python 2.6 or later.\n\n- Issue #31: honor optimze flag at runtime.\n\n  Until now an application bundle created by py2app would also run without\n  the \"-O\" flag, even when the user specified it should. This is now fixed.\n\n- Issue #33: py2app's application bundle launcher now clears the environment\n  variable ``PYOBJC_BUNDLE_ADDRESS``, avoids a crash when using PyObjC in an\n  application launched from a py2app based plugin bundle.\n\n- py2app's bundle launcher set the environment variable ``PYOBJC_BUNDLE_ADDRESS``,\n  this variable is now deprecated. Use ``PYOBJC_BUNDLE_ADDRESS<PID>`` instead\n  (replace ``<PID>`` by the process ID of the current process).\n\n- When using the system python we now explicitly add Apple's additional packages\n  (like PyObjC and Twisted) to ``sys.path``.\n\n  This fixes and issue reported by Sean Robinson: py2app used to create a non-working\n  bundle when you used these packages because the packages didn't get included\n  (as intented), but were not available on ``sys.path`` either.\n\n- Fixed the recipe for sip, which in turn ensures that PyQt4 applications\n  work.\n\n  As before the SIP recipe is rather crude, it will include *all* SIP-based\n  packages into your application bundle when it detects a module that uses\n  SIP.\n\n- The 'Resources' folder is no longer on the python search path,\n  it contains the scripts while Python modules and packages are located\n  in the site-packages directory. This change is related to issue #30.\n\n- The folder 'Resources/Python/site-packages' is no longer on the python\n  search path. This folder is not used by py2app itself, but might by\n  used by custom build scripts that wrap around py2app.\n\n- Issue #30: py2app bundles failed to launch properly when the scriptfile\n  has the same name as a python package used by the application.\n\n- Issue #15: py2app now has an option to emulate the shell environment you\n  get by opening a window in the Terminal.\n\n  Usage: ``python setup.py py2app --emulate-shell-environment``\n\n  This option is experimental, it is far from certain that the implementation\n  works on all systems.\n\n- Issue #16: ``--argv-emulation`` now works with Python 3.x and in 64-bit\n  executables.\n\n- Issue #17: py2applet script defaults 'argv_emulation' to False when your using\n  a 64-bit build of python, because that option is not supported on\n  such builds.\n\n- py2app now clears the temporary directory in 'build' and the output directory\n  in 'dist' before doing anything. This avoids unwanted interactions between\n  results from a previous builds and the current build.\n\n- Issue #22: py2app will give an error when the specified version is invalid,\n  instead of causing a crash in the generated executable.\n\n- Issue #23: py2app failed to work when an .egg directory was implictly added\n  to ``sys.path`` by setuptools and the \"-O\" option was used (for example\n  ``python setup.py py2app -O2``)\n\n- Issue #26: py2app copied the wrong executable into the application bundle\n  when using virtualenv with a framework build of Python.\n\npy2app 0.6.3\n------------\n\npy2app 0.6.3 is a bugfix release\n\n- py2app failed to compile .xib files\n  (as reported on the pythonmac-sig mail-ing list).\n\n\npy2app 0.6.2\n------------\n\npy2app 0.6.2 is a bugfix release\n\n- py2app failed to copy the iconfile into application bundle\n  (reported by Russel Owen)\n\n- py2app failed to copy resources and data files as well\n  (the ``resource`` key in the py2ap options dictionary and\n  the ``data_files`` argument to the setup function).\n\n  Issue #19, reported by bryon(at)spideroak.com.\n\n- py2app failed to build application bundles when using virtualenv\n  due to assumptions about the relation between ``sys.prefix`` and\n  ``sys.executable``.\n\n  Report and fix by Erik van Zijst.\n\n- Ensure that the 'examples' directory is included in the source\n  archive\n\npy2app 0.6.1\n------------\n\npy2app 0.6.1 is a bugfix release\n\nBugfixes:\n\n- py2app failed to build the bundle when python package contained\n  a zipfile with data.\n\n  This version solves most of that problem using a rough\n  workaround (the issue is fixed when the filename ends with '.zip').\n\n- The code that recreates the stub executables when they are\n  older than the source code now uses ``xcode-select`` to\n  find the root of SDKs.\n\n  This makes it possible to recreate these executables on machines\n  where both Xcode 3 and Xcode 4 are installed and Xcode 3 is\n  the default Xcode.\n\n- The stub executables were regenerated using Xcode 3\n\n  As a word of warning: Xcode 4 cannot be used to rebuild the\n  stub executables, in particular not those that have support\n  for the PPC architecture.\n\n- Don't rebuild the stub executables automaticly, that's\n  unsafe with Xcode 4 and could trigger accidently when\n  files are installed in a different order than expected.\n\n- Small tweaks to the testsuite to ensure that they work\n  on systems with both Xcode3 and Xcode4 (Xcode3 must be\n  the selected version).\n\n- Better cleanup in the testsuite when ``setupClass`` fails.\n\npy2app 0.6\n----------\n\npy2app 0.6 is a minor feature release\n\n\nFeatures:\n\n- it is now possible to specify which python distributions must\n  be availble when building the bundle by using the\n  \"install_requires\" argument of the ``setup()`` function::\n\n     setup(\n\n         ...\n\t install_requires = [\n\t \t\"pyobjc == 2.2\"\n\t ],\n     )\n\n- py2app can now package namespace packages that were installed\n  using `pip <http://pypi.python.org/pypi/pip>` or the\n  setuptools install option ``--single-version-externally-managed``.\n\n- the bundle template now supports python3, based on a patch\n  by Virgil Dupras.\n\n- alias builds no longer use Carbon Aliases and therefore are\n  supported with python3 as well (patch by Virgil Dupras)\n\n- argv emulation doesn't work in python 3, this release\n  will tell you abou this instead of silently failing to\n  build a working bundle.\n\n- add support for custom URLs to the argv emulation code\n  (patch by Brendan Simon).\n\n  You will have to add a \"CFBundleURLTypes\" key to your Info.plist to\n  use this, the argv emulation code will ensure that the URL\n  to open will end up in ``sys.argv``.\n\n- ``py2app.util`` contains a number of functions that are now\n  deprecated an will be removed in a future version, specifically:\n  ``os_path_islink``, ``os_path_isdir``, ``path_to_zip``,\n  ``get_zip_data``, ``get_mtime``,  and ``os_readlink``.\n\n- The module ``py2app.simpleio`` no longer exists, and should never\n  have been in the repository (it was part of a failed rewrite of\n  the I/O layer).\n\nBug fixes:\n\n- fix problem with symlinks in copied framework, as reported\n  by Dan Ross.\n\n- py2applet didn't work in python 3.x.\n\n- The ``--alias`` option didn't work when building a plugin\n  bundle (issue #10, fix by Virgil Dupras)\n\n- Avoid copying the __pycache__ directory in python versions\n  that implement PEP 3147 (Python 3.2 and later)\n\n- App bundles with Python 3 now work when the application is\n  stored in a directory with non-ASCII characters in the full\n  name.\n\n- Do not compile ``.nib`` files, it is not strictly needed and\n  breaks PyObjC projects that still use the NibClassBuilder code.\n\n- Better error messsages when trying to include a non-existing\n  file as a resource.\n\n- Don't drop into PDB when an exception occurs.\n\n- Issue #5: Avoid a possible stack overflow in the bundle executable\n\n- Issue #9: Work with python 3.2\n\n- Fix build issues with python 2.5 (due to usage of too modern distutils\n  command subclasses)\n\n- The source distribution didn't include all files that needed to be\n  it ever since switching to mercurial, I've added a MANIFEST.in\n  file rather than relying on setuptool's autoguessing of files to include.\n\n- Bundle template works again with semi-standalone builds (such as\n  when using a system python), this rewrites the fix for issue #10\n  mentioned earlier.\n\n- Ensure py2app works correctly when the sources are located in a\n  directory with non-ascii characters in its name.\n\n\npy2app 0.5.2\n------------\n\npy2app 0.5.2 is a bugfix release\n\nBug fixes:\n\n- Ensure that the right stub executable gets found when using\n  the system python 2.5\n\npy2app 0.5.1\n------------\n\npy2app 0.5.1 is a bugfix release\n\nBug fixes:\n\n- Ensure stub executables get included in the egg files\n\n- Fix name of the bundletemplate stub executable for 32-bit builds\n\n\n\npy2app 0.5\n----------\n\npy2app 0.5 is a minor feature release.\n\nFeatures:\n\n- Add support for the ``--with-framework-name`` option of Python's\n  configure script, that is: py2app now also works when the Python\n  framework is not named 'Python.framework'.\n\n- Add support for various build flavours of Python (32bit, 3-way, ...)\n\n- py2app now actually works for me (ronaldoussoren@mac.com) with a\n  python interpreter in a virtualenv environment.\n\n- Experimental support for python 3\n\nBug fixes:\n\n- Fix recipe for matplotlib: that recipe caused an exception with\n  current versions of matplotlib and pytz.\n\n- Use modern API's in the alias-build bootstrap code, without\n  this 'py2app -A' will result in broken bundles on a 64-bit build\n  of Python.\n  (Patch contributed by James R Eagan)\n\n- Try both 'import Image' and 'from PIL import Image' in the PIL\n  recipe.\n  (Patch contributed by Christopher Barker)\n\n- The stub executable now works for 64-bit application bundles\n\n- (Lowlevel) The application stub was rewritten to use\n  ``dlopen`` instead of ``dyld`` APIs. This removes deprecation\n  warnings during compilation.\n\npy2app 0.4.3\n------------\n\npy2app 0.4.3 is a bugfix release\n\nBug fixes:\n\n- A bad format string in build_app.py made it impossible to copy the\n  Python framework into an app bundle.\n\npy2app 0.4.2\n------------\n\npy2app 0.4.2 is a minor feature release\n\nFeatures:\n\n- When the '--strip' option is specified we now also remove '.dSYM'\n  directories from the bundle.\n\n- Remove dependency on a 'version.plist' file in the python framework\n\n- A new recipe for `PyQt`_ 4.x. This recipe was donated by Kevin Walzer.\n\n- A new recipe for `virtualenv`_, this allows you to use py2app from\n  a virtual environment.\n\n.. _`virtualenv`: http://pypi.python.org/pypi/virtualenv\n\n- Adds support for converting ``.xib`` files (NIB files for\n  Interface Builder 3)\n\n- Introduces an experimental plugin API for data converters.\n\n  A conversion plugin should be defined as an entry-point in the\n  ``py2app.converter`` group::\n\n       setup(\n         ...\n\t entry_points = {\n\t\t 'py2app.converter': [\n\t\t     \"label          = some_module:converter_function\",\n\t\t  ]\n\t  },\n\t  ...\n      )\n\n  The conversion function should be defined like this::\n\n      from py2app.decorators import converts\n\n      @converts('.png')\n      def optimze_png(source, proposed_destionation, dryrun=0):\n         # Copy 'source' to 'proposed_destination'\n\t # The conversion is allowed to change the proposed\n\t # destination to another name in the same directory.\n         pass\n\n.. `virtualenv`_: http://pypi.python.org/pypi/virtualenv\n\nBuf fixes:\n\n- This fixes an issue with copying a different version of Python over\n  to an app/plugin bundle than the one used to run py2app with.\n\n\npy2app 0.4.0\n------------\n\npy2app 0.4.0 is a minor feature release (and was never formally released).\n\nFeatures:\n\n- Support for CoreData mapping models (introduced in Mac OS X 10.5)\n\n- Support for python packages that are stored in zipfiles (such as ``zip_safe``\n  python eggs).\n\nBug fixes:\n\n- Fix incorrect symlink target creation with an alias bundle that has included\n  frameworks.\n\n- Stuffit tends to extract archives recursively, which results in unzipped\n  code archives inside py2app-created bundles. This version has a workaround\n  for this \"feature\" for Stuffit.\n\n- Be more carefull about passing non-constant strings as the template argumenti\n  of string formatting functions (in the app and bundle templates), to avoid\n  crashes under some conditions.\n\npy2app 0.3.6\n------------\n\npy2app 0.3.6 is a minor bugfix release.\n\nBug fixes:\n\n- Ensure that custom icons are copied into the output bundle\n\n- Solve compatibility problem with some haxies and inputmanager plugins\n\n\npy2app 0.3.5\n------------\n\npy2app 0.3.5 is a minor bugfix release.\n\nBug fixes:\n\n- Resolve disable_linecache issue\n\n- Fix Info.plist and Python path for plugins\n\n\npy2app 0.3.4\n------------\n\npy2app 0.3.4 is a minor bugfix release.\n\nBug fixes:\n\n- Fixed a typo in the py2applet script\n\n- Removed some, but not all, compiler warnings from the bundle template\n  (which is still probably broken anyway)\n\n\npy2app 0.3.3\n------------\n\npy2app 0.3.3 is a minor bugfix release.\n\nBug Fixes:\n\n- Fixed a typo in the argv emulation code\n\n- Removed the unnecessary py2app.install hack (setuptools does that already)\n\n\npy2app 0.3.2\n------------\n\npy2app 0.3.2 is a major bugfix release.\n\nFunctional changes:\n\n- Massively updated documentation\n\n- New prefer-ppc option\n\n- New recipes: numpy, scipy, matplotlib\n\n- Updated py2applet script to take options, provide --make-setup\n\nBug Fixes:\n\n- No longer defaults to LSPrefersPPC\n\n- Replaced stdlib usage of argvemulator to inline version for i386\n  compatibility\n\n\npy2app 0.3.1\n------------\n\npy2app 0.3.1 is a minor bugfix release.\n\nFunctional changes:\n\n- New EggInstaller example\n\nBug Fixes:\n\n- Now ensures that the executable is +x (when installed from egg this may not\n  be the case)\n\n\npy2app 0.3.0\n------------\n\npy2app 0.3.0 is a major feature enhancements release.\n\nFunctional changes:\n\n- New --xref (-x) option similar to py2exe's that produces\n  a list of modules and their interdependencies as a HTML\n  file\n\n- sys.executable now points to a regular Python interpreter\n  alongside the regular executable, so spawning sub-interpreters\n  should work much more reliably\n\n- Application bootstrap now detects paths containing \":\"\n  and will provide a \"friendly\" error message instead of just\n  crashing <http://python.org/sf/1507224>.\n\n- Application bootstrap now sets PYTHONHOME instead of\n  a large PYTHONPATH\n\n- Application bootstrap rewritten in C that links to\n  CoreFoundation and Cocoa dynamically as needed,\n  so it doesn't imply any particular version of the runtime.\n\n- Documentation and examples changed to use setuptools\n  instead of distutils.core, which removes the need for\n  the py2app import\n\n- Refactored to use setuptools, distributed as an egg.\n\n- macholib, bdist_mpkg, modulegraph, and altgraph are now\n  separately maintained packages available on PyPI as eggs\n\n- macholib now supports little endian architectures,\n  64-bit Mach-O headers, and reading/writing of\n  multiple headers per file (fat / universal binaries)\n\n\npy2app 0.2.1\n------------\n\npy2app 0.2.1 is a minor bug fix release.\n\nBug Fixes:\n\n- macholib.util.in_system_path understands SDKs now\n\n- DYLD_LIBRARY_PATH searching is fixed\n\n- Frameworks and excludes options should work again.\n\n\npy2app 0.2.0\n------------\n\npy2app 0.2.0 is a minor bug fix release.\n\nFunctional changes:\n\n- New datamodels option to support CoreData.  Compiles\n  .xcdatamodel files and places them in the Resources dir\n  (as .mom).\n\n- New use-pythonpath option.  The py2app application bootstrap\n  will no longer use entries from PYTHONPATH unless this option\n  is used.\n\n- py2app now persists information about the build environment\n  (python version, executable, build style, etc.) in the\n  Info.plist and will clean the executable before rebuilding\n  if anything at all has changed.\n\n- bdist_mpkg now builds packages with the full platform info,\n  so that installing a package for one platform combination\n  will not look like an upgrade to another platform combination.\n\nBug Fixes:\n\n- Fixed a bug in standalone building, where a rebuild could\n  cause an unlaunchable executable.\n\n- Plugin bootstrap should compile/link correctly\n  with gcc 4.\n\n- Plugin bootstrap no longer sets PYTHONHOME and will\n  restore PYTHONPATH after initialization.\n\n- Plugin bootstrap swaps out thread state upon plug-in\n  load if it is the first to initialize Python.  This\n  fixes threading issues.\n\npy2app 0.1.9\n------------\n\npy2app 0.1.9 is a minor bug fix release.\n\nBugs fixed:\n\n- bdist_mpkg now builds zip files that are correctly unzipped\n  by all known tools.\n\n- The behavior of the bootstrap has changed slightly such that\n  ``__file__`` should now point to your main script, rather than\n  the bootstrap.  The main script has also moved to ``Resources``,\n  from ``Resources/Python``, so that ``__file__`` relative resource\n  paths should still work.\n\npy2app 0.1.8\n------------\n\npy2app 0.1.8 is a major enhancements release:\n\nBugs fixed:\n\n- Symlinks in included frameworks should be preserved correctly\n  (fixes Tcl/Tk)\n\n- Fixes some minor issues with alias bundles\n\n- Removed implicit SpiderImagePlugin -> ImageTk reference in PIL\n  recipe\n\n- The ``--optimize`` option should work now\n\n- ``weakref`` is now included by default\n\n- ``anydbm``'s dynamic dependencies are now in the standard implies\n  list\n\n- Errors on app launch are brought to the front so the user does\n  not miss them\n\n- bdist_mpkg now compatible with pychecker (data_files had issues)\n\nOptions changed:\n\n- deprecated ``--strip``, it is now on by default\n\n- new ``--no-strip`` option to turn off stripping of executables\n\nNew features:\n\n- Looks for a hacked version of the PyOpenGL __init__.py so that\n  it doesn't have to include the whole package in order to get\n  at the stupid version file.\n\n- New ``loader_files`` key that a recipe can return in order to\n  ensure that non-code ends up in the .zip (the pygame recipe\n  uses this)\n\n- Now scans all files in the bundle and normalizes Mach-O load\n  commands, not just extensions.  This helps out when using the\n  ``--package`` option, when including frameworks that have plugins,\n  etc.\n\n- An embedded Python interpreter is now included in the executable\n  bundle (``sys.executable`` points to it), this currently only\n  works for framework builds of Python\n\n- New ``macho_standalone`` tool\n\n- New ``macho_find`` tool\n\n- Major enhancements to the way plugins are built\n\n- bdist_mpkg now has a ``--zipdist`` option to build zip files\n  from the built package\n\n- The bdist_mpkg \"Installed to:\" description is now based on the\n  package install root, rather than the build root\n\npy2app 0.1.7\n------------\n\n`py2app`_ 0.1.7 is a bug fix release:\n\n- The ``bdist_mpkg`` script will now set up sys.path properly, for setup scripts\n  that require local imports.\n\n- ``bdist_mpkg`` will now correctly accept ``ReadMe``, ``License``, ``Welcome``,\n  and ``background`` files by parameter.\n\n- ``bdist_mpkg`` can now display a custom background again (0.1.6 broke this).\n\n- ``bdist_mpkg`` now accepts a ``build-base=`` argument, to put build files in\n  an alternate location.\n\n- ``py2app`` will now accept main scripts with a ``.pyw`` extension.\n\n- ``py2app``'s not_stdlib_filter will now ignore a ``site-python`` directory as\n  well as ``site-packages``.\n\n- ``py2app``'s plugin bundle template no longer displays GUI dialogs by default,\n  but still links to ``AppKit``.\n\n- ``py2app`` now ensures that the directory of the main script is now added to\n  ``sys.path`` when scanning modules.\n\n- The ``py2app`` build command has been refactored such that it would be easier\n  to change its behavior by subclassing.\n\n- ``py2app`` alias bundles can now cope with editors that do atomic saves\n  (write new file, swap names with existing file).\n\n- ``macholib`` now has minimal support for fat binaries.  It still assumes big\n  endian and will not make any changes to a little endian header.\n\n- Add a warning message when using the ``install`` command rather than installing\n  from a package.\n\n- New ``simple/structured`` example that shows how you could package an\n  application that is organized into several folders.\n\n- New ``PyObjC/pbplugin`` Xcode Plug-In example.\n\npy2app 0.1.6\n------------\n\nSince I have been slacking and the last announcement was for 0.1.4, here are the\nchanges for the soft-launched releases 0.1.5 and 0.1.6:\n\n`py2app`_ 0.1.6 was a major feature enhancements release:\n\n- ``py2applet`` and ``bdist_mpkg`` scripts have been moved to Python modules\n  so that the functionality can be shared with the tools.\n\n- Generic graph-related functionality from ``py2app`` was moved to\n  ``altgraph.ObjectGraph`` and ``altgraph.GraphUtil``.\n\n- ``bdist_mpkg`` now outputs more specific plist requirements\n  (for future compatibility).\n\n- ``py2app`` can now create plugin bundles (MH_BUNDLE) as well as executables.\n  New recipe for supporting extensions built with `sip`_, such as `PyQt`_.  Note that\n  due to the way that `sip`_ works, when one sip-based extension is used, *all*\n  sip-based extensions are included in your application.  In practice, this means\n  anything provided by `Riverbank`_, I don't think anyone else uses `sip`_ (publicly).\n\n- New recipe for `PyOpenGL`_.  This is very naive and simply includes the whole\n  thing, rather than trying to monkeypatch their brain-dead\n  version acquisition routine in ``__init__``.\n\n- Bootstrap now sets ``ARGVZERO`` and ``EXECUTABLEPATH`` environment variables,\n  corresponding to the ``argv[0]`` and the ``_NSGetExecutablePath(...)`` that the\n  bundle saw.  This is only really useful if you need to relaunch your own\n  application.\n\n- More correct ``dyld`` search behavior.\n\n- Refactored ``macholib`` to use ``altgraph``, can now generate `GraphViz`_ graphs\n  and more complex analysis of dependencies can be done.\n\n- ``macholib`` was refactored to be easier to maintain, and the structure handling\n  has been optimized a bit.\n\n- The few tests that there are were refactored in `py.test`_ style.\n\n- New `PyQt`_ example.\n\n- New `PyOpenGL`_ example.\n\n\nSee also:\n\n- http://mail.python.org/pipermail/pythonmac-sig/2004-December/012272.html\n\n.. _`py.test`: http://codespeak.net/py/current/doc/test.html\n.. _`PyOpenGL`: http://pyopengl.sourceforge.net/\n.. _`Riverbank`: http://www.riverbankcomputing.co.uk/\n.. _`sip`: http://www.riverbankcomputing.co.uk/sip/index.php\n.. _`PyQt`: http://www.riverbankcomputing.co.uk/pyqt/index.php\n.. _`docutils`: http://docutils.sf.net/\n.. _`setuptools`: http://cvs.eby-sarna.com/PEAK/setuptools/\n\npy2app 0.1.5\n------------\n\n`py2app`_ 0.1.5 is a major feature enhancements release:\n\n- Added a ``bdist_mpkg`` distutils extension, for creating Installer\n  an metapackage from any distutils script.\n\n  - Includes PackageInstaller tool\n\n  - bdist_mpkg script\n\n  - setup.py enhancements to support bdist_mpkg functionality\n\n- Added a ``PackageInstaller`` tool, a droplet that performs the same function\n    as the ``bdist_mpkg`` script.\n\n- Create a custom ``bdist_mpkg`` subclass for `py2app`_'s setup script.\n\n- Source package now includes `PJE`_'s `setuptools`_ extension to distutils.\n\n- Added lots of metadata to the setup script.\n\n- ``py2app.modulegraph`` is now a top-level package, ``modulegraph``.\n\n- ``py2app.find_modules`` is now ``modulegraph.find_modules``.\n\n- Should now correctly handle paths (and application names) with unicode characters\n  in them.\n\n- New ``--strip`` option for ``py2app`` build command, strips all Mach-O files\n  in output application bundle.\n\n- New ``--bdist-base=`` option for ``py2app`` build command, allows an alternate\n  build directory to be specified.\n\n- New `docutils`_ recipe.\n  Support for non-framework Python, such as the one provided by `DarwinPorts`_.\n\nSee also:\n\n- http://mail.python.org/pipermail/pythonmac-sig/2004-October/011933.html\n\n.. _`py.test`: http://codespeak.net/py/current/doc/test.html\n.. _`GraphViz`: http://www.pixelglow.com/graphviz/\n.. _`PyOpenGL`: http://pyopengl.sourceforge.net/\n.. _`Riverbank`: http://www.riverbankcomputing.co.uk/\n.. _`sip`: http://www.riverbankcomputing.co.uk/sip/index.php\n.. _`PyQt`: http://www.riverbankcomputing.co.uk/pyqt/index.php\n.. _`DarwinPorts`: http://darwinports.opendarwin.org/\n.. _`setuptools`: http://cvs.eby-sarna.com/PEAK/setuptools/\n.. _`PJE`: http://dirtSimple.org/\n.. _`PyObjC`: http://pyobjc.sourceforge.net/\n\npy2app 0.1.4\n------------\n\n`py2app`_ 0.1.4 is a minor bugfix release:\n\n- The ``altgraph`` from 0.1.3 had a pretty nasty bug in it that prevented\n  filtering from working properly, so I fixed it and bumped to 0.1.4.\n\npy2app 0.1.3\n------------\n\n`py2app`_ 0.1.3 is a refactoring and new features release:\n\n- ``altgraph``, my fork of Istvan Albert's `graphlib`_, is now part of the\n  distribution\n\n- ``py2app.modulegraph`` has been refactored to use ``altgraph``\n\n- `py2app`_ can now create `GraphViz`_ DOT graphs with the ``-g`` option\n  (`TinyTinyEdit example`_)\n\n- Moved the filter stack into ``py2app.modulegraph``\n\n- Fixed a bug that may have been in 0.1.2 where explicitly included packages\n  would not be scanned by ``macholib``\n\n- ``py2app.apptemplate`` now contains a stripped down ``site`` module as\n  opposed to a ``sitecustomize``\n\n- Alias builds are now the only ones that contain the system and user\n  ``site-packages`` directory in ``sys.path``\n\n- The ``pydoc`` recipe has been beefed up to also exclude ``BaseHTTPServer``,\n  etc.\n\nKnown issues:\n\n- Commands marked with XXX in the help are not implemented\n\n- Includes *all* files from packages, it should be smart enough to strip\n  unused .py/.pyc/.pyo files (to save space, depending on which optimization\n  flag is used)\n\n- ``macholib`` should be refactored to use ``altgraph``\n\n- ``py2app.build_app`` and ``py2app.modulegraph`` should be refactored to\n  search for dependencies on a per-application basis\n\n.. _`graphlib`: http://www.personal.psu.edu/staff/i/u/iua1/python/graphlib/html/\n.. _`TinyTinyEdit example`: http://undefined.org/~bob/TinyTinyEdit.pdf\n\npy2app 0.1.2\n------------\n\n`py2app`_ 0.2 is primarily a bugfix release:\n\n- The encodings package now gets included in the zip file (saves space)\n\n- A copy of the Python interpreter is not included anymore in standalone\n  builds (saves space)\n\n- The executable bootstrap is now stripped by default (saves a little space)\n\n- ``sys.argv`` is set correctly now, it used to point to the executable, now\n  it points to the boot script.  This should enhance compatibility with some\n  applications.\n\n- Adds an \"Alias\" feature to modulegraph, so that ``sys.modules`` craziness\n  such as ``wxPython.wx -> wx`` can be accomodated (this particular craziness\n  is also now handled by default)\n\n- A ``sys.path`` alternative may be passed to ``find_modules`` now, though\n  this is not used yet\n\n- The ``Command`` instance is now passed to recipes instead of the\n  ``Distribution`` instance (though no recipes currently use either)\n\n- The post-filtering of modules and extensions is now generalized into a\n  stack and can be modified by recipes\n\n- A `wxPython`_ example demonstrating how to package `wxGlade`_ has been\n  added (this is a good example of how to write your own recipe, and how to\n  deal with complex applications that mix code and data files)\n\n- ``PyRuntimeLocations`` is now set to (only) the location of the current\n  interpreter's ``Python.framework`` for alias and semi-standalone build\n  modes (enhances compatibility with extensions built with an unpatched\n  Makefile with Mac OS X 10.3's Python 2.3.0)\n\nKnown issues:\n\n- Includes *all* files from packages, it should be smart enough to strip\n  unused .py/.pyc/.pyo files (to save space, depending on which optimization\n  flag is used).\n\n.. _`wxGlade`: http://wxglade.sourceforge.net/\n\npy2app 0.1.1\n------------\n\n`py2app`_ 0.1.1 is primarily a bugfix release:\n\n- Several problems related to Mac OS X 10.2 compatibility and standalone\n   building have been resolved\n\n- Scripts that are not in the same directory as setup.py now work\n\n- A new recipe has been added that removes the pydoc -> Tkinter dependency\n\n- A recipe has been added for `py2app`_ itself\n\n- a `wxPython`_ example (superdoodle) has been added.\n  Demonstrates not only how easy it is (finally!) to bundle\n  `wxPython`_ applications, but also how one setup.py can\n  deal with both `py2exe`_ and `py2app`_.\n\n- A new experimental tool, py2applet, has been added.\n  Once you've built it (``python setup.py py2app``, of course), you should\n  be able to build simple applications simply by dragging your main script\n  and optionally any packages, data files, Info.plist and icon it needs.\n\nKnown issues:\n\n- Includes *all* files from packages, it should be smart enough to strip\n  unused .py/.pyc/.pyo files (to save space, depending on which\n  optimization flag is used).\n\n- The default ``PyRuntimeLocations`` can cause problems on machines that\n  have a /Library/Frameworks/Python.framework installed.  Workaround is\n  to set a plist that has the following key:\n  ``PyRuntimeLocations=['/System/Library/Frameworks/Python.framework/Versions/2.3/Python']``\n  (this will be resolved soon)\n\n\npy2app 0.1\n----------\n\n(first public release)\n`py2app`_ is the bundlebuilder replacement we've all been waiting\nfor.  It is implemented as a distutils command, similar to `py2exe`_.\n\n.. _`wxPython`: http://www.wxpython.org/\n.. _`py2app`: http://undefined.org/python/#py2app\n.. _`py2exe`: http://starship.python.net/crew/theller/py2exe/\n\n\n", "description_content_type": "text/x-rst; charset=UTF-8", "docs_url": "https://pythonhosted.org/py2app/", "download_url": "http://pypi.python.org/pypi/py2app", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://github.com/ronaldoussoren/py2app", "keywords": ".app,standalone", "license": "MIT or PSF License", "maintainer": "Ronald Oussoren", "maintainer_email": "ronaldoussoren@mac.com", "name": "py2app", "package_url": "https://pypi.org/project/py2app/", "platform": "MacOS X", "project_url": "https://pypi.org/project/py2app/", "project_urls": {"Documentation": "https://py2app.readthedocs.io/en/latest/", "Download": "http://pypi.python.org/pypi/py2app", "Homepage": "http://github.com/ronaldoussoren/py2app", "Issue tracker": "https://github.com/ronaldoussoren/py2app/issues", "Repository": "https://github.com/ronaldoussoren/py2app"}, "release_url": "https://pypi.org/project/py2app/0.21/", "requires_dist": ["altgraph (>=0.16)", "modulegraph (>=0.17)", "macholib (>=1.11)"], "requires_python": "", "summary": "Create standalone Mac OS X applications with Python", "version": "0.21", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>py2app is a Python setuptools command which will allow\nyou to make standalone Mac OS X application bundles\nand plugins from Python scripts.</p>\n<p>py2app is similar in purpose and design to py2exe for\nWindows.</p>\n<p>NOTE: py2app must be used on OSX to build applications,\nit cannot create Mac applications on other platforms.</p>\n<div id=\"project-links\">\n<h2>Project links</h2>\n<ul>\n<li><a href=\"https://py2app.readthedocs.io/en/latest/\" rel=\"nofollow\">Documentation</a></li>\n<li><a href=\"https://github.com/ronaldoussoren/py2app/issues\" rel=\"nofollow\">Issue Tracker</a></li>\n<li><a href=\"https://github.com/ronaldoussoren/py2app/\" rel=\"nofollow\">Repository</a></li>\n</ul>\n<div id=\"release-history\">\n<h3>Release history</h3>\n</div>\n</div>\n<div id=\"py2app-0-21\">\n<h2>py2app 0.21</h2>\n<ul>\n<li>PR 277 (Christian Clauss): Fix some Python 3 issues</li>\n<li>#276: Rebuilt the binary stubs on a 10.12 machine to fix launching</li>\n</ul>\n</div>\n<div id=\"py2app-0-20\">\n<h2>py2app 0.20</h2>\n<ul>\n<li>Migrate to GitHub</li>\n<li>#274: Fix an issue in the PyQt5 recipe</li>\n<li>Fix issue with emulate-shell-environment option on macOS 10.15 (Catalina)</li>\n<li>#269: Py2app didn’t work with Python 3.8</li>\n</ul>\n</div>\n<div id=\"py2app-0-19\">\n<h2>py2app 0.19</h2>\n<ul>\n<li><p>#251: Add recipe for “botocore”</p>\n</li>\n<li><p>#253: “python setup.py py2app -A” creates invalid bundle from “venv” virtual environments</p>\n</li>\n<li><p>Updated recipe for PySide2 and new recipe for Shiboken2</p>\n<p>Patch by Alberto Sottile.</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-18\">\n<h2>py2app 0.18</h2>\n<ul>\n<li>#250: Add recipe for “six.moves”, which also works when the six\nlibrary is vendored by other packages</li>\n</ul>\n</div>\n<div id=\"py2app-0-17\">\n<h2>py2app 0.17</h2>\n<ul>\n<li>#247: The new tkinter recipe didn’t work properly for installations\nthat do use a framework install of Tcl/Tk.</li>\n</ul>\n</div>\n<div id=\"py2app-0-16\">\n<h2>py2app 0.16</h2>\n<ul>\n<li><p>#244: Copy the Tcl/Tk support libraries into the application bundle for\nPython builds using a classic unix install of Tcl/Tk instead of a framework\nbuild.</p>\n<p>This results in working app bundles when a Python.org installation that\nincludes Tcl/Tk (such as Python 3.7).</p>\n</li>\n<li><p>Don’t copy numpy into application just because the application uses\nPillow.</p>\n</li>\n<li><p>Add recipe for Pyside</p>\n<p>Patch by Alberto Sottile</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-15\">\n<h2>py2app 0.15</h2>\n<ul>\n<li>Fixed issues for Python 3.7, in particular changes in the plistlib library\n(Issue #242, #239)</li>\n<li>Updated dependencies on macholib, altgraph and modulegraph</li>\n</ul>\n<p><strong>Due to a bug in CPython 3.7.0 using -O does not work with that version of CPython</strong></p>\n</div>\n<div id=\"py2app-0-14-1\">\n<h2>py2app 0.14.1</h2>\n<ul>\n<li>Updated dependencies</li>\n<li>Updated PyPI metadata</li>\n</ul>\n</div>\n<div id=\"py2app-0-14\">\n<h2>py2app 0.14</h2>\n<p>Features:</p>\n<ul>\n<li>Started using flake8 to improve coding style</li>\n</ul>\n<p>Bug fixes:</p>\n<ul>\n<li>Issue #222: The fix for issue #179 broke the argv emulator</li>\n<li>Issue #226: Py2app could fail while reporting on possibly missing modules</li>\n<li>Issue #228: The python executable included in the app bundle as <tt>sys.exectuable</tt> was not executable</li>\n</ul>\n</div>\n<div id=\"py2app-0-13\">\n<h2>py2app 0.13</h2>\n<p>Bug fixes:</p>\n<ul>\n<li><p>Issue 185 in PyObjC’s tracker: sysconfig using <tt>__import__</tt> in Python 3.6 or\nlater, which confuses modulegraph.</p>\n</li>\n<li><p>Pull request #17: Location of site-packages in the “–user” location has changed</p>\n<p>Patch by Matt Mukerjee</p>\n</li>\n</ul>\n<p>Features:</p>\n<ul>\n<li>(None yet)</li>\n</ul>\n</div>\n<div id=\"py2app-0-12\">\n<h2>py2app 0.12</h2>\n<ul>\n<li>Pull request #15 by Armin Samii: Safer symlink and file copying</li>\n<li>Update recipes: a number of recipe names conflicted with toplevel\nmodules imported by recipes. This causes problems on Python 2.7 (without\nabsolute imports)</li>\n</ul>\n</div>\n<div id=\"py2app-0-11\">\n<h2>py2app 0.11</h2>\n<ul>\n<li><p>Make sure the stdout/stderr streams of the main binary of the application\nare unbuffered.</p>\n<p>See <a href=\"https://github.com/ronaldoussoren/pyobjc/issues/177/on-python3-print-does-not-automatically\" rel=\"nofollow\">issue #177 in PyObjC’s repository</a> for more information.</p>\n</li>\n<li><p>Fix issue #201: py2app is not compatible with pyvenv virtualenvs</p>\n<p>With additional fix by Oskari Timperi.</p>\n</li>\n<li><p>Fix issue #179: the stdout/stderr streams are no longer forwarded to console.app using ASL (by default),\nuse “–redirect-stdout-to-asl” to enable the redirection functionality.</p>\n<p>Note that for unclear reasons the redirection doesn’t work on OSX 10.12 at the moment.</p>\n</li>\n<li><p>Fix issue #188: Troubles with lxml.isoschematron</p>\n<p>The package ‘lxml.isoschematron’ is not zip-safe and tries to load resources using the normal\nfilesystem APIs, which doesn’t work when the package is part of a zipfile.</p>\n</li>\n<li><p>py2applet now longer uses “argv_emulation” by default, that results in too many problems.</p>\n</li>\n<li><p>Issue #174: clean up the summary about missing modules by removing warnings about things that aren’t modules.</p>\n<p>Also notes when an module is likely an alias for some other module. These changes should remove a lot\nof false postive warnings from the output of py2app.</p>\n</li>\n<li><p>Fix issue #161: opengl recipe uses “file” function that isn’t present on Python 3</p>\n</li>\n<li><p>Add “qt5” recipe that does the right thing for the PyQt5 wheel on PyPI (tested with PyQt5 5.6)</p>\n</li>\n<li><p>Add support for “@loader_path” in the link commands of C extension.</p>\n<p>This makes it possible to use wheels that were processed by <a href=\"https://github.com/matthew-brett/delocate\" rel=\"nofollow\">delocate-listdeps</a>\nwhen building application bundles.</p>\n</li>\n<li><p>Do not report imports that are expected to be missing</p>\n<p>Patch by Barry Scott.</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-10\">\n<h2>py2app 0.10</h2>\n<ul>\n<li><p>The recipe for virtualenv calls a modulegraph method that was made\nprivate in a recent release and hence no longer worked with py2app 0.9.</p>\n<p>Update the recipe to work around this.</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-9\">\n<h2>py2app 0.9</h2>\n<ul>\n<li><p>issue #146, #147: The “python” binary in MyApp.app/Contents/MacOS was\nthe small stub exetable from framework builds, instead of the actual\ncommand-line interpreter. The result is that you couldn’t use\n<tt>sys.executable</tt> to start a new interpreter, which (amongst others)\nbreaks multiprocessing.</p>\n</li>\n<li><p>pull request #7: Add support for PyQt5 to the sip recipe. Patch by\nMark Montague.</p>\n</li>\n<li><p>pull request #4: Copying PySide plugins was broken due to bad\nindentation.</p>\n</li>\n<li><p>pull request #5: py2app was broken for python versions that\ndon’t use _sysconfigdata.</p>\n</li>\n<li><p>issue #135: Don’t sleep for a second after compiling a XIB file</p>\n</li>\n<li><p>issue #134: Remove target location before copying files into\nthe bundle.</p>\n</li>\n<li><p>issue #133: Ensure that the application’s “Framework” folder\nis on the search path for <tt>ctypes.util.find_library</tt>.</p>\n</li>\n<li><p>issue #132: Depend on modulegraph 0.12 to avoid build errors\nwhen the python code contains references to compatibility modules\nthat contain SyntaxErrors for the current python version.</p>\n</li>\n<li><p>Explicitly report modules that cannot be found at the end of\nthe run (for non-alias builds)</p>\n<p>Note: This is just a warning, missing modules are not necessarily\na problem because modulegraph can detect imports for modules that\naren’t used on OSX (for example)</p>\n</li>\n<li><p>Report modules that contain syntax errors at the end of\nthe run (for non-alias builds)</p>\n<p>Note: This is just a warning, syntax errors be valid when the\ndependency tree contains modules for the other major release\nof python (e.g a compat_py2 module that contains compatibility\ncode for Python 2 and contains code that isn’t valid Python 3)</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-8-1\">\n<h2>py2app 0.8.1</h2>\n<ul>\n<li><p>Loading scripts didn’t work when –no-chdir was used</p>\n<p>Reported by Barry Scott in private mail.</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-8\">\n<h2>py2app 0.8</h2>\n<p>py2app 0.8 is a feature release</p>\n<ul>\n<li><p>Fixed argv emulator on OSX 10.9, the way the code detected that the application\nwas launched through the Finder didn’t work on that OSX release.</p>\n</li>\n<li><p>The launcher binary is now linked with Cocoa, that should avoid some problems\nwith sandboxed applications (in particular: standard open panels don’t seem\nto work properly in a sandboxed application when the main binary is not\nlinked to AppKit)</p>\n</li>\n<li><p>Don’t copy Python’s Makefile, Setup file and the like into a bundle when\nsysconfig and distutils.sysconfig don’t need these files (basicly, when\nusing any recent python version).</p>\n</li>\n<li><p>Fix some issues with virtualenv support:</p>\n<ul>\n<li>detection of system installs of Python didn’t work properly when using\na virtualenv. Because of this py2app did not create a “semi-standalone”\nbundle when using a virtualenv created with /usr/bin/python.</li>\n<li>“semi-standalone” bundles created from a virtualenv included more files\nwhen they should (in particular bits of the stdlib)</li>\n</ul>\n</li>\n<li><p>Issue #92: Add option ‘–force-system-tk’ which ensures that the _tkinter\nextension (used by Tkinter) is linked against the Apple build of Tcl/Tk,\neven when it is linked to another framework in Python’s std. library.</p>\n<p>This will cause a build error when tkinter is linked with a major version of\nTcl/Tk that is not present in /System/Library/Frameworks.</p>\n</li>\n<li><p>Issue #80: Add support for copying system plugins into the application\nbundle.</p>\n<p>Py2app now supports a new option <em>include_plugins</em>. The value of this\nis a list of paths to plugins that should be copied into the application\nbundle.</p>\n<p>Items in the list are either paths, or a tuple with the plugin type\nand the path:</p>\n<pre>include_plugins=[\n  \"MyPlugins/MyDocument.qlgenerator\",\n  (\"SystemConfiguration\", \"MyPlugins/MyConfig.plugin\"),\n]\n</pre>\n<p>Py2app currently knows about the following plugin suffixes:\n<tt>.qlgenerator</tt>, <tt>.mdimporter</tt>, <tt>.xpc</tt>, <tt>.service</tt>,\n<tt>.prefPane</tt>, <tt>.iaplugin</tt> and <tt>.action</tt>. These plugins\ncan be added without specifying the plugin type.</p>\n</li>\n<li><p>Issue #83: Setup.py now refuses to install when the current\nplatform is not Mac OS X.</p>\n<p>This makes it clear that the package is only supported on OSX and\navoids confusing errors later on.</p>\n</li>\n<li><p>Issue #39: It is now possible to have subpackages on\nin the “packages” option of py2app.</p>\n</li>\n<li><p>Issue #37: Add recipe for pyEnchant</p>\n<p>..note:</p>\n<pre>The recipe only works for installations of pyEnchant\nwhere pyEnchant is stored in the installation (such\nas the binary eggs on PyPI), not for installations\nthat either use the \"PYENCHANT_LIBRARY_PATH\" environment\nvariable or MacPorts.\n</pre>\n</li>\n<li><p>Issue #90: Removed the ‘email’ recipe, but require a new enough version\nof modulegraph instead. Because of this py2app now requires modulegraph\n0.11 or later.</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-7-4\">\n<h2>py2app 0.7.4</h2>\n<ul>\n<li><p>Issue #77: the stdout/stderr streams of application and plugin bundles did not\nend up in Console.app on OSX 10.8 (as they do on earlier releases of OSX). This\nis due to a change in OSX.</p>\n<p>With this version the application executable converts writes to the stdout\nand stderr streams to the ASL logging subsystem with the options needed to\nend up in the default view of Console.app.</p>\n<p>NOTE: The stdout and stderr streams of plugin bundles are not redirected, as it\nis rather bad form to change the global environment of the host application.</p>\n</li>\n<li><p>The i386, x86_64 and intel stub binaries are now compiled with clang on OSX 10.8,\ninstead of an older version of GCC. The other stub versions still are compiled\non OSX 10.6.</p>\n</li>\n<li><p>Issue #111: The site.py generated by py2app now contains a USER_SITE variable\n(with a default value of <tt>None</tt>) because some software tries to import the\nvalue.</p>\n</li>\n<li><p>Py2app didn’t preserve timestamps for files copied into application bundles,\nand this can cause a bytecompiled file to appear older than the corresponding\nsource file (for packages copied in the bundle using the ‘packages’ option).</p>\n<p>Related to issue #101</p>\n</li>\n<li><p>Py2app also didn’t copy file permissions for files copied into application\nbundles, which isn’t a problem in general but did cause binaries to lose\nthere executable permissions (as noted on Stackoverflow)</p>\n</li>\n<li><p>Issue #101: Set “PYTHONDONTWRITEBYTECODE” in the environment before\ncalling Py_Initialize to ensure that the interpreter won’t try to\nwrite bytecode files (which can cause problems when using sandboxed\napplications).</p>\n</li>\n<li><p>Issue #105: py2app can now create app and plugin bundles when the main script\nhas an encoding other than ASCII, in particular for Python 3.</p>\n</li>\n<li><p>Issue #106: Ensure that the PIL recipe works on Python 3. PIL itself isn’t\nported yet, but Pillow does work with Python 3.</p>\n</li>\n<li><p>“python setup.py install” now fails unless the machine is running Mac OS X.</p>\n<p>I’ve seen a number of reports of users that try to use py2app on Windows\nor Linux to build OSX applications. That doesn’t work, py2app now fails\nduring installation do make this clear.</p>\n</li>\n<li><p>Disabled the ‘email’ recipe for python 3.x as it isn’t needed there.</p>\n</li>\n<li><p>Issue #91: Added a recipe for <cite>lxml &lt;http://lxml.de/&gt;</cite>, needed because\nlxml performs a number of imports from an extension and those cannot\nbe detected automaticly by modulegraph.</p>\n</li>\n<li><p>Issue #94: The site-packages zipfile in the application bundle now contains\nzipfile entries for directories as well. This is needed to work around\na bug in the zipimporter for Python 3.3: it won’t consider ‘pkg/foo.py’ to be\nin namespace package ‘pkg’ unless there is a zipfile entry for the ‘pkg’\nfolder (or there is a ‘pkg/__init__.py’ entry).</p>\n</li>\n<li><p>Issue #97: Fixes a problem with the pyside and sip recipes when the ‘qt_plugins’\noption is used for ‘image_plugins’.</p>\n</li>\n<li><p>Issue #96: py2app should work with python 2.6 again (previous releases didn’t\nwork due to using the sysconfig module introduced in python 2.7)</p>\n</li>\n<li><p>Issue #99: appstore requires a number of symlinks in embedded frameworks.</p>\n<p>(Version 0.7 already added a link Python.frameworks/Versions/Current, this\nversions also adds Python.framework/Python and Python.framework/Resources with\nthe value required by the appstore upload tool).</p>\n</li>\n<li><p>Py2app copied stdlib packages into the app bundle for semi-standalone builds\nwhen they are mentioned in the ‘–packages’ option (either explicitly or\nby a recipe). This was unintentional, semi-standlone builds should rely on\nthe external Python framework for the stdlib.</p>\n<div>\n<p>Note</p>\n<p>Because of this bug parts of the stdlib of <tt>/usr/bin/python</tt> could be\ncopied into app bundles created with py2app.</p>\n</div>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-7-3\">\n<h2>py2app 0.7.3</h2>\n<p>py2app 0.7.3 is a bugfix release</p>\n<ul>\n<li><p>Issue #82: Remove debug print statement from py2app.util.LOADER that\ncaused problems with Python 3.</p>\n</li>\n<li><p>Issue #81: Py2app now fails with an error when trying to build a bundle\nfor a unix-style shared library build of Python (<tt><span class=\"pre\">--enable-shared</span></tt>) unless\nyou are using a recent enough patchlevel of python (2.7.4, 3.2.3, 3.3.1,\n3.4.0, all of them are not released yet).</p>\n<p>The build failure was added to avoid a very confusing error when trying\nto start the generated application due to a bug in the way python reads\nthe environment (for shared library builds on Mac OS X).</p>\n</li>\n<li><p>Py2app will also give an error message when the python binary does not\nhave a shared library (or framework) at all.</p>\n</li>\n<li><p>Issue #87: Ignore ‘.git’ and ‘.hg’ directories while copying package data\n(‘.svn’ and ‘CVS’ were already ignored).</p>\n</li>\n<li><p>Issue #65: the fix in 0.7 to avoid copying a symlinked library twice caused\nproblems for some users because only one of the file names ended up in the\napplication bundle. This release ensures that both names exist (one as a\nsymbolic name to the other).</p>\n</li>\n<li><p>Issue #88: Ensure that the fix for #65 won’t try to create a symlink that\npoints to itself. This could for example occur with homebrew, where the\nexposed lib directory contains symlinks to a cellar, while tye install_name\ndoes mention the “public” lib directory:</p>\n<pre>$ ls -l /opt/homebrew/lib\n...\nlibglib-2.0.0.dylib -&gt; ../Cellar/glib/2.32.4/lib/libglib-2.0.0.dylib\n...\n\n$ otool -vL /opt/homebrew/lib/libglib-2.0.0.dylib\n/opt/homebrew/lib/libglib-2.0.0.dylib:\n   /opt/homebrew/lib/libglib-2.0.0.dylib (compatibility version 3201.0.0, current version 3201.4.0)\n   time stamp 1 Thu Jan  1 01:00:01 1970\n...\n</pre>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-7-2\">\n<h2>py2app 0.7.2</h2>\n<p>py2app 0.7.2 is a bugfix release</p>\n<ul>\n<li><p>Issue #75: Don’t remove <tt><span class=\"pre\">--dist-dir</span></tt>, but only remove the old version\nof the objects we’re trying to build (if that exists).</p>\n<p>This once again makes it possible to have a number of setup.py files that\nbuild plugins into the same target folder (such as the plugins folder\nof an application)</p>\n</li>\n<li><p>Issue #78: Packages added using the <tt><span class=\"pre\">--packages</span></tt> option didn’t end up\non <tt>sys.path</tt> for semi-standalone applications.</p>\n<p>Reported by Steve Strassmann</p>\n</li>\n<li><p>Issue #76: Semi-standalone packages using extensions modules coudn’t use\nextensions unless they also used the <tt><span class=\"pre\">--site-packages</span></tt> option (and\nthe extensions are in the site-packages directory).</p>\n<p>Fixes some problems with PyQt and wxWidgets when using the system installation\nof Python.</p>\n<p>Patch by Dan Horner.</p>\n</li>\n<li><p>It is currently not possible to use a subpackage (“foo.bar”) in the list\nof packages for the “packages” option. Py2app now explicitly checks for this\nand prints an error message instead of building an application that doesn’t\nwork.</p>\n<p>Issue: #39</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-7-1\">\n<h2>py2app 0.7.1</h2>\n<p>py2app 0.7.1 is a bugfix release</p>\n<ul>\n<li><p>Always include ‘pkg_resources’, this is needed to correctly work with\nsetuptools namespace packages, the __init__.py files of those contain\n<tt><span class=\"pre\">__import__('pkg_resources')</span></tt> and that call isn’t recognized as an import\nby the bytecode scanner.</p>\n</li>\n<li><p>Issue #67: py2applet didn’t work with python 3 due to the use of ‘raw_input’</p>\n<p>Reported by Andrew Barnert.</p>\n</li>\n<li><p>Issue #68: the “extra-scripts” feature introduced in 0.7 couldn’t copy scripts\nthat aren’t in the same directory as “setup.py”.</p>\n<p>Reported by Andrew Barnert.</p>\n</li>\n<li><p>For semi-standalone applications the “lib-dynload” directory inside the\napplication was not on “sys.path”, which resulted in launch failures\nwhen using an extension that is not in the stdlib.</p>\n</li>\n<li><p>Issue #70: application fails to launch when script uses Windows line endings</p>\n<p>Reported by Luc Jean.</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-7\">\n<h2>py2app 0.7</h2>\n<p>py2app 0.7 is a bugfix release</p>\n<ul>\n<li><p>Issue #65: generated bundle would crash when two libraries linked to the\nsame library using different names (one refering to the real name, the other\nto a symlink).</p>\n<p>An example if this is an application using wxWidgets when wxWidgets is installed\nusing homebrew.</p>\n<p>Reported by “Bouke”.</p>\n</li>\n<li><p>Issue #13: It is now possible to add helper scripts to a bundle, for\nexample for creating a GUI that starts a helper script in the background.</p>\n<p>This can be done by using the option “–extra-scripts”, the value of which is a list\nof script files (“.py” or “.pyw” files).</p>\n</li>\n<li><p>Smarter matplotlib recipe, it is now possible to specify which backends should\nbe included. Issue #44, reported by Adam Kovics.</p>\n<p>The argument to <tt><span class=\"pre\">--matplotlib-backends</span></tt> (or ‘matplotlib_backends’ in setup.py)\nis a list of plugins to include. Use ‘-‘ to not include backends other than those\nfound by the import statement analysis, and ‘*’ to include all backends (without\nnecessarily including all of matplotlib)</p>\n<p>As an example, use <tt><span class=\"pre\">--matplotlib-backends=wxagg</span></tt> to include just the wxagg\nbackend.</p>\n<p>Default is to include the entire matplotlib package.</p>\n</li>\n<li><p>The packages included by a py2app recipe weren’t processed by modulegraph and\nhence their dependencies were not always included.</p>\n</li>\n<li><p>Fix virtualenv support: alias builds in a virtual environment failed to work.</p>\n<p>(There are still issues with semi-standalone and alias plugin bundles in\na virtualenv environment).</p>\n</li>\n<li><p>issue #18: improved PyQt and PySide support.</p>\n<p>Py2app now has a new option named “–qt-plugins” (or “qt_plugins” in setup.py),\nthis option specify a list of plugins that should be included in the\napplication bundle. The items of the list can have a number of forms:</p>\n<ul>\n<li><p>“plugintype/libplugin.dylib”</p>\n<p>Specify one particular plugin</p>\n</li>\n<li><p>“plugintype/*foo*”</p>\n<p>Specify one or more plugins using a glob pattern</p>\n</li>\n<li><p>“plugintype”</p>\n<p>Include all plugins of a type, equivalent to “plugintype/*”.</p>\n</li>\n</ul>\n<p>The plugins are copied into “Resources/qt_plugins” and py2app adds a “qt.conf”\nfile that points to that location for plugins.</p>\n</li>\n<li><p>issue #49: package data that is a zipfile is now correctly copied into\nthe bundle instead of extracting the archive.</p>\n</li>\n<li><p>issue #59: compile site.py to ensure that the generated bundle doesn’t\nchange on first run.</p>\n<p>This is nice to have in general, and essential when using code signing\nbecause the signature will break when a new file is added after signing.</p>\n<p>Reported by Michael McCracken.</p>\n</li>\n<li><p>issue #60: recipe for “email” package was not loaded</p>\n<p>Reported by Chris Beaumont</p>\n</li>\n<li><p>issue #46: py2app no longer warns about the Qt license. We don’t warn about\nother possibly GPL licensed software either and py2app is not\na license-enforcement tool.</p>\n<p>Reported by briank_in_la.</p>\n</li>\n<li><p>Generated bundles always started with python optimization active\n(that is, as if running as ‘python -O’).</p>\n</li>\n<li><p>Fix issue #53: py2app would crash if a data file happened to\nbe a zipfile.</p>\n</li>\n<li><p>py2app copies data files in the directory for a package into\nthe application bundle. It also did this for directories that\nrepresent subpackages, which made it impossible to exclude\nsubpackages.</p>\n</li>\n<li><p>added recipe for wxPython because some subpackages of wxPython\nuse <tt>__path__</tt> trickery that confuses modulegraph.</p>\n</li>\n<li><p>recipes can now return a list of additional entries for the\n‘includes’ list.</p>\n</li>\n<li><p>rewritten the recipe for matplotlib. The recipe no longer includes\nthe entire package, but just the “mpl-data” directory.</p>\n<p>WARNING: This recipe has had limited testing.</p>\n</li>\n<li><p>fix mixed indentation (tabs and spaces) in argv_emulation.py,\nwhich caused installation failures on python 3.x (issue #40)</p>\n</li>\n<li><p>Issue #43: py2app now creates a symlink named “Current” in the\n‘Versions’ directory of the embedded Python framework to comply\nwith a requirement for the Mac App-store.</p>\n</li>\n<li><p>on some OSX releases the application receives both the\n“open application” and “open documents” Apple Events during startup,\nwhich broke an assumption in argv_emulation.py.</p>\n</li>\n<li><p>py2app is more strict w.r.t. explictly closing files, this avoids\nResourceWarnings for unclosed files.</p>\n</li>\n<li><p>fix test issue with semi-standalone builds on Python 3.2</p>\n</li>\n<li><p>added recipe for pyzmq</p>\n</li>\n<li><p>Don’t use the version information from Python.framework’s Info.plist,\nbut use <tt>sys.version_info</tt>. This fixes a build problem with EPD.</p>\n</li>\n<li><p>Ignore some more files when copying package data:</p>\n<ul>\n<li>VIM swap files (<tt>.foo.py.swp</tt>)</li>\n<li>Backup files for a number of tools: <tt>foo.orig</tt> and <tt>foo~</tt></li>\n</ul>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-6-4\">\n<h2>py2app 0.6.4</h2>\n<p>py2app 0.6.4 is a bugfix and minor feature release</p>\n<ul>\n<li><p>Issue #28: the argv emulator crashes in 64-bit mode on OSX 10.5</p>\n<p>Fixing this issue required yet another rewrite of the argv_emulator\ncode.</p>\n</li>\n<li><p>Added option ‘–arch=VALUE’ which can be used to select the set of\narchitectures for the main executable. This defaults to the set of\narchitectures supported by the python interpreter and can be used to\ndrop support for some architectures (for example when you’re using a\npython binary that supports both 32-bit and 64-bit code and use a\nGUI library that does not yet work in 64-bit mode).</p>\n<p>Valid values for the argument are archectures used in the list below\nand the following groups of architectures:</p>\n<ul>\n<li>fat:        i386, ppc</li>\n<li>fat3:       i386, x86_64, ppc</li>\n<li>univeral:   i386, x86_64, ppc, ppc64</li>\n<li>intel:      i386, x86_64</li>\n</ul>\n</li>\n<li><p>Issue #32: fix crash when application uses PySide</p>\n<p>This is partially fixed in macholib (release 1.4.3)</p>\n</li>\n<li><p>The ‘-O’ flag of py2app now defaults to the python optimization level\nwhen using python 2.6 or later.</p>\n</li>\n<li><p>Issue #31: honor optimze flag at runtime.</p>\n<p>Until now an application bundle created by py2app would also run without\nthe “-O” flag, even when the user specified it should. This is now fixed.</p>\n</li>\n<li><p>Issue #33: py2app’s application bundle launcher now clears the environment\nvariable <tt>PYOBJC_BUNDLE_ADDRESS</tt>, avoids a crash when using PyObjC in an\napplication launched from a py2app based plugin bundle.</p>\n</li>\n<li><p>py2app’s bundle launcher set the environment variable <tt>PYOBJC_BUNDLE_ADDRESS</tt>,\nthis variable is now deprecated. Use <tt>PYOBJC_BUNDLE_ADDRESS&lt;PID&gt;</tt> instead\n(replace <tt>&lt;PID&gt;</tt> by the process ID of the current process).</p>\n</li>\n<li><p>When using the system python we now explicitly add Apple’s additional packages\n(like PyObjC and Twisted) to <tt>sys.path</tt>.</p>\n<p>This fixes and issue reported by Sean Robinson: py2app used to create a non-working\nbundle when you used these packages because the packages didn’t get included\n(as intented), but were not available on <tt>sys.path</tt> either.</p>\n</li>\n<li><p>Fixed the recipe for sip, which in turn ensures that PyQt4 applications\nwork.</p>\n<p>As before the SIP recipe is rather crude, it will include <em>all</em> SIP-based\npackages into your application bundle when it detects a module that uses\nSIP.</p>\n</li>\n<li><p>The ‘Resources’ folder is no longer on the python search path,\nit contains the scripts while Python modules and packages are located\nin the site-packages directory. This change is related to issue #30.</p>\n</li>\n<li><p>The folder ‘Resources/Python/site-packages’ is no longer on the python\nsearch path. This folder is not used by py2app itself, but might by\nused by custom build scripts that wrap around py2app.</p>\n</li>\n<li><p>Issue #30: py2app bundles failed to launch properly when the scriptfile\nhas the same name as a python package used by the application.</p>\n</li>\n<li><p>Issue #15: py2app now has an option to emulate the shell environment you\nget by opening a window in the Terminal.</p>\n<p>Usage: <tt>python setup.py py2app <span class=\"pre\">--emulate-shell-environment</span></tt></p>\n<p>This option is experimental, it is far from certain that the implementation\nworks on all systems.</p>\n</li>\n<li><p>Issue #16: <tt><span class=\"pre\">--argv-emulation</span></tt> now works with Python 3.x and in 64-bit\nexecutables.</p>\n</li>\n<li><p>Issue #17: py2applet script defaults ‘argv_emulation’ to False when your using\na 64-bit build of python, because that option is not supported on\nsuch builds.</p>\n</li>\n<li><p>py2app now clears the temporary directory in ‘build’ and the output directory\nin ‘dist’ before doing anything. This avoids unwanted interactions between\nresults from a previous builds and the current build.</p>\n</li>\n<li><p>Issue #22: py2app will give an error when the specified version is invalid,\ninstead of causing a crash in the generated executable.</p>\n</li>\n<li><p>Issue #23: py2app failed to work when an .egg directory was implictly added\nto <tt>sys.path</tt> by setuptools and the “-O” option was used (for example\n<tt>python setup.py py2app <span class=\"pre\">-O2</span></tt>)</p>\n</li>\n<li><p>Issue #26: py2app copied the wrong executable into the application bundle\nwhen using virtualenv with a framework build of Python.</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-6-3\">\n<h2>py2app 0.6.3</h2>\n<p>py2app 0.6.3 is a bugfix release</p>\n<ul>\n<li>py2app failed to compile .xib files\n(as reported on the pythonmac-sig mail-ing list).</li>\n</ul>\n</div>\n<div id=\"py2app-0-6-2\">\n<h2>py2app 0.6.2</h2>\n<p>py2app 0.6.2 is a bugfix release</p>\n<ul>\n<li><p>py2app failed to copy the iconfile into application bundle\n(reported by Russel Owen)</p>\n</li>\n<li><p>py2app failed to copy resources and data files as well\n(the <tt>resource</tt> key in the py2ap options dictionary and\nthe <tt>data_files</tt> argument to the setup function).</p>\n<p>Issue #19, reported by bryon(at)spideroak.com.</p>\n</li>\n<li><p>py2app failed to build application bundles when using virtualenv\ndue to assumptions about the relation between <tt>sys.prefix</tt> and\n<tt>sys.executable</tt>.</p>\n<p>Report and fix by Erik van Zijst.</p>\n</li>\n<li><p>Ensure that the ‘examples’ directory is included in the source\narchive</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-6-1\">\n<h2>py2app 0.6.1</h2>\n<p>py2app 0.6.1 is a bugfix release</p>\n<p>Bugfixes:</p>\n<ul>\n<li><p>py2app failed to build the bundle when python package contained\na zipfile with data.</p>\n<p>This version solves most of that problem using a rough\nworkaround (the issue is fixed when the filename ends with ‘.zip’).</p>\n</li>\n<li><p>The code that recreates the stub executables when they are\nolder than the source code now uses <tt><span class=\"pre\">xcode-select</span></tt> to\nfind the root of SDKs.</p>\n<p>This makes it possible to recreate these executables on machines\nwhere both Xcode 3 and Xcode 4 are installed and Xcode 3 is\nthe default Xcode.</p>\n</li>\n<li><p>The stub executables were regenerated using Xcode 3</p>\n<p>As a word of warning: Xcode 4 cannot be used to rebuild the\nstub executables, in particular not those that have support\nfor the PPC architecture.</p>\n</li>\n<li><p>Don’t rebuild the stub executables automaticly, that’s\nunsafe with Xcode 4 and could trigger accidently when\nfiles are installed in a different order than expected.</p>\n</li>\n<li><p>Small tweaks to the testsuite to ensure that they work\non systems with both Xcode3 and Xcode4 (Xcode3 must be\nthe selected version).</p>\n</li>\n<li><p>Better cleanup in the testsuite when <tt>setupClass</tt> fails.</p>\n</li>\n</ul>\n</div>\n<div id=\"py2app-0-6\">\n<h2>py2app 0.6</h2>\n<p>py2app 0.6 is a minor feature release</p>\n<p>Features:</p>\n<ul>\n<li><p>it is now possible to specify which python distributions must\nbe availble when building the bundle by using the\n“install_requires” argument of the <tt>setup()</tt> function:</p>\n<pre>setup(\n\n    ...\n    install_requires = [\n           \"pyobjc == 2.2\"\n    ],\n)\n</pre>\n</li>\n<li><p>py2app can now package namespace packages that were installed\nusing <cite>pip &lt;http://pypi.python.org/pypi/pip&gt;</cite> or the\nsetuptools install option <tt><span class=\"pre\">--single-version-externally-managed</span></tt>.</p>\n</li>\n<li><p>the bundle template now supports python3, based on a patch\nby Virgil Dupras.</p>\n</li>\n<li><p>alias builds no longer use Carbon Aliases and therefore are\nsupported with python3 as well (patch by Virgil Dupras)</p>\n</li>\n<li><p>argv emulation doesn’t work in python 3, this release\nwill tell you abou this instead of silently failing to\nbuild a working bundle.</p>\n</li>\n<li><p>add support for custom URLs to the argv emulation code\n(patch by Brendan Simon).</p>\n<p>You will have to add a “CFBundleURLTypes” key to your Info.plist to\nuse this, the argv emulation code will ensure that the URL\nto open will end up in <tt>sys.argv</tt>.</p>\n</li>\n<li><p><tt>py2app.util</tt> contains a number of functions that are now\ndeprecated an will be removed in a future version, specifically:\n<tt>os_path_islink</tt>, <tt>os_path_isdir</tt>, <tt>path_to_zip</tt>,\n<tt>get_zip_data</tt>, <tt>get_mtime</tt>,  and <tt>os_readlink</tt>.</p>\n</li>\n<li><p>The module <tt>py2app.simpleio</tt> no longer exists, and should never\nhave been in the repository (it was part of a failed rewrite of\nthe I/O layer).</p>\n</li>\n</ul>\n<p>Bug fixes:</p>\n<ul>\n<li>fix problem with symlinks in copied framework, as reported\nby Dan Ross.</li>\n<li>py2applet didn’t work in python 3.x.</li>\n<li>The <tt><span class=\"pre\">--alias</span></tt> option didn’t work when building a plugin\nbundle (issue #10, fix by Virgil Dupras)</li>\n<li>Avoid copying the __pycache__ directory in python versions\nthat implement PEP 3147 (Python 3.2 and later)</li>\n<li>App bundles with Python 3 now work when the application is\nstored in a directory with non-ASCII characters in the full\nname.</li>\n<li>Do not compile <tt>.nib</tt> files, it is not strictly needed and\nbreaks PyObjC projects that still use the NibClassBuilder code.</li>\n<li>Better error messsages when trying to include a non-existing\nfile as a resource.</li>\n<li>Don’t drop into PDB when an exception occurs.</li>\n<li>Issue #5: Avoid a possible stack overflow in the bundle executable</li>\n<li>Issue #9: Work with python 3.2</li>\n<li>Fix build issues with python 2.5 (due to usage of too modern distutils\ncommand subclasses)</li>\n<li>The source distribution didn’t include all files that needed to be\nit ever since switching to mercurial, I’ve added a MANIFEST.in\nfile rather than relying on setuptool’s autoguessing of files to include.</li>\n<li>Bundle template works again with semi-standalone builds (such as\nwhen using a system python), this rewrites the fix for issue #10\nmentioned earlier.</li>\n<li>Ensure py2app works correctly when the sources are located in a\ndirectory with non-ascii characters in its name.</li>\n</ul>\n</div>\n<div id=\"py2app-0-5-2\">\n<h2>py2app 0.5.2</h2>\n<p>py2app 0.5.2 is a bugfix release</p>\n<p>Bug fixes:</p>\n<ul>\n<li>Ensure that the right stub executable gets found when using\nthe system python 2.5</li>\n</ul>\n</div>\n<div id=\"py2app-0-5-1\">\n<h2>py2app 0.5.1</h2>\n<p>py2app 0.5.1 is a bugfix release</p>\n<p>Bug fixes:</p>\n<ul>\n<li>Ensure stub executables get included in the egg files</li>\n<li>Fix name of the bundletemplate stub executable for 32-bit builds</li>\n</ul>\n</div>\n<div id=\"py2app-0-5\">\n<h2>py2app 0.5</h2>\n<p>py2app 0.5 is a minor feature release.</p>\n<p>Features:</p>\n<ul>\n<li>Add support for the <tt><span class=\"pre\">--with-framework-name</span></tt> option of Python’s\nconfigure script, that is: py2app now also works when the Python\nframework is not named ‘Python.framework’.</li>\n<li>Add support for various build flavours of Python (32bit, 3-way, …)</li>\n<li>py2app now actually works for me (<a href=\"mailto:ronaldoussoren%40mac.com\">ronaldoussoren<span>@</span>mac<span>.</span>com</a>) with a\npython interpreter in a virtualenv environment.</li>\n<li>Experimental support for python 3</li>\n</ul>\n<p>Bug fixes:</p>\n<ul>\n<li>Fix recipe for matplotlib: that recipe caused an exception with\ncurrent versions of matplotlib and pytz.</li>\n<li>Use modern API’s in the alias-build bootstrap code, without\nthis ‘py2app -A’ will result in broken bundles on a 64-bit build\nof Python.\n(Patch contributed by James R Eagan)</li>\n<li>Try both ‘import Image’ and ‘from PIL import Image’ in the PIL\nrecipe.\n(Patch contributed by Christopher Barker)</li>\n<li>The stub executable now works for 64-bit application bundles</li>\n<li>(Lowlevel) The application stub was rewritten to use\n<tt>dlopen</tt> instead of <tt>dyld</tt> APIs. This removes deprecation\nwarnings during compilation.</li>\n</ul>\n</div>\n<div id=\"py2app-0-4-3\">\n<h2>py2app 0.4.3</h2>\n<p>py2app 0.4.3 is a bugfix release</p>\n<p>Bug fixes:</p>\n<ul>\n<li>A bad format string in build_app.py made it impossible to copy the\nPython framework into an app bundle.</li>\n</ul>\n</div>\n<div id=\"py2app-0-4-2\">\n<h2>py2app 0.4.2</h2>\n<p>py2app 0.4.2 is a minor feature release</p>\n<p>Features:</p>\n<ul>\n<li>When the ‘–strip’ option is specified we now also remove ‘.dSYM’\ndirectories from the bundle.</li>\n<li>Remove dependency on a ‘version.plist’ file in the python framework</li>\n<li>A new recipe for <a href=\"http://www.riverbankcomputing.co.uk/pyqt/index.php\" rel=\"nofollow\">PyQt</a> 4.x. This recipe was donated by Kevin Walzer.</li>\n<li>A new recipe for <a href=\"http://pypi.python.org/pypi/virtualenv\" rel=\"nofollow\">virtualenv</a>, this allows you to use py2app from\na virtual environment.</li>\n</ul>\n<ul>\n<li><p>Adds support for converting <tt>.xib</tt> files (NIB files for\nInterface Builder 3)</p>\n</li>\n<li><p>Introduces an experimental plugin API for data converters.</p>\n<p>A conversion plugin should be defined as an entry-point in the\n<tt>py2app.converter</tt> group:</p>\n<pre> setup(\n   ...\n   entry_points = {\n           'py2app.converter': [\n               \"label          = some_module:converter_function\",\n            ]\n    },\n    ...\n)\n</pre>\n<p>The conversion function should be defined like this:</p>\n<pre>from py2app.decorators import converts\n\n@converts('.png')\ndef optimze_png(source, proposed_destionation, dryrun=0):\n   # Copy 'source' to 'proposed_destination'\n   # The conversion is allowed to change the proposed\n   # destination to another name in the same directory.\n   pass\n</pre>\n</li>\n</ul>\n<p>Buf fixes:</p>\n<ul>\n<li>This fixes an issue with copying a different version of Python over\nto an app/plugin bundle than the one used to run py2app with.</li>\n</ul>\n</div>\n<div id=\"py2app-0-4-0\">\n<h2>py2app 0.4.0</h2>\n<p>py2app 0.4.0 is a minor feature release (and was never formally released).</p>\n<p>Features:</p>\n<ul>\n<li>Support for CoreData mapping models (introduced in Mac OS X 10.5)</li>\n<li>Support for python packages that are stored in zipfiles (such as <tt>zip_safe</tt>\npython eggs).</li>\n</ul>\n<p>Bug fixes:</p>\n<ul>\n<li>Fix incorrect symlink target creation with an alias bundle that has included\nframeworks.</li>\n<li>Stuffit tends to extract archives recursively, which results in unzipped\ncode archives inside py2app-created bundles. This version has a workaround\nfor this “feature” for Stuffit.</li>\n<li>Be more carefull about passing non-constant strings as the template argumenti\nof string formatting functions (in the app and bundle templates), to avoid\ncrashes under some conditions.</li>\n</ul>\n</div>\n<div id=\"py2app-0-3-6\">\n<h2>py2app 0.3.6</h2>\n<p>py2app 0.3.6 is a minor bugfix release.</p>\n<p>Bug fixes:</p>\n<ul>\n<li>Ensure that custom icons are copied into the output bundle</li>\n<li>Solve compatibility problem with some haxies and inputmanager plugins</li>\n</ul>\n</div>\n<div id=\"py2app-0-3-5\">\n<h2>py2app 0.3.5</h2>\n<p>py2app 0.3.5 is a minor bugfix release.</p>\n<p>Bug fixes:</p>\n<ul>\n<li>Resolve disable_linecache issue</li>\n<li>Fix Info.plist and Python path for plugins</li>\n</ul>\n</div>\n<div id=\"py2app-0-3-4\">\n<h2>py2app 0.3.4</h2>\n<p>py2app 0.3.4 is a minor bugfix release.</p>\n<p>Bug fixes:</p>\n<ul>\n<li>Fixed a typo in the py2applet script</li>\n<li>Removed some, but not all, compiler warnings from the bundle template\n(which is still probably broken anyway)</li>\n</ul>\n</div>\n<div id=\"py2app-0-3-3\">\n<h2>py2app 0.3.3</h2>\n<p>py2app 0.3.3 is a minor bugfix release.</p>\n<p>Bug Fixes:</p>\n<ul>\n<li>Fixed a typo in the argv emulation code</li>\n<li>Removed the unnecessary py2app.install hack (setuptools does that already)</li>\n</ul>\n</div>\n<div id=\"py2app-0-3-2\">\n<h2>py2app 0.3.2</h2>\n<p>py2app 0.3.2 is a major bugfix release.</p>\n<p>Functional changes:</p>\n<ul>\n<li>Massively updated documentation</li>\n<li>New prefer-ppc option</li>\n<li>New recipes: numpy, scipy, matplotlib</li>\n<li>Updated py2applet script to take options, provide –make-setup</li>\n</ul>\n<p>Bug Fixes:</p>\n<ul>\n<li>No longer defaults to LSPrefersPPC</li>\n<li>Replaced stdlib usage of argvemulator to inline version for i386\ncompatibility</li>\n</ul>\n</div>\n<div id=\"py2app-0-3-1\">\n<h2>py2app 0.3.1</h2>\n<p>py2app 0.3.1 is a minor bugfix release.</p>\n<p>Functional changes:</p>\n<ul>\n<li>New EggInstaller example</li>\n</ul>\n<p>Bug Fixes:</p>\n<ul>\n<li>Now ensures that the executable is +x (when installed from egg this may not\nbe the case)</li>\n</ul>\n</div>\n<div id=\"py2app-0-3-0\">\n<h2>py2app 0.3.0</h2>\n<p>py2app 0.3.0 is a major feature enhancements release.</p>\n<p>Functional changes:</p>\n<ul>\n<li>New –xref (-x) option similar to py2exe’s that produces\na list of modules and their interdependencies as a HTML\nfile</li>\n<li>sys.executable now points to a regular Python interpreter\nalongside the regular executable, so spawning sub-interpreters\nshould work much more reliably</li>\n<li>Application bootstrap now detects paths containing “:”\nand will provide a “friendly” error message instead of just\ncrashing &lt;<a href=\"http://python.org/sf/1507224\" rel=\"nofollow\">http://python.org/sf/1507224</a>&gt;.</li>\n<li>Application bootstrap now sets PYTHONHOME instead of\na large PYTHONPATH</li>\n<li>Application bootstrap rewritten in C that links to\nCoreFoundation and Cocoa dynamically as needed,\nso it doesn’t imply any particular version of the runtime.</li>\n<li>Documentation and examples changed to use setuptools\ninstead of distutils.core, which removes the need for\nthe py2app import</li>\n<li>Refactored to use setuptools, distributed as an egg.</li>\n<li>macholib, bdist_mpkg, modulegraph, and altgraph are now\nseparately maintained packages available on PyPI as eggs</li>\n<li>macholib now supports little endian architectures,\n64-bit Mach-O headers, and reading/writing of\nmultiple headers per file (fat / universal binaries)</li>\n</ul>\n</div>\n<div id=\"py2app-0-2-1\">\n<h2>py2app 0.2.1</h2>\n<p>py2app 0.2.1 is a minor bug fix release.</p>\n<p>Bug Fixes:</p>\n<ul>\n<li>macholib.util.in_system_path understands SDKs now</li>\n<li>DYLD_LIBRARY_PATH searching is fixed</li>\n<li>Frameworks and excludes options should work again.</li>\n</ul>\n</div>\n<div id=\"py2app-0-2-0\">\n<h2>py2app 0.2.0</h2>\n<p>py2app 0.2.0 is a minor bug fix release.</p>\n<p>Functional changes:</p>\n<ul>\n<li>New datamodels option to support CoreData.  Compiles\n.xcdatamodel files and places them in the Resources dir\n(as .mom).</li>\n<li>New use-pythonpath option.  The py2app application bootstrap\nwill no longer use entries from PYTHONPATH unless this option\nis used.</li>\n<li>py2app now persists information about the build environment\n(python version, executable, build style, etc.) in the\nInfo.plist and will clean the executable before rebuilding\nif anything at all has changed.</li>\n<li>bdist_mpkg now builds packages with the full platform info,\nso that installing a package for one platform combination\nwill not look like an upgrade to another platform combination.</li>\n</ul>\n<p>Bug Fixes:</p>\n<ul>\n<li>Fixed a bug in standalone building, where a rebuild could\ncause an unlaunchable executable.</li>\n<li>Plugin bootstrap should compile/link correctly\nwith gcc 4.</li>\n<li>Plugin bootstrap no longer sets PYTHONHOME and will\nrestore PYTHONPATH after initialization.</li>\n<li>Plugin bootstrap swaps out thread state upon plug-in\nload if it is the first to initialize Python.  This\nfixes threading issues.</li>\n</ul>\n</div>\n<div id=\"py2app-0-1-9\">\n<h2>py2app 0.1.9</h2>\n<p>py2app 0.1.9 is a minor bug fix release.</p>\n<p>Bugs fixed:</p>\n<ul>\n<li>bdist_mpkg now builds zip files that are correctly unzipped\nby all known tools.</li>\n<li>The behavior of the bootstrap has changed slightly such that\n<tt>__file__</tt> should now point to your main script, rather than\nthe bootstrap.  The main script has also moved to <tt>Resources</tt>,\nfrom <tt>Resources/Python</tt>, so that <tt>__file__</tt> relative resource\npaths should still work.</li>\n</ul>\n</div>\n<div id=\"py2app-0-1-8\">\n<h2>py2app 0.1.8</h2>\n<p>py2app 0.1.8 is a major enhancements release:</p>\n<p>Bugs fixed:</p>\n<ul>\n<li>Symlinks in included frameworks should be preserved correctly\n(fixes Tcl/Tk)</li>\n<li>Fixes some minor issues with alias bundles</li>\n<li>Removed implicit SpiderImagePlugin -&gt; ImageTk reference in PIL\nrecipe</li>\n<li>The <tt><span class=\"pre\">--optimize</span></tt> option should work now</li>\n<li><tt>weakref</tt> is now included by default</li>\n<li><tt>anydbm</tt>’s dynamic dependencies are now in the standard implies\nlist</li>\n<li>Errors on app launch are brought to the front so the user does\nnot miss them</li>\n<li>bdist_mpkg now compatible with pychecker (data_files had issues)</li>\n</ul>\n<p>Options changed:</p>\n<ul>\n<li>deprecated <tt><span class=\"pre\">--strip</span></tt>, it is now on by default</li>\n<li>new <tt><span class=\"pre\">--no-strip</span></tt> option to turn off stripping of executables</li>\n</ul>\n<p>New features:</p>\n<ul>\n<li>Looks for a hacked version of the PyOpenGL __init__.py so that\nit doesn’t have to include the whole package in order to get\nat the stupid version file.</li>\n<li>New <tt>loader_files</tt> key that a recipe can return in order to\nensure that non-code ends up in the .zip (the pygame recipe\nuses this)</li>\n<li>Now scans all files in the bundle and normalizes Mach-O load\ncommands, not just extensions.  This helps out when using the\n<tt><span class=\"pre\">--package</span></tt> option, when including frameworks that have plugins,\netc.</li>\n<li>An embedded Python interpreter is now included in the executable\nbundle (<tt>sys.executable</tt> points to it), this currently only\nworks for framework builds of Python</li>\n<li>New <tt>macho_standalone</tt> tool</li>\n<li>New <tt>macho_find</tt> tool</li>\n<li>Major enhancements to the way plugins are built</li>\n<li>bdist_mpkg now has a <tt><span class=\"pre\">--zipdist</span></tt> option to build zip files\nfrom the built package</li>\n<li>The bdist_mpkg “Installed to:” description is now based on the\npackage install root, rather than the build root</li>\n</ul>\n</div>\n<div id=\"py2app-0-1-7\">\n<h2>py2app 0.1.7</h2>\n<p><a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a> 0.1.7 is a bug fix release:</p>\n<ul>\n<li>The <tt>bdist_mpkg</tt> script will now set up sys.path properly, for setup scripts\nthat require local imports.</li>\n<li><tt>bdist_mpkg</tt> will now correctly accept <tt>ReadMe</tt>, <tt>License</tt>, <tt>Welcome</tt>,\nand <tt>background</tt> files by parameter.</li>\n<li><tt>bdist_mpkg</tt> can now display a custom background again (0.1.6 broke this).</li>\n<li><tt>bdist_mpkg</tt> now accepts a <tt><span class=\"pre\">build-base=</span></tt> argument, to put build files in\nan alternate location.</li>\n<li><tt>py2app</tt> will now accept main scripts with a <tt>.pyw</tt> extension.</li>\n<li><tt>py2app</tt>’s not_stdlib_filter will now ignore a <tt><span class=\"pre\">site-python</span></tt> directory as\nwell as <tt><span class=\"pre\">site-packages</span></tt>.</li>\n<li><tt>py2app</tt>’s plugin bundle template no longer displays GUI dialogs by default,\nbut still links to <tt>AppKit</tt>.</li>\n<li><tt>py2app</tt> now ensures that the directory of the main script is now added to\n<tt>sys.path</tt> when scanning modules.</li>\n<li>The <tt>py2app</tt> build command has been refactored such that it would be easier\nto change its behavior by subclassing.</li>\n<li><tt>py2app</tt> alias bundles can now cope with editors that do atomic saves\n(write new file, swap names with existing file).</li>\n<li><tt>macholib</tt> now has minimal support for fat binaries.  It still assumes big\nendian and will not make any changes to a little endian header.</li>\n<li>Add a warning message when using the <tt>install</tt> command rather than installing\nfrom a package.</li>\n<li>New <tt>simple/structured</tt> example that shows how you could package an\napplication that is organized into several folders.</li>\n<li>New <tt>PyObjC/pbplugin</tt> Xcode Plug-In example.</li>\n</ul>\n</div>\n<div id=\"py2app-0-1-6\">\n<h2>py2app 0.1.6</h2>\n<p>Since I have been slacking and the last announcement was for 0.1.4, here are the\nchanges for the soft-launched releases 0.1.5 and 0.1.6:</p>\n<p><a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a> 0.1.6 was a major feature enhancements release:</p>\n<ul>\n<li><tt>py2applet</tt> and <tt>bdist_mpkg</tt> scripts have been moved to Python modules\nso that the functionality can be shared with the tools.</li>\n<li>Generic graph-related functionality from <tt>py2app</tt> was moved to\n<tt>altgraph.ObjectGraph</tt> and <tt>altgraph.GraphUtil</tt>.</li>\n<li><tt>bdist_mpkg</tt> now outputs more specific plist requirements\n(for future compatibility).</li>\n<li><tt>py2app</tt> can now create plugin bundles (MH_BUNDLE) as well as executables.\nNew recipe for supporting extensions built with <a href=\"http://www.riverbankcomputing.co.uk/sip/index.php\" rel=\"nofollow\">sip</a>, such as <a href=\"http://www.riverbankcomputing.co.uk/pyqt/index.php\" rel=\"nofollow\">PyQt</a>.  Note that\ndue to the way that <a href=\"http://www.riverbankcomputing.co.uk/sip/index.php\" rel=\"nofollow\">sip</a> works, when one sip-based extension is used, <em>all</em>\nsip-based extensions are included in your application.  In practice, this means\nanything provided by <a href=\"http://www.riverbankcomputing.co.uk/\" rel=\"nofollow\">Riverbank</a>, I don’t think anyone else uses <a href=\"http://www.riverbankcomputing.co.uk/sip/index.php\" rel=\"nofollow\">sip</a> (publicly).</li>\n<li>New recipe for <a href=\"http://pyopengl.sourceforge.net/\" rel=\"nofollow\">PyOpenGL</a>.  This is very naive and simply includes the whole\nthing, rather than trying to monkeypatch their brain-dead\nversion acquisition routine in <tt>__init__</tt>.</li>\n<li>Bootstrap now sets <tt>ARGVZERO</tt> and <tt>EXECUTABLEPATH</tt> environment variables,\ncorresponding to the <tt>argv[0]</tt> and the <tt><span class=\"pre\">_NSGetExecutablePath(...)</span></tt> that the\nbundle saw.  This is only really useful if you need to relaunch your own\napplication.</li>\n<li>More correct <tt>dyld</tt> search behavior.</li>\n<li>Refactored <tt>macholib</tt> to use <tt>altgraph</tt>, can now generate <a href=\"http://www.pixelglow.com/graphviz/\" rel=\"nofollow\">GraphViz</a> graphs\nand more complex analysis of dependencies can be done.</li>\n<li><tt>macholib</tt> was refactored to be easier to maintain, and the structure handling\nhas been optimized a bit.</li>\n<li>The few tests that there are were refactored in <a href=\"http://codespeak.net/py/current/doc/test.html\" rel=\"nofollow\">py.test</a> style.</li>\n<li>New <a href=\"http://www.riverbankcomputing.co.uk/pyqt/index.php\" rel=\"nofollow\">PyQt</a> example.</li>\n<li>New <a href=\"http://pyopengl.sourceforge.net/\" rel=\"nofollow\">PyOpenGL</a> example.</li>\n</ul>\n<p>See also:</p>\n<ul>\n<li><a href=\"http://mail.python.org/pipermail/pythonmac-sig/2004-December/012272.html\" rel=\"nofollow\">http://mail.python.org/pipermail/pythonmac-sig/2004-December/012272.html</a></li>\n</ul>\n</div>\n<div id=\"py2app-0-1-5\">\n<h2>py2app 0.1.5</h2>\n<p><a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a> 0.1.5 is a major feature enhancements release:</p>\n<ul>\n<li>Added a <tt>bdist_mpkg</tt> distutils extension, for creating Installer\nan metapackage from any distutils script.<ul>\n<li>Includes PackageInstaller tool</li>\n<li>bdist_mpkg script</li>\n<li>setup.py enhancements to support bdist_mpkg functionality</li>\n</ul>\n</li>\n<li><dl>\n<dt>Added a <tt>PackageInstaller</tt> tool, a droplet that performs the same function</dt>\n<dd>as the <tt>bdist_mpkg</tt> script.</dd>\n</dl>\n</li>\n<li>Create a custom <tt>bdist_mpkg</tt> subclass for <a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a>’s setup script.</li>\n<li>Source package now includes <a href=\"http://dirtSimple.org/\" rel=\"nofollow\">PJE</a>’s <a href=\"http://cvs.eby-sarna.com/PEAK/setuptools/\" rel=\"nofollow\">setuptools</a> extension to distutils.</li>\n<li>Added lots of metadata to the setup script.</li>\n<li><tt>py2app.modulegraph</tt> is now a top-level package, <tt>modulegraph</tt>.</li>\n<li><tt>py2app.find_modules</tt> is now <tt>modulegraph.find_modules</tt>.</li>\n<li>Should now correctly handle paths (and application names) with unicode characters\nin them.</li>\n<li>New <tt><span class=\"pre\">--strip</span></tt> option for <tt>py2app</tt> build command, strips all Mach-O files\nin output application bundle.</li>\n<li>New <tt><span class=\"pre\">--bdist-base=</span></tt> option for <tt>py2app</tt> build command, allows an alternate\nbuild directory to be specified.</li>\n<li>New <a href=\"http://docutils.sf.net/\" rel=\"nofollow\">docutils</a> recipe.\nSupport for non-framework Python, such as the one provided by <a href=\"http://darwinports.opendarwin.org/\" rel=\"nofollow\">DarwinPorts</a>.</li>\n</ul>\n<p>See also:</p>\n<ul>\n<li><a href=\"http://mail.python.org/pipermail/pythonmac-sig/2004-October/011933.html\" rel=\"nofollow\">http://mail.python.org/pipermail/pythonmac-sig/2004-October/011933.html</a></li>\n</ul>\n</div>\n<div id=\"py2app-0-1-4\">\n<h2>py2app 0.1.4</h2>\n<p><a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a> 0.1.4 is a minor bugfix release:</p>\n<ul>\n<li>The <tt>altgraph</tt> from 0.1.3 had a pretty nasty bug in it that prevented\nfiltering from working properly, so I fixed it and bumped to 0.1.4.</li>\n</ul>\n</div>\n<div id=\"py2app-0-1-3\">\n<h2>py2app 0.1.3</h2>\n<p><a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a> 0.1.3 is a refactoring and new features release:</p>\n<ul>\n<li><tt>altgraph</tt>, my fork of Istvan Albert’s <a href=\"http://www.personal.psu.edu/staff/i/u/iua1/python/graphlib/html/\" rel=\"nofollow\">graphlib</a>, is now part of the\ndistribution</li>\n<li><tt>py2app.modulegraph</tt> has been refactored to use <tt>altgraph</tt></li>\n<li><a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a> can now create <a href=\"http://www.pixelglow.com/graphviz/\" rel=\"nofollow\">GraphViz</a> DOT graphs with the <tt><span class=\"pre\">-g</span></tt> option\n(<a href=\"http://undefined.org/~bob/TinyTinyEdit.pdf\" rel=\"nofollow\">TinyTinyEdit example</a>)</li>\n<li>Moved the filter stack into <tt>py2app.modulegraph</tt></li>\n<li>Fixed a bug that may have been in 0.1.2 where explicitly included packages\nwould not be scanned by <tt>macholib</tt></li>\n<li><tt>py2app.apptemplate</tt> now contains a stripped down <tt>site</tt> module as\nopposed to a <tt>sitecustomize</tt></li>\n<li>Alias builds are now the only ones that contain the system and user\n<tt><span class=\"pre\">site-packages</span></tt> directory in <tt>sys.path</tt></li>\n<li>The <tt>pydoc</tt> recipe has been beefed up to also exclude <tt>BaseHTTPServer</tt>,\netc.</li>\n</ul>\n<p>Known issues:</p>\n<ul>\n<li>Commands marked with XXX in the help are not implemented</li>\n<li>Includes <em>all</em> files from packages, it should be smart enough to strip\nunused .py/.pyc/.pyo files (to save space, depending on which optimization\nflag is used)</li>\n<li><tt>macholib</tt> should be refactored to use <tt>altgraph</tt></li>\n<li><tt>py2app.build_app</tt> and <tt>py2app.modulegraph</tt> should be refactored to\nsearch for dependencies on a per-application basis</li>\n</ul>\n</div>\n<div id=\"py2app-0-1-2\">\n<h2>py2app 0.1.2</h2>\n<p><a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a> 0.2 is primarily a bugfix release:</p>\n<ul>\n<li>The encodings package now gets included in the zip file (saves space)</li>\n<li>A copy of the Python interpreter is not included anymore in standalone\nbuilds (saves space)</li>\n<li>The executable bootstrap is now stripped by default (saves a little space)</li>\n<li><tt>sys.argv</tt> is set correctly now, it used to point to the executable, now\nit points to the boot script.  This should enhance compatibility with some\napplications.</li>\n<li>Adds an “Alias” feature to modulegraph, so that <tt>sys.modules</tt> craziness\nsuch as <tt>wxPython.wx <span class=\"pre\">-&gt;</span> wx</tt> can be accomodated (this particular craziness\nis also now handled by default)</li>\n<li>A <tt>sys.path</tt> alternative may be passed to <tt>find_modules</tt> now, though\nthis is not used yet</li>\n<li>The <tt>Command</tt> instance is now passed to recipes instead of the\n<tt>Distribution</tt> instance (though no recipes currently use either)</li>\n<li>The post-filtering of modules and extensions is now generalized into a\nstack and can be modified by recipes</li>\n<li>A <a href=\"http://www.wxpython.org/\" rel=\"nofollow\">wxPython</a> example demonstrating how to package <a href=\"http://wxglade.sourceforge.net/\" rel=\"nofollow\">wxGlade</a> has been\nadded (this is a good example of how to write your own recipe, and how to\ndeal with complex applications that mix code and data files)</li>\n<li><tt>PyRuntimeLocations</tt> is now set to (only) the location of the current\ninterpreter’s <tt>Python.framework</tt> for alias and semi-standalone build\nmodes (enhances compatibility with extensions built with an unpatched\nMakefile with Mac OS X 10.3’s Python 2.3.0)</li>\n</ul>\n<p>Known issues:</p>\n<ul>\n<li>Includes <em>all</em> files from packages, it should be smart enough to strip\nunused .py/.pyc/.pyo files (to save space, depending on which optimization\nflag is used).</li>\n</ul>\n</div>\n<div id=\"py2app-0-1-1\">\n<h2>py2app 0.1.1</h2>\n<p><a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a> 0.1.1 is primarily a bugfix release:</p>\n<ul>\n<li><dl>\n<dt>Several problems related to Mac OS X 10.2 compatibility and standalone</dt>\n<dd>building have been resolved</dd>\n</dl>\n</li>\n<li>Scripts that are not in the same directory as setup.py now work</li>\n<li>A new recipe has been added that removes the pydoc -&gt; Tkinter dependency</li>\n<li>A recipe has been added for <a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a> itself</li>\n<li>a <a href=\"http://www.wxpython.org/\" rel=\"nofollow\">wxPython</a> example (superdoodle) has been added.\nDemonstrates not only how easy it is (finally!) to bundle\n<a href=\"http://www.wxpython.org/\" rel=\"nofollow\">wxPython</a> applications, but also how one setup.py can\ndeal with both <a href=\"http://starship.python.net/crew/theller/py2exe/\" rel=\"nofollow\">py2exe</a> and <a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a>.</li>\n<li>A new experimental tool, py2applet, has been added.\nOnce you’ve built it (<tt>python setup.py py2app</tt>, of course), you should\nbe able to build simple applications simply by dragging your main script\nand optionally any packages, data files, Info.plist and icon it needs.</li>\n</ul>\n<p>Known issues:</p>\n<ul>\n<li>Includes <em>all</em> files from packages, it should be smart enough to strip\nunused .py/.pyc/.pyo files (to save space, depending on which\noptimization flag is used).</li>\n<li>The default <tt>PyRuntimeLocations</tt> can cause problems on machines that\nhave a /Library/Frameworks/Python.framework installed.  Workaround is\nto set a plist that has the following key:\n<tt><span class=\"pre\">PyRuntimeLocations=['/System/Library/Frameworks/Python.framework/Versions/2.3/Python']</span></tt>\n(this will be resolved soon)</li>\n</ul>\n</div>\n<div id=\"py2app-0-1\">\n<h2>py2app 0.1</h2>\n<p>(first public release)\n<a href=\"http://undefined.org/python/#py2app\" rel=\"nofollow\">py2app</a> is the bundlebuilder replacement we’ve all been waiting\nfor.  It is implemented as a distutils command, similar to <a href=\"http://starship.python.net/crew/theller/py2exe/\" rel=\"nofollow\">py2exe</a>.</p>\n</div>\n\n          </div>"}, "last_serial": 6608059, "releases": {"0.10": [{"comment_text": "", "digests": {"md5": "1a36d38100840a09fb236f37c7942b24", "sha256": "82b1dd75cfb6b917ad60b9937e800dc80229b61819ff459b7ed46ed177eeaa5e"}, "downloads": -1, "filename": "py2app-0.10.tar.gz", "has_sig": false, "md5_digest": "1a36d38100840a09fb236f37c7942b24", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1663373, "upload_time": "2016-03-28T10:26:18", "upload_time_iso_8601": "2016-03-28T10:26:18.827376Z", "url": "https://files.pythonhosted.org/packages/d0/07/a290a6323d684fd2b9271ec72e6a80bc7dc97e41eb1213b4414928e8dbf1/py2app-0.10.tar.gz", "yanked": false}], "0.11": [{"comment_text": "", "digests": {"md5": "2e261991b9716f6752ffaa23433437e1", "sha256": "53593c0cf48875f28ba10e527ea99b0571880ead11fb76a8070be0a289455a99"}, "downloads": -1, "filename": "py2app-0.11-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "2e261991b9716f6752ffaa23433437e1", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 617948, "upload_time": "2017-01-25T12:26:14", "upload_time_iso_8601": "2017-01-25T12:26:14.745679Z", "url": "https://files.pythonhosted.org/packages/38/e3/9a5bd9536a8b8ffd8feb579f2100628c7c10a58f89828305980d12e16e2c/py2app-0.11-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b7beb71026b3d389238318ec58f0f4ca", "sha256": "5bd38894c873d4e72b9ecc089913347d087bbc52798cdde579a687319ef96ae4"}, "downloads": -1, "filename": "py2app-0.11.tar.gz", "has_sig": false, "md5_digest": "b7beb71026b3d389238318ec58f0f4ca", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 919938, "upload_time": "2017-01-25T12:26:18", "upload_time_iso_8601": "2017-01-25T12:26:18.011223Z", "url": "https://files.pythonhosted.org/packages/7d/66/77a993c274b56c3685f7b948a4a19462046ee3748588141a75f3f6b0f0f5/py2app-0.11.tar.gz", "yanked": false}], "0.12": [{"comment_text": "", "digests": {"md5": "f5705c7ed19bf3134c35418dcf3cfec2", "sha256": "e44de37eda60cb13c15006c276af1f39e20048ed3f72b351fd5aac0716bd5f49"}, "downloads": -1, "filename": "py2app-0.12-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "f5705c7ed19bf3134c35418dcf3cfec2", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 618408, "upload_time": "2017-02-22T10:33:54", "upload_time_iso_8601": "2017-02-22T10:33:54.058576Z", "url": "https://files.pythonhosted.org/packages/02/52/b5c14bb229fe93fa348bb95f95b1369b4105d47f14f010f4e872cae1f880/py2app-0.12-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "04ebee8c7aa4500d0273f55ad170e019", "sha256": "09c8e0fc2b9335859c416c2bb60749701f8981577e706a45aecb525836f3e0a1"}, "downloads": -1, "filename": "py2app-0.12.tar.gz", "has_sig": false, "md5_digest": "04ebee8c7aa4500d0273f55ad170e019", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 921399, "upload_time": "2017-02-22T10:33:57", "upload_time_iso_8601": "2017-02-22T10:33:57.855642Z", "url": "https://files.pythonhosted.org/packages/d9/ff/48a8aede5e99db5983039fd0e6c54bb4c0806ef696430d2684348e78249f/py2app-0.12.tar.gz", "yanked": false}], "0.13": [{"comment_text": "", "digests": {"md5": "a94aa0c2ee92d67dbae85f239dfc14c1", "sha256": "08d45bde2de35e7c6c458d920a0998d183446749c79d15cc3dd7f7e70e2f012c"}, "downloads": -1, "filename": "py2app-0.13-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "a94aa0c2ee92d67dbae85f239dfc14c1", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 619254, "upload_time": "2017-05-07T11:22:27", "upload_time_iso_8601": "2017-05-07T11:22:27.703600Z", "url": "https://files.pythonhosted.org/packages/5b/62/da6d1534e375895d067a5827983d668348c5930f97fecf76f241386d789d/py2app-0.13-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5d0c85a2e0f8fab6e1efabe8da6ca4ca", "sha256": "9b238347ad6f5fa8bf61fb51c2b0d38dfcad48a6ce29ffe908becad4572874a9"}, "downloads": -1, "filename": "py2app-0.13.tar.gz", "has_sig": false, "md5_digest": "5d0c85a2e0f8fab6e1efabe8da6ca4ca", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 920791, "upload_time": "2017-05-07T11:22:31", "upload_time_iso_8601": "2017-05-07T11:22:31.762100Z", "url": "https://files.pythonhosted.org/packages/b9/a8/53269ace6aa4bc430e1d42c7786be9f8fd4f325b1e70d16adc4facfbfc5e/py2app-0.13.tar.gz", "yanked": false}], "0.14": [{"comment_text": "", "digests": {"md5": "c59a94636a1d06dc2b64f7b513e03055", "sha256": "f0126503efaf83c169ba1ecf810917d762a2368559f40400e12bbede5d3dccb6"}, "downloads": -1, "filename": "py2app-0.14-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "c59a94636a1d06dc2b64f7b513e03055", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 616214, "upload_time": "2017-06-05T11:42:18", "upload_time_iso_8601": "2017-06-05T11:42:18.580598Z", "url": "https://files.pythonhosted.org/packages/7c/eb/d6840c760cde3ffd260b9e6618a088c5154ceff3fa5d4218a9011b16377f/py2app-0.14-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "8fa1acfb3e3c2fbf9a396ae5b1f45869", "sha256": "4dadf15d078a1748acba483c1abbb69a144a059e0c335a5e2a17b070d4cc938a"}, "downloads": -1, "filename": "py2app-0.14.tar.gz", "has_sig": false, "md5_digest": "8fa1acfb3e3c2fbf9a396ae5b1f45869", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1165241, "upload_time": "2017-06-05T11:42:22", "upload_time_iso_8601": "2017-06-05T11:42:22.427294Z", "url": "https://files.pythonhosted.org/packages/65/ea/b8e5a4f41fd65e35c10b41ff68e776baeb07143983f484f1d9005a7ab36a/py2app-0.14.tar.gz", "yanked": false}], "0.15": [{"comment_text": "", "digests": {"md5": "2fa175e02d0b3e46cdc8f2bd1b4261e0", "sha256": "aa01961ddfc3fb1eac8d1a5476bda62652c212c81a60eb30324d000ec5283c92"}, "downloads": -1, "filename": "py2app-0.15-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "2fa175e02d0b3e46cdc8f2bd1b4261e0", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 598789, "upload_time": "2018-07-27T13:05:53", "upload_time_iso_8601": "2018-07-27T13:05:53.838168Z", "url": "https://files.pythonhosted.org/packages/ba/ab/c2748196af5937b602373d3fd9c97bc737cd07ef2d7b0fe8bd80cb10612b/py2app-0.15-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0049144c64f274c00242102a3bcfac6d", "sha256": "4c1b74daab023f37aea132e6b124522bbf4704414a80ed299361c48c70a83989"}, "downloads": -1, "filename": "py2app-0.15.tar.gz", "has_sig": false, "md5_digest": "0049144c64f274c00242102a3bcfac6d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1760512, "upload_time": "2018-07-27T13:07:36", "upload_time_iso_8601": "2018-07-27T13:07:36.317282Z", "url": "https://files.pythonhosted.org/packages/26/3b/c1db5c32b9fa1feb3e75ea363d4af1640699a26a2e30fd77c8286866ed1b/py2app-0.15.tar.gz", "yanked": false}], "0.16": [{"comment_text": "", "digests": {"md5": "cd8a1ffae4c6b7ff08220fbb0827abf2", "sha256": "1ad22e10e6d724a0d4b5a92d6afb13115f4a1bb90e17aef6e031463d4a3331e3"}, "downloads": -1, "filename": "py2app-0.16-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "cd8a1ffae4c6b7ff08220fbb0827abf2", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 600627, "upload_time": "2018-08-28T18:24:02", "upload_time_iso_8601": "2018-08-28T18:24:02.938364Z", "url": "https://files.pythonhosted.org/packages/d7/b5/e8abab2d6fbe6223cf8eadfeab085e92c75e4f30bd6c99f09f3f7572a524/py2app-0.16-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f0561d7cd1b8f53f128a0719d7f2bbae", "sha256": "536f3c0bf4045b8d0fc32fcfbb57fb0b34fb56e2f243afe3f65164f83352656b"}, "downloads": -1, "filename": "py2app-0.16.tar.gz", "has_sig": false, "md5_digest": "f0561d7cd1b8f53f128a0719d7f2bbae", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1761691, "upload_time": "2018-08-28T18:24:18", "upload_time_iso_8601": "2018-08-28T18:24:18.586169Z", "url": "https://files.pythonhosted.org/packages/0f/33/b29aa0591af413789e4943d2b6e499401b08bc371f2e4bbe2a56721671a4/py2app-0.16.tar.gz", "yanked": false}], "0.17": [{"comment_text": "", "digests": {"md5": "627496c757eab2eaf1f2dbbb878148ae", "sha256": "108114e0853c9a64206c26ac6db81265f065cc85d3fcbcec60acd287061ee0b1"}, "downloads": -1, "filename": "py2app-0.17-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "627496c757eab2eaf1f2dbbb878148ae", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 600665, "upload_time": "2018-09-09T08:46:43", "upload_time_iso_8601": "2018-09-09T08:46:43.195513Z", "url": "https://files.pythonhosted.org/packages/7d/0b/46738c2c51427e77e0d22750bb6625aa82812ea2ac62a56aa50c1e93909a/py2app-0.17-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "dc605de6f4e4d7360bf9a94bdd3dd45a", "sha256": "d0d36cbfef887dfd1c3488d23e5aaf743a65038ddfdf3c2b1343daec80e2da25"}, "downloads": -1, "filename": "py2app-0.17.tar.gz", "has_sig": false, "md5_digest": "dc605de6f4e4d7360bf9a94bdd3dd45a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 958957, "upload_time": "2018-09-09T08:46:46", "upload_time_iso_8601": "2018-09-09T08:46:46.380042Z", "url": "https://files.pythonhosted.org/packages/33/b4/0bc527fd06ac3d78d1b384403ca4c57fb555dc89e35237de99035e0a7ac9/py2app-0.17.tar.gz", "yanked": false}], "0.18": [{"comment_text": "", "digests": {"md5": "c70b7619d8777d806e645baa9595878f", "sha256": "e91d4fbf97a274a2428e54db297dc1373eb0e41d82c4845d9293437d2e42ebbf"}, "downloads": -1, "filename": "py2app-0.18-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "c70b7619d8777d806e645baa9595878f", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 602357, "upload_time": "2018-10-11T15:16:50", "upload_time_iso_8601": "2018-10-11T15:16:50.198621Z", "url": "https://files.pythonhosted.org/packages/7b/e3/5707cf151a7d299baca2d3fa97fad995e07f438610edb262de39773230f4/py2app-0.18-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "190fb023a3e815dc53d57ad6877646e9", "sha256": "1daaaea4dccad8fab25eec7edda81a52906dd657ad39b493ae3174498cf983c1"}, "downloads": -1, "filename": "py2app-0.18.tar.gz", "has_sig": false, "md5_digest": "190fb023a3e815dc53d57ad6877646e9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 959918, "upload_time": "2018-10-11T15:16:52", "upload_time_iso_8601": "2018-10-11T15:16:52.778055Z", "url": "https://files.pythonhosted.org/packages/cb/e2/38df103ada1d19f217170150bb85f9544e6b4ccf00554f1705fa96be3aad/py2app-0.18.tar.gz", "yanked": false}], "0.19": [{"comment_text": "", "digests": {"md5": "07cb80f94263f50b58d1807a56bb3566", "sha256": "e77544f32231c857259afc731c5c96fcb202e7ab370807f0608e9f37fee212e5"}, "downloads": -1, "filename": "py2app-0.19-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "07cb80f94263f50b58d1807a56bb3566", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 605091, "upload_time": "2019-03-25T08:18:11", "upload_time_iso_8601": "2019-03-25T08:18:11.346117Z", "url": "https://files.pythonhosted.org/packages/ca/b9/e2694542fad0b53ebcd2a183bac8535454b469fef4e4397a0296af90fcac/py2app-0.19-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ceeb6174edb013bb27add54309f30ef0", "sha256": "f3b9f4deb466998304fedea739bfa7bc553a1887656f7ee6accb2899e9e45b52"}, "downloads": -1, "filename": "py2app-0.19.tar.gz", "has_sig": false, "md5_digest": "ceeb6174edb013bb27add54309f30ef0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2516394, "upload_time": "2019-03-25T08:18:15", "upload_time_iso_8601": "2019-03-25T08:18:15.188800Z", "url": "https://files.pythonhosted.org/packages/4d/a2/c01b3eb13163be0fe3065c0c5461f75e702ab0dc66a7f42f8987884448a5/py2app-0.19.tar.gz", "yanked": false}], "0.20": [{"comment_text": "", "digests": {"md5": "6745b6a3b0a9919d06fbccbbee2719c2", "sha256": "916f9483bf733379a3a8f3216b95cef2dec6478e5b52182daab565ac2a6fc0cb"}, "downloads": -1, "filename": "py2app-0.20-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "6745b6a3b0a9919d06fbccbbee2719c2", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 603672, "upload_time": "2020-01-14T22:33:04", "upload_time_iso_8601": "2020-01-14T22:33:04.258777Z", "url": "https://files.pythonhosted.org/packages/53/f1/0d4a581f05b1094fc351da257fa3fcdca8f0ff861a4406a877c2e224fc26/py2app-0.20-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ac3551eeb051842bd7792209730b0ad5", "sha256": "46ce0a1551c621a976ba12b4fe4e655ab39339fa1e75784cdafb4295b269bb91"}, "downloads": -1, "filename": "py2app-0.20.tar.gz", "has_sig": false, "md5_digest": "ac3551eeb051842bd7792209730b0ad5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1028955, "upload_time": "2020-01-14T22:33:07", "upload_time_iso_8601": "2020-01-14T22:33:07.446686Z", "url": "https://files.pythonhosted.org/packages/b8/42/a68d4fa9839229cebec6f616c27c0912010f8563f72073227789e038309c/py2app-0.20.tar.gz", "yanked": false}], "0.21": [{"comment_text": "", "digests": {"md5": "1abdd6fc8a5ddd11536ca028dcac2600", "sha256": "1ce4ffeaa6d34d6a47276b95329fd7469f92b6363213af44a064867c3f0a264e"}, "downloads": -1, "filename": "py2app-0.21-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "1abdd6fc8a5ddd11536ca028dcac2600", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 603619, "upload_time": "2020-02-11T09:04:29", "upload_time_iso_8601": "2020-02-11T09:04:29.037808Z", "url": "https://files.pythonhosted.org/packages/e1/6c/21439508b39e2789ca5a8980e625cbdd0df2655840dfd7e0be203833d922/py2app-0.21-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "04ccf26a12908d89e32bfba1b996144a", "sha256": "4516dfb01a0bf560ca4918e1e0e38eb4fcc76c9c2f527456e022310a80d52dc8"}, "downloads": -1, "filename": "py2app-0.21.tar.gz", "has_sig": false, "md5_digest": "04ccf26a12908d89e32bfba1b996144a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1029032, "upload_time": "2020-02-11T09:04:33", "upload_time_iso_8601": "2020-02-11T09:04:33.253955Z", "url": "https://files.pythonhosted.org/packages/50/59/915918ada9f2d892eb584ecd14b71f4f87b31ec6a26b5ac4102f4ac3f704/py2app-0.21.tar.gz", "yanked": false}], "0.3": [{"comment_text": "", "digests": {"md5": "bb21998867aa38c115e5c5f612797ba7", "sha256": "88659f2bcdf38dbc3001227c6ddf5a03279370015a0d76680fa9bc2ad815a228"}, "downloads": -1, "filename": "py2app-0.3-py2.4.egg", "has_sig": true, "md5_digest": "bb21998867aa38c115e5c5f612797ba7", "packagetype": "bdist_egg", "python_version": "2.4", "requires_python": null, "size": 150394, "upload_time": "2006-07-11T20:19:25", "upload_time_iso_8601": "2006-07-11T20:19:25Z", "url": "https://files.pythonhosted.org/packages/87/92/685fc8da8cd4629efccdaf336424b2314124c9e2387b70b6b42ac9eb7ab6/py2app-0.3-py2.4.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "2ffc9f4df05fe5c361f74643e1a414f2", "sha256": "9033003e78cdfb348422233d59d0d6ab0e63c5d014c81cdf50eac2d0f9b84fb5"}, "downloads": -1, "filename": "py2app-0.3.tar.gz", "has_sig": true, "md5_digest": "2ffc9f4df05fe5c361f74643e1a414f2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 269989, "upload_time": "2006-07-11T20:19:19", "upload_time_iso_8601": "2006-07-11T20:19:19Z", "url": "https://files.pythonhosted.org/packages/73/8d/808958507a74989e5a06b88af2c63aec31613ca9c2338420e326af417f44/py2app-0.3.tar.gz", "yanked": false}], "0.3.1": [{"comment_text": "", "digests": {"md5": "e471efd12a15a8d69958ad3d789cd692", "sha256": "f157ee6f588f30d7b4af6b3f4b643ccba714a98f32838936fa7c3867d2e9861b"}, "downloads": -1, "filename": "py2app-0.3.1-py2.4.egg", "has_sig": true, "md5_digest": "e471efd12a15a8d69958ad3d789cd692", "packagetype": "bdist_egg", "python_version": "2.4", "requires_python": null, "size": 150684, "upload_time": "2006-07-12T05:30:51", "upload_time_iso_8601": "2006-07-12T05:30:51Z", "url": "https://files.pythonhosted.org/packages/59/04/bafb8715e7ff1067ce9ee828710d362fb909118023feebb42f1625adca35/py2app-0.3.1-py2.4.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "7b4a263a0f19c5f98e764b190b194866", "sha256": "46ec2b034a81db76e3e2e71cf6d5f634e94bdb05ffcce3bff9bbf6700ff55ff0"}, "downloads": -1, "filename": "py2app-0.3.1.tar.gz", "has_sig": true, "md5_digest": "7b4a263a0f19c5f98e764b190b194866", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 299523, "upload_time": "2006-07-12T05:30:57", "upload_time_iso_8601": "2006-07-12T05:30:57Z", "url": "https://files.pythonhosted.org/packages/ed/98/9bb963e321b9db9fbc76f0c822ad60ad31ec0296824f2aee4574736c2fe0/py2app-0.3.1.tar.gz", "yanked": false}], "0.3.2": [{"comment_text": "", "digests": {"md5": "dfe24760045ce2af887a8a86dd4a0639", "sha256": "b014d8e2d557a84dcada59df191c3aade9a6498788c26f5a3802fd103084af50"}, "downloads": -1, "filename": "py2app-0.3.2-py2.4.egg", "has_sig": true, "md5_digest": "dfe24760045ce2af887a8a86dd4a0639", "packagetype": "bdist_egg", "python_version": "2.4", "requires_python": null, "size": 156918, "upload_time": "2006-07-20T18:09:44", "upload_time_iso_8601": "2006-07-20T18:09:44Z", "url": "https://files.pythonhosted.org/packages/d1/a7/f5eef578acedccc358a2597b2749e266f78e859cfd84da42891faf76d95c/py2app-0.3.2-py2.4.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "66b64e17d9bf2ea59ce2c50e7d0328c4", "sha256": "802362bd99267044cb302c51fc2203eb5cdd998cdbab95a64de79fbd333a7ede"}, "downloads": -1, "filename": "py2app-0.3.2.tar.gz", "has_sig": true, "md5_digest": "66b64e17d9bf2ea59ce2c50e7d0328c4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 311229, "upload_time": "2006-07-20T18:09:52", "upload_time_iso_8601": "2006-07-20T18:09:52Z", "url": "https://files.pythonhosted.org/packages/c9/e6/3a584ffe594a0a02c4bc3ecf47c8c0516007876cc809823d88a6d3e77a68/py2app-0.3.2.tar.gz", "yanked": false}], "0.3.3": [{"comment_text": "", "digests": {"md5": "4f6bd3d90ae2ad6ef46f853d7994c504", "sha256": "7b14a4a28d32d295ab4d277354b54de3d062195feecd794662725034c86a4ee8"}, "downloads": -1, "filename": "py2app-0.3.3-py2.4.egg", "has_sig": true, "md5_digest": "4f6bd3d90ae2ad6ef46f853d7994c504", "packagetype": "bdist_egg", "python_version": "2.4", "requires_python": null, "size": 155257, "upload_time": "2006-08-01T23:56:32", "upload_time_iso_8601": "2006-08-01T23:56:32Z", "url": "https://files.pythonhosted.org/packages/f4/de/c083c9ca06e515cf90ef5ce887986121ddec6b77cad160297a09be8b6c4c/py2app-0.3.3-py2.4.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "851866ca6ded72a7c88d3cc1b41fc962", "sha256": "09669b18f45524e3291b740764cc1a101adfe589b9d193c2fc4101a60c2cf708"}, "downloads": -1, "filename": "py2app-0.3.3.tar.gz", "has_sig": true, "md5_digest": "851866ca6ded72a7c88d3cc1b41fc962", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 310430, "upload_time": "2006-08-01T23:56:38", "upload_time_iso_8601": "2006-08-01T23:56:38Z", "url": "https://files.pythonhosted.org/packages/db/c1/739dde266c3da69ce979cdbdd53b267e517db2a27b4469d5b03b77cca8ba/py2app-0.3.3.tar.gz", "yanked": false}], "0.3.4": [{"comment_text": "", "digests": {"md5": "25f133e0ba51abc2819682be1e25bb97", "sha256": "9eab7a3cd11d59a3528406a513261299748824dac19b97d4d115fd3ac856e769"}, "downloads": -1, "filename": "py2app-0.3.4-py2.4.egg", "has_sig": true, "md5_digest": "25f133e0ba51abc2819682be1e25bb97", "packagetype": "bdist_egg", "python_version": "2.4", "requires_python": null, "size": 155332, "upload_time": "2006-09-25T21:16:46", "upload_time_iso_8601": "2006-09-25T21:16:46Z", "url": "https://files.pythonhosted.org/packages/d1/19/a07f1e5c6b36e3b29d3cfd8013e1354172ccfa3e6e4c3313ad1bd4d0f8e2/py2app-0.3.4-py2.4.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "be97b74c3fc28b8770e51e8d46192d60", "sha256": "4499b2e9195d3e065bc074ffe8352dd4f54ac1dda605f82793f17cd0e98a7d26"}, "downloads": -1, "filename": "py2app-0.3.4.tar.gz", "has_sig": true, "md5_digest": "be97b74c3fc28b8770e51e8d46192d60", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 310863, "upload_time": "2006-09-25T21:16:53", "upload_time_iso_8601": "2006-09-25T21:16:53Z", "url": "https://files.pythonhosted.org/packages/57/3e/40bc744b579ce0aae731af3d185868462e1e6edc2d72086bb2007d04df58/py2app-0.3.4.tar.gz", "yanked": false}], "0.3.5": [{"comment_text": "", "digests": {"md5": "100f341e1ad1c8ff3020f7bdff5db8e4", "sha256": "85f875cb200fb4f4990c5cc22e29db3625b625891b4787b5ae2049054fec001a"}, "downloads": -1, "filename": "py2app-0.3.5-py2.4.egg", "has_sig": true, "md5_digest": "100f341e1ad1c8ff3020f7bdff5db8e4", "packagetype": "bdist_egg", "python_version": "2.4", "requires_python": null, "size": 155372, "upload_time": "2006-10-15T21:46:29", "upload_time_iso_8601": "2006-10-15T21:46:29Z", "url": "https://files.pythonhosted.org/packages/51/c3/54c6d66b7beacb6902473276b2f167db6fdb2bf470d1a2012f1813ceb94a/py2app-0.3.5-py2.4.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "2ca0f65355b7e7ba3eddf5814b2ecd73", "sha256": "77e3a28079d741af8d3141d590d55d08b71a4fe33bbbd91c915e1dc36280fa03"}, "downloads": -1, "filename": "py2app-0.3.5.tar.gz", "has_sig": true, "md5_digest": "2ca0f65355b7e7ba3eddf5814b2ecd73", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 310990, "upload_time": "2006-10-15T21:46:36", "upload_time_iso_8601": "2006-10-15T21:46:36Z", "url": "https://files.pythonhosted.org/packages/0b/ee/d6d4323aa06164f8131cb7140caf38f5b2fa31c723c4177bc90131489ead/py2app-0.3.5.tar.gz", "yanked": false}], "0.3.6": [{"comment_text": "", "digests": {"md5": "47f572eae3f1062d87a6ea83c83d67e9", "sha256": "cc17857db7ded049b50be3a3febeb81fd125342c278040b59082d2dc5573be85"}, "downloads": -1, "filename": "py2app-0.3.6-py2.4.egg", "has_sig": true, "md5_digest": "47f572eae3f1062d87a6ea83c83d67e9", "packagetype": "bdist_egg", "python_version": "2.4", "requires_python": null, "size": 156842, "upload_time": "2007-03-05T20:38:50", "upload_time_iso_8601": "2007-03-05T20:38:50Z", "url": "https://files.pythonhosted.org/packages/4e/00/9dffba4f12f74412666720c45eea7b8d769cac0e1963e325b2afa08971fa/py2app-0.3.6-py2.4.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "dffbcc55bbe1ce762ded2adba391b77d", "sha256": "95e8b486a7a4e349e3dd6e52fe5174f300246b8df1eebba1100753901465491c"}, "downloads": -1, "filename": "py2app-0.3.6.tar.gz", "has_sig": true, "md5_digest": "dffbcc55bbe1ce762ded2adba391b77d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 311265, "upload_time": "2007-03-05T20:39:47", "upload_time_iso_8601": "2007-03-05T20:39:47Z", "url": "https://files.pythonhosted.org/packages/b2/c9/4350edb7fd1840b3c5321a38ff289d9f331963442b7f467b634262eaa003/py2app-0.3.6.tar.gz", "yanked": false}], "0.4.2": [{"comment_text": "", "digests": {"md5": "fab793a7e97620afec146e515bbf4e80", "sha256": "97a9917af5f1f5c16c7373517741011cbc34bd3471771d8e14a8126e992fdca6"}, "downloads": -1, "filename": "py2app-0.4.2.tar.gz", "has_sig": false, "md5_digest": "fab793a7e97620afec146e515bbf4e80", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 338065, "upload_time": "2009-10-06T22:04:47", "upload_time_iso_8601": "2009-10-06T22:04:47.165954Z", "url": "https://files.pythonhosted.org/packages/f2/59/e8d5c84f14e17321bba53d981b1760d449fb13b2e1ec54cd4e5b6158a604/py2app-0.4.2.tar.gz", "yanked": false}], "0.4.3": [{"comment_text": "", "digests": {"md5": "45cc8ebc170a41b03a2a4c5feac75b1f", "sha256": "47796721b523501bbf59d2ee5e9e26b58feb663a82c73f0eb5930222f2b7d67a"}, "downloads": -1, "filename": "py2app-0.4.3.tar.gz", "has_sig": false, "md5_digest": "45cc8ebc170a41b03a2a4c5feac75b1f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 338130, "upload_time": "2009-10-11T13:12:24", "upload_time_iso_8601": "2009-10-11T13:12:24.644360Z", "url": "https://files.pythonhosted.org/packages/b8/17/b737ca7ebbbb50749ed8ebd00878c50e4650d5d081442540b469c6eafed9/py2app-0.4.3.tar.gz", "yanked": false}], "0.5": [{"comment_text": "", "digests": {"md5": "29d92612b9bb2a389c0728198f9e11ee", "sha256": "9c575ca53889a35be2287026e62ae91b6746059169258f886c9f1d285dfced48"}, "downloads": -1, "filename": "py2app-0.5-py2.5.egg", "has_sig": false, "md5_digest": "29d92612b9bb2a389c0728198f9e11ee", "packagetype": "bdist_egg", "python_version": "2.5", "requires_python": null, "size": 117817, "upload_time": "2010-07-27T21:02:24", "upload_time_iso_8601": "2010-07-27T21:02:24.758768Z", "url": "https://files.pythonhosted.org/packages/ac/7f/488a7e1132955c55e7f2ca8b9107fcef909943f4e1536d3eb8f45c087da6/py2app-0.5-py2.5.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "0704ba02801a251da2be1c01ee46abd5", "sha256": "3e9c849ac6f0f458906b73bec3bfba37db436f463bb8e2bd47dd11536d5c2cfe"}, "downloads": -1, "filename": "py2app-0.5-py2.6.egg", "has_sig": false, "md5_digest": "0704ba02801a251da2be1c01ee46abd5", "packagetype": "bdist_egg", "python_version": "2.6", "requires_python": null, "size": 132666, "upload_time": "2010-07-27T21:02:52", "upload_time_iso_8601": "2010-07-27T21:02:52.710750Z", "url": "https://files.pythonhosted.org/packages/05/aa/d1d2fae0131460f28b44f4fa24208abd4902ddb8c3468e9a956295557acb/py2app-0.5-py2.6.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "b134c2aeae39df0135e555d166032d18", "sha256": "fd596e0c1217e81c1559c5c0b3301a1b944bf03a65d2af93d6c8edeee10e33fe"}, "downloads": -1, "filename": "py2app-0.5-py2.7.egg", "has_sig": false, "md5_digest": "b134c2aeae39df0135e555d166032d18", "packagetype": "bdist_egg", "python_version": "2.7", "requires_python": null, "size": 132206, "upload_time": "2010-07-27T21:02:58", "upload_time_iso_8601": "2010-07-27T21:02:58.116411Z", "url": "https://files.pythonhosted.org/packages/18/2d/b6714fe392b48936bcb0d241e35c9f9b3d21bc3e8876ed5625bc7f2b5145/py2app-0.5-py2.7.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "295f4e9b143cb0f510e93b560eb8f673", "sha256": "da18db5261fddd5880c16483576db0e8db2ecc4c6a96ca3dbe9558ce8d445d7f"}, "downloads": -1, "filename": "py2app-0.5-py3.1.egg", "has_sig": false, "md5_digest": "295f4e9b143cb0f510e93b560eb8f673", "packagetype": "bdist_egg", "python_version": "3.1", "requires_python": null, "size": 114627, "upload_time": "2010-07-27T21:03:11", "upload_time_iso_8601": "2010-07-27T21:03:11.560559Z", "url": "https://files.pythonhosted.org/packages/af/38/8d4537cf8fde174ca56dd71751d32df05eac3f35aace67448aa069947e0c/py2app-0.5-py3.1.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "2f3b30a6efff38f49e3cf2fb33b840b4", "sha256": "6dcabbdd8aa0ef07ab292215679f5a25f286f9fc2adfb926ab6fb2a877dcd4c9"}, "downloads": -1, "filename": "py2app-0.5-py3.2.egg", "has_sig": false, "md5_digest": "2f3b30a6efff38f49e3cf2fb33b840b4", "packagetype": "bdist_egg", "python_version": "3.2", "requires_python": null, "size": 114574, "upload_time": "2010-07-27T21:03:22", "upload_time_iso_8601": "2010-07-27T21:03:22.500713Z", "url": "https://files.pythonhosted.org/packages/39/6b/1800852d90b6f1dfebce7b320a1877bc4a89aa6a1bfb03df8a165d0226c6/py2app-0.5-py3.2.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "fdc579378bd6dc1fc516390c046aa957", "sha256": "6b74b69cab9c2f17f8b9203229146e817e67cc573d4ebb0b975fd21f85a87330"}, "downloads": -1, "filename": "py2app-0.5.tar.gz", "has_sig": false, "md5_digest": "fdc579378bd6dc1fc516390c046aa957", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 497661, "upload_time": "2010-07-27T21:01:55", "upload_time_iso_8601": "2010-07-27T21:01:55.150164Z", "url": "https://files.pythonhosted.org/packages/cb/b7/ecd9a906d7d2e78570ab02577dda81b01e25dd1058f5e20b187ec9b274b6/py2app-0.5.tar.gz", "yanked": false}], "0.5.1": [{"comment_text": "", "digests": {"md5": "e1919e532aee4b022f1b14767aeafd3b", "sha256": "5729ec263ab113dbf5bae1a9c800cd1b2cfd328405818bd627f449f38c50dee2"}, "downloads": -1, "filename": "py2app-0.5.1-py2.5.egg", "has_sig": false, "md5_digest": "e1919e532aee4b022f1b14767aeafd3b", "packagetype": "bdist_egg", "python_version": "2.5", "requires_python": null, "size": 353745, "upload_time": "2010-07-29T07:54:49", "upload_time_iso_8601": "2010-07-29T07:54:49.229716Z", "url": "https://files.pythonhosted.org/packages/cd/a9/9c12c9936165e04a049588c58850ae188204e25de2aab725db858c0d1ec6/py2app-0.5.1-py2.5.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "9a4e2472ab7f1c9afad8e23ba5dd7112", "sha256": "1eeb42f14beb822fc1306b48b2c3f74ff7de3ce1fe6c240f7ea13b079839a701"}, "downloads": -1, "filename": "py2app-0.5.1-py2.6.egg", "has_sig": false, "md5_digest": "9a4e2472ab7f1c9afad8e23ba5dd7112", "packagetype": "bdist_egg", "python_version": "2.6", "requires_python": null, "size": 353538, "upload_time": "2010-07-29T07:55:06", "upload_time_iso_8601": "2010-07-29T07:55:06.194574Z", "url": "https://files.pythonhosted.org/packages/25/df/04de776393fe5122b9532158c3978a840e5ae1100275cb4742e830b3a00d/py2app-0.5.1-py2.6.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "5821e9feacf61807d838fd9836e2a9b2", "sha256": "d85f69ba3f39687b35da3f3d1c5e16b7eec0f1b405c6a2aba8282d93ab17885a"}, "downloads": -1, "filename": "py2app-0.5.1-py2.7.egg", "has_sig": false, "md5_digest": "5821e9feacf61807d838fd9836e2a9b2", "packagetype": "bdist_egg", "python_version": "2.7", "requires_python": null, "size": 353059, "upload_time": "2010-07-29T07:55:17", "upload_time_iso_8601": "2010-07-29T07:55:17.422107Z", "url": "https://files.pythonhosted.org/packages/9a/de/e041733136295827f306d3bb22b542933aa8c26c3ff862f616ceb8a846e7/py2app-0.5.1-py2.7.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "df4490ed96796a8e884b93ffd2f5b0f9", "sha256": "c8457edf504c56f53e1f10385a3d27356c0110be7c4ee8e8cba0c664180cf72f"}, "downloads": -1, "filename": "py2app-0.5.1-py3.1.egg", "has_sig": false, "md5_digest": "df4490ed96796a8e884b93ffd2f5b0f9", "packagetype": "bdist_egg", "python_version": "3.1", "requires_python": null, "size": 312815, "upload_time": "2010-07-29T07:56:07", "upload_time_iso_8601": "2010-07-29T07:56:07.134407Z", "url": "https://files.pythonhosted.org/packages/1a/aa/6ad8ede79333d274316048241cbb7849d43819b24615a8f80654b62f1228/py2app-0.5.1-py3.1.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "8028df95cf493d8e5be44879fbb703c6", "sha256": "562515828867de3931bc82ba986ae74087ff69ed12c5b9a3986f5f6976e2e11c"}, "downloads": -1, "filename": "py2app-0.5.1-py3.2.egg", "has_sig": false, "md5_digest": "8028df95cf493d8e5be44879fbb703c6", "packagetype": "bdist_egg", "python_version": "3.2", "requires_python": null, "size": 354075, "upload_time": "2010-07-29T07:56:42", "upload_time_iso_8601": "2010-07-29T07:56:42.810383Z", "url": "https://files.pythonhosted.org/packages/6e/20/e20d662f731a9cec4290c96b9c866c6fc2360444ce1fa157c993268f9a3e/py2app-0.5.1-py3.2.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "fadbefde643b69c8223702554aafe371", "sha256": "a9983b8f8b9779e38b2dcea642eaf603057b52d54344f43f22aa74bb801cc2da"}, "downloads": -1, "filename": "py2app-0.5.1.tar.gz", "has_sig": false, "md5_digest": "fadbefde643b69c8223702554aafe371", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 493849, "upload_time": "2010-07-29T07:52:25", "upload_time_iso_8601": "2010-07-29T07:52:25.915392Z", "url": "https://files.pythonhosted.org/packages/9c/4b/544fa78ddacd9bc140e68fe6be02a3272cf0437492001a159e7f0444905f/py2app-0.5.1.tar.gz", "yanked": false}], "0.5.2": [{"comment_text": "", "digests": {"md5": "9e0292bf0a0430a8236acccca2249c63", "sha256": "0f089863ca734904935d0255c0738aa34cd055d318beb12d5c5ad9ea1fd419f8"}, "downloads": -1, "filename": "py2app-0.5.2-py2.5.egg", "has_sig": false, "md5_digest": "9e0292bf0a0430a8236acccca2249c63", "packagetype": "bdist_egg", "python_version": "2.5", "requires_python": null, "size": 354126, "upload_time": "2010-07-29T08:31:31", "upload_time_iso_8601": "2010-07-29T08:31:31.665642Z", "url": "https://files.pythonhosted.org/packages/be/fc/3d2004c3d1331ccf8a2c4c5aded7be89ff9cdb267b20cf40fdbb61fb895b/py2app-0.5.2-py2.5.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "f9befe82b8541f3a1982cb020db3e9f4", "sha256": "4d0979c88683a1c0269159b1c44d2a4628e2ecc94cff118329fde0cc7617991f"}, "downloads": -1, "filename": "py2app-0.5.2-py2.6.egg", "has_sig": false, "md5_digest": "f9befe82b8541f3a1982cb020db3e9f4", "packagetype": "bdist_egg", "python_version": "2.6", "requires_python": null, "size": 353922, "upload_time": "2010-07-29T08:31:47", "upload_time_iso_8601": "2010-07-29T08:31:47.865472Z", "url": "https://files.pythonhosted.org/packages/19/74/ea15a51ce250810e14ab0c1afae5dac30fc68aafd514750d1df14e2a8441/py2app-0.5.2-py2.6.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "7b85de5a5640977737eed96694a9f358", "sha256": "1906deeb45a9f43b3f070162e8c170dd504af6569a9f9b07d071671f45783894"}, "downloads": -1, "filename": "py2app-0.5.2-py2.7.egg", "has_sig": false, "md5_digest": "7b85de5a5640977737eed96694a9f358", "packagetype": "bdist_egg", "python_version": "2.7", "requires_python": null, "size": 353446, "upload_time": "2010-07-29T08:31:56", "upload_time_iso_8601": "2010-07-29T08:31:56.029104Z", "url": "https://files.pythonhosted.org/packages/58/f1/4da7fc7a611070bf411113ee918d7e1e6a724fda91cd19dce6d787da4dfa/py2app-0.5.2-py2.7.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "d618eedc1cd99af3259971ee83e7291b", "sha256": "5262bc31e3e81e50b98a5b41a04346fb465aba698a78c3d017154a8c9ac46042"}, "downloads": -1, "filename": "py2app-0.5.2-py3.1.egg", "has_sig": false, "md5_digest": "d618eedc1cd99af3259971ee83e7291b", "packagetype": "bdist_egg", "python_version": "3.1", "requires_python": null, "size": 354575, "upload_time": "2010-07-29T08:32:21", "upload_time_iso_8601": "2010-07-29T08:32:21.103977Z", "url": "https://files.pythonhosted.org/packages/fb/8d/2f761dee6fdd35517e6bfde70f09b8c88ea79f96f20eddf39d2f61a8adbd/py2app-0.5.2-py3.1.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "7b21580c43b472222f2cf94f0d8d549a", "sha256": "e0dfb43f844cf1a039cc74e08149cdf32819493d4839e5e0719a822191d76708"}, "downloads": -1, "filename": "py2app-0.5.2-py3.2.egg", "has_sig": false, "md5_digest": "7b21580c43b472222f2cf94f0d8d549a", "packagetype": "bdist_egg", "python_version": "3.2", "requires_python": null, "size": 354481, "upload_time": "2010-07-29T08:32:44", "upload_time_iso_8601": "2010-07-29T08:32:44.396630Z", "url": "https://files.pythonhosted.org/packages/a9/f6/d98483be9c021f2638cd2d51e20f83883438ed7e4b86cad0e75ac9c018dd/py2app-0.5.2-py3.2.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "d406f75c965410d926b1b9c008096cae", "sha256": "5526578d5acef48319dc43b2adc9151e3af9ec220d7d27c4268e71ca4e41dd6c"}, "downloads": -1, "filename": "py2app-0.5.2.tar.gz", "has_sig": false, "md5_digest": "d406f75c965410d926b1b9c008096cae", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 494844, "upload_time": "2010-07-29T08:31:10", "upload_time_iso_8601": "2010-07-29T08:31:10.493049Z", "url": "https://files.pythonhosted.org/packages/e1/df/f3af142c35472fc8d0bb5dd8d69865f66b7a95cbdf656631c830647064bf/py2app-0.5.2.tar.gz", "yanked": false}], "0.6": [{"comment_text": "", "digests": {"md5": "bc0560b4b4549739c3d65ea5af449971", "sha256": "53f12ae27dda5404b846228f65c94d409867ce2085cbf972ad204af0cff3d7f5"}, "downloads": -1, "filename": "py2app-0.6.tar.gz", "has_sig": false, "md5_digest": "bc0560b4b4549739c3d65ea5af449971", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5507833, "upload_time": "2011-03-29T08:22:48", "upload_time_iso_8601": "2011-03-29T08:22:48.456580Z", "url": "https://files.pythonhosted.org/packages/03/49/d54b90f41d33e962b50e3d44cb4539109950fef8087a3097842ccf52c93e/py2app-0.6.tar.gz", "yanked": false}], "0.6.1": [{"comment_text": "", "digests": {"md5": "c60eee8f519c93070329de9adeeb14d6", "sha256": "769ebec7f99a7da7a1864f5a688b01166dd59b67df7d1fad7ec56a12c8c25bce"}, "downloads": -1, "filename": "py2app-0.6.1.tar.gz", "has_sig": false, "md5_digest": "c60eee8f519c93070329de9adeeb14d6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 783407, "upload_time": "2011-03-31T10:18:25", "upload_time_iso_8601": "2011-03-31T10:18:25.816135Z", "url": "https://files.pythonhosted.org/packages/9a/55/023e471c45dba7c1e3a724db38ffef44bdfd9c36e2802250d6e9a7198250/py2app-0.6.1.tar.gz", "yanked": false}], "0.6.2": [{"comment_text": "", "digests": {"md5": "0a23beb50dab2e3411d5945da6c85c1e", "sha256": "f6a195a034ff08bed9e51116ec06b91a74878c17c27093cc0fc896d02d6076b3"}, "downloads": -1, "filename": "py2app-0.6.2.tar.gz", "has_sig": false, "md5_digest": "0a23beb50dab2e3411d5945da6c85c1e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5368501, "upload_time": "2011-04-17T18:09:20", "upload_time_iso_8601": "2011-04-17T18:09:20.315454Z", "url": "https://files.pythonhosted.org/packages/4d/4a/a026038d11f3ce546e855a3688964a0d8dea96d2db622e42602cb88164e7/py2app-0.6.2.tar.gz", "yanked": false}], "0.6.3": [{"comment_text": "", "digests": {"md5": "49a9101ff25fb59d1ba733e329bf502e", "sha256": "eebd18ed35717c15430860f7e93674415fc753fa12b3727451b4c6c693950043"}, "downloads": -1, "filename": "py2app-0.6.3.tar.gz", "has_sig": false, "md5_digest": "49a9101ff25fb59d1ba733e329bf502e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5374634, "upload_time": "2011-04-25T13:12:01", "upload_time_iso_8601": "2011-04-25T13:12:01.768278Z", "url": "https://files.pythonhosted.org/packages/e2/59/fa6b24b82b65bda220426a07e5abf86d3767fae4c04ff1117380729c2c39/py2app-0.6.3.tar.gz", "yanked": false}], "0.6.4": [{"comment_text": "", "digests": {"md5": "40e7f788e897567ba2ad2855e43ac127", "sha256": "b42a3d7392c1c716e2ddd8f20f5f200a96415d1badbc981edfffc4971f70c3d9"}, "downloads": -1, "filename": "py2app-0.6.4.tar.gz", "has_sig": false, "md5_digest": "40e7f788e897567ba2ad2855e43ac127", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5399052, "upload_time": "2011-12-06T17:02:18", "upload_time_iso_8601": "2011-12-06T17:02:18.111104Z", "url": "https://files.pythonhosted.org/packages/18/86/19d9d0b131226f150d4457effbb778c33379ae8b7d0eced9ae95bc0052a8/py2app-0.6.4.tar.gz", "yanked": false}], "0.7": [{"comment_text": "", "digests": {"md5": "b7fa2eb0019296be0c3f2070fc4af4cb", "sha256": "a137478d5dade393a1d474b5d0db87bba50ced11c640d4f2e654f75cf0853f29"}, "downloads": -1, "filename": "py2app-0.7.tar.gz", "has_sig": false, "md5_digest": "b7fa2eb0019296be0c3f2070fc4af4cb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1159569, "upload_time": "2012-10-22T12:22:32", "upload_time_iso_8601": "2012-10-22T12:22:32.079869Z", "url": "https://files.pythonhosted.org/packages/7d/a6/4f2ff6967827ba5fc7eb24d5167a21e16559516f7f4b1180ac8590b055fc/py2app-0.7.tar.gz", "yanked": false}], "0.7.1": [{"comment_text": "", "digests": {"md5": "3d4c270a5e12c6ec0cb9a95a24a9eafb", "sha256": "09f670fb971541a0b328489f44779c509ecaf2c64cbba65bd21c23c08ef25a6d"}, "downloads": -1, "filename": "py2app-0.7.1.tar.gz", "has_sig": false, "md5_digest": "3d4c270a5e12c6ec0cb9a95a24a9eafb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1163638, "upload_time": "2012-10-29T08:39:18", "upload_time_iso_8601": "2012-10-29T08:39:18.766730Z", "url": "https://files.pythonhosted.org/packages/cd/ee/bc560c28cde26e6fa97196f2bc0f332f82e757ed532908ec445a29fa88d1/py2app-0.7.1.tar.gz", "yanked": false}], "0.7.2": [{"comment_text": "", "digests": {"md5": "a5d152cc19d848ec5543955cd39d5795", "sha256": "ea8c7b3cdb95362e92845d3b6f0c677d581d91941e19ae5483b40ea1dd310567"}, "downloads": -1, "filename": "py2app-0.7.2.tar.gz", "has_sig": false, "md5_digest": "a5d152cc19d848ec5543955cd39d5795", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1182797, "upload_time": "2012-12-05T11:51:31", "upload_time_iso_8601": "2012-12-05T11:51:31.562567Z", "url": "https://files.pythonhosted.org/packages/7f/d7/fe5cff4432da18b626a480e0e382a12ff16f41660c868038fffbf4c0164a/py2app-0.7.2.tar.gz", "yanked": false}], "0.7.3": [{"comment_text": "", "digests": {"md5": "fad705e63d335c570fde3bee48129730", "sha256": "01f188158852cc9284a9a22a18c49c3f181a5c0ececbc7fb38bdadfddbed5339"}, "downloads": -1, "filename": "py2app-0.7.3.tar.gz", "has_sig": false, "md5_digest": "fad705e63d335c570fde3bee48129730", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1190397, "upload_time": "2013-02-04T09:51:46", "upload_time_iso_8601": "2013-02-04T09:51:46.350782Z", "url": "https://files.pythonhosted.org/packages/69/37/96be6fba838ef465c48ad701c9243ba9a61b09307c8b463e984fa40d9fee/py2app-0.7.3.tar.gz", "yanked": false}], "0.8": [{"comment_text": "", "digests": {"md5": "b72b65c5a0b86b569963e7372aa9ba43", "sha256": "8caa118a728c33f5456f7c34a53da7714674aadbd2fd15182a488656e8c5cf0a"}, "downloads": -1, "filename": "py2app-0.8.tar.gz", "has_sig": false, "md5_digest": "b72b65c5a0b86b569963e7372aa9ba43", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1542446, "upload_time": "2014-02-06T11:46:15", "upload_time_iso_8601": "2014-02-06T11:46:15.544779Z", "url": "https://files.pythonhosted.org/packages/23/4f/f7f8db19b046221ede7d11ba6a4b01d93cb30b8329d4d05112bd202f34dd/py2app-0.8.tar.gz", "yanked": false}], "0.8.1": [{"comment_text": "", "digests": {"md5": "89a0092c1e6d9262deaa171fc5f1671d", "sha256": "eeeefcaeef33d5635fef73eea9a819e497b35229020a54eeb5ef81d0a9e14b09"}, "downloads": -1, "filename": "py2app-0.8.1.tar.gz", "has_sig": false, "md5_digest": "89a0092c1e6d9262deaa171fc5f1671d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1565011, "upload_time": "2014-05-30T10:52:21", "upload_time_iso_8601": "2014-05-30T10:52:21.435919Z", "url": "https://files.pythonhosted.org/packages/ea/dd/af0813b8b308284be0146b382c569d91f4b249f913c331c0a871296fd442/py2app-0.8.1.tar.gz", "yanked": false}], "0.9": [{"comment_text": "", "digests": {"md5": "eb31f5fefcf80aeaf4d02ec68d5978b4", "sha256": "7922672f9e99b50ed931780d43405ac134988b1532dd0659ef130b824f88c59d"}, "downloads": -1, "filename": "py2app-0.9.tar.gz", "has_sig": false, "md5_digest": "eb31f5fefcf80aeaf4d02ec68d5978b4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1665337, "upload_time": "2014-07-27T08:37:05", "upload_time_iso_8601": "2014-07-27T08:37:05.504413Z", "url": "https://files.pythonhosted.org/packages/9e/e9/c834ca0467781ca54097aaea6756f6a8c156a00818a7dd00d534fe439a2c/py2app-0.9.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "1abdd6fc8a5ddd11536ca028dcac2600", "sha256": "1ce4ffeaa6d34d6a47276b95329fd7469f92b6363213af44a064867c3f0a264e"}, "downloads": -1, "filename": "py2app-0.21-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "1abdd6fc8a5ddd11536ca028dcac2600", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": null, "size": 603619, "upload_time": "2020-02-11T09:04:29", "upload_time_iso_8601": "2020-02-11T09:04:29.037808Z", "url": "https://files.pythonhosted.org/packages/e1/6c/21439508b39e2789ca5a8980e625cbdd0df2655840dfd7e0be203833d922/py2app-0.21-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "04ccf26a12908d89e32bfba1b996144a", "sha256": "4516dfb01a0bf560ca4918e1e0e38eb4fcc76c9c2f527456e022310a80d52dc8"}, "downloads": -1, "filename": "py2app-0.21.tar.gz", "has_sig": false, "md5_digest": "04ccf26a12908d89e32bfba1b996144a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1029032, "upload_time": "2020-02-11T09:04:33", "upload_time_iso_8601": "2020-02-11T09:04:33.253955Z", "url": "https://files.pythonhosted.org/packages/50/59/915918ada9f2d892eb584ecd14b71f4f87b31ec6a26b5ac4102f4ac3f704/py2app-0.21.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:12:34 2020"}