{"info": {"author": "Michael Kowalchik", "author_email": "mikepk@tenzerolab.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Intended Audience :: Developers", "License :: OSI Approved :: BSD License", "Programming Language :: Python", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.6", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.2", "Programming Language :: Python :: 3.3", "Topic :: Internet :: WWW/HTTP", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "This is a fork of Ben Bangert's Routes project that includes some custom behaviors that are used by the pybald project. The main difference is that submappers don't automatically concatenate all keyword arguments together in submappers and only the 'prefix' style arguments are generative. All other arguments are allowed to be overridden in submappers (controlelrs, actions, etc...).\n\nRoutes is a Python re-implementation of the Rails routes system for mapping\nURL's to Controllers/Actions and generating URL's. Routes makes it easy to\ncreate pretty and concise URL's that are RESTful with little effort.\n\nSpeedy and dynamic URL generation means you get a URL with minimal cruft\n(no big dangling query args). Shortcut features like Named Routes cut down\non repetitive typing.\n\nSee `the documentation for installation and usage of Routes <http://readthedocs.org/docs/routes/en/latest/>`_.\n\n\n\nRoutes Changelog\n%%%%%%%%%%%%%%%%\n\nRelease 2.1 (March 8, 2014)\n============================\n* Fork release with submapper override behaviors for pybald\n\nRelease 2.0 (November 17, 2013)\n===============================\n* Python 3.2/3.3 Support. Fixes Issue #2. Thanks to Alejandro Sánchez for\n  the pull request!\n\nRelease 1.13 (March 12, 2012)\n=============================\n* Fix bug with dots forcing extension by default. The portion with the dot can\n  now be recognized. Patch by Michael Basnight.\n\nRelease 1.12.3 (June 5, 2010)\n=============================\n* Fix bug with URLGenerator not properly including SCRIPT_NAME when generating\n  URL's and the singleton is not present.\n\nRelease 1.12.2 (May 5, 2010)\n============================\n* Fix bug with routes URLGenerator not properly including SCRIPT_NAME when\n  generating qualified URL's.\n\nRelease 1.12.1 (March 11, 2010)\n===============================\n* Fix bug with routes not generating URL's with callables in defaults.\n* Fix bug with routes not handling sub-domain defaults during generation.\n\nRelease 1.12 (February 28, 2010)\n================================\n* Split up the Routes docs.\n* Fix bug with relative URL's using qualified merging host and URL without\n  including the appropriate slash. Fixes #13.\n* Fix bug with mapper.extend and Routes modifying their original args.\n  Fixes #24.\n* Fix url.current() not returning current args when explicit is True.\n* Added explicit way to directly use the Mapper to match with environ.\n* Fix bug with improper len placement for submapper.\n* Adding regular expression builder for entire regexp for faster rejection\n  in a single regexp match should none of the routes match.\n* Give Mapper a tabular string representation.\n* Make SubMapper objects nestable and add route-generation helpers.\n* Add SubMapper-based collections.\n* Make the deprecated Mapper.minimization False (disabled) by default.\n* Make the mapper explicit (true) by default.\n\nRelease 1.11 (September 28, 2009)\n=================================\n* Extensive documentation rewrite.\n* Added Mapper.extend function that allows one to add lists of Routes objects\n  to the mapper in one batch, optionally with a path_prefix.\n* Added Mapper.submapper function that returns a SubMapper object to enable\n  easier declaration of routes that have multiple keyword argument options\n  in common.\n* Mapper controller_scan argument now handles None, and lists of controller\n  names in addition to a callable.\n* Route object now takes a name parameter, which is the name it responds to.\n  This name is automatically added when called by using Mapper's connect\n  class method.\n* Added optional LRU object for use with Routes when URL's change too often\n  for the Routes urlcache dict to be a viable option.\n\nRelease 1.10.3 (February 8, 2009)\n=================================\n* Tweak to use WebOb Request rather than Paste.\n* Performance tweaks for URL recognition.\n* Bugfix for routes.middleware not re.escaping the path_info before moving it\n  to the script name.\n\nRelease 1.10.2 (January 11, 2009)\n=================================\n* Bugfix for unicode encoding problems with non-minimized Route generation.\n  Spotted by Wichert Akkerman.\n* Bugfix for when environ is {} in unit tests.\n\nRelease 1.10.1 (September 27, 2008)\n===================================\n* Removing LRU cache due to performance and threading issues. Cache does hit\n  a max-size for the given routes.\n\nRelease 1.10 (September 24, 2008)\n=================================\n* Adding LRU cache instead of just dict for caching generated routes. This\n  avoids slow memory leakage over long-running and non-existent route\n  generation.\n* Adding URLGenerator object.\n* Adding redirect routes.\n* Static routes can now interpolate variable parts in the path if using {}\n  variable part syntax.\n* Added sub_domain condition option to accept False or None, to require that\n  there be no sub-domain provided for the route to match.\n\nRelease 1.9.2 (July 8, 2008)\n============================\n* Fixed bug in url_for which caused it to return a literal when it shouldn't\n  have.\n\nRelease 1.9.1 (June 28, 2008)\n=============================\n* Fixed bug in formatted route recognition with formatting being absorbed\n  into the id.\n\nRelease 1.9 (June 12, 2008)\n===========================\n* Fix undefined arg bug in url_for.\n* Fixed bug with url_for not working properly outside of a request when\n  sub-domains are active. Thanks Pavel Skvazh.\n* Add non-minimization option to Routes and the Mapper for generation and\n  recognition.\n* Add Routes 2.0 style syntax for making routes and regexp. For example, this\n  route will now work: '{controller}/{action}/{id}'.\n* Fixed Routes to not use quote_plus when making URL's.\n* WARNING: Mapper now comes with hardcode_names set to True by default. This\n  means routes generated by name must work for the URL.\n* Actually respect having urlcache disabled.\n* WARNING: Calling url_for with a set of args that returns None now throws an\n  exception. Code that previously checked to see if a url could be made must\n  be updated accordingly.\n* Updated url_for to return url in a literal for use in templating that may\n  try to escape it again.\n* Added option to use X_FORWARDED_PROTO for proxying behind https to work\n  easier.\n* Fixed map.resource to be less restrictive on id than just spaces.\n* Fixed Mapper.create_regs not being thread safe, particularly when\n  always_scan=True.\n\nRelease 1.8 (March 28, 2008)\n============================\n* Fixed bug of map.resource not allowing spaces in id.\n* Fixed url generation to properly handle unicode defaults in addition to\n  unicode arguments.\n* Fixed url_for to handle lists as keyword args when generating query\n  parameters.\n* WARNING: Changed map.resource to not use ';', for actions, but the\n  normal '/'. This means that formatted URL's will also now have the format\n  come AFTER the action. Ie: /messsages/4.xml;rss -> /messages/4/rss.xml\n\nRelease 1.7.3 (May 28th, 2008)\n==============================\n* Fixed triple escaping bug, since WSGI servers are responsible for basic\n  unescaping.\n\nRelease 1.7.2 (Feb. 27th, 2008)\n===============================\n* Fixed bug with keyword args not being coerced to raw string properly.\n\nRelease 1.7.1 (Nov. 16th, 2007)\n===============================\n* Fixed bug with sub-domains from route defaults getting encoded to unicode\n  resulting in a unicode route which then caused url_for to throw an\n  exception.\n* Removed duplicate assignment in map.resource. Patch by Mike Naberezny.\n* Applied test patch fix for path checking. Thanks Mike Naberezny.\n* Added additional checking of remaining URL, to properly swallow periods in\n  the appropriate context. Fixes #57.\n* Added mapper.hardcode_names option which restricts url generation to the\n  named route during generation rather than using the routes default options\n  during generation.\n* Fixed the special '_method' attribute not being recognized during POST\n  requests of Content-Type 'multipart/form-data'.\n\nRelease 1.7 (June 8th, 2007)\n============================\n* Fixed url_unquoting to only apply for strings.\n* Added _encoding option to individual routes to toggle decoding/encoding on a\n  per route basis.\n* Fixed route matching so that '.' and other special chars are only part of the\n  match should they not be followed by that character. Fixed regexp creation so\n  that route parts with '.' in them aren't matched properly. Fixes #48.\n* Fixed Unicode decoding/encoding so that the URL decoding and encoding can be\n  set on the mapper with mapper.encoding. Fixes #40.\n* Don't assume environ['CONTENT_TYPE'] always exists: it may be omitted\n  according to the WSGI PEP.\n* Fixed Unicode decode/encoding of path_info dynamic/wildcard parts so that\n  PATH_INFO will stay a raw string as it should. Fixes #51.\n* Fixed url_for (thus redirect_to) to throw an exception if a Unicode\n  string is returned as that's an invalid URL. Fixes #46.\n* Fixed Routes middleware to only parse POST's if the content type is\n  application/x-www-form-urlencoded for a HTML form. This properly avoids\n  parsing wsgi.input when it doesn't need to be.\n\nRelease 1.6.3 (April 10th, 2007)\n================================\n* Fixed matching so that an attempt to match an empty path raises a\n  RouteException. Fixes #44.\n* Added ability to use characters in URL's such as '-' and '_' in\n  map.resource. Patch by Wyatt Baldwin. Fixes #45.\n* Updated Mapper.resource handling with name_prefix and path_prefix checking\n  to specify defaults. Also ensures that should either of them be set, they\n  override the prefixes should parent_resource be specified. Patch by Wyatt\n  Baldwin. Fixes #42.\n* Added utf-8 decoding of incoming path arguments, with fallback to ignoring\n  them in the very rare cases a malformed request URL is sent. Patch from\n  David Smith.\n* Fixed treatment of '#' character as something that can be left off and\n  used in route paths. Found by Mike Orr.\n* Added ability to specify parent resource to map.resource command. Patch from\n  Wyatt Baldwin.\n* Fixed formatted route issue with map.resource when additional collection\n  methods are specified. Added unit tests to verify the collection methods\n  work properly.\n* Updated URL parsing to properly use HTTP_HOST for hostname + port info before\n  falling back to SERVER_PORT and SERVER_NAME. Fixes #43.\n* Added member_name and collection_name setting to Route object when made with\n  map.resource.\n* Updated routes.middleware to make the Routes matched accessible as\n  environ['routes.route'].\n* Updating mapper object to use thread local for request data (such as\n  environ) and middleware now deletes environ references at the end of the\n  request.\n* Added explicit option to Routes and Mapper. Routes _explicit setting will\n  prevent the Route defaults from being implicitly set, while setting Mapper\n  to explicit will prevent Route implicit defaults and stop url_for from using\n  Route memory. Fixes #38.\n* Updated config object so that the route is attached if possible.\n* Adding standard logging usage with debug messages.\n* Added additional test for normal '.' match and fixed new special matching to\n  match it properly. Thanks David Smith.\n* Fixed hanging special char issue with 'special' URL chars at the end of a URL\n  that are missing the variable afterwards.\n* Changed Routes generation and recognition to handle other 'special' URL chars\n  , . and ; as if they were /. This lets them be optionally left out of the\n  resulting generated URL. Feature requested by David Smith.\n* Fixed lookahead assertion in regexp builder to properly handle two grouped\n  patterns in a row.\n* Applied patch to generation and matching to handle Unicode characters\n  properly. Reported with patch by David Smith.\n\nRelease 1.6.2 (Jan. 5, 2007)\n============================\n* Fixed issue with method checking not properly handling different letter\n  cases in REQUEST_METHOD. Reported by Sean Davis.\n* redirect_to now supports config.redirect returning a redirect, not just\n  raising one.\n\nRelease 1.6.1 (Dec. 29, 2006)\n=============================\n* Fixed zipsafe flag to be False.\n\nRelease 1.6 (Dec. 14th, 2006)\n=============================\n* Fixed append_slash to take effect in the route generation itself instead of\n  relying on url_for function. Reported by ToddG.\n* Added additional url_for tests to ensure map.resource generates proper named\n  routes.\n* WARNING: Changed map.resource initialization to accept individual member and\n  collection names to generate proper singular and plural route names. Those\n  using map.resource will need to update their routes and url_for statements\n  accordingly.\n* Added additional map.resource recognition tests.\n* Added WSGI middleware that does route resolving using new `WSGI.org Routing\n  Vars Spec <http://wsgi.org/wsgi/Specifications/routing_args>`_.\n* Added _absolute keyword option route connect to ignore SCRIPT_NAME settings.\n  Suggested by Ian Bicking.\n\nRelease 1.5.2 (Oct. 16th, 2006)\n===============================\n* Fixed qualified keyword to keep host port names when used, unless a host\n  is specifically passed in. Reported by Jon Rosebaugh.\n* Added qualified keyword option to url_for to have it generate a full\n  URL. Resolves #29.\n* Fixed examples in url_for doc strings so they'll be accurate.\n\nRelease 1.5.1 (Oct. 4th, 2006)\n==============================\n* Fixed bug with escaping part names in the regular expression, reported by\n  James Taylor.\n\nRelease 1.5 (Sept. 19th, 2006)\n==============================\n* Significant updates to map.resource and unit tests that comb it thoroughly\n  to ensure its creating all the proper routes (it now is). Increased unit\n  testing coverage to 95%.\n* Added unit tests to ensure controller_scan works properly with nested\n  controller files and appropriately scans the directory structure. This\n  brings the Routes util module up to full code coverage.\n* Fixed url_for so that when the protocol is changed, port information is\n  removed from the host.\n* Added more thorough testing to _RequestConfig object and the ability to\n  set your own object. This increases testing coverage of the __init__ module\n  to 100%.\n* Fixed bug with sub_domain not maintaining port information in url_for and\n  added unit tests. Reported by Jonathan Rosebaugh.\n* Added unit tests to ensure sub_domain option works with named routes, cleaned\n  up url_for memory argument filtering. Fixed bug with named routes and sub_domain\n  option not working together, reported by Jonathan Rosebaugh.\n* Changed order in which sub-domain is added to match-dict so it can be used\n  in a conditions function.\n\nRelease 1.4.1 (Sept. 6th, 2006)\n===============================\n* Added sub_domains option to mapper, along with sub_domains_ignore list for\n  subdomains that are considered equivilant to the main domain. When sub_domains\n  is active, url_for will now take a sub_domain option that can alter the host\n  the route will go to.\n* Added ability for filter functions to provide a _host, _protocol, _anchor arg\n  which is then used to create the URL with the appropriate host/protocol/anchor\n  destination.\n* Patch applied from Ticket #28. Resolves issue with Mapper's controller_scan\n  function requiring a valid directory argument. Submitted by Zoran Isailovski.\n\nRelease 1.4 (July 21, 2006)\n===========================\n* Fixed bug with map.resource related to member methods, found in Rails version.\n* Fixed bug with map.resource member methods not requiring a member id.\n* Fixed bug related to handling keyword argument controller.\n* Added map.resource command which can automatically generate a batch of routes intended\n  to be used in a REST-ful manner by a web framework.\n* Added URL generation handling for a 'method' argument. If 'method' is specified, it\n  is not dropped and will be changed to '_method' for use by the framework.\n* Added conditions option to map.connect. Accepts a dict with optional keyword args\n  'method' or 'function'. Method is a list of HTTP methods that are valid for the route.\n  Function is a function that will be called with environ, matchdict where matchdict is\n  the dict created by the URL match.\n* Fixed redirect_to function for using absolute URL's. redirect_to now passes all args to\n  url_for, then passes the resulting URL to the redirect function. Reported by climbus.\n\nRelease 1.3.2 (April 30th, 2006)\n================================\n* Fixed _filter bug with inclusion in match dict during matching, reported by David Creemer.\n* Fixed improper url quoting by using urllib.encode, patch by Jason Culverhouse.\n\nRelease 1.3.1 (April 4th, 2006)\n===============================\n* Mapper has an optional attribute ``append_slash``. When set to ``True``, any URL's\n  generated will have a slash appended to the end.\n* Fixed prefix option so that if the PATH_INFO is empty after prefix regexp, its set to\n  '/' so the match proceeds ok.\n* Fixed prefix bug that caused routes after the initial one to not see the proper url\n  for matching. Caught by Jochen Kupperschmidt.\n\nRelease 1.3 (Feb. 25th, 2006)\n=============================\n* url_for keyword filters:\n  Named routes can now have a _filter argument that should specify a function that takes\n  a dict as its sole argument. The dict will contain the full set of keywords passed to\n  url_for, which the function can then modify as it pleases. The new dict will then be\n  used as if it was the original set of keyword args given to url_for.\n* Fixed Python 2.3 incompatibility due to using keyword arg for a sort statement\n  when using the built-in controller scanner.\n\nRelease 1.2 (Feb. 17th, 2006)\n=============================\n* If a named route doesn't exist, and a url_for call is used, instead of using the\n  keyword arguments to generate a URL, they will be used as query args for the raw\n  URL supplied. (Backwards Incompatible)\n* If Mapper has debug=True, using match will return two additional values, the route\n  that matched, if one did match. And a list of routes that were tried, and information\n  about why they didn't pass.\n* url_for enhancements:\n  Can now be used with 'raw' URL's to generate proper url's for static content that\n  will then automatically include SCRIPT_NAME if necessary\n  Static named routes can now be used to shortcut common path information as desired.\n* Controller Scanner will now sort controller names so that the longest one is first. This\n  ensures that the deepest nested controller is executed first before more shallow ones to\n  increase predictability.\n* Controller Scanner now scans directories properly, the version in 1.1 left off the\n  directory prefix when created the list of controllers.\n  (Thanks to Justin for drawing my attention to it)\n\nRelease 1.1 (Jan. 13th, 2006)\n=============================\n* Routes Mapper additions:\n  Now takes several optional arguments that determine how it will\n  generate the regexp's.\n  Can now hold a function for use when determining what the available\n  controllers are. Comes with a default directory scanner\n  Given a directory for the default scanner or a function, the Mapper\n  will now automatically run it to get the controller list when needed\n* Syntax available for splitting routes to allow more complex route paths, such\n  as ':controller/:(action)-:(id).html'\n* Easier setup/integration with Routes per request. Setting the environ in a\n  WSGI environ will run match, and setup everything needed for url_for/etc.\n\nRelease 1.0.2 (Dec. 30th, 2005)\n===============================\n* Routes where a default was present but None were filling in improper values.\n* Passing a 0 would evaluate to None during generation, resulting in missing\n  URL parts\n\nRelease 1.0.1 (Dec. 18th, 2005)\n===============================\n* Request Local Callable - You can now designate your own callable function that\n  should then be used to store the request_config data. This is most useful for\n  environments where its possible multiple requests might be running in a single\n  thread. The callable should return a request specific object for attributes to\n  be attached. See routes.__init__.py for more information.\n\nRelease 1.0 (Nov. 21st, 2005)\n=============================\n* routes.__init__ will now load the common symbols most people will\n  want to actually use.\n  Thus, you can either::\n\n       from routes import *\n\n  Or::\n\n       from routes import request_confg, Mapper\n\n  The following names are available for importing from routes::\n\n      request_config, Mapper, url_for, redirect_to\n\n* Route Names - You can now name a route, which will save a copy of the defaults\n  defined for later use by url_for or redirect_to.\n  Thus, a route and url_for looking like this::\n\n       m.connect('home', controller='blog', action='splash')\n       url_for(controller='blog', action='splash')   # => /home\n\n  Can now be used with a name::\n\n       m.connect('home_url','home', controller='blog', action='splash')\n       url_for('home_url')  # => /home\n\n  Additional keywords can still be added to url_for and will override defaults in\n  the named route.\n* Trailing / - Route recognition earlier failed on trailing slashes, not really a bug,\n  not really a feature I guess. Anyways, trailing slashes are o.k. now as in the Rails\n  version.\n* redirect_to now has two sets of tests to ensure it works properly", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/mikepk/routes", "keywords": "pybald routes webob dispatch", "license": "MIT", "maintainer": null, "maintainer_email": null, "name": "pybald-routes", "package_url": "https://pypi.org/project/pybald-routes/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/pybald-routes/", "project_urls": {"Download": "UNKNOWN", "Homepage": "https://github.com/mikepk/routes"}, "release_url": "https://pypi.org/project/pybald-routes/2.11/", "requires_dist": null, "requires_python": null, "summary": "Routing Recognition and Generation Tools", "version": "2.11", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>This is a fork of Ben Bangert’s Routes project that includes some custom behaviors that are used by the pybald project. The main difference is that submappers don’t automatically concatenate all keyword arguments together in submappers and only the ‘prefix’ style arguments are generative. All other arguments are allowed to be overridden in submappers (controlelrs, actions, etc…).</p>\n<p>Routes is a Python re-implementation of the Rails routes system for mapping\nURL’s to Controllers/Actions and generating URL’s. Routes makes it easy to\ncreate pretty and concise URL’s that are RESTful with little effort.</p>\n<p>Speedy and dynamic URL generation means you get a URL with minimal cruft\n(no big dangling query args). Shortcut features like Named Routes cut down\non repetitive typing.</p>\n<p>See <a href=\"http://readthedocs.org/docs/routes/en/latest/\" rel=\"nofollow\">the documentation for installation and usage of Routes</a>.</p>\n<div id=\"routes-changelog\">\n<h2>Routes Changelog</h2>\n<div id=\"release-2-1-march-8-2014\">\n<h3>Release 2.1 (March 8, 2014)</h3>\n<ul>\n<li>Fork release with submapper override behaviors for pybald</li>\n</ul>\n</div>\n<div id=\"release-2-0-november-17-2013\">\n<h3>Release 2.0 (November 17, 2013)</h3>\n<ul>\n<li>Python 3.2/3.3 Support. Fixes Issue #2. Thanks to Alejandro Sánchez for\nthe pull request!</li>\n</ul>\n</div>\n<div id=\"release-1-13-march-12-2012\">\n<h3>Release 1.13 (March 12, 2012)</h3>\n<ul>\n<li>Fix bug with dots forcing extension by default. The portion with the dot can\nnow be recognized. Patch by Michael Basnight.</li>\n</ul>\n</div>\n<div id=\"release-1-12-3-june-5-2010\">\n<h3>Release 1.12.3 (June 5, 2010)</h3>\n<ul>\n<li>Fix bug with URLGenerator not properly including SCRIPT_NAME when generating\nURL’s and the singleton is not present.</li>\n</ul>\n</div>\n<div id=\"release-1-12-2-may-5-2010\">\n<h3>Release 1.12.2 (May 5, 2010)</h3>\n<ul>\n<li>Fix bug with routes URLGenerator not properly including SCRIPT_NAME when\ngenerating qualified URL’s.</li>\n</ul>\n</div>\n<div id=\"release-1-12-1-march-11-2010\">\n<h3>Release 1.12.1 (March 11, 2010)</h3>\n<ul>\n<li>Fix bug with routes not generating URL’s with callables in defaults.</li>\n<li>Fix bug with routes not handling sub-domain defaults during generation.</li>\n</ul>\n</div>\n<div id=\"release-1-12-february-28-2010\">\n<h3>Release 1.12 (February 28, 2010)</h3>\n<ul>\n<li>Split up the Routes docs.</li>\n<li>Fix bug with relative URL’s using qualified merging host and URL without\nincluding the appropriate slash. Fixes #13.</li>\n<li>Fix bug with mapper.extend and Routes modifying their original args.\nFixes #24.</li>\n<li>Fix url.current() not returning current args when explicit is True.</li>\n<li>Added explicit way to directly use the Mapper to match with environ.</li>\n<li>Fix bug with improper len placement for submapper.</li>\n<li>Adding regular expression builder for entire regexp for faster rejection\nin a single regexp match should none of the routes match.</li>\n<li>Give Mapper a tabular string representation.</li>\n<li>Make SubMapper objects nestable and add route-generation helpers.</li>\n<li>Add SubMapper-based collections.</li>\n<li>Make the deprecated Mapper.minimization False (disabled) by default.</li>\n<li>Make the mapper explicit (true) by default.</li>\n</ul>\n</div>\n<div id=\"release-1-11-september-28-2009\">\n<h3>Release 1.11 (September 28, 2009)</h3>\n<ul>\n<li>Extensive documentation rewrite.</li>\n<li>Added Mapper.extend function that allows one to add lists of Routes objects\nto the mapper in one batch, optionally with a path_prefix.</li>\n<li>Added Mapper.submapper function that returns a SubMapper object to enable\neasier declaration of routes that have multiple keyword argument options\nin common.</li>\n<li>Mapper controller_scan argument now handles None, and lists of controller\nnames in addition to a callable.</li>\n<li>Route object now takes a name parameter, which is the name it responds to.\nThis name is automatically added when called by using Mapper’s connect\nclass method.</li>\n<li>Added optional LRU object for use with Routes when URL’s change too often\nfor the Routes urlcache dict to be a viable option.</li>\n</ul>\n</div>\n<div id=\"release-1-10-3-february-8-2009\">\n<h3>Release 1.10.3 (February 8, 2009)</h3>\n<ul>\n<li>Tweak to use WebOb Request rather than Paste.</li>\n<li>Performance tweaks for URL recognition.</li>\n<li>Bugfix for routes.middleware not re.escaping the path_info before moving it\nto the script name.</li>\n</ul>\n</div>\n<div id=\"release-1-10-2-january-11-2009\">\n<h3>Release 1.10.2 (January 11, 2009)</h3>\n<ul>\n<li>Bugfix for unicode encoding problems with non-minimized Route generation.\nSpotted by Wichert Akkerman.</li>\n<li>Bugfix for when environ is {} in unit tests.</li>\n</ul>\n</div>\n<div id=\"release-1-10-1-september-27-2008\">\n<h3>Release 1.10.1 (September 27, 2008)</h3>\n<ul>\n<li>Removing LRU cache due to performance and threading issues. Cache does hit\na max-size for the given routes.</li>\n</ul>\n</div>\n<div id=\"release-1-10-september-24-2008\">\n<h3>Release 1.10 (September 24, 2008)</h3>\n<ul>\n<li>Adding LRU cache instead of just dict for caching generated routes. This\navoids slow memory leakage over long-running and non-existent route\ngeneration.</li>\n<li>Adding URLGenerator object.</li>\n<li>Adding redirect routes.</li>\n<li>Static routes can now interpolate variable parts in the path if using {}\nvariable part syntax.</li>\n<li>Added sub_domain condition option to accept False or None, to require that\nthere be no sub-domain provided for the route to match.</li>\n</ul>\n</div>\n<div id=\"release-1-9-2-july-8-2008\">\n<h3>Release 1.9.2 (July 8, 2008)</h3>\n<ul>\n<li>Fixed bug in url_for which caused it to return a literal when it shouldn’t\nhave.</li>\n</ul>\n</div>\n<div id=\"release-1-9-1-june-28-2008\">\n<h3>Release 1.9.1 (June 28, 2008)</h3>\n<ul>\n<li>Fixed bug in formatted route recognition with formatting being absorbed\ninto the id.</li>\n</ul>\n</div>\n<div id=\"release-1-9-june-12-2008\">\n<h3>Release 1.9 (June 12, 2008)</h3>\n<ul>\n<li>Fix undefined arg bug in url_for.</li>\n<li>Fixed bug with url_for not working properly outside of a request when\nsub-domains are active. Thanks Pavel Skvazh.</li>\n<li>Add non-minimization option to Routes and the Mapper for generation and\nrecognition.</li>\n<li>Add Routes 2.0 style syntax for making routes and regexp. For example, this\nroute will now work: ‘{controller}/{action}/{id}’.</li>\n<li>Fixed Routes to not use quote_plus when making URL’s.</li>\n<li>WARNING: Mapper now comes with hardcode_names set to True by default. This\nmeans routes generated by name must work for the URL.</li>\n<li>Actually respect having urlcache disabled.</li>\n<li>WARNING: Calling url_for with a set of args that returns None now throws an\nexception. Code that previously checked to see if a url could be made must\nbe updated accordingly.</li>\n<li>Updated url_for to return url in a literal for use in templating that may\ntry to escape it again.</li>\n<li>Added option to use X_FORWARDED_PROTO for proxying behind https to work\neasier.</li>\n<li>Fixed map.resource to be less restrictive on id than just spaces.</li>\n<li>Fixed Mapper.create_regs not being thread safe, particularly when\nalways_scan=True.</li>\n</ul>\n</div>\n<div id=\"release-1-8-march-28-2008\">\n<h3>Release 1.8 (March 28, 2008)</h3>\n<ul>\n<li>Fixed bug of map.resource not allowing spaces in id.</li>\n<li>Fixed url generation to properly handle unicode defaults in addition to\nunicode arguments.</li>\n<li>Fixed url_for to handle lists as keyword args when generating query\nparameters.</li>\n<li>WARNING: Changed map.resource to not use ‘;’, for actions, but the\nnormal ‘/’. This means that formatted URL’s will also now have the format\ncome AFTER the action. Ie: /messsages/4.xml;rss -&gt; /messages/4/rss.xml</li>\n</ul>\n</div>\n<div id=\"release-1-7-3-may-28th-2008\">\n<h3>Release 1.7.3 (May 28th, 2008)</h3>\n<ul>\n<li>Fixed triple escaping bug, since WSGI servers are responsible for basic\nunescaping.</li>\n</ul>\n</div>\n<div id=\"release-1-7-2-feb-27th-2008\">\n<h3>Release 1.7.2 (Feb. 27th, 2008)</h3>\n<ul>\n<li>Fixed bug with keyword args not being coerced to raw string properly.</li>\n</ul>\n</div>\n<div id=\"release-1-7-1-nov-16th-2007\">\n<h3>Release 1.7.1 (Nov. 16th, 2007)</h3>\n<ul>\n<li>Fixed bug with sub-domains from route defaults getting encoded to unicode\nresulting in a unicode route which then caused url_for to throw an\nexception.</li>\n<li>Removed duplicate assignment in map.resource. Patch by Mike Naberezny.</li>\n<li>Applied test patch fix for path checking. Thanks Mike Naberezny.</li>\n<li>Added additional checking of remaining URL, to properly swallow periods in\nthe appropriate context. Fixes #57.</li>\n<li>Added mapper.hardcode_names option which restricts url generation to the\nnamed route during generation rather than using the routes default options\nduring generation.</li>\n<li>Fixed the special ‘_method’ attribute not being recognized during POST\nrequests of Content-Type ‘multipart/form-data’.</li>\n</ul>\n</div>\n<div id=\"release-1-7-june-8th-2007\">\n<h3>Release 1.7 (June 8th, 2007)</h3>\n<ul>\n<li>Fixed url_unquoting to only apply for strings.</li>\n<li>Added _encoding option to individual routes to toggle decoding/encoding on a\nper route basis.</li>\n<li>Fixed route matching so that ‘.’ and other special chars are only part of the\nmatch should they not be followed by that character. Fixed regexp creation so\nthat route parts with ‘.’ in them aren’t matched properly. Fixes #48.</li>\n<li>Fixed Unicode decoding/encoding so that the URL decoding and encoding can be\nset on the mapper with mapper.encoding. Fixes #40.</li>\n<li>Don’t assume environ[‘CONTENT_TYPE’] always exists: it may be omitted\naccording to the WSGI PEP.</li>\n<li>Fixed Unicode decode/encoding of path_info dynamic/wildcard parts so that\nPATH_INFO will stay a raw string as it should. Fixes #51.</li>\n<li>Fixed url_for (thus redirect_to) to throw an exception if a Unicode\nstring is returned as that’s an invalid URL. Fixes #46.</li>\n<li>Fixed Routes middleware to only parse POST’s if the content type is\napplication/x-www-form-urlencoded for a HTML form. This properly avoids\nparsing wsgi.input when it doesn’t need to be.</li>\n</ul>\n</div>\n<div id=\"release-1-6-3-april-10th-2007\">\n<h3>Release 1.6.3 (April 10th, 2007)</h3>\n<ul>\n<li>Fixed matching so that an attempt to match an empty path raises a\nRouteException. Fixes #44.</li>\n<li>Added ability to use characters in URL’s such as ‘-‘ and ‘_’ in\nmap.resource. Patch by Wyatt Baldwin. Fixes #45.</li>\n<li>Updated Mapper.resource handling with name_prefix and path_prefix checking\nto specify defaults. Also ensures that should either of them be set, they\noverride the prefixes should parent_resource be specified. Patch by Wyatt\nBaldwin. Fixes #42.</li>\n<li>Added utf-8 decoding of incoming path arguments, with fallback to ignoring\nthem in the very rare cases a malformed request URL is sent. Patch from\nDavid Smith.</li>\n<li>Fixed treatment of ‘#’ character as something that can be left off and\nused in route paths. Found by Mike Orr.</li>\n<li>Added ability to specify parent resource to map.resource command. Patch from\nWyatt Baldwin.</li>\n<li>Fixed formatted route issue with map.resource when additional collection\nmethods are specified. Added unit tests to verify the collection methods\nwork properly.</li>\n<li>Updated URL parsing to properly use HTTP_HOST for hostname + port info before\nfalling back to SERVER_PORT and SERVER_NAME. Fixes #43.</li>\n<li>Added member_name and collection_name setting to Route object when made with\nmap.resource.</li>\n<li>Updated routes.middleware to make the Routes matched accessible as\nenviron[‘routes.route’].</li>\n<li>Updating mapper object to use thread local for request data (such as\nenviron) and middleware now deletes environ references at the end of the\nrequest.</li>\n<li>Added explicit option to Routes and Mapper. Routes _explicit setting will\nprevent the Route defaults from being implicitly set, while setting Mapper\nto explicit will prevent Route implicit defaults and stop url_for from using\nRoute memory. Fixes #38.</li>\n<li>Updated config object so that the route is attached if possible.</li>\n<li>Adding standard logging usage with debug messages.</li>\n<li>Added additional test for normal ‘.’ match and fixed new special matching to\nmatch it properly. Thanks David Smith.</li>\n<li>Fixed hanging special char issue with ‘special’ URL chars at the end of a URL\nthat are missing the variable afterwards.</li>\n<li>Changed Routes generation and recognition to handle other ‘special’ URL chars\n, . and ; as if they were /. This lets them be optionally left out of the\nresulting generated URL. Feature requested by David Smith.</li>\n<li>Fixed lookahead assertion in regexp builder to properly handle two grouped\npatterns in a row.</li>\n<li>Applied patch to generation and matching to handle Unicode characters\nproperly. Reported with patch by David Smith.</li>\n</ul>\n</div>\n<div id=\"release-1-6-2-jan-5-2007\">\n<h3>Release 1.6.2 (Jan. 5, 2007)</h3>\n<ul>\n<li>Fixed issue with method checking not properly handling different letter\ncases in REQUEST_METHOD. Reported by Sean Davis.</li>\n<li>redirect_to now supports config.redirect returning a redirect, not just\nraising one.</li>\n</ul>\n</div>\n<div id=\"release-1-6-1-dec-29-2006\">\n<h3>Release 1.6.1 (Dec. 29, 2006)</h3>\n<ul>\n<li>Fixed zipsafe flag to be False.</li>\n</ul>\n</div>\n<div id=\"release-1-6-dec-14th-2006\">\n<h3>Release 1.6 (Dec. 14th, 2006)</h3>\n<ul>\n<li>Fixed append_slash to take effect in the route generation itself instead of\nrelying on url_for function. Reported by ToddG.</li>\n<li>Added additional url_for tests to ensure map.resource generates proper named\nroutes.</li>\n<li>WARNING: Changed map.resource initialization to accept individual member and\ncollection names to generate proper singular and plural route names. Those\nusing map.resource will need to update their routes and url_for statements\naccordingly.</li>\n<li>Added additional map.resource recognition tests.</li>\n<li>Added WSGI middleware that does route resolving using new <a href=\"http://wsgi.org/wsgi/Specifications/routing_args\" rel=\"nofollow\">WSGI.org Routing\nVars Spec</a>.</li>\n<li>Added _absolute keyword option route connect to ignore SCRIPT_NAME settings.\nSuggested by Ian Bicking.</li>\n</ul>\n</div>\n<div id=\"release-1-5-2-oct-16th-2006\">\n<h3>Release 1.5.2 (Oct. 16th, 2006)</h3>\n<ul>\n<li>Fixed qualified keyword to keep host port names when used, unless a host\nis specifically passed in. Reported by Jon Rosebaugh.</li>\n<li>Added qualified keyword option to url_for to have it generate a full\nURL. Resolves #29.</li>\n<li>Fixed examples in url_for doc strings so they’ll be accurate.</li>\n</ul>\n</div>\n<div id=\"release-1-5-1-oct-4th-2006\">\n<h3>Release 1.5.1 (Oct. 4th, 2006)</h3>\n<ul>\n<li>Fixed bug with escaping part names in the regular expression, reported by\nJames Taylor.</li>\n</ul>\n</div>\n<div id=\"release-1-5-sept-19th-2006\">\n<h3>Release 1.5 (Sept. 19th, 2006)</h3>\n<ul>\n<li>Significant updates to map.resource and unit tests that comb it thoroughly\nto ensure its creating all the proper routes (it now is). Increased unit\ntesting coverage to 95%.</li>\n<li>Added unit tests to ensure controller_scan works properly with nested\ncontroller files and appropriately scans the directory structure. This\nbrings the Routes util module up to full code coverage.</li>\n<li>Fixed url_for so that when the protocol is changed, port information is\nremoved from the host.</li>\n<li>Added more thorough testing to _RequestConfig object and the ability to\nset your own object. This increases testing coverage of the __init__ module\nto 100%.</li>\n<li>Fixed bug with sub_domain not maintaining port information in url_for and\nadded unit tests. Reported by Jonathan Rosebaugh.</li>\n<li>Added unit tests to ensure sub_domain option works with named routes, cleaned\nup url_for memory argument filtering. Fixed bug with named routes and sub_domain\noption not working together, reported by Jonathan Rosebaugh.</li>\n<li>Changed order in which sub-domain is added to match-dict so it can be used\nin a conditions function.</li>\n</ul>\n</div>\n<div id=\"release-1-4-1-sept-6th-2006\">\n<h3>Release 1.4.1 (Sept. 6th, 2006)</h3>\n<ul>\n<li>Added sub_domains option to mapper, along with sub_domains_ignore list for\nsubdomains that are considered equivilant to the main domain. When sub_domains\nis active, url_for will now take a sub_domain option that can alter the host\nthe route will go to.</li>\n<li>Added ability for filter functions to provide a _host, _protocol, _anchor arg\nwhich is then used to create the URL with the appropriate host/protocol/anchor\ndestination.</li>\n<li>Patch applied from Ticket #28. Resolves issue with Mapper’s controller_scan\nfunction requiring a valid directory argument. Submitted by Zoran Isailovski.</li>\n</ul>\n</div>\n<div id=\"release-1-4-july-21-2006\">\n<h3>Release 1.4 (July 21, 2006)</h3>\n<ul>\n<li>Fixed bug with map.resource related to member methods, found in Rails version.</li>\n<li>Fixed bug with map.resource member methods not requiring a member id.</li>\n<li>Fixed bug related to handling keyword argument controller.</li>\n<li>Added map.resource command which can automatically generate a batch of routes intended\nto be used in a REST-ful manner by a web framework.</li>\n<li>Added URL generation handling for a ‘method’ argument. If ‘method’ is specified, it\nis not dropped and will be changed to ‘_method’ for use by the framework.</li>\n<li>Added conditions option to map.connect. Accepts a dict with optional keyword args\n‘method’ or ‘function’. Method is a list of HTTP methods that are valid for the route.\nFunction is a function that will be called with environ, matchdict where matchdict is\nthe dict created by the URL match.</li>\n<li>Fixed redirect_to function for using absolute URL’s. redirect_to now passes all args to\nurl_for, then passes the resulting URL to the redirect function. Reported by climbus.</li>\n</ul>\n</div>\n<div id=\"release-1-3-2-april-30th-2006\">\n<h3>Release 1.3.2 (April 30th, 2006)</h3>\n<ul>\n<li>Fixed _filter bug with inclusion in match dict during matching, reported by David Creemer.</li>\n<li>Fixed improper url quoting by using urllib.encode, patch by Jason Culverhouse.</li>\n</ul>\n</div>\n<div id=\"release-1-3-1-april-4th-2006\">\n<h3>Release 1.3.1 (April 4th, 2006)</h3>\n<ul>\n<li>Mapper has an optional attribute <tt>append_slash</tt>. When set to <tt>True</tt>, any URL’s\ngenerated will have a slash appended to the end.</li>\n<li>Fixed prefix option so that if the PATH_INFO is empty after prefix regexp, its set to\n‘/’ so the match proceeds ok.</li>\n<li>Fixed prefix bug that caused routes after the initial one to not see the proper url\nfor matching. Caught by Jochen Kupperschmidt.</li>\n</ul>\n</div>\n<div id=\"release-1-3-feb-25th-2006\">\n<h3>Release 1.3 (Feb. 25th, 2006)</h3>\n<ul>\n<li>url_for keyword filters:\nNamed routes can now have a _filter argument that should specify a function that takes\na dict as its sole argument. The dict will contain the full set of keywords passed to\nurl_for, which the function can then modify as it pleases. The new dict will then be\nused as if it was the original set of keyword args given to url_for.</li>\n<li>Fixed Python 2.3 incompatibility due to using keyword arg for a sort statement\nwhen using the built-in controller scanner.</li>\n</ul>\n</div>\n<div id=\"release-1-2-feb-17th-2006\">\n<h3>Release 1.2 (Feb. 17th, 2006)</h3>\n<ul>\n<li>If a named route doesn’t exist, and a url_for call is used, instead of using the\nkeyword arguments to generate a URL, they will be used as query args for the raw\nURL supplied. (Backwards Incompatible)</li>\n<li>If Mapper has debug=True, using match will return two additional values, the route\nthat matched, if one did match. And a list of routes that were tried, and information\nabout why they didn’t pass.</li>\n<li>url_for enhancements:\nCan now be used with ‘raw’ URL’s to generate proper url’s for static content that\nwill then automatically include SCRIPT_NAME if necessary\nStatic named routes can now be used to shortcut common path information as desired.</li>\n<li>Controller Scanner will now sort controller names so that the longest one is first. This\nensures that the deepest nested controller is executed first before more shallow ones to\nincrease predictability.</li>\n<li>Controller Scanner now scans directories properly, the version in 1.1 left off the\ndirectory prefix when created the list of controllers.\n(Thanks to Justin for drawing my attention to it)</li>\n</ul>\n</div>\n<div id=\"release-1-1-jan-13th-2006\">\n<h3>Release 1.1 (Jan. 13th, 2006)</h3>\n<ul>\n<li>Routes Mapper additions:\nNow takes several optional arguments that determine how it will\ngenerate the regexp’s.\nCan now hold a function for use when determining what the available\ncontrollers are. Comes with a default directory scanner\nGiven a directory for the default scanner or a function, the Mapper\nwill now automatically run it to get the controller list when needed</li>\n<li>Syntax available for splitting routes to allow more complex route paths, such\nas ‘:controller/:(action)-:(id).html’</li>\n<li>Easier setup/integration with Routes per request. Setting the environ in a\nWSGI environ will run match, and setup everything needed for url_for/etc.</li>\n</ul>\n</div>\n<div id=\"release-1-0-2-dec-30th-2005\">\n<h3>Release 1.0.2 (Dec. 30th, 2005)</h3>\n<ul>\n<li>Routes where a default was present but None were filling in improper values.</li>\n<li>Passing a 0 would evaluate to None during generation, resulting in missing\nURL parts</li>\n</ul>\n</div>\n<div id=\"release-1-0-1-dec-18th-2005\">\n<h3>Release 1.0.1 (Dec. 18th, 2005)</h3>\n<ul>\n<li>Request Local Callable - You can now designate your own callable function that\nshould then be used to store the request_config data. This is most useful for\nenvironments where its possible multiple requests might be running in a single\nthread. The callable should return a request specific object for attributes to\nbe attached. See routes.__init__.py for more information.</li>\n</ul>\n</div>\n<div id=\"release-1-0-nov-21st-2005\">\n<h3>Release 1.0 (Nov. 21st, 2005)</h3>\n<ul>\n<li><p>routes.__init__ will now load the common symbols most people will\nwant to actually use.\nThus, you can either:</p>\n<pre>from routes import *\n</pre>\n<p>Or:</p>\n<pre>from routes import request_confg, Mapper\n</pre>\n<p>The following names are available for importing from routes:</p>\n<pre>request_config, Mapper, url_for, redirect_to\n</pre>\n</li>\n<li><p>Route Names - You can now name a route, which will save a copy of the defaults\ndefined for later use by url_for or redirect_to.\nThus, a route and url_for looking like this:</p>\n<pre>m.connect('home', controller='blog', action='splash')\nurl_for(controller='blog', action='splash')   # =&gt; /home\n</pre>\n<p>Can now be used with a name:</p>\n<pre>m.connect('home_url','home', controller='blog', action='splash')\nurl_for('home_url')  # =&gt; /home\n</pre>\n<p>Additional keywords can still be added to url_for and will override defaults in\nthe named route.</p>\n</li>\n<li><p>Trailing / - Route recognition earlier failed on trailing slashes, not really a bug,\nnot really a feature I guess. Anyways, trailing slashes are o.k. now as in the Rails\nversion.</p>\n</li>\n<li><p>redirect_to now has two sets of tests to ensure it works properly</p>\n</li>\n</ul>\n</div>\n</div>\n\n          </div>"}, "last_serial": 1023419, "releases": {"2.1": [{"comment_text": "", "digests": {"md5": "3b758355e75e36dc740cfbaa67153a6a", "sha256": "0076479f2c4913e4d566fa4f6954c588f03e6557881ff3bf007a8ce55c622791"}, "downloads": -1, "filename": "pybald-routes-2.1.tar.gz", "has_sig": false, "md5_digest": "3b758355e75e36dc740cfbaa67153a6a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 167323, "upload_time": "2014-03-08T19:00:40", "upload_time_iso_8601": "2014-03-08T19:00:40.633628Z", "url": "https://files.pythonhosted.org/packages/0d/61/d801495b9f511205a86fb7bee40665b9fd503053977c6458c82ad22e5e74/pybald-routes-2.1.tar.gz", "yanked": false}], "2.11": [{"comment_text": "", "digests": {"md5": "6d81e0deabcfb6fe01f78d71c299d2b4", "sha256": "ce4fa2e1b3c8a3da4e9468c3863424473745dc63422286c130f05ddda8b6bb77"}, "downloads": -1, "filename": "pybald-routes-2.11.tar.gz", "has_sig": false, "md5_digest": "6d81e0deabcfb6fe01f78d71c299d2b4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 167473, "upload_time": "2014-03-08T19:11:53", "upload_time_iso_8601": "2014-03-08T19:11:53.290720Z", "url": "https://files.pythonhosted.org/packages/6a/05/3d2013b2b77967f1f3b2a1a3ccbe7e9a25b905c8f3cb37f2d9e8aa00eab6/pybald-routes-2.11.tar.gz", "yanked": false}], "2.1dev": []}, "urls": [{"comment_text": "", "digests": {"md5": "6d81e0deabcfb6fe01f78d71c299d2b4", "sha256": "ce4fa2e1b3c8a3da4e9468c3863424473745dc63422286c130f05ddda8b6bb77"}, "downloads": -1, "filename": "pybald-routes-2.11.tar.gz", "has_sig": false, "md5_digest": "6d81e0deabcfb6fe01f78d71c299d2b4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 167473, "upload_time": "2014-03-08T19:11:53", "upload_time_iso_8601": "2014-03-08T19:11:53.290720Z", "url": "https://files.pythonhosted.org/packages/6a/05/3d2013b2b77967f1f3b2a1a3ccbe7e9a25b905c8f3cb37f2d9e8aa00eab6/pybald-routes-2.11.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:09:26 2020"}