{"info": {"author": "Microsoft", "author_email": "vspython@microsoft.com", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Win32 (MS Windows)", "License :: Free for non-commercial use", "License :: Other/Proprietary License", "Natural Language :: English", "Operating System :: Microsoft", "Operating System :: Microsoft :: Windows :: Windows NT/2000", "Programming Language :: C++", "Programming Language :: Python", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 2 :: Only", "Topic :: Games/Entertainment", "Topic :: Multimedia :: Graphics", "Topic :: Multimedia :: Graphics :: Capture", "Topic :: Multimedia :: Sound/Audio"], "description": "The pykinect package provides access to the Kinect device. The pykinect package includes both the \"nui\" and \"audio\" subpackages. The nui package provides interactions with the Kinect cameras including skeleton tracking, video camera, as well as the depth camera. The audio subpackage provides access to the Kinect devices microphones.", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://pytools.codeplex.com/", "keywords": "Kinect;Windows", "license": "Microsoft PyKinect 1.0 Alpha\r\n(Non-commercial Use Only)\r\n\r\nThis is an agreement between Microsoft Corporation and you. Please read this agreement. It applies to the software named above (“Software”), which includes the media on which you received it, if any. It also applies to any Microsoft:\r\n•\tupdates,\r\n•\tsupplements,\r\n•\tdocumentation, and\r\n•\tsupport services\r\nfor the Software, if provided, all of which are understood to be part of the Software unless other terms accompany those items. If so, those terms apply.\r\nThis Software is intended to be used with Microsoft Kinect for Windows Software Development Kit (Kinect SDK).  Use of the Kinect SDK is subject to the license terms for that software.\r\nBy downloading, installing, accessing, or using the Software, you accept all terms in this agreement. If you do not accept them, you have no right to download, install, access, or use the Software. “You” or “you” means the individual who downloads, installs, accesses, or uses the Software (and, if you represent a legal entity, it also means that entity, and you represent and warrant that you are authorized to enter into this Agreement for that entity).\r\n\r\nIf you comply with all of the terms in this agreement, you have the rights below.\r\n1.\tINSTALLATION AND USE RIGHTS.\r\na.\tInstallation and Use. You may install and use up to five copies of the Software on your PC to design, develop, and test applications, programs, libraries, and modules that are enabled to run solely on the Windows platform (and not on any other platform) in connection with a Kinect™ for Xbox 360 Sensor device (all of which are referred to, collectively, as “Applications”), and distribute your Applications, subject to the terms in this agreement.\r\nb.\tDistributable Source Code Samples. The Software may contain certain sample source code that is expressly labeled as “sample source” or “sample code”, contained in the directory “SRC\\” and all of its subdirectories, as installed with this Software, contained in any directory titled “samples\\[SAMPLE NAME]”,or otherwise listed in the file SAMPLES.TXT, if any such file is provided (all of which are referred to, collectively, as “Sample Code”). You may copy and modify the Sample Code. You may also distribute the Sample Code (as well as your modifications of the Sample Code), but solely as part of your Applications, subject to the requirements and limitations of this agreement. You have no right to distribute any other portion of the Software. (Anyone who needs any other portion of the Software to run your Applications must obtain that portion directly from Microsoft.).\r\nc.\tDistribution Requirements. Any Applications or Sample Code you distribute are licensed only if you:\r\ni.\tdistribute your Applications subject to the terms of either: (1) the sample end user license agreement attached to this agreement as “Attachment 1”, or (2) your own end user license agreement that includes clauses identical or substantially similar to all of the language and clauses shown in “Attachment 2”. Although either of these alternatives is sufficient to comply with your obligations under this agreement, they may not include all of the terms that you want in your agreement with your end users. Microsoft is not providing you legal advice, and you must determine what end user license terms meet your needs and obligations;\r\nii.\tdisplay your valid copyright notice on your Applications; and\r\niii.\tindemnify, defend, and hold harmless Microsoft from any claims, including attorneys’ fees, related to the distribution or use of your Applications.\r\nd.\tLicense to Modifications. If you make modifications to the Sample Code and make those modifications public in source code, text, or any other descriptive (non-binary) format, you give to Microsoft, without charge, the right to use, share, and commercialize those modifications in any way and for any purpose. These rights survive this agreement.\r\n2.\tSCOPE OF LICENSE AND LICENSE LIMITATIONS. The Software is licensed, not sold. This agreement only gives you some rights to use the Software. Microsoft reserves all other rights. Unless applicable law gives you more rights despite this limitation, you may use the Software only as expressly permitted in this agreement. Any patent rights granted to you in this agreement apply only to the Software in the form in which Microsoft provided it to you, not to any derivative works you may make of, or combinations you may make with, the Software. You must not (and you have no license to):\r\na.\tdistribute any portion of the Software other than Sample Code, as provided in Section 1(b) above (this does not mean that you cannot distribute your Applications; it just means that anyone who wants to use your Applications will need to get a copy of the Software directly from Microsoft);\r\nb.\ttransfer the Software or this agreement to any third party (except for Sample Code, as provided in Section 1(b) above);\r\nc.\tpublish the Software for others to copy;\r\nd.\twork around any technical limitations in the Software;\r\ne.\taccess or use, or attempt to access or use, features of the Kinect device that are not exposed or enabled by the Software;\r\nf.\treverse engineer, decompile, or disassemble any part of the Software not provided in source code form, except and only to the extent that applicable law expressly permits, despite this limitation;\r\ng.\tmake more copies of the Software than specified in this agreement or allowed by applicable law, despite this limitation;\r\nh.\trent, lease, or lend the Software;\r\ni.\talter any copyright, trademark, or patent notice in the Software;\r\nj.\tuse Microsoft’s trademarks, including but not limited to Kinect and Windows, in your Applications’ names or in a way that suggests your Applications come from or are endorsed by Microsoft;\r\nk.\tdistribute any Application or Sample Code that is enabled to run on any platform other than the Windows platform;\r\nl.\tdistribute malicious, deceptive, obscene, or unlawful Applications;\r\nm.\tmodify or distribute any portion of the Sample Code, or distribute any Application, in any way that would subject either of these to an Excluded License. An Excluded License is a license that requires, as a condition of use, modification, or distribution of code subject to that license, that:\r\ni.\tthe code be disclosed or distributed in source code form; or\r\nii.\tothers have the right to modify the code;\r\nn.\tuse the Software or any Application in any hazardous situation, or design any Application for use in any hazardous situation; or\r\no.\tuse the Software or any Application, or distribute any Application, for any commercial purpose. A “commercial purpose” is any use for which you charge a fee (or otherwise obtain payment or other consideration) or through which you intend to realize a direct gain. A “commercial purpose” includes, but is not limited to:\r\ni.\tdistributing or making available any Application (or any product or service that accesses or uses the Software or any Application) for a fee or other exchange of value;\r\nii.\tdistributing or making available any Application (or any product or service that accesses or uses the Software or any Application) that contains advertising or other third-party content for which you obtain a fee or other value from the advertiser or content provider;\r\niii.\tdistributing or making available any Application (or any product or service that uses the Software or any Application) in connection with the solicitation of donations; or\r\niv.\tusing the Software or any Application (or any product or service that uses the Software or any Application) in your internal business operations.\r\nFor clarification, using the Software and Applications for personal experimentation is not a commercial purpose. It is also not a commercial purpose to use the Software in the process of teaching or academic research, even if you are regularly employed as a teacher or professor or if you intend to try to obtain research grants through such research.\r\n3.\tKINECT DEVICE. The Kinect device is sold subject to the terms of a Warranty and Software License Agreement that allows use of the device solely in connection with an Xbox 360 or Xbox 360 S console. Notwithstanding this restriction in the Kinect Warranty and Software License Agreement, you may also use an unmodified Kinect device in connection with the Software and your Application running on Windows, subject to the terms and conditions of this agreement. You must not (1) disassemble or otherwise alter your Kinect device; (2) modify the power supply for your Kinect device; (3) install any firmware on your Kinect device other than official Microsoft updates; and/or (4) use it with a platform other than a Windows platform. If you do, the Kinect device will be excluded from warranty coverage under the Kinect Warranty and Software License Agreement. All of the other terms of the Kinect Warranty and Software License Agreement remain unchanged.\r\n4.\tACKNOWLEDGEMENT AND WAIVER. You acknowledge that the Software may allow you to control the Kinect device, which is a mechanical hardware device that includes motors to move the device, a fan to cool it, and other mechanical components. Depending on how you elect to use the Software, you could damage or destroy the Kinect device or other property or harm persons. If you choose to use the Software (which is pre-release, beta software), you assume all risk that your use causes any harm or loss, and you agree to waive all claims against Microsoft and its affiliates related to such use (including but not limited to any claim that a Kinect device is defective) and to hold Microsoft and its affiliates harmless from such claims.\r\n5.\tFEEDBACK. You are not required to provide feedback, input, or suggestions (“Feedback”) to Microsoft. If you do so, however, you give to Microsoft, without charge, the right, including but not limited to rights under any applicable patents you own, to use, share, and commercialize your Feedback in any way and for any purpose. You also give to third parties, without charge, any patent rights needed for their products, technologies, and services to use or interface with any specific parts of a Microsoft software or service that includes the Feedback. You will not give Feedback that is subject to a license that requires Microsoft to license its software or documentation to third parties as a result of Microsoft including your Feedback in them. These rights survive this agreement.\r\n6.\tPRE-RELEASE SOFTWARE. The Software is research software. It is a pre-release version. It may not work the way a final version of the Software will. Microsoft may change it for a final version, and it may not be compatible with the final version. APIs that are supported in the Software may not be supported in the final version. Microsoft may also elect not to release a final version.\r\n7.\tSUPPORT SERVICES. Because this Software is research software, and it is provided “as is,” we may not provide support services for it. If we elect to provide any support services, we may stop (or change how we are) doing so at any time, for any reason or no reason, without notice.\r\n8.\tCUSTOMER EXPERIENCE IMPROVEMENT PROGRAM. The Software may connect to Microsoft or service provider computer systems over the Internet. You will not receive a separate notice when they connect. The Software may send to the appropriate systems certain computer information, such as your Internet protocol address, the type of operating system, browser and name and version of the Software you are using, and the language code of the device where you installed the Software. In particular, this Software may use the Customer Experience Improvement Program (CEIP). CEIP automatically sends to Microsoft information about your hardware and how you use this software. To learn more about CEIP, see <http://go.microsoft.com/fwlink/?LinkID=127895>.By using the Software, you consent to the transmission of this and related information. Microsoft does not use the information to identify or contact you. Microsoft may use this information, including without limitation the CEIP information, to improve our software and services. We may also share it with others, such as hardware and software vendors. They may use the information to improve how their products run with Microsoft software. You may not use these services in any way that could harm them or impair anyone else’s use of them. You may not use the services to try to gain unauthorized access to any service, data, account or network by any means.\r\n\r\n9.\tEXPORT RESTRICTIONS. The Software is subject to United States export laws and regulations. You must comply with all domestic and international export laws and regulations that apply to the Software. These laws include restrictions on destinations, end users, and end use. For additional information, see www.microsoft.com/exporting <http://www.microsoft.com/exporting>.\r\n\r\n10.\tENTIRE AGREEMENT. This agreement (along with the terms for supplements, updates, Internet-based services, and any support services that we may provide) is the entire agreement for the Software and any support services that we may provide.\r\n\r\n11.\tAPPLICABLE LAW.\r\n\r\na.\tUnited States. If you acquired the software in the United States, Washington state law governs the interpretation of this agreement and applies to claims for breach of it, regardless of conflict of laws principles. The laws of the state where you live govern all other claims, including claims under state consumer protection laws, unfair competition laws, and in tort.\r\nb.\tOutside the United States. If you acquired the software in any other country, the laws of that country apply.\r\n12.\tLEGAL EFFECT. This agreement describes certain legal rights. You may have other rights under the laws of your country. This agreement does not change your rights under the laws of your country if the laws of your country do not permit it to do so.\r\n13.\tDISCLAIMER OF WARRANTY. The Software is licensed “as-is.” You bear all risk of using it. Microsoft gives no express warranties or guarantees regarding the Software or any related products, services, or technologies. You may have additional consumer rights under your local laws that this agreement cannot change. To the extent permitted under your local laws, Microsoft excludes all implied warranties, including any implied warranties of merchantability, fitness for a particular purpose, and non-infringement.\r\n14.\tLIMITATION ON AND EXCLUSION OF REMEDIES AND DAMAGES. You can recover from Microsoft and its suppliers only direct damages up to U.S. $5.00. You cannot recover any other damages, including consequential, lost profits, special, indirect, punitive, or incidental damages. You also cannot recover for any loss of data, privacy, confidentiality, or profits; or any inability to use the Software.\r\nThis limitation applies to\r\na.\tanything related to the Software, services, content (including code) on third party Internet sites, or third party programs; and\r\nb.\tclaims for breach of contract; breach of warranty, guarantee, or condition; strict liability, negligence, or other tort, to the extent permitted by applicable law.\r\nIt also applies even if Microsoft knew or should have known about the possibility of the damages. The above limitation or exclusion may not apply to you because your state or country may not allow the exclusion or limitation of incidental, consequential, or other damages.\r\n15.\tTERM.\r\na.\tThis agreement will remain in effect until the earlier of:\r\ni.\tyou breach the terms of this agreement and Microsoft gives you written notice of the breach; \r\nii.\tyou sue Microsoft or one of its affiliates, distributors, or customers on any intellectual property claim related to the Software, Microsoft’s Kinect product or technology, Microsoft’s Xbox product or technology, or any software development kit or software tools related to these, or challenge the validity of any Microsoft intellectual property associated with any of these; or\r\niii.\tthe earlier of 30 June 2012 or 3 months after the next release of the Software unless Microsoft extends the term for you in its discretion either by written notice on the Microsoft Python Tools for Visual Studio project website or by written agreement.\r\nb.\tThe terms of this agreement requiring performance (or applying to events that may occur) after termination or expiration will survive termination or expiration, including all indemnity obligations and procedures, all disclaimers of warranties, and all limitations on and exclusions of remedies and damages.\r\n \r\nAttachment 1 - Sample EULA\r\n\r\nAs described in Section 1.c of this agreement, for any Applications or Sample Code you distribute, you must distribute your Applications subject to the terms of either: (1) the sample end user license agreement shown below in italics, or (2) your own end user license agreement that includes clauses identical or substantially similar to all of the language and clauses shown in “Attachment 2”. Although either of these alternatives are sufficient to comply with your obligations under this agreement, they may not include all of the terms that you want in your agreement with your end users. Also, you may not want to release any source code. Microsoft is not your lawyer, and you must determine what end user license terms meet your needs and obligations.\r\n\r\nLicense Terms\r\n\r\nCopyright (c) <YEAR>, <OWNER>\r\nAll rights reserved.\r\n\r\nThis document (“End User License Agreement” or “EULA”) is a contract between you and the person who (or company that) provided you this software (“Software Provider”). The EULA defines your rights and responsibilities related to the software. \r\nBy downloading, installing, accessing, or using the software, you accept all terms in this EULA. If you do not accept them, you have no right to download, install, access, or use the software.\r\n1.\tRIGHTS. The software is licensed, not sold. You may distribute and use the software, in source and binary forms, with or without modification, but only if the following conditions are met:\r\na.\tDistributions of source code must retain the above copyright notice, this list of conditions and the disclaimer below;\r\nb.\tDistributions in binary form must reproduce the above copyright notice, this list of conditions and the disclaimer below in the documentation or other materials provided with the distribution;\r\nc.\tNeither the name of [Software Provider] nor the names of its licensors may be used to endorse or promote products derived from this software without specific prior written permission;\r\nd.\tThe software may not be used or run on any software platform other than Microsoft Windows;\r\ne.\tThe software may not be used for any commercial purpose;\r\nf.\tIf you provide feedback, input, or suggestions (“Feedback”) on the software, you grant to [Software Provider] and its licensors, under all intellectual property rights, the right to make, use, modify, distribute, and otherwise commercialize your Feedback in any way and for any purpose; and\r\ng.\tYou may not do anything with or to the software in any way that would subject it to the terms of an Excluded License. An Excluded License is a license that requires, as a condition of use, modification, or distribution of code subject to that license, that: (i) the code be disclosed or distributed in source code form; or (ii) others have the right to modify the code.\r\n2.\tDISCLAIMER. This software is provided by [Software Provider] and its licensors “as is” and any express or implied warranties, including, but not limited to, the implied warranties of merchantability and fitness for a particular purpose are disclaimed. In no event will [Software Provider] or its licensors be liable for any direct, indirect, incidental, special, exemplary, or consequential damages (including, but not limited to, procurement of substitute goods or services; loss of use, data, or profits; or business interruption) however caused and on any theory of liability, whether in contract, strict liability, or tort (including negligence or otherwise) arising in any way out of the use of this software, even if advised of the possibility of such damage. You can recover from [Software Provider] and its licensors only direct damages up to U.S. $5.00.\r\n \r\nAttachment 2 - Sample EULA Language\r\n\r\nAs described in Section 1.c of this agreement, for any Applications or Sample Code you distribute, you must distribute your Applications subject to the terms of either: (1) the sample end user license agreement attached to this agreement as “Attachment 1”, or (2) your own end user license agreement that includes clauses identical or substantially similar to all of the language and clauses shown below in italics. Although either of these alternatives are sufficient to comply with your obligations under this agreement, they may not include all of the terms that you want in your agreement with your end users. Microsoft is not your lawyer, and you must determine what end user license terms meet your needs and obligations.\r\n\r\n\r\nLicense Restrictions\r\n•\tThe software may not be used for any commercial purpose;\r\n•\tThe software may not be used or run on any software platform other than Microsoft Windows; and\r\n•\tYou may not do anything with or to the software in any way that would subject it to the terms of an Excluded License. An Excluded License is a license that requires, as a condition of use, modification, or distribution of code subject to that license, that: (i) the code be disclosed or distributed in source code form; or (ii) others have the right to modify the code.\r\n\r\nFeedback\r\nIf you provide feedback, input, or suggestions (“Feedback”) on the software, you grant to [Software Provider] and its licensors, under all intellectual property rights, the right to make, use, modify, distribute, and otherwise commercialize your Feedback in any way and for any purpose.\r\n\r\nDISCLAIMER. This software is provided by the [Software Provider] and its licensors “as is” and any express or implied warranties, including, but not limited to, the implied warranties of merchantability and fitness for a particular purpose are disclaimed. In no event will the [Software Provider] or its licensors be liable for any direct, indirect, incidental, special, exemplary, or consequential damages (including, but not limited to, procurement of substitute goods or services; loss of use, data, or profits; or business interruption) however caused and on any theory of liability, whether in contract, strict liability, or tort (including negligence or otherwise) arising in any way out of the use of this software, even if advised of the possibility of such damage. You can recover from [Software Provider] and its licensors only direct damages up to U.S. $5.00.", "maintainer": "", "maintainer_email": "", "name": "pykinect", "package_url": "https://pypi.org/project/pykinect/", "platform": "Windows", "project_url": "https://pypi.org/project/pykinect/", "project_urls": {"Download": "UNKNOWN", "Homepage": "http://pytools.codeplex.com/"}, "release_url": "https://pypi.org/project/pykinect/.9/", "requires_dist": null, "requires_python": null, "summary": "PyKinect Module for interacting with the Kinect SDK", "version": ".9", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>The pykinect package provides access to the Kinect device. The pykinect package includes both the “nui” and “audio” subpackages. The nui package provides interactions with the Kinect cameras including skeleton tracking, video camera, as well as the depth camera. The audio subpackage provides access to the Kinect devices microphones.</p>\n\n          </div>"}, "last_serial": 1930106, "releases": {".9": [], "1.0": [{"comment_text": "", "digests": {"md5": "151733f32cb99d20e708cb2219d446cf", "sha256": "0251cd20241412fd584a42dfdb65d50581484c589e9f1b510d3186290a2af7d1"}, "downloads": -1, "filename": "pykinect-1.0-py2.7.egg", "has_sig": false, "md5_digest": "151733f32cb99d20e708cb2219d446cf", "packagetype": "bdist_egg", "python_version": "2.7", "requires_python": null, "size": 73787, "upload_time": "2012-03-06T22:01:17", "upload_time_iso_8601": "2012-03-06T22:01:17.543600Z", "url": "https://files.pythonhosted.org/packages/20/c6/22b66638b7424072719b34114368f5c2ca1e77220280758c3334172e38c8/pykinect-1.0-py2.7.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "b12acb429e9a57478bb6037c4f12ee6b", "sha256": "3a8a68cbf9fcd9aaf28bf4683d8bf75700472ee7890a06524e3c20ad4a0d6e36"}, "downloads": -1, "filename": "pykinect-1.0.zip", "has_sig": false, "md5_digest": "b12acb429e9a57478bb6037c4f12ee6b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 51063, "upload_time": "2012-03-06T21:54:58", "upload_time_iso_8601": "2012-03-06T21:54:58.652562Z", "url": "https://files.pythonhosted.org/packages/e0/9a/37ef09921be5bbaca517e7603770a191678e3e7257052458c205e008e261/pykinect-1.0.zip", "yanked": false}], "1.1": [{"comment_text": "", "digests": {"md5": "4e0a9d667d1e0911d71d82561675b25a", "sha256": "4f1df9585c62d0a9b073643a7b7eea79d03a4cc97f30202c111ba7e6b4a21c66"}, "downloads": -1, "filename": "pykinect-1.1.zip", "has_sig": false, "md5_digest": "4e0a9d667d1e0911d71d82561675b25a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 44751, "upload_time": "2014-03-19T19:54:23", "upload_time_iso_8601": "2014-03-19T19:54:23.978682Z", "url": "https://files.pythonhosted.org/packages/15/b5/fdc29fa5053eb3460194c1b93872dea7ac60c79bdb6d6218766e9ac5e795/pykinect-1.1.zip", "yanked": false}], "2.1": [{"comment_text": "", "digests": {"md5": "949e9833343aa82e3fac565d457a5804", "sha256": "a6d908dbe32235331324b48799eb5992bb5bdb65534c099fc7189d673b4c47ab"}, "downloads": -1, "filename": "pykinect-2.1-cp27-none-win32.whl", "has_sig": false, "md5_digest": "949e9833343aa82e3fac565d457a5804", "packagetype": "bdist_wheel", "python_version": "2.7", "requires_python": null, "size": 43833, "upload_time": "2014-08-11T16:22:44", "upload_time_iso_8601": "2014-08-11T16:22:44.575736Z", "url": "https://files.pythonhosted.org/packages/f1/9a/5822520cc5a94fa6bde85f74513d2aa6e5b2e5c31e34b93de08eb303c283/pykinect-2.1-cp27-none-win32.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1f1be0f155bb32f2b6fed9283d606372", "sha256": "633134a74a96378693cee936117275947c953e929b59d782ad4d723dc84d6622"}, "downloads": -1, "filename": "pykinect-2.1-cp27-none-win_amd64.whl", "has_sig": false, "md5_digest": "1f1be0f155bb32f2b6fed9283d606372", "packagetype": "bdist_wheel", "python_version": "2.7", "requires_python": null, "size": 44688, "upload_time": "2014-08-11T16:22:41", "upload_time_iso_8601": "2014-08-11T16:22:41.155022Z", "url": "https://files.pythonhosted.org/packages/76/ee/6f7e4f4dee7bc45f4548f0090f01f6d792972e1bb3f3cb9c0dacbc7e8c01/pykinect-2.1-cp27-none-win_amd64.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "203c72de503fcb823d30439ae407fa62", "sha256": "c709263a6a996b3d122d9ab31f5a975ca87e38dd695bdfe9893e25eb190a4220"}, "downloads": -1, "filename": "pykinect-2.1.zip", "has_sig": false, "md5_digest": "203c72de503fcb823d30439ae407fa62", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 44749, "upload_time": "2014-08-11T16:14:27", "upload_time_iso_8601": "2014-08-11T16:14:27.082080Z", "url": "https://files.pythonhosted.org/packages/dc/7f/8f80b2d818995fc9df69178db210f953b13e0c55c0a74e7e2cf146985b87/pykinect-2.1.zip", "yanked": false}], "2.1b1": [{"comment_text": "", "digests": {"md5": "2843848be3cc67f4c5da92fc61f59caf", "sha256": "d2e0731c3dc620f030962e51528cd491e3ec18e90a21998a6132884ca4035d8f"}, "downloads": -1, "filename": "pykinect-2.1b1-cp27-none-win32.whl", "has_sig": false, "md5_digest": "2843848be3cc67f4c5da92fc61f59caf", "packagetype": "bdist_wheel", "python_version": "2.7", "requires_python": null, "size": 43825, "upload_time": "2014-03-19T23:45:22", "upload_time_iso_8601": "2014-03-19T23:45:22.412384Z", "url": "https://files.pythonhosted.org/packages/1e/af/1d4d3a07c91089a1a2c97fe1ccf8e773f7ffa18e9bc3a57b90387e0a5f64/pykinect-2.1b1-cp27-none-win32.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ea692cd1e0b88256e38ead6fc027af42", "sha256": "c7190702b1c6246431fc834b44186cc17cc43fc6009465de155fc74d997d1c98"}, "downloads": -1, "filename": "pykinect-2.1b1-cp27-none-win_amd64.whl", "has_sig": false, "md5_digest": "ea692cd1e0b88256e38ead6fc027af42", "packagetype": "bdist_wheel", "python_version": "2.7", "requires_python": null, "size": 44671, "upload_time": "2014-03-19T23:45:17", "upload_time_iso_8601": "2014-03-19T23:45:17.894283Z", "url": "https://files.pythonhosted.org/packages/66/2b/f01553b19d6f217bcdb25f019d7988984cced42a6a0dd822c4fbedc39ee8/pykinect-2.1b1-cp27-none-win_amd64.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "abe12606b85563f461eab80b772a7133", "sha256": "c638a7dee1f79427020e22a49b2de83cdb2440325fb89ce635b62b79486c0063"}, "downloads": -1, "filename": "pykinect-2.1b1.zip", "has_sig": false, "md5_digest": "abe12606b85563f461eab80b772a7133", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 44854, "upload_time": "2014-03-19T20:50:56", "upload_time_iso_8601": "2014-03-19T20:50:56.931543Z", "url": "https://files.pythonhosted.org/packages/94/1b/0d5fd988fc08766c60ff6135c7d8353f98cdac9933c1b163c7da4921c2e9/pykinect-2.1b1.zip", "yanked": false}]}, "urls": [], "timestamp": "Fri May  8 03:03:31 2020"}