{"info": {"author": "CommerceBlock", "author_email": "tom@commerceblock.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Intended Audience :: Developers", "License :: OSI Approved :: MIT License", "Programming Language :: Python :: 3 :: Only", "Topic :: Security :: Cryptography"], "description": "# Mainstay Client\n\nA command-line tool used to manage interaction with the **mainstay.xyz** proof\nservice. The tool can be used to perform state attestations, retrieve and collate \nproofs and to verify proofs of immutable sequence via connection to a Bitcoin \nfull node or Bitcoin block-explorer API. \n\n## Requirements\n\n* Python3\n\nTo trustlessly verify proofs, RPC connection details to a `bitcoind` node must be provided. \n\n## Installation\n\nVia PyPi:\n\n    $ pip3 install mainstay\n\nor directly from source:\n\n    $ python3 setup.py install\n\n## Usage\n\nThe Mainstay client interface (`msc`) can be used to fetch and verify proof sequences, synchronize and verify the immutability of Mainstay sidechains, perform authenticated data commitments and attestations, and generate and manage *mainstay.xyz* authentication keys. The interface is used via commands to perform different operations with specified arguments. The commands available can be listed with the `--help` argument:\n\n\t$ msc -h\n\n```\n\tusage: msc [-h] [-q] [-v]\n\t           {attest,a,fetch,f,verify,v,sync,s,config,c,keygen,k,info,i} ...\n\n\tMainstay client\n\n\toptional arguments:\n\t  -h, --help            show this help message and exit\n\t  -q, --quiet           Be more quiet.\n\t  -v, --verbose         Be more verbose. Both -v and -q may be used multiple\n\t                        times.\n\n\tCommands:\n\t  Mainstay operations are performed via commands:\n\n\t  {attest,a,fetch,f,verify,v,sync,s,config,c,keygen,k,info,i}\n\t    attest (a)          Commit data to a Mainstay slot\n\t    fetch (f)           Fetch proofs from the Mainstay service\n\t    verify (v)          Verify Mainstay proofs against the Bitcoin blockchain\n\t    sync (s)            Syncronise sidechain to Bitcoin via a sequence proof\n\t    config (c)          Set configuration\n\t    keygen (k)          Generate signing keys for attestations\n\t    info (i)            Mainstay service status information\t\n```\n\nFor each command, the possible arguments can be again listed with the `--help` flag. E.g. \n\n\t$ msc attest -h\n\n```\nusage: msc attest [-h] [-f FILENAME | -c COMMITMENT | -g GIT | -d DIRECTORY]\n                  [-s SLOT] [--url SERVICE_URL] [-t API_TOKEN] [-k PRIVKEY]\n\noptional arguments:\n  -h, --help            show this help message and exit\n  -f FILENAME, --file FILENAME\n                        Attest the SHA256 hash of the specified file.\n  -c COMMITMENT, --commit COMMITMENT\n                        Hex string of the 32 bytes commitment.\n  -g GIT, --git GIT     Attest the HEAD of the specified Git repository. If 0\n                        use stored path.\n  -d DIRECTORY, --dir DIRECTORY\n                        Attest the state of the specified sequence directory.\n  -s SLOT, --slot SLOT  Specify the slot position index.\n  --url SERVICE_URL     URL for the Mainstay connector service. Default:\n                        https://mainstay.xyz\n  -t API_TOKEN, --token API_TOKEN\n                        API token for the specified slot position.\n  -k PRIVKEY, --privkey PRIVKEY\n                        Private key for signing the commitment.\n```\n\n### Configuration\n\nThe client can be used in a stateless fashion, with all configuration supplied via the command-line options, however a configuration file (`config.json`) can be used, which is located in the application data directory. The current configuration, and the location of the application data directory on a particular system, can be retrieved as follows:\n\n\t$ msc config\n\nAll configuration is set via the same command. For connection to a particular slot, the slot position (`-s`), the API token (`-t`) and the authentication key (`-k`) can be set initially, so they do not have to be specified as arguments for each subsequent call. \n\n### Attestation\n\nTo perform commitments to a specified *mainstay.xyz* slot requires an API token that will have been provided on initialization of the slot. In addition, if a public key was specified on initialization, the commitment must be signed by the corresponding private key. The signature is computed by the client if the private key is provided (or is set in the config). \n\nThe client will send 32 byte commitment supplied as an argument (`-c`) to the specified slot, or the SHA256 hash of a specified file path (`-f`). For example:\n\n\t$ msc attest -c 4db3dbb10b33d94389446982f022ee55be8eaefa7d8f40046054a693f23a1c85 -s 2\n\nThe client will return whether the commitment has been recieved by the *mainstay.xyz* successfully. \n\nTo attest the state of a file sequence directory, supply the directory path:\n\n\t$ msc attest -d /Users/username/directory/ -s 2\n\nTo attest the latest state of a Git repository, supply the repository path:\n\n\t$ msc attest -g /Users/username/gitrepo/ -s 2\n\n### Proof retrieval\n\nThe client can retrive, store and update sequence proofs for a specified or configured slot position with the `fetch` command. This requires no token or authentication, as the proofs are publicly accessible. All retrieved sequence proofs are stored locally in the application data directory (the location of directory can be found with the `config` command), and can also optionally be saved to a specified file (`-f`) or printed to standard output (`-o`). \n\nTo retrieve the full sequence proof for a specified slot from when it was initialised, supply the argument `-i 0`. E.g. (for slot 2),\n\n\t$ msc fetch -i 0 -s 2\n\nThis sequence proof will then be saved to a file named `slot_2_sequence.msp` in the application data directory. \n\nTo retrieve the sequence proof to a specific staychain transaction ID (e.g. `9eeccf2e6ca6f7257a379debccfb3e822df8658d03c95ec47fbd2267d218f03d`):\n\n\t$ msc fetch -i 9eeccf2e6ca6f7257a379debccfb3e822df8658d03c95ec47fbd2267d218f03d -s 2\n\nOnce a sequence proof for a specified slot has been fetched, it can be updated to include all new slot proofs in the sequence up to the latest with the update `-u` argument:\n\n\t$ msc fetch -u -s 2\n\n### Verification\n\nThe client can perform various independent and trustless verification operations on sequence proofs to confirm the immutability of specified sequences. \n\nFull verification of a specified sequence proof is performed in two stages, as a sequence proof bridges a secondary system to the Bitcoin blockchain. So typically a user will want to independently verify two properties of a specific sequence proof:\n\n1. That the sequence proof is attested to the unbroken sequence of *staychain* transactions confirmed in the Bitcoin blockchain at the specified slot position. \n2. That the sequence proof corresponds to the sequence of state changes in the external system. \n\nThe client enables users to perform each verification separately according to their individual requirements. Both operations must be successfully performed to verify a unique single history. \n\n#### Bitcoin blockchain verification\n\nTo verify a specified sequence proof against the Bitcoin blockchain, a connection to a full Bitcoin node must be provided. This is set using the `-b` argument, and can be either an RPC URL with authentication details or a public HTTP address (for a remote block explorer). The Bitcoin node can also be set in the client config. For example:\n\n\t$ msc config -b username:password@localhost:8332\n\nor\n\n\t$ msc config -b https://api.blockcypher.com/v1/btc/main/txs/\n\nIf no node URL is provided, a default public Bitcoin block explorer is used (api.blockcypher.com/v1/btc/main/txs). \n\nTo perform the verification of a sequence proof against Bitcoin, the proof can be supplied as a file (using the `-f` argument) or as a JSON object (using the `-p` argument). To verify the stored proof in the application data directory, use `-p 0`. For example:\n\n\t$ msc verify -p 0 -s 2\n\nIf the verification of unique sequence is successful, the client will return the staychain commitment details. For example,\n\n\tVerified proof sequence\n\tStart commitment in block 00000000000000000002e347026ca276fc5035f637deea48c6386c90504f042b height 604260 at 2019-11-17T21:07:18Z\n\tEnd commitment in block 00000000000000000001589123ee33c19e5a7ac8ac8f173867c8f877a7051d16 height 604757 at 2019-11-21T10:17:52Z\n\nIf the staychain base transaction ID is also included (the unique identifier) in the configuration, or via the `-i` argument, the client will additionally verify that this TxID is part of the staychain. \n\n#### State change verification\n\nTo verify that a specified sequence proof corresponds a sequence of state changes, one of the additional arguments of `-l`, `-d` or `-g` is used along with the `-p` or `-f` arguments specifying the proof. The simplest of these is the `-l` argument which simply verifies that the given sequence proof matches a specified list of 32-byte commitments. These commitments are supplied hex encoded and comma separated. Fro example:\n\n\t$ msc verify -p 0 -s 2 -l c635faa8f63f80d40fcc5f764aa3cb2c6de66027682ece03efc499db2edad780,4113d23c6f9dc921bf23f0f551b4cb9909099bbe89464ec7f424b6dabda12924,118d182a45bffea9fd8c6eb98453b6edc19327f6d1f2887b10700d194c275259\n\nIf the proof sequence matches the commitment list exactly and in order the client will return the verification:\n\n\tVerified proof sequence against commitment list. \n\nIf the sequence does not match, the verification will fail. \n\n\tVerification failed. Commitments not matched. \n\nIf all slot-proofs in the sequence proof are matched to commitments in the list in order, but there are additional commtiments included in the list, then the client will return:\n\n\tVerification failed. Additional commitments on list not in proof.\n\nTo verify that a specified sequence proof corresponds to a chronological sequence of files in a specified directory, the additional argument `-d` is used to specify the directory path. This directory must contain the matching sequence of files, named in an alpha-numeric order corresonding to the sequence of changes. For example:\n\n\t$ msc verify -p 0 -s 2 -d /Users/username/directory/\n\nIf the proof sequence matches the full hash chain of files in the specified directory exactly and in sequence, then the client will return the verification:\n\n\tVerified proof sequence against directory hash chain.\n\nThe client will also return a warning if additional files have been added to the directory since the last attestation has been performed. \n\n\tWARNING: last 1 files not attested.\n\tLast file attested: document-v0.5.txt\n\nTo verify that a specified sequence proof corresponds to the commit history of a Git repository, the additional argument `-g` is used to specify the directory path of the Git repository. The client also checks that the initial commit message of the repository is a staychain TxID and slot ID. For example:\n\n\t$ msc verify -p 0 -s 2 -g /Users/username/gitrepo/\n\nIf the proof sequence matches the full hash chain of files in the specified directory exactly and in sequence, then the client will return the verification:\n\n\tVerified proof sequence against commit history to b40a656d028618f6c1d73465c07d810078fd74e4\n\nWhere `b40a656d028618f6c1d73465c07d810078fd74e4` is the latest Git commit included in the sequence proof. If there have been additional commits to the Git repository since the latest attestation in the sequence proof, the client will return a warnings with the number of non-attested commits. For example:\n\n\tWARNING: last 3 commits not attested.\n\nThe `verify -g` operation also verifies that the staychain base TxID in the sequence proof, and slot ID, are added as the commit message in the initial commit of the repository. If this commitment is not present, the following warning is given:\n\n\tStaychain ID not committed to Git history\n\n### Sidechain synchronization\n\nThe client can be used to synchronize a sidechain state against a Bitcoin staychain. This is performed using the `sync` command, and requires an RPC connection to both a full Bitcoin node (or trusted block explorer) and the sidechain node. As with the Bitcoin node connection, the sidechain node connection can also be set in the client config:\n\n\t$ msc config -b username:password@localhost:8332  # Bitcoin node\n\t$ msc config -n username:password@localhost:8336  # Sidechain node\n\nTo verify that a sidechain history is unique against Bitcoin's global state, and determine the latest attested sidechain block, the full sequence proof is retrieved, fully verified and then verified against the Bitcoin staychain the the sidechain state. For example: \n\n\t$ msc sync -s 1\n\nIf the verification is successful, the client will return the latest sidechain verified block. For example:\n\n\tVerified sidechain attestation sequence\n    Latest attestated sidechain block: 47e3d796f0ae87f2261e620018ffb1e0458175e17faf2762f209a17c727a8690 height 163188\n\n### Key generation and authentication\n\nThe client can generate keys to be used for attestation authentication, and generate commitment signatures using the `keygen` command. To generate a 256 bit private key, the `-g` argument is used with optional supplied entropy. For example:\n\n\t$ msc keygen -g entropy\n\nThis generated key is then saved in the config and automatically used to sign attestations sent the the Mainstay service URL. The generated hex-encoded private key can then be used to generate the corresponding secp256k1 compressed public key using the `-p` argument. \n\n\t$ msc keygen -p c76849c6ac48c4996b2847a5b87d9ee0e9463ea11c827591a50978b1b2682804\n\nThe returned hex-encoded public key is supplied in the web form used to sign-up to the mainstay.xyz service, if signature based authentication is required. \n\n### Staychain status and information\n\nWhen initializing a sidechain, Git repository or file repository, the staychain base TxID and slot position must be committed to the initial state in order to prove uniqueness. In a sidechain, this information is committed to the genesis block, and in the case of a Git repository, this information is added as the message of the initial commit. To retrieve the latest staychain TxID to perform this initialisation, the `info` command can be used. \n\n\t$ msc info\n\nThis returns the base ID. For example:\n\n\tBase ID: 9d049eb88c13d7c4bad6f2597417da525effebc47b2095621b8cebad7ded4cf5:2\n\nThe argument `-c` will also set this in the config. \n\nTo initialise a Git repository and link it to the staychain and slot position, the initial commit will be as follows:\n\n\t$ git commit -m '9d049eb88c13d7c4bad6f2597417da525effebc47b2095621b8cebad7ded4cf5:2'", "description_content_type": "text/markdown", "docs_url": null, "download_url": "https://github.com/commerceblock/pymainstay/archive/0.1.1.tar.gz", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/commerceblock/pymainstay", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "pymainstay", "package_url": "https://pypi.org/project/pymainstay/", "platform": "", "project_url": "https://pypi.org/project/pymainstay/", "project_urls": {"Download": "https://github.com/commerceblock/pymainstay/archive/0.1.1.tar.gz", "Homepage": "https://github.com/commerceblock/pymainstay"}, "release_url": "https://pypi.org/project/pymainstay/0.1.1/", "requires_dist": null, "requires_python": "", "summary": "Tool to attest state and verify Mainstay sequence proofs", "version": "0.1.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Mainstay Client</h1>\n<p>A command-line tool used to manage interaction with the <strong>mainstay.xyz</strong> proof\nservice. The tool can be used to perform state attestations, retrieve and collate\nproofs and to verify proofs of immutable sequence via connection to a Bitcoin\nfull node or Bitcoin block-explorer API.</p>\n<h2>Requirements</h2>\n<ul>\n<li>Python3</li>\n</ul>\n<p>To trustlessly verify proofs, RPC connection details to a <code>bitcoind</code> node must be provided.</p>\n<h2>Installation</h2>\n<p>Via PyPi:</p>\n<pre><code>$ pip3 install mainstay\n</code></pre>\n<p>or directly from source:</p>\n<pre><code>$ python3 setup.py install\n</code></pre>\n<h2>Usage</h2>\n<p>The Mainstay client interface (<code>msc</code>) can be used to fetch and verify proof sequences, synchronize and verify the immutability of Mainstay sidechains, perform authenticated data commitments and attestations, and generate and manage <em>mainstay.xyz</em> authentication keys. The interface is used via commands to perform different operations with specified arguments. The commands available can be listed with the <code>--help</code> argument:</p>\n<pre><code>$ msc -h\n</code></pre>\n<pre><code>\tusage: msc [-h] [-q] [-v]\n\t           {attest,a,fetch,f,verify,v,sync,s,config,c,keygen,k,info,i} ...\n\n\tMainstay client\n\n\toptional arguments:\n\t  -h, --help            show this help message and exit\n\t  -q, --quiet           Be more quiet.\n\t  -v, --verbose         Be more verbose. Both -v and -q may be used multiple\n\t                        times.\n\n\tCommands:\n\t  Mainstay operations are performed via commands:\n\n\t  {attest,a,fetch,f,verify,v,sync,s,config,c,keygen,k,info,i}\n\t    attest (a)          Commit data to a Mainstay slot\n\t    fetch (f)           Fetch proofs from the Mainstay service\n\t    verify (v)          Verify Mainstay proofs against the Bitcoin blockchain\n\t    sync (s)            Syncronise sidechain to Bitcoin via a sequence proof\n\t    config (c)          Set configuration\n\t    keygen (k)          Generate signing keys for attestations\n\t    info (i)            Mainstay service status information\t\n</code></pre>\n<p>For each command, the possible arguments can be again listed with the <code>--help</code> flag. E.g.</p>\n<pre><code>$ msc attest -h\n</code></pre>\n<pre><code>usage: msc attest [-h] [-f FILENAME | -c COMMITMENT | -g GIT | -d DIRECTORY]\n                  [-s SLOT] [--url SERVICE_URL] [-t API_TOKEN] [-k PRIVKEY]\n\noptional arguments:\n  -h, --help            show this help message and exit\n  -f FILENAME, --file FILENAME\n                        Attest the SHA256 hash of the specified file.\n  -c COMMITMENT, --commit COMMITMENT\n                        Hex string of the 32 bytes commitment.\n  -g GIT, --git GIT     Attest the HEAD of the specified Git repository. If 0\n                        use stored path.\n  -d DIRECTORY, --dir DIRECTORY\n                        Attest the state of the specified sequence directory.\n  -s SLOT, --slot SLOT  Specify the slot position index.\n  --url SERVICE_URL     URL for the Mainstay connector service. Default:\n                        https://mainstay.xyz\n  -t API_TOKEN, --token API_TOKEN\n                        API token for the specified slot position.\n  -k PRIVKEY, --privkey PRIVKEY\n                        Private key for signing the commitment.\n</code></pre>\n<h3>Configuration</h3>\n<p>The client can be used in a stateless fashion, with all configuration supplied via the command-line options, however a configuration file (<code>config.json</code>) can be used, which is located in the application data directory. The current configuration, and the location of the application data directory on a particular system, can be retrieved as follows:</p>\n<pre><code>$ msc config\n</code></pre>\n<p>All configuration is set via the same command. For connection to a particular slot, the slot position (<code>-s</code>), the API token (<code>-t</code>) and the authentication key (<code>-k</code>) can be set initially, so they do not have to be specified as arguments for each subsequent call.</p>\n<h3>Attestation</h3>\n<p>To perform commitments to a specified <em>mainstay.xyz</em> slot requires an API token that will have been provided on initialization of the slot. In addition, if a public key was specified on initialization, the commitment must be signed by the corresponding private key. The signature is computed by the client if the private key is provided (or is set in the config).</p>\n<p>The client will send 32 byte commitment supplied as an argument (<code>-c</code>) to the specified slot, or the SHA256 hash of a specified file path (<code>-f</code>). For example:</p>\n<pre><code>$ msc attest -c 4db3dbb10b33d94389446982f022ee55be8eaefa7d8f40046054a693f23a1c85 -s 2\n</code></pre>\n<p>The client will return whether the commitment has been recieved by the <em>mainstay.xyz</em> successfully.</p>\n<p>To attest the state of a file sequence directory, supply the directory path:</p>\n<pre><code>$ msc attest -d /Users/username/directory/ -s 2\n</code></pre>\n<p>To attest the latest state of a Git repository, supply the repository path:</p>\n<pre><code>$ msc attest -g /Users/username/gitrepo/ -s 2\n</code></pre>\n<h3>Proof retrieval</h3>\n<p>The client can retrive, store and update sequence proofs for a specified or configured slot position with the <code>fetch</code> command. This requires no token or authentication, as the proofs are publicly accessible. All retrieved sequence proofs are stored locally in the application data directory (the location of directory can be found with the <code>config</code> command), and can also optionally be saved to a specified file (<code>-f</code>) or printed to standard output (<code>-o</code>).</p>\n<p>To retrieve the full sequence proof for a specified slot from when it was initialised, supply the argument <code>-i 0</code>. E.g. (for slot 2),</p>\n<pre><code>$ msc fetch -i 0 -s 2\n</code></pre>\n<p>This sequence proof will then be saved to a file named <code>slot_2_sequence.msp</code> in the application data directory.</p>\n<p>To retrieve the sequence proof to a specific staychain transaction ID (e.g. <code>9eeccf2e6ca6f7257a379debccfb3e822df8658d03c95ec47fbd2267d218f03d</code>):</p>\n<pre><code>$ msc fetch -i 9eeccf2e6ca6f7257a379debccfb3e822df8658d03c95ec47fbd2267d218f03d -s 2\n</code></pre>\n<p>Once a sequence proof for a specified slot has been fetched, it can be updated to include all new slot proofs in the sequence up to the latest with the update <code>-u</code> argument:</p>\n<pre><code>$ msc fetch -u -s 2\n</code></pre>\n<h3>Verification</h3>\n<p>The client can perform various independent and trustless verification operations on sequence proofs to confirm the immutability of specified sequences.</p>\n<p>Full verification of a specified sequence proof is performed in two stages, as a sequence proof bridges a secondary system to the Bitcoin blockchain. So typically a user will want to independently verify two properties of a specific sequence proof:</p>\n<ol>\n<li>That the sequence proof is attested to the unbroken sequence of <em>staychain</em> transactions confirmed in the Bitcoin blockchain at the specified slot position.</li>\n<li>That the sequence proof corresponds to the sequence of state changes in the external system.</li>\n</ol>\n<p>The client enables users to perform each verification separately according to their individual requirements. Both operations must be successfully performed to verify a unique single history.</p>\n<h4>Bitcoin blockchain verification</h4>\n<p>To verify a specified sequence proof against the Bitcoin blockchain, a connection to a full Bitcoin node must be provided. This is set using the <code>-b</code> argument, and can be either an RPC URL with authentication details or a public HTTP address (for a remote block explorer). The Bitcoin node can also be set in the client config. For example:</p>\n<pre><code>$ msc config -b username:password@localhost:8332\n</code></pre>\n<p>or</p>\n<pre><code>$ msc config -b https://api.blockcypher.com/v1/btc/main/txs/\n</code></pre>\n<p>If no node URL is provided, a default public Bitcoin block explorer is used (api.blockcypher.com/v1/btc/main/txs).</p>\n<p>To perform the verification of a sequence proof against Bitcoin, the proof can be supplied as a file (using the <code>-f</code> argument) or as a JSON object (using the <code>-p</code> argument). To verify the stored proof in the application data directory, use <code>-p 0</code>. For example:</p>\n<pre><code>$ msc verify -p 0 -s 2\n</code></pre>\n<p>If the verification of unique sequence is successful, the client will return the staychain commitment details. For example,</p>\n<pre><code>Verified proof sequence\nStart commitment in block 00000000000000000002e347026ca276fc5035f637deea48c6386c90504f042b height 604260 at 2019-11-17T21:07:18Z\nEnd commitment in block 00000000000000000001589123ee33c19e5a7ac8ac8f173867c8f877a7051d16 height 604757 at 2019-11-21T10:17:52Z\n</code></pre>\n<p>If the staychain base transaction ID is also included (the unique identifier) in the configuration, or via the <code>-i</code> argument, the client will additionally verify that this TxID is part of the staychain.</p>\n<h4>State change verification</h4>\n<p>To verify that a specified sequence proof corresponds a sequence of state changes, one of the additional arguments of <code>-l</code>, <code>-d</code> or <code>-g</code> is used along with the <code>-p</code> or <code>-f</code> arguments specifying the proof. The simplest of these is the <code>-l</code> argument which simply verifies that the given sequence proof matches a specified list of 32-byte commitments. These commitments are supplied hex encoded and comma separated. Fro example:</p>\n<pre><code>$ msc verify -p 0 -s 2 -l c635faa8f63f80d40fcc5f764aa3cb2c6de66027682ece03efc499db2edad780,4113d23c6f9dc921bf23f0f551b4cb9909099bbe89464ec7f424b6dabda12924,118d182a45bffea9fd8c6eb98453b6edc19327f6d1f2887b10700d194c275259\n</code></pre>\n<p>If the proof sequence matches the commitment list exactly and in order the client will return the verification:</p>\n<pre><code>Verified proof sequence against commitment list. \n</code></pre>\n<p>If the sequence does not match, the verification will fail.</p>\n<pre><code>Verification failed. Commitments not matched. \n</code></pre>\n<p>If all slot-proofs in the sequence proof are matched to commitments in the list in order, but there are additional commtiments included in the list, then the client will return:</p>\n<pre><code>Verification failed. Additional commitments on list not in proof.\n</code></pre>\n<p>To verify that a specified sequence proof corresponds to a chronological sequence of files in a specified directory, the additional argument <code>-d</code> is used to specify the directory path. This directory must contain the matching sequence of files, named in an alpha-numeric order corresonding to the sequence of changes. For example:</p>\n<pre><code>$ msc verify -p 0 -s 2 -d /Users/username/directory/\n</code></pre>\n<p>If the proof sequence matches the full hash chain of files in the specified directory exactly and in sequence, then the client will return the verification:</p>\n<pre><code>Verified proof sequence against directory hash chain.\n</code></pre>\n<p>The client will also return a warning if additional files have been added to the directory since the last attestation has been performed.</p>\n<pre><code>WARNING: last 1 files not attested.\nLast file attested: document-v0.5.txt\n</code></pre>\n<p>To verify that a specified sequence proof corresponds to the commit history of a Git repository, the additional argument <code>-g</code> is used to specify the directory path of the Git repository. The client also checks that the initial commit message of the repository is a staychain TxID and slot ID. For example:</p>\n<pre><code>$ msc verify -p 0 -s 2 -g /Users/username/gitrepo/\n</code></pre>\n<p>If the proof sequence matches the full hash chain of files in the specified directory exactly and in sequence, then the client will return the verification:</p>\n<pre><code>Verified proof sequence against commit history to b40a656d028618f6c1d73465c07d810078fd74e4\n</code></pre>\n<p>Where <code>b40a656d028618f6c1d73465c07d810078fd74e4</code> is the latest Git commit included in the sequence proof. If there have been additional commits to the Git repository since the latest attestation in the sequence proof, the client will return a warnings with the number of non-attested commits. For example:</p>\n<pre><code>WARNING: last 3 commits not attested.\n</code></pre>\n<p>The <code>verify -g</code> operation also verifies that the staychain base TxID in the sequence proof, and slot ID, are added as the commit message in the initial commit of the repository. If this commitment is not present, the following warning is given:</p>\n<pre><code>Staychain ID not committed to Git history\n</code></pre>\n<h3>Sidechain synchronization</h3>\n<p>The client can be used to synchronize a sidechain state against a Bitcoin staychain. This is performed using the <code>sync</code> command, and requires an RPC connection to both a full Bitcoin node (or trusted block explorer) and the sidechain node. As with the Bitcoin node connection, the sidechain node connection can also be set in the client config:</p>\n<pre><code>$ msc config -b username:password@localhost:8332  # Bitcoin node\n$ msc config -n username:password@localhost:8336  # Sidechain node\n</code></pre>\n<p>To verify that a sidechain history is unique against Bitcoin's global state, and determine the latest attested sidechain block, the full sequence proof is retrieved, fully verified and then verified against the Bitcoin staychain the the sidechain state. For example:</p>\n<pre><code>$ msc sync -s 1\n</code></pre>\n<p>If the verification is successful, the client will return the latest sidechain verified block. For example:</p>\n<pre><code>Verified sidechain attestation sequence\nLatest attestated sidechain block: 47e3d796f0ae87f2261e620018ffb1e0458175e17faf2762f209a17c727a8690 height 163188\n</code></pre>\n<h3>Key generation and authentication</h3>\n<p>The client can generate keys to be used for attestation authentication, and generate commitment signatures using the <code>keygen</code> command. To generate a 256 bit private key, the <code>-g</code> argument is used with optional supplied entropy. For example:</p>\n<pre><code>$ msc keygen -g entropy\n</code></pre>\n<p>This generated key is then saved in the config and automatically used to sign attestations sent the the Mainstay service URL. The generated hex-encoded private key can then be used to generate the corresponding secp256k1 compressed public key using the <code>-p</code> argument.</p>\n<pre><code>$ msc keygen -p c76849c6ac48c4996b2847a5b87d9ee0e9463ea11c827591a50978b1b2682804\n</code></pre>\n<p>The returned hex-encoded public key is supplied in the web form used to sign-up to the mainstay.xyz service, if signature based authentication is required.</p>\n<h3>Staychain status and information</h3>\n<p>When initializing a sidechain, Git repository or file repository, the staychain base TxID and slot position must be committed to the initial state in order to prove uniqueness. In a sidechain, this information is committed to the genesis block, and in the case of a Git repository, this information is added as the message of the initial commit. To retrieve the latest staychain TxID to perform this initialisation, the <code>info</code> command can be used.</p>\n<pre><code>$ msc info\n</code></pre>\n<p>This returns the base ID. For example:</p>\n<pre><code>Base ID: 9d049eb88c13d7c4bad6f2597417da525effebc47b2095621b8cebad7ded4cf5:2\n</code></pre>\n<p>The argument <code>-c</code> will also set this in the config.</p>\n<p>To initialise a Git repository and link it to the staychain and slot position, the initial commit will be as follows:</p>\n<pre><code>$ git commit -m '9d049eb88c13d7c4bad6f2597417da525effebc47b2095621b8cebad7ded4cf5:2'\n</code></pre>\n\n          </div>"}, "last_serial": 6430358, "releases": {"0.1.1": [{"comment_text": "", "digests": {"md5": "b0a207c5734332db37ce5326ac5fb4f8", "sha256": "4f6465cd84c72b15937ad7237a0ed2074474d6fe13722434b01b767e22f2aca7"}, "downloads": -1, "filename": "pymainstay-0.1.1.tar.gz", "has_sig": false, "md5_digest": "b0a207c5734332db37ce5326ac5fb4f8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27138, "upload_time": "2020-01-10T14:47:25", "upload_time_iso_8601": "2020-01-10T14:47:25.026809Z", "url": "https://files.pythonhosted.org/packages/00/b3/6c0ba5b320f0d711d6eaf4fec1bfb855687478cbe6e29da71614fa9e8c50/pymainstay-0.1.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "b0a207c5734332db37ce5326ac5fb4f8", "sha256": "4f6465cd84c72b15937ad7237a0ed2074474d6fe13722434b01b767e22f2aca7"}, "downloads": -1, "filename": "pymainstay-0.1.1.tar.gz", "has_sig": false, "md5_digest": "b0a207c5734332db37ce5326ac5fb4f8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27138, "upload_time": "2020-01-10T14:47:25", "upload_time_iso_8601": "2020-01-10T14:47:25.026809Z", "url": "https://files.pythonhosted.org/packages/00/b3/6c0ba5b320f0d711d6eaf4fec1bfb855687478cbe6e29da71614fa9e8c50/pymainstay-0.1.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:02:36 2020"}