{"info": {"author": "K. Aditya Mohan", "author_email": "mohan3@llnl.gov", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# PySABER\nPySABER is a python package for characterizing the X-ray source and detector blur in cone-beam X-ray imaging systems. SABER is an abbreviation for systems approach to blur estimation and reduction. Note that even parallel beam X-rays in synchrotrons are in fact cone beams albeit with a large source to object distance. X-ray images, also called radiographs, are simultaneously blurred by both the X-ray source spot blur and detector blur. This package uses a numerical optimization algorithm to disentangle and estimate both forms of blur simultaneously.The point spread function (PSF) of X-ray source blur is modeled using an exponential density function with two parameters. The first parameter is the full width half maximum (FWHM) of the PSF along the x-axis (row-wise) and second is the FWHM along the y-axis (column-axis). The PSF of detector blur is modeled as the sum of two exponential density functions, each with its own FWHM parameter, that is mixed together by a mixture (or weighting) parameter. All these parameters are then estimated using numerical optimization from normalized radiographs of a sharp edge such as a thick Tungsten plate rollbar. It is recommended to acquire radiographs of the sharp edge at two different mutually perpendicular orientations and also repeat this process at two different values of the ratio of source to object distance (SOD) and object to detector distance (ODD). Once the parameters of both source and detector blurs are estimated, this package is also useful to reduce blur in radiographs using deblurring algorithms. Currently, Wiener filtering and regularized least squares deconvolution are two deblurring algorithms that are supported for deblurring. Both these techniques use the estimated blur parameters to deblur radiographs. The paper listed in the below reference section contains more information on the theory behind this package package. If you find this package useful, please cite the paper referenced below in your publications.\n\n\n## References\nK. Aditya Mohan, Robert M. Panas, and Jefferson A. Cuadra. \"SABER: A Systems Approach to Blur Estimation and Reduction in X-ray Imaging.\" arXiv preprint arXiv:1905.03935 (2019) [pdf](https://arxiv.org/pdf/1905.03935.pdf)\n\n\n## License\nThis project is licensed under the MIT License. LLNL-CODE-766837.\n\n\n## Dependencies\n```\npython 3.*\nnumpy\npyyaml\nscipy\nscikit-image\nscikit-learn\nmatplotlib\n```\nThe python packages in the above dependency list will be installed automatically if you follow the procedure outlined in the installation section below. \n\n## Installation\n`pysaber` is installed using the python package manager pip.\nTo install `pysaber`, run the following command in a terminal, \n```bash\n    pip install pysaber\n```\nAlternatively, to install using the source code in this repository, first download this repository using the download link in the top right corner on this webpage. Or, you can also git clone this repository directly from github. In a terminal, change the current directory to the outermost folder of this downloaded repository that contains this README and run the following command -\n```bash\n    pip install .\n```\nIt is recommended to install `pysaber` within a python virtual environment.\n\n\n## Usage\nThis python package has two useful functionalities. First, it can extract the PSFs of X-ray source and detector blurs from calibration data consisting of radiographs of a sharp edge. Second, it uses the estimated PSFs to deblur radiograph of any arbitrary sample acquired at any source to object distance (SOD) and source to detector distance (SDD). It is recommended to read the paper in the above reference section before using this python package.\n### Estimate Blur PSFs\n* The steps involved in estimating blur PSFs are outlined below. The example python script [fit_blur_model.py](https://github.com/sabersw/pysaber-demo/blob/master/fit_blur_model.py) demonstrates estimation of parameters of blur PSFs from radiographs of a Tungsten sharp edge rollbar.\n    * Acquire radiographs of a straight sharp edge such as a Tungsten edge rollbar. Radiographs must be acquired at two different perpendicular orientations and at two different values of SOD/ODD.\n    * Normalize each radiograph. For each radiograph, acquire a bright field image (measurements with X-rays but no sample) and a dark field image (measurements without X-rays). Then, compute the normalized radiograph by dividing the difference between the radiograph and the dark field image with the difference between the bright field and the dark field image.\n    * Using the normalized radiographs, estimate parameters of X-ray source blur and detector blur using the function `pysaber.get_blur_params`.\n* Next, ensure that the estimated parameters are indeed a good fit for the measured data. This is done by comparing line profiles across the sharp edge between the measured radiograph and the prediction from the blur model output. The output of the blur model given parameters of source and detector blurs is given by the function `pysaber.get_trans_fit`. Carefully zoom into the region where the edge lies and verify if the predicted blur matches with the blur in the measured radiograph. The python scripts [plot_horz_fit.py](https://github.com/sabersw/pysaber-demo/blob/master/plot_horz_fit.py) and [plot_vert_fit.py](https://github.com/sabersw/pysaber-demo/blob/master/plot_vert_fit.py) show examples of such comparisons. If the fit is not tight, consider reducing the value of the input argument `convg_thresh` of the function `pysaber.get_blur_params` to obtain a better fit.\n* Lastly, save or visualize the PSF of source and detector blurs. The PSF of source blur is given by the function `pysaber.get_source_psf` and PSF of detector blur is given by `pysaber.get_detector_psf`. The example python scripts [plot_source_psf.py](https://github.com/sabersw/pysaber-demo/blob/master/plot_source_psf.py) and [plot_detector_psf.py](https://github.com/sabersw/pysaber-demo/blob/master/plot_detector_psf.py) display source and detector PSFs as images.\n### Deblur Radiographs\nOnce the parameters of source and detector PSFs are estimated, radiographs of any arbitrary sample acquired at any source to object distance (SOD) and source to detector distance (SDD) can be deblurred using various techniques. To deblur a radiograph using Wiener filtering, the function `pysaber.wiener_deblur` is used. To deblur using regularized least squares deconvolution (RLSD), use the function `pysaber.least_squares_deblur`. The python scripts [deblur_wiener.py](https://github.com/sabersw/pysaber-demo/blob/master/deblur_wiener.py) and [deblur_rlsd.py](https://github.com/sabersw/pysaber-demo/blob/master/deblur_rlsd.py) are examples that demonstrate radiograph deblur. \n\n\n## Functions\nThis section describes the various functions available in this package along with the corresponding input arguments and return values. The information in this section can also be obtained using the python help function. For example, to get help in using the function `pysaber.get_blur_params`, run the following lines in python -\n```python\nfrom pysaber import get_blur_params #Import the function get_blur_params\nhelp(get_blur_params) #To learn more about pysaber.get_blur_params\n```\n\n#### pysaber.get_blur_params\n```\nget_blur_params(norm_rads, sod, sdd, pix_wid, convg_thresh=1e-06, bdary_mask_perc=5, pad_factor=[3, 3], mask=None, edge_type=None)\n    Estimate parameters of point spread functions (PSF) that model X-ray source blur and detector blur from normalized radiographs of a straight sharp edge or two mutually perpendicular sharp edges. \n\n    This function is used to estimate parameters of the PSFs that model X-ray source blur and detector blur. It takes as input the normalized radiographs at multiple source to object distances (SOD) and source to detector distances (SDD). If each radiograph has a single straight edge, then the measurement must be repeated for two different, preferably perpendicular, orientations of the edge. Currently, only a single straight edge in a radiograph is verified to work. The case of perpendicular edges in a radiograph will be supported soon. For more details, please refer to the document listed in the references.  \n    Parameters:\n        norm_rads (list): Python list of normalized radiographs, each of type numpy.ndarray, at various SODs and SDDs.\n        sod (list): List of source to object distances (SOD), each of type float, at which each normalized radiograph in the list norm_rads was acquired.  \n        sdd (list): List of source to detector distances (SDD), each of type float, at which each normalized radiograph in the list norm_rads was acquired.\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        convg_thresh (float): Convergence threshold for the minimizer in the last final step when estimating source, detector, and transmission parameters. The convergence threshold for the minimizer during the first two initialization steps is ten times this value. The iterations stop when the ratio of the reduction in the error function (cost value) and the magnitude of the error function is lower than convg_thresh. This is the parameter ftol that is specified in the options parameter of scipy.optimize.minimize. The optimizer used is L-BFGS-B.\n        bdary_mask_perc (float): Percentage of image region in the normalized radiographs that must be excluded from blur estimation. Pixels are excluded (or masked) beginning from the outermost periphery of the image and working inwards until the specified percentage of pixels is reached.\n        pad_factor (list): Pad factor is a list of two integers that determine the amount of padding that must be applied to the radiographs to reduce aliasing during convolution. The number of rows/columns after padding is equal to pad_factor[0]/pad_factor[1] times the number of rows/columns in each normalized radiograph before padding. For example, if the first element in pad_factor is 2, then the radiograph is padded to twice its size along the first dimension.  \n        mask (numpy.ndarray): Boolean mask of the same shape as the radiograph that is used to exclude pixels from blur estimation. An example use case is if some pixels in the radiographs are bad, then those pixels can be excluded from blur estimation by setting the corresponding entries in mask to false and true otherwise.\n        edge_type (str): Used to indicate whether there is a single straight edge or two mutually perpendicular edges in each radiograph. If edge_type is perpendicular, then each radiograph is assumed to have two mutually perpendicular edges and a single straight edge otherwise. Currently, choosing perpendicular as edge_type is not recommended since it isn't a verified functionality and may lead to unstable behavior.  \n\n    Returns:\n        dict: Estimated parameters of X-ray source PSF that is returned as a python dictionary. It consists of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the plane of the detector). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the exponential PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        dict: Estimated parameters of detector PSF that is returned as a python dictionary. It consists of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's PSF. The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n        list: Estimated parameters of the transmission function for each input radiograph. This return value is a list of lists, where each inner nested list consists of two parameters of type float. These float values give the low and high values respectively of the transmission function. The number of nested lists in the returned list equals the number of input radiographs. Note that the transmission function is the normalized radiograph image that would have resulted in the absence of blur and noise.\n```\n\n#### pysaber.get_trans_fit\n```\nget_trans_fit(norm_rad, sod, sdd, pix_wid, src_params, det_params, trans_params, pad_factor=[3, 3], edge_type=None)\n    For a measured radiograph consisting of a straight sharp edge or two mutually perpendicular edges, get the ideal transmission function and a prediction from the blur model for the normalized radiograph in the presence of X-ray source and detector blurs. \n\n    Parameters:\n        norm_rad (numpy.ndarray): Normalized radiograph\n        sod (float): Source to object distance (SOD) for the radiograph norm_rad.\n        sdd (float): Source to detector distance (SDD) for the radiograph norm_rad.\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        src_params (dict): Estimated parameters of X-ray source PSF. It should consist of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the detector plane). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the source blur PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        det_params (dict): Estimated parameters of detector blur PSF. It should consist of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's point spread function (PSF). The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n        trans_params (list): A two element integer list of transmission function parameters. The first element is the low value and the second element is the high value of the transmission function. Note that the transmission func\n        pad_factor (list): Pad factor is a list of two integers that determine the amount of padding that must be applied to the radiographs to reduce aliasing during convolution. The number of rows/columns after padding is equal to pad_factor[0]/pad_factor[1] times the number of rows/columns in each normalized radiograph before padding. For example, if the first element in pad_factor is 2, then the radiograph is padded to twice its size along the first dimension.  \n        edge_type (str): Used to indicate whether there is a single straight edge or two mutually perpendicular edges in each radiograph. If edge_type is perpendicular, then each radiograph is assumed to have two mutually perpendicular edges and a single straight edge otherwise. Currently, choosing perpendicular as edge_type is not recommended since it isn't a verified functionality and may lead to unstable behavior.\n```\n\n#### pysaber.get_source_psf\n```\nget_source_psf(pix_wid, src_params, sod=1, sdd=2)\n    Get point spread function (PSF) of X-ray source blur.\n\n    Parameters:\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        src_params (dict): Estimated parameters of X-ray source PSF. It should consist of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the detector plane). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the source blur PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        sod (float): Source to object distance (SOD) is necessary to compute PSF of source blur in the plane of the detector. Use the default value to compute source PSF at the plane of the X-ray source. Or, if sdd = 2*sod, then source blur PSF at the detector is same as the source blur PSF at the plane of the X-ray source. \n        sdd (float): Source to detector distance (SDD) is necessary to compute PSF of source blur in the plane of the detector. Use the default value to compute source PSF at the plane of the X-ray source. Or, if sdd = 2*sod, then source blur PSF at the detector is same as the source blur PSF at the plane of the X-ray source.\n\n    Returns:\n        numpy.ndarray: 2D array of source blur PSF\n```\n\n#### pysaber.get_detector_psf\n```\nget_detector_psf(pix_wid, det_params)\n    Get point spread function (PSF) of detector blur\n\n    Parameters:\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        det_params (dict): Estimated parameters of detector blur PSF. It should consist of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's point spread function (PSF). The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n\n    Returns:\n        numpy.ndarray: 2D array of detector blur PSF\n```\n\n#### pysaber.get_effective_psf\n```\nget_effective_psf(pix_wid, src_params, det_params, sod=1, sdd=2)\n    Get point spread function (PSF) of the combined effect of X-ray source and detector blur.\n\n    Parameters:\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        src_params (dict): Estimated parameters of X-ray source PSF. It should consist of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the detector plane). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the source blur PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        det_params (dict): Estimated parameters of detector blur PSF. It should consist of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's point spread function (PSF). The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n        sod (float): Source to object distance (SOD) is necessary to compute PSF of source blur in the plane of the detector. Use the default value to compute source PSF at the plane of the X-ray source. Or, if sdd = 2*sod, then source blur PSF at the detector is same as the source blur PSF at the plane of the X-ray source. \n        sdd (float): Source to detector distance (SDD) is necessary to compute PSF of source blur in the plane of the detector. Use the default value to compute source PSF at the plane of the X-ray source. Or, if sdd = 2*sod, then source blur PSF at the detector is same as the source blur PSF at the plane of the X-ray source.\n\n    Returns:\n        numpy.ndarray: 2D array of effective blur PSF\n```\n\n#### pysaber.wiener_deblur\n```\nwiener_deblur(norm_rad, sod, sdd, pix_wid, src_params, det_params, reg_param)\n    Function to reduce blur (deblur) in a radiograph using Wiener filtering.     \n\n    Parameters:\n        norm_rad (numpy.ndarray): Normalized radiograph to deblur\n        sod (float): Source to object distance (SOD) of the radiograph\n        sdd (float): Source to detector distance (SDD) of the radiograph\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        src_params (dict): Estimated parameters of X-ray source PSF. It should consist of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the detector plane). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the source blur PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        det_params (dict): Estimated parameters of detector blur PSF. It should consist of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's point spread function (PSF). The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n        reg_param (float): Regularization parameter for Wiener filtering deblurring algorithm. Noise and ringing artifacts in the deblurred radiograph decreases with increasing values for reg_param and vice versa. But, note that increasing reg_param can also result in excessive blurring due to over-regulization. It is recommended to empirically choose this parameter by increasing or decreasing it by a factor, greater than one (such as 2 or 10), until the desired image quality is achieved.\n\n    Returns:\n        numpy.ndarray: Deblurred radiograph using a Wiener filter.\n```\n\n#### pysaber.least_squares_deblur\n```\nleast_squares_deblur(norm_rad, sod, sdd, pix_wid, src_params, det_params, reg_param, init_rad=None, weights=None, convg_thresh=0.01)\n    Function to reduce blur (deblur) in radiographs using a regularized least squares iterative algorithm.     \n\n    Parameters:\n        norm_rad (numpy.ndarray): Normalized radiograph to deblur\n        sod (float): Source to object distance (SOD) of the radiograph\n        sdd (float): Source to detector distance (SDD) of the radiograph\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        src_params (dict): Estimated parameters of X-ray source PSF. It should consist of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the detector plane). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the source blur PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        det_params (dict): Estimated parameters of detector blur PSF. It should consist of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's point spread function (PSF). The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n        reg_param (float): Regularization parameter for the least squares deblurring algorithm. Noise and ringing artifacts in the deblurred radiograph decreases with increasing values for reg_param and vice versa. But, note that increasing reg_param can also result in excessive blurring due to over-regulization. It is recommended to empirically choose this parameter by increasing or decreasing it by a factor, greater than one (such as 2 or 10), until the desired image quality is achieved.\n        init_rad (numpy.ndarray): Initial estimate for the deblurred radiograph. If set to None, then the blurred radiograph is used as an initial estimate. If not None, then init_rad must be a numpy.ndarray of the same shape as norm_rad. \n        weights (numpy.ndarray): Used to increase or decrease reliance on a particular pixel of norm_rad in the forward model cost function. If set to None, every pixel is assigned the same weight of 1.\n        convg_thresh (float): Convergence threshold for the minimizer used to deblur the input radiograph. The iterations stop when the ratio of the reduction in the error function (cost value) and the magnitude of the error function is lower than convg_thresh. This is the parameter ftol that is specified in the options parameter of scipy.optimize.minimize. The optimizer used is L-BFGS-B.\n\n    Returns:\n        numpy.ndarray: Deblurred radiograph using regularized least squares algorithm.\n```\n\n## Authors\n* [K. Aditya Mohan](https://github.com/adityamnk)\n\n\n## Acknowledgements\nThe following people contributed to the theoretical formulation and experimental validation of SABER -\n* Robert M. Panas\n* Jefferson A. Cuadra\n\n\n## Bug Reports & Feedback\nThis software is under development and may have bugs. If you run into any problems, please raise a issue on github. There is a lot of scope to improve the performance and functionality of this python package. Furthermore, since this package solves a non-convex optimization problem, there is a remote possibility that the final solution may be a local optima that does not properly fit the data. If there is sufficient interest, I will invest time to significantly reduce the run time, improve convergence and usability, and add additional features and functionalities.\n\n\n## Contributing\nTBA\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/sabersw", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "pysaber", "package_url": "https://pypi.org/project/pysaber/", "platform": "", "project_url": "https://pypi.org/project/pysaber/", "project_urls": {"Homepage": "https://github.com/sabersw"}, "release_url": "https://pypi.org/project/pysaber/0.1.5/", "requires_dist": ["numpy", "pyyaml", "scipy", "scikit-image", "scikit-learn", "matplotlib"], "requires_python": "", "summary": "Python package that implements a systems approach to blur estimation and reduction (SABER)", "version": "0.1.5", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>PySABER</h1>\n<p>PySABER is a python package for characterizing the X-ray source and detector blur in cone-beam X-ray imaging systems. SABER is an abbreviation for systems approach to blur estimation and reduction. Note that even parallel beam X-rays in synchrotrons are in fact cone beams albeit with a large source to object distance. X-ray images, also called radiographs, are simultaneously blurred by both the X-ray source spot blur and detector blur. This package uses a numerical optimization algorithm to disentangle and estimate both forms of blur simultaneously.The point spread function (PSF) of X-ray source blur is modeled using an exponential density function with two parameters. The first parameter is the full width half maximum (FWHM) of the PSF along the x-axis (row-wise) and second is the FWHM along the y-axis (column-axis). The PSF of detector blur is modeled as the sum of two exponential density functions, each with its own FWHM parameter, that is mixed together by a mixture (or weighting) parameter. All these parameters are then estimated using numerical optimization from normalized radiographs of a sharp edge such as a thick Tungsten plate rollbar. It is recommended to acquire radiographs of the sharp edge at two different mutually perpendicular orientations and also repeat this process at two different values of the ratio of source to object distance (SOD) and object to detector distance (ODD). Once the parameters of both source and detector blurs are estimated, this package is also useful to reduce blur in radiographs using deblurring algorithms. Currently, Wiener filtering and regularized least squares deconvolution are two deblurring algorithms that are supported for deblurring. Both these techniques use the estimated blur parameters to deblur radiographs. The paper listed in the below reference section contains more information on the theory behind this package package. If you find this package useful, please cite the paper referenced below in your publications.</p>\n<h2>References</h2>\n<p>K. Aditya Mohan, Robert M. Panas, and Jefferson A. Cuadra. \"SABER: A Systems Approach to Blur Estimation and Reduction in X-ray Imaging.\" arXiv preprint arXiv:1905.03935 (2019) <a href=\"https://arxiv.org/pdf/1905.03935.pdf\" rel=\"nofollow\">pdf</a></p>\n<h2>License</h2>\n<p>This project is licensed under the MIT License. LLNL-CODE-766837.</p>\n<h2>Dependencies</h2>\n<pre><code>python 3.*\nnumpy\npyyaml\nscipy\nscikit-image\nscikit-learn\nmatplotlib\n</code></pre>\n<p>The python packages in the above dependency list will be installed automatically if you follow the procedure outlined in the installation section below.</p>\n<h2>Installation</h2>\n<p><code>pysaber</code> is installed using the python package manager pip.\nTo install <code>pysaber</code>, run the following command in a terminal,</p>\n<pre>    pip install pysaber\n</pre>\n<p>Alternatively, to install using the source code in this repository, first download this repository using the download link in the top right corner on this webpage. Or, you can also git clone this repository directly from github. In a terminal, change the current directory to the outermost folder of this downloaded repository that contains this README and run the following command -</p>\n<pre>    pip install .\n</pre>\n<p>It is recommended to install <code>pysaber</code> within a python virtual environment.</p>\n<h2>Usage</h2>\n<p>This python package has two useful functionalities. First, it can extract the PSFs of X-ray source and detector blurs from calibration data consisting of radiographs of a sharp edge. Second, it uses the estimated PSFs to deblur radiograph of any arbitrary sample acquired at any source to object distance (SOD) and source to detector distance (SDD). It is recommended to read the paper in the above reference section before using this python package.</p>\n<h3>Estimate Blur PSFs</h3>\n<ul>\n<li>The steps involved in estimating blur PSFs are outlined below. The example python script <a href=\"https://github.com/sabersw/pysaber-demo/blob/master/fit_blur_model.py\" rel=\"nofollow\">fit_blur_model.py</a> demonstrates estimation of parameters of blur PSFs from radiographs of a Tungsten sharp edge rollbar.\n<ul>\n<li>Acquire radiographs of a straight sharp edge such as a Tungsten edge rollbar. Radiographs must be acquired at two different perpendicular orientations and at two different values of SOD/ODD.</li>\n<li>Normalize each radiograph. For each radiograph, acquire a bright field image (measurements with X-rays but no sample) and a dark field image (measurements without X-rays). Then, compute the normalized radiograph by dividing the difference between the radiograph and the dark field image with the difference between the bright field and the dark field image.</li>\n<li>Using the normalized radiographs, estimate parameters of X-ray source blur and detector blur using the function <code>pysaber.get_blur_params</code>.</li>\n</ul>\n</li>\n<li>Next, ensure that the estimated parameters are indeed a good fit for the measured data. This is done by comparing line profiles across the sharp edge between the measured radiograph and the prediction from the blur model output. The output of the blur model given parameters of source and detector blurs is given by the function <code>pysaber.get_trans_fit</code>. Carefully zoom into the region where the edge lies and verify if the predicted blur matches with the blur in the measured radiograph. The python scripts <a href=\"https://github.com/sabersw/pysaber-demo/blob/master/plot_horz_fit.py\" rel=\"nofollow\">plot_horz_fit.py</a> and <a href=\"https://github.com/sabersw/pysaber-demo/blob/master/plot_vert_fit.py\" rel=\"nofollow\">plot_vert_fit.py</a> show examples of such comparisons. If the fit is not tight, consider reducing the value of the input argument <code>convg_thresh</code> of the function <code>pysaber.get_blur_params</code> to obtain a better fit.</li>\n<li>Lastly, save or visualize the PSF of source and detector blurs. The PSF of source blur is given by the function <code>pysaber.get_source_psf</code> and PSF of detector blur is given by <code>pysaber.get_detector_psf</code>. The example python scripts <a href=\"https://github.com/sabersw/pysaber-demo/blob/master/plot_source_psf.py\" rel=\"nofollow\">plot_source_psf.py</a> and <a href=\"https://github.com/sabersw/pysaber-demo/blob/master/plot_detector_psf.py\" rel=\"nofollow\">plot_detector_psf.py</a> display source and detector PSFs as images.</li>\n</ul>\n<h3>Deblur Radiographs</h3>\n<p>Once the parameters of source and detector PSFs are estimated, radiographs of any arbitrary sample acquired at any source to object distance (SOD) and source to detector distance (SDD) can be deblurred using various techniques. To deblur a radiograph using Wiener filtering, the function <code>pysaber.wiener_deblur</code> is used. To deblur using regularized least squares deconvolution (RLSD), use the function <code>pysaber.least_squares_deblur</code>. The python scripts <a href=\"https://github.com/sabersw/pysaber-demo/blob/master/deblur_wiener.py\" rel=\"nofollow\">deblur_wiener.py</a> and <a href=\"https://github.com/sabersw/pysaber-demo/blob/master/deblur_rlsd.py\" rel=\"nofollow\">deblur_rlsd.py</a> are examples that demonstrate radiograph deblur.</p>\n<h2>Functions</h2>\n<p>This section describes the various functions available in this package along with the corresponding input arguments and return values. The information in this section can also be obtained using the python help function. For example, to get help in using the function <code>pysaber.get_blur_params</code>, run the following lines in python -</p>\n<pre><span class=\"kn\">from</span> <span class=\"nn\">pysaber</span> <span class=\"kn\">import</span> <span class=\"n\">get_blur_params</span> <span class=\"c1\">#Import the function get_blur_params</span>\n<span class=\"n\">help</span><span class=\"p\">(</span><span class=\"n\">get_blur_params</span><span class=\"p\">)</span> <span class=\"c1\">#To learn more about pysaber.get_blur_params</span>\n</pre>\n<h4>pysaber.get_blur_params</h4>\n<pre><code>get_blur_params(norm_rads, sod, sdd, pix_wid, convg_thresh=1e-06, bdary_mask_perc=5, pad_factor=[3, 3], mask=None, edge_type=None)\n    Estimate parameters of point spread functions (PSF) that model X-ray source blur and detector blur from normalized radiographs of a straight sharp edge or two mutually perpendicular sharp edges. \n\n    This function is used to estimate parameters of the PSFs that model X-ray source blur and detector blur. It takes as input the normalized radiographs at multiple source to object distances (SOD) and source to detector distances (SDD). If each radiograph has a single straight edge, then the measurement must be repeated for two different, preferably perpendicular, orientations of the edge. Currently, only a single straight edge in a radiograph is verified to work. The case of perpendicular edges in a radiograph will be supported soon. For more details, please refer to the document listed in the references.  \n    Parameters:\n        norm_rads (list): Python list of normalized radiographs, each of type numpy.ndarray, at various SODs and SDDs.\n        sod (list): List of source to object distances (SOD), each of type float, at which each normalized radiograph in the list norm_rads was acquired.  \n        sdd (list): List of source to detector distances (SDD), each of type float, at which each normalized radiograph in the list norm_rads was acquired.\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        convg_thresh (float): Convergence threshold for the minimizer in the last final step when estimating source, detector, and transmission parameters. The convergence threshold for the minimizer during the first two initialization steps is ten times this value. The iterations stop when the ratio of the reduction in the error function (cost value) and the magnitude of the error function is lower than convg_thresh. This is the parameter ftol that is specified in the options parameter of scipy.optimize.minimize. The optimizer used is L-BFGS-B.\n        bdary_mask_perc (float): Percentage of image region in the normalized radiographs that must be excluded from blur estimation. Pixels are excluded (or masked) beginning from the outermost periphery of the image and working inwards until the specified percentage of pixels is reached.\n        pad_factor (list): Pad factor is a list of two integers that determine the amount of padding that must be applied to the radiographs to reduce aliasing during convolution. The number of rows/columns after padding is equal to pad_factor[0]/pad_factor[1] times the number of rows/columns in each normalized radiograph before padding. For example, if the first element in pad_factor is 2, then the radiograph is padded to twice its size along the first dimension.  \n        mask (numpy.ndarray): Boolean mask of the same shape as the radiograph that is used to exclude pixels from blur estimation. An example use case is if some pixels in the radiographs are bad, then those pixels can be excluded from blur estimation by setting the corresponding entries in mask to false and true otherwise.\n        edge_type (str): Used to indicate whether there is a single straight edge or two mutually perpendicular edges in each radiograph. If edge_type is perpendicular, then each radiograph is assumed to have two mutually perpendicular edges and a single straight edge otherwise. Currently, choosing perpendicular as edge_type is not recommended since it isn't a verified functionality and may lead to unstable behavior.  \n\n    Returns:\n        dict: Estimated parameters of X-ray source PSF that is returned as a python dictionary. It consists of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the plane of the detector). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the exponential PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        dict: Estimated parameters of detector PSF that is returned as a python dictionary. It consists of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's PSF. The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n        list: Estimated parameters of the transmission function for each input radiograph. This return value is a list of lists, where each inner nested list consists of two parameters of type float. These float values give the low and high values respectively of the transmission function. The number of nested lists in the returned list equals the number of input radiographs. Note that the transmission function is the normalized radiograph image that would have resulted in the absence of blur and noise.\n</code></pre>\n<h4>pysaber.get_trans_fit</h4>\n<pre><code>get_trans_fit(norm_rad, sod, sdd, pix_wid, src_params, det_params, trans_params, pad_factor=[3, 3], edge_type=None)\n    For a measured radiograph consisting of a straight sharp edge or two mutually perpendicular edges, get the ideal transmission function and a prediction from the blur model for the normalized radiograph in the presence of X-ray source and detector blurs. \n\n    Parameters:\n        norm_rad (numpy.ndarray): Normalized radiograph\n        sod (float): Source to object distance (SOD) for the radiograph norm_rad.\n        sdd (float): Source to detector distance (SDD) for the radiograph norm_rad.\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        src_params (dict): Estimated parameters of X-ray source PSF. It should consist of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the detector plane). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the source blur PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        det_params (dict): Estimated parameters of detector blur PSF. It should consist of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's point spread function (PSF). The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n        trans_params (list): A two element integer list of transmission function parameters. The first element is the low value and the second element is the high value of the transmission function. Note that the transmission func\n        pad_factor (list): Pad factor is a list of two integers that determine the amount of padding that must be applied to the radiographs to reduce aliasing during convolution. The number of rows/columns after padding is equal to pad_factor[0]/pad_factor[1] times the number of rows/columns in each normalized radiograph before padding. For example, if the first element in pad_factor is 2, then the radiograph is padded to twice its size along the first dimension.  \n        edge_type (str): Used to indicate whether there is a single straight edge or two mutually perpendicular edges in each radiograph. If edge_type is perpendicular, then each radiograph is assumed to have two mutually perpendicular edges and a single straight edge otherwise. Currently, choosing perpendicular as edge_type is not recommended since it isn't a verified functionality and may lead to unstable behavior.\n</code></pre>\n<h4>pysaber.get_source_psf</h4>\n<pre><code>get_source_psf(pix_wid, src_params, sod=1, sdd=2)\n    Get point spread function (PSF) of X-ray source blur.\n\n    Parameters:\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        src_params (dict): Estimated parameters of X-ray source PSF. It should consist of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the detector plane). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the source blur PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        sod (float): Source to object distance (SOD) is necessary to compute PSF of source blur in the plane of the detector. Use the default value to compute source PSF at the plane of the X-ray source. Or, if sdd = 2*sod, then source blur PSF at the detector is same as the source blur PSF at the plane of the X-ray source. \n        sdd (float): Source to detector distance (SDD) is necessary to compute PSF of source blur in the plane of the detector. Use the default value to compute source PSF at the plane of the X-ray source. Or, if sdd = 2*sod, then source blur PSF at the detector is same as the source blur PSF at the plane of the X-ray source.\n\n    Returns:\n        numpy.ndarray: 2D array of source blur PSF\n</code></pre>\n<h4>pysaber.get_detector_psf</h4>\n<pre><code>get_detector_psf(pix_wid, det_params)\n    Get point spread function (PSF) of detector blur\n\n    Parameters:\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        det_params (dict): Estimated parameters of detector blur PSF. It should consist of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's point spread function (PSF). The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n\n    Returns:\n        numpy.ndarray: 2D array of detector blur PSF\n</code></pre>\n<h4>pysaber.get_effective_psf</h4>\n<pre><code>get_effective_psf(pix_wid, src_params, det_params, sod=1, sdd=2)\n    Get point spread function (PSF) of the combined effect of X-ray source and detector blur.\n\n    Parameters:\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        src_params (dict): Estimated parameters of X-ray source PSF. It should consist of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the detector plane). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the source blur PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        det_params (dict): Estimated parameters of detector blur PSF. It should consist of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's point spread function (PSF). The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n        sod (float): Source to object distance (SOD) is necessary to compute PSF of source blur in the plane of the detector. Use the default value to compute source PSF at the plane of the X-ray source. Or, if sdd = 2*sod, then source blur PSF at the detector is same as the source blur PSF at the plane of the X-ray source. \n        sdd (float): Source to detector distance (SDD) is necessary to compute PSF of source blur in the plane of the detector. Use the default value to compute source PSF at the plane of the X-ray source. Or, if sdd = 2*sod, then source blur PSF at the detector is same as the source blur PSF at the plane of the X-ray source.\n\n    Returns:\n        numpy.ndarray: 2D array of effective blur PSF\n</code></pre>\n<h4>pysaber.wiener_deblur</h4>\n<pre><code>wiener_deblur(norm_rad, sod, sdd, pix_wid, src_params, det_params, reg_param)\n    Function to reduce blur (deblur) in a radiograph using Wiener filtering.     \n\n    Parameters:\n        norm_rad (numpy.ndarray): Normalized radiograph to deblur\n        sod (float): Source to object distance (SOD) of the radiograph\n        sdd (float): Source to detector distance (SDD) of the radiograph\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        src_params (dict): Estimated parameters of X-ray source PSF. It should consist of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the detector plane). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the source blur PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        det_params (dict): Estimated parameters of detector blur PSF. It should consist of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's point spread function (PSF). The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n        reg_param (float): Regularization parameter for Wiener filtering deblurring algorithm. Noise and ringing artifacts in the deblurred radiograph decreases with increasing values for reg_param and vice versa. But, note that increasing reg_param can also result in excessive blurring due to over-regulization. It is recommended to empirically choose this parameter by increasing or decreasing it by a factor, greater than one (such as 2 or 10), until the desired image quality is achieved.\n\n    Returns:\n        numpy.ndarray: Deblurred radiograph using a Wiener filter.\n</code></pre>\n<h4>pysaber.least_squares_deblur</h4>\n<pre><code>least_squares_deblur(norm_rad, sod, sdd, pix_wid, src_params, det_params, reg_param, init_rad=None, weights=None, convg_thresh=0.01)\n    Function to reduce blur (deblur) in radiographs using a regularized least squares iterative algorithm.     \n\n    Parameters:\n        norm_rad (numpy.ndarray): Normalized radiograph to deblur\n        sod (float): Source to object distance (SOD) of the radiograph\n        sdd (float): Source to detector distance (SDD) of the radiograph\n        pix_wid (float): Effective width of each detector pixel. Note that this is the effective pixel size given by dividing the physical width of each detector pixel by the zoom factor of the optical lens.\n        src_params (dict): Estimated parameters of X-ray source PSF. It should consist of several key-value pairs. The value for key source_FWHM_x_axis is the full width half maximum (FWHM) of the source PSF along the x-axis (i.e., second array dimension). The value for key source_FWHM_y_axis is the FWHM of source PSF along the y-axis (i.e., first array dimension). All FWHMs are for the source PSF in the plane of the X-ray source (and not the detector plane). The value for key cutoff_FWHM_multiplier decides the non-zero spatial extent of the source blur PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of cutoff_FWHM_multiplier times half the maximum FWHM (maximum of source_FWHM_x_axis and source_FWHM_y_axis).\n        det_params (dict): Estimated parameters of detector blur PSF. It should consist of several key-value pairs. The value for key detector_FWHM_1 is the FWHM of the first exponential in the mixture density model for detector blur. The first exponential is the most dominant part of detector blur. The value for key detector_FWHM_2 is the FWHM of the second exponential in the mixture density model. This exponential has the largest FWHM and models the long running tails of the detector blur's point spread function (PSF). The value for key detector_weight_1 is between 0 and 1 and is an approximate measure of the amount of contribution of the first exponential to the detector blur. The values for keys cutoff_FWHM_1_multiplier and cutoff_FWHM_2_multiplier decide the non-zero spatial extent of the detector PSF. The PSF is clipped to zero beginning at a distance, as measured from the PSF's origin, of the maximum of cutoff_FWHM_1_multiplier*detector_FWHM_1/2 and cutoff_FWHM_2_multiplier*detector_FWHM_2/2.\n        reg_param (float): Regularization parameter for the least squares deblurring algorithm. Noise and ringing artifacts in the deblurred radiograph decreases with increasing values for reg_param and vice versa. But, note that increasing reg_param can also result in excessive blurring due to over-regulization. It is recommended to empirically choose this parameter by increasing or decreasing it by a factor, greater than one (such as 2 or 10), until the desired image quality is achieved.\n        init_rad (numpy.ndarray): Initial estimate for the deblurred radiograph. If set to None, then the blurred radiograph is used as an initial estimate. If not None, then init_rad must be a numpy.ndarray of the same shape as norm_rad. \n        weights (numpy.ndarray): Used to increase or decrease reliance on a particular pixel of norm_rad in the forward model cost function. If set to None, every pixel is assigned the same weight of 1.\n        convg_thresh (float): Convergence threshold for the minimizer used to deblur the input radiograph. The iterations stop when the ratio of the reduction in the error function (cost value) and the magnitude of the error function is lower than convg_thresh. This is the parameter ftol that is specified in the options parameter of scipy.optimize.minimize. The optimizer used is L-BFGS-B.\n\n    Returns:\n        numpy.ndarray: Deblurred radiograph using regularized least squares algorithm.\n</code></pre>\n<h2>Authors</h2>\n<ul>\n<li><a href=\"https://github.com/adityamnk\" rel=\"nofollow\">K. Aditya Mohan</a></li>\n</ul>\n<h2>Acknowledgements</h2>\n<p>The following people contributed to the theoretical formulation and experimental validation of SABER -</p>\n<ul>\n<li>Robert M. Panas</li>\n<li>Jefferson A. Cuadra</li>\n</ul>\n<h2>Bug Reports &amp; Feedback</h2>\n<p>This software is under development and may have bugs. If you run into any problems, please raise a issue on github. There is a lot of scope to improve the performance and functionality of this python package. Furthermore, since this package solves a non-convex optimization problem, there is a remote possibility that the final solution may be a local optima that does not properly fit the data. If there is sufficient interest, I will invest time to significantly reduce the run time, improve convergence and usability, and add additional features and functionalities.</p>\n<h2>Contributing</h2>\n<p>TBA</p>\n\n          </div>"}, "last_serial": 5663022, "releases": {"0.1.5": [{"comment_text": "", "digests": {"md5": "fddd55d37215183f1b05a5946deeee07", "sha256": "794045ded6b43c32a7550b5f25b040e424eaaa7474e671b98d8454dc1d425425"}, "downloads": -1, "filename": "pysaber-0.1.5-py3-none-any.whl", "has_sig": false, "md5_digest": "fddd55d37215183f1b05a5946deeee07", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 30147, "upload_time": "2019-08-11T19:06:54", "upload_time_iso_8601": "2019-08-11T19:06:54.511344Z", "url": "https://files.pythonhosted.org/packages/c7/68/939fa6f97609ab09606ddd561253defc92d16d2096692d4f9f6f9353c188/pysaber-0.1.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b7bcf9fe13890ec2a53894ea97ee7e37", "sha256": "15e8bf4498adc0a51304764be83b5aa94ecdd6e017b752a4d1fae8a59dd47d79"}, "downloads": -1, "filename": "pysaber-0.1.5.tar.gz", "has_sig": false, "md5_digest": "b7bcf9fe13890ec2a53894ea97ee7e37", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 32949, "upload_time": "2019-08-11T19:06:55", "upload_time_iso_8601": "2019-08-11T19:06:55.940867Z", "url": "https://files.pythonhosted.org/packages/5f/6c/59bdacfe78364107fd80f0ff393889937a5b508f5389ab877afc2f3f5a74/pysaber-0.1.5.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "fddd55d37215183f1b05a5946deeee07", "sha256": "794045ded6b43c32a7550b5f25b040e424eaaa7474e671b98d8454dc1d425425"}, "downloads": -1, "filename": "pysaber-0.1.5-py3-none-any.whl", "has_sig": false, "md5_digest": "fddd55d37215183f1b05a5946deeee07", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 30147, "upload_time": "2019-08-11T19:06:54", "upload_time_iso_8601": "2019-08-11T19:06:54.511344Z", "url": "https://files.pythonhosted.org/packages/c7/68/939fa6f97609ab09606ddd561253defc92d16d2096692d4f9f6f9353c188/pysaber-0.1.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b7bcf9fe13890ec2a53894ea97ee7e37", "sha256": "15e8bf4498adc0a51304764be83b5aa94ecdd6e017b752a4d1fae8a59dd47d79"}, "downloads": -1, "filename": "pysaber-0.1.5.tar.gz", "has_sig": false, "md5_digest": "b7bcf9fe13890ec2a53894ea97ee7e37", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 32949, "upload_time": "2019-08-11T19:06:55", "upload_time_iso_8601": "2019-08-11T19:06:55.940867Z", "url": "https://files.pythonhosted.org/packages/5f/6c/59bdacfe78364107fd80f0ff393889937a5b508f5389ab877afc2f3f5a74/pysaber-0.1.5.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:57:27 2020"}