{"info": {"author": "Abhijit Mahabal", "author_email": "pyseqsee@googlegroups.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Intended Audience :: Developers", "License :: OSI Approved :: GNU General Public License v3 (GPLv3)", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 3.1"], "description": "PySeqsee: A python framework for solving complex problems not amenable to brute force.\n======================================================================================\n\nPySeqsee aims to be a robust framework for developing blackboard-architecture\nbased programs that tackle hard problems in a human-like way.\n\nIt is open-source, under GNU GPLv3.\n\nMailing List:\n  - https://groups.google.com/forum/#!forum/pyseqsee (to view)\n  - pyseqsee@googlegroups.com (to post)\nDocumentation: http://amahabal.github.com/PySeqsee/\nSource Code: https://github.com/amahabal/PySeqsee\nBug Tracker: https://github.com/amahabal/PySeqsee/issues\nDevelopment Status: Alpha, but actively-developed working code\n\nBrief history and motivation\n-----------------------------\n\nFor over two decades now, Douglas Hofstadter's Fluid Analogies Research\nGroup at Indiana University has designed computer simulations aimed\nat understanding human cognition.  Each successive model has usually been\nwritten from scratch.  Very little of the actual code from previous\nimplementations was used by subsequent implementations, although ideas\nand the basic approach survived.\n\nNot just were the implementations different, they were typically in\ndifferent languages.  Franz Lisp, Chez Scheme, C++, and even Perl have\nbeen used by various projects, and there was also talk of using Delphi.  A Java\nport of Copycat exists.\n\nThis project aims to create a framework in which to implement various\ncognitive architectures.  It is written in Python 3, and aims to provide\nmany components out of the box without making too many irreversible\ncommitments.  That is, it provides a full suite of tools to get the job\ndone, but also allows you to swap out any component and use the rest.\n\nServices provided (and their level of completion):\n-----------------------------------------------------\n\n* A reusable GUI. Every project will have a different workspace, but there is\n  still much that is shared. PySeqsee allows you to just write the visualization\n  for your data, and takes care of everything else. (complete)\n* A robust testing framework. If you wish to test how well a proposed new feature\n  works, you can run a side-by-side comparison over many inputs and see the stats.\n  All that is needed is a file with the inputs to test and in case the input is\n  very specialized, a python class to convert these inputs to flags to be passed in.\n  (status: functionality implemented, but statistical analysis to compare which\n   of the two sides is better is not done).\n* A setup script that creates the skeleton of a new project. (Under development,\n  basic functionality exists).\n* A coderack and facilities for writing codelets (complete).\n* A slipnet (known here as Long-term Memory), along with the ability to add nodes\n  and edges and the ability to save it to disk (works, but could be significantly\n  improved).\n* A stream of thought. This is a component that first appeared in Seqsee (written\n  in Perl), but plays a central role here. The stream provides a temporal context\n  --- that is, recent thoughts can influence what the system does in flexible ways.\n  A full implementation exists.\n* A full reimplementation of Seqsee (status: under development. Many sequences\n  seen, but not all that the perl version did). A short video of the Perl version\n  can be found here: http://www.youtube.com/watch?v=2KWtRUg8kL8. The dissertation\n  is here: http://www.amahabal.com/files/Seqsee--doublesided.pdf\n\n", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/amahabal/PySeqsee", "keywords": null, "license": "UNKNOWN", "maintainer": null, "maintainer_email": null, "name": "PySeqsee", "package_url": "https://pypi.org/project/PySeqsee/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/PySeqsee/", "project_urls": {"Download": "UNKNOWN", "Homepage": "https://github.com/amahabal/PySeqsee"}, "release_url": "https://pypi.org/project/PySeqsee/0.1.2/", "requires_dist": null, "requires_python": null, "summary": "Python framework for writing programs to solve complex problems not amenable to brute force. The architecture is a descendant of Douglas Hofstadter and Melanie Mitchell's Copycat architecture.", "version": "0.1.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            PySeqsee: A python framework for solving complex problems not amenable to brute force.<br>======================================================================================<br><br>PySeqsee aims to be a robust framework for developing blackboard-architecture<br>based programs that tackle hard problems in a human-like way.<br><br>It is open-source, under GNU GPLv3.<br><br>Mailing List:<br>  - https://groups.google.com/forum/#!forum/pyseqsee (to view)<br>  - pyseqsee@googlegroups.com (to post)<br>Documentation: http://amahabal.github.com/PySeqsee/<br>Source Code: https://github.com/amahabal/PySeqsee<br>Bug Tracker: https://github.com/amahabal/PySeqsee/issues<br>Development Status: Alpha, but actively-developed working code<br><br>Brief history and motivation<br>-----------------------------<br><br>For over two decades now, Douglas Hofstadter's Fluid Analogies Research<br>Group at Indiana University has designed computer simulations aimed<br>at understanding human cognition.  Each successive model has usually been<br>written from scratch.  Very little of the actual code from previous<br>implementations was used by subsequent implementations, although ideas<br>and the basic approach survived.<br><br>Not just were the implementations different, they were typically in<br>different languages.  Franz Lisp, Chez Scheme, C++, and even Perl have<br>been used by various projects, and there was also talk of using Delphi.  A Java<br>port of Copycat exists.<br><br>This project aims to create a framework in which to implement various<br>cognitive architectures.  It is written in Python 3, and aims to provide<br>many components out of the box without making too many irreversible<br>commitments.  That is, it provides a full suite of tools to get the job<br>done, but also allows you to swap out any component and use the rest.<br><br>Services provided (and their level of completion):<br>-----------------------------------------------------<br><br>* A reusable GUI. Every project will have a different workspace, but there is<br>  still much that is shared. PySeqsee allows you to just write the visualization<br>  for your data, and takes care of everything else. (complete)<br>* A robust testing framework. If you wish to test how well a proposed new feature<br>  works, you can run a side-by-side comparison over many inputs and see the stats.<br>  All that is needed is a file with the inputs to test and in case the input is<br>  very specialized, a python class to convert these inputs to flags to be passed in.<br>  (status: functionality implemented, but statistical analysis to compare which<br>   of the two sides is better is not done).<br>* A setup script that creates the skeleton of a new project. (Under development,<br>  basic functionality exists).<br>* A coderack and facilities for writing codelets (complete).<br>* A slipnet (known here as Long-term Memory), along with the ability to add nodes<br>  and edges and the ability to save it to disk (works, but could be significantly<br>  improved).<br>* A stream of thought. This is a component that first appeared in Seqsee (written<br>  in Perl), but plays a central role here. The stream provides a temporal context<br>  --- that is, recent thoughts can influence what the system does in flexible ways.<br>  A full implementation exists.<br>* A full reimplementation of Seqsee (status: under development. Many sequences<br>  seen, but not all that the perl version did). A short video of the Perl version<br>  can be found here: http://www.youtube.com/watch?v=2KWtRUg8kL8. The dissertation<br>  is here: http://www.amahabal.com/files/Seqsee--doublesided.pdf<br><br>\n          </div>"}, "last_serial": 785363, "releases": {"0.1.2": [{"comment_text": "", "digests": {"md5": "0c75b29b88ed77d1cd8716c621203455", "sha256": "425e404cb4fa1d4728a320f70fa9524bf8df02379341f2862d53f791f508841e"}, "downloads": -1, "filename": "PySeqsee-0.1.2.tar.gz", "has_sig": false, "md5_digest": "0c75b29b88ed77d1cd8716c621203455", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 95335, "upload_time": "2012-04-20T20:00:05", "upload_time_iso_8601": "2012-04-20T20:00:05.948759Z", "url": "https://files.pythonhosted.org/packages/b7/00/c3c127b3166bb8cc41b58fcb5316517e9531d214436a06aff380e50a6c47/PySeqsee-0.1.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "0c75b29b88ed77d1cd8716c621203455", "sha256": "425e404cb4fa1d4728a320f70fa9524bf8df02379341f2862d53f791f508841e"}, "downloads": -1, "filename": "PySeqsee-0.1.2.tar.gz", "has_sig": false, "md5_digest": "0c75b29b88ed77d1cd8716c621203455", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 95335, "upload_time": "2012-04-20T20:00:05", "upload_time_iso_8601": "2012-04-20T20:00:05.948759Z", "url": "https://files.pythonhosted.org/packages/b7/00/c3c127b3166bb8cc41b58fcb5316517e9531d214436a06aff380e50a6c47/PySeqsee-0.1.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:57:06 2020"}