{"info": {"author": "MikeTheWatchGuy", "author_email": "PySimpleGUI@PySimpleGUI.org", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: GNU Lesser General Public License v3 or later (LGPLv3+)", "Operating System :: OS Independent", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3.8", "Topic :: Multimedia :: Graphics"], "description": "\n\n\n\n\n\n\n\n\n![pysimplegui_logo](https://user-images.githubusercontent.com/13696193/43165867-fe02e3b2-8f62-11e8-9fd0-cc7c86b11772.png)        \n\n[![Downloads](http://pepy.tech/badge/pysimpleguiqt)](http://pepy.tech/project/pysimplegui)        \n\n\n ![Awesome Meter](https://img.shields.io/badge/Awesome_meter-1000-yellow.svg)  \n\n ![Python Version](https://img.shields.io/badge/Python-3.x-yellow.svg)        \n\nPySimpleGUIQt on PyPI...\n\n[![PyPI Version](https://img.shields.io/pypi/v/pysimpleguiqt.svg?style=for-the-badge)](https://pypi.org/project/pysimpleguiqt/) \n\n\n\n\n\n# PySimpleGUIQt        \n\n\"Qt without the ugly\"\n\n(For newbies... \"Qt\" is prouncounced \"Cute\")\n\n## The Alpha Release    \n [Announcements of Latest Developments](https://github.com/MikeTheWatchGuy/PySimpleGUI/issues/142)        \n\n\n\n  ----- \n## Getting Started with PySimpleGUIQt  \n\nWelcome to the Alpha Release of PySimpleGUI for Qt!  \n\nYou can use the exact same code that you are running on the older, tkinter, version of PySimpleGUI.    \n\nPySimpleGUIQt uses **PySide2** OR **PyQt5** for access to Qt.  **PyQt5 has been having  a number of problems recently however so tread lightly.**\n\n## To minimize potential problems and broken features, if at all possible, use pyside2 instead of PyQt5.\n\n## Porting your PySimpleGUI code to PySimpleGUIQt  \n\n\nTo \"port\" your code from the tkinter implementation. Follow these steps:  \n\n1. Change `import PySimpleGUI` to `PySimpleGUIQt`  \n\nThat's it!  OK, maybe I should have said step instead of steps.  It may not be that simple in all cases, but it's pretty simple generally speaking.\n\n\n## Differences between PySimpleGUI and PySimpleGUIQt  \n\n#### Sizes  \n\nWhile you can use \"Character-based\" sizes like you did in tkinter, it's best to use pixel based sizes as that is what Qt uses.  PySimpleGUIQt does some very rough / basic conversions from the character sizes to pixel sizes.  It's enough that your elements will at least be visible.  But the conversion is likely to not be ideal.  \n\n#### Fonts  \n\nFonts should be in the format (font family, size).  You can use the older string based too, but it will not work with setting like bold and italics.  PySimpleGUIQt converts from the string 'Courier 20' to the tuple ('Courier', 20) for you.  \n\n\n### Installing PySimpleGUIQt for  Python 3        \n\n    pip install --upgrade PySimpleGUIQt  \n  On Linux systems you need to run pip3.        \n\n pip3 install --upgrade --no-cache-dir PySimpleGUIQt   \n\n### Installing PySide2 for Python 3  \n\nIt is _highly_ recommended that you use PySide2.  The code will attempt to use PyQt5 is pyside2 isn't found.  PyQt5 is **not** recommended.  \n\nTo install Pyside2:  \n\n```pip install PySide2```  \n\n\n**PyQt5 is no longer supported.  Only PySide2 is supported**\n\nToo many differences were causing a lot of headaches.  Supporting just 1 Qt port is difficult enough.  Parsing out the differences between pyside2 and pyqt5 was simply getting to be too much\n\n\n\n## Testing your installation        \nOnce you have installed, or copied the .py file to your app folder, you can test the installation using python.  At the command prompt start up Python.        \n\n```\n  python3\n    >>> import PySimpleGUIQt \n    >>> PySimpleGUIQt.main()\n```\n\nYou will see a sample window in the center of your screen.  If it's not installed correctly you are likely to get an error message during one of those commands        \n\nHere is the window you should see:        \n\n![image](https://user-images.githubusercontent.com/46163555/71421852-7c6ad400-264b-11ea-9adc-15f6aa4248e8.png)\n\n\n\n\n## Prerequisites Python 3        \nPySide2 or PyQt5   (experimental)\n\n\n## Using  - Python 3        \n To use in your code, simply import....        \n `import PySimpleGUIQt as sg`        \n Then use the exact same code as any other PySimpleGUI program that runs on tkinter.    \n\n\n## Status  \n\n### Documentation\n\nFor the primary PySimpleGUI documentation go to http://www.PySimpleGUI.org.  HOWEVER, bear in mind that is the tkinter version.  But it's the best documentation for the package at the moment.  Docstrings are coming to this Qt Release, but it's going to take some time to get them done.  When they are, then this readme will also be fabulous.s\n\n### FEATURE COMPLETE!   \nAll of the major features are DONE.  They may not have all of their options working, but they can be added to your windows.  It's been an amazing week to get here.  \n\nI hope you enjoy this ALPHA release!  Please post a screenshot on the GitHub site.  There is an Issue where users have been posting their applications.  It's a place for you to show-off and a place for others to learn from your designs.  Your window does not have to be complex.... all GUIs, no matter how simple, are something we can learn from.  \n\n\n### Functioning features  \nFeatures are being added daily to this Qt port of PySimpleGUI.    \nThese Elements are \"complete\" (a relative term... more are more complete than others):  \n* Text  \n* Input single line  \n* Input multiline  \n* Output multiline (new)  \n* Dial (new)  \n* Output - reroute stdout  \n* Spinner  \n* Sliders  \n* Buttons - RButtons, CButtons, Short-cut Buttons  \n* Checkbox  \n* Radio Buttons  \n* Listbox  \n* ComboBox  \n* Labeled Frames  \n* Columns - enables you to make pretty much any layout!  \n* Alpha channel for windows  \n* No Title Bar setting  \n* Enter submits for multiline  \n* Fonts  \n* Colors for text and background  \n* Timeouts for Read calls  \n* Change Submits parameters for most Elements  \n* Table  \n  * Basic display  \n  * Read selected rows  \n  * change_submits events  \n  * Updates  \n* Image as a background (new feature)  \n* Graph - Draw line, draw circle, draw text  \n* Image Element  \n* Tree Element  \n* Tabs  \n* Menus  \n* Menu Button Element\n\n\n\n## Missing Features  \n\nNotable MISSING features at the moment include:  \n* Graphs Element Methods - erasing, draw arc, etc  \n* Tree element - returns rows selected, but a little difficult to map those values to something meaningful for the user.\n\n# New PySimpleGUI Features only in Qt (or first introduced in Qt)\n\nThere are a number of new features that are only available in PySimpleGUIQt.  These include:\n* ButtonMenu Element\n* Dial Element\n* Stretcher Element (used to \"push elements around\" within a widnow)\n* SystemTray feature\n* \"Dynamic\" windows that grow and shrink (uses invisible elements)\n\n## SystemTray\n\nThis is a PySimpleGUIQt only feature.  Don't know of a way to do it using tkinter.  It looks likely to work on WxPython however.\n\nIn addition to running normal windows, it's now also possible to have an icon down in the system tray that you can read to get menu events.  There is a new SystemTray object that is used much like a Window object.  You first get one, then  you perform Reads in order to get events.\n\nHere is the definition of the SystemTray object.\n\n```python\nSystemTray(menu=None, filename=None, data=None, data_base64=None, tooltip=None):  \n        '''  \n SystemTray - create an icon in the system tray  \n :param menu: Menu definition \n :param filename: filename for icon  \n :param data: in-ram image for icon  \n :param data_base64: basee-64 data for icon  \n :param tooltip: tooltip string '''\n```\n\nYou'll notice that there are 3 different ways to specify the icon image.  The base-64 parameter allows you to define a variable in your .py code that is the encoded image so that you do not need any additional files.  Very handy feature.\n\n## System Tray Design Pattern\n\nHere is a design pattern you can use to get a jump-start.\n\nThis program will create a system tray icon and perform a blocking Read.  If the item \"Open\" is chosen from the system tray, then a popup is shown.\n\n```python\nimport PySimpleGUIQt as sg  \n\nmenu_def = ['BLANK', ['&Open', '---', '&Save', ['1', '2', ['a', 'b']], '&Properties', 'E&xit']]  \n\ntray = sg.SystemTray(menu=menu_def, filename=r'default_icon.ico')  \n\nwhile True:  # The event loop  \n  menu_item = tray.Read()  \n    print(menu_item)  \n    if menu_item == 'Exit':  \n        break  \n    elif menu_item == 'Open':  \n        sg.Popup('Menu item chosen', menu_item)\n\n```\nThe design pattern creates an icon that will display this menu:\n![snag-0293](https://user-images.githubusercontent.com/13696193/49057441-8bbfe980-f1cd-11e8-93e7-1aeda9ccd173.jpg)\n\n### Icons\n\nWhen specifying \"icons\", you can use 3 different formats.  \n* `filename`- filename\n* `data_base64` - base64 byte string\n* '`data` - in-ram bitmap or other \"raw\" image\n\nYou will find 3 parameters used to specify these 3 options on both the initialize statement and on the Update method.\n\n## Menu Definition\n```python\nmenu_def = ['BLANK', ['&Open', '&Save', ['1', '2', ['a', 'b']], '!&Properties', 'E&xit']]  \n```\n\nA menu is defined using a list.  A \"Menu entry\" is a string that specifies:\n* text shown\n* keyboard shortcut\n* key\n\nSee section on Menu Keys for more information on using keys with menus.\n\nAn entry without a key and keyboard shortcut is a simple string\n`'Menu Item'`\n\nIf you want to make the \"M\" be a keyboard shortcut, place an `&` in front of the letter that is the shortcut.\n`'&Menu Item'`\n\nYou can add \"keys\" to make menu items unique or as another way of identifying a menu item than the text shown.  The key is added to the text portion by placing `::` after the text.\n\n`'Menu Item::key'`\n\nThe first entry can be ignored.`'BLANK`' was chosen for this example. It's this way because normally you would specify these menus under some heading on a menu-bar.  But here there is no heading so it's filled in with any value you want.\n\n**Separators**\nIf you want a separator between 2 items, add the entry `'---'` and it will add a separator item at that place in your menu.\n\n**Disabled menu entries**\n\nIf you want to disable a menu entry, place a `!` before the menu entry\n\n\n## Stretch Element for Justifying Elements\n\nUse the `Stretch` Element to left justify, right justify or center justify one or more elements within their container.\n\nIf a single `Stretch` Element is on a row, then it will push the other elements on the row to either the left or right.  If `Stretch` is on the left, then the elements to the rigth will be pushed to the right.\n\nTo center elements, place a `Stretch` Element on each side of them (2 `Stretch` Elements will be on the same row)\n\n## SystemTray Methods\n\n### Read - Read the context menu or check for events\n\n```python\ndef Read(timeout=None)\n    '''  \n Reads the context menu  \n :param timeout: Optional.  Any value other than None indicates a non-blocking read\n :return:   String representing meny item chosen. None if nothing read.  \n    '''\n```\nThe `timeout` parameter specifies how long to wait for an event to take place.  If nothing happens within the timeout period, then a \"timeout event\" is returned.  These types of reads make it possible to run asynchronously.  To run non-blocked, specify `timeout=0`on the Read call.\n\nRead returns the menu text, complete with key, for the menu item chosen.  If you specified `Open::key` as the menu entry, and the user clicked on `Open`, then you will receive the string `Open::key` upon completion of the Read.\n\n#### Read special return values\n\nIn addition to Menu Items, the Read call can return several special values.    They include:\n\nEVENT_SYSTEM_TRAY_ICON_DOUBLE_CLICKED - Tray icon was double clicked\nEVENT_SYSTEM_TRAY_ICON_ACTIVATED - Tray icon was single clicked\nEVENT_SYSTEM_TRAY_MESSAGE_CLICKED - a message balloon was clicked\nTIMEOUT_KEY is returned if no events are available if the timeout value is set in the Read call\n\n\n### Hide\n\nHides the icon.  Note that no message balloons are shown while an icon is hidden.\n\n```python\ndef Hide() \n```\n\n### Close\n\nDoes the same thing as hide\n```python\ndef Close()\n```\n\n\n### UnHide\n\nShows a previously hidden icon\n\n```python\ndef UnHide()\n```\n\n### ShowMessage\n\nShows a balloon above the icon in the system tray area.  You can specify your own icon to be shown in the balloon, or you can set `messageicon` to one of the preset values.  \n\nThis message has a custom icon.\n\n![snag-0286](https://user-images.githubusercontent.com/13696193/49057459-a85c2180-f1cd-11e8-9a66-aa331d7e034c.jpg)\n\nThe preset `messageicon` values are:\n\n    SYSTEM_TRAY_MESSAGE_ICON_INFORMATION \n    SYSTEM_TRAY_MESSAGE_ICON_WARNING\n    SYSTEM_TRAY_MESSAGE_ICON_CRITICAL \n    SYSTEM_TRAY_MESSAGE_ICON_NOICON\n\n```python\nShowMessage(title, message, filename=None, data=None, data_base64=None, messageicon=None, time=10000):  \n    '''  \n Shows a balloon above icon in system tray  \n :param title:  Title shown in balloon  \n :param message: Message to be displayed  \n :param filename: Optional icon filename  \n :param data: Optional in-ram icon  \n :param data_base64: Optional base64 icon  \n :param time: How long to display message in milliseconds  :return:  \n '''\n```\nNote, on windows it may be necessary to make a registry change to enable message balloons to be seen.  To fix this, you must create the DWORD you see in this screenshot.\n\n![snag-0285](https://user-images.githubusercontent.com/13696193/49056144-6381bc00-f1c8-11e8-9f44-199394823369.jpg)\n\n\n### Update\n\nYou can update any of these items within a SystemTray object\n* Menu definition\n* Icon\n* Tooltip\n\n Change them all or just 1.\n\n```python\nUpdate(menu=None, tooltip=None,filename=None, data=None, data_base64=None,)\n    '''  \n Updates the menu, tooltip or icon  \n :param menu: menu defintion  \n :param tooltip: string representing tooltip  \n :param filename:  icon filename  \n :param data:  icon raw image  \n :param data_base64: icon base 64 image  \n :return:  \n '''\n```\n## Menus with Keys\n\nPySimpleGUIQt offers the ability to add a key to your menu items.  To do so, you add :: and the key value to the end of your menu definition. \n\n`menu_def = ['File', ['Hide::key', '&Open::key', '&Save',['1', '2', ['a','b']], '&Properties', 'E&xit']]`\n\nThe menu definition adds a key \"key\" to the menu entries Hide and Open.\n\nIf you want to change the separator characters from :: top something else,change the variable `MENU_KEY_SEPARATOR`\n\nWhen a menu item has a key and it is chosen, then entire string is returned.  If Hide were selected, then Hide::key would be returned from the Read.  Note that the shortcut character & is NOT returned from Reads.\n\n\n## Dynamic Windows (Element Visibility)\n\nFinally, the ability to grow and shrink has been added as of release 0.20.0\n\nWhile the window **appears** to be dynamic, the reality is that the elements are created up front, when you define the window layout.  You will create these \"extra\" elements with the flag `visible=False`.  Then, when you wish to show those elements, call the element's `Update` method setting `visible=True`.  \n\nAfter you call the `Update` method, it's important to call `window.VisibilityChanged()` so that your window can change sizes.  Without that call your window will not shrink. It will grow properly, but it will not shrink.  While this could have been done by PySimpleGUI on the user's behalf, the thought was that perhaps the user wants the window size to remain the same and the element simply appears and disappears, leaving a blank spot.  If the window automatically grew and shrank, this would not be possible.  Just buck-up and make the call to `VisibilityChanged`.\n\n## `enable_events` Parameter\n\nAll elements that are capable of producing events now have a parameter `enable_events`.  This is *identical* to the old parameter `change_submits` or `click_submits`.  The idea is to standardize on 1 name that all elements use.  The old parameters will continue to work, but the documentation and sample programs will steer you away from them and towards enable_events.\n\n# Release Notes:  \n\n### 0.12.0   -   20-Nov-2018\nCorrectly restore stdout when Output Element is deleted  \nAdded Finalize ability  \n**Better multi-window handling... maybe it's finally fixed!**  \nRadio button default value  \nDial element default value  \nShow expanded option for trees  \nTitles for popups  \n\n### 0.13.0 -  22-Nov-2018\n\nFocus for Input Text and Multiline Input\n\n - Get focus \n - Set focus\nWindow.FindElementWithFocus works\nMultiline input\n\n - Change submits \n - Update - disabled, append\n\nMultiline output - Update value, append, disabled, get value\nText clicked submits\nFile types for open files\nInitial folder, file types, for browse buttons\nFile types standardized on tkinter data format\nFind Element With Focus now works for input and multiline input\nYet more multiwindow handling\nRelief for Text element\nInput text disable\nCorrect sizing of Comboboxes using visible items parm\nCorrect default values for input and multiline input\nChange submits for multiline\nHorizontal and Vertical separators\nPopupGetFile and PopupGetFolder - no_window option works\n\n### 0.14.0 - 24-Nov-2018\n\nSlider tick positions set using relief parm\nButtonMenu Element\nMultiline.Update font parm\nText.Update color and font now work\nButton.Update font support\nWindow.Element = Window.FindElement\nBetter font support for all elements - underline, bold\nElement padding - complete rework\nText element padding\nButton padding\nInput Text padding\nInput Text password char\nListbox padding\nCombobox padding\nMultiline padding\nCheckbox padding\nRadio padding\nProgress Bar padding\nOutput padding\nImage padding\nGraph padding\nSlider - set tick marks using relief parm\nDial - set tick information using resolution and tick interval\nTable padding\nTree padding\nSeparator padding\nForce window sizing should mean windows are better sized\nPopup - better layout\n\n\n### 0.15.0 24-Nov-2018  \n\nNew SystemTray feature!\nmargin paramter for Text Element.  Takes 4 ints\nCorrected button colors when disabled. For now am restoring them to original colors\nBorder Depth for all elements that support it (inputs, slider, table, tree, etc)\nFix for Element padding done incorrectly!! Sorry about this one\n\n\n### 0.16.0  24-Nov-2018  \n\nEasier forcing to use PyQt5 for testing\nPredefined events for Tray Icons\n* Double Clicked\n* Icon Activated\n* Message Clicked\n* Timeout key for polling\n\nTray icon tooltip\nMenu keys with programmable separator\nBetter element padding hierarchy\nMenubar now returns values as does the ButtonMenu\n\n### 0.17.0  24-Nov-2018  \n\nWindow.Hide and UnHide methods\n\n### 0.18.0 26-Nov-2018\n\nTooltips for all elements\nCompletion of all SystemTray features\nRead with or without timeout\nSpecify icons from 3 sources\nShow message with custom or preset icons\nUpdate \n* Menu\n* Tooltip\n* Icon\nPopupScrolled - new location parameter, fixed bug that wasn't closing window when completed\n\n### 0.19.0 28-Nov-2018\n\nAbility to disable menu items by adding ! to the front\nDisable menu works for menus, button menus, system tray menus\nCombo - Update Method - Value, values, disabled, font\nListbox - Update Method - Values, disabled\nListbox - SetValue Method - sets the selected items\nRadio Button - Update Method - value, disabled\nCheckbox - Update Method - value, disabled\nSpinner - Update Method - value, values, disabled\nSpinner - change_submits works\nImage - New feature!  click_submits option (acts like a button in a way)\nWindow - Get screen dimensions\nSlider - disable\nDial - disable\n\n### 0.20.0 6-Dec-2018\n\n* Ability to change calculations between characters and pixels\n* size_px added to ALL elements that have a size parameter\n* General Element.Update(widget, background_color, text_color, font, visible)\n* visible parameter added to ALL elements\n* enable_events flag\n* Input text - enable events, visibility, size_px\n* Input text update added capabilities\n\t* ability to highlight the input string\n\t* background, text colors and font\n* Combo - enable events, visibility, size_px\n* Combo - auto complete feature\n* Combo - added to Update - background color, text color, font, visible\n* Listbox - enable events, visibility, size_px\n* Listbox - better scaling from characters to pixels\n* Listbox - ability to Update with set to index, text color, font, visibility\n* Radio - enable events, visibility, size_px\n* Radio - Update additions - background_color, text_color, font, visibility\n* Checkbox - enable events, visibility, size_px\n* Checkbox - Update additions - background_color, text_color, font, visibility\n* Spin - enable events, visibility, size_px\n* Spin - Update additions - background_color, text_color, font, visibility\n* Multiline input - enable events, visibility, size_px\n* Multiline input - Update additions - background_color, text_color, font, visibility\n* Multiline input better character to pixel scaling\n* Multiline output - enable events, visibility, size_px\n* Multiline output - Update additions - background_color, text_color, visibility\n* Text - enable events, size in pixels\n* Text - Update addition of visibility\n* Output - visible, size_px\n* Output - added update capability with new value, background_color, text_color, font, visibility\n* Button - enable events, visible, size_px\n* Button - Color Chooser feature completed\n* Button - Color Chooser can target (None, None) which will store the value to be returned with the values from Read()\n* Button - fixed bug in SaveAs button code.  Bad filter variable\n* Button - Updated added font, visibility\n* Button - new SetFocus() method will set the focus onto the button\n* ButtonMenu - Update method implemented that includes menu definition changes, text, button color, font, visibility\n* ProgressBar - added visibility, size_px\n* ProgressBar - added Update method for changing the visibility\n* Images - events, size_pix, visibility\n* Images - can now get click events for images!\n* Images - Update added visibility\n* Graph - visibility, size_px\n* Graph - Update method for changing visibility\n* Frame - visibility, size_px\n* Frame - Update method added that controls visibility\n* ALL elements inside of a Frame that's invisible will also be invisible\n* Tab - visible parameter added, however not yet functional!\n* TabGroup - enable events, visibility\n* TabGroup - Update for controlling visibility\n* Slider - enable events, size_px\n* Slider - Update method now includes visibility\n* Dial - enable events, size_px, visibility\n* Dial - Update method added visibilty control\n* Column - visibility added\n* Column - Added Update method to control visibility\n* ALL elements inside of an invisible Column Element will also be invisible\n* MenuBar - added visibility\n* MenuBar - Update can now change menu definitions at runtime, and control visibility\n* Table - enable events, size_px, visibility\n* Table - Update method can control visibility\n* Tree - enable events, size_px, visibility\n* Tree - Update method can control visibility\n* VisibilityChanged() function that must be called when using Qt so that the window will shrink or grow\n* window.GetScreenDimensions can now be called prior to window creation\n* window.Size property\n* enable_events added to all of the shortcut buttons and browse buttons\n* Ability to set a button image from a file\n* Combo - ability to set a default value\n* Combo - Read only setting.  Allows for user editing of value\n* Menus - Ability to disable / enable any part of a menu by adding a ! before the entry name\n* Tabs - ability to set tab text color, background color, background color of selected tab\n* Tabs - ability to set widget area's background color\n* Sliders - paging works properly (using page-up page-down or slider slider area to advance slider)\n* Tree - Setting number of visible rows implemented\n* Added 5 pixels to every window.  Have been having issues with text being cutoff on the right side\n* SetOptions - ability to change default error button color for popups\n\n### 0.21.0 - 9-Dec-2018\n\n* Removed use of global variabels - using static class variabels instead\n* Listbox.Get() will return current listbox value\n* Progressbar now has color support\n* Progressbar can be vertical now\n* Can change bar or back and background color\n* (barcolor, background color - None if use default)\n* Table num_rows parameter implemented\n* Table.Update - can change number of visible rows\n* Window resizable parm - implemented, default changed from False to True\n* Window.Move - implemented\n* Window.Minimize - implemented\n* Window.Disable - implemented\n* Window.Enable - implemented\n* Window.CurrentLocation - implemented\n* Fixed too small scrollbar in Combobox\n* Fixed too small scrollbar in Listbox\n* Changed \"text\" window to a complex one for quick regression testing (try running PySimpleGUIQt.py by itself)\n\n### 0.22.0 - 9-Dec-2018\n\n* Spin.Get method - get the current spinner value\n\n### 0.23.0 PySimpleGUIQt\n\n* Fixed crash that was happening with latest pyside2 release!!!!\n* Huge update to OneLineProgressMeter\n* Debug window got title and do-not-reroute-std-out option\n* Popups get a title option\n* PopupScrolled getr non-blocking option\n* Default logo included in Base64 Format\n* Changed Chars to pixels scaling.  Went from (10,25) to (10,35)\n* Changed pixel to chars cutoff from 10 to 12\n* Change progress bar default size to 200 from 250\n* Reworked the _my_windows global variable / class to use Window class variables\n* Change in how Elements / Widgets are updated. Need to use {} correctly\n* InputText supports drag and drop\n* Support for Checkbox.Get()\n* Support for strings in spinbox\n* Added Update method to Output element\n* Changed Button default file_types from *.* to *\n* Support for Tab enable_events so they now generate events\n* Table.Update can change the number of rows of table\n* Window class now manages the list of active popups, user defined icon, QTApplication, num open windows\n* Window resizable parameter default changed from False to True\n* Window new parameter -  disable_minimize\n* Window.GetScreenDimensions added\n* Window.Move added\n* Window.Minimize added\n* Window.Maximize added\n* Window.Disable added\n* Window.Enable added\n* Window.BringToFront added\n* Window.CurrentLocation added\n* TabGroup now returns which tab is selected in the return values\n* Completely new Style generation class and functions (I hope it works!!!!)\n* Style reworked for Column, Text, Button, Input, Combobox, Listbox, Input Multiline, Output Multiline, Progress Bar, Spinbox, Output, \n* Progress Bar colors are now correct\n* Events generated when tabs are changed\n* \"Better\" Table support.   Uses num_rows now and styles the scrollbar\n* Tree element can support multiple types of icons including base64\n* Fixed tree element scroll bar\n* Icon ccan be set using SetOptions\n* main for PySimpleGUIQt.py gets a nice test harness that shows lots of Elements\n\n\n## 0.24.0 PySimpleGUIQt\n\n* do_not_clear defaults to TRUE! for Input and MultilineInput/Output\n* Key events for tables (unsure what's actually implemented)\n* Tree icons can now be bytes in addition to filename!  (More Base64 support)\n\n\n## 0.25.0 PySimpleGUIQt 5-Apr-2019\n\n* Uses built-in Default Base64 Logo! (no more .ico file needed)\n* New shortcuts for Elements\n\t* I = InputText\n\t* B = Butt = Btn = Button\n* Convert user supplied button text to string just in case not a string\n* Parameter `icon` in `Window` call can be Base64 byte string in addition to filename\n\n\n## 0.26.0 11-Apr-2019 PySimpleGUIQt\n\n* NEW Window parameter layout so can skip calling Layout\n\n## 0.28.0 PySimpleGUIQt 5-Sep-2019\n\nIt's been a LONG LONG LONG time coming\n\n* PEP8-ified!  All methods and functions have PEP8 equivalents!! It's a BFD\n* Version numbers in the code\n* New key dictionary - Window.AllKeysDict has all of the windows keys in 1 place for FASTER lookups\n* Element.Widget provides access to low level Qt Widget\n* Multiline scaling in addition to single line\n* Raised default pixel cutoff for single line scaling to 15 from 12\n* Pixel conversion done in Elements and passed through to Element class as size_px\n* Renamed lots of private functions and methods to begin with _\n* \"Callable\" Elements - element(new_value) will cause element.update(new_value) to be called\n* Removed all __del__ except for the Output Element one\n* Button - Click method added.  Your program can click a button as if a user did\n* ButtonbMenu - Click mehtod also added like in Button element\n* Graph Element\n\t* Added DrawRectangle method\n\t* Added RelocateFigure method\n\t* Added return of ID to DrawLine, DrawCircle, DrawText\n\t* Added Erase method to erase entire graph\n* Tab - added Select method so can select a Tab as if user clicked it\n* TabGroup - added Get method. Returns key of currently selected Tab, or text of Tab if no key set\n* Table - Get method returns the table - GREAT way to enable users to edit a table and get the results\n* SystemTray - uses default base64 icon if no icon supplied when creating\n* Window - new finalize parameter removes need to add chained call to finalize\n* Window.FindElement - added silent_on_error parameter\n* Window[key] is the same as Window.FindElement(key)\n* Calling a Window object calls Read for that window\n* Fix for filetypes. Bug caused (*) to be added onto filetypes when browsing for files\n* Combo returns exact value that was provided using an index into Values list instead of string from Qt\n* Listbox returns actual supplied items\n* Spinner returns avtual supplied item\n* Tabgroup returns Tab key\n* Finding element with focus now returns element regardless of type (any type of element can be returned)\n* Radio Buttons now return events if enabled\n* Graph element background colors added, uses new style class\n* Table headings supported (where not supported before??)\n* Popups switched to using new layout parm in Window call and uses keys too\n\n\n## 0.30.0 PySimpleGUIQt 16-Nov-2019\n\n* THEMES!! Over 100 new Look and Feel themes to choose from!\n* New func preview_all_look_and_feel_themes() that will display a large window with all possible themes shown\n* Metadata!  Now available on all elements when creating and accessable directly by program\n* Metadata added to SystemTray objects and Window objects\n* Metadata parameter added to all shortcut buttons and funcs\n* Completed removal of PyQt5 code\n* ML, MLine shortcuts added for Multiline (input)\n* MLineOut shortcut for MultilineOutput\n* Text element text is optional now\n* Fixed bug in BrowseFiles button.  Was only getting first item in list instead of full list of filenames\n* BMenu shortcut for ButtonMenu\n* PBar, Prog shortcuts for ProgressBar\n* Range is now properly set in Slider.Update\n* Background color supported for MenuBars now\n* Added 5 extra pixels to window size. Now adding a total of 10 so things don't get cut off\n\n\n## 0.31.0 PySimpleGUIQt 23-Dec-2019\n\nThemes and more!\n\n* Added port string so can identify which port is being used (PySimpleGUIQt)\n* Removed the Mac speific button and system color settings. Not sure why they existed at all since it's Qt, not tkinter\n* Like all PySimpleGUI ports, the default theme is now \"DarkBlue3\"\n* TRANSPARENT_BUTTON redefined as an a string explaining that if you're using it, you're not getting what you thought you were\n* BROWSE_FILES_DELIMETER so that it can be changed to something other than ';' for systems that ';' is a valid char for filenames\n* Can drag and drop into a Multiline Input Element!\n* Colored text output for Multiline (hmmm...but not MultilineOutput.. may have to add it)\n* Tree Element\n\t* Support for enable_events\n\t* Returns selected rows when reading\n* Window - better error checking and warnings for window layouts\n* Button - changes to help with getting animations back\n* TabGroup - Tab positions now supporrted\n\t* left, right, top, bottom, lefttop, leftbottom, righttop, rightbottom, bottomleft, bottomright, topleft, topright\n* Tables & Trees - text color and background color now work.  Don't appear to have worked before\n\n\n## 0.32.0 PySimpleGUIQt 4-Apr-2020\n\nThe \"Jeez... it's been way too LONG since a release\" release\n\nHighlights - Read with close (Single line GUIs!), Print to Multiline, Scrollable columns\n\n* Listbox.update fix\n* Added Graph.change_coordinates\n* Added Image.Widget\n* Return correct value when Comboxbox has manual data entered\n* Multiline.print - new printing capabilities\n* Multiline move cursor to end\n* Scrollable columns\n* Added Listbox.get\n* Fix for visible ignored in Text Element\n* Window.read - close parameter (YES! Single line GUIs again)\n* Multiline readonly parm on update\n* Print fixed sep char to act line normal print\n* Print (Multiline) added autoscroll parm\n\n\n## 0.33.0 PySimpleGUIQt 6-May-2020\n\n* Added constants\n  * WIN_CLOSED and WINDOW_CLOSED\n  * EVENT_TIMEOUT and TIMEOUT_EVENT\n* Added expansion capabilities\n  * Element.row_frame - The QHBoxLayout the element is contained within \n  * Column.vbox_layout - The QVBoxLayout contained in Column element\n\n\n\n\n\n# Design        \n ## Author \n\nThe PySimpleGUI Organization \nPySimpleGUI.org\n\n# Demo Code Contributors        \n\n# License        \nGNU Lesser General Public License (LGPL 3) +        \n\nCopytight 2018, 2019 PySimpleGUI\n\n# Acknowledgments\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/PySimpleGUI/PySimpleGUI", "keywords": "GUI UI tkinter wrapper simple easy beginner novice student graphics progressbar progressmeter", "license": "", "maintainer": "", "maintainer_email": "", "name": "PySimpleGUIQt", "package_url": "https://pypi.org/project/PySimpleGUIQt/", "platform": "", "project_url": "https://pypi.org/project/PySimpleGUIQt/", "project_urls": {"Homepage": "https://github.com/PySimpleGUI/PySimpleGUI"}, "release_url": "https://pypi.org/project/PySimpleGUIQt/0.33.0/", "requires_dist": ["pyside2"], "requires_python": "", "summary": "The Alpha Qt version of PySimpleGUI, this GUI SDK Launched in 2018 Actively developed and supported. Super-simple to create custom GUI's.  Now supports both tkinter, Qt, WxPython and Web (Remi)", "version": "0.33.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p><img alt=\"pysimplegui_logo\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/f98ef631b75c2b8b6a528025bbbcab4b88be6a74/68747470733a2f2f757365722d696d616765732e67697468756275736572636f6e74656e742e636f6d2f31333639363139332f34333136353836372d66653032653362322d386636322d313165382d396664302d6363376338366231313737322e706e67\"></p>\n<p><a href=\"http://pepy.tech/project/pysimplegui\" rel=\"nofollow\"><img alt=\"Downloads\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/a38ecb064048009c5556aab6bff525c6dad8ba5c/687474703a2f2f706570792e746563682f62616467652f707973696d706c656775697174\"></a></p>\n<p><img alt=\"Awesome Meter\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/49306f832ab45d64ce11ad7d4de6bd86b74ef28c/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f417765736f6d655f6d657465722d313030302d79656c6c6f772e737667\"></p>\n<p><img alt=\"Python Version\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8706d77f97702a4ad6cb9fc087543a0bce46385f/68747470733a2f2f696d672e736869656c64732e696f2f62616467652f507974686f6e2d332e782d79656c6c6f772e737667\"></p>\n<p>PySimpleGUIQt on PyPI...</p>\n<p><a href=\"https://pypi.org/project/pysimpleguiqt/\" rel=\"nofollow\"><img alt=\"PyPI Version\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/0083d3ac049d3f6ac633d304b62bc1c3103b6707/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f707973696d706c6567756971742e7376673f7374796c653d666f722d7468652d6261646765\"></a></p>\n<h1>PySimpleGUIQt</h1>\n<p>\"Qt without the ugly\"</p>\n<p>(For newbies... \"Qt\" is prouncounced \"Cute\")</p>\n<h2>The Alpha Release</h2>\n<p><a href=\"https://github.com/MikeTheWatchGuy/PySimpleGUI/issues/142\" rel=\"nofollow\">Announcements of Latest Developments</a></p>\n<hr>\n<h2>Getting Started with PySimpleGUIQt</h2>\n<p>Welcome to the Alpha Release of PySimpleGUI for Qt!</p>\n<p>You can use the exact same code that you are running on the older, tkinter, version of PySimpleGUI.</p>\n<p>PySimpleGUIQt uses <strong>PySide2</strong> OR <strong>PyQt5</strong> for access to Qt.  <strong>PyQt5 has been having  a number of problems recently however so tread lightly.</strong></p>\n<h2>To minimize potential problems and broken features, if at all possible, use pyside2 instead of PyQt5.</h2>\n<h2>Porting your PySimpleGUI code to PySimpleGUIQt</h2>\n<p>To \"port\" your code from the tkinter implementation. Follow these steps:</p>\n<ol>\n<li>Change <code>import PySimpleGUI</code> to <code>PySimpleGUIQt</code></li>\n</ol>\n<p>That's it!  OK, maybe I should have said step instead of steps.  It may not be that simple in all cases, but it's pretty simple generally speaking.</p>\n<h2>Differences between PySimpleGUI and PySimpleGUIQt</h2>\n<h4>Sizes</h4>\n<p>While you can use \"Character-based\" sizes like you did in tkinter, it's best to use pixel based sizes as that is what Qt uses.  PySimpleGUIQt does some very rough / basic conversions from the character sizes to pixel sizes.  It's enough that your elements will at least be visible.  But the conversion is likely to not be ideal.</p>\n<h4>Fonts</h4>\n<p>Fonts should be in the format (font family, size).  You can use the older string based too, but it will not work with setting like bold and italics.  PySimpleGUIQt converts from the string 'Courier 20' to the tuple ('Courier', 20) for you.</p>\n<h3>Installing PySimpleGUIQt for  Python 3</h3>\n<pre><code>pip install --upgrade PySimpleGUIQt  \n</code></pre>\n<p>On Linux systems you need to run pip3.</p>\n<p>pip3 install --upgrade --no-cache-dir PySimpleGUIQt</p>\n<h3>Installing PySide2 for Python 3</h3>\n<p>It is <em>highly</em> recommended that you use PySide2.  The code will attempt to use PyQt5 is pyside2 isn't found.  PyQt5 is <strong>not</strong> recommended.</p>\n<p>To install Pyside2:</p>\n<p><code>pip install PySide2</code></p>\n<p><strong>PyQt5 is no longer supported.  Only PySide2 is supported</strong></p>\n<p>Too many differences were causing a lot of headaches.  Supporting just 1 Qt port is difficult enough.  Parsing out the differences between pyside2 and pyqt5 was simply getting to be too much</p>\n<h2>Testing your installation</h2>\n<p>Once you have installed, or copied the .py file to your app folder, you can test the installation using python.  At the command prompt start up Python.</p>\n<pre><code>  python3\n    &gt;&gt;&gt; import PySimpleGUIQt \n    &gt;&gt;&gt; PySimpleGUIQt.main()\n</code></pre>\n<p>You will see a sample window in the center of your screen.  If it's not installed correctly you are likely to get an error message during one of those commands</p>\n<p>Here is the window you should see:</p>\n<p><img alt=\"image\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/bc46cb51bd5cfa472dbee237a8f148202c14b6cd/68747470733a2f2f757365722d696d616765732e67697468756275736572636f6e74656e742e636f6d2f34363136333535352f37313432313835322d37633661643430302d323634622d313165612d396164632d3135663661613432343865382e706e67\"></p>\n<h2>Prerequisites Python 3</h2>\n<p>PySide2 or PyQt5   (experimental)</p>\n<h2>Using  - Python 3</h2>\n<p>To use in your code, simply import....<br>\n<code>import PySimpleGUIQt as sg</code><br>\nThen use the exact same code as any other PySimpleGUI program that runs on tkinter.</p>\n<h2>Status</h2>\n<h3>Documentation</h3>\n<p>For the primary PySimpleGUI documentation go to <a href=\"http://www.PySimpleGUI.org\" rel=\"nofollow\">http://www.PySimpleGUI.org</a>.  HOWEVER, bear in mind that is the tkinter version.  But it's the best documentation for the package at the moment.  Docstrings are coming to this Qt Release, but it's going to take some time to get them done.  When they are, then this readme will also be fabulous.s</p>\n<h3>FEATURE COMPLETE!</h3>\n<p>All of the major features are DONE.  They may not have all of their options working, but they can be added to your windows.  It's been an amazing week to get here.</p>\n<p>I hope you enjoy this ALPHA release!  Please post a screenshot on the GitHub site.  There is an Issue where users have been posting their applications.  It's a place for you to show-off and a place for others to learn from your designs.  Your window does not have to be complex.... all GUIs, no matter how simple, are something we can learn from.</p>\n<h3>Functioning features</h3>\n<p>Features are being added daily to this Qt port of PySimpleGUI.<br>\nThese Elements are \"complete\" (a relative term... more are more complete than others):</p>\n<ul>\n<li>Text</li>\n<li>Input single line</li>\n<li>Input multiline</li>\n<li>Output multiline (new)</li>\n<li>Dial (new)</li>\n<li>Output - reroute stdout</li>\n<li>Spinner</li>\n<li>Sliders</li>\n<li>Buttons - RButtons, CButtons, Short-cut Buttons</li>\n<li>Checkbox</li>\n<li>Radio Buttons</li>\n<li>Listbox</li>\n<li>ComboBox</li>\n<li>Labeled Frames</li>\n<li>Columns - enables you to make pretty much any layout!</li>\n<li>Alpha channel for windows</li>\n<li>No Title Bar setting</li>\n<li>Enter submits for multiline</li>\n<li>Fonts</li>\n<li>Colors for text and background</li>\n<li>Timeouts for Read calls</li>\n<li>Change Submits parameters for most Elements</li>\n<li>Table\n<ul>\n<li>Basic display</li>\n<li>Read selected rows</li>\n<li>change_submits events</li>\n<li>Updates</li>\n</ul>\n</li>\n<li>Image as a background (new feature)</li>\n<li>Graph - Draw line, draw circle, draw text</li>\n<li>Image Element</li>\n<li>Tree Element</li>\n<li>Tabs</li>\n<li>Menus</li>\n<li>Menu Button Element</li>\n</ul>\n<h2>Missing Features</h2>\n<p>Notable MISSING features at the moment include:</p>\n<ul>\n<li>Graphs Element Methods - erasing, draw arc, etc</li>\n<li>Tree element - returns rows selected, but a little difficult to map those values to something meaningful for the user.</li>\n</ul>\n<h1>New PySimpleGUI Features only in Qt (or first introduced in Qt)</h1>\n<p>There are a number of new features that are only available in PySimpleGUIQt.  These include:</p>\n<ul>\n<li>ButtonMenu Element</li>\n<li>Dial Element</li>\n<li>Stretcher Element (used to \"push elements around\" within a widnow)</li>\n<li>SystemTray feature</li>\n<li>\"Dynamic\" windows that grow and shrink (uses invisible elements)</li>\n</ul>\n<h2>SystemTray</h2>\n<p>This is a PySimpleGUIQt only feature.  Don't know of a way to do it using tkinter.  It looks likely to work on WxPython however.</p>\n<p>In addition to running normal windows, it's now also possible to have an icon down in the system tray that you can read to get menu events.  There is a new SystemTray object that is used much like a Window object.  You first get one, then  you perform Reads in order to get events.</p>\n<p>Here is the definition of the SystemTray object.</p>\n<pre><span class=\"n\">SystemTray</span><span class=\"p\">(</span><span class=\"n\">menu</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">filename</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">data</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">data_base64</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">tooltip</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">):</span>  \n        <span class=\"sd\">'''  </span>\n<span class=\"sd\"> SystemTray - create an icon in the system tray  </span>\n<span class=\"sd\"> :param menu: Menu definition </span>\n<span class=\"sd\"> :param filename: filename for icon  </span>\n<span class=\"sd\"> :param data: in-ram image for icon  </span>\n<span class=\"sd\"> :param data_base64: basee-64 data for icon  </span>\n<span class=\"sd\"> :param tooltip: tooltip string '''</span>\n</pre>\n<p>You'll notice that there are 3 different ways to specify the icon image.  The base-64 parameter allows you to define a variable in your .py code that is the encoded image so that you do not need any additional files.  Very handy feature.</p>\n<h2>System Tray Design Pattern</h2>\n<p>Here is a design pattern you can use to get a jump-start.</p>\n<p>This program will create a system tray icon and perform a blocking Read.  If the item \"Open\" is chosen from the system tray, then a popup is shown.</p>\n<pre><span class=\"kn\">import</span> <span class=\"nn\">PySimpleGUIQt</span> <span class=\"k\">as</span> <span class=\"nn\">sg</span>  \n\n<span class=\"n\">menu_def</span> <span class=\"o\">=</span> <span class=\"p\">[</span><span class=\"s1\">'BLANK'</span><span class=\"p\">,</span> <span class=\"p\">[</span><span class=\"s1\">'&amp;Open'</span><span class=\"p\">,</span> <span class=\"s1\">'---'</span><span class=\"p\">,</span> <span class=\"s1\">'&amp;Save'</span><span class=\"p\">,</span> <span class=\"p\">[</span><span class=\"s1\">'1'</span><span class=\"p\">,</span> <span class=\"s1\">'2'</span><span class=\"p\">,</span> <span class=\"p\">[</span><span class=\"s1\">'a'</span><span class=\"p\">,</span> <span class=\"s1\">'b'</span><span class=\"p\">]],</span> <span class=\"s1\">'&amp;Properties'</span><span class=\"p\">,</span> <span class=\"s1\">'E&amp;xit'</span><span class=\"p\">]]</span>  \n\n<span class=\"n\">tray</span> <span class=\"o\">=</span> <span class=\"n\">sg</span><span class=\"o\">.</span><span class=\"n\">SystemTray</span><span class=\"p\">(</span><span class=\"n\">menu</span><span class=\"o\">=</span><span class=\"n\">menu_def</span><span class=\"p\">,</span> <span class=\"n\">filename</span><span class=\"o\">=</span><span class=\"sa\">r</span><span class=\"s1\">'default_icon.ico'</span><span class=\"p\">)</span>  \n\n<span class=\"k\">while</span> <span class=\"kc\">True</span><span class=\"p\">:</span>  <span class=\"c1\"># The event loop  </span>\n  <span class=\"n\">menu_item</span> <span class=\"o\">=</span> <span class=\"n\">tray</span><span class=\"o\">.</span><span class=\"n\">Read</span><span class=\"p\">()</span>  \n    <span class=\"nb\">print</span><span class=\"p\">(</span><span class=\"n\">menu_item</span><span class=\"p\">)</span>  \n    <span class=\"k\">if</span> <span class=\"n\">menu_item</span> <span class=\"o\">==</span> <span class=\"s1\">'Exit'</span><span class=\"p\">:</span>  \n        <span class=\"k\">break</span>  \n    <span class=\"k\">elif</span> <span class=\"n\">menu_item</span> <span class=\"o\">==</span> <span class=\"s1\">'Open'</span><span class=\"p\">:</span>  \n        <span class=\"n\">sg</span><span class=\"o\">.</span><span class=\"n\">Popup</span><span class=\"p\">(</span><span class=\"s1\">'Menu item chosen'</span><span class=\"p\">,</span> <span class=\"n\">menu_item</span><span class=\"p\">)</span>\n</pre>\n<p>The design pattern creates an icon that will display this menu:\n<img alt=\"snag-0293\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/3d9af2e96e996b931d24627885ccec826263a81d/68747470733a2f2f757365722d696d616765732e67697468756275736572636f6e74656e742e636f6d2f31333639363139332f34393035373434312d38626266653938302d663163642d313165382d393365372d3161656461396363643137332e6a7067\"></p>\n<h3>Icons</h3>\n<p>When specifying \"icons\", you can use 3 different formats.</p>\n<ul>\n<li><code>filename</code>- filename</li>\n<li><code>data_base64</code> - base64 byte string</li>\n<li>'<code>data</code> - in-ram bitmap or other \"raw\" image</li>\n</ul>\n<p>You will find 3 parameters used to specify these 3 options on both the initialize statement and on the Update method.</p>\n<h2>Menu Definition</h2>\n<pre><span class=\"n\">menu_def</span> <span class=\"o\">=</span> <span class=\"p\">[</span><span class=\"s1\">'BLANK'</span><span class=\"p\">,</span> <span class=\"p\">[</span><span class=\"s1\">'&amp;Open'</span><span class=\"p\">,</span> <span class=\"s1\">'&amp;Save'</span><span class=\"p\">,</span> <span class=\"p\">[</span><span class=\"s1\">'1'</span><span class=\"p\">,</span> <span class=\"s1\">'2'</span><span class=\"p\">,</span> <span class=\"p\">[</span><span class=\"s1\">'a'</span><span class=\"p\">,</span> <span class=\"s1\">'b'</span><span class=\"p\">]],</span> <span class=\"s1\">'!&amp;Properties'</span><span class=\"p\">,</span> <span class=\"s1\">'E&amp;xit'</span><span class=\"p\">]]</span>  \n</pre>\n<p>A menu is defined using a list.  A \"Menu entry\" is a string that specifies:</p>\n<ul>\n<li>text shown</li>\n<li>keyboard shortcut</li>\n<li>key</li>\n</ul>\n<p>See section on Menu Keys for more information on using keys with menus.</p>\n<p>An entry without a key and keyboard shortcut is a simple string\n<code>'Menu Item'</code></p>\n<p>If you want to make the \"M\" be a keyboard shortcut, place an <code>&amp;</code> in front of the letter that is the shortcut.\n<code>'&amp;Menu Item'</code></p>\n<p>You can add \"keys\" to make menu items unique or as another way of identifying a menu item than the text shown.  The key is added to the text portion by placing <code>::</code> after the text.</p>\n<p><code>'Menu Item::key'</code></p>\n<p>The first entry can be ignored.<code>'BLANK</code>' was chosen for this example. It's this way because normally you would specify these menus under some heading on a menu-bar.  But here there is no heading so it's filled in with any value you want.</p>\n<p><strong>Separators</strong>\nIf you want a separator between 2 items, add the entry <code>'---'</code> and it will add a separator item at that place in your menu.</p>\n<p><strong>Disabled menu entries</strong></p>\n<p>If you want to disable a menu entry, place a <code>!</code> before the menu entry</p>\n<h2>Stretch Element for Justifying Elements</h2>\n<p>Use the <code>Stretch</code> Element to left justify, right justify or center justify one or more elements within their container.</p>\n<p>If a single <code>Stretch</code> Element is on a row, then it will push the other elements on the row to either the left or right.  If <code>Stretch</code> is on the left, then the elements to the rigth will be pushed to the right.</p>\n<p>To center elements, place a <code>Stretch</code> Element on each side of them (2 <code>Stretch</code> Elements will be on the same row)</p>\n<h2>SystemTray Methods</h2>\n<h3>Read - Read the context menu or check for events</h3>\n<pre><span class=\"k\">def</span> <span class=\"nf\">Read</span><span class=\"p\">(</span><span class=\"n\">timeout</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">)</span>\n    <span class=\"sd\">'''  </span>\n<span class=\"sd\"> Reads the context menu  </span>\n<span class=\"sd\"> :param timeout: Optional.  Any value other than None indicates a non-blocking read</span>\n<span class=\"sd\"> :return:   String representing meny item chosen. None if nothing read.  </span>\n<span class=\"sd\">    '''</span>\n</pre>\n<p>The <code>timeout</code> parameter specifies how long to wait for an event to take place.  If nothing happens within the timeout period, then a \"timeout event\" is returned.  These types of reads make it possible to run asynchronously.  To run non-blocked, specify <code>timeout=0</code>on the Read call.</p>\n<p>Read returns the menu text, complete with key, for the menu item chosen.  If you specified <code>Open::key</code> as the menu entry, and the user clicked on <code>Open</code>, then you will receive the string <code>Open::key</code> upon completion of the Read.</p>\n<h4>Read special return values</h4>\n<p>In addition to Menu Items, the Read call can return several special values.    They include:</p>\n<p>EVENT_SYSTEM_TRAY_ICON_DOUBLE_CLICKED - Tray icon was double clicked\nEVENT_SYSTEM_TRAY_ICON_ACTIVATED - Tray icon was single clicked\nEVENT_SYSTEM_TRAY_MESSAGE_CLICKED - a message balloon was clicked\nTIMEOUT_KEY is returned if no events are available if the timeout value is set in the Read call</p>\n<h3>Hide</h3>\n<p>Hides the icon.  Note that no message balloons are shown while an icon is hidden.</p>\n<pre><span class=\"k\">def</span> <span class=\"nf\">Hide</span><span class=\"p\">()</span> \n</pre>\n<h3>Close</h3>\n<p>Does the same thing as hide</p>\n<pre><span class=\"k\">def</span> <span class=\"nf\">Close</span><span class=\"p\">()</span>\n</pre>\n<h3>UnHide</h3>\n<p>Shows a previously hidden icon</p>\n<pre><span class=\"k\">def</span> <span class=\"nf\">UnHide</span><span class=\"p\">()</span>\n</pre>\n<h3>ShowMessage</h3>\n<p>Shows a balloon above the icon in the system tray area.  You can specify your own icon to be shown in the balloon, or you can set <code>messageicon</code> to one of the preset values.</p>\n<p>This message has a custom icon.</p>\n<p><img alt=\"snag-0286\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/a1af2c2d971078fb5b678495a2ef752a12df311f/68747470733a2f2f757365722d696d616765732e67697468756275736572636f6e74656e742e636f6d2f31333639363139332f34393035373435392d61383563323138302d663163642d313165382d396136362d6161333331643765303334632e6a7067\"></p>\n<p>The preset <code>messageicon</code> values are:</p>\n<pre><code>SYSTEM_TRAY_MESSAGE_ICON_INFORMATION \nSYSTEM_TRAY_MESSAGE_ICON_WARNING\nSYSTEM_TRAY_MESSAGE_ICON_CRITICAL \nSYSTEM_TRAY_MESSAGE_ICON_NOICON\n</code></pre>\n<pre><span class=\"n\">ShowMessage</span><span class=\"p\">(</span><span class=\"n\">title</span><span class=\"p\">,</span> <span class=\"n\">message</span><span class=\"p\">,</span> <span class=\"n\">filename</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">data</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">data_base64</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">messageicon</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">time</span><span class=\"o\">=</span><span class=\"mi\">10000</span><span class=\"p\">):</span>  \n    <span class=\"sd\">'''  </span>\n<span class=\"sd\"> Shows a balloon above icon in system tray  </span>\n<span class=\"sd\"> :param title:  Title shown in balloon  </span>\n<span class=\"sd\"> :param message: Message to be displayed  </span>\n<span class=\"sd\"> :param filename: Optional icon filename  </span>\n<span class=\"sd\"> :param data: Optional in-ram icon  </span>\n<span class=\"sd\"> :param data_base64: Optional base64 icon  </span>\n<span class=\"sd\"> :param time: How long to display message in milliseconds  :return:  </span>\n<span class=\"sd\"> '''</span>\n</pre>\n<p>Note, on windows it may be necessary to make a registry change to enable message balloons to be seen.  To fix this, you must create the DWORD you see in this screenshot.</p>\n<p><img alt=\"snag-0285\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/4e586ece828de69ad37fd6ca7f943cda76412147/68747470733a2f2f757365722d696d616765732e67697468756275736572636f6e74656e742e636f6d2f31333639363139332f34393035363134342d36333831626330302d663163382d313165382d396634342d3139393339343832333336392e6a7067\"></p>\n<h3>Update</h3>\n<p>You can update any of these items within a SystemTray object</p>\n<ul>\n<li>Menu definition</li>\n<li>Icon</li>\n<li>Tooltip</li>\n</ul>\n<p>Change them all or just 1.</p>\n<pre><span class=\"n\">Update</span><span class=\"p\">(</span><span class=\"n\">menu</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">tooltip</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span><span class=\"n\">filename</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">data</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,</span> <span class=\"n\">data_base64</span><span class=\"o\">=</span><span class=\"kc\">None</span><span class=\"p\">,)</span>\n    <span class=\"sd\">'''  </span>\n<span class=\"sd\"> Updates the menu, tooltip or icon  </span>\n<span class=\"sd\"> :param menu: menu defintion  </span>\n<span class=\"sd\"> :param tooltip: string representing tooltip  </span>\n<span class=\"sd\"> :param filename:  icon filename  </span>\n<span class=\"sd\"> :param data:  icon raw image  </span>\n<span class=\"sd\"> :param data_base64: icon base 64 image  </span>\n<span class=\"sd\"> :return:  </span>\n<span class=\"sd\"> '''</span>\n</pre>\n<h2>Menus with Keys</h2>\n<p>PySimpleGUIQt offers the ability to add a key to your menu items.  To do so, you add :: and the key value to the end of your menu definition.</p>\n<p><code>menu_def = ['File', ['Hide::key', '&amp;Open::key', '&amp;Save',['1', '2', ['a','b']], '&amp;Properties', 'E&amp;xit']]</code></p>\n<p>The menu definition adds a key \"key\" to the menu entries Hide and Open.</p>\n<p>If you want to change the separator characters from :: top something else,change the variable <code>MENU_KEY_SEPARATOR</code></p>\n<p>When a menu item has a key and it is chosen, then entire string is returned.  If Hide were selected, then Hide::key would be returned from the Read.  Note that the shortcut character &amp; is NOT returned from Reads.</p>\n<h2>Dynamic Windows (Element Visibility)</h2>\n<p>Finally, the ability to grow and shrink has been added as of release 0.20.0</p>\n<p>While the window <strong>appears</strong> to be dynamic, the reality is that the elements are created up front, when you define the window layout.  You will create these \"extra\" elements with the flag <code>visible=False</code>.  Then, when you wish to show those elements, call the element's <code>Update</code> method setting <code>visible=True</code>.</p>\n<p>After you call the <code>Update</code> method, it's important to call <code>window.VisibilityChanged()</code> so that your window can change sizes.  Without that call your window will not shrink. It will grow properly, but it will not shrink.  While this could have been done by PySimpleGUI on the user's behalf, the thought was that perhaps the user wants the window size to remain the same and the element simply appears and disappears, leaving a blank spot.  If the window automatically grew and shrank, this would not be possible.  Just buck-up and make the call to <code>VisibilityChanged</code>.</p>\n<h2><code>enable_events</code> Parameter</h2>\n<p>All elements that are capable of producing events now have a parameter <code>enable_events</code>.  This is <em>identical</em> to the old parameter <code>change_submits</code> or <code>click_submits</code>.  The idea is to standardize on 1 name that all elements use.  The old parameters will continue to work, but the documentation and sample programs will steer you away from them and towards enable_events.</p>\n<h1>Release Notes:</h1>\n<h3>0.12.0   -   20-Nov-2018</h3>\n<p>Correctly restore stdout when Output Element is deleted<br>\nAdded Finalize ability<br>\n<strong>Better multi-window handling... maybe it's finally fixed!</strong><br>\nRadio button default value<br>\nDial element default value<br>\nShow expanded option for trees<br>\nTitles for popups</p>\n<h3>0.13.0 -  22-Nov-2018</h3>\n<p>Focus for Input Text and Multiline Input</p>\n<ul>\n<li>\n<p>Get focus</p>\n</li>\n<li>\n<p>Set focus\nWindow.FindElementWithFocus works\nMultiline input</p>\n</li>\n<li>\n<p>Change submits</p>\n</li>\n<li>\n<p>Update - disabled, append</p>\n</li>\n</ul>\n<p>Multiline output - Update value, append, disabled, get value\nText clicked submits\nFile types for open files\nInitial folder, file types, for browse buttons\nFile types standardized on tkinter data format\nFind Element With Focus now works for input and multiline input\nYet more multiwindow handling\nRelief for Text element\nInput text disable\nCorrect sizing of Comboboxes using visible items parm\nCorrect default values for input and multiline input\nChange submits for multiline\nHorizontal and Vertical separators\nPopupGetFile and PopupGetFolder - no_window option works</p>\n<h3>0.14.0 - 24-Nov-2018</h3>\n<p>Slider tick positions set using relief parm\nButtonMenu Element\nMultiline.Update font parm\nText.Update color and font now work\nButton.Update font support\nWindow.Element = Window.FindElement\nBetter font support for all elements - underline, bold\nElement padding - complete rework\nText element padding\nButton padding\nInput Text padding\nInput Text password char\nListbox padding\nCombobox padding\nMultiline padding\nCheckbox padding\nRadio padding\nProgress Bar padding\nOutput padding\nImage padding\nGraph padding\nSlider - set tick marks using relief parm\nDial - set tick information using resolution and tick interval\nTable padding\nTree padding\nSeparator padding\nForce window sizing should mean windows are better sized\nPopup - better layout</p>\n<h3>0.15.0 24-Nov-2018</h3>\n<p>New SystemTray feature!\nmargin paramter for Text Element.  Takes 4 ints\nCorrected button colors when disabled. For now am restoring them to original colors\nBorder Depth for all elements that support it (inputs, slider, table, tree, etc)\nFix for Element padding done incorrectly!! Sorry about this one</p>\n<h3>0.16.0  24-Nov-2018</h3>\n<p>Easier forcing to use PyQt5 for testing\nPredefined events for Tray Icons</p>\n<ul>\n<li>Double Clicked</li>\n<li>Icon Activated</li>\n<li>Message Clicked</li>\n<li>Timeout key for polling</li>\n</ul>\n<p>Tray icon tooltip\nMenu keys with programmable separator\nBetter element padding hierarchy\nMenubar now returns values as does the ButtonMenu</p>\n<h3>0.17.0  24-Nov-2018</h3>\n<p>Window.Hide and UnHide methods</p>\n<h3>0.18.0 26-Nov-2018</h3>\n<p>Tooltips for all elements\nCompletion of all SystemTray features\nRead with or without timeout\nSpecify icons from 3 sources\nShow message with custom or preset icons\nUpdate</p>\n<ul>\n<li>Menu</li>\n<li>Tooltip</li>\n<li>Icon\nPopupScrolled - new location parameter, fixed bug that wasn't closing window when completed</li>\n</ul>\n<h3>0.19.0 28-Nov-2018</h3>\n<p>Ability to disable menu items by adding ! to the front\nDisable menu works for menus, button menus, system tray menus\nCombo - Update Method - Value, values, disabled, font\nListbox - Update Method - Values, disabled\nListbox - SetValue Method - sets the selected items\nRadio Button - Update Method - value, disabled\nCheckbox - Update Method - value, disabled\nSpinner - Update Method - value, values, disabled\nSpinner - change_submits works\nImage - New feature!  click_submits option (acts like a button in a way)\nWindow - Get screen dimensions\nSlider - disable\nDial - disable</p>\n<h3>0.20.0 6-Dec-2018</h3>\n<ul>\n<li>Ability to change calculations between characters and pixels</li>\n<li>size_px added to ALL elements that have a size parameter</li>\n<li>General Element.Update(widget, background_color, text_color, font, visible)</li>\n<li>visible parameter added to ALL elements</li>\n<li>enable_events flag</li>\n<li>Input text - enable events, visibility, size_px</li>\n<li>Input text update added capabilities\n<ul>\n<li>ability to highlight the input string</li>\n<li>background, text colors and font</li>\n</ul>\n</li>\n<li>Combo - enable events, visibility, size_px</li>\n<li>Combo - auto complete feature</li>\n<li>Combo - added to Update - background color, text color, font, visible</li>\n<li>Listbox - enable events, visibility, size_px</li>\n<li>Listbox - better scaling from characters to pixels</li>\n<li>Listbox - ability to Update with set to index, text color, font, visibility</li>\n<li>Radio - enable events, visibility, size_px</li>\n<li>Radio - Update additions - background_color, text_color, font, visibility</li>\n<li>Checkbox - enable events, visibility, size_px</li>\n<li>Checkbox - Update additions - background_color, text_color, font, visibility</li>\n<li>Spin - enable events, visibility, size_px</li>\n<li>Spin - Update additions - background_color, text_color, font, visibility</li>\n<li>Multiline input - enable events, visibility, size_px</li>\n<li>Multiline input - Update additions - background_color, text_color, font, visibility</li>\n<li>Multiline input better character to pixel scaling</li>\n<li>Multiline output - enable events, visibility, size_px</li>\n<li>Multiline output - Update additions - background_color, text_color, visibility</li>\n<li>Text - enable events, size in pixels</li>\n<li>Text - Update addition of visibility</li>\n<li>Output - visible, size_px</li>\n<li>Output - added update capability with new value, background_color, text_color, font, visibility</li>\n<li>Button - enable events, visible, size_px</li>\n<li>Button - Color Chooser feature completed</li>\n<li>Button - Color Chooser can target (None, None) which will store the value to be returned with the values from Read()</li>\n<li>Button - fixed bug in SaveAs button code.  Bad filter variable</li>\n<li>Button - Updated added font, visibility</li>\n<li>Button - new SetFocus() method will set the focus onto the button</li>\n<li>ButtonMenu - Update method implemented that includes menu definition changes, text, button color, font, visibility</li>\n<li>ProgressBar - added visibility, size_px</li>\n<li>ProgressBar - added Update method for changing the visibility</li>\n<li>Images - events, size_pix, visibility</li>\n<li>Images - can now get click events for images!</li>\n<li>Images - Update added visibility</li>\n<li>Graph - visibility, size_px</li>\n<li>Graph - Update method for changing visibility</li>\n<li>Frame - visibility, size_px</li>\n<li>Frame - Update method added that controls visibility</li>\n<li>ALL elements inside of a Frame that's invisible will also be invisible</li>\n<li>Tab - visible parameter added, however not yet functional!</li>\n<li>TabGroup - enable events, visibility</li>\n<li>TabGroup - Update for controlling visibility</li>\n<li>Slider - enable events, size_px</li>\n<li>Slider - Update method now includes visibility</li>\n<li>Dial - enable events, size_px, visibility</li>\n<li>Dial - Update method added visibilty control</li>\n<li>Column - visibility added</li>\n<li>Column - Added Update method to control visibility</li>\n<li>ALL elements inside of an invisible Column Element will also be invisible</li>\n<li>MenuBar - added visibility</li>\n<li>MenuBar - Update can now change menu definitions at runtime, and control visibility</li>\n<li>Table - enable events, size_px, visibility</li>\n<li>Table - Update method can control visibility</li>\n<li>Tree - enable events, size_px, visibility</li>\n<li>Tree - Update method can control visibility</li>\n<li>VisibilityChanged() function that must be called when using Qt so that the window will shrink or grow</li>\n<li>window.GetScreenDimensions can now be called prior to window creation</li>\n<li>window.Size property</li>\n<li>enable_events added to all of the shortcut buttons and browse buttons</li>\n<li>Ability to set a button image from a file</li>\n<li>Combo - ability to set a default value</li>\n<li>Combo - Read only setting.  Allows for user editing of value</li>\n<li>Menus - Ability to disable / enable any part of a menu by adding a ! before the entry name</li>\n<li>Tabs - ability to set tab text color, background color, background color of selected tab</li>\n<li>Tabs - ability to set widget area's background color</li>\n<li>Sliders - paging works properly (using page-up page-down or slider slider area to advance slider)</li>\n<li>Tree - Setting number of visible rows implemented</li>\n<li>Added 5 pixels to every window.  Have been having issues with text being cutoff on the right side</li>\n<li>SetOptions - ability to change default error button color for popups</li>\n</ul>\n<h3>0.21.0 - 9-Dec-2018</h3>\n<ul>\n<li>Removed use of global variabels - using static class variabels instead</li>\n<li>Listbox.Get() will return current listbox value</li>\n<li>Progressbar now has color support</li>\n<li>Progressbar can be vertical now</li>\n<li>Can change bar or back and background color</li>\n<li>(barcolor, background color - None if use default)</li>\n<li>Table num_rows parameter implemented</li>\n<li>Table.Update - can change number of visible rows</li>\n<li>Window resizable parm - implemented, default changed from False to True</li>\n<li>Window.Move - implemented</li>\n<li>Window.Minimize - implemented</li>\n<li>Window.Disable - implemented</li>\n<li>Window.Enable - implemented</li>\n<li>Window.CurrentLocation - implemented</li>\n<li>Fixed too small scrollbar in Combobox</li>\n<li>Fixed too small scrollbar in Listbox</li>\n<li>Changed \"text\" window to a complex one for quick regression testing (try running PySimpleGUIQt.py by itself)</li>\n</ul>\n<h3>0.22.0 - 9-Dec-2018</h3>\n<ul>\n<li>Spin.Get method - get the current spinner value</li>\n</ul>\n<h3>0.23.0 PySimpleGUIQt</h3>\n<ul>\n<li>Fixed crash that was happening with latest pyside2 release!!!!</li>\n<li>Huge update to OneLineProgressMeter</li>\n<li>Debug window got title and do-not-reroute-std-out option</li>\n<li>Popups get a title option</li>\n<li>PopupScrolled getr non-blocking option</li>\n<li>Default logo included in Base64 Format</li>\n<li>Changed Chars to pixels scaling.  Went from (10,25) to (10,35)</li>\n<li>Changed pixel to chars cutoff from 10 to 12</li>\n<li>Change progress bar default size to 200 from 250</li>\n<li>Reworked the _my_windows global variable / class to use Window class variables</li>\n<li>Change in how Elements / Widgets are updated. Need to use {} correctly</li>\n<li>InputText supports drag and drop</li>\n<li>Support for Checkbox.Get()</li>\n<li>Support for strings in spinbox</li>\n<li>Added Update method to Output element</li>\n<li>Changed Button default file_types from <em>.</em> to *</li>\n<li>Support for Tab enable_events so they now generate events</li>\n<li>Table.Update can change the number of rows of table</li>\n<li>Window class now manages the list of active popups, user defined icon, QTApplication, num open windows</li>\n<li>Window resizable parameter default changed from False to True</li>\n<li>Window new parameter -  disable_minimize</li>\n<li>Window.GetScreenDimensions added</li>\n<li>Window.Move added</li>\n<li>Window.Minimize added</li>\n<li>Window.Maximize added</li>\n<li>Window.Disable added</li>\n<li>Window.Enable added</li>\n<li>Window.BringToFront added</li>\n<li>Window.CurrentLocation added</li>\n<li>TabGroup now returns which tab is selected in the return values</li>\n<li>Completely new Style generation class and functions (I hope it works!!!!)</li>\n<li>Style reworked for Column, Text, Button, Input, Combobox, Listbox, Input Multiline, Output Multiline, Progress Bar, Spinbox, Output,</li>\n<li>Progress Bar colors are now correct</li>\n<li>Events generated when tabs are changed</li>\n<li>\"Better\" Table support.   Uses num_rows now and styles the scrollbar</li>\n<li>Tree element can support multiple types of icons including base64</li>\n<li>Fixed tree element scroll bar</li>\n<li>Icon ccan be set using SetOptions</li>\n<li>main for PySimpleGUIQt.py gets a nice test harness that shows lots of Elements</li>\n</ul>\n<h2>0.24.0 PySimpleGUIQt</h2>\n<ul>\n<li>do_not_clear defaults to TRUE! for Input and MultilineInput/Output</li>\n<li>Key events for tables (unsure what's actually implemented)</li>\n<li>Tree icons can now be bytes in addition to filename!  (More Base64 support)</li>\n</ul>\n<h2>0.25.0 PySimpleGUIQt 5-Apr-2019</h2>\n<ul>\n<li>Uses built-in Default Base64 Logo! (no more .ico file needed)</li>\n<li>New shortcuts for Elements\n<ul>\n<li>I = InputText</li>\n<li>B = Butt = Btn = Button</li>\n</ul>\n</li>\n<li>Convert user supplied button text to string just in case not a string</li>\n<li>Parameter <code>icon</code> in <code>Window</code> call can be Base64 byte string in addition to filename</li>\n</ul>\n<h2>0.26.0 11-Apr-2019 PySimpleGUIQt</h2>\n<ul>\n<li>NEW Window parameter layout so can skip calling Layout</li>\n</ul>\n<h2>0.28.0 PySimpleGUIQt 5-Sep-2019</h2>\n<p>It's been a LONG LONG LONG time coming</p>\n<ul>\n<li>PEP8-ified!  All methods and functions have PEP8 equivalents!! It's a BFD</li>\n<li>Version numbers in the code</li>\n<li>New key dictionary - Window.AllKeysDict has all of the windows keys in 1 place for FASTER lookups</li>\n<li>Element.Widget provides access to low level Qt Widget</li>\n<li>Multiline scaling in addition to single line</li>\n<li>Raised default pixel cutoff for single line scaling to 15 from 12</li>\n<li>Pixel conversion done in Elements and passed through to Element class as size_px</li>\n<li>Renamed lots of private functions and methods to begin with _</li>\n<li>\"Callable\" Elements - element(new_value) will cause element.update(new_value) to be called</li>\n<li>Removed all <strong>del</strong> except for the Output Element one</li>\n<li>Button - Click method added.  Your program can click a button as if a user did</li>\n<li>ButtonbMenu - Click mehtod also added like in Button element</li>\n<li>Graph Element\n<ul>\n<li>Added DrawRectangle method</li>\n<li>Added RelocateFigure method</li>\n<li>Added return of ID to DrawLine, DrawCircle, DrawText</li>\n<li>Added Erase method to erase entire graph</li>\n</ul>\n</li>\n<li>Tab - added Select method so can select a Tab as if user clicked it</li>\n<li>TabGroup - added Get method. Returns key of currently selected Tab, or text of Tab if no key set</li>\n<li>Table - Get method returns the table - GREAT way to enable users to edit a table and get the results</li>\n<li>SystemTray - uses default base64 icon if no icon supplied when creating</li>\n<li>Window - new finalize parameter removes need to add chained call to finalize</li>\n<li>Window.FindElement - added silent_on_error parameter</li>\n<li>Window[key] is the same as Window.FindElement(key)</li>\n<li>Calling a Window object calls Read for that window</li>\n<li>Fix for filetypes. Bug caused (*) to be added onto filetypes when browsing for files</li>\n<li>Combo returns exact value that was provided using an index into Values list instead of string from Qt</li>\n<li>Listbox returns actual supplied items</li>\n<li>Spinner returns avtual supplied item</li>\n<li>Tabgroup returns Tab key</li>\n<li>Finding element with focus now returns element regardless of type (any type of element can be returned)</li>\n<li>Radio Buttons now return events if enabled</li>\n<li>Graph element background colors added, uses new style class</li>\n<li>Table headings supported (where not supported before??)</li>\n<li>Popups switched to using new layout parm in Window call and uses keys too</li>\n</ul>\n<h2>0.30.0 PySimpleGUIQt 16-Nov-2019</h2>\n<ul>\n<li>THEMES!! Over 100 new Look and Feel themes to choose from!</li>\n<li>New func preview_all_look_and_feel_themes() that will display a large window with all possible themes shown</li>\n<li>Metadata!  Now available on all elements when creating and accessable directly by program</li>\n<li>Metadata added to SystemTray objects and Window objects</li>\n<li>Metadata parameter added to all shortcut buttons and funcs</li>\n<li>Completed removal of PyQt5 code</li>\n<li>ML, MLine shortcuts added for Multiline (input)</li>\n<li>MLineOut shortcut for MultilineOutput</li>\n<li>Text element text is optional now</li>\n<li>Fixed bug in BrowseFiles button.  Was only getting first item in list instead of full list of filenames</li>\n<li>BMenu shortcut for ButtonMenu</li>\n<li>PBar, Prog shortcuts for ProgressBar</li>\n<li>Range is now properly set in Slider.Update</li>\n<li>Background color supported for MenuBars now</li>\n<li>Added 5 extra pixels to window size. Now adding a total of 10 so things don't get cut off</li>\n</ul>\n<h2>0.31.0 PySimpleGUIQt 23-Dec-2019</h2>\n<p>Themes and more!</p>\n<ul>\n<li>Added port string so can identify which port is being used (PySimpleGUIQt)</li>\n<li>Removed the Mac speific button and system color settings. Not sure why they existed at all since it's Qt, not tkinter</li>\n<li>Like all PySimpleGUI ports, the default theme is now \"DarkBlue3\"</li>\n<li>TRANSPARENT_BUTTON redefined as an a string explaining that if you're using it, you're not getting what you thought you were</li>\n<li>BROWSE_FILES_DELIMETER so that it can be changed to something other than ';' for systems that ';' is a valid char for filenames</li>\n<li>Can drag and drop into a Multiline Input Element!</li>\n<li>Colored text output for Multiline (hmmm...but not MultilineOutput.. may have to add it)</li>\n<li>Tree Element\n<ul>\n<li>Support for enable_events</li>\n<li>Returns selected rows when reading</li>\n</ul>\n</li>\n<li>Window - better error checking and warnings for window layouts</li>\n<li>Button - changes to help with getting animations back</li>\n<li>TabGroup - Tab positions now supporrted\n<ul>\n<li>left, right, top, bottom, lefttop, leftbottom, righttop, rightbottom, bottomleft, bottomright, topleft, topright</li>\n</ul>\n</li>\n<li>Tables &amp; Trees - text color and background color now work.  Don't appear to have worked before</li>\n</ul>\n<h2>0.32.0 PySimpleGUIQt 4-Apr-2020</h2>\n<p>The \"Jeez... it's been way too LONG since a release\" release</p>\n<p>Highlights - Read with close (Single line GUIs!), Print to Multiline, Scrollable columns</p>\n<ul>\n<li>Listbox.update fix</li>\n<li>Added Graph.change_coordinates</li>\n<li>Added Image.Widget</li>\n<li>Return correct value when Comboxbox has manual data entered</li>\n<li>Multiline.print - new printing capabilities</li>\n<li>Multiline move cursor to end</li>\n<li>Scrollable columns</li>\n<li>Added Listbox.get</li>\n<li>Fix for visible ignored in Text Element</li>\n<li>Window.read - close parameter (YES! Single line GUIs again)</li>\n<li>Multiline readonly parm on update</li>\n<li>Print fixed sep char to act line normal print</li>\n<li>Print (Multiline) added autoscroll parm</li>\n</ul>\n<h2>0.33.0 PySimpleGUIQt 6-May-2020</h2>\n<ul>\n<li>Added constants\n<ul>\n<li>WIN_CLOSED and WINDOW_CLOSED</li>\n<li>EVENT_TIMEOUT and TIMEOUT_EVENT</li>\n</ul>\n</li>\n<li>Added expansion capabilities\n<ul>\n<li>Element.row_frame - The QHBoxLayout the element is contained within</li>\n<li>Column.vbox_layout - The QVBoxLayout contained in Column element</li>\n</ul>\n</li>\n</ul>\n<h1>Design</h1>\n<h2>Author</h2>\n<p>The PySimpleGUI Organization\nPySimpleGUI.org</p>\n<h1>Demo Code Contributors</h1>\n<h1>License</h1>\n<p>GNU Lesser General Public License (LGPL 3) +</p>\n<p>Copytight 2018, 2019 PySimpleGUI</p>\n<h1>Acknowledgments</h1>\n\n          </div>"}, "last_serial": 7182758, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "70b91a38c4afc5cff5970cedcbfa86d7", "sha256": "fa5dc6a2a97f8d75d96159cf209650aac680604f0348364617ab86c2dcc18e04"}, "downloads": -1, "filename": "PySimpleGUIQt-0.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "70b91a38c4afc5cff5970cedcbfa86d7", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 40136, "upload_time": "2018-11-08T20:39:58", "upload_time_iso_8601": "2018-11-08T20:39:58.633202Z", "url": "https://files.pythonhosted.org/packages/59/fa/358aedc4de90ab7577a2cf8bbc9a3ce7c130a67aa67364d87e4712d2fcbb/PySimpleGUIQt-0.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "c6acbe1f8765fa636691a047253ae04d", "sha256": "a81bf1a825c4ba2d18ae9f5ce4883e4ce8782ab230fb41eab5342f6d1394367c"}, "downloads": -1, "filename": "PySimpleGUIQt-0.1.0.tar.gz", "has_sig": false, "md5_digest": "c6acbe1f8765fa636691a047253ae04d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 41211, "upload_time": "2018-11-08T20:40:01", "upload_time_iso_8601": "2018-11-08T20:40:01.757667Z", "url": "https://files.pythonhosted.org/packages/5b/86/6c738035fac1f7661c290cf110bc3a78a1e39d7bededd74cb24307351b40/PySimpleGUIQt-0.1.0.tar.gz", "yanked": false}], "0.10.0": [{"comment_text": "", "digests": {"md5": "8243e8e0a9ccb75bd6a0053512f629c8", "sha256": "30cffee208063228a69bb5ca224916193450913500f6c3dffee3c0b149487880"}, "downloads": -1, "filename": "PySimpleGUIQt-0.10.0-py3-none-any.whl", "has_sig": false, "md5_digest": "8243e8e0a9ccb75bd6a0053512f629c8", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 44095, "upload_time": "2018-11-13T20:00:03", "upload_time_iso_8601": "2018-11-13T20:00:03.771294Z", "url": "https://files.pythonhosted.org/packages/20/85/71d1ead2a434a6b700adf476a6c4a0a72fbaf6527046c09c4cd11cb4c047/PySimpleGUIQt-0.10.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "34df27cd13e121a402965df1e2b1616b", "sha256": "a1a0557318987eaba8fe1e957db0d87c3f82dc049f0828f63d07df5d22522222"}, "downloads": -1, "filename": "PySimpleGUIQt-0.10.0.tar.gz", "has_sig": false, "md5_digest": "34df27cd13e121a402965df1e2b1616b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 45445, "upload_time": "2018-11-13T20:00:05", "upload_time_iso_8601": "2018-11-13T20:00:05.511689Z", "url": "https://files.pythonhosted.org/packages/2e/77/8c1d8e13a1cb0ca32a1d41dd12d732c665b2723e0690776481472b91fab2/PySimpleGUIQt-0.10.0.tar.gz", "yanked": false}], "0.11.0": [{"comment_text": "", "digests": {"md5": "18de07b464901130988df6bca8352806", "sha256": "adb95bee678cb44bb509ac94f0225271332b324f8ca62a9ed7c89ee59b66fd21"}, "downloads": -1, "filename": "PySimpleGUIQt-0.11.0-py3-none-any.whl", "has_sig": false, "md5_digest": "18de07b464901130988df6bca8352806", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 44885, "upload_time": "2018-11-16T22:13:36", "upload_time_iso_8601": "2018-11-16T22:13:36.180710Z", "url": "https://files.pythonhosted.org/packages/a8/e3/575585bb4aec1fb2404002788eddf905e5768f43507ac447a7be19ed8c8f/PySimpleGUIQt-0.11.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "06a7d808aa81045c897e586841d7e0f4", "sha256": "1f5144f7a17e061ae6b2b0321f0b9b69f0d0ee44ba40f8e45cf83f32fc44305a"}, "downloads": -1, "filename": "PySimpleGUIQt-0.11.0.tar.gz", "has_sig": false, "md5_digest": "06a7d808aa81045c897e586841d7e0f4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 46506, "upload_time": "2018-11-16T22:13:37", "upload_time_iso_8601": "2018-11-16T22:13:37.714811Z", "url": "https://files.pythonhosted.org/packages/05/bf/3973d53c4188277997a28b1acd20ed70aba8b681f1d9e4cf6cef21ea57f0/PySimpleGUIQt-0.11.0.tar.gz", "yanked": false}], "0.12.0": [{"comment_text": "", "digests": {"md5": "700a7b0d2d77df3b60e1ca32269742f6", "sha256": "9ed2cffc1f18bf63ed4835c1d8ccb0c7d8c4ee47a597b5a26a29c4b0baf7171e"}, "downloads": -1, "filename": "PySimpleGUIQt-0.12.0-py3-none-any.whl", "has_sig": false, "md5_digest": "700a7b0d2d77df3b60e1ca32269742f6", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 45218, "upload_time": "2018-11-20T17:36:46", "upload_time_iso_8601": "2018-11-20T17:36:46.599789Z", "url": "https://files.pythonhosted.org/packages/15/a0/faa9904ab0b0b17f798b792f2d659983c18a84d15f2bf7912ecb2b054213/PySimpleGUIQt-0.12.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "bbd6ed6786a9e9d47a4d2ea1b0851dec", "sha256": "1e637cd477a24600f5b8b8b2c34b7dd9f47892cdad3162469f83685fe105c1c8"}, "downloads": -1, "filename": "PySimpleGUIQt-0.12.0.tar.gz", "has_sig": false, "md5_digest": "bbd6ed6786a9e9d47a4d2ea1b0851dec", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 46966, "upload_time": "2018-11-20T17:36:48", "upload_time_iso_8601": "2018-11-20T17:36:48.359013Z", "url": "https://files.pythonhosted.org/packages/59/d4/3153568e9af6995ac843563db18605928aa9032a2763cbe0d5eda28f6abb/PySimpleGUIQt-0.12.0.tar.gz", "yanked": false}], "0.13.0": [{"comment_text": "", "digests": {"md5": "7f49b2f85d952c70f9d9c75af37d323c", "sha256": "0a19401c49ff84cb9fc74e72dd08f248091bef90254bd4872af266f7541d7fc2"}, "downloads": -1, "filename": "PySimpleGUIQt-0.13.0-py3-none-any.whl", "has_sig": false, "md5_digest": "7f49b2f85d952c70f9d9c75af37d323c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 46348, "upload_time": "2018-11-22T12:54:31", "upload_time_iso_8601": "2018-11-22T12:54:31.290676Z", "url": "https://files.pythonhosted.org/packages/9c/0a/853a2e66e9a9caafef71143ffdad7ecb0d025945bdcfcc2288c3f569de2f/PySimpleGUIQt-0.13.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f8a4955c7c992b41f2704494f57da1a5", "sha256": "303b38d78bc2c67d86c0f771591db0337d323c87de132bf7a18085347f35c129"}, "downloads": -1, "filename": "PySimpleGUIQt-0.13.0.tar.gz", "has_sig": false, "md5_digest": "f8a4955c7c992b41f2704494f57da1a5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 48394, "upload_time": "2018-11-22T12:54:33", "upload_time_iso_8601": "2018-11-22T12:54:33.339862Z", "url": "https://files.pythonhosted.org/packages/26/f6/695694c9fc8456b642ca9be1e30bc4d954f1d220e5093ae7675f7973ba62/PySimpleGUIQt-0.13.0.tar.gz", "yanked": false}], "0.14.0": [{"comment_text": "", "digests": {"md5": "ffd8380ff0ca67a5ed9e19ae8d9d37bf", "sha256": "77839aba4cdbec7c2e746e2eca23d5b45631bf583a9c5d75757dd7b9a55d1dc9"}, "downloads": -1, "filename": "PySimpleGUIQt-0.14.0-py3-none-any.whl", "has_sig": false, "md5_digest": "ffd8380ff0ca67a5ed9e19ae8d9d37bf", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 47744, "upload_time": "2018-11-24T13:20:13", "upload_time_iso_8601": "2018-11-24T13:20:13.293504Z", "url": "https://files.pythonhosted.org/packages/b1/04/28439e0cf54dedc3a9cecc33ccf6fff4d0a106f8fafc1bd603c0951915da/PySimpleGUIQt-0.14.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4d0baff8cf3605bc1a2030d2e115d912", "sha256": "96f4a2ee296659c0c753b68775f563bf38f075f75653838f987f4a4ec19eb7b9"}, "downloads": -1, "filename": "PySimpleGUIQt-0.14.0.tar.gz", "has_sig": false, "md5_digest": "4d0baff8cf3605bc1a2030d2e115d912", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 50079, "upload_time": "2018-11-24T13:20:15", "upload_time_iso_8601": "2018-11-24T13:20:15.276828Z", "url": "https://files.pythonhosted.org/packages/e0/ad/a02c6a68ec29ff574c7c799cabcac4d77d1e7282624fcb84f4b07bb5d06b/PySimpleGUIQt-0.14.0.tar.gz", "yanked": false}], "0.15.0": [{"comment_text": "", "digests": {"md5": "79ecb636840520e95cf430a6d1a36ce8", "sha256": "d7560d35b5af08990562adaf5f4f13b45c403656efa65688e03771858a361aa2"}, "downloads": -1, "filename": "PySimpleGUIQt-0.15.0-py3-none-any.whl", "has_sig": false, "md5_digest": "79ecb636840520e95cf430a6d1a36ce8", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 49857, "upload_time": "2018-11-25T02:29:08", "upload_time_iso_8601": "2018-11-25T02:29:08.264922Z", "url": "https://files.pythonhosted.org/packages/53/88/081f9ce8216d6224b021dd6207fe160f44862a9890651d8d241ded552306/PySimpleGUIQt-0.15.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "abd311cbe0f5cab4acf353feeb40612f", "sha256": "713710781e3118e3163f0e1f47cad1a9629a5453a5c875076a10b76625a3dac2"}, "downloads": -1, "filename": "PySimpleGUIQt-0.15.0.tar.gz", "has_sig": false, "md5_digest": "abd311cbe0f5cab4acf353feeb40612f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 53438, "upload_time": "2018-11-25T02:29:10", "upload_time_iso_8601": "2018-11-25T02:29:10.664899Z", "url": "https://files.pythonhosted.org/packages/9e/49/b08958f3dfdad50f099e2e161092828419fedf6696b58cad82fef8480301/PySimpleGUIQt-0.15.0.tar.gz", "yanked": false}], "0.16.0": [{"comment_text": "", "digests": {"md5": "4aeb70a6b251ae375e768814b1acfcf3", "sha256": "f91af88f0e7e57850a635e15920ca91f6cd8d12927477e2a74b56bac9fb9d9a8"}, "downloads": -1, "filename": "PySimpleGUIQt-0.16.0-py3-none-any.whl", "has_sig": false, "md5_digest": "4aeb70a6b251ae375e768814b1acfcf3", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 50989, "upload_time": "2018-11-25T21:31:26", "upload_time_iso_8601": "2018-11-25T21:31:26.197925Z", "url": "https://files.pythonhosted.org/packages/c0/91/b762a667ebd20be9554dfc0e65e42a83d6aaf6dab4877e979b69350600b8/PySimpleGUIQt-0.16.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "77e45699f90ad753c4f2268f03bd6436", "sha256": "854e5707e247292282a6626e6014b7e19f0c535a0770834aa8882182c2a8542a"}, "downloads": -1, "filename": "PySimpleGUIQt-0.16.0.tar.gz", "has_sig": false, "md5_digest": "77e45699f90ad753c4f2268f03bd6436", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 55117, "upload_time": "2018-11-25T21:31:27", "upload_time_iso_8601": "2018-11-25T21:31:27.926928Z", "url": "https://files.pythonhosted.org/packages/dd/8a/70a497d00056bc0a51376c75f7768fdba318b71c3cb91fa94e33ce8ada08/PySimpleGUIQt-0.16.0.tar.gz", "yanked": false}], "0.16.1": [{"comment_text": "", "digests": {"md5": "9f95c2044e977ae82a2b1acc04ee62e8", "sha256": "8698faf15b27b81175fd94e81a1d7a6c1aeb604b6510cc88123ae314ebeb292b"}, "downloads": -1, "filename": "PySimpleGUIQt-0.16.1-py3-none-any.whl", "has_sig": false, "md5_digest": "9f95c2044e977ae82a2b1acc04ee62e8", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 51008, "upload_time": "2018-11-25T23:31:35", "upload_time_iso_8601": "2018-11-25T23:31:35.540688Z", "url": "https://files.pythonhosted.org/packages/4f/6a/7931c96ddf88d4b7fa57593dfbabe2ac8bc435367bd5c746df604ea9db9a/PySimpleGUIQt-0.16.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "bd8023e21b871358bd427d8308a4df9e", "sha256": "8fb463caec5d62c4d87a1cdbd52b97e6063cf76687cd1b3cd7008351f6b72e4e"}, "downloads": -1, "filename": "PySimpleGUIQt-0.16.1.tar.gz", "has_sig": false, "md5_digest": "bd8023e21b871358bd427d8308a4df9e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 55134, "upload_time": "2018-11-25T23:31:37", "upload_time_iso_8601": "2018-11-25T23:31:37.161486Z", "url": "https://files.pythonhosted.org/packages/43/91/06707d574900334322c233efe81f78866c70e99ea2ddf0768aa5bc3f4854/PySimpleGUIQt-0.16.1.tar.gz", "yanked": false}], "0.17.0": [{"comment_text": "", "digests": {"md5": "97d3591fd525df261fd53e719170269a", "sha256": "c73c7b54a691255e4e8fc1e60cd9bd3b363948c5059592d174c624c66f2ee666"}, "downloads": -1, "filename": "PySimpleGUIQt-0.17.0-py3-none-any.whl", "has_sig": false, "md5_digest": "97d3591fd525df261fd53e719170269a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 51032, "upload_time": "2018-11-25T23:54:16", "upload_time_iso_8601": "2018-11-25T23:54:16.365076Z", "url": "https://files.pythonhosted.org/packages/e4/71/0a2d670b3b7db7ce0c71a21c4b34b81c0aceb7059a462f580318111df401/PySimpleGUIQt-0.17.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "2e8294f74cc86c11d0bf480756addb56", "sha256": "aa202c9a14ea57676ec62528537cc6e470f5e6a38ae4980e0e52c0dabf1c3189"}, "downloads": -1, "filename": "PySimpleGUIQt-0.17.0.tar.gz", "has_sig": false, "md5_digest": "2e8294f74cc86c11d0bf480756addb56", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 55171, "upload_time": "2018-11-25T23:54:17", "upload_time_iso_8601": "2018-11-25T23:54:17.991758Z", "url": "https://files.pythonhosted.org/packages/e0/01/215b9df96fc193bedd2c042e25fe71b188343db0707bfeb72f76217dad82/PySimpleGUIQt-0.17.0.tar.gz", "yanked": false}], "0.18.0": [{"comment_text": "", "digests": {"md5": "bee7f8b7b551f698620afde5d53198b5", "sha256": "7e82ad1424d0574c03edfd04bde4831c554cba41638a3f12db3e7c488f2a2d2e"}, "downloads": -1, "filename": "PySimpleGUIQt-0.18.0-py3-none-any.whl", "has_sig": false, "md5_digest": "bee7f8b7b551f698620afde5d53198b5", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 53216, "upload_time": "2018-11-27T04:04:35", "upload_time_iso_8601": "2018-11-27T04:04:35.134300Z", "url": "https://files.pythonhosted.org/packages/a7/d8/a2d794a3d66f208f4458ca0b004bee084e9d8243eb781b7c38a859e8a054/PySimpleGUIQt-0.18.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5ca3350c02062c1819f0e8864382231c", "sha256": "79625ee62548f063534eca59c40a8d40c0b52f2c0891409dfa44f635ac01c8d2"}, "downloads": -1, "filename": "PySimpleGUIQt-0.18.0.tar.gz", "has_sig": false, "md5_digest": "5ca3350c02062c1819f0e8864382231c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58781, "upload_time": "2018-11-27T04:04:36", "upload_time_iso_8601": "2018-11-27T04:04:36.873440Z", "url": "https://files.pythonhosted.org/packages/b2/d7/852989d37b43fff28d985648015ba254290e42964e641f7d27a742ea95bd/PySimpleGUIQt-0.18.0.tar.gz", "yanked": false}], "0.19.0": [{"comment_text": "", "digests": {"md5": "9b43b509d79e0d50a47569fa1d252b74", "sha256": "62be658652bffccbd77fa6c6a7fc440a1b7f7bf2b812ea5917fc1ad21ad02ac8"}, "downloads": -1, "filename": "PySimpleGUIQt-0.19.0-py3-none-any.whl", "has_sig": false, "md5_digest": "9b43b509d79e0d50a47569fa1d252b74", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 53773, "upload_time": "2018-11-28T19:25:05", "upload_time_iso_8601": "2018-11-28T19:25:05.598131Z", "url": "https://files.pythonhosted.org/packages/95/46/cf9c488dd696ec5bff62739f2a869a2afb0e58d45a4ae19ec8b3f3da4e1b/PySimpleGUIQt-0.19.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b3cb6a1229466581a186d46bae7c26d7", "sha256": "d5c756ee11f7ac0bc88269f355b64a88b72c4c627a04fa78188e7ca33c6839f0"}, "downloads": -1, "filename": "PySimpleGUIQt-0.19.0.tar.gz", "has_sig": false, "md5_digest": "b3cb6a1229466581a186d46bae7c26d7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 59553, "upload_time": "2018-11-28T19:25:07", "upload_time_iso_8601": "2018-11-28T19:25:07.476178Z", "url": "https://files.pythonhosted.org/packages/be/c8/a6e1ff85d0420462cddf820a4ed9af29dbc45b1d3366d1ff39fc9e5028f0/PySimpleGUIQt-0.19.0.tar.gz", "yanked": false}], "0.2.0": [{"comment_text": "", "digests": {"md5": "49455a9522a78de61c6ba8250ceda41d", "sha256": "2403bc00a05771fc1af7c38483ae359d37d99d8810366ade521c49ffc0ad5f0c"}, "downloads": -1, "filename": "PySimpleGUIQt-0.2.0-py3-none-any.whl", "has_sig": false, "md5_digest": "49455a9522a78de61c6ba8250ceda41d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 40294, "upload_time": "2018-11-09T00:22:50", "upload_time_iso_8601": "2018-11-09T00:22:50.481838Z", "url": "https://files.pythonhosted.org/packages/32/cb/20ce3a6c076b314dec7fa2232da2b8d38bcc9b294cf51145f31936661524/PySimpleGUIQt-0.2.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9b8a93fcab9b95040d5f80ec6ea7ff4d", "sha256": "4508d02c61e731db372a92e484a6b1ebf1f0d0e0e7f1f34cda3143703eb2bf04"}, "downloads": -1, "filename": "PySimpleGUIQt-0.2.0.tar.gz", "has_sig": false, "md5_digest": "9b8a93fcab9b95040d5f80ec6ea7ff4d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 41368, "upload_time": "2018-11-09T00:22:52", "upload_time_iso_8601": "2018-11-09T00:22:52.352661Z", "url": "https://files.pythonhosted.org/packages/c2/63/5006d117e81cf642887af36d296cb9dbc3a68380a9ae24ac535c493d4885/PySimpleGUIQt-0.2.0.tar.gz", "yanked": false}], "0.20.0": [{"comment_text": "", "digests": {"md5": "882b0a9ff16f50e8aa77f2bc2eae36b0", "sha256": "799150cf276a5cca352672f3afcb7538bae96a138b8ab688d4cd9c215b9c2b49"}, "downloads": -1, "filename": "PySimpleGUIQt-0.20.0-py3-none-any.whl", "has_sig": false, "md5_digest": "882b0a9ff16f50e8aa77f2bc2eae36b0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 57771, "upload_time": "2018-12-06T18:59:55", "upload_time_iso_8601": "2018-12-06T18:59:55.139316Z", "url": "https://files.pythonhosted.org/packages/cf/81/e3566b604946f5ea82939af050f029a1dfde736fb096da8e74a4e06c3f9e/PySimpleGUIQt-0.20.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "33389fb06adb8c9b46c19d592d1f2cd0", "sha256": "ff89fbcad7775d5a35ee30204b66d9aa2363d70a6a7ee21358dcfd4442a4e0f1"}, "downloads": -1, "filename": "PySimpleGUIQt-0.20.0.tar.gz", "has_sig": false, "md5_digest": "33389fb06adb8c9b46c19d592d1f2cd0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 65360, "upload_time": "2018-12-06T19:00:05", "upload_time_iso_8601": "2018-12-06T19:00:05.452696Z", "url": "https://files.pythonhosted.org/packages/c0/fe/b7e86f4e48d07480b6e494a04dfe7c8ad41f70a3d27aa8c72c3d5ae1b252/PySimpleGUIQt-0.20.0.tar.gz", "yanked": false}], "0.21.0": [{"comment_text": "", "digests": {"md5": "5dd214d68e4b20f941289a14babbd62e", "sha256": "95c84dcfe600b433d4bc753bb0f980c83549fdf90494f5dd159eefcde4cbc0ca"}, "downloads": -1, "filename": "PySimpleGUIQt-0.21.0-py3-none-any.whl", "has_sig": false, "md5_digest": "5dd214d68e4b20f941289a14babbd62e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 58052, "upload_time": "2018-12-10T00:29:12", "upload_time_iso_8601": "2018-12-10T00:29:12.404208Z", "url": "https://files.pythonhosted.org/packages/85/10/0e2bba7ab5928ba608c31527dba1347cc92da6e0bcc45306a37b220f48c3/PySimpleGUIQt-0.21.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "da3105b2bf7071c256f38d2169203345", "sha256": "70bb4d648b6dd3bbf28c4daa37d089dd0c1725a0b460a442d4a75f53771eb01c"}, "downloads": -1, "filename": "PySimpleGUIQt-0.21.0.tar.gz", "has_sig": false, "md5_digest": "da3105b2bf7071c256f38d2169203345", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 65941, "upload_time": "2018-12-10T00:29:16", "upload_time_iso_8601": "2018-12-10T00:29:16.327629Z", "url": "https://files.pythonhosted.org/packages/40/a9/a8677b80bf57be99354ed790dc9726bf66caa5518051525affbbfc907f17/PySimpleGUIQt-0.21.0.tar.gz", "yanked": false}], "0.22.0": [{"comment_text": "", "digests": {"md5": "209d2a886d268c3c3fb9290a93b6ff13", "sha256": "45aa0d2c0fba2ee7d6f5f7adcd98613fbfeb15b3adaf502370a37cdf480edc2a"}, "downloads": -1, "filename": "PySimpleGUIQt-0.22.0-py3-none-any.whl", "has_sig": false, "md5_digest": "209d2a886d268c3c3fb9290a93b6ff13", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 58092, "upload_time": "2018-12-10T00:35:49", "upload_time_iso_8601": "2018-12-10T00:35:49.057462Z", "url": "https://files.pythonhosted.org/packages/b7/20/0771e00180980bf63e339bd40e95faa12008e93d4dc84e725f1df07397db/PySimpleGUIQt-0.22.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "2b7b53864f543d943fc078aa5b50d20d", "sha256": "6dff2843cd1193d6c1d05ea9c111eaf7105ad6908a219e8dd8490f5612a81c1d"}, "downloads": -1, "filename": "PySimpleGUIQt-0.22.0.tar.gz", "has_sig": false, "md5_digest": "2b7b53864f543d943fc078aa5b50d20d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 66003, "upload_time": "2018-12-10T00:35:51", "upload_time_iso_8601": "2018-12-10T00:35:51.421694Z", "url": "https://files.pythonhosted.org/packages/0a/65/9cc1d86c94af38bd5457b1c3caf1d6da973e9d9fc238c9d224077b70bdea/PySimpleGUIQt-0.22.0.tar.gz", "yanked": false}], "0.23.0": [{"comment_text": "", "digests": {"md5": "525789ce884ee35f4ce5da0c2d45f2c0", "sha256": "1d64e79c4f0ea7c564a4c9820de050b8ac4bd7c1ffe498c1a85b4a9037dba321"}, "downloads": -1, "filename": "PySimpleGUIQt-0.23.0-py3-none-any.whl", "has_sig": false, "md5_digest": "525789ce884ee35f4ce5da0c2d45f2c0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 62293, "upload_time": "2019-03-08T15:55:11", "upload_time_iso_8601": "2019-03-08T15:55:11.457955Z", "url": "https://files.pythonhosted.org/packages/73/15/0e0dd5c5fb36772f90c6a68a58d833f8fafc80e0477c51b3fcc53b2ce176/PySimpleGUIQt-0.23.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "cb1410acbbd5e8510081c91a3f41ea12", "sha256": "5eaf86898026d83ea460fa39cf95163163789043c54d4c7807c18c9f42a9b387"}, "downloads": -1, "filename": "PySimpleGUIQt-0.23.0.tar.gz", "has_sig": false, "md5_digest": "cb1410acbbd5e8510081c91a3f41ea12", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 70994, "upload_time": "2019-03-08T15:55:13", "upload_time_iso_8601": "2019-03-08T15:55:13.276795Z", "url": "https://files.pythonhosted.org/packages/e1/6e/1b9e63ec3be4ef85c45c9842de0280942b63b5bbe164fd99306d26a5a5b9/PySimpleGUIQt-0.23.0.tar.gz", "yanked": false}], "0.24.0": [{"comment_text": "", "digests": {"md5": "6e6b7a56eb32cf6fe007e72616033a20", "sha256": "d179fa28fce499894dfe93acf716ea00479fae4ed9ebb3a52d11d21926f0f7fa"}, "downloads": -1, "filename": "PySimpleGUIQt-0.24.0-py3-none-any.whl", "has_sig": false, "md5_digest": "6e6b7a56eb32cf6fe007e72616033a20", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 62567, "upload_time": "2019-03-23T20:55:57", "upload_time_iso_8601": "2019-03-23T20:55:57.475694Z", "url": "https://files.pythonhosted.org/packages/d9/0a/7b7ecdf7ca29656d5b1c79885c8d7a0cf66c06d6e9ce9e75dde7a3dcea08/PySimpleGUIQt-0.24.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "17a0913254945d64944e92242bbeb1c2", "sha256": "35ef3319dbe313cd45f226d70efd614c4b69556b0f72064d28345bc89a34a96e"}, "downloads": -1, "filename": "PySimpleGUIQt-0.24.0.tar.gz", "has_sig": false, "md5_digest": "17a0913254945d64944e92242bbeb1c2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 71334, "upload_time": "2019-03-23T20:55:59", "upload_time_iso_8601": "2019-03-23T20:55:59.768662Z", "url": "https://files.pythonhosted.org/packages/d2/7c/ea4fa3eb1737c226e98af28ab19ff15b6b97a7feecb29d4b137c7faa306a/PySimpleGUIQt-0.24.0.tar.gz", "yanked": false}], "0.25.0": [{"comment_text": "", "digests": {"md5": "1f2bfd24ccc373216c73485fb4684cc8", "sha256": "02ec3929eaa8b30c9ede9c7b9d035c5f59ff6090b42ebf1b74bdf383eeb03dab"}, "downloads": -1, "filename": "PySimpleGUIQt-0.25.0-py3-none-any.whl", "has_sig": false, "md5_digest": "1f2bfd24ccc373216c73485fb4684cc8", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 63492, "upload_time": "2019-04-05T18:04:41", "upload_time_iso_8601": "2019-04-05T18:04:41.422818Z", "url": "https://files.pythonhosted.org/packages/2a/66/e55a947e3ad810717cb9bb66122ebd46f56d4c00db77a0a62e6535fa01e1/PySimpleGUIQt-0.25.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "66d7d1482a910ab6021113b8b5b5a385", "sha256": "52870030178fd38055f8b01bf6485a286244cf889026ba8f243a9f5697cf195d"}, "downloads": -1, "filename": "PySimpleGUIQt-0.25.0.tar.gz", "has_sig": false, "md5_digest": "66d7d1482a910ab6021113b8b5b5a385", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 72477, "upload_time": "2019-04-05T18:04:45", "upload_time_iso_8601": "2019-04-05T18:04:45.351444Z", "url": "https://files.pythonhosted.org/packages/8b/b3/e9cf59cb487a2785edc3b093d2deab5360349ac1838f85f7a7ad31b611a7/PySimpleGUIQt-0.25.0.tar.gz", "yanked": false}], "0.26.0": [{"comment_text": "", "digests": {"md5": "14d354f68adabaf699498a340277de57", "sha256": "8a385223fffac0799805c86f4825f2801690f90799be76f9d0d7d6e524d7cc0d"}, "downloads": -1, "filename": "PySimpleGUIQt-0.26.0-py3-none-any.whl", "has_sig": false, "md5_digest": "14d354f68adabaf699498a340277de57", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 63539, "upload_time": "2019-04-11T22:29:14", "upload_time_iso_8601": "2019-04-11T22:29:14.692882Z", "url": "https://files.pythonhosted.org/packages/f8/e3/cd21c1640f7c691362750dca5e3e7f7b18ccf2a321a08e21369ad8c21cce/PySimpleGUIQt-0.26.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e12d6d1bbb970eb739ae75622b141a23", "sha256": "9893144a2aec08d06577198dfc3468131b4cba176864071f356614eb0c398fd5"}, "downloads": -1, "filename": "PySimpleGUIQt-0.26.0.tar.gz", "has_sig": false, "md5_digest": "e12d6d1bbb970eb739ae75622b141a23", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 72544, "upload_time": "2019-04-11T22:29:18", "upload_time_iso_8601": "2019-04-11T22:29:18.348489Z", "url": "https://files.pythonhosted.org/packages/0d/aa/867f56c3aa8e557978c93d25583eb17298cf1467143e1075b56afae9d59e/PySimpleGUIQt-0.26.0.tar.gz", "yanked": false}], "0.28.0": [{"comment_text": "", "digests": {"md5": "841b5bc4ad8354165b6325c1843b24b9", "sha256": "13299df490a8400f1b135540b92ce3c2e5422b72fd40eac221b7a8e61b60a98a"}, "downloads": -1, "filename": "PySimpleGUIQt-0.28.0-py3-none-any.whl", "has_sig": false, "md5_digest": "841b5bc4ad8354165b6325c1843b24b9", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 68216, "upload_time": "2019-09-06T15:30:23", "upload_time_iso_8601": "2019-09-06T15:30:23.129809Z", "url": "https://files.pythonhosted.org/packages/13/12/3db2eb4751745fdc48572fc8bdf0bfa4a1e770027123208965e25a1d1c94/PySimpleGUIQt-0.28.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "481ef2486951cdb936d3f75ecdc37263", "sha256": "57d614f3ba76f3c20ba9fb207da8907fcc7e1f6ad2481285594681dd23e8a7d9"}, "downloads": -1, "filename": "PySimpleGUIQt-0.28.0.tar.gz", "has_sig": false, "md5_digest": "481ef2486951cdb936d3f75ecdc37263", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 78341, "upload_time": "2019-09-06T15:30:28", "upload_time_iso_8601": "2019-09-06T15:30:28.069197Z", "url": "https://files.pythonhosted.org/packages/ae/eb/7c43187ae3db49558306d38ee39927aa267a67bb6fcd07d216ffe90f361d/PySimpleGUIQt-0.28.0.tar.gz", "yanked": false}], "0.3.0": [{"comment_text": "", "digests": {"md5": "b62b4e0f048b22318c6dada0453f92f6", "sha256": "f41ae1eb26ec3966bda5e81257344f29c30e9cc7f455d4debd064f7bdf03a29b"}, "downloads": -1, "filename": "PySimpleGUIQt-0.3.0-py3-none-any.whl", "has_sig": false, "md5_digest": "b62b4e0f048b22318c6dada0453f92f6", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 40760, "upload_time": "2018-11-09T17:07:30", "upload_time_iso_8601": "2018-11-09T17:07:30.867119Z", "url": "https://files.pythonhosted.org/packages/f0/89/21c02a1ea7688dbc80b65a6fed56b5e219f0d2d98d6bed254f7a5804eda7/PySimpleGUIQt-0.3.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "5dd2ed22e13e21b4d89930ce5fe1b9dd", "sha256": "c723ad0b3a26599045c753d443fa9ad53d7d3b92fe8b88b5a33ba05af016128d"}, "downloads": -1, "filename": "PySimpleGUIQt-0.3.0.tar.gz", "has_sig": false, "md5_digest": "5dd2ed22e13e21b4d89930ce5fe1b9dd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 41876, "upload_time": "2018-11-09T17:07:32", "upload_time_iso_8601": "2018-11-09T17:07:32.480544Z", "url": "https://files.pythonhosted.org/packages/c3/6e/38bd0d869a46b6766c9fd58637110ad5765c784b662d2987db87557c069f/PySimpleGUIQt-0.3.0.tar.gz", "yanked": false}], "0.30.0": [{"comment_text": "", "digests": {"md5": "3afaf1b9d95e1092135bb0298aa918d9", "sha256": "3d1fbf97e46f804d781c54e35cdcd6268ab1a1711af851e19cebb1c3bc8cd082"}, "downloads": -1, "filename": "PySimpleGUIQt-0.30.0-py3-none-any.whl", "has_sig": false, "md5_digest": "3afaf1b9d95e1092135bb0298aa918d9", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 73282, "upload_time": "2019-11-16T20:31:08", "upload_time_iso_8601": "2019-11-16T20:31:08.970906Z", "url": "https://files.pythonhosted.org/packages/d2/18/99f25ffed52c5c7e2e07084cf702ec13966c1bb00e4dd92c4f3ac36d3ff8/PySimpleGUIQt-0.30.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "839fbf06cf027c6afd71753d492e688a", "sha256": "19a6e68cbbde991a284e04a84679d66fffbc99c4bea90d9017fc9d004eccde3f"}, "downloads": -1, "filename": "PySimpleGUIQt-0.30.0.tar.gz", "has_sig": false, "md5_digest": "839fbf06cf027c6afd71753d492e688a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 83705, "upload_time": "2019-11-16T20:31:14", "upload_time_iso_8601": "2019-11-16T20:31:14.221710Z", "url": "https://files.pythonhosted.org/packages/4e/78/48c9599caa828de5d878e078941a4360a5c6826f2a50944d0742808c3e8b/PySimpleGUIQt-0.30.0.tar.gz", "yanked": false}], "0.31.0": [{"comment_text": "", "digests": {"md5": "59179069e3aacc29772f4795ca203ef7", "sha256": "d0828ba84b7f6ef6a1ec2eff8344aee80d81df8f84ae0bdcffaeda1966bee34e"}, "downloads": -1, "filename": "PySimpleGUIQt-0.31.0-py3-none-any.whl", "has_sig": false, "md5_digest": "59179069e3aacc29772f4795ca203ef7", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 79067, "upload_time": "2019-12-24T17:55:31", "upload_time_iso_8601": "2019-12-24T17:55:31.097746Z", "url": "https://files.pythonhosted.org/packages/c0/85/a79bf6313c2fb1845eda9ded142c1ce86dbd61b140af68ec54c711a9ad52/PySimpleGUIQt-0.31.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7d2d88488f128388cf4bcb5e1adb5787", "sha256": "b1552414e70591fcb094af3a1a7ffce13325722c5fc12030c1c58fcecacc6b3b"}, "downloads": -1, "filename": "PySimpleGUIQt-0.31.0.tar.gz", "has_sig": false, "md5_digest": "7d2d88488f128388cf4bcb5e1adb5787", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 90162, "upload_time": "2019-12-24T17:55:34", "upload_time_iso_8601": "2019-12-24T17:55:34.935871Z", "url": "https://files.pythonhosted.org/packages/66/7e/e196028f2bc093417fd82f2fdcb49e5d75888560eddb4d7d79bbf50f32f5/PySimpleGUIQt-0.31.0.tar.gz", "yanked": false}], "0.32.0": [{"comment_text": "", "digests": {"md5": "ce534b7e9898dc83394d6a448be5cc87", "sha256": "b1c8f804795fe48f4b4fbb511286b9ec73f4fbe7100fbe4db416f6c275cc68d8"}, "downloads": -1, "filename": "PySimpleGUIQt-0.32.0-py3-none-any.whl", "has_sig": false, "md5_digest": "ce534b7e9898dc83394d6a448be5cc87", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 81100, "upload_time": "2020-04-04T14:44:38", "upload_time_iso_8601": "2020-04-04T14:44:38.795145Z", "url": "https://files.pythonhosted.org/packages/07/2e/6b6eaae86845629bea309b82c60a697f20d66a0f74fe7baf8a0a6dcaddac/PySimpleGUIQt-0.32.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "2e328f9f9ede4ef5678cd09fc571ab06", "sha256": "fde2b0dabd146514d034857638dd89f164f1f73b6d7c19f4646670f2aef536d4"}, "downloads": -1, "filename": "PySimpleGUIQt-0.32.0.tar.gz", "has_sig": false, "md5_digest": "2e328f9f9ede4ef5678cd09fc571ab06", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 92429, "upload_time": "2020-04-04T14:44:40", "upload_time_iso_8601": "2020-04-04T14:44:40.566685Z", "url": "https://files.pythonhosted.org/packages/29/b2/63579787da6a3fff6072d2c732ed751091acd372c47ab3c327c7fab5def9/PySimpleGUIQt-0.32.0.tar.gz", "yanked": false}], "0.33.0": [{"comment_text": "", "digests": {"md5": "118aaa868e7844b6566c7b65e2dbff46", "sha256": "f8014b3194bd6d0bec767ade9e2c8076af64e7ce0b0183bbc7ed58bdfc81fe68"}, "downloads": -1, "filename": "PySimpleGUIQt-0.33.0-py3-none-any.whl", "has_sig": false, "md5_digest": "118aaa868e7844b6566c7b65e2dbff46", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 81345, "upload_time": "2020-05-06T20:00:27", "upload_time_iso_8601": "2020-05-06T20:00:27.414412Z", "url": "https://files.pythonhosted.org/packages/55/26/cc8e8de2a6f167926e25180e7b922b8784dde63e85b10d645ca05dec464a/PySimpleGUIQt-0.33.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "56d1898bb3805f686890630c97513455", "sha256": "b2e3ee719294cb1e7fdc43cadd89a322381c0bb476f37abcca9ed6bbaa059152"}, "downloads": -1, "filename": "PySimpleGUIQt-0.33.0.tar.gz", "has_sig": false, "md5_digest": "56d1898bb3805f686890630c97513455", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 92748, "upload_time": "2020-05-06T20:00:28", "upload_time_iso_8601": "2020-05-06T20:00:28.853083Z", "url": "https://files.pythonhosted.org/packages/f9/a8/49d2be7633cc54352cb28eb58367e919093a32560f36590ad087ea00ba08/PySimpleGUIQt-0.33.0.tar.gz", "yanked": false}], "0.4.0": [{"comment_text": "", "digests": {"md5": "acdc843a571bd39d2f8a41a599866f24", "sha256": "7dda3c221e6aba91ff68e1027321ab2c7504a2699a0942546eab58b2e17a5f21"}, "downloads": -1, "filename": "PySimpleGUIQt-0.4.0-py3-none-any.whl", "has_sig": false, "md5_digest": "acdc843a571bd39d2f8a41a599866f24", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 41590, "upload_time": "2018-11-10T21:39:16", "upload_time_iso_8601": "2018-11-10T21:39:16.826407Z", "url": "https://files.pythonhosted.org/packages/9e/3f/cca9c2fc626bef51a7525762ca55f7077054f8083389c905b4897100d3ca/PySimpleGUIQt-0.4.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f2c9dba21db16820d8ee46726b562530", "sha256": "a9a011ccd1541f31e535bcfc869697b39d68204b92a0730da2394a9644c968d8"}, "downloads": -1, "filename": "PySimpleGUIQt-0.4.0.tar.gz", "has_sig": false, "md5_digest": "f2c9dba21db16820d8ee46726b562530", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42661, "upload_time": "2018-11-10T21:39:18", "upload_time_iso_8601": "2018-11-10T21:39:18.443141Z", "url": "https://files.pythonhosted.org/packages/2a/f1/c62e6ab74b0b29b3b84f76de91988c049905fa5dce93731070a399beaa8e/PySimpleGUIQt-0.4.0.tar.gz", "yanked": false}], "0.5.0": [{"comment_text": "", "digests": {"md5": "807b03eb5d716f5e0065eee1d4662a07", "sha256": "5784f31e9ce5272e380710eb7174a4c7c21bf17b8563239cd39980e90745b6bf"}, "downloads": -1, "filename": "PySimpleGUIQt-0.5.0-py3-none-any.whl", "has_sig": false, "md5_digest": "807b03eb5d716f5e0065eee1d4662a07", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 41674, "upload_time": "2018-11-10T22:34:47", "upload_time_iso_8601": "2018-11-10T22:34:47.522367Z", "url": "https://files.pythonhosted.org/packages/e1/f4/9f975dbdceae6a0458716a01c25c6502b6be6eba2e8dc919e74712509552/PySimpleGUIQt-0.5.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "014190b7d3a113451a384665650cb957", "sha256": "e89330cf43006b14590c4e8b0732956b0d69dc127bc78e81d0f07100af9c4ecc"}, "downloads": -1, "filename": "PySimpleGUIQt-0.5.0.tar.gz", "has_sig": false, "md5_digest": "014190b7d3a113451a384665650cb957", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42730, "upload_time": "2018-11-10T22:34:49", "upload_time_iso_8601": "2018-11-10T22:34:49.016943Z", "url": "https://files.pythonhosted.org/packages/bc/f9/bca0937f84825a358dec404524f6d413e929ea358f9398ce4894f8ca584a/PySimpleGUIQt-0.5.0.tar.gz", "yanked": false}], "0.6.0": [{"comment_text": "", "digests": {"md5": "4d31b637dd121b4a69f637e22270efcb", "sha256": "f898afae8c5338d7e6c29bdc8b5ed8a59eb82bc0919109c8625ae0235f9917a1"}, "downloads": -1, "filename": "PySimpleGUIQt-0.6.0-py3-none-any.whl", "has_sig": false, "md5_digest": "4d31b637dd121b4a69f637e22270efcb", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 41795, "upload_time": "2018-11-11T18:08:42", "upload_time_iso_8601": "2018-11-11T18:08:42.120799Z", "url": "https://files.pythonhosted.org/packages/4e/df/0763db00ea2132c9385b63fff017417165f8b3eeeb2e993dbad66e82c8c5/PySimpleGUIQt-0.6.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4f217b1616b05d49fcfb3ca1e6835ab3", "sha256": "4cd64b29e030712450af13776c1b877694fb14cf5cc9001e47a57a0291a69864"}, "downloads": -1, "filename": "PySimpleGUIQt-0.6.0.tar.gz", "has_sig": false, "md5_digest": "4f217b1616b05d49fcfb3ca1e6835ab3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42966, "upload_time": "2018-11-11T18:08:44", "upload_time_iso_8601": "2018-11-11T18:08:44.280994Z", "url": "https://files.pythonhosted.org/packages/69/7b/1f852944058afc940648d2017ca08f9c110e6f676da57d6c87878a9b26d7/PySimpleGUIQt-0.6.0.tar.gz", "yanked": false}], "0.7.0": [{"comment_text": "", "digests": {"md5": "b7e9245e9449f9caf41dd8d81c81caff", "sha256": "3af77ce3b0d188de7b6c7cc541098d153e7917f124c989663cd25b6eaddabed1"}, "downloads": -1, "filename": "PySimpleGUIQt-0.7.0-py3-none-any.whl", "has_sig": false, "md5_digest": "b7e9245e9449f9caf41dd8d81c81caff", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 42519, "upload_time": "2018-11-11T19:50:54", "upload_time_iso_8601": "2018-11-11T19:50:54.593937Z", "url": "https://files.pythonhosted.org/packages/16/9d/0cfa63604432ae600840de41faa2ed3c1d28ffa0c8302fc90c621c58e240/PySimpleGUIQt-0.7.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b833373b6841295fa11eb77a78cf2cf0", "sha256": "c0789e944a1b1232650e8f4786fcd25929663ba71c50f022389aad5a85279066"}, "downloads": -1, "filename": "PySimpleGUIQt-0.7.0.tar.gz", "has_sig": false, "md5_digest": "b833373b6841295fa11eb77a78cf2cf0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 43748, "upload_time": "2018-11-11T19:50:56", "upload_time_iso_8601": "2018-11-11T19:50:56.226569Z", "url": "https://files.pythonhosted.org/packages/22/e7/c811c7ea838a931ba816810ac7b0fd144ce070e575955e3d25ca1dc2314e/PySimpleGUIQt-0.7.0.tar.gz", "yanked": false}], "0.9.0": [{"comment_text": "", "digests": {"md5": "5c69b463b736880237150f4c6e69c622", "sha256": "a990ca0e17248f45390e677f5bfd1cd4c5391228d62a41fd239632efcb2acb11"}, "downloads": -1, "filename": "PySimpleGUIQt-0.9.0-py3-none-any.whl", "has_sig": false, "md5_digest": "5c69b463b736880237150f4c6e69c622", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 43670, "upload_time": "2018-11-12T19:23:56", "upload_time_iso_8601": "2018-11-12T19:23:56.542374Z", "url": "https://files.pythonhosted.org/packages/71/30/34bd3688633a107bc5ac9b069dab1dd5ea2e220808669873ba6d74f42e3e/PySimpleGUIQt-0.9.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a46b47be527047ba697c7d0a576d7910", "sha256": "b52e99f15e765f795318fc35c9dd2fe6c28a2db4e1c8fff839ac1ac73f0be1f8"}, "downloads": -1, "filename": "PySimpleGUIQt-0.9.0.tar.gz", "has_sig": false, "md5_digest": "a46b47be527047ba697c7d0a576d7910", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 45072, "upload_time": "2018-11-12T19:23:58", "upload_time_iso_8601": "2018-11-12T19:23:58.810181Z", "url": "https://files.pythonhosted.org/packages/1e/41/c0ac93f149db8b469719c5770abaeb5970babc6a841b466604aafbafd0af/PySimpleGUIQt-0.9.0.tar.gz", "yanked": false}], "0.9.1": [{"comment_text": "", "digests": {"md5": "0dd2059e84bb9c52481f9b42d4d00255", "sha256": "57e8795b052c82549246f96075384e3920ec37d6df7f26154bcff1ecfae12ad7"}, "downloads": -1, "filename": "PySimpleGUIQt-0.9.1-py3-none-any.whl", "has_sig": false, "md5_digest": "0dd2059e84bb9c52481f9b42d4d00255", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 43683, "upload_time": "2018-11-12T21:12:25", "upload_time_iso_8601": "2018-11-12T21:12:25.897195Z", "url": "https://files.pythonhosted.org/packages/7e/83/0d4e21c626d28f9db68efdbf10bd60af08f05c4730b03684310ae71c01c3/PySimpleGUIQt-0.9.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "3ba2c4b1a0a886e3998282586e8e4c2c", "sha256": "50e810a4a650b27a6fc05621516a6fd695d2ca25ab6d448604c4fee1b88c3bc7"}, "downloads": -1, "filename": "PySimpleGUIQt-0.9.1.tar.gz", "has_sig": false, "md5_digest": "3ba2c4b1a0a886e3998282586e8e4c2c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 45112, "upload_time": "2018-11-12T21:12:28", "upload_time_iso_8601": "2018-11-12T21:12:28.181719Z", "url": "https://files.pythonhosted.org/packages/c1/6b/721f793e52c3309966551b1b76bf7065378a21839fe82a060008f8a8941e/PySimpleGUIQt-0.9.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "118aaa868e7844b6566c7b65e2dbff46", "sha256": "f8014b3194bd6d0bec767ade9e2c8076af64e7ce0b0183bbc7ed58bdfc81fe68"}, "downloads": -1, "filename": "PySimpleGUIQt-0.33.0-py3-none-any.whl", "has_sig": false, "md5_digest": "118aaa868e7844b6566c7b65e2dbff46", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 81345, "upload_time": "2020-05-06T20:00:27", "upload_time_iso_8601": "2020-05-06T20:00:27.414412Z", "url": "https://files.pythonhosted.org/packages/55/26/cc8e8de2a6f167926e25180e7b922b8784dde63e85b10d645ca05dec464a/PySimpleGUIQt-0.33.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "56d1898bb3805f686890630c97513455", "sha256": "b2e3ee719294cb1e7fdc43cadd89a322381c0bb476f37abcca9ed6bbaa059152"}, "downloads": -1, "filename": "PySimpleGUIQt-0.33.0.tar.gz", "has_sig": false, "md5_digest": "56d1898bb3805f686890630c97513455", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 92748, "upload_time": "2020-05-06T20:00:28", "upload_time_iso_8601": "2020-05-06T20:00:28.853083Z", "url": "https://files.pythonhosted.org/packages/f9/a8/49d2be7633cc54352cb28eb58367e919093a32560f36590ad087ea00ba08/PySimpleGUIQt-0.33.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:56:44 2020"}