{"info": {"author": "Skycoder42", "author_email": "skycoder42.de@gmx.de", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: BSD License", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# qdep\nA very basic yet simple to use dependency management tool for qmake based projects.\n\n[![Travis Build Status](https://travis-ci.org/Skycoder42/qdep.svg?branch=master)](https://travis-ci.org/Skycoder42/qdep)\n[![Appveyor Build status](https://ci.appveyor.com/api/projects/status/s222vatjpd4ic70w/branch/master?svg=true)](https://ci.appveyor.com/project/Skycoder42/qdep/branch/master)\n[![Codacy Badge](https://api.codacy.com/project/badge/Grade/373a21f05f8847c29ce08739891631e8)](https://www.codacy.com/app/Skycoder42/qdep)\n[![AUR](https://img.shields.io/aur/version/qdep.svg)](https://aur.archlinux.org/packages/qdep/)\n[![PyPi](https://img.shields.io/pypi/v/qdep.svg)](https://pypi.org/project/qdep/)\n\n## Table of contents\n- [qdep](#qdep)\n  * [Features](#features)\n  * [Design Goals/Scope](#design-goals-scope)\n  * [Installation](#installation)\n    + [Preparing qmake](#preparing-qmake)\n    + [Shell completitions](#shell-completitions)\n  * [Getting started](#getting-started)\n  * [Getting deeper](#getting-deeper)\n    + [Dependency IDs](#dependency-ids)\n      - [Versioning](#versioning)\n      - [Package-uniqueness and version conflicts](#package-uniqueness-and-version-conflicts)\n    + [Normal dependencies](#normal-dependencies)\n      - [Translations](#translations)\n      - [Library support](#library-support)\n      - [Creating normal dependencies](#creating-normal-dependencies)\n        * [Creating qdep translations](#creating-qdep-translations)\n        * [Resources and hooks](#resources-and-hooks)\n        * [Automatic exports](#automatic-exports)\n    + [Project dependencies](#project-dependencies)\n      - [Creating project dependencies](#creating-project-dependencies)\n  * [Documentation](#documentation)\n    + [Command line interface](#command-line-interface)\n      - [Public API operations:](#public-api-operations-)\n      - [Private API operations:](#private-api-operations-)\n    + [QMAKE-Feature](#qmake-feature)\n      - [Variables](#variables)\n        * [Common Variables](#common-variables)\n        * [SUBDIRS extension](#subdirs-extension)\n        * [Advanced Variables](#advanced-variables)\n      - [Configuration values](#configuration-values)\n        * [Input value](#input-value)\n        * [Output values](#output-values)\n        * [Defines](#defines)\n      - [Environment variables](#environment-variables)\n      - [Public make targets](#public-make-targets)\n      - [Internal](#internal)\n        * [Variables](#variables-1)\n        * [Configuration values](#configuration-values-1)\n        * [QMAKE test functions](#qmake-test-functions)\n        * [QMAKE replace functions](#qmake-replace-functions)\n\n<small><i><a href='http://ecotrust-canada.github.io/markdown-toc/'>Table of contents generated with markdown-toc</a></i></small>\n\n## Features\n- Seamless integration in qmake projects - no extra files needed\n- Basic dependency management using git repositories as package sources\n- Globally caches source files to speed up builds\n- Packages are simple pri-files that are included by the target project\n- Recursive dependency solving\n- Allows branch and tag based versioning\n- Supports translations for qdep packages\n- Supports automatic export of qdep packages from dynamic libraries\n- Handles QRC-Resources and startup hooks to work even when used in static libraries\n- Supports special \"Project dependencies\" wich allows you to add whole qmake projects to a SUBDIRS project\n- Can generate \"library export\" pri files that provide an easy and reliable way to link against libraries\n\t- Implicitly supports exported qdep packages and projects\n\n## Design Goals/Scope\nqdep was designed with the following goals in mind:\n\n1. Full qmake integration: qdep should not require any extra commands to install packages and prepare a project to be built. Just running qmake on the target project should take care of this\n2. Simple installation: Using python makes it easy to use the tool on any platform. Besides the install only a single setup command is needed to make qdep work for any Qt installation\n3. Full Qt support: All features of Qt - including resources, startup hooks and translations should be supported with minimal effort for application developers\n4. Library exports: Since all qdep packages are source based, having multiple libraries that use the same package can be problematic. With qdep, one can \"export\" a package from a library, making it available to all the others.\n5. No additional server infrastructure: qdep should not require any extra servers to provide a package index. Any git repository can server as a package without any extra preparations needed\n\nPlease note that qdep is kept intentionally small to fullfill exactly those goals. Other build systems or more complex package management features are not supported and never will be. This project will stay active until the Qt Company switches their build systems to CMake. At that point this project will either be dropped or ported to CMake, depending on what alternative solutions already exist at that point.\n\n## Installation\nTo install the package, follow one of the following possibilities. Please note that only Python >= 3.7 is officially supported. Earlier versions might work as well, but have not been tested.\n\n1. **Arch Linux:** Use the AUR-Package: [qdep](https://aur.archlinux.org/packages/qdep/)\n2. **Any Platform:** Install via pip: [`pip install qdep`](https://pypi.org/project/qdep/)\n3. **Any Platform:** Clone the repository and install the sources directly: `python setup.py install`\n\n### Preparing qmake\nAfter installing (except when using the AUR-package), you have to \"enable\" qdep for each Qt-Kit you want to use qdep with. This can be done by opening a terminal and calling:\n```bash\nqdep prfgen --qmake \"</path/to/qmake>\"\n```\nFor example, if you have installed Qt 5.12.0 for MSVC 2017 x64 on windows in the default location (`C:\\Qt`), the command would look like this:\n```bash\nqdep prfgen --qmake \"C:\\Qt\\5.12.0\\msvc2017_64\\bin\\qmake.exe\"\n```\n\n**Note:** Depending on how the corresponding Qt-Kit was installed, you might need to run the command with administrator/sudo permissions. Alternatively, you can call the command with `--dir /some/path` and export that very same path as value to the `QMAKEPATH` environment variable, if you have no such permissions.\n\n### Shell completitions\nFor Unix systems, qdep makes use of [argcomplete](https://argcomplete.readthedocs.io/en/latest/) to provide completitions for bash/zsh to activate them, add the following code your shell initializer scripts:\n\nFor **zsh**, add this to `~/.zshrc`:\n```bash\nautoload bashcompinit\nbashcompinit\nautoload compinit\ncompinit\neval \"$(register-python-argcomplete qdep)\"\n```\n\nFor **bash**, add this to `~/.bashrc`:\n```\neval \"$(register-python-argcomplete qdep)\"\n```\n\nWhen using BASH, you can alternatively use global completition - see [Activating global completion](https://argcomplete.readthedocs.io/en/latest/#activating-global-completion) for more details on that. Other shells might work as well, depending on how well argcomplete works with them. Refer to the argcomplete documentation and their GitHub Repository .\n\n## Getting started\nThe basic usage of qdep is very simple. For this example, we assume you want to add for example [QHotkey](https://github.com/Skycoder42/QHotkey) to a project via qdep. All you have to do is to install (and prepare) qdep and then add the following two lines to your pro-file:\n\n```qmake\nQDEP_DEPENDS += Skycoder42/QHotkey\n!load(qdep):error(\"Failed to load qdep feature\")\n```\n\nThats it! The next time you run qmake qdep will automatically download the latest release and add them to your project. Just compile the project and you can use the library. A more explicit way to specify the package (and what that shorter string extends to) would be `https://github.com/Skycoder42/QHotkey.git@1.2.2/qhotkey.pri`\n\n## Getting deeper\nBesides this basic functionality of referencing qdep packages, qdep offers a few additional things to make using (and developing) those easier. In the following sections, they will be explained in detail.\n\n### Dependency IDs\nQdep dependencies are described by IDs. These IDs follow the format `<url>[@<version>[/<path>]]`. The only relevant part is the URL, and it can either be implicit or explicit. Implicit URLs follow the format `<user>/<repository>` and are automatically expanded to `https://github.com/<user>/<repository>.git`. For the explicit format, all kinds of GIT-URLs are supportet, i.e. HTTPS, SSH and FILE urls.\n\nIf you leave out the path part of a qdep package, qdep assumes that there is a pri file named `<repository_lower>.pri` in the repositories root directory. If that is not the case, or if a package has multiple different pri files to choose from, you can specify a path relative to the repositories root to that pri file to use that one instead of the automatically detected one.\n\n#### Versioning\nQdep supports 3 kinds of versioning: Unversioned, branches, tags. If you leave out the version, qdep will automatically query the corresponding repository and get the latest tag (by \"creation\") and use that one. If you do specify a version, it can either be a git tag or a git branch. In case of a tag, qdep will simply download it and assume it to be persistant, i.e. never check for updates on that specific tag. Referencing a branch however will lead to qdep \"tracking\" that branch, and before every build, qdep pulls on the branch to update if neccessary.\n\nGenerelly speaking, it is recommended to use explicit tags. Implicit versioning is fine, too, but updates to packages might break your builds at times you do not want them to. Branch versioning is always dangerous and should only be used on explicitly stable branches or for package delevopment.\n\n#### Package-uniqueness and version conflicts\nWhen working with recursive package dependencies, it can sometimes happen that two different packages include different versions of the same package. qdep circumvents this issue by making shure only a single version of each package is ever included. The first version this is referenced is the one that is choosen. Explicit package paths however are not considered the same package, i.e. it is possible to include two different pri files from the same git repository. Generelly speaking, a packages unique identifier is determined by its `<url>` and its `<path>` - both case insensitive.\n\n### Normal dependencies\nNormal dependencies, aka pri-dependencies specified via `QDEP_DEPENDS` are the primary dependency type of qdep. They are typically resolve to a simple pri files, that is included into your project by qdep. You can do anything in these pri files you would also in a \"normal\" pri file. However, there are a few extra things that become possible when including qdep dependencies.\n\n#### Translations\nThe first feature is extended support for translations. Qdep packages can come with translation source files for their own sources. These are typically exported via the `QDEP_TRANSLATIONS` qmake variable. When creating your own translations, qdep will automatically merge these with your own translations at build time. This however onyl works if you make use of the `lrelease` qmake feature, provided by qt. See [QMake TRANSLATIONS](https://doc.qt.io/qt-5/qmake-variable-reference.html#translations) and [QMake QM_FILES_INSTALL_PAT](https://doc.qt.io/qt-5/qmake-variable-reference.html#qm-files-install-path) for more details.\n\n#### Library support\nWhen using qdep in static or dynamic libraries, there are often special steps needed to make that fully work. However, qdep takes care of those steps and performs them for you. The only thing you need to do is enable library exports from your library and then import that export from your primary project. For example, assuimg you have the following project structure:\n```\nroot (subdirs)\n |-library (lib)\n |-app (app)\n```\nAnd you have a library that depends on QHotkey. If you want to use this library from app, you would create the library pro file as follows:\n```qmake\nTEMPLATE = lib\nCONFIG += static  # dynamic libraries are also possible, but dependencies must support exporting for them to work on windows\n\n# ...\n\nQDEP_DEPENDS += Skycoder42/QHotkey\nQDEP_EXPORTS += Skycoder42/QHotkey\nCONFIG += qdep_link_export\n!load(qdep):error(\"Failed to load qdep feature\")\n```\nAnd then reference the library in the app pro file. This also takes care of linking the library to the app, so no additional `INCLUDEPATH` or `LIBS` changes are needed:\n```qmake\nTEMPLATE = app\n\n# ...\n\nQDEP_LINK_DEPENDS += ../library\n!load(qdep):error(\"Failed to load qdep feature\")\n```\nAnd thats it! You can now use the QHotkey in the library and the app project without any additional work, as qdep will reference the QHotkey that is now embedded into the library project. \n\n**Note:** This will also work for dynamic librabries, but only if the *explicitly* support qdep package exporting. If not, linking will fail at least on windows, and possibly on other platforms as well.\n\n#### Creating normal dependencies\nThis section is intended for developers that want to create their own qdep packages. Generally speaking, there is not much you need to do different from creating normal pri includes. However, there are a few small things in qdep you can use to your advantage to create better packages. They are described in the following sub sections and are:\n\n- Translation generation\n- Resources and startup hooks\n- automatic exports\n\n##### Creating qdep translations\nThe only difference when creating translations with qdep is where you put them. Instead of TRANSLATIONS, create a qmake variable called QDEP_TRANSLATIONS and add all the ts files you want to generate to it. Next, call the following command to actually generate the ts-files based on your pri file:\n```bash\nqdep lupdate --qmake \"</path/to/qmake>\" --pri-file \"</path/to/project.pri>\" [-- <extra lupdate arguments>...]\n```\nAnd thats it. You should now be able to find the generated TS-files where you wanted them to be as specified in the pri file.\n\nWhen creating packages that should work with and without qdep, you can add the following to your pri file to still make these translations available if the package is included without qdep:\n```qmake\n!qdep_build: EXTRA_TRANSLATIONS += $$QDEP_TRANSLATIONS\n```\n\n##### Resources and hooks\nOne thing that can be problematic, especially when working with static libraries, is the use of RESOURCES and startup hooks. To make it work, qdep automatically generates code to load them. For resources, there is nothing special you need to do as package developer.\n\nFor hooks however, thats a different story. Assuming you have the following function you want to be run as `Q_COREAPP_STARTUP_FUNCTION`:\n```cpp\nvoid my_package_startup_hook()\n{\n    doStuff();\n}\n```\nYou will have to add the following line to your qdep pri file to make shure this hook actually gets called:\n```pro\nQDEP_HOOK_FNS += my_package_startup_hook\n```\nAnd with that, qdep will automatically generate the code needed to call this method as `Q_COREAPP_STARTUP_FUNCTION`.\n\nWhen creating packages that should work with and without qdep, you can add the following to the cpp file that contains the hook function to make it work for non-static projects, even if the package is included without qdep:\n```cpp\n#ifndef QDEP_BUILD\n#include <QCoreApplication>\nQ_COREAPP_STARTUP_FUNCTION(my_package_startup_hook)\n#endif\n```\n\n##### Automatic exports\nAnother very useful tool are automatic package exports. This allows qdep to automatically export a qdep package from a dynamic library, so other applications that link to that library can use the exported qdep packages API. This is basically equivalent to the following:\n\n```cpp\n#ifdef BUILD_PACKAGE_AS_LIBRARY\n\t#ifdef IS_DLL_BUILD\n\t\t#define MY_PACKAGE_EXPORT Q_DECL_EXPORT\n\t#else\n\t\t#define MY_PACKAGE_EXPORT Q_DECL_IMPORT\n\t#endif\n#else\n\t#define MY_PACKAGE_EXPORT\n#endif\n\nclass MY_PACKAGE_EXPORT MyClass {\n\t// ...\n};\n```\n\nqdep basically automates the define part, so you don't have to care about correctly defining all those macros and your code can be reduced to:\n```cpp\nclass MY_PACKAGE_EXPORT MyClass {\n\t// ...\n};\n```\nTo make it work, simply add the following to your pri file:\n```qmake\nQDEP_PACKAGE_EXPORTS += MY_PACKAGE_EXPORT\n```\nAnd thats it! When using the package normally, qdep will automatically add an empty define that defines MY_PACKAGE_EXPORT to nothing. When building a dynamic library and the end user wants to export the package, it gets defined as Q_DECL_EXPORT (and Q_DECL_IMPORT for consuming applications).\n\nWhen creating packages that should work with and without qdep, you can add the following to the pri file to manually define the macro to nothing, even if the package is included without qdep:\n```qmake\n!qdep_build: DEFINES += \"MY_PACKAGE_EXPORT=\"\n```\n\n### Project dependencies\nAnother side of qdep besides normal pri dependencies are full project dependencies. In this scenario, you include a full qmake project into your tree as child of a SUBDIRS projects. This allows the use of qdep package export pri files to link to these projects without much effort. To make use of this feature, you have to use a subdirs project that references the pro dependency, as well as normal projects that link against it. One great advantage of using project dependencies is, that they can reference other project dependencies they depend on, which means even for full projects, qdep takes care of the recursive dependency resolving for you.\n\nTo get started, assume the following project structure:\n```\nroot (subdirs)\n  |--libs (subdirs)\n  |    |--lib (lib)\n  |--app (app)\n```\nBoth lib and app are assumed to depend on a theoretical qdep project dependency name `Skycoder42/SuperLib`, but app also depends on lib.\n\nThe first step would be to choose a subdirs project to add the dependency to. For this example, the libs project is choosen. Add the following lines to add the dependency:\n```qmake\nTEMPLATE = subdirs\nSUBDIRS += lib\n\n# ....\n\nQDEP_PROJECT_SUBDIRS += Skycoder42/SuperLib\nlib.qdep_depends += Skycoder42/SuperLib\n!load(qdep):error(\"Failed to load qdep feature\")\n```\nThe `QDEP_PROJECT_SUBDIRS` is used to actually pull in the project dependency, while adding it to `lib.qdep_depends` *only* makes sure that the qdep dependency is built before lib. This is not needed if lib does not depend on the qdep dependency. It is however recommended to always have a seperate subdirs project for qdep dependencies, i.e. for this concrete example it would be better to move the lib project one stage up or create another subdir project within libs that references the qdep dependencies.\n\nNext, we need to reference the library itself in app/lib. The procedure is the same for both, so here it is only shown for the app project as an example. In the app pro file, add the lines:\n```qmake\nQDEP_PROJECT_ROOT = libs  # Or \"./libs\" - would be \"..\" for the lib project\nQDEP_PROJECT_LINK_DEPENDS += Skycoder42/SuperLib\n!load(qdep):error(\"Failed to load qdep feature\")\n```\n`QDEP_PROJECT_ROOT` tells qdep where the project is located, that contains the reference to the actual qdep project dependency, and `QDEP_PROJECT_LINK_DEPENDS` list all the dependencies this project (app) depends on. If any dependency listed there was not specified in the libs project via `QDEP_PROJECT_SUBDIRS`, the build will fail.\n\nAnd with that, the project dependency has been sucessfully added and referenced. With the next build, the project would be downloaded, compiled and linked against app/lib.\n\n#### Creating project dependencies\nGenerally speaking, project dependencies are just normal qmake projects. However, such a project should **always** include the qdep feature and add `qdep_link_export` to the config, as without the generated export pri file, it will not be usable as qdep project dependency. But besides that, you can do anything you want, i.e. add other normal qdep pri dependencies etc. and even export them if needed.\n\nHowever, there is one additional feature that is only possible with qdep project dependencies: You can directly reference other qdep project dependencies. Doing so will make sure that whichever subdirs project that includes this project will also include the dependencies as subdirs and ensure the qmake build order, as well as referencing the corresponding export pri files. To for example reference `Skycoder42/SuperLib` from within a qdep project dependency, add the following:\n```qmake\nQDEP_PROJECT_DEPENDS += Skycoder42/SuperLib\n!load(qdep):error(\"Failed to load qdep feature\")\n```\n\n## Documentation\nIn the following sections, all the functions, variables etc. of qdep are documented for reference. \n\n### Command line interface\nqdep has a public and a private command line API. The public API is intended to be used by delevopers, while the internal API is used by the qdep qmake feature to perform various operations. The following sections list all the commands with a short description. For more details on each command, type `qdep <command> --help` \n\n#### Public API operations:\n```\nprfgen     Generate a qmake project feature (prf) for the given qmake.\ninit       Initialize a pro file to use qdep by adding the required lines.\nlupdate    Run lupdate for the QDEP_TRANSLATION variable in a given pri\n           file.\nclear      Remove all sources from the users global cache.\nversions   List all known versions/tags of the given package\nquery      Query details about a given package identifier\nget        Download the sources of one ore more packages into the source\n           cache.\nupdate     Check for newer versions of used packages and optionally update\n           them.\n```\n\n#### Private API operations:\n```\ndephash     Generated unique identifying hashes for qdep\n            packages.\npkgresolve  Download the given qdep package and extract relevant\n            information from it.\nhookgen     Generate a header file with a method to load all\n            resource hooks.\nhookimp     Generate a source file that includes and runs all\n            qdep hooks as normal startup hook.\nlconvert    Combine ts files with translations from qdep\n            packages.\nprolink     Resolve the path a linked project dependency would\n            be at.\n```\n\n### QMAKE-Feature\nThis is the documentation of the qmake feature that is generated by qdep and loaded by adding `load(qdep)` to your project. All variables, CONFIG-flags and more are documented below.\n\n#### Variables\n##### Common Variables\n Name                       | Direction | Default                       | Descriptions\n----------------------------|-----------|-------------------------------|--------------\n QDEP_PATH                  | in/out    | `<system>`                    | Holds the path to the qdep binary to be used. Can be overwritten to specify a custom locations\n QDEP_VERSION               | out       | `<system>`                    | The version of qdep which was used to generate the qdep feature\n QDEP_GENERATED_DIR         | in        | `$$OUT_PWD`                   | The sub-directory in the build folder where qdep should place all it's generated files. Can be an absolute or relative path\n QDEP_EXPORT_PATH           | in        | `$$QDEP_GENERATED_DIR/<type>` | The directory where to place export pri files for libraries that export dependencies. Can be relative to OUT_PWD or absolute. Use QDEP_EXPORT_NAME to get the name of that file without a path\n QDEP_DEPENDS               | in        | `<empty>`                     | Specify all dependencies to qdep packages to be included into your project\n QDEP_LINK_DEPENDS          | in        | `<empty>`                     | Reference other projects in the same build tree that this project should link against. Those projects must be exporting a pri file\n QDEP_PROJECT_SUBDIRS       | in        | `<empty>`                     | Specify all dependencies to qdep projects to be added as qmake project to the SUBDIRS variable. Only evaluted in projects that specify TEMPLATE as `subdirs`\n QDEP_PROJECT_ROOT          | in        | `<empty>`                     | The path to a project qmake project directory or file to resolve QDEP_PROJECT_LINK_DEPENDS against\n QDEP_PROJECT_LINK_DEPENDS  | in        | `<empty>`                     | Sepcify all dependencies to qdep projects this project should be linked against. The dependencies are assumed to be provided in that project via QDEP_PROJECT_SUBDIRS.\n QDEP_DEFINES               | in        | `<empty>`                     | Specify DEFINES that are exported if the library exports a pri file. All values are automatically added to DEFINES by qdep\n QDEP_INCLUDEPATH           | in        | `<empty>`                     | Specify INCLUDEPATHS that are exported if the library exports a pri file. All values are automatically added to INCLUDEPATH by qdep\n QDEP_LIBS                  | in        | `<empty>`                     | Specify LIBS that are exported if the library exports a pri file. All values are automatically added to LIBS by qdep\n QDEP_EXPORTS               | in        | `<empty>`                     | Specify qdep dependencies of which the API should be exported. Can be useful to export packages when used in dynamic libraries - only works if packages explicitly support this\n QDEP_LUPDATE_INPUTS        | in        | `<empty>`                     | Additional files or folders to parse for translations when running `make lupdate`\n QDEP_PACKAGE_EXPORTS       | in (pkg)  | `<empty>`                     | Variables to be defined as import/export/nothing and be used as prefix to a class.\n QDEP_TRANSLATIONS          | in (pkg)  | `<empty>`                     | Specify translation subfiles within a qdep dependency to be merged with the translations of the project they are included from\n QDEP_PROJECT_DEPENDS       | in (pkg)  | `<empty>`                     | Specify all dependencies to qdep projects this qdep project depends on. Can only be used in qdep project dependencies and adds it's contents to QDEP_PROJECT_SUBDIRS of the project that includes this dependency\n QDEP_VAR_EXPORTS           | in (pkg)  | `<empty>`                     | Specify the names of additional qmake variables that should be exported from a qdep dependency besides DEFINES and INCLUDEPATH\n\n##### SUBDIRS extension\n- `qdep_depends`: Can be added to any variable passed to `SUBDIRS` in a project that uses `QDEP_PROJECT_SUBDIRS` to specify that a certain subdir project depends on that specific package. This does **not** take care of linkage etc. It only ensures that the make targets are build in the correct order.\n\n##### Advanced Variables\n Name                       | Direction | Default                                  | Descriptions\n----------------------------|-----------|------------------------------------------|--------------\n QDEP_TOOL                  | in/out    | `<system>`                               | The escaped command line base for qdep commands run from within qmake\n QDEP_CACHE_SCOPE           | in        | `stash`                                  | The method of caching to be used to cache various qmake related stuff. Can be &lt;empty>, super or stash\n QDEP_GENERATED_SOURCES_DIR | out       | `$$QDEP_GENERATED_DIR/<type>`            | The directory where generated source files are placed. Is determined by the build configuration to take debug/release builds into account\n QDEP_GENERATED_TS_DIR      | in        | `$$QDEP_GENERATED_DIR/.qdepts/<type>`    | The directory where generated translation sources are placed.\n QDEP_LUPDATE               | in        | `lupdate -recursive -locations relative` | The path to the lupdate tool and additional arguments for lupdate in the `make lupdate` command to control it's behaviour\n QDEP_LCONVERT              | in        | `lconvert -sort-contexts`                | The path to the lconvert tool and additional arguments to be used to combine translations\n QDEP_EXPORT_NAME           | in/out    | `<pro-file-name>_export.pri`             | The name of a generated library import file. Must be only the name of the file, use QDEP_EXPORT_PATH to specify the location\n QDEP_EXPORTED_DEFINES      | out       | `<empty>`                                | DEFINES that come from QDEP_PACKAGE_EXPORTS or DEFINES from any directly included qdep dependency\n QDEP_EXPORTED_INCLUDEPATH  | out       | `<empty>`                                | INCLUDEPATHs that come from any directly included qdep dependency\n QDEP_EXPORTED_LIBS         | out       | `<empty>`                                | LIBS that come from any directly included qdep dependency\n QDEP_HOOK_FNS              | out       | `<empty>`                                | Holds all names of functions to be run as startup hook by qdep\n\n#### Configuration values\n##### Input value\n- `qdep_force`: Enforce the full evaluation of qdep, even if the pro file is beeing evaluated without a context (This is potentially dangerous and should not be used unless absolutely neccessary)\n- `qdep_no_pull`: Do not pull for newer versions of branch-based dependencies. Cloning new packages will still work\n- `qdep_no_clone`: Do not clone completely new packages or package versions. Pulling on already cached branches will still work\n- `qdep_no_cache`: Do not cache the used versions of packages without a specified versions. Instead the latest version is queried on every run\n- `qdep_export_all`: export all dependant packages, i.e. any QDEP_PACKAGE_EXPORTS for every package are treated as if added to QDEP_EXPORTS\n- `qdep_no_link`: When exporting packages from a library, do not add the qmake code to link the library (and to it's includes) to the generate export.pri file\n- `qdep_no_qm_combine`: Do not combine TRANSLATIONS with QDEP_TRANSLATIONS. Instead treat QDEP_TRANSLATIONS as EXTRA_TRANSLATIONS and generate seperate qm files for them\n- `qdep_link_export`: Enforce the creation of an export pri file. Normally only libraries without qdep_no_link defined or projects that specify qdep_export_all or have values in QDEP_EXPORTS generate such files\n- `qdep_no_export_link`: Do not export contents of QT, PKGCONFIG or QDEP_LIBS in a generated export pri file\n\n##### Output values\n- `qdep_build`: Is set in case the qdep features was loaded correctly and is enabled\n\n##### Defines\n- `QDEP_BUILD`: Is defined in case the qdep features was loaded correctly and is enabled\n\n#### Environment variables\n- `QDEP_CACHE_DIR`: The directory where to cache downloaded sources. Is automatically determined for every system but can be overwritten with this variable\n- `QDEP_SOURCE_OVERRIDE`: Allows to provide a mapping in the format `<pkg1>;<pkg2>^<pkg3>;<pkg4>`. This will make qdep automatically replace any occurance of `pkg1` with `pkg2` etc. Can be used by developers to temporarily overwrite packages\n- `QDEP_DEFAULT_PKG_FN`: A template that is used to resolve non-url packages like `User/package` to a full url. The default method for that is `https://github.com/{}.git` - with `{}` being replaced by the short package name.\n\n#### Public make targets\n- `make lupdate`: Runs the `lupdate` tool to update your translations in a quick and easy manner, without having to rely on potentially buggy pro-file-parsing.\n\n#### Internal\n##### Variables\n- `__QDEP_PRIVATE_SEPERATOR`: Seperator between datasets\n- `__QDEP_TUPLE_SEPERATOR`: Seperator between values within a dataset\n- `__QDEP_INCLUDE_CACHE`: objects with details about included depdendencies of all kinds\n- `__QDEP_ORIGINAL_TRANSLATIONS`: All original translation that were in TRANSLATIONS before apply translation combination with QDEP_TRANSLATIONS from included packages\n- `__QDEP_HOOK_FILES`: Paths to header files that contain hook definitions that must be included and loaded by a project\n- `__QDEP_EXPORT_QMAKE_INCLUDE_GUARD`: a cache of included exported pri files to ensure each gets included only once\n\n##### Configuration values\n- `__qdep_script_version`: The version detected at runtime as reported by the qdep executable\n- `__qdep_dump_dependencies`: Create a file named qdep_depends.txt in the build directory that contains all direct dependencies of the project\n\n##### QMAKE test functions\n- `qdepCollectDependencies(dependencies ...)`: Downloads all specified normal dependencies and adds them to `__QDEP_INCLUDE_CACHE` to be linked later by qdep. Works recursively\n- `qdepCollectProjectDependencies(dependencies ...)`: Downloads all specified project dependencies and adds them to `SUBDIRS`. Works recursively\n- `qdepResolveSubdirDepends(subdir-vars ...)`: Converts the values of the `qdep_depends` subvar of all variables passed to the function to normal subdirs `depends` subvars\n- `qdepCreateExportPri(path)`: Creates a file named path and adds all export-related code to it\n- `qdepShellQuote(paths ...)`: Makes the given paths absolute based on `_PRO_FILE_PWD_` and escapes them using `shell_quote`\n- `qdepDumpUpdateDeps()`: Creates a file named qdep_depends.txt in the build directory that contains all direct dependencies of the project\n\n##### QMAKE replace functions\n- `qdepResolveProjectLinkDeps(project-root, link-depends ...)`: Resolves all link-depends project packages to subdir paths, assuming they are provided by the project located at project-root\n- `qdepOutQuote(name, values)`: Creates a number of lines of qmake code that assing each value in values to a variable named name, in a securely quoted manner\n- `qdepLinkExpand(path)`: Expands a shortened or relative path to a project that exports dependencies to get the path of the export pri file\n- `qdepResolveLinkRoot(path)`: Searches for a top-level qmake project, that has this project included as project dependency and returns the path to that pro file. Search is started based on path, which must be a build directory\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/Skycoder42/qdep", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "qdep", "package_url": "https://pypi.org/project/qdep/", "platform": "", "project_url": "https://pypi.org/project/qdep/", "project_urls": {"Homepage": "https://github.com/Skycoder42/qdep"}, "release_url": "https://pypi.org/project/qdep/1.1.1/", "requires_dist": ["appdirs", "lockfile", "argcomplete"], "requires_python": "", "summary": "A very basic yet simple to use dependency management tool for qmake based projects", "version": "1.1.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>qdep</h1>\n<p>A very basic yet simple to use dependency management tool for qmake based projects.</p>\n<p><a href=\"https://travis-ci.org/Skycoder42/qdep\" rel=\"nofollow\"><img alt=\"Travis Build Status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/ffa5a1f28951d86b21e2be35810b33a65ee29318/68747470733a2f2f7472617669732d63692e6f72672f536b79636f64657234322f716465702e7376673f6272616e63683d6d6173746572\"></a>\n<a href=\"https://ci.appveyor.com/project/Skycoder42/qdep/branch/master\" rel=\"nofollow\"><img alt=\"Appveyor Build status\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/c8b4e8a22fababc01ceb53aca0c2b695af993072/68747470733a2f2f63692e6170707665796f722e636f6d2f6170692f70726f6a656374732f7374617475732f733232327661746a70643469633730772f6272616e63682f6d61737465723f7376673d74727565\"></a>\n<a href=\"https://www.codacy.com/app/Skycoder42/qdep\" rel=\"nofollow\"><img alt=\"Codacy Badge\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/df6a9148afaf31796af946bb14df7a1d92c401b5/68747470733a2f2f6170692e636f646163792e636f6d2f70726f6a6563742f62616467652f47726164652f3337336132316630356638383437633239636530383733393839313633316538\"></a>\n<a href=\"https://aur.archlinux.org/packages/qdep/\" rel=\"nofollow\"><img alt=\"AUR\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/fa1e757ea1c3978983b1e58917b96842b32d9591/68747470733a2f2f696d672e736869656c64732e696f2f6175722f76657273696f6e2f716465702e737667\"></a>\n<a href=\"https://pypi.org/project/qdep/\" rel=\"nofollow\"><img alt=\"PyPi\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/7026c98424b8cfe4b919dc217c6ab19ab8a4dd17/68747470733a2f2f696d672e736869656c64732e696f2f707970692f762f716465702e737667\"></a></p>\n<h2>Table of contents</h2>\n<ul>\n<li><a href=\"#qdep\" rel=\"nofollow\">qdep</a>\n<ul>\n<li><a href=\"#features\" rel=\"nofollow\">Features</a></li>\n<li><a href=\"#design-goals-scope\" rel=\"nofollow\">Design Goals/Scope</a></li>\n<li><a href=\"#installation\" rel=\"nofollow\">Installation</a>\n<ul>\n<li><a href=\"#preparing-qmake\" rel=\"nofollow\">Preparing qmake</a></li>\n<li><a href=\"#shell-completitions\" rel=\"nofollow\">Shell completitions</a></li>\n</ul>\n</li>\n<li><a href=\"#getting-started\" rel=\"nofollow\">Getting started</a></li>\n<li><a href=\"#getting-deeper\" rel=\"nofollow\">Getting deeper</a>\n<ul>\n<li><a href=\"#dependency-ids\" rel=\"nofollow\">Dependency IDs</a>\n<ul>\n<li><a href=\"#versioning\" rel=\"nofollow\">Versioning</a></li>\n<li><a href=\"#package-uniqueness-and-version-conflicts\" rel=\"nofollow\">Package-uniqueness and version conflicts</a></li>\n</ul>\n</li>\n<li><a href=\"#normal-dependencies\" rel=\"nofollow\">Normal dependencies</a>\n<ul>\n<li><a href=\"#translations\" rel=\"nofollow\">Translations</a></li>\n<li><a href=\"#library-support\" rel=\"nofollow\">Library support</a></li>\n<li><a href=\"#creating-normal-dependencies\" rel=\"nofollow\">Creating normal dependencies</a>\n<ul>\n<li><a href=\"#creating-qdep-translations\" rel=\"nofollow\">Creating qdep translations</a></li>\n<li><a href=\"#resources-and-hooks\" rel=\"nofollow\">Resources and hooks</a></li>\n<li><a href=\"#automatic-exports\" rel=\"nofollow\">Automatic exports</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li><a href=\"#project-dependencies\" rel=\"nofollow\">Project dependencies</a>\n<ul>\n<li><a href=\"#creating-project-dependencies\" rel=\"nofollow\">Creating project dependencies</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li><a href=\"#documentation\" rel=\"nofollow\">Documentation</a>\n<ul>\n<li><a href=\"#command-line-interface\" rel=\"nofollow\">Command line interface</a>\n<ul>\n<li><a href=\"#public-api-operations-\" rel=\"nofollow\">Public API operations:</a></li>\n<li><a href=\"#private-api-operations-\" rel=\"nofollow\">Private API operations:</a></li>\n</ul>\n</li>\n<li><a href=\"#qmake-feature\" rel=\"nofollow\">QMAKE-Feature</a>\n<ul>\n<li><a href=\"#variables\" rel=\"nofollow\">Variables</a>\n<ul>\n<li><a href=\"#common-variables\" rel=\"nofollow\">Common Variables</a></li>\n<li><a href=\"#subdirs-extension\" rel=\"nofollow\">SUBDIRS extension</a></li>\n<li><a href=\"#advanced-variables\" rel=\"nofollow\">Advanced Variables</a></li>\n</ul>\n</li>\n<li><a href=\"#configuration-values\" rel=\"nofollow\">Configuration values</a>\n<ul>\n<li><a href=\"#input-value\" rel=\"nofollow\">Input value</a></li>\n<li><a href=\"#output-values\" rel=\"nofollow\">Output values</a></li>\n<li><a href=\"#defines\" rel=\"nofollow\">Defines</a></li>\n</ul>\n</li>\n<li><a href=\"#environment-variables\" rel=\"nofollow\">Environment variables</a></li>\n<li><a href=\"#public-make-targets\" rel=\"nofollow\">Public make targets</a></li>\n<li><a href=\"#internal\" rel=\"nofollow\">Internal</a>\n<ul>\n<li><a href=\"#variables-1\" rel=\"nofollow\">Variables</a></li>\n<li><a href=\"#configuration-values-1\" rel=\"nofollow\">Configuration values</a></li>\n<li><a href=\"#qmake-test-functions\" rel=\"nofollow\">QMAKE test functions</a></li>\n<li><a href=\"#qmake-replace-functions\" rel=\"nofollow\">QMAKE replace functions</a></li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<p>&lt;small&gt;<i><a href=\"http://ecotrust-canada.github.io/markdown-toc/\" rel=\"nofollow\">Table of contents generated with markdown-toc</a></i>&lt;/small&gt;</p>\n<h2>Features</h2>\n<ul>\n<li>Seamless integration in qmake projects - no extra files needed</li>\n<li>Basic dependency management using git repositories as package sources</li>\n<li>Globally caches source files to speed up builds</li>\n<li>Packages are simple pri-files that are included by the target project</li>\n<li>Recursive dependency solving</li>\n<li>Allows branch and tag based versioning</li>\n<li>Supports translations for qdep packages</li>\n<li>Supports automatic export of qdep packages from dynamic libraries</li>\n<li>Handles QRC-Resources and startup hooks to work even when used in static libraries</li>\n<li>Supports special \"Project dependencies\" wich allows you to add whole qmake projects to a SUBDIRS project</li>\n<li>Can generate \"library export\" pri files that provide an easy and reliable way to link against libraries\n<ul>\n<li>Implicitly supports exported qdep packages and projects</li>\n</ul>\n</li>\n</ul>\n<h2>Design Goals/Scope</h2>\n<p>qdep was designed with the following goals in mind:</p>\n<ol>\n<li>Full qmake integration: qdep should not require any extra commands to install packages and prepare a project to be built. Just running qmake on the target project should take care of this</li>\n<li>Simple installation: Using python makes it easy to use the tool on any platform. Besides the install only a single setup command is needed to make qdep work for any Qt installation</li>\n<li>Full Qt support: All features of Qt - including resources, startup hooks and translations should be supported with minimal effort for application developers</li>\n<li>Library exports: Since all qdep packages are source based, having multiple libraries that use the same package can be problematic. With qdep, one can \"export\" a package from a library, making it available to all the others.</li>\n<li>No additional server infrastructure: qdep should not require any extra servers to provide a package index. Any git repository can server as a package without any extra preparations needed</li>\n</ol>\n<p>Please note that qdep is kept intentionally small to fullfill exactly those goals. Other build systems or more complex package management features are not supported and never will be. This project will stay active until the Qt Company switches their build systems to CMake. At that point this project will either be dropped or ported to CMake, depending on what alternative solutions already exist at that point.</p>\n<h2>Installation</h2>\n<p>To install the package, follow one of the following possibilities. Please note that only Python &gt;= 3.7 is officially supported. Earlier versions might work as well, but have not been tested.</p>\n<ol>\n<li><strong>Arch Linux:</strong> Use the AUR-Package: <a href=\"https://aur.archlinux.org/packages/qdep/\" rel=\"nofollow\">qdep</a></li>\n<li><strong>Any Platform:</strong> Install via pip: <a href=\"https://pypi.org/project/qdep/\" rel=\"nofollow\"><code>pip install qdep</code></a></li>\n<li><strong>Any Platform:</strong> Clone the repository and install the sources directly: <code>python setup.py install</code></li>\n</ol>\n<h3>Preparing qmake</h3>\n<p>After installing (except when using the AUR-package), you have to \"enable\" qdep for each Qt-Kit you want to use qdep with. This can be done by opening a terminal and calling:</p>\n<pre>qdep prfgen --qmake <span class=\"s2\">\"&lt;/path/to/qmake&gt;\"</span>\n</pre>\n<p>For example, if you have installed Qt 5.12.0 for MSVC 2017 x64 on windows in the default location (<code>C:\\Qt</code>), the command would look like this:</p>\n<pre>qdep prfgen --qmake <span class=\"s2\">\"C:\\Qt\\5.12.0\\msvc2017_64\\bin\\qmake.exe\"</span>\n</pre>\n<p><strong>Note:</strong> Depending on how the corresponding Qt-Kit was installed, you might need to run the command with administrator/sudo permissions. Alternatively, you can call the command with <code>--dir /some/path</code> and export that very same path as value to the <code>QMAKEPATH</code> environment variable, if you have no such permissions.</p>\n<h3>Shell completitions</h3>\n<p>For Unix systems, qdep makes use of <a href=\"https://argcomplete.readthedocs.io/en/latest/\" rel=\"nofollow\">argcomplete</a> to provide completitions for bash/zsh to activate them, add the following code your shell initializer scripts:</p>\n<p>For <strong>zsh</strong>, add this to <code>~/.zshrc</code>:</p>\n<pre>autoload bashcompinit\nbashcompinit\nautoload compinit\ncompinit\n<span class=\"nb\">eval</span> <span class=\"s2\">\"</span><span class=\"k\">$(</span>register-python-argcomplete qdep<span class=\"k\">)</span><span class=\"s2\">\"</span>\n</pre>\n<p>For <strong>bash</strong>, add this to <code>~/.bashrc</code>:</p>\n<pre><code>eval \"$(register-python-argcomplete qdep)\"\n</code></pre>\n<p>When using BASH, you can alternatively use global completition - see <a href=\"https://argcomplete.readthedocs.io/en/latest/#activating-global-completion\" rel=\"nofollow\">Activating global completion</a> for more details on that. Other shells might work as well, depending on how well argcomplete works with them. Refer to the argcomplete documentation and their GitHub Repository .</p>\n<h2>Getting started</h2>\n<p>The basic usage of qdep is very simple. For this example, we assume you want to add for example <a href=\"https://github.com/Skycoder42/QHotkey\" rel=\"nofollow\">QHotkey</a> to a project via qdep. All you have to do is to install (and prepare) qdep and then add the following two lines to your pro-file:</p>\n<pre>QDEP_DEPENDS += Skycoder42/QHotkey\n!load(qdep):error(\"Failed to load qdep feature\")\n</pre>\n<p>Thats it! The next time you run qmake qdep will automatically download the latest release and add them to your project. Just compile the project and you can use the library. A more explicit way to specify the package (and what that shorter string extends to) would be <code>https://github.com/Skycoder42/QHotkey.git@1.2.2/qhotkey.pri</code></p>\n<h2>Getting deeper</h2>\n<p>Besides this basic functionality of referencing qdep packages, qdep offers a few additional things to make using (and developing) those easier. In the following sections, they will be explained in detail.</p>\n<h3>Dependency IDs</h3>\n<p>Qdep dependencies are described by IDs. These IDs follow the format <code>&lt;url&gt;[@&lt;version&gt;[/&lt;path&gt;]]</code>. The only relevant part is the URL, and it can either be implicit or explicit. Implicit URLs follow the format <code>&lt;user&gt;/&lt;repository&gt;</code> and are automatically expanded to <code>https://github.com/&lt;user&gt;/&lt;repository&gt;.git</code>. For the explicit format, all kinds of GIT-URLs are supportet, i.e. HTTPS, SSH and FILE urls.</p>\n<p>If you leave out the path part of a qdep package, qdep assumes that there is a pri file named <code>&lt;repository_lower&gt;.pri</code> in the repositories root directory. If that is not the case, or if a package has multiple different pri files to choose from, you can specify a path relative to the repositories root to that pri file to use that one instead of the automatically detected one.</p>\n<h4>Versioning</h4>\n<p>Qdep supports 3 kinds of versioning: Unversioned, branches, tags. If you leave out the version, qdep will automatically query the corresponding repository and get the latest tag (by \"creation\") and use that one. If you do specify a version, it can either be a git tag or a git branch. In case of a tag, qdep will simply download it and assume it to be persistant, i.e. never check for updates on that specific tag. Referencing a branch however will lead to qdep \"tracking\" that branch, and before every build, qdep pulls on the branch to update if neccessary.</p>\n<p>Generelly speaking, it is recommended to use explicit tags. Implicit versioning is fine, too, but updates to packages might break your builds at times you do not want them to. Branch versioning is always dangerous and should only be used on explicitly stable branches or for package delevopment.</p>\n<h4>Package-uniqueness and version conflicts</h4>\n<p>When working with recursive package dependencies, it can sometimes happen that two different packages include different versions of the same package. qdep circumvents this issue by making shure only a single version of each package is ever included. The first version this is referenced is the one that is choosen. Explicit package paths however are not considered the same package, i.e. it is possible to include two different pri files from the same git repository. Generelly speaking, a packages unique identifier is determined by its <code>&lt;url&gt;</code> and its <code>&lt;path&gt;</code> - both case insensitive.</p>\n<h3>Normal dependencies</h3>\n<p>Normal dependencies, aka pri-dependencies specified via <code>QDEP_DEPENDS</code> are the primary dependency type of qdep. They are typically resolve to a simple pri files, that is included into your project by qdep. You can do anything in these pri files you would also in a \"normal\" pri file. However, there are a few extra things that become possible when including qdep dependencies.</p>\n<h4>Translations</h4>\n<p>The first feature is extended support for translations. Qdep packages can come with translation source files for their own sources. These are typically exported via the <code>QDEP_TRANSLATIONS</code> qmake variable. When creating your own translations, qdep will automatically merge these with your own translations at build time. This however onyl works if you make use of the <code>lrelease</code> qmake feature, provided by qt. See <a href=\"https://doc.qt.io/qt-5/qmake-variable-reference.html#translations\" rel=\"nofollow\">QMake TRANSLATIONS</a> and <a href=\"https://doc.qt.io/qt-5/qmake-variable-reference.html#qm-files-install-path\" rel=\"nofollow\">QMake QM_FILES_INSTALL_PAT</a> for more details.</p>\n<h4>Library support</h4>\n<p>When using qdep in static or dynamic libraries, there are often special steps needed to make that fully work. However, qdep takes care of those steps and performs them for you. The only thing you need to do is enable library exports from your library and then import that export from your primary project. For example, assuimg you have the following project structure:</p>\n<pre><code>root (subdirs)\n |-library (lib)\n |-app (app)\n</code></pre>\n<p>And you have a library that depends on QHotkey. If you want to use this library from app, you would create the library pro file as follows:</p>\n<pre>TEMPLATE = lib\nCONFIG += static  # dynamic libraries are also possible, but dependencies must support exporting for them to work on windows\n\n# ...\n\nQDEP_DEPENDS += Skycoder42/QHotkey\nQDEP_EXPORTS += Skycoder42/QHotkey\nCONFIG += qdep_link_export\n!load(qdep):error(\"Failed to load qdep feature\")\n</pre>\n<p>And then reference the library in the app pro file. This also takes care of linking the library to the app, so no additional <code>INCLUDEPATH</code> or <code>LIBS</code> changes are needed:</p>\n<pre>TEMPLATE = app\n\n# ...\n\nQDEP_LINK_DEPENDS += ../library\n!load(qdep):error(\"Failed to load qdep feature\")\n</pre>\n<p>And thats it! You can now use the QHotkey in the library and the app project without any additional work, as qdep will reference the QHotkey that is now embedded into the library project.</p>\n<p><strong>Note:</strong> This will also work for dynamic librabries, but only if the <em>explicitly</em> support qdep package exporting. If not, linking will fail at least on windows, and possibly on other platforms as well.</p>\n<h4>Creating normal dependencies</h4>\n<p>This section is intended for developers that want to create their own qdep packages. Generally speaking, there is not much you need to do different from creating normal pri includes. However, there are a few small things in qdep you can use to your advantage to create better packages. They are described in the following sub sections and are:</p>\n<ul>\n<li>Translation generation</li>\n<li>Resources and startup hooks</li>\n<li>automatic exports</li>\n</ul>\n<h5>Creating qdep translations</h5>\n<p>The only difference when creating translations with qdep is where you put them. Instead of TRANSLATIONS, create a qmake variable called QDEP_TRANSLATIONS and add all the ts files you want to generate to it. Next, call the following command to actually generate the ts-files based on your pri file:</p>\n<pre>qdep lupdate --qmake <span class=\"s2\">\"&lt;/path/to/qmake&gt;\"</span> --pri-file <span class=\"s2\">\"&lt;/path/to/project.pri&gt;\"</span> <span class=\"o\">[</span>-- &lt;extra lupdate arguments&gt;...<span class=\"o\">]</span>\n</pre>\n<p>And thats it. You should now be able to find the generated TS-files where you wanted them to be as specified in the pri file.</p>\n<p>When creating packages that should work with and without qdep, you can add the following to your pri file to still make these translations available if the package is included without qdep:</p>\n<pre>!qdep_build: EXTRA_TRANSLATIONS += $$QDEP_TRANSLATIONS\n</pre>\n<h5>Resources and hooks</h5>\n<p>One thing that can be problematic, especially when working with static libraries, is the use of RESOURCES and startup hooks. To make it work, qdep automatically generates code to load them. For resources, there is nothing special you need to do as package developer.</p>\n<p>For hooks however, thats a different story. Assuming you have the following function you want to be run as <code>Q_COREAPP_STARTUP_FUNCTION</code>:</p>\n<pre><span class=\"kt\">void</span> <span class=\"nf\">my_package_startup_hook</span><span class=\"p\">()</span>\n<span class=\"p\">{</span>\n    <span class=\"n\">doStuff</span><span class=\"p\">();</span>\n<span class=\"p\">}</span>\n</pre>\n<p>You will have to add the following line to your qdep pri file to make shure this hook actually gets called:</p>\n<pre>QDEP_HOOK_FNS += my_package_startup_hook\n</pre>\n<p>And with that, qdep will automatically generate the code needed to call this method as <code>Q_COREAPP_STARTUP_FUNCTION</code>.</p>\n<p>When creating packages that should work with and without qdep, you can add the following to the cpp file that contains the hook function to make it work for non-static projects, even if the package is included without qdep:</p>\n<pre><span class=\"cp\">#ifndef QDEP_BUILD</span>\n<span class=\"cp\">#include</span> <span class=\"cpf\">&lt;QCoreApplication&gt;</span><span class=\"cp\"></span>\n<span class=\"n\">Q_COREAPP_STARTUP_FUNCTION</span><span class=\"p\">(</span><span class=\"n\">my_package_startup_hook</span><span class=\"p\">)</span>\n<span class=\"cp\">#endif</span>\n</pre>\n<h5>Automatic exports</h5>\n<p>Another very useful tool are automatic package exports. This allows qdep to automatically export a qdep package from a dynamic library, so other applications that link to that library can use the exported qdep packages API. This is basically equivalent to the following:</p>\n<pre><span class=\"cp\">#ifdef BUILD_PACKAGE_AS_LIBRARY</span>\n\t<span class=\"cp\">#ifdef IS_DLL_BUILD</span>\n\t\t<span class=\"cp\">#define MY_PACKAGE_EXPORT Q_DECL_EXPORT</span>\n\t<span class=\"cp\">#else</span>\n\t\t<span class=\"cp\">#define MY_PACKAGE_EXPORT Q_DECL_IMPORT</span>\n\t<span class=\"cp\">#endif</span>\n<span class=\"cp\">#else</span>\n\t<span class=\"cp\">#define MY_PACKAGE_EXPORT</span>\n<span class=\"cp\">#endif</span>\n\n<span class=\"k\">class</span> <span class=\"nc\">MY_PACKAGE_EXPORT</span> <span class=\"n\">MyClass</span> <span class=\"p\">{</span>\n\t<span class=\"c1\">// ...</span>\n<span class=\"p\">};</span>\n</pre>\n<p>qdep basically automates the define part, so you don't have to care about correctly defining all those macros and your code can be reduced to:</p>\n<pre><span class=\"k\">class</span> <span class=\"nc\">MY_PACKAGE_EXPORT</span> <span class=\"n\">MyClass</span> <span class=\"p\">{</span>\n\t<span class=\"c1\">// ...</span>\n<span class=\"p\">};</span>\n</pre>\n<p>To make it work, simply add the following to your pri file:</p>\n<pre>QDEP_PACKAGE_EXPORTS += MY_PACKAGE_EXPORT\n</pre>\n<p>And thats it! When using the package normally, qdep will automatically add an empty define that defines MY_PACKAGE_EXPORT to nothing. When building a dynamic library and the end user wants to export the package, it gets defined as Q_DECL_EXPORT (and Q_DECL_IMPORT for consuming applications).</p>\n<p>When creating packages that should work with and without qdep, you can add the following to the pri file to manually define the macro to nothing, even if the package is included without qdep:</p>\n<pre>!qdep_build: DEFINES += \"MY_PACKAGE_EXPORT=\"\n</pre>\n<h3>Project dependencies</h3>\n<p>Another side of qdep besides normal pri dependencies are full project dependencies. In this scenario, you include a full qmake project into your tree as child of a SUBDIRS projects. This allows the use of qdep package export pri files to link to these projects without much effort. To make use of this feature, you have to use a subdirs project that references the pro dependency, as well as normal projects that link against it. One great advantage of using project dependencies is, that they can reference other project dependencies they depend on, which means even for full projects, qdep takes care of the recursive dependency resolving for you.</p>\n<p>To get started, assume the following project structure:</p>\n<pre><code>root (subdirs)\n  |--libs (subdirs)\n  |    |--lib (lib)\n  |--app (app)\n</code></pre>\n<p>Both lib and app are assumed to depend on a theoretical qdep project dependency name <code>Skycoder42/SuperLib</code>, but app also depends on lib.</p>\n<p>The first step would be to choose a subdirs project to add the dependency to. For this example, the libs project is choosen. Add the following lines to add the dependency:</p>\n<pre>TEMPLATE = subdirs\nSUBDIRS += lib\n\n# ....\n\nQDEP_PROJECT_SUBDIRS += Skycoder42/SuperLib\nlib.qdep_depends += Skycoder42/SuperLib\n!load(qdep):error(\"Failed to load qdep feature\")\n</pre>\n<p>The <code>QDEP_PROJECT_SUBDIRS</code> is used to actually pull in the project dependency, while adding it to <code>lib.qdep_depends</code> <em>only</em> makes sure that the qdep dependency is built before lib. This is not needed if lib does not depend on the qdep dependency. It is however recommended to always have a seperate subdirs project for qdep dependencies, i.e. for this concrete example it would be better to move the lib project one stage up or create another subdir project within libs that references the qdep dependencies.</p>\n<p>Next, we need to reference the library itself in app/lib. The procedure is the same for both, so here it is only shown for the app project as an example. In the app pro file, add the lines:</p>\n<pre>QDEP_PROJECT_ROOT = libs  # Or \"./libs\" - would be \"..\" for the lib project\nQDEP_PROJECT_LINK_DEPENDS += Skycoder42/SuperLib\n!load(qdep):error(\"Failed to load qdep feature\")\n</pre>\n<p><code>QDEP_PROJECT_ROOT</code> tells qdep where the project is located, that contains the reference to the actual qdep project dependency, and <code>QDEP_PROJECT_LINK_DEPENDS</code> list all the dependencies this project (app) depends on. If any dependency listed there was not specified in the libs project via <code>QDEP_PROJECT_SUBDIRS</code>, the build will fail.</p>\n<p>And with that, the project dependency has been sucessfully added and referenced. With the next build, the project would be downloaded, compiled and linked against app/lib.</p>\n<h4>Creating project dependencies</h4>\n<p>Generally speaking, project dependencies are just normal qmake projects. However, such a project should <strong>always</strong> include the qdep feature and add <code>qdep_link_export</code> to the config, as without the generated export pri file, it will not be usable as qdep project dependency. But besides that, you can do anything you want, i.e. add other normal qdep pri dependencies etc. and even export them if needed.</p>\n<p>However, there is one additional feature that is only possible with qdep project dependencies: You can directly reference other qdep project dependencies. Doing so will make sure that whichever subdirs project that includes this project will also include the dependencies as subdirs and ensure the qmake build order, as well as referencing the corresponding export pri files. To for example reference <code>Skycoder42/SuperLib</code> from within a qdep project dependency, add the following:</p>\n<pre>QDEP_PROJECT_DEPENDS += Skycoder42/SuperLib\n!load(qdep):error(\"Failed to load qdep feature\")\n</pre>\n<h2>Documentation</h2>\n<p>In the following sections, all the functions, variables etc. of qdep are documented for reference.</p>\n<h3>Command line interface</h3>\n<p>qdep has a public and a private command line API. The public API is intended to be used by delevopers, while the internal API is used by the qdep qmake feature to perform various operations. The following sections list all the commands with a short description. For more details on each command, type <code>qdep &lt;command&gt; --help</code></p>\n<h4>Public API operations:</h4>\n<pre><code>prfgen     Generate a qmake project feature (prf) for the given qmake.\ninit       Initialize a pro file to use qdep by adding the required lines.\nlupdate    Run lupdate for the QDEP_TRANSLATION variable in a given pri\n           file.\nclear      Remove all sources from the users global cache.\nversions   List all known versions/tags of the given package\nquery      Query details about a given package identifier\nget        Download the sources of one ore more packages into the source\n           cache.\nupdate     Check for newer versions of used packages and optionally update\n           them.\n</code></pre>\n<h4>Private API operations:</h4>\n<pre><code>dephash     Generated unique identifying hashes for qdep\n            packages.\npkgresolve  Download the given qdep package and extract relevant\n            information from it.\nhookgen     Generate a header file with a method to load all\n            resource hooks.\nhookimp     Generate a source file that includes and runs all\n            qdep hooks as normal startup hook.\nlconvert    Combine ts files with translations from qdep\n            packages.\nprolink     Resolve the path a linked project dependency would\n            be at.\n</code></pre>\n<h3>QMAKE-Feature</h3>\n<p>This is the documentation of the qmake feature that is generated by qdep and loaded by adding <code>load(qdep)</code> to your project. All variables, CONFIG-flags and more are documented below.</p>\n<h4>Variables</h4>\n<h5>Common Variables</h5>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Direction</th>\n<th>Default</th>\n<th>Descriptions</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>QDEP_PATH</td>\n<td>in/out</td>\n<td><code>&lt;system&gt;</code></td>\n<td>Holds the path to the qdep binary to be used. Can be overwritten to specify a custom locations</td>\n</tr>\n<tr>\n<td>QDEP_VERSION</td>\n<td>out</td>\n<td><code>&lt;system&gt;</code></td>\n<td>The version of qdep which was used to generate the qdep feature</td>\n</tr>\n<tr>\n<td>QDEP_GENERATED_DIR</td>\n<td>in</td>\n<td><code>$$OUT_PWD</code></td>\n<td>The sub-directory in the build folder where qdep should place all it's generated files. Can be an absolute or relative path</td>\n</tr>\n<tr>\n<td>QDEP_EXPORT_PATH</td>\n<td>in</td>\n<td><code>$$QDEP_GENERATED_DIR/&lt;type&gt;</code></td>\n<td>The directory where to place export pri files for libraries that export dependencies. Can be relative to OUT_PWD or absolute. Use QDEP_EXPORT_NAME to get the name of that file without a path</td>\n</tr>\n<tr>\n<td>QDEP_DEPENDS</td>\n<td>in</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Specify all dependencies to qdep packages to be included into your project</td>\n</tr>\n<tr>\n<td>QDEP_LINK_DEPENDS</td>\n<td>in</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Reference other projects in the same build tree that this project should link against. Those projects must be exporting a pri file</td>\n</tr>\n<tr>\n<td>QDEP_PROJECT_SUBDIRS</td>\n<td>in</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Specify all dependencies to qdep projects to be added as qmake project to the SUBDIRS variable. Only evaluted in projects that specify TEMPLATE as <code>subdirs</code></td>\n</tr>\n<tr>\n<td>QDEP_PROJECT_ROOT</td>\n<td>in</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>The path to a project qmake project directory or file to resolve QDEP_PROJECT_LINK_DEPENDS against</td>\n</tr>\n<tr>\n<td>QDEP_PROJECT_LINK_DEPENDS</td>\n<td>in</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Sepcify all dependencies to qdep projects this project should be linked against. The dependencies are assumed to be provided in that project via QDEP_PROJECT_SUBDIRS.</td>\n</tr>\n<tr>\n<td>QDEP_DEFINES</td>\n<td>in</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Specify DEFINES that are exported if the library exports a pri file. All values are automatically added to DEFINES by qdep</td>\n</tr>\n<tr>\n<td>QDEP_INCLUDEPATH</td>\n<td>in</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Specify INCLUDEPATHS that are exported if the library exports a pri file. All values are automatically added to INCLUDEPATH by qdep</td>\n</tr>\n<tr>\n<td>QDEP_LIBS</td>\n<td>in</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Specify LIBS that are exported if the library exports a pri file. All values are automatically added to LIBS by qdep</td>\n</tr>\n<tr>\n<td>QDEP_EXPORTS</td>\n<td>in</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Specify qdep dependencies of which the API should be exported. Can be useful to export packages when used in dynamic libraries - only works if packages explicitly support this</td>\n</tr>\n<tr>\n<td>QDEP_LUPDATE_INPUTS</td>\n<td>in</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Additional files or folders to parse for translations when running <code>make lupdate</code></td>\n</tr>\n<tr>\n<td>QDEP_PACKAGE_EXPORTS</td>\n<td>in (pkg)</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Variables to be defined as import/export/nothing and be used as prefix to a class.</td>\n</tr>\n<tr>\n<td>QDEP_TRANSLATIONS</td>\n<td>in (pkg)</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Specify translation subfiles within a qdep dependency to be merged with the translations of the project they are included from</td>\n</tr>\n<tr>\n<td>QDEP_PROJECT_DEPENDS</td>\n<td>in (pkg)</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Specify all dependencies to qdep projects this qdep project depends on. Can only be used in qdep project dependencies and adds it's contents to QDEP_PROJECT_SUBDIRS of the project that includes this dependency</td>\n</tr>\n<tr>\n<td>QDEP_VAR_EXPORTS</td>\n<td>in (pkg)</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Specify the names of additional qmake variables that should be exported from a qdep dependency besides DEFINES and INCLUDEPATH</td>\n</tr></tbody></table>\n<h5>SUBDIRS extension</h5>\n<ul>\n<li><code>qdep_depends</code>: Can be added to any variable passed to <code>SUBDIRS</code> in a project that uses <code>QDEP_PROJECT_SUBDIRS</code> to specify that a certain subdir project depends on that specific package. This does <strong>not</strong> take care of linkage etc. It only ensures that the make targets are build in the correct order.</li>\n</ul>\n<h5>Advanced Variables</h5>\n<table>\n<thead>\n<tr>\n<th>Name</th>\n<th>Direction</th>\n<th>Default</th>\n<th>Descriptions</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>QDEP_TOOL</td>\n<td>in/out</td>\n<td><code>&lt;system&gt;</code></td>\n<td>The escaped command line base for qdep commands run from within qmake</td>\n</tr>\n<tr>\n<td>QDEP_CACHE_SCOPE</td>\n<td>in</td>\n<td><code>stash</code></td>\n<td>The method of caching to be used to cache various qmake related stuff. Can be &lt;empty&gt;, super or stash</td>\n</tr>\n<tr>\n<td>QDEP_GENERATED_SOURCES_DIR</td>\n<td>out</td>\n<td><code>$$QDEP_GENERATED_DIR/&lt;type&gt;</code></td>\n<td>The directory where generated source files are placed. Is determined by the build configuration to take debug/release builds into account</td>\n</tr>\n<tr>\n<td>QDEP_GENERATED_TS_DIR</td>\n<td>in</td>\n<td><code>$$QDEP_GENERATED_DIR/.qdepts/&lt;type&gt;</code></td>\n<td>The directory where generated translation sources are placed.</td>\n</tr>\n<tr>\n<td>QDEP_LUPDATE</td>\n<td>in</td>\n<td><code>lupdate -recursive -locations relative</code></td>\n<td>The path to the lupdate tool and additional arguments for lupdate in the <code>make lupdate</code> command to control it's behaviour</td>\n</tr>\n<tr>\n<td>QDEP_LCONVERT</td>\n<td>in</td>\n<td><code>lconvert -sort-contexts</code></td>\n<td>The path to the lconvert tool and additional arguments to be used to combine translations</td>\n</tr>\n<tr>\n<td>QDEP_EXPORT_NAME</td>\n<td>in/out</td>\n<td><code>&lt;pro-file-name&gt;_export.pri</code></td>\n<td>The name of a generated library import file. Must be only the name of the file, use QDEP_EXPORT_PATH to specify the location</td>\n</tr>\n<tr>\n<td>QDEP_EXPORTED_DEFINES</td>\n<td>out</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>DEFINES that come from QDEP_PACKAGE_EXPORTS or DEFINES from any directly included qdep dependency</td>\n</tr>\n<tr>\n<td>QDEP_EXPORTED_INCLUDEPATH</td>\n<td>out</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>INCLUDEPATHs that come from any directly included qdep dependency</td>\n</tr>\n<tr>\n<td>QDEP_EXPORTED_LIBS</td>\n<td>out</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>LIBS that come from any directly included qdep dependency</td>\n</tr>\n<tr>\n<td>QDEP_HOOK_FNS</td>\n<td>out</td>\n<td><code>&lt;empty&gt;</code></td>\n<td>Holds all names of functions to be run as startup hook by qdep</td>\n</tr></tbody></table>\n<h4>Configuration values</h4>\n<h5>Input value</h5>\n<ul>\n<li><code>qdep_force</code>: Enforce the full evaluation of qdep, even if the pro file is beeing evaluated without a context (This is potentially dangerous and should not be used unless absolutely neccessary)</li>\n<li><code>qdep_no_pull</code>: Do not pull for newer versions of branch-based dependencies. Cloning new packages will still work</li>\n<li><code>qdep_no_clone</code>: Do not clone completely new packages or package versions. Pulling on already cached branches will still work</li>\n<li><code>qdep_no_cache</code>: Do not cache the used versions of packages without a specified versions. Instead the latest version is queried on every run</li>\n<li><code>qdep_export_all</code>: export all dependant packages, i.e. any QDEP_PACKAGE_EXPORTS for every package are treated as if added to QDEP_EXPORTS</li>\n<li><code>qdep_no_link</code>: When exporting packages from a library, do not add the qmake code to link the library (and to it's includes) to the generate export.pri file</li>\n<li><code>qdep_no_qm_combine</code>: Do not combine TRANSLATIONS with QDEP_TRANSLATIONS. Instead treat QDEP_TRANSLATIONS as EXTRA_TRANSLATIONS and generate seperate qm files for them</li>\n<li><code>qdep_link_export</code>: Enforce the creation of an export pri file. Normally only libraries without qdep_no_link defined or projects that specify qdep_export_all or have values in QDEP_EXPORTS generate such files</li>\n<li><code>qdep_no_export_link</code>: Do not export contents of QT, PKGCONFIG or QDEP_LIBS in a generated export pri file</li>\n</ul>\n<h5>Output values</h5>\n<ul>\n<li><code>qdep_build</code>: Is set in case the qdep features was loaded correctly and is enabled</li>\n</ul>\n<h5>Defines</h5>\n<ul>\n<li><code>QDEP_BUILD</code>: Is defined in case the qdep features was loaded correctly and is enabled</li>\n</ul>\n<h4>Environment variables</h4>\n<ul>\n<li><code>QDEP_CACHE_DIR</code>: The directory where to cache downloaded sources. Is automatically determined for every system but can be overwritten with this variable</li>\n<li><code>QDEP_SOURCE_OVERRIDE</code>: Allows to provide a mapping in the format <code>&lt;pkg1&gt;;&lt;pkg2&gt;^&lt;pkg3&gt;;&lt;pkg4&gt;</code>. This will make qdep automatically replace any occurance of <code>pkg1</code> with <code>pkg2</code> etc. Can be used by developers to temporarily overwrite packages</li>\n<li><code>QDEP_DEFAULT_PKG_FN</code>: A template that is used to resolve non-url packages like <code>User/package</code> to a full url. The default method for that is <code>https://github.com/{}.git</code> - with <code>{}</code> being replaced by the short package name.</li>\n</ul>\n<h4>Public make targets</h4>\n<ul>\n<li><code>make lupdate</code>: Runs the <code>lupdate</code> tool to update your translations in a quick and easy manner, without having to rely on potentially buggy pro-file-parsing.</li>\n</ul>\n<h4>Internal</h4>\n<h5>Variables</h5>\n<ul>\n<li><code>__QDEP_PRIVATE_SEPERATOR</code>: Seperator between datasets</li>\n<li><code>__QDEP_TUPLE_SEPERATOR</code>: Seperator between values within a dataset</li>\n<li><code>__QDEP_INCLUDE_CACHE</code>: objects with details about included depdendencies of all kinds</li>\n<li><code>__QDEP_ORIGINAL_TRANSLATIONS</code>: All original translation that were in TRANSLATIONS before apply translation combination with QDEP_TRANSLATIONS from included packages</li>\n<li><code>__QDEP_HOOK_FILES</code>: Paths to header files that contain hook definitions that must be included and loaded by a project</li>\n<li><code>__QDEP_EXPORT_QMAKE_INCLUDE_GUARD</code>: a cache of included exported pri files to ensure each gets included only once</li>\n</ul>\n<h5>Configuration values</h5>\n<ul>\n<li><code>__qdep_script_version</code>: The version detected at runtime as reported by the qdep executable</li>\n<li><code>__qdep_dump_dependencies</code>: Create a file named qdep_depends.txt in the build directory that contains all direct dependencies of the project</li>\n</ul>\n<h5>QMAKE test functions</h5>\n<ul>\n<li><code>qdepCollectDependencies(dependencies ...)</code>: Downloads all specified normal dependencies and adds them to <code>__QDEP_INCLUDE_CACHE</code> to be linked later by qdep. Works recursively</li>\n<li><code>qdepCollectProjectDependencies(dependencies ...)</code>: Downloads all specified project dependencies and adds them to <code>SUBDIRS</code>. Works recursively</li>\n<li><code>qdepResolveSubdirDepends(subdir-vars ...)</code>: Converts the values of the <code>qdep_depends</code> subvar of all variables passed to the function to normal subdirs <code>depends</code> subvars</li>\n<li><code>qdepCreateExportPri(path)</code>: Creates a file named path and adds all export-related code to it</li>\n<li><code>qdepShellQuote(paths ...)</code>: Makes the given paths absolute based on <code>_PRO_FILE_PWD_</code> and escapes them using <code>shell_quote</code></li>\n<li><code>qdepDumpUpdateDeps()</code>: Creates a file named qdep_depends.txt in the build directory that contains all direct dependencies of the project</li>\n</ul>\n<h5>QMAKE replace functions</h5>\n<ul>\n<li><code>qdepResolveProjectLinkDeps(project-root, link-depends ...)</code>: Resolves all link-depends project packages to subdir paths, assuming they are provided by the project located at project-root</li>\n<li><code>qdepOutQuote(name, values)</code>: Creates a number of lines of qmake code that assing each value in values to a variable named name, in a securely quoted manner</li>\n<li><code>qdepLinkExpand(path)</code>: Expands a shortened or relative path to a project that exports dependencies to get the path of the export pri file</li>\n<li><code>qdepResolveLinkRoot(path)</code>: Searches for a top-level qmake project, that has this project included as project dependency and returns the path to that pro file. Search is started based on path, which must be a build directory</li>\n</ul>\n\n          </div>"}, "last_serial": 5873800, "releases": {"1.0.0": [{"comment_text": "", "digests": {"md5": "a6756bfc70602a8a14ec0dbaf4fc275b", "sha256": "d34bba4bde29cd770e04cc067f6eb5aea866a0427000fed9b103291b0cf17584"}, "downloads": -1, "filename": "qdep-1.0.0-py3-none-any.whl", "has_sig": false, "md5_digest": "a6756bfc70602a8a14ec0dbaf4fc275b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 28392, "upload_time": "2019-01-22T21:29:15", "upload_time_iso_8601": "2019-01-22T21:29:15.254472Z", "url": "https://files.pythonhosted.org/packages/49/65/b49d7d4cbab7869737eb1d2db9c5dfaf7a685c747967d6ee56e4ca52b38c/qdep-1.0.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "724c88eca16baadfce4f473e662639c8", "sha256": "fd942dff53d26e814f0369786f7562339a9486bbacb24a9c888d5686e7a3b395"}, "downloads": -1, "filename": "qdep-1.0.0.tar.gz", "has_sig": false, "md5_digest": "724c88eca16baadfce4f473e662639c8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 40654, "upload_time": "2019-01-22T21:29:18", "upload_time_iso_8601": "2019-01-22T21:29:18.932529Z", "url": "https://files.pythonhosted.org/packages/22/05/7c3bd8c8a0a751c317f08dcc8707d92f527eba3646b4c2bbf8c26e4ad3f6/qdep-1.0.0.tar.gz", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "adb4ae5cee8e7df4d967baee04f24de9", "sha256": "f098a894eea61b34e89fa22aced466c54d5d32d48d1429a28ab66f40459dd569"}, "downloads": -1, "filename": "qdep-1.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "adb4ae5cee8e7df4d967baee04f24de9", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 28404, "upload_time": "2019-02-02T12:58:58", "upload_time_iso_8601": "2019-02-02T12:58:58.123718Z", "url": "https://files.pythonhosted.org/packages/fc/c2/7176afd706bc4421a350120bf9f53195075afbaf17b709591b141e09d60f/qdep-1.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ed794e5a7f410b8cb6d0b3811954b1db", "sha256": "3365b5b8c6c9f26deac7fbb34300c23b542d496ecfee300e5681fc2f17471643"}, "downloads": -1, "filename": "qdep-1.0.1.tar.gz", "has_sig": false, "md5_digest": "ed794e5a7f410b8cb6d0b3811954b1db", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 40587, "upload_time": "2019-02-02T12:59:00", "upload_time_iso_8601": "2019-02-02T12:59:00.072093Z", "url": "https://files.pythonhosted.org/packages/24/d3/ce28df1e1cb386c0280e60720f2340f52821e568226fb7ff5e9b6bc94c09/qdep-1.0.1.tar.gz", "yanked": false}], "1.1.0": [{"comment_text": "", "digests": {"md5": "db74ac0981954eaf1d2db2e796875ce9", "sha256": "a21df4a378a42d960a37fc7a01ad045adb3b219eb21bd267342a8a42e51762d7"}, "downloads": -1, "filename": "qdep-1.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "db74ac0981954eaf1d2db2e796875ce9", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 29942, "upload_time": "2019-07-07T22:08:38", "upload_time_iso_8601": "2019-07-07T22:08:38.934448Z", "url": "https://files.pythonhosted.org/packages/57/b2/e3e3438bbef0c8b367a4ca31bfb777073404446ab869995d4f7b14c1c71d/qdep-1.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "8fdd57298567d6b1cdae6d79b85d9a4c", "sha256": "fecbadc4025be132d5fa2a319950251954883d6adbfdbf908f22760dd4aeee2f"}, "downloads": -1, "filename": "qdep-1.1.0.tar.gz", "has_sig": false, "md5_digest": "8fdd57298567d6b1cdae6d79b85d9a4c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 46915, "upload_time": "2019-07-07T22:08:40", "upload_time_iso_8601": "2019-07-07T22:08:40.766275Z", "url": "https://files.pythonhosted.org/packages/61/fc/d46022c617ee7fd17c4ea25eb3b8c3b29b000897de2287d18e7798a7af88/qdep-1.1.0.tar.gz", "yanked": false}], "1.1.1": [{"comment_text": "", "digests": {"md5": "7ae7ea47f480bcf6f634b578455489f1", "sha256": "f0aff181709b98a7a62500caa8366c7169f7bbe511da53db5514b9d6ff1875a1"}, "downloads": -1, "filename": "qdep-1.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "7ae7ea47f480bcf6f634b578455489f1", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 29914, "upload_time": "2019-09-23T14:04:11", "upload_time_iso_8601": "2019-09-23T14:04:11.740996Z", "url": "https://files.pythonhosted.org/packages/39/07/e64aa65fc2c2f6b6ee314164c8d00cd86d2dd2b4350e27fa20462c5aec0f/qdep-1.1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d70d07dc92c5d1089d579dc0cd88c33e", "sha256": "89e290527064de5bd043c4223d3ad4cd13a113db474e2e3490237d8807266a58"}, "downloads": -1, "filename": "qdep-1.1.1.tar.gz", "has_sig": false, "md5_digest": "d70d07dc92c5d1089d579dc0cd88c33e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 46877, "upload_time": "2019-09-23T14:04:13", "upload_time_iso_8601": "2019-09-23T14:04:13.610779Z", "url": "https://files.pythonhosted.org/packages/e7/81/9f4d447a407d44c51166a9b45aea92b21c60ae59c3180def4f24f894d2cc/qdep-1.1.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "7ae7ea47f480bcf6f634b578455489f1", "sha256": "f0aff181709b98a7a62500caa8366c7169f7bbe511da53db5514b9d6ff1875a1"}, "downloads": -1, "filename": "qdep-1.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "7ae7ea47f480bcf6f634b578455489f1", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 29914, "upload_time": "2019-09-23T14:04:11", "upload_time_iso_8601": "2019-09-23T14:04:11.740996Z", "url": "https://files.pythonhosted.org/packages/39/07/e64aa65fc2c2f6b6ee314164c8d00cd86d2dd2b4350e27fa20462c5aec0f/qdep-1.1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d70d07dc92c5d1089d579dc0cd88c33e", "sha256": "89e290527064de5bd043c4223d3ad4cd13a113db474e2e3490237d8807266a58"}, "downloads": -1, "filename": "qdep-1.1.1.tar.gz", "has_sig": false, "md5_digest": "d70d07dc92c5d1089d579dc0cd88c33e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 46877, "upload_time": "2019-09-23T14:04:13", "upload_time_iso_8601": "2019-09-23T14:04:13.610779Z", "url": "https://files.pythonhosted.org/packages/e7/81/9f4d447a407d44c51166a9b45aea92b21c60ae59c3180def4f24f894d2cc/qdep-1.1.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:09:51 2020"}