{"info": {"author": "Quentin Stafford-Fraser", "author_email": "", "bugtrack_url": null, "classifiers": [], "description": "# Qhue\n\nQhue (pronounced 'Q') is an exceedingly thin Python wrapper for the Philips Hue API.\n\nI wrote it because some of the other (excellent) frameworks out there weren't quite keeping up with developments in the API.  Because Qhue encodes almost none of the underlying models - it's really just a way of constructing URLs and HTTP calls - it should inherit any new API features automatically.  The aim of Qhue is not to create another Python API for the Hue system, so much as to turn the existing API *into* Python, with minimal interference.\n\n## Understanding Qhue\n\nPhilips, to their credit, created a beautiful RESTful API for the Hue system.  It may not yet have all the features we'd like, but what does exist is very elegantly designed.  \n\nYou can (and should) read [the full documentation here](http://www.developers.meethue.com/philips-hue-api), but a quick summary is that resources like lights, scenes and so forth each have a URL, that might look like this:\n\n    http://[myhub]/api/<username>/lights/1\n\nYou can read information about light 1 by doing an HTTP GET of this URL, and modify it by doing an HTTP PUT.\n\nIn the `qhue` module we have a Resource class, which represents *something that has a URL*. By calling an instance of this class, you'll make an HTTP request to the hub on that URL.  \n\nIt also has a Bridge class, which is a handy starting point for building Resources (and is itself a Resource).  If that seems a bit abstract, don't worry - all will be made clear below.\n\n## Installing Qhue\n\nThat's easy.\n\n    pip install qhue\n\nYou may want to check [GitHub](https://github.com/quentinsf/qhue) for the  latest version of the module, and of this documentation.  The very latest code is likely to be on [the 'develop' branch](https://github.com/quentinsf/qhue/tree/develop).\n\n## Examples\n\nNote: These examples assume you know the IP address of your bridge.  See [the 'Getting Started' section of the API docs](http://www.developers.meethue.com/documentation/getting-started) if you need help in finding it.  I've assigned mine a static address of 192.168.0.45, so that's what you'll see below.\n\nThey also assume you have experimented with the API before, and so have a user account set up on the bridge, and the username stored somewhere.  If not, see the section below entitled 'Creating a user'.\n\nOK.  Now those preliminaries are out of the way...\n\nFirst, let's create a Bridge, which will be your top-level Resource.\n\n    # Connect to the bridge with a particular username\n    from qhue import Bridge\n    b = Bridge(\"192.168.0.45\", username)\n\nYou can see the URL of any Resource:\n\n    # This should give you something familiar from the API docs:\n    print b.url\n\nBy requesting most other attributes of a Resource object, you will construct a new Resource with the attribute name added to the URL of the original one:\n\n    lights = b.lights   # Creates a new Resource with its own URL\n    print lights.url    # Should have '/lights' on the end\n\nNow, these Resources are, at this stage, simply *references* to entities on the bridge: they haven't communicated with it yet.  To make an actual API call to the bridge, we simply *call* the Resource as if it were a function:\n\n    # Let's actually call the API and print the results\n    print lights()\n\nQhue takes the JSON that is returned by the API and turns it back into Python objects, typically a dictionary, so you can access its parts easily, for example:\n\n    # Get the bridge's configuration info as a dict,\n    # and print the ethernet MAC address\n    print b.config()['mac']\n\nNow, ideally, we'd like to be able to construct all of our URLs the same way, so we would refer to light 1 as `b.lights.1`, for example, but you can't use numbers as attribute names in Python.  Nor can you use variables.  As an alternative, therefore, you can use dictionary key syntax - for example, `b.lights[1]`.\n\n    # Get information about light 1\n    print b.lights[1]()\n\n    # or, to do the same thing another way:\n    print b['lights'][1]()\n\nAlternatively, when you *call* a resource, you can give it arguments, which will be added to its URL when making the call:\n\n    # This is the same as the last examples:\n    print b('lights', 1)\n\nSo there are several ways to express the same thing, and you can choose the one which fits most elegantly into your code.\n\n### Making changes\n\nNow, to make a change to a value, you also call the resource, but you add keyword arguments to specify the properties you want to change.  You can change the brightness and hue of a light by setting properties on its *state*, for example:\n\n    b.lights[1].state(bri=128, hue=9000)\n\nand you can mix URL-constructing positional arguments with value-setting keyword arguments, if you like:\n\n    # Positional arguments are added to the URL.\n    # Keyword arguments change values.\n    # So these are equivalent to the previous example:\n\n    b.lights(1, 'state', bri=128, hue=9000)\n    b('lights', 1, 'state', bri=128, hue=9000)\n\nWhen you need to specify boolean true/false values, you should use the native Python True and False.\n\nAs a more complex example, if you want to set the brightness and colour temperature of a light in a given scene, you might use a call like this:\n\n    bridge.scenes[scene].lightstates[light](on=True, bri=bri, ct=ct)\n\nThis covers most simple cases.  If you don't have any keyword arguments, the HTTP request will be a GET, and will tell you about the current status.  If you do have keyword arguments, it will be a PUT, and will change the current status.\n\nSometimes, though, you need to specify a POST or a DELETE, and you can do so with the special *http_method* argument, which will override the above rule:\n\n    # Delete rule 1\n    b('rules', 1, http_method='delete')\n\nIf you need to specify a keyword argument that would conflict with a Python keyword, such as `class`, simply append an underscore to it, like this:\n\n    # Set property \"class\" to \"Hallway\".\n    # The trailing underscore will automatically be removed\n    # in the property name sent to the bridge.\n\n    b.groups[19](class_='Hallway')\n\nFinally, for certain operations, like schedules and rules, you'll want to know the 'address' of a resource, which is the absolute URL path - the bit after the IP address, or, more recently, the bit after the username.  You can get these with the `address` and `short_address` attributes:\n\n    >>> b.groups[1].url\n    'http://192.168.0.45/api/ac594202624a7211ac44615430a461/groups/1'\n    >>> b.groups[1].address\n    '/api/ac594202624a7211ac44615430a461/groups/1'\n    >>> b.groups[1].short_address\n    '/groups/1'\n\nSee the API docs for more information about when you need this.\n\nAnd, at present, that's about it.\n\n\n## A couple of hints:\n\n* Some of the requests can return large amounts of information.  A handy way to make it more readable is to format it as YAML.  You may need to `pip install PyYAML`, then try the following:\n\n        import yaml  \n        print(yaml.safe_dump(bridge.groups(), indent=4))\n\n* The Bridge generally returns items in a reasonably logical order. The order is not actually important, but if you wish to preserve it, then you probably *don't* want the JSON structures turned into Python dicts, since these do not generally preserve ordering.  When you construct the Bridge object, you can tell it to use another function to turn JSON dictionaries into Python structures, for example by specifying `object_pairs_hook=collections.OrderedDict`. This will give you OrderedDicts instead of dicts, which is a benefit in almost every way, except that any YAML output you create from it won't look so nice.\n\n* If you're familiar with the Jupyter (iPython) Notebook system, it can be a fun way to explore the API.  See the [Qhue Playground example notebook](Qhue%20playground.ipynb).\n\n\n## Creating a user\n\nIf you haven't used the API before, you'll need to create a user account on the bridge.\n\n    from qhue import create_new_username\n    username = create_new_username(\"192.168.0.45\")\n\nYou'll get a prompt saying that the link button on the bridge needs to be pressed.  Go and press it, and you should get a generated username. You can now get a new Bridge object as shown in the examples above, passing this username as the second argument.\n\nPlease have a look at the examples directory for a method to store the username for future sessions.\n\n\n## Usage notes\n\nPlease note that qhue won't do any local checking of any method calls or arguments - it just packages up what you give it and sends it to the bridge.\n\nAn important example of this is that the bridge is expecting integer values for things like colour temperature and brightness. If, say, you do a calculation for your colour which returns a float, you need to convert that to an int before sending or it will be ignored.  (Sending a string returns an error, but sending a float does not.)\n\n\n## Prerequisites\n\nThis works under Python 2 and Python 3.  It uses Kenneth Reitz's excellent [requests](http://docs.python-requests.org/en/latest/) module, so you'll need to do:\n\n    pip install requests\n\nor something similar before using Qhue.  If you installed Qhue itself using pip, this shouldn't be necessary.\n\n\n## Licence\n\nThis little snippet is distributed under the GPL v2. See the LICENSE file. (They spell it that way on the other side of the pond.) It comes with no warranties, express or implied, but just with the hope that it may be useful to someone.\n\n\n## Contributing\n\nSuggestions, patches, pull requests welcome.  There are many ways this could be improved.\n\nIf you can do so in a general way, without adding too many lines, that would be even better!  Brevity, as Polonius said, is the soul of wit.\n\nMany thanks to David Coles, Chris Macklin, Andrea Jemmett, Martin Paulus, Ryan Turner, Matthew Clapp, Marcus Klaas de Vries and Richard Morrison, amongst others, for their contributions!\n\n[Quentin Stafford-Fraser](http://quentinsf.com)", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/quentinsf/qhue", "keywords": "", "license": "GNU GPL 2", "maintainer": "", "maintainer_email": "", "name": "qhue", "package_url": "https://pypi.org/project/qhue/", "platform": "", "project_url": "https://pypi.org/project/qhue/", "project_urls": {"Homepage": "https://github.com/quentinsf/qhue"}, "release_url": "https://pypi.org/project/qhue/1.0.12/", "requires_dist": null, "requires_python": "", "summary": "Qhue: python wrapper for Philips Hue API", "version": "1.0.12", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Qhue</h1>\n<p>Qhue (pronounced 'Q') is an exceedingly thin Python wrapper for the Philips Hue API.</p>\n<p>I wrote it because some of the other (excellent) frameworks out there weren't quite keeping up with developments in the API.  Because Qhue encodes almost none of the underlying models - it's really just a way of constructing URLs and HTTP calls - it should inherit any new API features automatically.  The aim of Qhue is not to create another Python API for the Hue system, so much as to turn the existing API <em>into</em> Python, with minimal interference.</p>\n<h2>Understanding Qhue</h2>\n<p>Philips, to their credit, created a beautiful RESTful API for the Hue system.  It may not yet have all the features we'd like, but what does exist is very elegantly designed.</p>\n<p>You can (and should) read <a href=\"http://www.developers.meethue.com/philips-hue-api\" rel=\"nofollow\">the full documentation here</a>, but a quick summary is that resources like lights, scenes and so forth each have a URL, that might look like this:</p>\n<pre><code>http://[myhub]/api/&lt;username&gt;/lights/1\n</code></pre>\n<p>You can read information about light 1 by doing an HTTP GET of this URL, and modify it by doing an HTTP PUT.</p>\n<p>In the <code>qhue</code> module we have a Resource class, which represents <em>something that has a URL</em>. By calling an instance of this class, you'll make an HTTP request to the hub on that URL.</p>\n<p>It also has a Bridge class, which is a handy starting point for building Resources (and is itself a Resource).  If that seems a bit abstract, don't worry - all will be made clear below.</p>\n<h2>Installing Qhue</h2>\n<p>That's easy.</p>\n<pre><code>pip install qhue\n</code></pre>\n<p>You may want to check <a href=\"https://github.com/quentinsf/qhue\" rel=\"nofollow\">GitHub</a> for the  latest version of the module, and of this documentation.  The very latest code is likely to be on <a href=\"https://github.com/quentinsf/qhue/tree/develop\" rel=\"nofollow\">the 'develop' branch</a>.</p>\n<h2>Examples</h2>\n<p>Note: These examples assume you know the IP address of your bridge.  See <a href=\"http://www.developers.meethue.com/documentation/getting-started\" rel=\"nofollow\">the 'Getting Started' section of the API docs</a> if you need help in finding it.  I've assigned mine a static address of 192.168.0.45, so that's what you'll see below.</p>\n<p>They also assume you have experimented with the API before, and so have a user account set up on the bridge, and the username stored somewhere.  If not, see the section below entitled 'Creating a user'.</p>\n<p>OK.  Now those preliminaries are out of the way...</p>\n<p>First, let's create a Bridge, which will be your top-level Resource.</p>\n<pre><code># Connect to the bridge with a particular username\nfrom qhue import Bridge\nb = Bridge(\"192.168.0.45\", username)\n</code></pre>\n<p>You can see the URL of any Resource:</p>\n<pre><code># This should give you something familiar from the API docs:\nprint b.url\n</code></pre>\n<p>By requesting most other attributes of a Resource object, you will construct a new Resource with the attribute name added to the URL of the original one:</p>\n<pre><code>lights = b.lights   # Creates a new Resource with its own URL\nprint lights.url    # Should have '/lights' on the end\n</code></pre>\n<p>Now, these Resources are, at this stage, simply <em>references</em> to entities on the bridge: they haven't communicated with it yet.  To make an actual API call to the bridge, we simply <em>call</em> the Resource as if it were a function:</p>\n<pre><code># Let's actually call the API and print the results\nprint lights()\n</code></pre>\n<p>Qhue takes the JSON that is returned by the API and turns it back into Python objects, typically a dictionary, so you can access its parts easily, for example:</p>\n<pre><code># Get the bridge's configuration info as a dict,\n# and print the ethernet MAC address\nprint b.config()['mac']\n</code></pre>\n<p>Now, ideally, we'd like to be able to construct all of our URLs the same way, so we would refer to light 1 as <code>b.lights.1</code>, for example, but you can't use numbers as attribute names in Python.  Nor can you use variables.  As an alternative, therefore, you can use dictionary key syntax - for example, <code>b.lights[1]</code>.</p>\n<pre><code># Get information about light 1\nprint b.lights[1]()\n\n# or, to do the same thing another way:\nprint b['lights'][1]()\n</code></pre>\n<p>Alternatively, when you <em>call</em> a resource, you can give it arguments, which will be added to its URL when making the call:</p>\n<pre><code># This is the same as the last examples:\nprint b('lights', 1)\n</code></pre>\n<p>So there are several ways to express the same thing, and you can choose the one which fits most elegantly into your code.</p>\n<h3>Making changes</h3>\n<p>Now, to make a change to a value, you also call the resource, but you add keyword arguments to specify the properties you want to change.  You can change the brightness and hue of a light by setting properties on its <em>state</em>, for example:</p>\n<pre><code>b.lights[1].state(bri=128, hue=9000)\n</code></pre>\n<p>and you can mix URL-constructing positional arguments with value-setting keyword arguments, if you like:</p>\n<pre><code># Positional arguments are added to the URL.\n# Keyword arguments change values.\n# So these are equivalent to the previous example:\n\nb.lights(1, 'state', bri=128, hue=9000)\nb('lights', 1, 'state', bri=128, hue=9000)\n</code></pre>\n<p>When you need to specify boolean true/false values, you should use the native Python True and False.</p>\n<p>As a more complex example, if you want to set the brightness and colour temperature of a light in a given scene, you might use a call like this:</p>\n<pre><code>bridge.scenes[scene].lightstates[light](on=True, bri=bri, ct=ct)\n</code></pre>\n<p>This covers most simple cases.  If you don't have any keyword arguments, the HTTP request will be a GET, and will tell you about the current status.  If you do have keyword arguments, it will be a PUT, and will change the current status.</p>\n<p>Sometimes, though, you need to specify a POST or a DELETE, and you can do so with the special <em>http_method</em> argument, which will override the above rule:</p>\n<pre><code># Delete rule 1\nb('rules', 1, http_method='delete')\n</code></pre>\n<p>If you need to specify a keyword argument that would conflict with a Python keyword, such as <code>class</code>, simply append an underscore to it, like this:</p>\n<pre><code># Set property \"class\" to \"Hallway\".\n# The trailing underscore will automatically be removed\n# in the property name sent to the bridge.\n\nb.groups[19](class_='Hallway')\n</code></pre>\n<p>Finally, for certain operations, like schedules and rules, you'll want to know the 'address' of a resource, which is the absolute URL path - the bit after the IP address, or, more recently, the bit after the username.  You can get these with the <code>address</code> and <code>short_address</code> attributes:</p>\n<pre><code>&gt;&gt;&gt; b.groups[1].url\n'http://192.168.0.45/api/ac594202624a7211ac44615430a461/groups/1'\n&gt;&gt;&gt; b.groups[1].address\n'/api/ac594202624a7211ac44615430a461/groups/1'\n&gt;&gt;&gt; b.groups[1].short_address\n'/groups/1'\n</code></pre>\n<p>See the API docs for more information about when you need this.</p>\n<p>And, at present, that's about it.</p>\n<h2>A couple of hints:</h2>\n<ul>\n<li>\n<p>Some of the requests can return large amounts of information.  A handy way to make it more readable is to format it as YAML.  You may need to <code>pip install PyYAML</code>, then try the following:</p>\n<pre><code>  import yaml  \n  print(yaml.safe_dump(bridge.groups(), indent=4))\n</code></pre>\n</li>\n<li>\n<p>The Bridge generally returns items in a reasonably logical order. The order is not actually important, but if you wish to preserve it, then you probably <em>don't</em> want the JSON structures turned into Python dicts, since these do not generally preserve ordering.  When you construct the Bridge object, you can tell it to use another function to turn JSON dictionaries into Python structures, for example by specifying <code>object_pairs_hook=collections.OrderedDict</code>. This will give you OrderedDicts instead of dicts, which is a benefit in almost every way, except that any YAML output you create from it won't look so nice.</p>\n</li>\n<li>\n<p>If you're familiar with the Jupyter (iPython) Notebook system, it can be a fun way to explore the API.  See the <a href=\"Qhue%20playground.ipynb\" rel=\"nofollow\">Qhue Playground example notebook</a>.</p>\n</li>\n</ul>\n<h2>Creating a user</h2>\n<p>If you haven't used the API before, you'll need to create a user account on the bridge.</p>\n<pre><code>from qhue import create_new_username\nusername = create_new_username(\"192.168.0.45\")\n</code></pre>\n<p>You'll get a prompt saying that the link button on the bridge needs to be pressed.  Go and press it, and you should get a generated username. You can now get a new Bridge object as shown in the examples above, passing this username as the second argument.</p>\n<p>Please have a look at the examples directory for a method to store the username for future sessions.</p>\n<h2>Usage notes</h2>\n<p>Please note that qhue won't do any local checking of any method calls or arguments - it just packages up what you give it and sends it to the bridge.</p>\n<p>An important example of this is that the bridge is expecting integer values for things like colour temperature and brightness. If, say, you do a calculation for your colour which returns a float, you need to convert that to an int before sending or it will be ignored.  (Sending a string returns an error, but sending a float does not.)</p>\n<h2>Prerequisites</h2>\n<p>This works under Python 2 and Python 3.  It uses Kenneth Reitz's excellent <a href=\"http://docs.python-requests.org/en/latest/\" rel=\"nofollow\">requests</a> module, so you'll need to do:</p>\n<pre><code>pip install requests\n</code></pre>\n<p>or something similar before using Qhue.  If you installed Qhue itself using pip, this shouldn't be necessary.</p>\n<h2>Licence</h2>\n<p>This little snippet is distributed under the GPL v2. See the LICENSE file. (They spell it that way on the other side of the pond.) It comes with no warranties, express or implied, but just with the hope that it may be useful to someone.</p>\n<h2>Contributing</h2>\n<p>Suggestions, patches, pull requests welcome.  There are many ways this could be improved.</p>\n<p>If you can do so in a general way, without adding too many lines, that would be even better!  Brevity, as Polonius said, is the soul of wit.</p>\n<p>Many thanks to David Coles, Chris Macklin, Andrea Jemmett, Martin Paulus, Ryan Turner, Matthew Clapp, Marcus Klaas de Vries and Richard Morrison, amongst others, for their contributions!</p>\n<p><a href=\"http://quentinsf.com\" rel=\"nofollow\">Quentin Stafford-Fraser</a></p>\n\n          </div>"}, "last_serial": 4659455, "releases": {"1.0.0": [{"comment_text": "", "digests": {"md5": "7b486059e416dca023d25d0fa9bcc9fe", "sha256": "84879292707efeec92338c85dab5182ae485429a9a9148b7691249413e316973"}, "downloads": -1, "filename": "qhue-1.0.0.tar.gz", "has_sig": false, "md5_digest": "7b486059e416dca023d25d0fa9bcc9fe", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2169, "upload_time": "2016-02-16T09:31:32", "upload_time_iso_8601": "2016-02-16T09:31:32.346264Z", "url": "https://files.pythonhosted.org/packages/79/08/711bcd9fd3cc6ef50fb72f9a5a3640589d9ca825133e8bdded1c840ff299/qhue-1.0.0.tar.gz", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "8ed0612f5060a85dc2adc3c729021d32", "sha256": "5bab352e9ab0f7dfb29ac9f43e54c9b06860f0067693861108b159f9a5bff9c7"}, "downloads": -1, "filename": "qhue-1.0.1.tar.gz", "has_sig": false, "md5_digest": "8ed0612f5060a85dc2adc3c729021d32", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2170, "upload_time": "2016-02-16T09:37:46", "upload_time_iso_8601": "2016-02-16T09:37:46.731689Z", "url": "https://files.pythonhosted.org/packages/11/c7/6fd6802b39aba7edb56e9f93c0f2048e6d9aba054af430bb717b2ddb82ac/qhue-1.0.1.tar.gz", "yanked": false}], "1.0.10": [{"comment_text": "", "digests": {"md5": "5b4eb7be31cb7ea8c1c5a66371d21d4a", "sha256": "50ebe7873d0a8925e623883e0ed64eaada76060af3aa625a3d470737c48ee5b7"}, "downloads": -1, "filename": "qhue-1.0.10.tar.gz", "has_sig": false, "md5_digest": "5b4eb7be31cb7ea8c1c5a66371d21d4a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6463, "upload_time": "2018-11-15T22:59:22", "upload_time_iso_8601": "2018-11-15T22:59:22.385091Z", "url": "https://files.pythonhosted.org/packages/3f/b9/459062e3fc2776a4c87163809d410c2d15905608240db8ab743fe8c61fa4/qhue-1.0.10.tar.gz", "yanked": false}], "1.0.11": [{"comment_text": "", "digests": {"md5": "68d4cf70e3b5c765255991bc0e4c244b", "sha256": "1528040cdf11267dfb328af62344eed38f44523f92857d6c252d8c5ec52daf15"}, "downloads": -1, "filename": "qhue-1.0.11.tar.gz", "has_sig": false, "md5_digest": "68d4cf70e3b5c765255991bc0e4c244b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6750, "upload_time": "2019-01-04T08:50:20", "upload_time_iso_8601": "2019-01-04T08:50:20.364802Z", "url": "https://files.pythonhosted.org/packages/da/e8/09168769ade1f30edafeff6b59eeea1d54397d65adb4b03a2598022e6f9a/qhue-1.0.11.tar.gz", "yanked": false}], "1.0.12": [{"comment_text": "", "digests": {"md5": "9528a7a37dca0b109e001bb3de7f5083", "sha256": "d298fae24a0b13b01f46981a5a64633e7fc6fd92e86e7aa0febb570c1fbcace4"}, "downloads": -1, "filename": "qhue-1.0.12.tar.gz", "has_sig": false, "md5_digest": "9528a7a37dca0b109e001bb3de7f5083", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8141, "upload_time": "2019-01-04T08:59:03", "upload_time_iso_8601": "2019-01-04T08:59:03.849449Z", "url": "https://files.pythonhosted.org/packages/50/7f/b80f6d164272c89656185ba916d3ca831b68fb0631ef33f486029043e613/qhue-1.0.12.tar.gz", "yanked": false}], "1.0.2": [{"comment_text": "", "digests": {"md5": "a57a6b4a6f8d318c7367c64e7b6ee876", "sha256": "476e5987fcf292fdaddb4abf61d17d6abb8093d974b9b0a5b98071ba36f35cb1"}, "downloads": -1, "filename": "qhue-1.0.2.tar.gz", "has_sig": false, "md5_digest": "a57a6b4a6f8d318c7367c64e7b6ee876", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2256, "upload_time": "2016-03-05T19:02:44", "upload_time_iso_8601": "2016-03-05T19:02:44.813468Z", "url": "https://files.pythonhosted.org/packages/a5/7c/7f2239d53cec6bdebd0c8ff72749971ec8c2dfbfb5549e90d65d0298321b/qhue-1.0.2.tar.gz", "yanked": false}], "1.0.3": [{"comment_text": "", "digests": {"md5": "119f5612620229b0ad3091ec98c8dd65", "sha256": "f80fd10cb960aed63100d59efea4b7477c607da6d36e9b10551a1d8d1bcabf5c"}, "downloads": -1, "filename": "qhue-1.0.3.tar.gz", "has_sig": false, "md5_digest": "119f5612620229b0ad3091ec98c8dd65", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2273, "upload_time": "2016-07-20T08:46:07", "upload_time_iso_8601": "2016-07-20T08:46:07.749365Z", "url": "https://files.pythonhosted.org/packages/ee/a0/90ff39fb2188dac09a9a1226465064e0ecc2ea03bd687f260ad69a0e4f58/qhue-1.0.3.tar.gz", "yanked": false}], "1.0.4": [{"comment_text": "", "digests": {"md5": "d845d549f173cb05c19060ff28a35c5d", "sha256": "52234e25ec407dd20b19e699df22324b54cc43c4a9590d63cc74b6f5d4b8d043"}, "downloads": -1, "filename": "qhue-1.0.4.tar.gz", "has_sig": false, "md5_digest": "d845d549f173cb05c19060ff28a35c5d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2275, "upload_time": "2016-07-20T09:15:26", "upload_time_iso_8601": "2016-07-20T09:15:26.321937Z", "url": "https://files.pythonhosted.org/packages/83/ee/984a91b6124a4af82738520b225fda5ca3642ebded3e0ed184487fa1d950/qhue-1.0.4.tar.gz", "yanked": false}], "1.0.5": [{"comment_text": "", "digests": {"md5": "177b98593657cf2fc1434fe3518ecd52", "sha256": "ab3fc1410b3a8bdf8790f7a1187535cdeab8cc48d7eb490e6cdf28197f47b66e"}, "downloads": -1, "filename": "qhue-1.0.5.tar.gz", "has_sig": false, "md5_digest": "177b98593657cf2fc1434fe3518ecd52", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2276, "upload_time": "2016-11-16T09:35:38", "upload_time_iso_8601": "2016-11-16T09:35:38.858148Z", "url": "https://files.pythonhosted.org/packages/00/ee/a01beee90e948b310c7d1b31e972c6d3a8543005ea20d2f58aaf7f2923a8/qhue-1.0.5.tar.gz", "yanked": false}], "1.0.6": [{"comment_text": "", "digests": {"md5": "e6fe2ead77f0f627a1944c722ec01232", "sha256": "1cf01c018a00d71a534f05672adcf6c3f7c58a5ef4804edfe689fee093e993a5"}, "downloads": -1, "filename": "qhue-1.0.6.tar.gz", "has_sig": false, "md5_digest": "e6fe2ead77f0f627a1944c722ec01232", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2300, "upload_time": "2017-05-14T09:13:36", "upload_time_iso_8601": "2017-05-14T09:13:36.354214Z", "url": "https://files.pythonhosted.org/packages/78/0c/32f4109e26f798f01cac33c86e9ba4a84a002cb5249c6a14e1c1c0c5945f/qhue-1.0.6.tar.gz", "yanked": false}], "1.0.7": [{"comment_text": "", "digests": {"md5": "686dc507c0e13e41fa9569fe36fbaced", "sha256": "bbe9a893c97925b04c1c70cafc8061c67395b147af88260e1b86f7b68486b43d"}, "downloads": -1, "filename": "qhue-1.0.7.tar.gz", "has_sig": false, "md5_digest": "686dc507c0e13e41fa9569fe36fbaced", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2303, "upload_time": "2017-05-14T09:58:11", "upload_time_iso_8601": "2017-05-14T09:58:11.822308Z", "url": "https://files.pythonhosted.org/packages/7b/c4/cd44cc5b8e84828600e7c8018305a0922b5e9d8d8d4cda52c71418b51a4b/qhue-1.0.7.tar.gz", "yanked": false}], "1.0.8": [{"comment_text": "", "digests": {"md5": "1faa5cc92f5ba09e27df36a81377bcdb", "sha256": "9b18bbdddb888c47ceb7f1321fca9c605113019cc053dde448b56897e798235e"}, "downloads": -1, "filename": "qhue-1.0.8.tar.gz", "has_sig": false, "md5_digest": "1faa5cc92f5ba09e27df36a81377bcdb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2362, "upload_time": "2017-07-05T08:22:01", "upload_time_iso_8601": "2017-07-05T08:22:01.397159Z", "url": "https://files.pythonhosted.org/packages/23/f2/efccceda3867538815db640b4b7df63da1d6fde08dae0ed16de13807ec13/qhue-1.0.8.tar.gz", "yanked": false}], "1.0.9": [{"comment_text": "", "digests": {"md5": "461296caa541ea66955414cf5ccb6606", "sha256": "80d68f5ede8060099793da8c9cb6ca2063ea8fce2539d227d40773bc69a80cd3"}, "downloads": -1, "filename": "qhue-1.0.9.tar.gz", "has_sig": false, "md5_digest": "461296caa541ea66955414cf5ccb6606", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6115, "upload_time": "2017-12-10T17:59:11", "upload_time_iso_8601": "2017-12-10T17:59:11.263537Z", "url": "https://files.pythonhosted.org/packages/0f/33/913c58c847180a0a0c6ae3bd12407e0c597532b61d019f229124f8a1295f/qhue-1.0.9.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "9528a7a37dca0b109e001bb3de7f5083", "sha256": "d298fae24a0b13b01f46981a5a64633e7fc6fd92e86e7aa0febb570c1fbcace4"}, "downloads": -1, "filename": "qhue-1.0.12.tar.gz", "has_sig": false, "md5_digest": "9528a7a37dca0b109e001bb3de7f5083", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8141, "upload_time": "2019-01-04T08:59:03", "upload_time_iso_8601": "2019-01-04T08:59:03.849449Z", "url": "https://files.pythonhosted.org/packages/50/7f/b80f6d164272c89656185ba916d3ca831b68fb0631ef33f486029043e613/qhue-1.0.12.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:09:41 2020"}