{"info": {"author": "Brenna Sage", "author_email": "linuxaddict11111@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha"], "description": "rgr.py -- A graph database built on Redis.\r\n\r\nYea, another one...\r\n\r\nI'm not sure if my module is better than the other ones that I found by searching Pypi, and I highly doubt that it's more memory efficient. What can I say? I'm a hacker, not a computer scientist. But, It's probably easier, and simpler, if nothing else. For what it's worth, I'd like this to be the best ;)\r\n\r\nThis is my first package, so I'm looking for feedback. If you use it, feel free to email me or make suggestions on my github page for ths project. Please tell me why I suck, and how much ;)\r\n\r\nI'm still working on it actively, I just wanted to put it out there in hopes of getting feedback.", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/la11111/rgr", "keywords": "Redis, Graph, Database", "license": "GPL", "maintainer": "", "maintainer_email": "", "name": "rgr", "package_url": "https://pypi.org/project/rgr/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/rgr/", "project_urls": {"Download": "UNKNOWN", "Homepage": "https://github.com/la11111/rgr"}, "release_url": "https://pypi.org/project/rgr/0.1/", "requires_dist": null, "requires_python": null, "summary": "a(nother) graph database built on Redis", "version": "0.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>rgr.py – A graph database built on Redis.</p>\n<p>Yea, another one…</p>\n<p>I’m not sure if my module is better than the other ones that I found by searching Pypi, and I highly doubt that it’s more memory efficient. What can I say? I’m a hacker, not a computer scientist. But, It’s probably easier, and simpler, if nothing else. For what it’s worth, I’d like this to be the best ;)</p>\n<p>This is my first package, so I’m looking for feedback. If you use it, feel free to email me or make suggestions on my github page for ths project. Please tell me why I suck, and how much ;)</p>\n<p>I’m still working on it actively, I just wanted to put it out there in hopes of getting feedback.</p>\n\n          </div>"}, "last_serial": 1363345, "releases": {"0.1": []}, "urls": [], "timestamp": "Fri May  8 03:03:01 2020"}