{"info": {"author": "Torsten Irländer", "author_email": "torsten@irlaender.de", "bugtrack_url": null, "classifiers": ["Framework :: Pyramid", "License :: OSI Approved :: GNU General Public License v2 or later (GPLv2+)", "Programming Language :: Python", "Topic :: Internet :: WWW/HTTP", "Topic :: Internet :: WWW/HTTP :: WSGI :: Application"], "description": "Ringo\r\n=====\r\n\r\n.. image:: https://travis-ci.org/ringo-framework/ringo.svg?branch=master\r\n    :target: https://travis-ci.org/ringo-framework/ringo\r\n\r\nRingo is a small Python based high level web application framework build with\r\nPyramid. Ringo tries to make it very easy to build form based web application\r\nto manage your data. Because Ringo provides many basic features which are\r\noften used in modern web applications it greatly speeds up development. But it\r\nis also flexible and offers many ways to configure the layout, behaviour and\r\nworkflow of your application. See the list of :ref:`features` for more\r\ndetails.\r\n\r\nRingo comes with an application scaffold which can be used as a boilerplate for\r\nyour application development. See the development part in the documentation\r\nfor more details on how to build a Ringo based application.\r\n\r\nLicense\r\n=======\r\nRingo is Free Software. It is licensed under the GPL license in version 2 or\r\nlater. See `<http://www.gnu.org/licenses/gpl-2.0>`_ for more details on the license.\r\n\r\nFeatures\r\n========\r\nRingo provides some basic features which are useful if you build your\r\nweb application based on Ringo:\r\n\r\n * Easy extendible and configurable modular architecture,\r\n * Basic actions for every module including:\r\n        - Search and sortable listing (storeable and configurable)\r\n        - Basic CRUD actions\r\n        - CSV, JSON import and export\r\n * Role based authorisation.\r\n * Authentication with email registration and password reminders\r\n * Powerfull statemachine to model workflows in modules.\r\n * Layout and validation of forms using the `Formbar <https://pypi.python.org/pypi/formbar>`_ library\r\n * Versioning of forms (see what changed to the last version)\r\n * Widely configurable from the web UI.\r\n * Nice console client for various administration tasks.\r\n * ...\r\n\r\nTests\r\n=====\r\nTo start the testsuite invoke the following command::\r\n\r\n        py.test --app-config test.ini\r\n\r\nOr with display of the coverage of the tests::\r\n\r\n        py.test --cov=ringo --app-config test.in\r\n\r\n\r\nDocumentation\r\n=============\r\nThe source of documentation comes with the source of Ringo and can be found in the\r\n\"docs\" folder. To generate the HTML version of the documentation please invoke the\r\nfollowing command::\r\n\r\n        invoke docs\r\n\r\nYou need to have the sphinx package installed in order to generate the documentation.\r\nA generated version of the documentation is available on\r\n`<http://ringo.readthedocs.org/>`_\r\n\r\n\r\nGetting Started\r\n---------------\r\nThe fastest way to get an impression of Ringo`s core functionality is to\r\nstart the standalone application of Ringo with the following steps:\r\n\r\n- $ git clone https://github.com/ringo-framework/ringo\r\n\r\n- $ python setup.py develop\r\n\r\n- $ ringo-admin db init\r\n\r\n- $ invoke docs\r\n\r\n- $ pserve development.ini\r\n\n\n1.14.0\n======\n- Rewrite of the documentation.\n- Fixed issue21 (https://github.com/ringo-framework/ringo/issues/21). Enabled\n  sorting config in Listingfieldrenderer.\n- Expand values from checkboxes too.\n- Added XLSX Export.\n- Introduced special suffix `__e_x_p_a_n_d` for attributes which can be used to\n  access the expanded value of the attribute as alternative to the call of\n  get_value. This is needed because it is not always possible to call the\n  get_value method. Example: getattr(obj, 'foo__e_x_p_a_n_d') will return the\n  expanded value of the `foo` attribute.\n- Removed ODF-Converter from Ringo core. It is now part of the\n  ringo_printtemplate extensions as this is the only place where it is\n  actually used.\n- #5 Show info dialog on circualr dependency error on deletion\n- #11 Check uniqueness of name when on creating and update of roles.\n- #12 With fix for #5 the admin user can not delete himself anymore, because\n  of handling of circular dependency.\n- #14 Make name field of modules readonly. Field is internal and not meant to\n  be editable.\n- #19 Fixed removing permissions (in general fixed removing items from\n  nm-relations.) \n- Added \"button\" layout for the Statefieldrenderer.\n- Handle \"Save and proceed\" button (New feature in formbar).\n- Added StaticListRenderer. Can be used to render simple static overviews of\n  items.\n- On user registration the password strength is now checked. Password must be\n  at least 12 chars long und need to have 2 non chars.\n- Add option to define rolespecific descriptions of the state.\n- Add option to configure a callback after a user has authenticated with the\n  application. This callback can be used to cancel the authentification or to\n  further actions after the user logs in.\n- Added sorting icons for datatables.\n-\n\n1.13.3\n======\nBugfix release. Fixes serious problem handling addrelations based on the\nsession variable. This error may cause wrong relations between items.\n\n1.13\n====\n- Fixes in scaffold. Improve default MANIFEST and include more files. Make\n  README a RST-File\n- Internal UUID field is now 36 chars long. UUID is now stored as defined in\n  RFC4122. Please note that existing UUIDs are not converted. You can convert\n  exitsing UUIDs by using the \"ringo-admin db resetuuid\" command.\n- Fixed #19 (https://github.com/ringo-framework/ringo/issues/19)\n- Let users delete their own account. You can define the behavior to items\n  defined by the user by setting the _owner_cascades class variable with in\n  the models to e.g configure to delete all items which are owned by the item\n  to. On default users can only delete their account if the do now own any\n  items anymore. \n- Implemented \"roles\" config variable for columns in table configs. If\n  defined columns are only visible to users who have one of the\n  configured roles.\n- Added \"target\" attribute to the Linkfieldrenderer.\n\n1.12\n====\n- Be more tolerant in imports. Only log in case the import includes fields\n  which are not part of the model.\n- Added config varibables to define default roles and groups on user\n  registration.\n- Added config variable \"layout.show_contextmenu\" to configure the visibility\n  of the context menu.\n- Improve result page after a user register a new user account.\n- Improve result page after a user request a passwort reset.\n\n1.11.2\n======\n- Small performance improvement. Added option to enable caching of the\n  form configuration. This will prevent the application to reload the\n  configuration on every request which is expensive. This is usefull for\n  production envirionments as the form will not change here. However it is not\n  recomended in development mode.\n  Please refer to the documentation to see how to enable form caching.\n- Fixed reraising exception withing general_exception view. Further only use\n  this view in testing mode.\n- Render title tooltips in table header of overviews\n- Make registration and activation of users over the webinterface work again. This means\n  new user can register themself using the webinterface if registration is\n  enabled.\n- Added scaffolds to the MANIFEST.in file. Has been missing.\n- Fixed bug which causes exceptions in testcases because new created and\n  loaded items in different Sqlachemy sessions. Use current db session from\n  request when invoking the load method of a factory to enforce all items are\n  attached to the same session.\n- Added external requirements.txt file for scaffolds.\n- Support DATABASE_URL envirionment variable. If set than this variable will\n  be used to connect to the database. Eg: postgres://@/ringo\n\n1.11.1\n======\nBugfixrelease\n\n- Reraise origin exception (including stacktrace) in case of errors in global\n  error view to allow better debugging of errors. The origin stackstrace was\n  hidden since the last version which introduces a global error view. This\n  error view hides the origin traceback.\n\n1.11.0\n======\n- Tests are now based on pytest. Removed tests based on the package \"behave\".\n  Ringo now requires a package pytest-ringo which provides some helper classes\n  to make testing more easy. Further the tests now support rollbacks.\n- Changed behaviour how Ringo extensions are registered on application\n  startup. Ringo now only shows a short warning on application start if a new\n  added or removed extension is detected. It does not ask the user if ringo\n  should register the extension automatically anymore which make the startup\n  more robust on servers with no active terminal (e.g starting as WSGI).\n  Adding or removing extensions in normale usage should be added or removed by\n  migration scripts.\n- Added \"ringo-admin app add-extension|remove-extension\" command to add\n  or remove the initial modul and action entries during development.\n- Improved documentation on how to add extensions in the application.\n\n\n1.10.5\n======\n- Show info dialog at the top to the form in case the validation fails.\n  This info has been added because users reported data loss because of\n  formbar/ringo default behaviour of not saving anything in case of\n  errors. Users seems to expect that the valid part of the data has been\n  saved. This info should make the user aware of the fact that nothing\n  has been saved in case of errors\n\n1.10.4\n======\nBugfixrelease\n\n- Only log validation errors in DEBUG loglevel.\n- Fixed changed field names in user registration.\n- Fixed test cases\n\n1.10.3\n======\nBugfixrelease\n\n- Fixed bug (Introduced with 1.10.2) when encoding values in GET params. Ringo\n  uses a special notation for encoding values in the URL as GET param in the\n  `values` key. This method failed for values containing non ASCII values.\n\n1.10.2\n======\nMaintenance and Bugfixrelease\n\n- Cleanup after move to Github:\n\t- Removed .coveragerc. Not using coverage at the moment.\n\t- Removed .hgflow. Not using the hg anymore\n\t- Removed .hgignore. Not using the hg anymore\n\t- Removed .tx. Currently not using Transifex for translations.\n- Changed links in Documentation and README to refer to Github now.\n- Do not log that we are calling get_current_request. This is a long standing\n  design flaw in Ringo but it does not cause any known problems yet and it is\n  unlikly to change in the near future. So i replaced the logging with a\n  \"fixme\" comment.\n- Log \"errors\" while resolving dot separated values in lists only in the debug\n  log (was error) in _resolve_attribute. As this might be a sign of an\n  missconfiguration it is actually handled in the function so we do not log an\n  error message but give a hint in in the logging in development. \n- Log failing CSRF token checks as warning.\n- Using encode_values to encode the value for the values attribut in GET\n  params now returns a urlencoded value. This results in the values will be\n  double encoded. Added decode_values helper method which can decode\n  urlencoded values back into a python dictionary. WARNING: If you are using\n  the values GET param in your application, than you may want to adapt your\n  code. \n- Added/Improved authentification check in setstanding and changepassword\n  method by adding missing checks and more comments.\n- Make fields for the profile while user creation a logical field which is not\n  stored in the datamodel. This prevents warning messages.\n- Make field 'retype_password' a logical field which is not stored in the\n  datamodel. This prevents warning messages\n\n1.10.1\n======\nBugfixrelease\n\n- Updated translations.\n- Fixed bug that set the display variable wrong (uses str_repr instead) when\n  registering a extension.\n- Added compatibility mode regading Ringos behaviour on adding \"s\" to the\n  modul names when registering modules. The name of the modul of the extension\n  is defined in the extension itself and should be taken as it is on default.\n  However. Ringo tries also load the modul by adding an \"s\" to be compatible\n  with older versions.\n- Changed warning message on application startup when Ringo notices that there\n  is a extenstion which needs to be registered. Fixed showing name of the\n  extension.\n- Fix scaffold for extensions. Handle case that the user cancel the automatic\n  registering of the modul.\n- Refactored the importer code in ringo/scripts/db.py and make the code better\n  reusable for other commands.\n\n \n1.10.0\n======\n* The behavior of overviews using the Datatable JS library can now be\n  configured with the JSON table configurations too. Formerly only the columns\n  can be configured.  Now other aspects like, filtering, sorting, paginating\n  etc. You can also define your own custom filters.\n\n  The configuration will be generated on the fly based on the JSON config when\n  rendering the overview. This generated configuration will replace the static\n  predefined datatable configurations found in the init.js.\n\n* Added datatable-moment.js  plugin to allow sorting datatable tables based on\n  datefields.\n\n1.9.1\n=====\nBugfixrelease\n\n- Fix internal list renderer and handle case if current user has no\n  permissions at all. Then no links will be rendered.\n- Fix has_role method. Handle case if current user is None.\n\n1.9\n===\n- Log login attemps. Each successfull or failed login will now be saved in a\n  table called \"user_logins\".\n- Show info on last successful and last failed login on the index page of the\n  application. Additionally show a warning if there have been more than 5\n  failed logins since the last successful login.\n  This feature need to be enabled in the ini file. See documentation for more\n  details.\n\n1.8\n===\n- Implemented session timer widget. The widget shows the remaining time in the\n  session before the autologout will be triggered.\n  The widget needs to be enabled in the .ini file. See documentation for more\n  details.\n- Dogpile caching for SQL need to be enabled explicit now.\n- Enhanced breadcrum feature. Allow to define additional actions which should\n  be displayed in the breadcrumbs beside the default actions.\n- Changed Mailer. The Subject of the Mails do not include a prepended name of the\n  application anymore.\n\n1.7\n===\n- Ringo no longer does automatic extension registering on server\n  startup. Registering a new extension often will write changes to the\n  database. This is dangerous as this will potentially lead into\n  failing later migrations. So Ringo will now ask the user what to do on\n  server start. Default is to abort the registration.\n- Added JQuery UI library. This library is currently not used by ringo itself\n  but it provides basic functionality to other applications.\n- Added breadcrumbs feature to Ringo. To be able to use the breadcrumbs you\n  need to define a sitetree (See lib/sitetree.py for more details.) The\n  default sitetree of ringo is empty which means no breadcrumbs are shown.\n- Added \"--format\" flag for the \"ringo-admin db loaddata\" command to define\n  the format of the inputfile. It is now possible to use the CSV importer\n  also.\n\n1.6\n===\n- Add functionallity for users so set their standin. Basically this is adding\n  and removing other users to the default group of the user. To use this\n  feature the user needs at least read access to the users he wants to set as\n  standin.\n- Changes favicon format to \"ico\" to be more compatible with versions of IE.\n  Improved overwriting of the favicon. The code for favicons are now placed in\n  favicons.mako which can be overwritten by other applications.\n- Fixed handling of bundled delete requests. Two things has been changed: \n    1. Call the callback before actually deleting it to allow some cleanup. \n    2. Put the flush of the db operations at the end of the method to\n       avoid \"Closed connection\" errors which happens for bundled delete\n       request after the session has been flushed for the first item.\n\n\n1.5\n===\n- Added new configuration variable 'app.mode' to be able to run the\n  application in a different mode. If set the application will give some\n  visual indication the the application is in a different mode.\n- Changed default rendering of overview pages. Instead of using a\n  complex overview with advanced search filters e.g Ringo now uses a\n  simplified overview on default. The behaviour can be changed by either\n  setting a global `layout.advanced_oveview` configuration varible in\n  the ini file or per table configuration in the json config of the\n  table. In the simplified overview features like pagination are currently disabled\n  regardless what is configured in the table configuration. This may change in\n  future versions.\n- Changed click behaviour in overview tables. Rows are now clickable. With the\n  change to the simplified overview code the way to select items from the\n  overview changed also. Links has been removed completely now. Instead the\n  whole row is clickable.\n\n1.4\n===\n- Dropped SQLite support because of missing support of data migrations using\n  alembic. Postgresql is the new default for the DMBS system.\n  Added psycopg2 as requirement. Actually Sqlite support was broken since\n  version 1.2.\n- Removed fixtures for initial data. Data is now added to the migration\n  scripts.\n- Added new \"--format\" flag for the \"db savadata\" command to determine the\n  export format. Default is JSON.\n\n1.3\n===\n- Added new configuration varibale (auth.timeout_warning) to configure how\n  many secods before the autologout happens a warning will be shown.\n\n1.2.2\n=====\n- BaseFactory now take an optional argument for a request.\n- The callback parameter in the views can now take a list of callbacks too.\n  The handle_callback method is able to handle this correct. Please note that\n  this mechanism needs some effort of the developer to build this list in the\n  view function.\n- Add additional callback parameter to the create view of users. This allows\n  other views to overwrite the user create view and add custom callbacks.\n\n1.2.1\n=====\n- Fixed circular dependency error on migration using alembic after adding\n  uid and gid fields for users and usergroups which where self referencing.\n\n1.2.0\n=====\nBeside the major changes which are listed below this version include many\nsmall bugfixes and improvements in the code, usability and performance.\n\nNew:\n- Add option to provide external validators to the update and create view.\n  They will be used for additional validation of the form.\n- Implemented a simple Warning Dialog if the user leaves of form without\n  saving the changed data first.\n- Added simple spinner which pops up if the loading of the page takes longer\n  than 400ms.\n- Added new \"ringo-admin app init\" command to initalise a folder containing\n  a initial config file.\n- Password must be at least 12 chars long and include 2 non-letters.\n- Added support for loading configurations in case of multi-derived\n  applications. Added new app.base configuration variable.\n- Added new helper command to copie the static files of formbar into to\n  correct location in ringo.\n- Added option to name the authentification cookie. Needed if there are more\n  than one ringo application on a server.\n- Added a warning dialog which shows if the user leaves a form without saving\n  it before.\n- Do permission checks on submitted values for relations on POST requests.\n  Users are not allowed to set items in relations for which they do not have\n  read permissions.\n- Log changes of uid and gid.\n\nChanged:\n- Enabled Mako default HTML escaping for Template rendering globally in ini\n  file and explicit for form rendering, dialog rendering and listing\n  rendering. Excluded html escaping for messages and the admin scripts as the\n  rendered result is not aimed to be displayed in a browser.\n- Seperated requirements for testing, installation etc.\n- Static files from formbar are only copied on application start if there are\n  not already the formbar files located in ringo. (Need some work). See\n  \"formbar_static\" command.\n- Fixed typos in german translation.\n- Changed behavior of the warning for a nearing auto logout. Instead of\n  showing after 95% of the logout time is up it will now be shown 3 Minutes\n  before the actual logout happens.\n- The modules for Roles, Users and Usergroups are now inherited from the\n  \"Owned\" mixin class.\n- Changed setting the GID for new items. Changed order of determining\n  the GID (inverse order). First try to get the default_gid from the\n  modul. If not present use the default_gid from the user. Of no\n  default_gid is set at all leave the GID of the new item blank.\n\nRemoved:\n- Removed group role feature. This feature was only rarly used.\n- app.url configuration variable which was intended to use in scenarios where\n  the application is not hosted under the root of the server. See\n  documentation for deployment for more information on how to setup the\n  application now.\n- Static files of formbar are no longer copied into the static files of ringo\n  on application start. These files are now dynamically loaded from formbar.\n- Invoke command \"formbar_static\"\n\n1.1.0\n=====\nNew:\n- Added \"openmodal\" option to LinkfieldRenderer\n- Added \"action\" option to LinkfieldRenderer to be able to render other\n  actions then read and update links.\n- Added _get_permission classmethod in the Baseitem class. This class can be\n  overwritten to implement a custom way to build the ACL for this class and\n  instances.\n- Added info page after login if the account has been disabled.\n- Added --path option to load and save fixtures to be able to load alternative\n  fixtures.\n- Implement setting dot-separated values in items.\n- Implemented fuzzy search. The search now supports the \"~\" operator to\n  trigger a fuzzy search which uses the doublemetaphon as primary algorithm\n  and falls back to the levenshtein algorithm as secondary it the primary\n  fails.\n\nChanged:\n- Only show \"Homepage\" on index page if the user is actually logged in.\n- Fixed DTListRenderer which was only rarly used and seems to be broken for\n  some time. The fix onyl gets it working again. There is still work to do to\n  make it work as the default ListRenderer (Display of Link e.g).\n- Allow custom title and body in confirmation dialog.\n- Use form parameter when getting the create form. Usefull when you want to\n  use an alternative form to create an item.\n- Hide attribute of ActionItems also affects overview lists.\n- \"ringo-admin modul add\" command does not generate SQL code anymore. Instead\n  of this it will print out code for the fixtures.\n- Make the application base url configurable using the app.url config\n  parameter.\n- Added title tooltips in context menu\n- Only save paths in the history and not full qualified URLs.\n\n\n1.0.0\n=====\nWARNING! This update is a major upgrade of Ringo which may break your application!\nIt removes many of the core modules in the application! This will break your\napplication if you use one of the removed modules. In this case stay with the\n0.18.0 version.\n\nThe following modules has been removed:\n\n- Removed Log module\n- Removed Tags module\n- Removed Printtemplate module\n- Removed Appointment module\n- Removed Comments module\n- Removed File module\n- Removed News module\n- Removed Todo module\n\nThe modules will be converted into extensions.\n\nWith version 0.16.2 Ringo supports loading extensions to enhance the\nfunctionality of the application. This should be the default way to add\noptional features to a Ringo based application. Since the removed modules all\nimplement general features which are optional to your application and aren't a\nbasic requirement, they has been removed from the core now. This reduces the\ncode base and make the core faster and more secure. The later is an important\nprecondition for post 1.0 goal: Getting much more secure to get ready to build\nrock solid web application in Ringo.\n\nNew:\n- Added Label field to the roles module.\n- Added new \"fixture\" command in ringo-admin to load and save fixtures.\n- Added new \"revision\" db command in ringo admin to generate a new\n  (autogenerated) alembic migration script.\n- Added fixtures for initial data.\n- Support german locale in datefields. (Requires new formbar)\n- Added showall option for Listfieldrenderer to show all elements regardless\n  if the user is allowed to read the item. If the user is not allowed to read\n  the item no link to open the item will be rendererd.\n- When creating a new user a usergroup for the new user will be generatated\n  automatically. The new usergroup will be set as default usergroup for the\n  new user if no other group is set while creation.\n\nChanged:\n- The documentation is now opened in a new browser window instead of opening\n  it in a modal popup window.\n- Modal dialogs can not be closed by clicking in the background.\n- Reimplemented openmodal function in listingfields. Has been removed by\n  accident.\n- Changed behaviour of the onlylinked attribute in listingfields. Also removes\n  the checkboxes now as there is no reason to link/unlink items if only the\n  linked items should be displayed.\n- Improved user language detection in Javascript. Language setting is now\n  determined by calling a remote function in the Rest API.\n- The create method of factories now require a values attribute! It is not\n  optional but can be empty to get the old behaviour.\n- Show\n\nRemoved:\n- Pre 1.0 Migration scripts removed. The older migrations scripts are now\n  replaced by one single script. The alembic version of this version is still\n  the same so that future migration scripts can be applied to old applications\n  as well.\n\n0.18.0\n======\n- Added option to open items in a modal window.\n- Show spinner when opening items in a modal window.\n- Set requirment of formbar to >= 0.9.4.\n- Added 'url_prefix' and 'url_scheme' the server configuration in the template\n  of the ini file in base scaffold. This is usefull if the server is running\n  behind a reverse proxy.\n- Added options to configure the startup of the ODFConverter. On default the\n  converter is not started! This is a change to the previous behaviour!\n- Loading data in ringo-admin command can optinally be done by using the ID of\n  the item instead of the default UUID. This is usefull for initially loading\n  data after creating a database in case not all entries in the database have\n  a UUID.\n- Add support for import and and export of NM-relations. (Experimental). To\n  enable this feature simply add the --include-relations to the savedata\n  command.\n- Improved translations. Added missing calls to translate function at various\n  places.\n- Added experimental support for exanding values for dotted attributes (e.g\n  relation.value).\n- #77 Support alembic >= 0.7.1\n  This will detect missing foreign keys in your datatable.\n  Important:\n  * Please update to a recent version of alembic (currently 0.7.4)\n  * In case you are using SQLite: Merge\n    ringo/alembic/versions/46edfd16f379_.py migration script to your migration\n    scripts and apply it. See\n    http://alembic.readthedocs.org/en/latest/branches.html for more details on\n    merging. This will fix errors in the base ringo model.\n  * Please generate a new migration and apply it. If your missing any foreign\n    keys they will be generated now. If you are using SQLite please refer to\n    ringo/alembic/versions/46edfd16f379_.py and see how migration is done for\n    the base tables.\n- #87 Remove alembic_sqlite dependeny.\n  As alembic now supports some missing operations like add and drop column on\n  SQLite the helper library alembic_sqlite is not needed anymore.\n  Important:\n  * Please search for the string \"drop_column_default\" and remove this and the\n    following codeblock from your existing migration files.\n\n\n0.17.1\n======\n- Added configuration for transifex\n- Fixed error when opening News items.\n- Init the form with the correct eval_url. Provide url_prefix when\n  initialising the form.\n- Show hint on errors in formdefinition in formeditor.\n- #37: Further fixes.\n- #86: Fixed extension specific view mapping.\n\n0.17.0\n======\n- Improved overview and searching.\n\t- Added clientsided pageination function.\n\t- Added option to add a operators (<, <=, =>, >, ==, !=) to the\n\t  search. If the user has provided a opertors the search will use this\n\t  operator to do the search instead of a search based on a regular\n\t  expression. This is usefull for searches on dates.\n- Improved exporting.\n\t- Added RecursiveRelation Exporter.\n\t- Added ODF Converter.\n- Insert scaffold of a formdefinition when creating a new form.\n- Added support for translations in extensions.\n- Status messages are now rendered at the top of the page.\n- Added option to set a custom header with logo above the navbar more easily.\n- #37: Change ownership only for admins\n- #48: Add support to drop columns in SQLite.\n- #50: Change behavior of \"click-seaerch-filter\" in overviews\n- #64: Better indication of current edit mode\n- #67: No ISE on reading data from the import file. Show error dialog now.\n- #68: Installation/Setup fails because of missing files\n- #82: Migration of the database for the first module sometimes does not work\n- #85: News can't be marked as read\n\n0.16.3\n======\n- Important: Changed the way how the DBSession is setup. See ringo/__init__.py\n  file how it is setup now and adapt you application.\n- Added commands to generate SQL to restrict and unrestrict access to table of\n  a modul on database level (only postgres)\n- Fixes of loading Form and Overview configuration.\n- Add escaping into the renderer\n\n0.16.2\n======\n- Add function to load ringo extenstions.\n- Changed logging in application (Removed and modified)\n\n0.16.1\n======\n- Allow configuration of caching of pages and static content.\n- Add various option to enhance cookie and session security.\n- Set headers to enhance security according to\n  http://ghaandeeonit.tumblr.com/post/65698553805/securing-your-pyramid-application\n\n0.16.0\n======\nRefactoring of views:\n* Seperation of views: Basic views (LCRUDIE) are now located under\n  views.base.list ... views.base.export. Removed views/base.py.\n* Moved REST logic into the corresponding new view modules.\n* Moved methods and code from views.json into the new views.api and\n  views.response modules\n* views.api: Modul with method used by the client.\n* views.respose: Modul with special Response objects.\n* views.request: Modul with methods (handlers) with common logic for various views.\n* views.helpers : Modul with helpers methods (getters) to get things like to forms or\n  information from the request.\n\nRefactoring of model:\n* Removal of the request dependecy in the base model.\n  Refactoring of the setup of the modules.\n* Removal of several class methods like get_action_routename and get_item\n  actions into lib.helpers and others.\n\nRefactoring of lib:\n* Splitted large lib/helpers.py into various files under lib/helpers.\n* Splitted large lib/renderer.py into various files under lib/renderer.\n\nHOWTO Upgrade:\n\n* The following methods has been moved:\n  - get_table_config -> lib/table.py\n  - get_form_config -> lib/form.py\n  - get_action_routename -> lib/helpers.py\n  - get_item_list -> model/base.py\n  - get_item_modul -> lib/helpers.py\n\n  Search for these methods in all *.py and *.mako files and adapt the call.\n\n0.15.2\n======\n* Use app title instead of app name as prefix in subject of notification mails.\n* Fix urls in import, export dialogs. Use get_current_route_patch instead of\n  URL (causes errors with SSL behind an reverse proxy)\n* Fix import. Handle NULL values correct for integers.\n* Fix handling NULL values in sorting.\n* Use new formbar version 0.9.0. Fix some rules.\n\n0.15.1\n=======\nRefactoring. Cleanup Model and try to get rid of pyramid specific elements\nlike the request.\n\n* Removed __json__ method. JSON export is now completely handled in the\n  Exporter (JSONResponse)\n\nNew:\n* All Mails will have the application name in the subject.\n* Add \"nolink\" Attribute to the DropdownRenderer.\n* Added new TagFieldRenderer. Will only show tags which are associated to no\n  or the items module.\n\nBugfixes:\n\n* Translate options in dropdown lists.\n* Translate headers in newslist.\n* Fixed automatic translation in connection with mappings.\n* Handle case if an attribute returns a BaseList as selected items in\n  ListRenderer.\n\nChanges:\n* Text in News is now a Textarea.\n\n0.15.0\n=======\nIMPORTANT: Application will need some work on application initialisation to\nstay compatible with this release:\n\n1. rename add_route to setup_modul\n2. Move setup of modules into a \"includeme\" method.\n3. Use config.include(\"appname\") to call the includeme method.\n4. setup_finished callback is removed.\n\n- Changed the way how the routing is setup on application initialisation. Now\n  iterate over all available modules from database and configure the routes\n  for each modul instead hardcoding the configuration including importing the\n  modules etc.\n- Added new ringo-admin command.\n- Removed old add-ringo-modul command.\n- Automatic logout after a configurable time. Defaults to 1800sec. Some time\n  before the loggout a warning dialog will be raised.\n- Removed deprecated \"ignore\" filter for selections. Use must use filter now.\n- Filter option and items Dropdowns and Listings (Listfield, Comments) on user permissions.\n- Changed permission system. Add user roles to the user if the user is member\n  of the items group. Added group roles additionally.\n- Usergroups and Roles now have a description.\n- Statemodel of forms only have two states now: Draft, Published\n- Added support for Regular expressions in search (again). Now you can\n  configure if the searchterm is a regular expression or not.\n- Show userlisting in roles.\n- #47: Added last_login column\n- Changed caching. Replaced class based caching partially with request based\n  caching if possible. Use new Cache object (lib/cache.py) for caching in\n  general.\n\n0.14.1\n=======\n- Fixes in the overview\n\t* Sorting on BaseItems is done based on their string representation.\n\t* Filter expressions are now escaped. This allows special chars in the\n\t  search. Therefor regular expressions are currently not supported\n\t  anymore. See #52.\n\t* Search is now case insesnsitive.\n- Fix expandation of value in readonly dropdowns.\n- New formencode version 0.8.1\n- New registed users will have the user role in addition to the user group now.\n- Implement formbar translation.\n\n0.14.0\n------\n- Update to JQuery to 2.1.1\n- Update to Bootstrap 3.1.1\n- Changed permission system.\n- Add boolean flag to choose if the group roles should be included in the user.get_roles()\n- Changed building the principals of the user. Group roles will only be added\n  to the user if he is actually member of the items group on permission check\n- Add option to configure a default group on modul level which will be used on\n  creation time as group if no special user default group is defined.\n- Added information about the users profile to the user form.\n- Allow refering to python properties in ListingFieldRenderer.\n- Only render link in Dropdownfields if the user is actually allowed to view\n  or update the linked item.\n- Support alternative forms in the update view.\n- Fix configuration of default sorting order in tableconfig (Was ignored).\n  Changed default to asc.\n- Add sorting to the ListfieldRenderer based on the tableconfig.\n- Show number of items in the header of item overview pages.\n- BaseLists are now iterable.\n- Add label of the forms modul in the forms overview.\n\n0.13.1\n------\n- Added option \"not specified\" to gender field in profile.\n- Improved rendering of dropdownfield. Fixed emtpy field if there is no linked\n  item.\n- Worked on importer. Handle uuid values correct on import.\n- Fix deleting profiles if a user is gets deleted.\n\n0.13.0\n------\n- Improved Formbar form editing. Use new ACE (http://ace.c9.io/) JS based\n  editor to edit the form definition. Requires new formbar lib (>= 0.7)\n- Add preview tabs to the form editor, which allow to see a basic preview\n  of the form. The preview does not support any dynamic now application\n  specific renderers.\n- Write the formbar specific CSS and JS on application start into the ringo\n  static folder.\n- Do not include the JS and CSS code of formbar into the document. Instead use\n  to dynamically written CSS and JS files to reduce the size of the generated\n  document.\n- Improved password encryption. Replaced use of pythons built in hashlib.md5\n  algorithm with the use of the passlib library\n  (https://pythonhosted.org/passlib/index.html) for more secure password.\n\n0.12.1\n------\n- Improved export of Blobform items. Instead of exporting the \"data\" attribute\n  all field in the data field will be flattend and added to the toplevel of\n  the export.\n- Added Import and Export to the profiles module\n\n0.12.0\n------\n- #12: Implemented basic version of bundled actions. Currently \"Delete\" and\n  \"Export\" is supported.\n- Modified export. Export now supports exporting more than one item (Bundled\n  actions)\n\n0.11.5\n------\n- Added more testcases\n- Added new configuration variable \"security.enable_csrf_check\" in\n  configuration files.\n- Use default excel dialog on CSV export.\n\n0.11.4\n------\n- #41: Cleanup of code. Remove init_model function calls, Removed initializedb\n  script which was used to initialize the database for the application. Now\n  alembic is used for this.\n- Removed default ItemFactories, Removed default __unicode__ functions.\n- Added more testcases\n\n0.11.3\n------\n- Changed order of calls to add relations, handle events and saving the values\n  in the item. Prevents errors when inheriting informations from linked items.\n- Fixed setting max_age in auth_tkt cookie. Fixes error in IE10 for if running\n  in pyramid > 1.4.5.\n- Changed import. Import now allows importing multiple items. After the import\n  has finished a result page is shown.\n- Implemented import and export as CSV.\n\n0.11.2\n------\n- Splitted requirements. Required packages for testing are now installed\n  locally.\n- Added unittests to test /lib/helpers\n- Added unittests to test /views/index\n- Enhanced Profile modul. Added gender field. Make some fields desired and required.\n- Added \"multiple\" attribute to Listfield Renderer. Allows the restrict the\n  selection of items to one item at once. Only implemented on client side.\n- Add support for list elements while accessing a \".\" separated\n  attributes in the __getattribute__ method of the BaseItem.\n- Add relation from tags to modules to allow modul specifc keywords.\n- Add tags to forms.\n- Add comments to forms.\n- Ported \"filter\" attribute of selectionfield renderer to the listfield renderer.\n\n0.11.1\n------\n- #36: Another try to fix caching problems. This is another approach to\n  5c152bd which tried to disable the caching at gets lost. (maybe a merge\n  error)\n\n0.11.0\n------\n- Add service under \"rest/rule/evaluate\" to evaluate rules. Service is used\n  for client side evaluation of rules in the formulars.\n- Provide the user roles as \"_roles\" value in the form. This value can be used\n  to model role based rules in the form. Form needs a hidden field which takes\n  the provided \"_roles\".\n- Removed category from form form and table configuration. It is currently\n  unused.\n- Changed rendering of ringo specif dropdown.\n- Add option to configure group and owner inhertinace on creating new\n  instances in the Owned-Mixin.\n- Deletion of Items now cascades to Logs, Comments, Versions and nested\n  Elements.\n- #18: Added some ringo artwork.\n- #8: Make documentation available in the application\n\n0.10.0\n------\n- Add new requirement of py3o.template library.\n- Add Printtemplate modul. Printtemplates are ODT or ODS documents which are\n  used as templates for generating nice looking documents. On processing the\n  template placeholders in the template will be replaced by values of the\n  item. The template can include basic python expressions. E.g to iterate over\n  lists.\n- Add Printable Mixin. Inheriting from this mixin will add a print action to\n  the item.\n- Fixes on permission checks. Add button to add new items in listing only if\n  the user actually has permission to add new items.\n- Add \"showsearch\", \"hideadd\", \"nolinks\" attributes to listfield renderer to\n  enhance configuration of rendering.\n- Render permissions of a role as FieldList.\n- Add TodolistRenderer. Render todos in the home view.\n\n0.9.2\n-----\n- Add Versioned mixin. This mixin can be used to store different versions of\n  an item. On each update of the item the serialized values of the item will\n  be saved in the version table. The versions are later used to show\n  differences between the current and a given prior version in the form.\n- Add get_values function to the BaseItem to return a dictionary containing\n  all values of the item. Optionally the items can be serialized (this\n  is a very simple serialisation).\n- Reorganised automatic logging and changing states. The former version was\n  implemented as update handler in the mixin classes and was based\n  on the SQLAlchemy \"history\" functionallity. Unfortunately this history\n  wasn't as much reliable as expected in some corner cases. The update handler\n  was removed and changing the states and logging are now implemented directly\n  in the save method of the item.\n\n0.9.1\n-----\n- Replaced route_url with route_path.\n- Fixed rendering of links in the dropdown renderer. Consider user permission\n  on link generation (read/update).\n- Added options to the Table renderer to configure the responsive behaviour of\n  table columns. You can now define which columns should be visible on which\n  screenwidth. Defaults to show only the first column.\n- Workded on Formeditor. Implemented selecting a form when creating new\n  (blobform) items.\n- Introduced warnings (formbar 393:bbd7a5192e29). Validate the item on loading\n  to generate warning.\n- Handlers in the statemachine now get the transition as additional parameter.\n  This is usefull das the transformation gives access to the state,\n  statemachine and optionally the request.\n- Use sorting configuration from table config in DTLists.\n- Added paginated DTList.\n- Check if the user is still allowed to edit the item after he edited it\n  (Statechange). If not call alternative read URL.\n- Improved performance. Do some caching here and there.\n\n0.9.0\n-----\n- Added comment modul\n- Added tags modul\n- Added todo modul\n- Added forms module\n\t- Write save method for items like the save method of formbar.\n\t  Overwrite the method in Blobforms.\n\t- Overwrite get_attr, get_value method in blobform to handle getting\n\t  values from the datafield.\n\t- Think about how to handle multiple forms for one item. Currently\n\t  this is hardcoded on itemlevel which form should be used.\n- Added UUID field for each BaseItem\n- Implement simple Import and Export. Only single items. No relations.\n\t- Added JSON Importer and Exporter\n\t- Added import and export functions in the view for ringo modules\n\t  except for the modul modul\n- Small layout fixes (flash messages)\n- Modules can now be placed in the \"user menu\" in the top right. Improved\n  layout of this menu with textual headers.\n- Some code cleanup\n- Start using \"invoke\" command for different tasks like testing or building\n  the documentation.\n\n0.8.1\n-----\n- Bugfixes for API Change: BaseLists are not initialized with request instead of request.db\n- Improved documentation\n- Some fixes in the basic scaffold. Improved alembic integration.\n\n0.8.0\n-----\n- Added log modul\n- Added statemachines\n- Added simple mechanism to call handlers for certain events in the model.\n  This is currently used to:\n\t- Update the updated attribute on every change of a item which has the\n\t  meta mixin.\n\t- Create a simple log entry on updating or creating a item.\n- Worked on caching the result of SQL queries to improbe the performance.\n- API Change: BaseLists are not initialized with request instead of request.db\n- Added alembic folders to basic scaffold\n- Worked on documentation\n\n0.7.0\n-----\n- Added news modul\n- Use \"width\" from tableconfig also in DTListings.\n- Rows in DTLists are now clickable to if the user is allowed to update the\n  item then the update action will be called on click. Else call the read action.\n- Fix URLs for the ReST-Api to match basically the typical URL Schema for CRUD\n  actions:\n\n    * GET /items - Retrieves a list of items\n    * GET /items/12 - Retrieves a specific item\n    * POST /items - Creates a new item\n    * PUT /items/12 - Updates item #12\n    * PATCH /items/12 - Partially updates item #12\n    * DELETE /items/12 - Deletes #12\n\n  Note, that not all actions are actually implemented yet, but for now the url\n  schema has beed adapted.\n\n0.6.4\n-----\n- Improved Layout\n  - Use Bootstrap 3\n  - Use new formbar lib (bootstrap 3 compatible)\n  - Optimized space. Removed tabs. Added advanved menu to the context menu for\n    accessing other content which was formerly placed in tabs.\n- Only show links for registering users or password reminders if the mail\n  system is configured and registering and reminders are enabled in the auth\n  system. See ini file. Defaults to not enabled.\n- Implemented a message library. Currently it is used to generate based on\n  mako templating and send mails.\n- Added option for users to change their password.\n\n0.6.3\n-----\n- Improved authorisation system. Make building ACL more simple and robust.\n- Implemented configurable str representation of items in the modul setting.\n- Show the item representation string on every update and read page.\n- Added new date related helper functions.\n- Delete usersettings too if the user gets deleted.\n- Added caching on modules, table and form configs to improve the performance.\n- Introduced new \"form\" GET parameter to optionally change the default\n  rendered.\n- Listings\n    - Fixed value expandation in the listings.\n    - Added option to List to do the sorted on the expanded or raw value.\n- ListingFieldRenderer\n      When using listing in context with Nested Objects to build\n      hirachies then take care to only show valid items in the list to\n      prevent building broken hirachies.\n    - Handle \"onlylinked\" config var in FieldListRenderer.\n    - Handle \"ignore\" config var in FieldListRenderer.\n\n0.6.2\n-----\n- Fixed user form configuration which leads to an error in password generation\n  while creating a new user.\n- Changed authorisation. Now access to items are also granted if the user is\n  member of the items group.\n- Changed authorisation in Itemlists. Only items are included in the overview\n  if the user has access to read the item.\n- Updated translations (missing translations for file and appointment modul)\n- Changed imports of models. Now use specific import_modul function to import\n  models in the application to be able to import overwritten clazzes in other\n  applications.\n- Added CSRF protection on POST request. On every POST request now a special\n  csrf token is checked. If check fails a Authorisation error is thrown.\n- Added tab to change the ownership informatio in update and read forms if\n  ownership information is available.\n- Removed \"transform\" funtion from lists.\n- Added new alembic scripts to initialise the database.\n\n0.6.1\n-----\n- Bugfixe on File modul initialisation (missing name)\n- Added \"values\" GET param for views. Can be used to prefill forms with given\n  values.\n- Improved rendering of the ListField Renderer. (Added label, Use new \"values\"\n  parameter)\n\n0.6.0\n-----\n- Added File module\n\n0.5.1\n-----\n- Added support for alembic for database migrations.\n\n0.5.0\n-----\n- Added Appointment module\n- Added Renderer for a query DataTable Renderer.\n- Added Renderer for ListFields. ListFields are Basically listings of related\n  items in tabular from providing a checkbox to select and deselect items.\n  Selected items will get linked.\n- Added \"backurl\" GET parameter. This parameter can be used to define a URL\n  which should be called instead of the default redirect action after create,\n  update or delete succeeds. The parameter is saved in a session.\n- Added more behave tests (now 42% code coverage).\n\n0.4.1\n-----\n- Added a Ringo specific renderer for dropdown lists which add a small link\n  next to the label of the dropdownlist.\n- Added Behaviour Driven Test infrastructure based on \"behave\"\n- Small bugfixes.\n\n0.4.0\n-----\n- Added REST-full service. The service is reachable for all modules on the\n  known url with the prefix \"rest\". Eg rest/users/list. Using the interface\n  requires Authorisation and Authentification which needs to be supplied.\n- Added \"Nested\" Mixin class to allow nested items.\n- When a form has multiple pages the currently selected page is now saved in\n  the user session. Needs recent formbar version.\n- Use new get_formbar_js method in inject js code needed for formbar. Neededs\n  recent formbar lib.\n- Items with the MetaMixin will have a default created und updated date of\n  utcnow now.\n- #25: Added support for custom renderes. Renderers can now be defined and\n  provied to the view functions. The renderer must be derived from the Formbar\n  FieldRenderer) The view functions will give the renderer to the formbar lib.\n  Need a recent Formbar version (>=0.3.0)\n\n0.3.2\n-----\ni18n Support:\n- User custom extractor from formbar for translation string in XML form\n  configuration. No need to mark strings in the configurations as\n  translatable.\n- Removed lingua requirement.\n- Added support for translations in the basic scaffold.\n\n0.3.1\n-----\nSearch:\n- Added a new TableConfig class. This clazz provides an interface to a JSON\n  file which is used to configure various aspects to the rendering of the\n  overview tables. This new configuration directive will replace to old\n  _table_fields configuration attribute.\n- #26: Expand values of relations in the overview from form configuration.\n- #27: Save current sorting in the session.\n- #28: Save sorting together with the search query in the saved searches.\n\ni18n Support:\n- #23: I18n Support in renderes. Added more translations.\n- Added lingua as requirement. Needed for message extraction for i18n Support\n- Marked form configurations as translateable.\n- Added support for translating forms. Requires formbar >= 0.2.1\n- Added support to translate headers in the overview.\n\nMisc:\n- #19: Login should be in a Popup window\n\n0.3.0\n-----\n\n- #15: Implement Search\n- Enabled search by clicking on the value in colums.\n- Added table to save usersettings (DB change!)\n- Enable saving search queries in the usersettings.\n\n- Added dogpile.cache dependency because of caching in sqlalchemy.\n- Enabled basic caching of SQL queries.\n\n0.2.2\n-----\n\n- Some improvement in Layout. Make header more compact to not waste to much\n  space\n- Create an empty \"forms\" dir under views for the basic scaffold. Fixes error\n  on creating the form.xml files when adding a new modul.\n- Improved add_<<app>>_modul command. Fixed modul (re) initialisation. It the\n  modul initialisation does not happen on recreating again the database.\n- Fix get_path function. Path is now relativ to the application (was relativ\n  to Ringo)\n- #10: Add \"visible\" flag to moduls. Moduls can now be configured in which\n  menu to display the modul. (DB change!)\n- Added new field \"clazzpath\" to the modul. Needed only internal for dynmic\n  imports on permission checks. (DB change!)\n- Need formbar in version > 0.1 to be able to render selection fields.\n\n0.2.1\n-----\n\n- Improved documentation\n- Added a simple request history (needed for #7)\n- #1: Error on getting roles while authorisation when user is not logged in\n- #2: Put some usefull content on the default index page\n- #3: Set application title in the page header\n- #4: Add version info page\n- #5: Add about page\n- #6: Add contact page\n- #7: Add dialogs for errors (404, 403)\n- #9: Cleanup and structure css\n- #17: Hide checkboxes in overviews if bundled actions are not enabled\n- #20: Fix layout of flash messages\n- #21: Complete german translation\n\n0.2\n---\n\nFirst more or less version which includes all basic functionallity.\n\n- Added basic scaffold\n- Added \"add_modul\" command to add boilerplate code for new moduls.\n\n0.1\n---\n\n- Basic model initialisation\n- Basic page layout\n- Added authentification\n\n0.0\n---\n\n-  Initial version", "description_content_type": null, "docs_url": "https://pythonhosted.org/ringo/", "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://bitbucket.org/ti/ringo", "keywords": "web wsgi bfg pylons pyramid", "license": "GNU General Public License v2 or later (GPLv2+)", "maintainer": null, "maintainer_email": null, "name": "ringo", "package_url": "https://pypi.org/project/ringo/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/ringo/", "project_urls": {"Download": "UNKNOWN", "Homepage": "https://bitbucket.org/ti/ringo"}, "release_url": "https://pypi.org/project/ringo/1.14.0/", "requires_dist": null, "requires_python": null, "summary": "A simple web framework with base functionality to build web applications.", "version": "1.14.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            Ringo\n<br>=====\n<br>\n<br>.. image:: https://travis-ci.org/ringo-framework/ringo.svg?branch=master\n<br>    :target: https://travis-ci.org/ringo-framework/ringo\n<br>\n<br>Ringo is a small Python based high level web application framework build with\n<br>Pyramid. Ringo tries to make it very easy to build form based web application\n<br>to manage your data. Because Ringo provides many basic features which are\n<br>often used in modern web applications it greatly speeds up development. But it\n<br>is also flexible and offers many ways to configure the layout, behaviour and\n<br>workflow of your application. See the list of :ref:`features` for more\n<br>details.\n<br>\n<br>Ringo comes with an application scaffold which can be used as a boilerplate for\n<br>your application development. See the development part in the documentation\n<br>for more details on how to build a Ringo based application.\n<br>\n<br>License\n<br>=======\n<br>Ringo is Free Software. It is licensed under the GPL license in version 2 or\n<br>later. See `&lt;http://www.gnu.org/licenses/gpl-2.0&gt;`_ for more details on the license.\n<br>\n<br>Features\n<br>========\n<br>Ringo provides some basic features which are useful if you build your\n<br>web application based on Ringo:\n<br>\n<br> * Easy extendible and configurable modular architecture,\n<br> * Basic actions for every module including:\n<br>        - Search and sortable listing (storeable and configurable)\n<br>        - Basic CRUD actions\n<br>        - CSV, JSON import and export\n<br> * Role based authorisation.\n<br> * Authentication with email registration and password reminders\n<br> * Powerfull statemachine to model workflows in modules.\n<br> * Layout and validation of forms using the `Formbar &lt;https://pypi.python.org/pypi/formbar&gt;`_ library\n<br> * Versioning of forms (see what changed to the last version)\n<br> * Widely configurable from the web UI.\n<br> * Nice console client for various administration tasks.\n<br> * ...\n<br>\n<br>Tests\n<br>=====\n<br>To start the testsuite invoke the following command::\n<br>\n<br>        py.test --app-config test.ini\n<br>\n<br>Or with display of the coverage of the tests::\n<br>\n<br>        py.test --cov=ringo --app-config test.in\n<br>\n<br>\n<br>Documentation\n<br>=============\n<br>The source of documentation comes with the source of Ringo and can be found in the\n<br>\"docs\" folder. To generate the HTML version of the documentation please invoke the\n<br>following command::\n<br>\n<br>        invoke docs\n<br>\n<br>You need to have the sphinx package installed in order to generate the documentation.\n<br>A generated version of the documentation is available on\n<br>`&lt;http://ringo.readthedocs.org/&gt;`_\n<br>\n<br>\n<br>Getting Started\n<br>---------------\n<br>The fastest way to get an impression of Ringo`s core functionality is to\n<br>start the standalone application of Ringo with the following steps:\n<br>\n<br>- $ git clone https://github.com/ringo-framework/ringo\n<br>\n<br>- $ python setup.py develop\n<br>\n<br>- $ ringo-admin db init\n<br>\n<br>- $ invoke docs\n<br>\n<br>- $ pserve development.ini\n<br><br><br>1.14.0<br>======<br>- Rewrite of the documentation.<br>- Fixed issue21 (https://github.com/ringo-framework/ringo/issues/21). Enabled<br>  sorting config in Listingfieldrenderer.<br>- Expand values from checkboxes too.<br>- Added XLSX Export.<br>- Introduced special suffix `__e_x_p_a_n_d` for attributes which can be used to<br>  access the expanded value of the attribute as alternative to the call of<br>  get_value. This is needed because it is not always possible to call the<br>  get_value method. Example: getattr(obj, 'foo__e_x_p_a_n_d') will return the<br>  expanded value of the `foo` attribute.<br>- Removed ODF-Converter from Ringo core. It is now part of the<br>  ringo_printtemplate extensions as this is the only place where it is<br>  actually used.<br>- #5 Show info dialog on circualr dependency error on deletion<br>- #11 Check uniqueness of name when on creating and update of roles.<br>- #12 With fix for #5 the admin user can not delete himself anymore, because<br>  of handling of circular dependency.<br>- #14 Make name field of modules readonly. Field is internal and not meant to<br>  be editable.<br>- #19 Fixed removing permissions (in general fixed removing items from<br>  nm-relations.) <br>- Added \"button\" layout for the Statefieldrenderer.<br>- Handle \"Save and proceed\" button (New feature in formbar).<br>- Added StaticListRenderer. Can be used to render simple static overviews of<br>  items.<br>- On user registration the password strength is now checked. Password must be<br>  at least 12 chars long und need to have 2 non chars.<br>- Add option to define rolespecific descriptions of the state.<br>- Add option to configure a callback after a user has authenticated with the<br>  application. This callback can be used to cancel the authentification or to<br>  further actions after the user logs in.<br>- Added sorting icons for datatables.<br>-<br><br>1.13.3<br>======<br>Bugfix release. Fixes serious problem handling addrelations based on the<br>session variable. This error may cause wrong relations between items.<br><br>1.13<br>====<br>- Fixes in scaffold. Improve default MANIFEST and include more files. Make<br>  README a RST-File<br>- Internal UUID field is now 36 chars long. UUID is now stored as defined in<br>  RFC4122. Please note that existing UUIDs are not converted. You can convert<br>  exitsing UUIDs by using the \"ringo-admin db resetuuid\" command.<br>- Fixed #19 (https://github.com/ringo-framework/ringo/issues/19)<br>- Let users delete their own account. You can define the behavior to items<br>  defined by the user by setting the _owner_cascades class variable with in<br>  the models to e.g configure to delete all items which are owned by the item<br>  to. On default users can only delete their account if the do now own any<br>  items anymore. <br>- Implemented \"roles\" config variable for columns in table configs. If<br>  defined columns are only visible to users who have one of the<br>  configured roles.<br>- Added \"target\" attribute to the Linkfieldrenderer.<br><br>1.12<br>====<br>- Be more tolerant in imports. Only log in case the import includes fields<br>  which are not part of the model.<br>- Added config varibables to define default roles and groups on user<br>  registration.<br>- Added config variable \"layout.show_contextmenu\" to configure the visibility<br>  of the context menu.<br>- Improve result page after a user register a new user account.<br>- Improve result page after a user request a passwort reset.<br><br>1.11.2<br>======<br>- Small performance improvement. Added option to enable caching of the<br>  form configuration. This will prevent the application to reload the<br>  configuration on every request which is expensive. This is usefull for<br>  production envirionments as the form will not change here. However it is not<br>  recomended in development mode.<br>  Please refer to the documentation to see how to enable form caching.<br>- Fixed reraising exception withing general_exception view. Further only use<br>  this view in testing mode.<br>- Render title tooltips in table header of overviews<br>- Make registration and activation of users over the webinterface work again. This means<br>  new user can register themself using the webinterface if registration is<br>  enabled.<br>- Added scaffolds to the MANIFEST.in file. Has been missing.<br>- Fixed bug which causes exceptions in testcases because new created and<br>  loaded items in different Sqlachemy sessions. Use current db session from<br>  request when invoking the load method of a factory to enforce all items are<br>  attached to the same session.<br>- Added external requirements.txt file for scaffolds.<br>- Support DATABASE_URL envirionment variable. If set than this variable will<br>  be used to connect to the database. Eg: postgres://@/ringo<br><br>1.11.1<br>======<br>Bugfixrelease<br><br>- Reraise origin exception (including stacktrace) in case of errors in global<br>  error view to allow better debugging of errors. The origin stackstrace was<br>  hidden since the last version which introduces a global error view. This<br>  error view hides the origin traceback.<br><br>1.11.0<br>======<br>- Tests are now based on pytest. Removed tests based on the package \"behave\".<br>  Ringo now requires a package pytest-ringo which provides some helper classes<br>  to make testing more easy. Further the tests now support rollbacks.<br>- Changed behaviour how Ringo extensions are registered on application<br>  startup. Ringo now only shows a short warning on application start if a new<br>  added or removed extension is detected. It does not ask the user if ringo<br>  should register the extension automatically anymore which make the startup<br>  more robust on servers with no active terminal (e.g starting as WSGI).<br>  Adding or removing extensions in normale usage should be added or removed by<br>  migration scripts.<br>- Added \"ringo-admin app add-extension|remove-extension\" command to add<br>  or remove the initial modul and action entries during development.<br>- Improved documentation on how to add extensions in the application.<br><br><br>1.10.5<br>======<br>- Show info dialog at the top to the form in case the validation fails.<br>  This info has been added because users reported data loss because of<br>  formbar/ringo default behaviour of not saving anything in case of<br>  errors. Users seems to expect that the valid part of the data has been<br>  saved. This info should make the user aware of the fact that nothing<br>  has been saved in case of errors<br><br>1.10.4<br>======<br>Bugfixrelease<br><br>- Only log validation errors in DEBUG loglevel.<br>- Fixed changed field names in user registration.<br>- Fixed test cases<br><br>1.10.3<br>======<br>Bugfixrelease<br><br>- Fixed bug (Introduced with 1.10.2) when encoding values in GET params. Ringo<br>  uses a special notation for encoding values in the URL as GET param in the<br>  `values` key. This method failed for values containing non ASCII values.<br><br>1.10.2<br>======<br>Maintenance and Bugfixrelease<br><br>- Cleanup after move to Github:<br>\t- Removed .coveragerc. Not using coverage at the moment.<br>\t- Removed .hgflow. Not using the hg anymore<br>\t- Removed .hgignore. Not using the hg anymore<br>\t- Removed .tx. Currently not using Transifex for translations.<br>- Changed links in Documentation and README to refer to Github now.<br>- Do not log that we are calling get_current_request. This is a long standing<br>  design flaw in Ringo but it does not cause any known problems yet and it is<br>  unlikly to change in the near future. So i replaced the logging with a<br>  \"fixme\" comment.<br>- Log \"errors\" while resolving dot separated values in lists only in the debug<br>  log (was error) in _resolve_attribute. As this might be a sign of an<br>  missconfiguration it is actually handled in the function so we do not log an<br>  error message but give a hint in in the logging in development. <br>- Log failing CSRF token checks as warning.<br>- Using encode_values to encode the value for the values attribut in GET<br>  params now returns a urlencoded value. This results in the values will be<br>  double encoded. Added decode_values helper method which can decode<br>  urlencoded values back into a python dictionary. WARNING: If you are using<br>  the values GET param in your application, than you may want to adapt your<br>  code. <br>- Added/Improved authentification check in setstanding and changepassword<br>  method by adding missing checks and more comments.<br>- Make fields for the profile while user creation a logical field which is not<br>  stored in the datamodel. This prevents warning messages.<br>- Make field 'retype_password' a logical field which is not stored in the<br>  datamodel. This prevents warning messages<br><br>1.10.1<br>======<br>Bugfixrelease<br><br>- Updated translations.<br>- Fixed bug that set the display variable wrong (uses str_repr instead) when<br>  registering a extension.<br>- Added compatibility mode regading Ringos behaviour on adding \"s\" to the<br>  modul names when registering modules. The name of the modul of the extension<br>  is defined in the extension itself and should be taken as it is on default.<br>  However. Ringo tries also load the modul by adding an \"s\" to be compatible<br>  with older versions.<br>- Changed warning message on application startup when Ringo notices that there<br>  is a extenstion which needs to be registered. Fixed showing name of the<br>  extension.<br>- Fix scaffold for extensions. Handle case that the user cancel the automatic<br>  registering of the modul.<br>- Refactored the importer code in ringo/scripts/db.py and make the code better<br>  reusable for other commands.<br><br> <br>1.10.0<br>======<br>* The behavior of overviews using the Datatable JS library can now be<br>  configured with the JSON table configurations too. Formerly only the columns<br>  can be configured.  Now other aspects like, filtering, sorting, paginating<br>  etc. You can also define your own custom filters.<br><br>  The configuration will be generated on the fly based on the JSON config when<br>  rendering the overview. This generated configuration will replace the static<br>  predefined datatable configurations found in the init.js.<br><br>* Added datatable-moment.js  plugin to allow sorting datatable tables based on<br>  datefields.<br><br>1.9.1<br>=====<br>Bugfixrelease<br><br>- Fix internal list renderer and handle case if current user has no<br>  permissions at all. Then no links will be rendered.<br>- Fix has_role method. Handle case if current user is None.<br><br>1.9<br>===<br>- Log login attemps. Each successfull or failed login will now be saved in a<br>  table called \"user_logins\".<br>- Show info on last successful and last failed login on the index page of the<br>  application. Additionally show a warning if there have been more than 5<br>  failed logins since the last successful login.<br>  This feature need to be enabled in the ini file. See documentation for more<br>  details.<br><br>1.8<br>===<br>- Implemented session timer widget. The widget shows the remaining time in the<br>  session before the autologout will be triggered.<br>  The widget needs to be enabled in the .ini file. See documentation for more<br>  details.<br>- Dogpile caching for SQL need to be enabled explicit now.<br>- Enhanced breadcrum feature. Allow to define additional actions which should<br>  be displayed in the breadcrumbs beside the default actions.<br>- Changed Mailer. The Subject of the Mails do not include a prepended name of the<br>  application anymore.<br><br>1.7<br>===<br>- Ringo no longer does automatic extension registering on server<br>  startup. Registering a new extension often will write changes to the<br>  database. This is dangerous as this will potentially lead into<br>  failing later migrations. So Ringo will now ask the user what to do on<br>  server start. Default is to abort the registration.<br>- Added JQuery UI library. This library is currently not used by ringo itself<br>  but it provides basic functionality to other applications.<br>- Added breadcrumbs feature to Ringo. To be able to use the breadcrumbs you<br>  need to define a sitetree (See lib/sitetree.py for more details.) The<br>  default sitetree of ringo is empty which means no breadcrumbs are shown.<br>- Added \"--format\" flag for the \"ringo-admin db loaddata\" command to define<br>  the format of the inputfile. It is now possible to use the CSV importer<br>  also.<br><br>1.6<br>===<br>- Add functionallity for users so set their standin. Basically this is adding<br>  and removing other users to the default group of the user. To use this<br>  feature the user needs at least read access to the users he wants to set as<br>  standin.<br>- Changes favicon format to \"ico\" to be more compatible with versions of IE.<br>  Improved overwriting of the favicon. The code for favicons are now placed in<br>  favicons.mako which can be overwritten by other applications.<br>- Fixed handling of bundled delete requests. Two things has been changed: <br>    1. Call the callback before actually deleting it to allow some cleanup. <br>    2. Put the flush of the db operations at the end of the method to<br>       avoid \"Closed connection\" errors which happens for bundled delete<br>       request after the session has been flushed for the first item.<br><br><br>1.5<br>===<br>- Added new configuration variable 'app.mode' to be able to run the<br>  application in a different mode. If set the application will give some<br>  visual indication the the application is in a different mode.<br>- Changed default rendering of overview pages. Instead of using a<br>  complex overview with advanced search filters e.g Ringo now uses a<br>  simplified overview on default. The behaviour can be changed by either<br>  setting a global `layout.advanced_oveview` configuration varible in<br>  the ini file or per table configuration in the json config of the<br>  table. In the simplified overview features like pagination are currently disabled<br>  regardless what is configured in the table configuration. This may change in<br>  future versions.<br>- Changed click behaviour in overview tables. Rows are now clickable. With the<br>  change to the simplified overview code the way to select items from the<br>  overview changed also. Links has been removed completely now. Instead the<br>  whole row is clickable.<br><br>1.4<br>===<br>- Dropped SQLite support because of missing support of data migrations using<br>  alembic. Postgresql is the new default for the DMBS system.<br>  Added psycopg2 as requirement. Actually Sqlite support was broken since<br>  version 1.2.<br>- Removed fixtures for initial data. Data is now added to the migration<br>  scripts.<br>- Added new \"--format\" flag for the \"db savadata\" command to determine the<br>  export format. Default is JSON.<br><br>1.3<br>===<br>- Added new configuration varibale (auth.timeout_warning) to configure how<br>  many secods before the autologout happens a warning will be shown.<br><br>1.2.2<br>=====<br>- BaseFactory now take an optional argument for a request.<br>- The callback parameter in the views can now take a list of callbacks too.<br>  The handle_callback method is able to handle this correct. Please note that<br>  this mechanism needs some effort of the developer to build this list in the<br>  view function.<br>- Add additional callback parameter to the create view of users. This allows<br>  other views to overwrite the user create view and add custom callbacks.<br><br>1.2.1<br>=====<br>- Fixed circular dependency error on migration using alembic after adding<br>  uid and gid fields for users and usergroups which where self referencing.<br><br>1.2.0<br>=====<br>Beside the major changes which are listed below this version include many<br>small bugfixes and improvements in the code, usability and performance.<br><br>New:<br>- Add option to provide external validators to the update and create view.<br>  They will be used for additional validation of the form.<br>- Implemented a simple Warning Dialog if the user leaves of form without<br>  saving the changed data first.<br>- Added simple spinner which pops up if the loading of the page takes longer<br>  than 400ms.<br>- Added new \"ringo-admin app init\" command to initalise a folder containing<br>  a initial config file.<br>- Password must be at least 12 chars long and include 2 non-letters.<br>- Added support for loading configurations in case of multi-derived<br>  applications. Added new app.base configuration variable.<br>- Added new helper command to copie the static files of formbar into to<br>  correct location in ringo.<br>- Added option to name the authentification cookie. Needed if there are more<br>  than one ringo application on a server.<br>- Added a warning dialog which shows if the user leaves a form without saving<br>  it before.<br>- Do permission checks on submitted values for relations on POST requests.<br>  Users are not allowed to set items in relations for which they do not have<br>  read permissions.<br>- Log changes of uid and gid.<br><br>Changed:<br>- Enabled Mako default HTML escaping for Template rendering globally in ini<br>  file and explicit for form rendering, dialog rendering and listing<br>  rendering. Excluded html escaping for messages and the admin scripts as the<br>  rendered result is not aimed to be displayed in a browser.<br>- Seperated requirements for testing, installation etc.<br>- Static files from formbar are only copied on application start if there are<br>  not already the formbar files located in ringo. (Need some work). See<br>  \"formbar_static\" command.<br>- Fixed typos in german translation.<br>- Changed behavior of the warning for a nearing auto logout. Instead of<br>  showing after 95% of the logout time is up it will now be shown 3 Minutes<br>  before the actual logout happens.<br>- The modules for Roles, Users and Usergroups are now inherited from the<br>  \"Owned\" mixin class.<br>- Changed setting the GID for new items. Changed order of determining<br>  the GID (inverse order). First try to get the default_gid from the<br>  modul. If not present use the default_gid from the user. Of no<br>  default_gid is set at all leave the GID of the new item blank.<br><br>Removed:<br>- Removed group role feature. This feature was only rarly used.<br>- app.url configuration variable which was intended to use in scenarios where<br>  the application is not hosted under the root of the server. See<br>  documentation for deployment for more information on how to setup the<br>  application now.<br>- Static files of formbar are no longer copied into the static files of ringo<br>  on application start. These files are now dynamically loaded from formbar.<br>- Invoke command \"formbar_static\"<br><br>1.1.0<br>=====<br>New:<br>- Added \"openmodal\" option to LinkfieldRenderer<br>- Added \"action\" option to LinkfieldRenderer to be able to render other<br>  actions then read and update links.<br>- Added _get_permission classmethod in the Baseitem class. This class can be<br>  overwritten to implement a custom way to build the ACL for this class and<br>  instances.<br>- Added info page after login if the account has been disabled.<br>- Added --path option to load and save fixtures to be able to load alternative<br>  fixtures.<br>- Implement setting dot-separated values in items.<br>- Implemented fuzzy search. The search now supports the \"~\" operator to<br>  trigger a fuzzy search which uses the doublemetaphon as primary algorithm<br>  and falls back to the levenshtein algorithm as secondary it the primary<br>  fails.<br><br>Changed:<br>- Only show \"Homepage\" on index page if the user is actually logged in.<br>- Fixed DTListRenderer which was only rarly used and seems to be broken for<br>  some time. The fix onyl gets it working again. There is still work to do to<br>  make it work as the default ListRenderer (Display of Link e.g).<br>- Allow custom title and body in confirmation dialog.<br>- Use form parameter when getting the create form. Usefull when you want to<br>  use an alternative form to create an item.<br>- Hide attribute of ActionItems also affects overview lists.<br>- \"ringo-admin modul add\" command does not generate SQL code anymore. Instead<br>  of this it will print out code for the fixtures.<br>- Make the application base url configurable using the app.url config<br>  parameter.<br>- Added title tooltips in context menu<br>- Only save paths in the history and not full qualified URLs.<br><br><br>1.0.0<br>=====<br>WARNING! This update is a major upgrade of Ringo which may break your application!<br>It removes many of the core modules in the application! This will break your<br>application if you use one of the removed modules. In this case stay with the<br>0.18.0 version.<br><br>The following modules has been removed:<br><br>- Removed Log module<br>- Removed Tags module<br>- Removed Printtemplate module<br>- Removed Appointment module<br>- Removed Comments module<br>- Removed File module<br>- Removed News module<br>- Removed Todo module<br><br>The modules will be converted into extensions.<br><br>With version 0.16.2 Ringo supports loading extensions to enhance the<br>functionality of the application. This should be the default way to add<br>optional features to a Ringo based application. Since the removed modules all<br>implement general features which are optional to your application and aren't a<br>basic requirement, they has been removed from the core now. This reduces the<br>code base and make the core faster and more secure. The later is an important<br>precondition for post 1.0 goal: Getting much more secure to get ready to build<br>rock solid web application in Ringo.<br><br>New:<br>- Added Label field to the roles module.<br>- Added new \"fixture\" command in ringo-admin to load and save fixtures.<br>- Added new \"revision\" db command in ringo admin to generate a new<br>  (autogenerated) alembic migration script.<br>- Added fixtures for initial data.<br>- Support german locale in datefields. (Requires new formbar)<br>- Added showall option for Listfieldrenderer to show all elements regardless<br>  if the user is allowed to read the item. If the user is not allowed to read<br>  the item no link to open the item will be rendererd.<br>- When creating a new user a usergroup for the new user will be generatated<br>  automatically. The new usergroup will be set as default usergroup for the<br>  new user if no other group is set while creation.<br><br>Changed:<br>- The documentation is now opened in a new browser window instead of opening<br>  it in a modal popup window.<br>- Modal dialogs can not be closed by clicking in the background.<br>- Reimplemented openmodal function in listingfields. Has been removed by<br>  accident.<br>- Changed behaviour of the onlylinked attribute in listingfields. Also removes<br>  the checkboxes now as there is no reason to link/unlink items if only the<br>  linked items should be displayed.<br>- Improved user language detection in Javascript. Language setting is now<br>  determined by calling a remote function in the Rest API.<br>- The create method of factories now require a values attribute! It is not<br>  optional but can be empty to get the old behaviour.<br>- Show<br><br>Removed:<br>- Pre 1.0 Migration scripts removed. The older migrations scripts are now<br>  replaced by one single script. The alembic version of this version is still<br>  the same so that future migration scripts can be applied to old applications<br>  as well.<br><br>0.18.0<br>======<br>- Added option to open items in a modal window.<br>- Show spinner when opening items in a modal window.<br>- Set requirment of formbar to &gt;= 0.9.4.<br>- Added 'url_prefix' and 'url_scheme' the server configuration in the template<br>  of the ini file in base scaffold. This is usefull if the server is running<br>  behind a reverse proxy.<br>- Added options to configure the startup of the ODFConverter. On default the<br>  converter is not started! This is a change to the previous behaviour!<br>- Loading data in ringo-admin command can optinally be done by using the ID of<br>  the item instead of the default UUID. This is usefull for initially loading<br>  data after creating a database in case not all entries in the database have<br>  a UUID.<br>- Add support for import and and export of NM-relations. (Experimental). To<br>  enable this feature simply add the --include-relations to the savedata<br>  command.<br>- Improved translations. Added missing calls to translate function at various<br>  places.<br>- Added experimental support for exanding values for dotted attributes (e.g<br>  relation.value).<br>- #77 Support alembic &gt;= 0.7.1<br>  This will detect missing foreign keys in your datatable.<br>  Important:<br>  * Please update to a recent version of alembic (currently 0.7.4)<br>  * In case you are using SQLite: Merge<br>    ringo/alembic/versions/46edfd16f379_.py migration script to your migration<br>    scripts and apply it. See<br>    http://alembic.readthedocs.org/en/latest/branches.html for more details on<br>    merging. This will fix errors in the base ringo model.<br>  * Please generate a new migration and apply it. If your missing any foreign<br>    keys they will be generated now. If you are using SQLite please refer to<br>    ringo/alembic/versions/46edfd16f379_.py and see how migration is done for<br>    the base tables.<br>- #87 Remove alembic_sqlite dependeny.<br>  As alembic now supports some missing operations like add and drop column on<br>  SQLite the helper library alembic_sqlite is not needed anymore.<br>  Important:<br>  * Please search for the string \"drop_column_default\" and remove this and the<br>    following codeblock from your existing migration files.<br><br><br>0.17.1<br>======<br>- Added configuration for transifex<br>- Fixed error when opening News items.<br>- Init the form with the correct eval_url. Provide url_prefix when<br>  initialising the form.<br>- Show hint on errors in formdefinition in formeditor.<br>- #37: Further fixes.<br>- #86: Fixed extension specific view mapping.<br><br>0.17.0<br>======<br>- Improved overview and searching.<br>\t- Added clientsided pageination function.<br>\t- Added option to add a operators (&lt;, &lt;=, =&gt;, &gt;, ==, !=) to the<br>\t  search. If the user has provided a opertors the search will use this<br>\t  operator to do the search instead of a search based on a regular<br>\t  expression. This is usefull for searches on dates.<br>- Improved exporting.<br>\t- Added RecursiveRelation Exporter.<br>\t- Added ODF Converter.<br>- Insert scaffold of a formdefinition when creating a new form.<br>- Added support for translations in extensions.<br>- Status messages are now rendered at the top of the page.<br>- Added option to set a custom header with logo above the navbar more easily.<br>- #37: Change ownership only for admins<br>- #48: Add support to drop columns in SQLite.<br>- #50: Change behavior of \"click-seaerch-filter\" in overviews<br>- #64: Better indication of current edit mode<br>- #67: No ISE on reading data from the import file. Show error dialog now.<br>- #68: Installation/Setup fails because of missing files<br>- #82: Migration of the database for the first module sometimes does not work<br>- #85: News can't be marked as read<br><br>0.16.3<br>======<br>- Important: Changed the way how the DBSession is setup. See ringo/__init__.py<br>  file how it is setup now and adapt you application.<br>- Added commands to generate SQL to restrict and unrestrict access to table of<br>  a modul on database level (only postgres)<br>- Fixes of loading Form and Overview configuration.<br>- Add escaping into the renderer<br><br>0.16.2<br>======<br>- Add function to load ringo extenstions.<br>- Changed logging in application (Removed and modified)<br><br>0.16.1<br>======<br>- Allow configuration of caching of pages and static content.<br>- Add various option to enhance cookie and session security.<br>- Set headers to enhance security according to<br>  http://ghaandeeonit.tumblr.com/post/65698553805/securing-your-pyramid-application<br><br>0.16.0<br>======<br>Refactoring of views:<br>* Seperation of views: Basic views (LCRUDIE) are now located under<br>  views.base.list ... views.base.export. Removed views/base.py.<br>* Moved REST logic into the corresponding new view modules.<br>* Moved methods and code from views.json into the new views.api and<br>  views.response modules<br>* views.api: Modul with method used by the client.<br>* views.respose: Modul with special Response objects.<br>* views.request: Modul with methods (handlers) with common logic for various views.<br>* views.helpers : Modul with helpers methods (getters) to get things like to forms or<br>  information from the request.<br><br>Refactoring of model:<br>* Removal of the request dependecy in the base model.<br>  Refactoring of the setup of the modules.<br>* Removal of several class methods like get_action_routename and get_item<br>  actions into lib.helpers and others.<br><br>Refactoring of lib:<br>* Splitted large lib/helpers.py into various files under lib/helpers.<br>* Splitted large lib/renderer.py into various files under lib/renderer.<br><br>HOWTO Upgrade:<br><br>* The following methods has been moved:<br>  - get_table_config -&gt; lib/table.py<br>  - get_form_config -&gt; lib/form.py<br>  - get_action_routename -&gt; lib/helpers.py<br>  - get_item_list -&gt; model/base.py<br>  - get_item_modul -&gt; lib/helpers.py<br><br>  Search for these methods in all *.py and *.mako files and adapt the call.<br><br>0.15.2<br>======<br>* Use app title instead of app name as prefix in subject of notification mails.<br>* Fix urls in import, export dialogs. Use get_current_route_patch instead of<br>  URL (causes errors with SSL behind an reverse proxy)<br>* Fix import. Handle NULL values correct for integers.<br>* Fix handling NULL values in sorting.<br>* Use new formbar version 0.9.0. Fix some rules.<br><br>0.15.1<br>=======<br>Refactoring. Cleanup Model and try to get rid of pyramid specific elements<br>like the request.<br><br>* Removed __json__ method. JSON export is now completely handled in the<br>  Exporter (JSONResponse)<br><br>New:<br>* All Mails will have the application name in the subject.<br>* Add \"nolink\" Attribute to the DropdownRenderer.<br>* Added new TagFieldRenderer. Will only show tags which are associated to no<br>  or the items module.<br><br>Bugfixes:<br><br>* Translate options in dropdown lists.<br>* Translate headers in newslist.<br>* Fixed automatic translation in connection with mappings.<br>* Handle case if an attribute returns a BaseList as selected items in<br>  ListRenderer.<br><br>Changes:<br>* Text in News is now a Textarea.<br><br>0.15.0<br>=======<br>IMPORTANT: Application will need some work on application initialisation to<br>stay compatible with this release:<br><br>1. rename add_route to setup_modul<br>2. Move setup of modules into a \"includeme\" method.<br>3. Use config.include(\"appname\") to call the includeme method.<br>4. setup_finished callback is removed.<br><br>- Changed the way how the routing is setup on application initialisation. Now<br>  iterate over all available modules from database and configure the routes<br>  for each modul instead hardcoding the configuration including importing the<br>  modules etc.<br>- Added new ringo-admin command.<br>- Removed old add-ringo-modul command.<br>- Automatic logout after a configurable time. Defaults to 1800sec. Some time<br>  before the loggout a warning dialog will be raised.<br>- Removed deprecated \"ignore\" filter for selections. Use must use filter now.<br>- Filter option and items Dropdowns and Listings (Listfield, Comments) on user permissions.<br>- Changed permission system. Add user roles to the user if the user is member<br>  of the items group. Added group roles additionally.<br>- Usergroups and Roles now have a description.<br>- Statemodel of forms only have two states now: Draft, Published<br>- Added support for Regular expressions in search (again). Now you can<br>  configure if the searchterm is a regular expression or not.<br>- Show userlisting in roles.<br>- #47: Added last_login column<br>- Changed caching. Replaced class based caching partially with request based<br>  caching if possible. Use new Cache object (lib/cache.py) for caching in<br>  general.<br><br>0.14.1<br>=======<br>- Fixes in the overview<br>\t* Sorting on BaseItems is done based on their string representation.<br>\t* Filter expressions are now escaped. This allows special chars in the<br>\t  search. Therefor regular expressions are currently not supported<br>\t  anymore. See #52.<br>\t* Search is now case insesnsitive.<br>- Fix expandation of value in readonly dropdowns.<br>- New formencode version 0.8.1<br>- New registed users will have the user role in addition to the user group now.<br>- Implement formbar translation.<br><br>0.14.0<br>------<br>- Update to JQuery to 2.1.1<br>- Update to Bootstrap 3.1.1<br>- Changed permission system.<br>- Add boolean flag to choose if the group roles should be included in the user.get_roles()<br>- Changed building the principals of the user. Group roles will only be added<br>  to the user if he is actually member of the items group on permission check<br>- Add option to configure a default group on modul level which will be used on<br>  creation time as group if no special user default group is defined.<br>- Added information about the users profile to the user form.<br>- Allow refering to python properties in ListingFieldRenderer.<br>- Only render link in Dropdownfields if the user is actually allowed to view<br>  or update the linked item.<br>- Support alternative forms in the update view.<br>- Fix configuration of default sorting order in tableconfig (Was ignored).<br>  Changed default to asc.<br>- Add sorting to the ListfieldRenderer based on the tableconfig.<br>- Show number of items in the header of item overview pages.<br>- BaseLists are now iterable.<br>- Add label of the forms modul in the forms overview.<br><br>0.13.1<br>------<br>- Added option \"not specified\" to gender field in profile.<br>- Improved rendering of dropdownfield. Fixed emtpy field if there is no linked<br>  item.<br>- Worked on importer. Handle uuid values correct on import.<br>- Fix deleting profiles if a user is gets deleted.<br><br>0.13.0<br>------<br>- Improved Formbar form editing. Use new ACE (http://ace.c9.io/) JS based<br>  editor to edit the form definition. Requires new formbar lib (&gt;= 0.7)<br>- Add preview tabs to the form editor, which allow to see a basic preview<br>  of the form. The preview does not support any dynamic now application<br>  specific renderers.<br>- Write the formbar specific CSS and JS on application start into the ringo<br>  static folder.<br>- Do not include the JS and CSS code of formbar into the document. Instead use<br>  to dynamically written CSS and JS files to reduce the size of the generated<br>  document.<br>- Improved password encryption. Replaced use of pythons built in hashlib.md5<br>  algorithm with the use of the passlib library<br>  (https://pythonhosted.org/passlib/index.html) for more secure password.<br><br>0.12.1<br>------<br>- Improved export of Blobform items. Instead of exporting the \"data\" attribute<br>  all field in the data field will be flattend and added to the toplevel of<br>  the export.<br>- Added Import and Export to the profiles module<br><br>0.12.0<br>------<br>- #12: Implemented basic version of bundled actions. Currently \"Delete\" and<br>  \"Export\" is supported.<br>- Modified export. Export now supports exporting more than one item (Bundled<br>  actions)<br><br>0.11.5<br>------<br>- Added more testcases<br>- Added new configuration variable \"security.enable_csrf_check\" in<br>  configuration files.<br>- Use default excel dialog on CSV export.<br><br>0.11.4<br>------<br>- #41: Cleanup of code. Remove init_model function calls, Removed initializedb<br>  script which was used to initialize the database for the application. Now<br>  alembic is used for this.<br>- Removed default ItemFactories, Removed default __unicode__ functions.<br>- Added more testcases<br><br>0.11.3<br>------<br>- Changed order of calls to add relations, handle events and saving the values<br>  in the item. Prevents errors when inheriting informations from linked items.<br>- Fixed setting max_age in auth_tkt cookie. Fixes error in IE10 for if running<br>  in pyramid &gt; 1.4.5.<br>- Changed import. Import now allows importing multiple items. After the import<br>  has finished a result page is shown.<br>- Implemented import and export as CSV.<br><br>0.11.2<br>------<br>- Splitted requirements. Required packages for testing are now installed<br>  locally.<br>- Added unittests to test /lib/helpers<br>- Added unittests to test /views/index<br>- Enhanced Profile modul. Added gender field. Make some fields desired and required.<br>- Added \"multiple\" attribute to Listfield Renderer. Allows the restrict the<br>  selection of items to one item at once. Only implemented on client side.<br>- Add support for list elements while accessing a \".\" separated<br>  attributes in the __getattribute__ method of the BaseItem.<br>- Add relation from tags to modules to allow modul specifc keywords.<br>- Add tags to forms.<br>- Add comments to forms.<br>- Ported \"filter\" attribute of selectionfield renderer to the listfield renderer.<br><br>0.11.1<br>------<br>- #36: Another try to fix caching problems. This is another approach to<br>  5c152bd which tried to disable the caching at gets lost. (maybe a merge<br>  error)<br><br>0.11.0<br>------<br>- Add service under \"rest/rule/evaluate\" to evaluate rules. Service is used<br>  for client side evaluation of rules in the formulars.<br>- Provide the user roles as \"_roles\" value in the form. This value can be used<br>  to model role based rules in the form. Form needs a hidden field which takes<br>  the provided \"_roles\".<br>- Removed category from form form and table configuration. It is currently<br>  unused.<br>- Changed rendering of ringo specif dropdown.<br>- Add option to configure group and owner inhertinace on creating new<br>  instances in the Owned-Mixin.<br>- Deletion of Items now cascades to Logs, Comments, Versions and nested<br>  Elements.<br>- #18: Added some ringo artwork.<br>- #8: Make documentation available in the application<br><br>0.10.0<br>------<br>- Add new requirement of py3o.template library.<br>- Add Printtemplate modul. Printtemplates are ODT or ODS documents which are<br>  used as templates for generating nice looking documents. On processing the<br>  template placeholders in the template will be replaced by values of the<br>  item. The template can include basic python expressions. E.g to iterate over<br>  lists.<br>- Add Printable Mixin. Inheriting from this mixin will add a print action to<br>  the item.<br>- Fixes on permission checks. Add button to add new items in listing only if<br>  the user actually has permission to add new items.<br>- Add \"showsearch\", \"hideadd\", \"nolinks\" attributes to listfield renderer to<br>  enhance configuration of rendering.<br>- Render permissions of a role as FieldList.<br>- Add TodolistRenderer. Render todos in the home view.<br><br>0.9.2<br>-----<br>- Add Versioned mixin. This mixin can be used to store different versions of<br>  an item. On each update of the item the serialized values of the item will<br>  be saved in the version table. The versions are later used to show<br>  differences between the current and a given prior version in the form.<br>- Add get_values function to the BaseItem to return a dictionary containing<br>  all values of the item. Optionally the items can be serialized (this<br>  is a very simple serialisation).<br>- Reorganised automatic logging and changing states. The former version was<br>  implemented as update handler in the mixin classes and was based<br>  on the SQLAlchemy \"history\" functionallity. Unfortunately this history<br>  wasn't as much reliable as expected in some corner cases. The update handler<br>  was removed and changing the states and logging are now implemented directly<br>  in the save method of the item.<br><br>0.9.1<br>-----<br>- Replaced route_url with route_path.<br>- Fixed rendering of links in the dropdown renderer. Consider user permission<br>  on link generation (read/update).<br>- Added options to the Table renderer to configure the responsive behaviour of<br>  table columns. You can now define which columns should be visible on which<br>  screenwidth. Defaults to show only the first column.<br>- Workded on Formeditor. Implemented selecting a form when creating new<br>  (blobform) items.<br>- Introduced warnings (formbar 393:bbd7a5192e29). Validate the item on loading<br>  to generate warning.<br>- Handlers in the statemachine now get the transition as additional parameter.<br>  This is usefull das the transformation gives access to the state,<br>  statemachine and optionally the request.<br>- Use sorting configuration from table config in DTLists.<br>- Added paginated DTList.<br>- Check if the user is still allowed to edit the item after he edited it<br>  (Statechange). If not call alternative read URL.<br>- Improved performance. Do some caching here and there.<br><br>0.9.0<br>-----<br>- Added comment modul<br>- Added tags modul<br>- Added todo modul<br>- Added forms module<br>\t- Write save method for items like the save method of formbar.<br>\t  Overwrite the method in Blobforms.<br>\t- Overwrite get_attr, get_value method in blobform to handle getting<br>\t  values from the datafield.<br>\t- Think about how to handle multiple forms for one item. Currently<br>\t  this is hardcoded on itemlevel which form should be used.<br>- Added UUID field for each BaseItem<br>- Implement simple Import and Export. Only single items. No relations.<br>\t- Added JSON Importer and Exporter<br>\t- Added import and export functions in the view for ringo modules<br>\t  except for the modul modul<br>- Small layout fixes (flash messages)<br>- Modules can now be placed in the \"user menu\" in the top right. Improved<br>  layout of this menu with textual headers.<br>- Some code cleanup<br>- Start using \"invoke\" command for different tasks like testing or building<br>  the documentation.<br><br>0.8.1<br>-----<br>- Bugfixes for API Change: BaseLists are not initialized with request instead of request.db<br>- Improved documentation<br>- Some fixes in the basic scaffold. Improved alembic integration.<br><br>0.8.0<br>-----<br>- Added log modul<br>- Added statemachines<br>- Added simple mechanism to call handlers for certain events in the model.<br>  This is currently used to:<br>\t- Update the updated attribute on every change of a item which has the<br>\t  meta mixin.<br>\t- Create a simple log entry on updating or creating a item.<br>- Worked on caching the result of SQL queries to improbe the performance.<br>- API Change: BaseLists are not initialized with request instead of request.db<br>- Added alembic folders to basic scaffold<br>- Worked on documentation<br><br>0.7.0<br>-----<br>- Added news modul<br>- Use \"width\" from tableconfig also in DTListings.<br>- Rows in DTLists are now clickable to if the user is allowed to update the<br>  item then the update action will be called on click. Else call the read action.<br>- Fix URLs for the ReST-Api to match basically the typical URL Schema for CRUD<br>  actions:<br><br>    * GET /items - Retrieves a list of items<br>    * GET /items/12 - Retrieves a specific item<br>    * POST /items - Creates a new item<br>    * PUT /items/12 - Updates item #12<br>    * PATCH /items/12 - Partially updates item #12<br>    * DELETE /items/12 - Deletes #12<br><br>  Note, that not all actions are actually implemented yet, but for now the url<br>  schema has beed adapted.<br><br>0.6.4<br>-----<br>- Improved Layout<br>  - Use Bootstrap 3<br>  - Use new formbar lib (bootstrap 3 compatible)<br>  - Optimized space. Removed tabs. Added advanved menu to the context menu for<br>    accessing other content which was formerly placed in tabs.<br>- Only show links for registering users or password reminders if the mail<br>  system is configured and registering and reminders are enabled in the auth<br>  system. See ini file. Defaults to not enabled.<br>- Implemented a message library. Currently it is used to generate based on<br>  mako templating and send mails.<br>- Added option for users to change their password.<br><br>0.6.3<br>-----<br>- Improved authorisation system. Make building ACL more simple and robust.<br>- Implemented configurable str representation of items in the modul setting.<br>- Show the item representation string on every update and read page.<br>- Added new date related helper functions.<br>- Delete usersettings too if the user gets deleted.<br>- Added caching on modules, table and form configs to improve the performance.<br>- Introduced new \"form\" GET parameter to optionally change the default<br>  rendered.<br>- Listings<br>    - Fixed value expandation in the listings.<br>    - Added option to List to do the sorted on the expanded or raw value.<br>- ListingFieldRenderer<br>      When using listing in context with Nested Objects to build<br>      hirachies then take care to only show valid items in the list to<br>      prevent building broken hirachies.<br>    - Handle \"onlylinked\" config var in FieldListRenderer.<br>    - Handle \"ignore\" config var in FieldListRenderer.<br><br>0.6.2<br>-----<br>- Fixed user form configuration which leads to an error in password generation<br>  while creating a new user.<br>- Changed authorisation. Now access to items are also granted if the user is<br>  member of the items group.<br>- Changed authorisation in Itemlists. Only items are included in the overview<br>  if the user has access to read the item.<br>- Updated translations (missing translations for file and appointment modul)<br>- Changed imports of models. Now use specific import_modul function to import<br>  models in the application to be able to import overwritten clazzes in other<br>  applications.<br>- Added CSRF protection on POST request. On every POST request now a special<br>  csrf token is checked. If check fails a Authorisation error is thrown.<br>- Added tab to change the ownership informatio in update and read forms if<br>  ownership information is available.<br>- Removed \"transform\" funtion from lists.<br>- Added new alembic scripts to initialise the database.<br><br>0.6.1<br>-----<br>- Bugfixe on File modul initialisation (missing name)<br>- Added \"values\" GET param for views. Can be used to prefill forms with given<br>  values.<br>- Improved rendering of the ListField Renderer. (Added label, Use new \"values\"<br>  parameter)<br><br>0.6.0<br>-----<br>- Added File module<br><br>0.5.1<br>-----<br>- Added support for alembic for database migrations.<br><br>0.5.0<br>-----<br>- Added Appointment module<br>- Added Renderer for a query DataTable Renderer.<br>- Added Renderer for ListFields. ListFields are Basically listings of related<br>  items in tabular from providing a checkbox to select and deselect items.<br>  Selected items will get linked.<br>- Added \"backurl\" GET parameter. This parameter can be used to define a URL<br>  which should be called instead of the default redirect action after create,<br>  update or delete succeeds. The parameter is saved in a session.<br>- Added more behave tests (now 42% code coverage).<br><br>0.4.1<br>-----<br>- Added a Ringo specific renderer for dropdown lists which add a small link<br>  next to the label of the dropdownlist.<br>- Added Behaviour Driven Test infrastructure based on \"behave\"<br>- Small bugfixes.<br><br>0.4.0<br>-----<br>- Added REST-full service. The service is reachable for all modules on the<br>  known url with the prefix \"rest\". Eg rest/users/list. Using the interface<br>  requires Authorisation and Authentification which needs to be supplied.<br>- Added \"Nested\" Mixin class to allow nested items.<br>- When a form has multiple pages the currently selected page is now saved in<br>  the user session. Needs recent formbar version.<br>- Use new get_formbar_js method in inject js code needed for formbar. Neededs<br>  recent formbar lib.<br>- Items with the MetaMixin will have a default created und updated date of<br>  utcnow now.<br>- #25: Added support for custom renderes. Renderers can now be defined and<br>  provied to the view functions. The renderer must be derived from the Formbar<br>  FieldRenderer) The view functions will give the renderer to the formbar lib.<br>  Need a recent Formbar version (&gt;=0.3.0)<br><br>0.3.2<br>-----<br>i18n Support:<br>- User custom extractor from formbar for translation string in XML form<br>  configuration. No need to mark strings in the configurations as<br>  translatable.<br>- Removed lingua requirement.<br>- Added support for translations in the basic scaffold.<br><br>0.3.1<br>-----<br>Search:<br>- Added a new TableConfig class. This clazz provides an interface to a JSON<br>  file which is used to configure various aspects to the rendering of the<br>  overview tables. This new configuration directive will replace to old<br>  _table_fields configuration attribute.<br>- #26: Expand values of relations in the overview from form configuration.<br>- #27: Save current sorting in the session.<br>- #28: Save sorting together with the search query in the saved searches.<br><br>i18n Support:<br>- #23: I18n Support in renderes. Added more translations.<br>- Added lingua as requirement. Needed for message extraction for i18n Support<br>- Marked form configurations as translateable.<br>- Added support for translating forms. Requires formbar &gt;= 0.2.1<br>- Added support to translate headers in the overview.<br><br>Misc:<br>- #19: Login should be in a Popup window<br><br>0.3.0<br>-----<br><br>- #15: Implement Search<br>- Enabled search by clicking on the value in colums.<br>- Added table to save usersettings (DB change!)<br>- Enable saving search queries in the usersettings.<br><br>- Added dogpile.cache dependency because of caching in sqlalchemy.<br>- Enabled basic caching of SQL queries.<br><br>0.2.2<br>-----<br><br>- Some improvement in Layout. Make header more compact to not waste to much<br>  space<br>- Create an empty \"forms\" dir under views for the basic scaffold. Fixes error<br>  on creating the form.xml files when adding a new modul.<br>- Improved add_&lt;&lt;app&gt;&gt;_modul command. Fixed modul (re) initialisation. It the<br>  modul initialisation does not happen on recreating again the database.<br>- Fix get_path function. Path is now relativ to the application (was relativ<br>  to Ringo)<br>- #10: Add \"visible\" flag to moduls. Moduls can now be configured in which<br>  menu to display the modul. (DB change!)<br>- Added new field \"clazzpath\" to the modul. Needed only internal for dynmic<br>  imports on permission checks. (DB change!)<br>- Need formbar in version &gt; 0.1 to be able to render selection fields.<br><br>0.2.1<br>-----<br><br>- Improved documentation<br>- Added a simple request history (needed for #7)<br>- #1: Error on getting roles while authorisation when user is not logged in<br>- #2: Put some usefull content on the default index page<br>- #3: Set application title in the page header<br>- #4: Add version info page<br>- #5: Add about page<br>- #6: Add contact page<br>- #7: Add dialogs for errors (404, 403)<br>- #9: Cleanup and structure css<br>- #17: Hide checkboxes in overviews if bundled actions are not enabled<br>- #20: Fix layout of flash messages<br>- #21: Complete german translation<br><br>0.2<br>---<br><br>First more or less version which includes all basic functionallity.<br><br>- Added basic scaffold<br>- Added \"add_modul\" command to add boilerplate code for new moduls.<br><br>0.1<br>---<br><br>- Basic model initialisation<br>- Basic page layout<br>- Added authentification<br><br>0.0<br>---<br><br>-  Initial version\n          </div>"}, "last_serial": 2357178, "releases": {"0.0": [{"comment_text": "", "digests": {"md5": "2effbb9ddd1f45e0479759d14d6aed6b", "sha256": "99d2caaaa97eb902a5bb3cdc40f9653f46aa9d238509e6a779e8c43fcb6e80c9"}, "downloads": -1, "filename": "ringo-0.0.tar.gz", "has_sig": false, "md5_digest": "2effbb9ddd1f45e0479759d14d6aed6b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 211080, "upload_time": "2013-05-27T23:08:42", "upload_time_iso_8601": "2013-05-27T23:08:42.815431Z", "url": "https://files.pythonhosted.org/packages/83/ef/8df9a9fd19c195455043afb36f63f4ddb85486a1a5c2a94c125abe92892c/ringo-0.0.tar.gz", "yanked": false}], "0.1": [{"comment_text": "", "digests": {"md5": "cb2afb4749f10bfb0a93fef5a1a4e420", "sha256": "52a4adbd84ff2815ea14892b09353879c885a4e824366d65e22fcabf34f4f496"}, "downloads": -1, "filename": "ringo-0.1.tar.gz", "has_sig": false, "md5_digest": "cb2afb4749f10bfb0a93fef5a1a4e420", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 242171, "upload_time": "2013-01-29T23:41:30", "upload_time_iso_8601": "2013-01-29T23:41:30.596511Z", "url": "https://files.pythonhosted.org/packages/43/ff/7f19c57e563240dfaa70a955ce7ae0cbad3130a34afd431065297f5b3a9a/ringo-0.1.tar.gz", "yanked": false}], "0.11.0": [{"comment_text": "", "digests": {"md5": "fb15f42ffefa7b59383b28d1bdb33914", "sha256": "3615e9657041b66b7118b029b4d690af5c5145c7b6b1ecd05eaa64a2c2f6be5b"}, "downloads": -1, "filename": "ringo-0.11.0.tar.gz", "has_sig": false, "md5_digest": "fb15f42ffefa7b59383b28d1bdb33914", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1221091, "upload_time": "2014-02-24T14:57:46", "upload_time_iso_8601": "2014-02-24T14:57:46.702767Z", "url": "https://files.pythonhosted.org/packages/d9/1c/4ac2ad3f5f752c87689737597fdddb9226257fd83b1a22a3f9931f1d8c0f/ringo-0.11.0.tar.gz", "yanked": false}], "0.11.1": [{"comment_text": "", "digests": {"md5": "7f1cc172121d10abb1bc2c7994425cf0", "sha256": "70de015d937191691f35a0bc5937d4a610b8ace185453b527740e28f48447de4"}, "downloads": -1, "filename": "ringo-0.11.1.tar.gz", "has_sig": false, "md5_digest": "7f1cc172121d10abb1bc2c7994425cf0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1221384, "upload_time": "2014-02-24T14:58:03", "upload_time_iso_8601": "2014-02-24T14:58:03.609147Z", "url": "https://files.pythonhosted.org/packages/30/05/33714fa1dda0a19961c2d56e276432e8da6659065eea3977fe7f35bd39b0/ringo-0.11.1.tar.gz", "yanked": false}], "0.11.2": [{"comment_text": "", "digests": {"md5": "a2416fb5d4e26671678fd2cc69c4197b", "sha256": "e6fa8d8b3faf85e7a6f89dc0239b380f9a32712186c14051a2cade8076bdd9c9"}, "downloads": -1, "filename": "ringo-0.11.2.tar.gz", "has_sig": false, "md5_digest": "a2416fb5d4e26671678fd2cc69c4197b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 890879, "upload_time": "2014-03-27T18:17:42", "upload_time_iso_8601": "2014-03-27T18:17:42.751489Z", "url": "https://files.pythonhosted.org/packages/5c/b6/95c70d5b1617a60600686e37bc5b1e910f8c5a6805a7fbe3b8530ce60bd5/ringo-0.11.2.tar.gz", "yanked": false}], "0.14.0": [{"comment_text": "", "digests": {"md5": "4312454585eb86bf91d2897e30855c82", "sha256": "4a0186fb43874483d287f136bbe94ec8fb26d79165b411583b0ea91c34b9af1d"}, "downloads": -1, "filename": "ringo-0.14.0.tar.gz", "has_sig": false, "md5_digest": "4312454585eb86bf91d2897e30855c82", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 971111, "upload_time": "2014-05-27T06:34:57", "upload_time_iso_8601": "2014-05-27T06:34:57.261114Z", "url": "https://files.pythonhosted.org/packages/04/f6/01a54541383127b9683a8b4a8d92ef69d10b9be374eddf07cc80244a2fa0/ringo-0.14.0.tar.gz", "yanked": false}], "0.15.1": [{"comment_text": "", "digests": {"md5": "33fe8fd65ddde92e700c6317c7a0c54b", "sha256": "6af98aec23d47ba8a3d41ca14d79878715ecf33cebfc43578dda7524adf51036"}, "downloads": -1, "filename": "ringo-0.15.1.tar.gz", "has_sig": false, "md5_digest": "33fe8fd65ddde92e700c6317c7a0c54b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1516781, "upload_time": "2014-08-28T14:55:07", "upload_time_iso_8601": "2014-08-28T14:55:07.983400Z", "url": "https://files.pythonhosted.org/packages/47/22/634bad7d5fe4aed84a0695e2b15e5c1d49fca82d2a7aaba7aa952f5d78ae/ringo-0.15.1.tar.gz", "yanked": false}], "0.15.2": [{"comment_text": "", "digests": {"md5": "b988b1fc93917b732a4d427aba0ef155", "sha256": "1311e8bab19118db20cecb17a730700787aa3c27d12f72d157b7e17ab5158f8c"}, "downloads": -1, "filename": "ringo-0.15.2.tar.gz", "has_sig": false, "md5_digest": "b988b1fc93917b732a4d427aba0ef155", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1040427, "upload_time": "2014-10-22T11:49:36", "upload_time_iso_8601": "2014-10-22T11:49:36.131978Z", "url": "https://files.pythonhosted.org/packages/5e/4c/bb93669673665f59d84c0ce46b01e69be0902f7295b6397c225a2ea05e09/ringo-0.15.2.tar.gz", "yanked": false}], "0.16.0": [{"comment_text": "", "digests": {"md5": "ef6c61bee3f53ee4ac9d12ec6affb80f", "sha256": "d62524b7314acfa113e5acebd2ed370db8d15c67bb19d0b65a212f2bb24d8887"}, "downloads": -1, "filename": "ringo-0.16.0.tar.gz", "has_sig": false, "md5_digest": "ef6c61bee3f53ee4ac9d12ec6affb80f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1547557, "upload_time": "2014-09-15T12:28:00", "upload_time_iso_8601": "2014-09-15T12:28:00.031881Z", "url": "https://files.pythonhosted.org/packages/60/05/3eca101861a55488e59c4b1270e3f2a8079ab6e444fd27ad7ffa223ab49a/ringo-0.16.0.tar.gz", "yanked": false}], "0.16.1": [{"comment_text": "", "digests": {"md5": "752ac0b8f60732e7913da92d8f1e2eae", "sha256": "93abb5a7a71968649c52b7a7e908b3c85c8762b4ba3c6509ce42b1294147d131"}, "downloads": -1, "filename": "ringo-0.16.1.tar.gz", "has_sig": false, "md5_digest": "752ac0b8f60732e7913da92d8f1e2eae", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1546824, "upload_time": "2014-09-18T13:42:28", "upload_time_iso_8601": "2014-09-18T13:42:28.853727Z", "url": "https://files.pythonhosted.org/packages/06/45/fd8522c4ae7fa23268a93c190830423a52895199d17f2cc761229fe12b3c/ringo-0.16.1.tar.gz", "yanked": false}], "0.16.3": [{"comment_text": "", "digests": {"md5": "2a19ee5e73d1257da0a9536291beb6cd", "sha256": "e2451a7fde547290da7b8979fa26bc88c2efa1b4ce7576f26d5d16ad48e5cef4"}, "downloads": -1, "filename": "ringo-0.16.3.tar.gz", "has_sig": false, "md5_digest": "2a19ee5e73d1257da0a9536291beb6cd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1559187, "upload_time": "2014-11-04T14:34:00", "upload_time_iso_8601": "2014-11-04T14:34:00.899832Z", "url": "https://files.pythonhosted.org/packages/3d/81/4a3a12198110e80dab39abdbfdd0815052da541abedaa3905cd449f4f4f1/ringo-0.16.3.tar.gz", "yanked": false}], "0.17.0": [{"comment_text": "", "digests": {"md5": "e03015b376ff8f4de774dd9a16491a6a", "sha256": "014dfb8c9173b85e911923ae45473018d19021cc2f46ea656f1e3c4266391f8b"}, "downloads": -1, "filename": "ringo-0.17.0.tar.gz", "has_sig": false, "md5_digest": "e03015b376ff8f4de774dd9a16491a6a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2023250, "upload_time": "2015-01-11T19:07:04", "upload_time_iso_8601": "2015-01-11T19:07:04.198440Z", "url": "https://files.pythonhosted.org/packages/0e/ab/6556d860e0d2a9c56be2eb0ecc06671c790f3b7212c1d18ebbfc9e5fb87e/ringo-0.17.0.tar.gz", "yanked": false}], "0.17.1": [{"comment_text": "", "digests": {"md5": "280858387ff000b56278469f0ad2166d", "sha256": "3905b4a24902caf69a9bb856218680e69f85b16b94a1382d610d1ca8971af0ce"}, "downloads": -1, "filename": "ringo-0.17.1.tar.gz", "has_sig": true, "md5_digest": "280858387ff000b56278469f0ad2166d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2019581, "upload_time": "2015-01-16T09:47:16", "upload_time_iso_8601": "2015-01-16T09:47:16.952783Z", "url": "https://files.pythonhosted.org/packages/81/e4/4c62ad447ded6df39594f1e5c1647cedb67042f3b074d1135ae73427de43/ringo-0.17.1.tar.gz", "yanked": false}], "0.18.0": [{"comment_text": "", "digests": {"md5": "27f290421643b41283838874efb7b81e", "sha256": "087ec8fac3382b9795b62febde49916fc384b4d520dbcca737522cb825c4d2f7"}, "downloads": -1, "filename": "ringo-0.18.0.tar.gz", "has_sig": false, "md5_digest": "27f290421643b41283838874efb7b81e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1474969, "upload_time": "2015-01-31T18:58:17", "upload_time_iso_8601": "2015-01-31T18:58:17.555061Z", "url": "https://files.pythonhosted.org/packages/53/31/d5784bd707728e888db4c3bf8250932b42a8849bf5d1060becaf4a0bf9c8/ringo-0.18.0.tar.gz", "yanked": false}], "0.2": [{"comment_text": "", "digests": {"md5": "4324ca31f8299fea3bdaefb8adf03372", "sha256": "f28c37becb833faddafa322649b3141046e7e55dd8c21151bb18fe9f16827068"}, "downloads": -1, "filename": "ringo-0.2.tar.gz", "has_sig": false, "md5_digest": "4324ca31f8299fea3bdaefb8adf03372", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 211203, "upload_time": "2013-05-28T04:55:00", "upload_time_iso_8601": "2013-05-28T04:55:00.225850Z", "url": "https://files.pythonhosted.org/packages/0b/63/f88a4432c49c47e650264d51896aa90e409d9361a1be956bdcf082cb30fa/ringo-0.2.tar.gz", "yanked": false}], "0.2.1": [{"comment_text": "", "digests": {"md5": "857c9af4279040f5bf8d314dd0fd0098", "sha256": "c4f316acd217dc586506c387b7a7bf4208d0e8ac7f19776d1fb1202fcd971bec"}, "downloads": -1, "filename": "ringo-0.2.1.tar.gz", "has_sig": false, "md5_digest": "857c9af4279040f5bf8d314dd0fd0098", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 495199, "upload_time": "2013-06-25T21:32:52", "upload_time_iso_8601": "2013-06-25T21:32:52.342877Z", "url": "https://files.pythonhosted.org/packages/a1/ff/e666aef093c0ee20f5769482dcd0cc770bcef65fc8693695d488a351c19b/ringo-0.2.1.tar.gz", "yanked": false}], "0.2.2": [{"comment_text": "", "digests": {"md5": "3e0d744a208bb68aa47893a6cc43da3e", "sha256": "6c51213f48db272e908efc86cb4a97e7aa50479f8e3b5b13428415e73d57f218"}, "downloads": -1, "filename": "ringo-0.2.2.tar.gz", "has_sig": false, "md5_digest": "3e0d744a208bb68aa47893a6cc43da3e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 474424, "upload_time": "2013-07-01T19:04:45", "upload_time_iso_8601": "2013-07-01T19:04:45.841525Z", "url": "https://files.pythonhosted.org/packages/ef/21/87ad131df07f163540e7b2dacd95a353d483551103e1540c2f33938637fb/ringo-0.2.2.tar.gz", "yanked": false}], "0.3.0": [{"comment_text": "", "digests": {"md5": "1c1ef5ab785d393351c3a6caeff261a0", "sha256": "4af164c910670a5f2e78f470076408071a3458dca0f29e8a636e28ba3d4867b1"}, "downloads": -1, "filename": "ringo-0.3.0.tar.gz", "has_sig": false, "md5_digest": "1c1ef5ab785d393351c3a6caeff261a0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 499558, "upload_time": "2013-07-04T19:19:19", "upload_time_iso_8601": "2013-07-04T19:19:19.307331Z", "url": "https://files.pythonhosted.org/packages/11/f4/20f6d5159c34d40bf1900133148f7737e681f6c2f734135b162c04e2eb49/ringo-0.3.0.tar.gz", "yanked": false}], "0.3.1": [{"comment_text": "", "digests": {"md5": "9b6900c4386376556b3971139cae7b36", "sha256": "238503cfeedefa29e27e68d0402537f18452b228e2d1ff1a711b1e73846e0db9"}, "downloads": -1, "filename": "ringo-0.3.1.tar.gz", "has_sig": false, "md5_digest": "9b6900c4386376556b3971139cae7b36", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 505997, "upload_time": "2013-07-10T20:39:31", "upload_time_iso_8601": "2013-07-10T20:39:31.174323Z", "url": "https://files.pythonhosted.org/packages/71/af/51292d83523db776ee80c049483fbf4d6360e980896920d54adcd0f01bcd/ringo-0.3.1.tar.gz", "yanked": false}], "0.3.2": [{"comment_text": "", "digests": {"md5": "21765e937058f7551c7a0e34aab81be2", "sha256": "8ea60333dd42d9c999d1584f41736ab6aba7a730f946bfba0e31b3e4498368bf"}, "downloads": -1, "filename": "ringo-0.3.2.tar.gz", "has_sig": false, "md5_digest": "21765e937058f7551c7a0e34aab81be2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 506820, "upload_time": "2013-07-11T21:03:56", "upload_time_iso_8601": "2013-07-11T21:03:56.983088Z", "url": "https://files.pythonhosted.org/packages/af/3b/87b2a7e7654e2971b1a7d45bfdc867fffe5870e1268a5d5022e655dceb57/ringo-0.3.2.tar.gz", "yanked": false}], "0.4.0": [{"comment_text": "", "digests": {"md5": "b082d6e317b45a4bbddf8bf29e8d5e52", "sha256": "bce3c850c2077d0cf9894e0c3774a10ee2ae109ff5534738b9edb985fea41a67"}, "downloads": -1, "filename": "ringo-0.4.0.tar.gz", "has_sig": false, "md5_digest": "b082d6e317b45a4bbddf8bf29e8d5e52", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 510565, "upload_time": "2013-07-21T19:12:04", "upload_time_iso_8601": "2013-07-21T19:12:04.303457Z", "url": "https://files.pythonhosted.org/packages/62/ee/f7b1a204079d79a51b287877b95df99207b0d264542f5f819c93670f696f/ringo-0.4.0.tar.gz", "yanked": false}], "0.4.1": [{"comment_text": "", "digests": {"md5": "0272df6ac4ca0ef3067cc3e067cf5ae1", "sha256": "655ba6341d603de2fc3f4f643ad55dc289bbef2b57c6d7f05f1b530afcbd2c7e"}, "downloads": -1, "filename": "ringo-0.4.1.tar.gz", "has_sig": false, "md5_digest": "0272df6ac4ca0ef3067cc3e067cf5ae1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 515402, "upload_time": "2013-08-12T20:26:45", "upload_time_iso_8601": "2013-08-12T20:26:45.353515Z", "url": "https://files.pythonhosted.org/packages/18/d0/85ae97b78f837a96001c2d878c25cb53c49427fbcb9d94d3427879433be2/ringo-0.4.1.tar.gz", "yanked": false}], "0.5.0": [{"comment_text": "", "digests": {"md5": "6df2ab0d00e2ef49e029472c113b3f60", "sha256": "d6370757764dc461ed7aeb1e07c20dafe08a0de19e1c525a5df9b64d08ea1479"}, "downloads": -1, "filename": "ringo-0.5.0.tar.gz", "has_sig": false, "md5_digest": "6df2ab0d00e2ef49e029472c113b3f60", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 541188, "upload_time": "2013-08-14T20:51:16", "upload_time_iso_8601": "2013-08-14T20:51:16.298961Z", "url": "https://files.pythonhosted.org/packages/b5/d3/726df1a87a7b97e0fcf51d99e666912ff21d36bac2b97e23fa7c39abecfd/ringo-0.5.0.tar.gz", "yanked": false}], "0.6.0": [{"comment_text": "", "digests": {"md5": "2117eb424153d0d1e7a298f921174e4d", "sha256": "24ae8ef8b766a270411b14c3159387334dd202cca4b9f1bd6ef9faad90c181c1"}, "downloads": -1, "filename": "ringo-0.6.0.tar.gz", "has_sig": false, "md5_digest": "2117eb424153d0d1e7a298f921174e4d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 542838, "upload_time": "2013-08-19T21:03:39", "upload_time_iso_8601": "2013-08-19T21:03:39.061463Z", "url": "https://files.pythonhosted.org/packages/aa/44/69ae016664d101bf1422a4732488b5a8810c9d5224be97941fcda038649d/ringo-0.6.0.tar.gz", "yanked": false}], "0.6.2": [{"comment_text": "", "digests": {"md5": "8ff023b1d7d8aff152b3f37c5c24c199", "sha256": "dd115ae9c428a3b4748fc534644df5924307ecc656d395555cef86ace07fcfbc"}, "downloads": -1, "filename": "ringo-0.6.2.tar.gz", "has_sig": false, "md5_digest": "8ff023b1d7d8aff152b3f37c5c24c199", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 547485, "upload_time": "2013-09-23T20:25:49", "upload_time_iso_8601": "2013-09-23T20:25:49.962670Z", "url": "https://files.pythonhosted.org/packages/16/64/d00b4544f8e35eb53578c94ba464937a60b326f5ca98a56d0bcf33211228/ringo-0.6.2.tar.gz", "yanked": false}], "0.6.3": [{"comment_text": "", "digests": {"md5": "6cf6df843bc42d889a9f8e149c28a7d7", "sha256": "fe3d5ef13b2259f08eab0cb0a12b8808e09416258e4042187b910c625e521928"}, "downloads": -1, "filename": "ringo-0.6.3.tar.gz", "has_sig": false, "md5_digest": "6cf6df843bc42d889a9f8e149c28a7d7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 554203, "upload_time": "2013-10-13T19:59:50", "upload_time_iso_8601": "2013-10-13T19:59:50.460780Z", "url": "https://files.pythonhosted.org/packages/49/73/cbb08f44f4ffacd5b26d1041e772df66274040af61aa18a5a2f80405e954/ringo-0.6.3.tar.gz", "yanked": false}], "0.6.4": [{"comment_text": "", "digests": {"md5": "2cfa30f70adef86ad6d4e2add701b7c3", "sha256": "7ad90b3f53b410806a38a9037d272e8eb31e85b9679c0276d9d60af3d7721d14"}, "downloads": -1, "filename": "ringo-0.6.4.tar.gz", "has_sig": false, "md5_digest": "2cfa30f70adef86ad6d4e2add701b7c3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 589437, "upload_time": "2013-11-03T21:31:40", "upload_time_iso_8601": "2013-11-03T21:31:40.262917Z", "url": "https://files.pythonhosted.org/packages/76/dd/05b9beeb5bf87a4ab9ab7f7d5c11818b1eb74c121d1c8c48ff2a8a018369/ringo-0.6.4.tar.gz", "yanked": false}], "0.7.0": [{"comment_text": "", "digests": {"md5": "c316a5c75f7597c96a1f151096e41ac1", "sha256": "6ccda152a26793e6896a51b27b32405f77e1840ac79efe052eb30607d1037d0e"}, "downloads": -1, "filename": "ringo-0.7.0.tar.gz", "has_sig": false, "md5_digest": "c316a5c75f7597c96a1f151096e41ac1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 694698, "upload_time": "2013-11-18T17:33:06", "upload_time_iso_8601": "2013-11-18T17:33:06.870102Z", "url": "https://files.pythonhosted.org/packages/7e/84/e87163fa3420b7ace504cd85da4e267a629e5e20ff8932278c5620d20989/ringo-0.7.0.tar.gz", "yanked": false}], "0.8.0": [{"comment_text": "", "digests": {"md5": "26ac2f748255778b4c30fed0814cd9a7", "sha256": "a8f55cd020d25cbb07dae4759c348b732a1f81bef6ce00b926ab1ebca5fadfb5"}, "downloads": -1, "filename": "ringo-0.8.0.tar.gz", "has_sig": false, "md5_digest": "26ac2f748255778b4c30fed0814cd9a7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 704357, "upload_time": "2013-12-17T23:06:15", "upload_time_iso_8601": "2013-12-17T23:06:15.214097Z", "url": "https://files.pythonhosted.org/packages/15/d3/1318f45125a91cb670932232c1789c3d59e7987cb3493569419dd685c66c/ringo-0.8.0.tar.gz", "yanked": false}], "0.9.0": [{"comment_text": "", "digests": {"md5": "ae753db00faddb6ae9c5b450f71de0a7", "sha256": "fba3b19e91022870c959b78d56eef42e584fd82467325023a57f9e351ef80241"}, "downloads": -1, "filename": "ringo-0.9.0.tar.gz", "has_sig": false, "md5_digest": "ae753db00faddb6ae9c5b450f71de0a7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 720364, "upload_time": "2014-01-14T23:23:14", "upload_time_iso_8601": "2014-01-14T23:23:14.793444Z", "url": "https://files.pythonhosted.org/packages/74/26/339ea497cd70749e3134ebc97f072ac1b63bab3f5fc71116b84876cf21fe/ringo-0.9.0.tar.gz", "yanked": false}], "0.9.2": [{"comment_text": "", "digests": {"md5": "ef84e0d657ababe4f52b149c6c8d7f99", "sha256": "41cf8dab813bb2d15227805993a76be9ff6b607b288177260615787a8f1d5fd5"}, "downloads": -1, "filename": "ringo-0.9.2.tar.gz", "has_sig": false, "md5_digest": "ef84e0d657ababe4f52b149c6c8d7f99", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 871553, "upload_time": "2014-02-09T22:45:25", "upload_time_iso_8601": "2014-02-09T22:45:25.005389Z", "url": "https://files.pythonhosted.org/packages/4a/b6/aced81ccfb12d1b0071601bf2451ff61ab4722d990a1cdaae0b06ebad161/ringo-0.9.2.tar.gz", "yanked": false}], "1.0.0": [{"comment_text": "", "digests": {"md5": "4d2c3029e3fbe92579d70e6b1f08197a", "sha256": "184a818fda9ed966d6bbef4384a2b11ff04a3109b98682b12b954236beac31ec"}, "downloads": -1, "filename": "ringo-1.0.0.tar.gz", "has_sig": false, "md5_digest": "4d2c3029e3fbe92579d70e6b1f08197a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2245741, "upload_time": "2015-03-09T22:38:49", "upload_time_iso_8601": "2015-03-09T22:38:49.025605Z", "url": "https://files.pythonhosted.org/packages/93/c7/682bbf8026fb516d0fab2e13cff60ee69e77f2344cd5999775bb9a07cc08/ringo-1.0.0.tar.gz", "yanked": false}], "1.1.0": [{"comment_text": "", "digests": {"md5": "9083e7ef5398291895993dbc5309de06", "sha256": "f063613fafc2c81a1872c94b7dedc84fd90e651db5da094df31a420f8f00e04a"}, "downloads": -1, "filename": "ringo-1.1.0.tar.gz", "has_sig": false, "md5_digest": "9083e7ef5398291895993dbc5309de06", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1706430, "upload_time": "2015-04-13T18:53:25", "upload_time_iso_8601": "2015-04-13T18:53:25.483445Z", "url": "https://files.pythonhosted.org/packages/e9/7b/b8a63a9cf87b0a30c6fbf05f9feb510a0fc7396b0b63910e7b2c009c4dbb/ringo-1.1.0.tar.gz", "yanked": false}], "1.10.1": [{"comment_text": "", "digests": {"md5": "2b6e3f84e2e5d040b2e9328235b838b9", "sha256": "7edb0be801921db709ac8d986c3c3393c06d9ab94ac360e3eb3c57281759fcc5"}, "downloads": -1, "filename": "ringo-1.10.1.tar.gz", "has_sig": false, "md5_digest": "2b6e3f84e2e5d040b2e9328235b838b9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1054623, "upload_time": "2016-01-08T17:46:51", "upload_time_iso_8601": "2016-01-08T17:46:51.695563Z", "url": "https://files.pythonhosted.org/packages/45/97/7c7f160a99c10a208da82eac8650c4c37ddc8ae0f48b1aef83aadcfddf6b/ringo-1.10.1.tar.gz", "yanked": false}], "1.10.3": [{"comment_text": "", "digests": {"md5": "52d9bb03670a830729acea4636bb5098", "sha256": "4dad571ded8d1e8e094d90576845173419242f196682d90e1534331ef65fa1da"}, "downloads": -1, "filename": "ringo-1.10.3.tar.gz", "has_sig": false, "md5_digest": "52d9bb03670a830729acea4636bb5098", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1058303, "upload_time": "2016-01-20T15:34:01", "upload_time_iso_8601": "2016-01-20T15:34:01.177551Z", "url": "https://files.pythonhosted.org/packages/93/22/f2e2d479b5c6f0b40526419046e065511b69db5b6cc07a3cbd4942d67ede/ringo-1.10.3.tar.gz", "yanked": false}], "1.11.0": [{"comment_text": "", "digests": {"md5": "dd151439f76e5d28a6222282fa33ea34", "sha256": "a847499e7444b61654247c7108a0e25ac1e841faba5531cbe5f9a9342ba50399"}, "downloads": -1, "filename": "ringo-1.11.0.tar.gz", "has_sig": false, "md5_digest": "dd151439f76e5d28a6222282fa33ea34", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1060089, "upload_time": "2016-03-09T08:07:39", "upload_time_iso_8601": "2016-03-09T08:07:39.313885Z", "url": "https://files.pythonhosted.org/packages/81/d8/ddad974b30b693cc135121ac866d8af09c632964907ca146c4d083bbb8a4/ringo-1.11.0.tar.gz", "yanked": false}], "1.11.2": [{"comment_text": "", "digests": {"md5": "e39bd053decb77bd62c87ea7ea6c5223", "sha256": "0cfe12bd2b9a63cc4b9cb2dbef013f070e0457694deb1ef74841edb31d40c553"}, "downloads": -1, "filename": "ringo-1.11.2.tar.gz", "has_sig": false, "md5_digest": "e39bd053decb77bd62c87ea7ea6c5223", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1068001, "upload_time": "2016-04-05T18:01:04", "upload_time_iso_8601": "2016-04-05T18:01:04.764214Z", "url": "https://files.pythonhosted.org/packages/32/fe/d7ab772891157035636ca805bbe349c4ecd6fdc064666b11ef4f4c51a1c5/ringo-1.11.2.tar.gz", "yanked": false}], "1.12.0": [{"comment_text": "", "digests": {"md5": "25dd9b9c4afd3ffb3c09ba81094a0b8a", "sha256": "b653648bc515ac7c94c68586b0cb3c603f60ceb39bed22b20de3ea7dacad7f6b"}, "downloads": -1, "filename": "ringo-1.12.0.tar.gz", "has_sig": false, "md5_digest": "25dd9b9c4afd3ffb3c09ba81094a0b8a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1076944, "upload_time": "2016-04-21T13:43:51", "upload_time_iso_8601": "2016-04-21T13:43:51.143376Z", "url": "https://files.pythonhosted.org/packages/0e/9f/c7a420f7307316a5ad9dc493282631faca53be329e8f1afdfa85923cb153/ringo-1.12.0.tar.gz", "yanked": false}], "1.14.0": [{"comment_text": "", "digests": {"md5": "e54b4aca97cf9d37f6c5fd4d0c7cf95d", "sha256": "f5e4af9eaa8dee20820009eae94c2a40bf285c8696f756c1a838293ee6ba499a"}, "downloads": -1, "filename": "ringo-1.14.0.tar.gz", "has_sig": false, "md5_digest": "e54b4aca97cf9d37f6c5fd4d0c7cf95d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1078890, "upload_time": "2016-09-22T12:06:55", "upload_time_iso_8601": "2016-09-22T12:06:55.719707Z", "url": "https://files.pythonhosted.org/packages/78/48/768757e2ac7217abdc805e439038166e93a39545c37827ff9ac2960776ed/ringo-1.14.0.tar.gz", "yanked": false}], "1.2.1": [{"comment_text": "", "digests": {"md5": "02cf1e6c447faa1340a36c85b6428778", "sha256": "62f31fea6dc129edac442eb9e029db0a0fce1f98305dcff2483e1ba894f2ec6b"}, "downloads": -1, "filename": "ringo-1.2.1.tar.gz", "has_sig": false, "md5_digest": "02cf1e6c447faa1340a36c85b6428778", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2301943, "upload_time": "2015-07-30T14:50:09", "upload_time_iso_8601": "2015-07-30T14:50:09.389695Z", "url": "https://files.pythonhosted.org/packages/06/0d/2065a7390917fcb63ddeb015c8458809922f6d1c77ec102c40442617b5e1/ringo-1.2.1.tar.gz", "yanked": false}], "1.4.0": [{"comment_text": "", "digests": {"md5": "a974ba4ba506187926efb6e6d67bd110", "sha256": "dd62fba7d2344c5b432791657e2201acbc2d13bb66fba4e29c39e2e14cb610a7"}, "downloads": -1, "filename": "ringo-1.4.0.tar.gz", "has_sig": false, "md5_digest": "a974ba4ba506187926efb6e6d67bd110", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2300042, "upload_time": "2015-09-23T09:35:47", "upload_time_iso_8601": "2015-09-23T09:35:47.929574Z", "url": "https://files.pythonhosted.org/packages/82/27/1d4af368eba687aa080dba1f4321931a9fe41a09c4c8c023a3ee77001327/ringo-1.4.0.tar.gz", "yanked": false}], "1.6.0": [{"comment_text": "", "digests": {"md5": "44c5656d6bd4bd2c887c3f3aeb4ceddc", "sha256": "586cdd7948a9a8dbc51fee6200f21922681aeac9f4d8a12e8bbfde023af40f0e"}, "downloads": -1, "filename": "ringo-1.6.0.tar.gz", "has_sig": false, "md5_digest": "44c5656d6bd4bd2c887c3f3aeb4ceddc", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1736418, "upload_time": "2015-10-24T22:00:06", "upload_time_iso_8601": "2015-10-24T22:00:06.073358Z", "url": "https://files.pythonhosted.org/packages/8c/10/29e932eee24fe087eda6d629099309dea1fc06aad72ea7d0747b6366b777/ringo-1.6.0.tar.gz", "yanked": false}], "1.7.0": [{"comment_text": "", "digests": {"md5": "9903978437bee0b84de42b911fd2d08b", "sha256": "0f4a6361f51e3ddc4955569033b6ce78b5e272c48a63a3c05115b5a6884a5326"}, "downloads": -1, "filename": "ringo-1.7.0.tar.gz", "has_sig": false, "md5_digest": "9903978437bee0b84de42b911fd2d08b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1872556, "upload_time": "2015-11-05T20:16:02", "upload_time_iso_8601": "2015-11-05T20:16:02.159195Z", "url": "https://files.pythonhosted.org/packages/65/25/627499573b0a2d1166dd57d54f72699cbc3747a0d5cf24ea37ce6661070e/ringo-1.7.0.tar.gz", "yanked": false}], "1.7.0rc1": [{"comment_text": "", "digests": {"md5": "63e8a8615154e244dab0113ae6a94c6c", "sha256": "a8698112425a47850e89c9d130e47ba9f3ac5411017003fbe11336c47f8b0cf1"}, "downloads": -1, "filename": "ringo-1.7.0rc1.tar.gz", "has_sig": false, "md5_digest": "63e8a8615154e244dab0113ae6a94c6c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1857082, "upload_time": "2015-10-28T18:57:58", "upload_time_iso_8601": "2015-10-28T18:57:58.581230Z", "url": "https://files.pythonhosted.org/packages/82/8c/69e79e9d6ec25a43a3dcf644690ded6c5b066aef10169e49d60dfc1b8da8/ringo-1.7.0rc1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "e54b4aca97cf9d37f6c5fd4d0c7cf95d", "sha256": "f5e4af9eaa8dee20820009eae94c2a40bf285c8696f756c1a838293ee6ba499a"}, "downloads": -1, "filename": "ringo-1.14.0.tar.gz", "has_sig": false, "md5_digest": "e54b4aca97cf9d37f6c5fd4d0c7cf95d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1078890, "upload_time": "2016-09-22T12:06:55", "upload_time_iso_8601": "2016-09-22T12:06:55.719707Z", "url": "https://files.pythonhosted.org/packages/78/48/768757e2ac7217abdc805e439038166e93a39545c37827ff9ac2960776ed/ringo-1.14.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:02:36 2020"}