{"info": {"author": "", "author_email": "", "bugtrack_url": null, "classifiers": [], "description": "For ParlAI software\n\nCopyright (c) 2017-present, Facebook, Inc. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n * Redistributions of source code must retain the above copyright notice, this\n   list of conditions and the following disclaimer.\n\n * Redistributions in binary form must reproduce the above copyright notice,\n   this list of conditions and the following disclaimer in the documentation\n   and/or other materials provided with the distribution.\n\n * Neither the name Facebook nor the names of its contributors may be used to\n   endorse or promote products derived from this software without specific\n   prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\nANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nDescription: <p align=\"center\"><img width=\"70%\" src=\"docs/source/\\_static/img/parlai.png\" /></p>\n        \n        --------------------------------------------------------------------------------\n        \n        ParlAI (pronounced “par-lay”) is a framework for dialog AI research, implemented in Python.\n        \n        Its goal is to provide researchers:\n        - a unified framework for sharing, training and testing dialog models\n        - many popular datasets available all in one place, with the ability to multi-task over them\n        - seamless integration of [Amazon Mechanical Turk](https://www.mturk.com/mturk/welcome) for data collection and human evaluation\n        - integration with [Facebook Messenger](http://www.parl.ai/static/docs/tutorial_messenger.html) to connect agents with humans in a chat interface\n        \n        Many [tasks](https://github.com/facebookresearch/ParlAI/blob/master/parlai/tasks/task_list.py) are supported, including popular datasets such as [SQuAD](https://rajpurkar.github.io/SQuAD-explorer/), [bAbI tasks](https://arxiv.org/abs/1502.05698), [MS MARCO](http://www.msmarco.org/), [MCTest](https://www.microsoft.com/en-us/research/publication/mctest-challenge-dataset-open-domain-machine-comprehension-text/), [WikiQA](https://www.microsoft.com/en-us/download/details.aspx?id=52419), [WebQuestions](http://www.aclweb.org/anthology/D13-1160), [SimpleQuestions](https://arxiv.org/abs/1506.02075), [WikiMovies](https://arxiv.org/abs/1606.03126), [QACNN & QADailyMail](https://arxiv.org/abs/1506.03340), [CBT](https://arxiv.org/abs/1511.02301), [BookTest](https://arxiv.org/abs/1610.00956), [bAbI Dialog tasks](https://arxiv.org/abs/1605.07683), [Ubuntu Dialog](https://arxiv.org/abs/1506.08909), [OpenSubtitles](http://opus.lingfil.uu.se/OpenSubtitles.php), [Cornell Movie](https://www.cs.cornell.edu/~cristian/Cornell_Movie-Dialogs_Corpus.html), [VQA-COCO2014](http://visualqa.org/), [VisDial](https://arxiv.org/abs/1611.08669) and [CLEVR](http://cs.stanford.edu/people/jcjohns/clevr/). See [here](https://github.com/facebookresearch/ParlAI/blob/master/parlai/tasks/task_list.py) for the current complete task list.\n        \n        Included are examples of training neural models with [PyTorch](http://pytorch.org/) and [Lua Torch](http://torch.ch/), with batch training on GPU or hogwild training on CPUs. Using [Tensorflow](https://www.tensorflow.org/) instead is also straightforward.\n        \n        Our aim is for the number of tasks and agents that train on them to grow in a community-based way.\n        \n        ParlAI is described in the following paper:\n        [“ParlAI: A Dialog Research Software Platform\", arXiv:1705.06476](https://arxiv.org/abs/1705.06476).\n        \n        \n        We are in an early-release Beta. Expect some adventures and rough edges.<br>\n        See the [news page](https://github.com/facebookresearch/ParlAI/blob/master/NEWS.md) for the latest additions & updates, and the website [http://parl.ai](http://parl.ai) for further docs.\n        \n        ## Goals\n        \n        Unified framework for evaluation of dialogue models\n        - downloads tasks/datasets on demand and provides the same simple interface to them\n        - unifies dataset input and evaluation frameworks/metrics\n        - `agents/` directory encourages researchers to submit their training code to the repository to share with others\n        - aids reproducibility\n        \n        End goal is general dialogue, which includes many different skills\n        - seamlessly combines simulated and real language tasks\n        - encourages multi-task model development & evaluation\n        - helps to reduce overfitting of models to specific datasets         \n        \n        End goal is real dialogue with people\n        - train and evaluate on live dialogue with humans via Mechanical Turk\n        - easy setup for connecting turkers with your dialogue agent\n        - allow to compare different research groups turk experiments\n        \n        Set of datasets to bootstrap a working dialogue model for human interaction\n        - motivates building new datasets that will go in the repository\n        \n        ## Properties\n        \n        - All datasets look like natural dialogue: a single format / API.\n        - Both fixed datasets (conversation logs) and interactive (online/RL) tasks.\n        - Both real and simulated tasks.\n        - Supports other media, e.g. visual in VQA.\n        - Can use Mechanical Turk to run / collect data / evaluate.\n        - Python framework.\n        - Examples of training with PyTorch.\n        - Uses zmq to talk to other toolboxes not in Python, examples of Lua Torch given.\n        - Supports batch and hogwild training and evaluation of models.\n        \n        ## Basic Examples\n        \n        Note: If any of these examples fail, check the [requirements section](#requirements) to see if you have missed something.\n        \n        Display 10 random examples from task 1 of the \"1k training examples\" bAbI task:\n        ```bash\n        python examples/display_data.py -t babi:task1k:1\n        ```\n        \n        Displays 100 random examples from multi-tasking on the bAbI task and the SQuAD dataset at the same time:\n        ```bash\n        python examples/display_data.py -t babi:task1k:1,squad -ne 100\n        ```\n        \n        Evaluate on the bAbI test set with a human agent (using the local keyboard as input):\n        ```bash\n        python examples/eval_model.py -m local_human -t babi:Task1k:1 -dt valid\n        ```\n        \n        Evaluate an IR baseline model on the validation set of the Movies Subreddit dataset:\n        ```bash\n        python examples/eval_model.py -m ir_baseline -t \"#moviedd-reddit\" -dt valid\n        ```\n        \n        Display the predictions of that same IR baseline model:\n        ```bash\n        python examples/display_model.py -m ir_baseline -t \"#moviedd-reddit\" -dt valid\n        ```\n        \n        Train a seq2seq model on the \"10k training examples\" bAbI task 1 with batch size of 32 examples until accuracy reaches 95% on validation (requires pytorch):\n        ```bash\n        python examples/train_model.py -t babi:task10k:1 -m seq2seq -mf /tmp/model_s2s -bs 32 -vtim 30 -vcut 0.95\n        ```\n        \n        Trains an attentive LSTM model on the SQuAD dataset with a batch size of 32 examples (pytorch and regex):\n        ```bash\n        python examples/train_model.py -m drqa -t squad -bs 32 -mf /tmp/model_drqa\n        ```\n        \n        Tests an existing attentive LSTM model (DrQA reader) on the SQuAD dataset from our model zoo:\n        ```bash\n        python examples/eval_model.py -t squad -mf \"models:drqa/squad/model\"\n        ```\n        \n        ## Requirements\n        \n        ParlAI currently requires Python3.\n        \n        Dependencies of the core modules are listed in requirement.txt.\n        \n        Some models included (in parlai/agents) have additional requirements.\n        \n        ## Installing ParlAI\n        \n        Run the following commands to clone the repository and install ParlAI:\n        \n        ```bash\n        git clone https://github.com/facebookresearch/ParlAI.git ~/ParlAI\n        cd ~/ParlAI; python setup.py develop\n        ```\n        \n        This will link the cloned directory to your site-packages.\n        \n        This is the recommended installation procedure, as it provides ready access to the examples and allows you to modify anything you might need. This is especially useful if you if you want to submit another task to the repository.\n        \n        All needed data will be downloaded to ~/ParlAI/data, and any non-data files (such as the MemNN code) if requested will be downloaded to ~/ParlAI/downloads. If you need to clear out the space used by these files, you can safely delete these directories and any files needed will be downloaded again.\n        \n        ## Worlds, agents and teachers\n        \n        The main concepts (classes) in ParlAI:\n        - world - defines the environment (can be very simple, just two agents talking to each other).\n        - agent – an agent in the world, e.g. the learner. (There can be multiple learners.)\n        - teacher – a type of agent that talks to the learner, implements one of the\n        listed before.\n        \n        After defining a world and the agents in it, a main loop can be run for training, testing or displaying, which calls the function world.parley(). The skeleton of an example main is given in the left panel, and the actual code for parley() on the right.\n        \n        <p align=center><img width=\"100%\" src=\"docs/source/\\_static/img/main.png\" /></p>\n        \n        ## Actions and Observations\n        \n        All agents (including teachers) speak to each other with a single format -- the observation/action object (a python dict).\n        This is used to pass text, labels, rewards, and more between agents.\n        It’s the same object type when talking (acting) or listening (observing), but a different view (i.e. with different values in the fields).\n        \n        The observation/action dict fields are as follows (or see [the documentation](http://parl.ai/static/docs/observations.html)):\n        \n        <p align=center><img width=\"33%\" src=\"docs/source/\\_static/img/act-obs-dict.png\" /></p>\n        \n        Each of these fields are technically optional, depending on your dataset, though the 'text' field will most likely be used in nearly all exchanges.\n        \n        Note: during validation and testing, the labels field is renamed eval_labels – this way, the model won’t accidentally train on the labels, but they are still available for calculating model-side loss.\n        \n        For a fixed supervised learning dataset like bAbI, a typical exchange from the training set might be as follows (the test set would not include labels):\n        \n        ```python\n        Teacher: {\n            'text': 'Sam went to the kitchen\\nPat gave Sam the milk\\nWhere is the milk?',\n            'labels': ['kitchen'],\n            'label_candidates': ['hallway', 'kitchen', 'bathroom'],\n            'episode_done': False\n        }\n        Student: {\n            'text': 'hallway'\n        }\n        Teacher: {\n            'text': 'Sam went to the hallway\\nPat went to the bathroom\\nWhere is the milk?',\n            'labels': ['hallway'],\n            'label_candidates': ['hallway', 'kitchen', 'bathroom'],\n            'episode_done': True\n        }\n        Student: {\n            'text': 'hallway'\n        }\n        Teacher: {\n            ... # starts next episode\n        }\n        ...\n        ```\n        \n        ## Code\n        \n        The code is set up into several main directories:\n        \n        - **core**: contains the primary code for the framework\n        - **agents**: contains agents which can interact with the different tasks (e.g. machine learning models)\n        - **examples**: contains a few basic examples of different loops (building dictionary, train/eval, displaying data)\n        - **tasks**: contains code for the different tasks available from within ParlAI\n        - **mturk**: contains code for setting up Mechanical Turk, as well as sample MTurk tasks\n        - **messenger**: contains code for interfacing with Facebook Messenger\n        - **zoo**: contains code to directly download and use pretrained models from our model zoo\n        \n        Each directory is described in more detail below, ordered by dependencies.\n        \n        ### Core\n        \n        The core library contains the following files:\n        \n        - **agents.py**: this file contains a few basic agents which can be extended by your own model\n          - **_Agent_**: base class for all other agents, implements the act() method which receives an observation table and returns a table in response\n          - **_Teacher_**: child of Agent, also implements the report method for returning metrics. Tasks implement the Teacher class\n          - **_MultiTaskTeacher_**: creates a set of teachers based on a \"task string\" passed to the Teacher, creating multiple teachers within it and alternating between them\n          - create_task_teacher: instantiate a teacher from a given task string (e.g. 'babi:task:1' or 'squad')\n        - **build_data.py**: basic utilities for setting up data for tasks. you can override if your filesystem needs different functionality.\n        - **dict.py**: contains code for building general NLP-style dictionaries from observations\n          - DictionaryAgent: agent which tracks the index and frequency of words in a dictionary, and can parse a sentence into indices into its dictionary or back\n        - **metrics.py**: computes evaluation metrics for dialog, e.g. ranking metrics, etc.\n        - **params.py**: uses argparse to interpret command line arguments for ParlAI\n        - **teachers.py**: contains teachers that deal with dialog-based tasks, as well as data classes for storing data\n          - **_FixedDialogTeacher_**: base class for a teacher that utilizes fixed data\n          - **_DialogTeacher_**: base class for a teacher doing dialog with fixed chat logs\n          - **_FbDialogTeacher_**: a teacher that implements a function `setup_data` that parses data in the FB Dialog data format\n        - **thread_utils.py**: utility classes/functions for use in Hogwild multithreading (multiprocessing)\n          - SharedTable: provides a lock-protected, shared-memory, dictionary-like interface for keeping track of metrics\n        - **worlds.py**: contains a set of basic worlds for tasks to take place inside\n          - **_World_**: base class for all other worlds, implements `parley`, `shutdown`, `__enter__`, and `__exit__`\n          - **_DialogPartnerWorld_**: default world for turn-based two-agent communication\n          - **_MultiAgentDialogWorld_**: round-robin turn-based agent communication for two or more agents\n          - **_HogwildWorld_**: default world for setting up a separate world for every thread when using multiple threads (processes)\n        \n        \n        ### Agents\n        \n        The agents directory contains agents that have been approved into the ParlAI framework for shared use.\n        We encourage you to contribute new ones!\n        Some agents currently available within [this directory](https://github.com/facebookresearch/ParlAI/tree/master/parlai/agents):\n        \n        - **drqa**: an attentive [LSTM model DrQA](https://arxiv.org/abs/1704.00051) implemented in PyTorch that has competitive results on the SQuAD dataset amongst others.\n        - **fairseq**: [an attentive sequence to sequence model using convolutions](https://arxiv.org/abs/1705.03122)\n        - **seq2seq**: a generic seq2seq model with various options\n        - **ibm_seq2seq**: IBM sequence to sequence model\n        - **language_model**: an RNN language model\n        - **memnn**: code for an end-to-end memory network\n        - **mlb_vqa**: a visual question answering model based on [this paper](https://arxiv.org/abs/1610.04325)\n        - **starspace**: a simple supervised embedding approach which is a strong baseline based on [this paper](https://arxiv.org/abs/1709.03856).\n        - **tfidf_retriever** a simple retrieval based model, also useful as a first step for retrieving information as input to another model.\n        - **ir_baseline**: simple information retrieval baseline that scores candidate responses with [TFIDF-weighted](https://en.wikipedia.org/wiki/Tf%E2%80%93idf) matching\n        - **repeat_label**: basic class for merely repeating all data sent to it (e.g. for piping to a file, debugging)\n        - **remote_agent**: basic class for any agent connecting over ZMQ\n        - **local_human**: takes input from the keyboard as the act() function of the agent, so a human can act in the environment\n        \n        See the [directory](https://github.com/facebookresearch/ParlAI/tree/master/parlai/agents) for the complete list.\n        \n        \n        \n        ### Examples\n        \n        [This directory](https://github.com/facebookresearch/ParlAI/tree/master/examples) contains a few particular examples of basic loops.\n        \n        - base_train.py: _very simple example shows the outline of a training/validation loop using the default Agent parent class_\n        - display_data.py: _uses agent.repeat_label to display data from a particular task provided on the command-line_\n        - display_model.py: _shows the predictions of a provided model on a particular task provided on the command-line_\n        - eval_model.py: _uses the named agent to compute evaluation metrics data for a particular task provided on the command-line_\n        - build_dict.py: _build a dictionary from a particular task provided on the command-line using core.dict.DictionaryAgent_\n        \n        ### Tasks\n        \n        Our first release included the following datasets (shown in the left panel), and accessing one of them is as simple as specifying the name of the task as a command line option, as shown in the dataset display utility (right panel):\n        <p align=center><img width=\"100%\" src=\"docs/source/\\_static/img/tasks2.png\" /></p>\n        \n        Over 20 tasks were supported in the first release, including popular datasets such as\n        SQuAD, bAbI tasks, MCTest, WikiQA, WebQuestions, SimpleQuestions, WikiMovies, QACNN, QADailyMail, CBT, BookTest, bAbI Dialog tasks,\n        Ubuntu, OpenSubtitles, Cornell Movie, VQA-COCO2014.\n        Since then, several datasets have been added such as  VQAv2, VisDial, MNIST_QA, Personalized Dialog, InsuranceQA, MS MARCO, TriviaQA, and CLEVR. See [here](https://github.com/facebookresearch/ParlAI/blob/master/parlai/tasks/task_list.py) for the current complete task list.\n        \n        Choosing a task in ParlAI is as easy as specifying it on the command line, as shown in the above image (right). If the dataset has not been used before, ParlAI will automatically download it. As all datasets are treated in the same way in ParlAI (with a single dialog API), a dialog agent can in principle switch training and testing between any of them. Even better, one can specify many tasks at once (multi-tasking) by simply providing a comma-separated list, e.g.  the command line “-t babi,squad”, to use those two datasets, or even all  the QA datasets at once  (-t #qa) or indeed every task in ParlAI at once (-t #all). The aim is to make it easy to build and evaluate very rich dialog models.\n        \n        \n        Each task folder contains:\n        - **build.py** file for setting up data for the task (downloading data, etc, only done the first time requested, and not downloaded if the task is not used).\n        - **agents.py** file which contains default or special teacher classes used by core.create_task to instantiate these classes from command-line arguments (if desired).\n        - **worlds.py** file can optionally be added for tasks that need to define new/complex environments.\n        \n        To add your own task, see the [tutorial](http://www.parl.ai/static/docs/tutorial_task.html).\n        \n        \n        ### MTurk\n        \n        An important part of ParlAI is seamless integration with Mechanical Turk for data collection, training and evaluation.\n        \n        Human Turkers are also viewed as agents in ParlAI and hence person-person, person-bot, or multiple people and bots in group chat can all converse within the standard framework, switching out the roles as desired with no code changes to the agents. This is because Turkers also receive and send via a (pretty printed) version of the same interface, using the fields of the observation/action dict.\n        \n        We currently provide three examples: collecting data, human evaluation of a bot, and round-robin chat between local humans and remote Turkers.\n        \n        <p align=center><img width=\"100%\" src=\"docs/source/\\_static/img/mturk.png\" /></p>\n        \n        The mturk library contains the following directories:\n        \n        - **core**: this directory contains the core code for setting up AWS backend that supports the MTurk chat interface, code for HIT creation and approval, and the wrapper class `MTurkAgent` which encapsulates the MTurk interface into a standard `Agent` class.\n        - **tasks**: this directory contains three sample MTurk tasks.\n          - **_qa\\_data\\_collection_**: get questions and answers from turkers, given a random paragraph from SQuAD.\n          - **_model\\_evaluator_**: ask turkers to evaluate the information retrieval baseline model on the Reddit movie dialog dataset.\n          - **_multi\\_agent\\_dialog_**: round-robin chat between two local human agents and two Turkers.\n        \n        To run an MTurk task:\n        - Go into the directory for the task you want to run.\n        - Run `python run.py -nh <num_hits> -na <num_assignments> -r <reward> [--sandbox]/[--live]`, with `<num_hits>`, `<num_assignments>` and `<reward>` set appropriately. Use `--sandbox` to run the task in MTurk sandbox mode before pushing it live.\n        \n        To add your own MTurk task:\n        - create a new folder within the mturk/tasks directory for your new task\n        - implement __task\\_config.py__, with at least the following fields in the `task_config` dictionary:\n          - `hit_title`: a short and descriptive title about the kind of task the HIT contains. On the Amazon Mechanical Turk web site, the HIT title appears in search results, and everywhere the HIT is mentioned.\n          - `hit_description`: a description includes detailed information about the kind of task the HIT contains. On the Amazon Mechanical Turk web site, the HIT description appears in the expanded view of search results, and in the HIT and assignment screens.\n          - `hit_keywords`: one or more words or phrases that describe the HIT, separated by commas. On MTurk website, these words are used in searches to find HITs.\n          - `task_description`: a detailed task description that will be shown on the HIT task preview page and on the left side of the chat page. Supports HTML formatting.\n        - implement __run.py__, with code for setting up and running the world where `MTurkAgent` lives in.\n        - (Optional) implement __worlds.py__, with a world class that extends from `World`.\n        \n        Please see [the MTurk tutorial](http://parl.ai/static/docs/mturk.html) to learn more about the MTurk examples and how to create and run your own task.\n        \n        ### Messenger\n        \n        Please see [the Facebook Messenger tutorial](http://parl.ai/static/docs/tutorial_messenger.html) to learn more about how to use ParlAI with Facebook Messenger.\n        \n        \n        ## Support\n        If you have any questions, bug reports or feature requests, please don't hesitate to post on our [Github Issues page](https://github.com/facebookresearch/ParlAI/issues).\n        \n        ## The Team\n        ParlAI is currently maintained by Emily Dinan, Alexander H. Miller, Stephen Roller, Kurt Shuster, Jack Urbanek and Jason Weston.\n        A non-exhaustive list of other major contributors includes:\n        Will Feng, Adam Fisch, Jiasen Lu, Antoine Bordes, Devi Parikh, Dhruv Batra,\n        Filipe de Avila Belbute Peres and Chao Pan.\n        \n        ## Citation\n        \n        Please cite the [arXiv paper](https://arxiv.org/abs/1705.06476) if you use ParlAI in your work:\n        \n        ```\n        @article{miller2017parlai,\n          title={ParlAI: A Dialog Research Software Platform},\n          author={{Miller}, A.~H. and {Feng}, W. and {Fisch}, A. and {Lu}, J. and {Batra}, D. and {Bordes}, A. and {Parikh}, D. and {Weston}, J.},\n          journal={arXiv preprint arXiv:{1705.06476}},\n          year={2017}\n        }\n        ```\n        \n        ## License\n        ParlAI is BSD-licensed. We also provide an additional patent grant.\n        \nPlatform: UNKNOWN\n", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://parl.ai/", "keywords": "", "license": "BSD License", "maintainer": "", "maintainer_email": "", "name": "roboy-parlai", "package_url": "https://pypi.org/project/roboy-parlai/", "platform": "", "project_url": "https://pypi.org/project/roboy-parlai/", "project_urls": {"Homepage": "http://parl.ai/"}, "release_url": "https://pypi.org/project/roboy-parlai/0.1.post3/", "requires_dist": ["requests", "numpy", "Pillow", "pyzmq", "h5py", "gitpython", "torchtext", "stop-words"], "requires_python": "", "summary": "Unified API for accessing dialog datasets.", "version": "0.1.post3", "yanked": false, "html_description": "<div class=\"project-description\">\n            For ParlAI software<br><br>Copyright (c) 2017-present, Facebook, Inc. All rights reserved.<br><br>Redistribution and use in source and binary forms, with or without modification,<br>are permitted provided that the following conditions are met:<br><br> * Redistributions of source code must retain the above copyright notice, this<br>   list of conditions and the following disclaimer.<br><br> * Redistributions in binary form must reproduce the above copyright notice,<br>   this list of conditions and the following disclaimer in the documentation<br>   and/or other materials provided with the distribution.<br><br> * Neither the name Facebook nor the names of its contributors may be used to<br>   endorse or promote products derived from this software without specific<br>   prior written permission.<br><br>THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND<br>ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED<br>WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE<br>DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR<br>ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES<br>(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;<br>LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON<br>ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT<br>(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS<br>SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.<br><br>Description: &lt;p align=\"center\"&gt;&lt;img width=\"70%\" src=\"docs/source/\\_static/img/parlai.png\" /&gt;&lt;/p&gt;<br>        <br>        --------------------------------------------------------------------------------<br>        <br>        ParlAI (pronounced “par-lay”) is a framework for dialog AI research, implemented in Python.<br>        <br>        Its goal is to provide researchers:<br>        - a unified framework for sharing, training and testing dialog models<br>        - many popular datasets available all in one place, with the ability to multi-task over them<br>        - seamless integration of [Amazon Mechanical Turk](https://www.mturk.com/mturk/welcome) for data collection and human evaluation<br>        - integration with [Facebook Messenger](http://www.parl.ai/static/docs/tutorial_messenger.html) to connect agents with humans in a chat interface<br>        <br>        Many [tasks](https://github.com/facebookresearch/ParlAI/blob/master/parlai/tasks/task_list.py) are supported, including popular datasets such as [SQuAD](https://rajpurkar.github.io/SQuAD-explorer/), [bAbI tasks](https://arxiv.org/abs/1502.05698), [MS MARCO](http://www.msmarco.org/), [MCTest](https://www.microsoft.com/en-us/research/publication/mctest-challenge-dataset-open-domain-machine-comprehension-text/), [WikiQA](https://www.microsoft.com/en-us/download/details.aspx?id=52419), [WebQuestions](http://www.aclweb.org/anthology/D13-1160), [SimpleQuestions](https://arxiv.org/abs/1506.02075), [WikiMovies](https://arxiv.org/abs/1606.03126), [QACNN &amp; QADailyMail](https://arxiv.org/abs/1506.03340), [CBT](https://arxiv.org/abs/1511.02301), [BookTest](https://arxiv.org/abs/1610.00956), [bAbI Dialog tasks](https://arxiv.org/abs/1605.07683), [Ubuntu Dialog](https://arxiv.org/abs/1506.08909), [OpenSubtitles](http://opus.lingfil.uu.se/OpenSubtitles.php), [Cornell Movie](https://www.cs.cornell.edu/~cristian/Cornell_Movie-Dialogs_Corpus.html), [VQA-COCO2014](http://visualqa.org/), [VisDial](https://arxiv.org/abs/1611.08669) and [CLEVR](http://cs.stanford.edu/people/jcjohns/clevr/). See [here](https://github.com/facebookresearch/ParlAI/blob/master/parlai/tasks/task_list.py) for the current complete task list.<br>        <br>        Included are examples of training neural models with [PyTorch](http://pytorch.org/) and [Lua Torch](http://torch.ch/), with batch training on GPU or hogwild training on CPUs. Using [Tensorflow](https://www.tensorflow.org/) instead is also straightforward.<br>        <br>        Our aim is for the number of tasks and agents that train on them to grow in a community-based way.<br>        <br>        ParlAI is described in the following paper:<br>        [“ParlAI: A Dialog Research Software Platform\", arXiv:1705.06476](https://arxiv.org/abs/1705.06476).<br>        <br>        <br>        We are in an early-release Beta. Expect some adventures and rough edges.&lt;br&gt;<br>        See the [news page](https://github.com/facebookresearch/ParlAI/blob/master/NEWS.md) for the latest additions &amp; updates, and the website [http://parl.ai](http://parl.ai) for further docs.<br>        <br>        ## Goals<br>        <br>        Unified framework for evaluation of dialogue models<br>        - downloads tasks/datasets on demand and provides the same simple interface to them<br>        - unifies dataset input and evaluation frameworks/metrics<br>        - `agents/` directory encourages researchers to submit their training code to the repository to share with others<br>        - aids reproducibility<br>        <br>        End goal is general dialogue, which includes many different skills<br>        - seamlessly combines simulated and real language tasks<br>        - encourages multi-task model development &amp; evaluation<br>        - helps to reduce overfitting of models to specific datasets         <br>        <br>        End goal is real dialogue with people<br>        - train and evaluate on live dialogue with humans via Mechanical Turk<br>        - easy setup for connecting turkers with your dialogue agent<br>        - allow to compare different research groups turk experiments<br>        <br>        Set of datasets to bootstrap a working dialogue model for human interaction<br>        - motivates building new datasets that will go in the repository<br>        <br>        ## Properties<br>        <br>        - All datasets look like natural dialogue: a single format / API.<br>        - Both fixed datasets (conversation logs) and interactive (online/RL) tasks.<br>        - Both real and simulated tasks.<br>        - Supports other media, e.g. visual in VQA.<br>        - Can use Mechanical Turk to run / collect data / evaluate.<br>        - Python framework.<br>        - Examples of training with PyTorch.<br>        - Uses zmq to talk to other toolboxes not in Python, examples of Lua Torch given.<br>        - Supports batch and hogwild training and evaluation of models.<br>        <br>        ## Basic Examples<br>        <br>        Note: If any of these examples fail, check the [requirements section](#requirements) to see if you have missed something.<br>        <br>        Display 10 random examples from task 1 of the \"1k training examples\" bAbI task:<br>        ```bash<br>        python examples/display_data.py -t babi:task1k:1<br>        ```<br>        <br>        Displays 100 random examples from multi-tasking on the bAbI task and the SQuAD dataset at the same time:<br>        ```bash<br>        python examples/display_data.py -t babi:task1k:1,squad -ne 100<br>        ```<br>        <br>        Evaluate on the bAbI test set with a human agent (using the local keyboard as input):<br>        ```bash<br>        python examples/eval_model.py -m local_human -t babi:Task1k:1 -dt valid<br>        ```<br>        <br>        Evaluate an IR baseline model on the validation set of the Movies Subreddit dataset:<br>        ```bash<br>        python examples/eval_model.py -m ir_baseline -t \"#moviedd-reddit\" -dt valid<br>        ```<br>        <br>        Display the predictions of that same IR baseline model:<br>        ```bash<br>        python examples/display_model.py -m ir_baseline -t \"#moviedd-reddit\" -dt valid<br>        ```<br>        <br>        Train a seq2seq model on the \"10k training examples\" bAbI task 1 with batch size of 32 examples until accuracy reaches 95% on validation (requires pytorch):<br>        ```bash<br>        python examples/train_model.py -t babi:task10k:1 -m seq2seq -mf /tmp/model_s2s -bs 32 -vtim 30 -vcut 0.95<br>        ```<br>        <br>        Trains an attentive LSTM model on the SQuAD dataset with a batch size of 32 examples (pytorch and regex):<br>        ```bash<br>        python examples/train_model.py -m drqa -t squad -bs 32 -mf /tmp/model_drqa<br>        ```<br>        <br>        Tests an existing attentive LSTM model (DrQA reader) on the SQuAD dataset from our model zoo:<br>        ```bash<br>        python examples/eval_model.py -t squad -mf \"models:drqa/squad/model\"<br>        ```<br>        <br>        ## Requirements<br>        <br>        ParlAI currently requires Python3.<br>        <br>        Dependencies of the core modules are listed in requirement.txt.<br>        <br>        Some models included (in parlai/agents) have additional requirements.<br>        <br>        ## Installing ParlAI<br>        <br>        Run the following commands to clone the repository and install ParlAI:<br>        <br>        ```bash<br>        git clone https://github.com/facebookresearch/ParlAI.git ~/ParlAI<br>        cd ~/ParlAI; python setup.py develop<br>        ```<br>        <br>        This will link the cloned directory to your site-packages.<br>        <br>        This is the recommended installation procedure, as it provides ready access to the examples and allows you to modify anything you might need. This is especially useful if you if you want to submit another task to the repository.<br>        <br>        All needed data will be downloaded to ~/ParlAI/data, and any non-data files (such as the MemNN code) if requested will be downloaded to ~/ParlAI/downloads. If you need to clear out the space used by these files, you can safely delete these directories and any files needed will be downloaded again.<br>        <br>        ## Worlds, agents and teachers<br>        <br>        The main concepts (classes) in ParlAI:<br>        - world - defines the environment (can be very simple, just two agents talking to each other).<br>        - agent – an agent in the world, e.g. the learner. (There can be multiple learners.)<br>        - teacher – a type of agent that talks to the learner, implements one of the<br>        listed before.<br>        <br>        After defining a world and the agents in it, a main loop can be run for training, testing or displaying, which calls the function world.parley(). The skeleton of an example main is given in the left panel, and the actual code for parley() on the right.<br>        <br>        &lt;p align=center&gt;&lt;img width=\"100%\" src=\"docs/source/\\_static/img/main.png\" /&gt;&lt;/p&gt;<br>        <br>        ## Actions and Observations<br>        <br>        All agents (including teachers) speak to each other with a single format -- the observation/action object (a python dict).<br>        This is used to pass text, labels, rewards, and more between agents.<br>        It’s the same object type when talking (acting) or listening (observing), but a different view (i.e. with different values in the fields).<br>        <br>        The observation/action dict fields are as follows (or see [the documentation](http://parl.ai/static/docs/observations.html)):<br>        <br>        &lt;p align=center&gt;&lt;img width=\"33%\" src=\"docs/source/\\_static/img/act-obs-dict.png\" /&gt;&lt;/p&gt;<br>        <br>        Each of these fields are technically optional, depending on your dataset, though the 'text' field will most likely be used in nearly all exchanges.<br>        <br>        Note: during validation and testing, the labels field is renamed eval_labels – this way, the model won’t accidentally train on the labels, but they are still available for calculating model-side loss.<br>        <br>        For a fixed supervised learning dataset like bAbI, a typical exchange from the training set might be as follows (the test set would not include labels):<br>        <br>        ```python<br>        Teacher: {<br>            'text': 'Sam went to the kitchen\\nPat gave Sam the milk\\nWhere is the milk?',<br>            'labels': ['kitchen'],<br>            'label_candidates': ['hallway', 'kitchen', 'bathroom'],<br>            'episode_done': False<br>        }<br>        Student: {<br>            'text': 'hallway'<br>        }<br>        Teacher: {<br>            'text': 'Sam went to the hallway\\nPat went to the bathroom\\nWhere is the milk?',<br>            'labels': ['hallway'],<br>            'label_candidates': ['hallway', 'kitchen', 'bathroom'],<br>            'episode_done': True<br>        }<br>        Student: {<br>            'text': 'hallway'<br>        }<br>        Teacher: {<br>            ... # starts next episode<br>        }<br>        ...<br>        ```<br>        <br>        ## Code<br>        <br>        The code is set up into several main directories:<br>        <br>        - **core**: contains the primary code for the framework<br>        - **agents**: contains agents which can interact with the different tasks (e.g. machine learning models)<br>        - **examples**: contains a few basic examples of different loops (building dictionary, train/eval, displaying data)<br>        - **tasks**: contains code for the different tasks available from within ParlAI<br>        - **mturk**: contains code for setting up Mechanical Turk, as well as sample MTurk tasks<br>        - **messenger**: contains code for interfacing with Facebook Messenger<br>        - **zoo**: contains code to directly download and use pretrained models from our model zoo<br>        <br>        Each directory is described in more detail below, ordered by dependencies.<br>        <br>        ### Core<br>        <br>        The core library contains the following files:<br>        <br>        - **agents.py**: this file contains a few basic agents which can be extended by your own model<br>          - **_Agent_**: base class for all other agents, implements the act() method which receives an observation table and returns a table in response<br>          - **_Teacher_**: child of Agent, also implements the report method for returning metrics. Tasks implement the Teacher class<br>          - **_MultiTaskTeacher_**: creates a set of teachers based on a \"task string\" passed to the Teacher, creating multiple teachers within it and alternating between them<br>          - create_task_teacher: instantiate a teacher from a given task string (e.g. 'babi:task:1' or 'squad')<br>        - **build_data.py**: basic utilities for setting up data for tasks. you can override if your filesystem needs different functionality.<br>        - **dict.py**: contains code for building general NLP-style dictionaries from observations<br>          - DictionaryAgent: agent which tracks the index and frequency of words in a dictionary, and can parse a sentence into indices into its dictionary or back<br>        - **metrics.py**: computes evaluation metrics for dialog, e.g. ranking metrics, etc.<br>        - **params.py**: uses argparse to interpret command line arguments for ParlAI<br>        - **teachers.py**: contains teachers that deal with dialog-based tasks, as well as data classes for storing data<br>          - **_FixedDialogTeacher_**: base class for a teacher that utilizes fixed data<br>          - **_DialogTeacher_**: base class for a teacher doing dialog with fixed chat logs<br>          - **_FbDialogTeacher_**: a teacher that implements a function `setup_data` that parses data in the FB Dialog data format<br>        - **thread_utils.py**: utility classes/functions for use in Hogwild multithreading (multiprocessing)<br>          - SharedTable: provides a lock-protected, shared-memory, dictionary-like interface for keeping track of metrics<br>        - **worlds.py**: contains a set of basic worlds for tasks to take place inside<br>          - **_World_**: base class for all other worlds, implements `parley`, `shutdown`, `__enter__`, and `__exit__`<br>          - **_DialogPartnerWorld_**: default world for turn-based two-agent communication<br>          - **_MultiAgentDialogWorld_**: round-robin turn-based agent communication for two or more agents<br>          - **_HogwildWorld_**: default world for setting up a separate world for every thread when using multiple threads (processes)<br>        <br>        <br>        ### Agents<br>        <br>        The agents directory contains agents that have been approved into the ParlAI framework for shared use.<br>        We encourage you to contribute new ones!<br>        Some agents currently available within [this directory](https://github.com/facebookresearch/ParlAI/tree/master/parlai/agents):<br>        <br>        - **drqa**: an attentive [LSTM model DrQA](https://arxiv.org/abs/1704.00051) implemented in PyTorch that has competitive results on the SQuAD dataset amongst others.<br>        - **fairseq**: [an attentive sequence to sequence model using convolutions](https://arxiv.org/abs/1705.03122)<br>        - **seq2seq**: a generic seq2seq model with various options<br>        - **ibm_seq2seq**: IBM sequence to sequence model<br>        - **language_model**: an RNN language model<br>        - **memnn**: code for an end-to-end memory network<br>        - **mlb_vqa**: a visual question answering model based on [this paper](https://arxiv.org/abs/1610.04325)<br>        - **starspace**: a simple supervised embedding approach which is a strong baseline based on [this paper](https://arxiv.org/abs/1709.03856).<br>        - **tfidf_retriever** a simple retrieval based model, also useful as a first step for retrieving information as input to another model.<br>        - **ir_baseline**: simple information retrieval baseline that scores candidate responses with [TFIDF-weighted](https://en.wikipedia.org/wiki/Tf%E2%80%93idf) matching<br>        - **repeat_label**: basic class for merely repeating all data sent to it (e.g. for piping to a file, debugging)<br>        - **remote_agent**: basic class for any agent connecting over ZMQ<br>        - **local_human**: takes input from the keyboard as the act() function of the agent, so a human can act in the environment<br>        <br>        See the [directory](https://github.com/facebookresearch/ParlAI/tree/master/parlai/agents) for the complete list.<br>        <br>        <br>        <br>        ### Examples<br>        <br>        [This directory](https://github.com/facebookresearch/ParlAI/tree/master/examples) contains a few particular examples of basic loops.<br>        <br>        - base_train.py: _very simple example shows the outline of a training/validation loop using the default Agent parent class_<br>        - display_data.py: _uses agent.repeat_label to display data from a particular task provided on the command-line_<br>        - display_model.py: _shows the predictions of a provided model on a particular task provided on the command-line_<br>        - eval_model.py: _uses the named agent to compute evaluation metrics data for a particular task provided on the command-line_<br>        - build_dict.py: _build a dictionary from a particular task provided on the command-line using core.dict.DictionaryAgent_<br>        <br>        ### Tasks<br>        <br>        Our first release included the following datasets (shown in the left panel), and accessing one of them is as simple as specifying the name of the task as a command line option, as shown in the dataset display utility (right panel):<br>        &lt;p align=center&gt;&lt;img width=\"100%\" src=\"docs/source/\\_static/img/tasks2.png\" /&gt;&lt;/p&gt;<br>        <br>        Over 20 tasks were supported in the first release, including popular datasets such as<br>        SQuAD, bAbI tasks, MCTest, WikiQA, WebQuestions, SimpleQuestions, WikiMovies, QACNN, QADailyMail, CBT, BookTest, bAbI Dialog tasks,<br>        Ubuntu, OpenSubtitles, Cornell Movie, VQA-COCO2014.<br>        Since then, several datasets have been added such as  VQAv2, VisDial, MNIST_QA, Personalized Dialog, InsuranceQA, MS MARCO, TriviaQA, and CLEVR. See [here](https://github.com/facebookresearch/ParlAI/blob/master/parlai/tasks/task_list.py) for the current complete task list.<br>        <br>        Choosing a task in ParlAI is as easy as specifying it on the command line, as shown in the above image (right). If the dataset has not been used before, ParlAI will automatically download it. As all datasets are treated in the same way in ParlAI (with a single dialog API), a dialog agent can in principle switch training and testing between any of them. Even better, one can specify many tasks at once (multi-tasking) by simply providing a comma-separated list, e.g.  the command line “-t babi,squad”, to use those two datasets, or even all  the QA datasets at once  (-t #qa) or indeed every task in ParlAI at once (-t #all). The aim is to make it easy to build and evaluate very rich dialog models.<br>        <br>        <br>        Each task folder contains:<br>        - **build.py** file for setting up data for the task (downloading data, etc, only done the first time requested, and not downloaded if the task is not used).<br>        - **agents.py** file which contains default or special teacher classes used by core.create_task to instantiate these classes from command-line arguments (if desired).<br>        - **worlds.py** file can optionally be added for tasks that need to define new/complex environments.<br>        <br>        To add your own task, see the [tutorial](http://www.parl.ai/static/docs/tutorial_task.html).<br>        <br>        <br>        ### MTurk<br>        <br>        An important part of ParlAI is seamless integration with Mechanical Turk for data collection, training and evaluation.<br>        <br>        Human Turkers are also viewed as agents in ParlAI and hence person-person, person-bot, or multiple people and bots in group chat can all converse within the standard framework, switching out the roles as desired with no code changes to the agents. This is because Turkers also receive and send via a (pretty printed) version of the same interface, using the fields of the observation/action dict.<br>        <br>        We currently provide three examples: collecting data, human evaluation of a bot, and round-robin chat between local humans and remote Turkers.<br>        <br>        &lt;p align=center&gt;&lt;img width=\"100%\" src=\"docs/source/\\_static/img/mturk.png\" /&gt;&lt;/p&gt;<br>        <br>        The mturk library contains the following directories:<br>        <br>        - **core**: this directory contains the core code for setting up AWS backend that supports the MTurk chat interface, code for HIT creation and approval, and the wrapper class `MTurkAgent` which encapsulates the MTurk interface into a standard `Agent` class.<br>        - **tasks**: this directory contains three sample MTurk tasks.<br>          - **_qa\\_data\\_collection_**: get questions and answers from turkers, given a random paragraph from SQuAD.<br>          - **_model\\_evaluator_**: ask turkers to evaluate the information retrieval baseline model on the Reddit movie dialog dataset.<br>          - **_multi\\_agent\\_dialog_**: round-robin chat between two local human agents and two Turkers.<br>        <br>        To run an MTurk task:<br>        - Go into the directory for the task you want to run.<br>        - Run `python run.py -nh &lt;num_hits&gt; -na &lt;num_assignments&gt; -r &lt;reward&gt; [--sandbox]/[--live]`, with `&lt;num_hits&gt;`, `&lt;num_assignments&gt;` and `&lt;reward&gt;` set appropriately. Use `--sandbox` to run the task in MTurk sandbox mode before pushing it live.<br>        <br>        To add your own MTurk task:<br>        - create a new folder within the mturk/tasks directory for your new task<br>        - implement __task\\_config.py__, with at least the following fields in the `task_config` dictionary:<br>          - `hit_title`: a short and descriptive title about the kind of task the HIT contains. On the Amazon Mechanical Turk web site, the HIT title appears in search results, and everywhere the HIT is mentioned.<br>          - `hit_description`: a description includes detailed information about the kind of task the HIT contains. On the Amazon Mechanical Turk web site, the HIT description appears in the expanded view of search results, and in the HIT and assignment screens.<br>          - `hit_keywords`: one or more words or phrases that describe the HIT, separated by commas. On MTurk website, these words are used in searches to find HITs.<br>          - `task_description`: a detailed task description that will be shown on the HIT task preview page and on the left side of the chat page. Supports HTML formatting.<br>        - implement __run.py__, with code for setting up and running the world where `MTurkAgent` lives in.<br>        - (Optional) implement __worlds.py__, with a world class that extends from `World`.<br>        <br>        Please see [the MTurk tutorial](http://parl.ai/static/docs/mturk.html) to learn more about the MTurk examples and how to create and run your own task.<br>        <br>        ### Messenger<br>        <br>        Please see [the Facebook Messenger tutorial](http://parl.ai/static/docs/tutorial_messenger.html) to learn more about how to use ParlAI with Facebook Messenger.<br>        <br>        <br>        ## Support<br>        If you have any questions, bug reports or feature requests, please don't hesitate to post on our [Github Issues page](https://github.com/facebookresearch/ParlAI/issues).<br>        <br>        ## The Team<br>        ParlAI is currently maintained by Emily Dinan, Alexander H. Miller, Stephen Roller, Kurt Shuster, Jack Urbanek and Jason Weston.<br>        A non-exhaustive list of other major contributors includes:<br>        Will Feng, Adam Fisch, Jiasen Lu, Antoine Bordes, Devi Parikh, Dhruv Batra,<br>        Filipe de Avila Belbute Peres and Chao Pan.<br>        <br>        ## Citation<br>        <br>        Please cite the [arXiv paper](https://arxiv.org/abs/1705.06476) if you use ParlAI in your work:<br>        <br>        ```<br>        @article{miller2017parlai,<br>          title={ParlAI: A Dialog Research Software Platform},<br>          author={{Miller}, A.~H. and {Feng}, W. and {Fisch}, A. and {Lu}, J. and {Batra}, D. and {Bordes}, A. and {Parikh}, D. and {Weston}, J.},<br>          journal={arXiv preprint arXiv:{1705.06476}},<br>          year={2017}<br>        }<br>        ```<br>        <br>        ## License<br>        ParlAI is BSD-licensed. We also provide an additional patent grant.<br>        <br>Platform: UNKNOWN<br>\n          </div>"}, "last_serial": 4553947, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "137eab387e2a0fc8b9004a6d837718c3", "sha256": "bd2d3519526160e4f8abfc5f3c5c4244f6c25e9dd26c4d2e2a326403e5689520"}, "downloads": -1, "filename": "roboy_parlai-0.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "137eab387e2a0fc8b9004a6d837718c3", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 873072, "upload_time": "2018-12-02T23:08:21", "upload_time_iso_8601": "2018-12-02T23:08:21.833992Z", "url": "https://files.pythonhosted.org/packages/58/1e/1effaabefc4ea31f19c99d027b0577c13d3fecbaa3706a4d6460744c300a/roboy_parlai-0.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d69f2ee50d7e71e09c4c6bc337f61305", "sha256": "1ef82e1ce9b94703987d150ace0216e783b0e85f63b6ce1e00e7f20ca656f903"}, "downloads": -1, "filename": "roboy_parlai-0.1.0.tar.gz", "has_sig": false, "md5_digest": "d69f2ee50d7e71e09c4c6bc337f61305", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 627369, "upload_time": "2018-12-02T23:08:26", "upload_time_iso_8601": "2018-12-02T23:08:26.479347Z", "url": "https://files.pythonhosted.org/packages/6b/13/57b4349eff3d3d5f50f20473abbcbcd1423c9be69562c9131d3cde3eba89/roboy_parlai-0.1.0.tar.gz", "yanked": false}], "0.1.post1": [{"comment_text": "", "digests": {"md5": "e29924935510baff59863ce9c6a0739e", "sha256": "4a48d1fb776fdc02d4749d71dcbf9edc84ab5d4cb8bc79d4857a9a23c0fdce83"}, "downloads": -1, "filename": "roboy_parlai-0.1.post1-py3-none-any.whl", "has_sig": false, "md5_digest": "e29924935510baff59863ce9c6a0739e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 835314, "upload_time": "2018-12-02T23:33:06", "upload_time_iso_8601": "2018-12-02T23:33:06.243576Z", "url": "https://files.pythonhosted.org/packages/a4/e5/751cbae20d9e009b30a0dac8c0b98fbb533fad4040a62c5b2b0143f57898/roboy_parlai-0.1.post1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "2d53f1d20c5565950ec6bbd7d7cb5713", "sha256": "462393eee8c18ef2c818d125c17b265ce9810007b821133eb052f0b1e25ff11f"}, "downloads": -1, "filename": "roboy_parlai-0.1.post1.tar.gz", "has_sig": false, "md5_digest": "2d53f1d20c5565950ec6bbd7d7cb5713", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 651542, "upload_time": "2018-12-02T23:33:10", "upload_time_iso_8601": "2018-12-02T23:33:10.278367Z", "url": "https://files.pythonhosted.org/packages/d5/3c/9a179bcefd5ee4f0f409960315c98e2e46c5aac1c6af8dc62529faafe7c7/roboy_parlai-0.1.post1.tar.gz", "yanked": false}], "0.1.post2": [{"comment_text": "", "digests": {"md5": "99ce9cd3e0f8863941f0b85922c4b672", "sha256": "b326988566975c9ad670d2717f93eb97f002571a27492b0949c30f8eaa29bc33"}, "downloads": -1, "filename": "roboy_parlai-0.1.post2-py3-none-any.whl", "has_sig": false, "md5_digest": "99ce9cd3e0f8863941f0b85922c4b672", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 835311, "upload_time": "2018-12-02T23:43:24", "upload_time_iso_8601": "2018-12-02T23:43:24.832169Z", "url": "https://files.pythonhosted.org/packages/60/fb/c66afc760cad2a22d03a8a3834531ef31a9524bde2579c28f2c12f5269ec/roboy_parlai-0.1.post2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e16e6b3513a8e777a6f13f551c7c5346", "sha256": "1fe4e02e490ef0d77ee4ccd61c70ecc09e8edfa00134d28c4a23c459c0711b26"}, "downloads": -1, "filename": "roboy_parlai-0.1.post2.tar.gz", "has_sig": false, "md5_digest": "e16e6b3513a8e777a6f13f551c7c5346", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 651542, "upload_time": "2018-12-02T23:43:28", "upload_time_iso_8601": "2018-12-02T23:43:28.853632Z", "url": "https://files.pythonhosted.org/packages/8f/8a/d624cb965f37da5fd9994610c3515a50d02133813b20a5e875fe59ae5b33/roboy_parlai-0.1.post2.tar.gz", "yanked": false}], "0.1.post3": [{"comment_text": "", "digests": {"md5": "a2dcade008835f30ea13392d55d02e68", "sha256": "cb72df77802167eabe944936db71883cfaf883c4d07a49b3b7d5460a006c4d63"}, "downloads": -1, "filename": "roboy_parlai-0.1.post3-py3-none-any.whl", "has_sig": false, "md5_digest": "a2dcade008835f30ea13392d55d02e68", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 835272, "upload_time": "2018-12-02T23:51:35", "upload_time_iso_8601": "2018-12-02T23:51:35.430390Z", "url": "https://files.pythonhosted.org/packages/50/53/2299899dd49215a88ce1ad373cb7eab21c79844821d902cde6bb62b67a98/roboy_parlai-0.1.post3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4aefa47814c115ba5201664472c753f4", "sha256": "a5c22115b0efe3c062644405a8088ef75d405df7077f596d843873daf1c7a4a8"}, "downloads": -1, "filename": "roboy_parlai-0.1.post3.tar.gz", "has_sig": false, "md5_digest": "4aefa47814c115ba5201664472c753f4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 651513, "upload_time": "2018-12-02T23:51:42", "upload_time_iso_8601": "2018-12-02T23:51:42.285051Z", "url": "https://files.pythonhosted.org/packages/cc/23/524f03e05aded0c35291a93bc01de450a2b7bff5d80e7b03a761f398dce3/roboy_parlai-0.1.post3.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "a2dcade008835f30ea13392d55d02e68", "sha256": "cb72df77802167eabe944936db71883cfaf883c4d07a49b3b7d5460a006c4d63"}, "downloads": -1, "filename": "roboy_parlai-0.1.post3-py3-none-any.whl", "has_sig": false, "md5_digest": "a2dcade008835f30ea13392d55d02e68", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 835272, "upload_time": "2018-12-02T23:51:35", "upload_time_iso_8601": "2018-12-02T23:51:35.430390Z", "url": "https://files.pythonhosted.org/packages/50/53/2299899dd49215a88ce1ad373cb7eab21c79844821d902cde6bb62b67a98/roboy_parlai-0.1.post3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4aefa47814c115ba5201664472c753f4", "sha256": "a5c22115b0efe3c062644405a8088ef75d405df7077f596d843873daf1c7a4a8"}, "downloads": -1, "filename": "roboy_parlai-0.1.post3.tar.gz", "has_sig": false, "md5_digest": "4aefa47814c115ba5201664472c753f4", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 651513, "upload_time": "2018-12-02T23:51:42", "upload_time_iso_8601": "2018-12-02T23:51:42.285051Z", "url": "https://files.pythonhosted.org/packages/cc/23/524f03e05aded0c35291a93bc01de450a2b7bff5d80e7b03a761f398dce3/roboy_parlai-0.1.post3.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:01:38 2020"}