{"info": {"author": "Stuart Farmer", "author_email": "stuart@lamden.io", "bugtrack_url": null, "classifiers": [], "description": "", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://www.github.com/Lamden/rocks", "keywords": "", "license": "GPL3", "maintainer": "", "maintainer_email": "", "name": "rocks", "package_url": "https://pypi.org/project/rocks/", "platform": "", "project_url": "https://pypi.org/project/rocks/", "project_urls": {"Homepage": "https://www.github.com/Lamden/rocks"}, "release_url": "https://pypi.org/project/rocks/0.1.7/", "requires_dist": ["zcomm", "pyzmq", "python-rocksdb"], "requires_python": "", "summary": "Long running RocksDB server like Redis Server so that you can interface with it without worrying about locks and multiprocessing primitives.", "version": "0.1.7", "yanked": false, "html_description": null}, "last_serial": 6655694, "releases": {"0.1": [{"comment_text": "", "digests": {"md5": "c37dc66df2858b3f31b1819fce01a6c3", "sha256": "79e2e719f525c0f761ac8a6a8d07c96e124c1fcb68f6734dfcb223c848d0f665"}, "downloads": -1, "filename": "rocks-0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "c37dc66df2858b3f31b1819fce01a6c3", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 4286, "upload_time": "2019-10-14T19:40:58", "upload_time_iso_8601": "2019-10-14T19:40:58.268864Z", "url": "https://files.pythonhosted.org/packages/02/23/100c75ea4545e865e3fe831eaa8842774b10144b030feec46871c1900bba/rocks-0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "8101ae455d44b41fdcc8ccf1f892bd03", "sha256": "24df63440fec4354508a5be17614acff03aca505c393dfd648fca58e456ea25e"}, "downloads": -1, "filename": "rocks-0.1.tar.gz", "has_sig": false, "md5_digest": "8101ae455d44b41fdcc8ccf1f892bd03", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 2895, "upload_time": "2019-10-14T19:41:00", "upload_time_iso_8601": "2019-10-14T19:41:00.617041Z", "url": "https://files.pythonhosted.org/packages/1d/e0/cf5b791b420b48ad006a4543be28ec714cbf51cfc951feb92f6ea9adfeca/rocks-0.1.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "57db9072b7f7004c2d745756669b638d", "sha256": "c995d3a248b7c3842482ac4642fcb38800ccd42cf0463afb84dfb6a86f452f74"}, "downloads": -1, "filename": "rocks-0.1.1-py3.6.egg", "has_sig": false, "md5_digest": "57db9072b7f7004c2d745756669b638d", "packagetype": "bdist_egg", "python_version": "3.6", "requires_python": null, "size": 10550, "upload_time": "2019-10-16T21:17:40", "upload_time_iso_8601": "2019-10-16T21:17:40.122149Z", "url": "https://files.pythonhosted.org/packages/bc/e3/e527578909edc887d3654d7ec104f71d226216b6ce2d487fae14bcfd570d/rocks-0.1.1-py3.6.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "c8b6c5fda2f7568766fbb68340e61329", "sha256": "4daec74e00ee1c9a92d69f2460e4261bc20994d1e6295295bf04cebaecda3f4f"}, "downloads": -1, "filename": "rocks-0.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "c8b6c5fda2f7568766fbb68340e61329", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 4806, "upload_time": "2019-10-14T23:13:04", "upload_time_iso_8601": "2019-10-14T23:13:04.754778Z", "url": "https://files.pythonhosted.org/packages/fc/c5/b42efb7e17e9c07efd27ca103058287f473216689248f15e2ec3427c3b8c/rocks-0.1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "011f337c36aff339c9949511cd747441", "sha256": "bc998c605d928b08fa0bdb1f4a07013c4d396003ce4d86b62c4430f19211ba49"}, "downloads": -1, "filename": "rocks-0.1.1.tar.gz", "has_sig": false, "md5_digest": "011f337c36aff339c9949511cd747441", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3398, "upload_time": "2019-10-14T23:13:06", "upload_time_iso_8601": "2019-10-14T23:13:06.760304Z", "url": "https://files.pythonhosted.org/packages/45/b2/b1d70cfc63eaeb44e33a774d753d90ccd38bc1555fe657d29f4bfbad6f40/rocks-0.1.1.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "6bef8eba1d6b3e41562cad29104bdd8e", "sha256": "b3c2c02c189027921f0ccbf25cf855a1b2fa2c3e93a64d4a644cdb258862b589"}, "downloads": -1, "filename": "rocks-0.1.2-py3-none-any.whl", "has_sig": false, "md5_digest": "6bef8eba1d6b3e41562cad29104bdd8e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 4928, "upload_time": "2019-10-16T21:17:38", "upload_time_iso_8601": "2019-10-16T21:17:38.830780Z", "url": "https://files.pythonhosted.org/packages/d5/7d/ff1cb0bba74d9ec80e35f3578c02021378dbd0f37a09a22efba8a13e4fb5/rocks-0.1.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "81e2f31331ba7e40bf865849f3cbefc9", "sha256": "0bde214857034a0053fc871b040a515203a46a0fed217a9887527176e6a96dbf"}, "downloads": -1, "filename": "rocks-0.1.2.tar.gz", "has_sig": false, "md5_digest": "81e2f31331ba7e40bf865849f3cbefc9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3462, "upload_time": "2019-10-16T21:17:42", "upload_time_iso_8601": "2019-10-16T21:17:42.381364Z", "url": "https://files.pythonhosted.org/packages/bf/e1/a894aba66d817635415aa59295baa5ea9003646591282bf4cdc802de7402/rocks-0.1.2.tar.gz", "yanked": false}], "0.1.5": [{"comment_text": "", "digests": {"md5": "4fa680282fb3f193128f7af3ca50461c", "sha256": "89d829c17f72bf1f9a79470e808d901cb234e3d0381608a412bbb1b8a324e195"}, "downloads": -1, "filename": "rocks-0.1.5-py3-none-any.whl", "has_sig": false, "md5_digest": "4fa680282fb3f193128f7af3ca50461c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 4919, "upload_time": "2020-01-07T18:28:32", "upload_time_iso_8601": "2020-01-07T18:28:32.186962Z", "url": "https://files.pythonhosted.org/packages/3a/94/3a958645bb34e710bd3592e6738bdaf00bf8e8e7b639585b771e8b70a410/rocks-0.1.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "bb64f45f1d52a60cc64e634c45a50bc3", "sha256": "3b574aee8c8ac2406bd8d9fc1652598eb8d2a448dd19bf729c6d94de91160e26"}, "downloads": -1, "filename": "rocks-0.1.5.tar.gz", "has_sig": false, "md5_digest": "bb64f45f1d52a60cc64e634c45a50bc3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3447, "upload_time": "2020-01-07T18:28:33", "upload_time_iso_8601": "2020-01-07T18:28:33.678090Z", "url": "https://files.pythonhosted.org/packages/85/12/af756acc88a350b1cc6596ecec7635a67a472787fae1d396b7e729fb1749/rocks-0.1.5.tar.gz", "yanked": false}], "0.1.6": [{"comment_text": "", "digests": {"md5": "4b1d91e0d6d22a3a5d74c516a25cf6ca", "sha256": "94a1fdd7bd0004aa0a803b422d336d2e4188919368552dcab19b3bfcce29067d"}, "downloads": -1, "filename": "rocks-0.1.6-py3-none-any.whl", "has_sig": false, "md5_digest": "4b1d91e0d6d22a3a5d74c516a25cf6ca", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 4982, "upload_time": "2020-02-18T00:43:42", "upload_time_iso_8601": "2020-02-18T00:43:42.441290Z", "url": "https://files.pythonhosted.org/packages/a8/55/7e22b4b9889fb1f701071c043fb20c7eeec6df13ef0a6f01327eb5a85e4e/rocks-0.1.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "cd0511831241f671bb73f9298dbbbab7", "sha256": "0ab71828bdd9c5471874e81ff121346461ebed0d60c15afab71db10c9bdfe6a9"}, "downloads": -1, "filename": "rocks-0.1.6.tar.gz", "has_sig": false, "md5_digest": "cd0511831241f671bb73f9298dbbbab7", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3497, "upload_time": "2020-02-18T00:43:44", "upload_time_iso_8601": "2020-02-18T00:43:44.134706Z", "url": "https://files.pythonhosted.org/packages/54/a8/6bd2104f0384c9c53a289f5d28c71eeb09e3001a1e1f6adb606818198fcd/rocks-0.1.6.tar.gz", "yanked": false}], "0.1.7": [{"comment_text": "", "digests": {"md5": "8247357a1f3ead842b8ff2fb38021158", "sha256": "3b06236785c4a0f7e05cddbaa04bb8fb863221b2e6d9e879130aa969bc470bc8"}, "downloads": -1, "filename": "rocks-0.1.7-py3-none-any.whl", "has_sig": false, "md5_digest": "8247357a1f3ead842b8ff2fb38021158", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 5087, "upload_time": "2020-02-18T20:08:40", "upload_time_iso_8601": "2020-02-18T20:08:40.736706Z", "url": "https://files.pythonhosted.org/packages/eb/02/60fee550ee7671fbf5d43b8b4d4317b88fa1e84fd24cdac09b0d0aea409a/rocks-0.1.7-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "24d0b388d2dd66c15e371852bcfd12b8", "sha256": "07bec7c370182a81c655e61bb3106ab711c6997b0f960718e36e14d7dcd5d6fe"}, "downloads": -1, "filename": "rocks-0.1.7.tar.gz", "has_sig": false, "md5_digest": "24d0b388d2dd66c15e371852bcfd12b8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3592, "upload_time": "2020-02-18T20:08:43", "upload_time_iso_8601": "2020-02-18T20:08:43.685517Z", "url": "https://files.pythonhosted.org/packages/64/a2/f319bd6b32f9567985208e6dbd0dc31bbe5d105e238b88981be6fbf599e1/rocks-0.1.7.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "8247357a1f3ead842b8ff2fb38021158", "sha256": "3b06236785c4a0f7e05cddbaa04bb8fb863221b2e6d9e879130aa969bc470bc8"}, "downloads": -1, "filename": "rocks-0.1.7-py3-none-any.whl", "has_sig": false, "md5_digest": "8247357a1f3ead842b8ff2fb38021158", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 5087, "upload_time": "2020-02-18T20:08:40", "upload_time_iso_8601": "2020-02-18T20:08:40.736706Z", "url": "https://files.pythonhosted.org/packages/eb/02/60fee550ee7671fbf5d43b8b4d4317b88fa1e84fd24cdac09b0d0aea409a/rocks-0.1.7-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "24d0b388d2dd66c15e371852bcfd12b8", "sha256": "07bec7c370182a81c655e61bb3106ab711c6997b0f960718e36e14d7dcd5d6fe"}, "downloads": -1, "filename": "rocks-0.1.7.tar.gz", "has_sig": false, "md5_digest": "24d0b388d2dd66c15e371852bcfd12b8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3592, "upload_time": "2020-02-18T20:08:43", "upload_time_iso_8601": "2020-02-18T20:08:43.685517Z", "url": "https://files.pythonhosted.org/packages/64/a2/f319bd6b32f9567985208e6dbd0dc31bbe5d105e238b88981be6fbf599e1/rocks-0.1.7.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:01:32 2020"}