{"info": {"author": "Mitch Garnaat", "author_email": "mitch@garnaat.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Intended Audience :: Developers", "Intended Audience :: System Administrators", "License :: OSI Approved :: Apache Software License", "Natural Language :: English", "Programming Language :: Python", "Programming Language :: Python :: 2.6", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.3", "Programming Language :: Python :: 3.4"], "description": "rolemodel\n=========\n\n**Rolemodel** is a command line tool that helps you set up and maintain\ncross-account IAM roles for the purpose of using them in the new\n[switch role](https://aws.amazon.com/blogs/aws/new-cross-account-access-in-the-aws-management-console/)\ncapability of the AWS management console.  These same cross-account roles\ncan also be used with the AWSCLI as described\n[here](http://lexical.scopely.com/2015/01/09/switching-roles/).\n\nThe main benefit of enabling these cross-account roles is that you only\nhave to maintain a single set of IAM users in one \"master\" AWS account.\nBy controlling which IAM groups these users are members of, you can control\nwhich other accounts they have access to and what privileges they have\nin each of those accounts.\n\nA Little Terminology\n--------------------\n\nFor the purposes of this document, lets define a couple of terms.\n\n* **Assumable Account** is an AWS account in which IAM roles have been created\n  for the purpose of allowing cross-account access.  You can have any number of\n  assumable accounts.\n* **Master Account** is the account in which you will create and maintain IAM\n  users.  This is the account your users will log into to switch to other\n  assumable accounts.  You can have only one master account.\n\nWhat Does rolemodel Do?\n-----------------------\n\nThe ``rolemodel`` tool:\n\n* Uses CloudFormation to create a consistent set of roles across all assumabe\n  accounts you specify.\n* Creates IAM groups in the master account to control which IAM users in the\n  master account can assume which roles in which assumable accounts.  If you\n  have defined four roles and you have 4 assumable accounts, ``rolemodel`` will\n  create a total of 16 groups in the master account.\n* Optionally, ``rolemodel`` can also be used to map existing IAM users in the\n  master account into the appropriate roles for each of the assumable\n  accounts.  It will not create IAM users for you.\n\nThe ``rolemodel`` tool will create all roles and groups initially but can also\nbe used to update roles over time.  If you add more roles or change the\npolicies of existing roles you can run the ``update`` command and ``rolemodel``\nwill take care of the rest.\n\nWhat Do I Have To Do?\n---------------------\n\nAs an administrator you are responsible for:\n\n* Defining the IAM roles and related policies that you want to enable in all of\n  your assumable accounts.\n* Running the ``rolemodel`` tool to create and update the IAM roles when\n  necessary.\n* Manage the membership in the IAM groups created in the master account.  By\n  adding an IAM user to one of the IAM groups you are granting that user the\n  ability to switch to that account with the privileges granted by the IAM\n  policies associated with that IAM role.\n* Carefully control IAM access in the master account.  Any IAM user that can\n  change group membership in the master account has the ability to elevate any\n  IAM user in the master account to the most-privileged IAM role in all\n  assumable accounts.  You should control this carefully!\n\nGetting Started\n---------------\n\nFirst, you need to install ``rolemodel``.  The easiest way is with pip,\npreferably inside a virtualenv.\n\n    $ pip install rolemodel\n\nYou can also clone the\n[Github repo](https://github.com/scopely-devops/rolemodel) and then run\n``python setup.py install`` inside the cloned directory.\n\n``rolemodel`` is built with [botocore](https://github.com/boto/botocore) and\nuses the same credential file as defined by\n[AWSCLI](https://github.com/aws/aws-cli).\n\nThe next step is to define your master set of roles in a CloudFormation\ntemplate.  There is a sample set of roles contained in the file\n``samples/roles.cf`` but you should edit this to suit your needs.  Each role\ndefined in your CloudFormation template will be created in all of the assumable\naccounts you specify.\n\nThe next thing you need to do is create a configuration file to tell\n``rolemodel`` about your assumable accounts and other info.  There is a sample\nYAML config file in ``samples/config.yml``.  You need to provide the following\ninformation in the config file.\n\n* **assumable_roles** should be the path to the CloudFormation template\n  defining the IAM roles that will be created in each assumable account.\n* **master_account_id** is the 12-digit ID for the account that will be the\n  master account.\n* **master_account_profile** is the name of the profile within your AWS config\n  or credential file that contains the credentials for the master account.\n* for each assumable account:\n  * **name** is the symbolic name of the assumable account.  This name is used\n    when constructing the group names in the master account.\n  * **profile** is the name of the profile within your AWS config or credential\n    file that contains the credentials for this assumable account.  These\n    credentials must be able to create IAM roles within the assumabl account.\n\nOnce you have the IAM roles defined and your configuration file created you can\nrun the ``rolemodel`` command line tool.\n\n    $ rolemodel <path to config file> update\n\nThis will create or update all of the IAM roles defined in your CloudFormation\ntemplate in all assumable accounts specified in your configuration file.  It\nwill then create or update all required IAM groups in your master account.  You\ncan run this command multiple times.  If no changes have been made in your IAM\nroles then nothing will be done by ``rolemodel``.\n\nIf you want to get a list of all roles and all assumable accounts, use:\n\n    $ rolemodel <path to config file> list\n\nFinally, if you want to delete all IAM roles in all assumable accounts and also\ndelete all IAM groups in the master account, use:\n\n    $ rolemodel <path to config file> delete\n\nManaging Users in Master Account\n--------------------------------\n\nYou can do the above steps and then manually manage the process of making IAM\nusers in the master account members of the appropriate groups to allow them to\nassume roles in assumable accounts.  However, ``rolemodel`` does provide a\nmechanism to support this part of the process as well.\n\nTo take advantage of this feature, you need an additional YAML file that maps\nexisting IAM users in the master account into the necessary IAM groups.  The\nstructure of this file is shown below.\n\n    ---\n    acct1:\n      role1:\n        - user1\n        - user2\n      role2:\n        - user3\n        - user4\n    acct2:\n      role1:\n        - user1\n        - user3\n      role2:\n        - user5\n        - user6\n\nThe main keys in this dictionary are the names of the assumable accounts.\nWithin each of the accounts are additionaly dictionaries for each of the\nassumable roles that are defined.  And each role name contains a list of\nexisting IAM users in the master account that should be allowed to assume that\nrole.\n\nOnce you have defined this file for your accounts, you can run the command to\nsync your groups with this file.\n\n    $ rolemodel <path to config file> sync_users <path to user map file>\n\nThe ``sample`` directory includes an example of a user map file you can edit\nfor your purposes.\n\nGroups In Master Account\n------------------------\n\nThe name of each group created in the master account will be of the form:\n\n    RM.<assumble account name>.<role name>\n\nThe ``assumable account name`` comes from the name you provide for the\nassumable account in the config file.  The ``role name`` comes from the name\nused for the role in the CloudFormation template.", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/scopely-devops/rolemodel", "keywords": null, "license": "Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright {yyyy} {name of copyright owner}\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.", "maintainer": null, "maintainer_email": null, "name": "rolemodel", "package_url": "https://pypi.org/project/rolemodel/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/rolemodel/", "project_urls": {"Download": "UNKNOWN", "Homepage": "https://github.com/scopely-devops/rolemodel"}, "release_url": "https://pypi.org/project/rolemodel/0.1.0/", "requires_dist": null, "requires_python": null, "summary": "A tool to help manage cross-account roles in AWS", "version": "0.1.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            rolemodel<br>=========<br><br>**Rolemodel** is a command line tool that helps you set up and maintain<br>cross-account IAM roles for the purpose of using them in the new<br>[switch role](https://aws.amazon.com/blogs/aws/new-cross-account-access-in-the-aws-management-console/)<br>capability of the AWS management console.  These same cross-account roles<br>can also be used with the AWSCLI as described<br>[here](http://lexical.scopely.com/2015/01/09/switching-roles/).<br><br>The main benefit of enabling these cross-account roles is that you only<br>have to maintain a single set of IAM users in one \"master\" AWS account.<br>By controlling which IAM groups these users are members of, you can control<br>which other accounts they have access to and what privileges they have<br>in each of those accounts.<br><br>A Little Terminology<br>--------------------<br><br>For the purposes of this document, lets define a couple of terms.<br><br>* **Assumable Account** is an AWS account in which IAM roles have been created<br>  for the purpose of allowing cross-account access.  You can have any number of<br>  assumable accounts.<br>* **Master Account** is the account in which you will create and maintain IAM<br>  users.  This is the account your users will log into to switch to other<br>  assumable accounts.  You can have only one master account.<br><br>What Does rolemodel Do?<br>-----------------------<br><br>The ``rolemodel`` tool:<br><br>* Uses CloudFormation to create a consistent set of roles across all assumabe<br>  accounts you specify.<br>* Creates IAM groups in the master account to control which IAM users in the<br>  master account can assume which roles in which assumable accounts.  If you<br>  have defined four roles and you have 4 assumable accounts, ``rolemodel`` will<br>  create a total of 16 groups in the master account.<br>* Optionally, ``rolemodel`` can also be used to map existing IAM users in the<br>  master account into the appropriate roles for each of the assumable<br>  accounts.  It will not create IAM users for you.<br><br>The ``rolemodel`` tool will create all roles and groups initially but can also<br>be used to update roles over time.  If you add more roles or change the<br>policies of existing roles you can run the ``update`` command and ``rolemodel``<br>will take care of the rest.<br><br>What Do I Have To Do?<br>---------------------<br><br>As an administrator you are responsible for:<br><br>* Defining the IAM roles and related policies that you want to enable in all of<br>  your assumable accounts.<br>* Running the ``rolemodel`` tool to create and update the IAM roles when<br>  necessary.<br>* Manage the membership in the IAM groups created in the master account.  By<br>  adding an IAM user to one of the IAM groups you are granting that user the<br>  ability to switch to that account with the privileges granted by the IAM<br>  policies associated with that IAM role.<br>* Carefully control IAM access in the master account.  Any IAM user that can<br>  change group membership in the master account has the ability to elevate any<br>  IAM user in the master account to the most-privileged IAM role in all<br>  assumable accounts.  You should control this carefully!<br><br>Getting Started<br>---------------<br><br>First, you need to install ``rolemodel``.  The easiest way is with pip,<br>preferably inside a virtualenv.<br><br>    $ pip install rolemodel<br><br>You can also clone the<br>[Github repo](https://github.com/scopely-devops/rolemodel) and then run<br>``python setup.py install`` inside the cloned directory.<br><br>``rolemodel`` is built with [botocore](https://github.com/boto/botocore) and<br>uses the same credential file as defined by<br>[AWSCLI](https://github.com/aws/aws-cli).<br><br>The next step is to define your master set of roles in a CloudFormation<br>template.  There is a sample set of roles contained in the file<br>``samples/roles.cf`` but you should edit this to suit your needs.  Each role<br>defined in your CloudFormation template will be created in all of the assumable<br>accounts you specify.<br><br>The next thing you need to do is create a configuration file to tell<br>``rolemodel`` about your assumable accounts and other info.  There is a sample<br>YAML config file in ``samples/config.yml``.  You need to provide the following<br>information in the config file.<br><br>* **assumable_roles** should be the path to the CloudFormation template<br>  defining the IAM roles that will be created in each assumable account.<br>* **master_account_id** is the 12-digit ID for the account that will be the<br>  master account.<br>* **master_account_profile** is the name of the profile within your AWS config<br>  or credential file that contains the credentials for the master account.<br>* for each assumable account:<br>  * **name** is the symbolic name of the assumable account.  This name is used<br>    when constructing the group names in the master account.<br>  * **profile** is the name of the profile within your AWS config or credential<br>    file that contains the credentials for this assumable account.  These<br>    credentials must be able to create IAM roles within the assumabl account.<br><br>Once you have the IAM roles defined and your configuration file created you can<br>run the ``rolemodel`` command line tool.<br><br>    $ rolemodel &lt;path to config file&gt; update<br><br>This will create or update all of the IAM roles defined in your CloudFormation<br>template in all assumable accounts specified in your configuration file.  It<br>will then create or update all required IAM groups in your master account.  You<br>can run this command multiple times.  If no changes have been made in your IAM<br>roles then nothing will be done by ``rolemodel``.<br><br>If you want to get a list of all roles and all assumable accounts, use:<br><br>    $ rolemodel &lt;path to config file&gt; list<br><br>Finally, if you want to delete all IAM roles in all assumable accounts and also<br>delete all IAM groups in the master account, use:<br><br>    $ rolemodel &lt;path to config file&gt; delete<br><br>Managing Users in Master Account<br>--------------------------------<br><br>You can do the above steps and then manually manage the process of making IAM<br>users in the master account members of the appropriate groups to allow them to<br>assume roles in assumable accounts.  However, ``rolemodel`` does provide a<br>mechanism to support this part of the process as well.<br><br>To take advantage of this feature, you need an additional YAML file that maps<br>existing IAM users in the master account into the necessary IAM groups.  The<br>structure of this file is shown below.<br><br>    ---<br>    acct1:<br>      role1:<br>        - user1<br>        - user2<br>      role2:<br>        - user3<br>        - user4<br>    acct2:<br>      role1:<br>        - user1<br>        - user3<br>      role2:<br>        - user5<br>        - user6<br><br>The main keys in this dictionary are the names of the assumable accounts.<br>Within each of the accounts are additionaly dictionaries for each of the<br>assumable roles that are defined.  And each role name contains a list of<br>existing IAM users in the master account that should be allowed to assume that<br>role.<br><br>Once you have defined this file for your accounts, you can run the command to<br>sync your groups with this file.<br><br>    $ rolemodel &lt;path to config file&gt; sync_users &lt;path to user map file&gt;<br><br>The ``sample`` directory includes an example of a user map file you can edit<br>for your purposes.<br><br>Groups In Master Account<br>------------------------<br><br>The name of each group created in the master account will be of the form:<br><br>    RM.&lt;assumble account name&gt;.&lt;role name&gt;<br><br>The ``assumable account name`` comes from the name you provide for the<br>assumable account in the config file.  The ``role name`` comes from the name<br>used for the role in the CloudFormation template.\n          </div>"}, "last_serial": 1387915, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "e14ba5b8f0b75bd5ff7b6b1b06618c37", "sha256": "4b2667b8e80c2e9abe998961bf5d4e9acfaf2719344ce3c27dab1a086188f30a"}, "downloads": -1, "filename": "rolemodel-0.1.0.tar.gz", "has_sig": false, "md5_digest": "e14ba5b8f0b75bd5ff7b6b1b06618c37", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 20322, "upload_time": "2015-01-19T14:26:48", "upload_time_iso_8601": "2015-01-19T14:26:48.591002Z", "url": "https://files.pythonhosted.org/packages/8d/b9/78eaa007622c2f97e7a0c4007f1e98b78337fec66c0b021ef25a2c59ed09/rolemodel-0.1.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "e14ba5b8f0b75bd5ff7b6b1b06618c37", "sha256": "4b2667b8e80c2e9abe998961bf5d4e9acfaf2719344ce3c27dab1a086188f30a"}, "downloads": -1, "filename": "rolemodel-0.1.0.tar.gz", "has_sig": false, "md5_digest": "e14ba5b8f0b75bd5ff7b6b1b06618c37", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 20322, "upload_time": "2015-01-19T14:26:48", "upload_time_iso_8601": "2015-01-19T14:26:48.591002Z", "url": "https://files.pythonhosted.org/packages/8d/b9/78eaa007622c2f97e7a0c4007f1e98b78337fec66c0b021ef25a2c59ed09/rolemodel-0.1.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:01:27 2020"}