{"info": {"author": "Ralf Schlatterbeck", "author_email": "rsc@runtux.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "Intended Audience :: Developers", "License :: OSI Approved :: GNU Library or Lesser General Public License (LGPL)", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6"], "description": "\n:Author: Ralf Schlatterbeck <rsc@runtux.com>\n\nThe library includes various utility modules used in other projects.\n\n - ast_call: A simple call manager using asterisk: This can be used to\n   originate a call and log all event associated to that call. So you\n   can find out the status of the call and optionally the dialstatus.\n - ast_cdr: parser for CDR records in asterisk. We currently use\n   text-files only, this might be later extended for database use.\n - ast_probe: Methods for checking for running asterisk\n - Autosuper magic (originally from Guido van Rossums announcement of\n   Python 2.2): For refactoring it's a good idea that each class knows\n   its parents (that the parent is not hardcoded in the upcall),\n   achieved by adding a the __super attribute. Use as, e.g.,\n   self.__super.method for calling method in the parent.\n - base_pickler: Allow to specify a dictionary of pickle exceptions, if\n   the value in the dictionary is in __dict__ when pickle is called, the\n   value in __dict__ is replaced with the value in the exception\n   dictionary.\n - bero: A configurator for the `bero*fos`_ failover switch. See my\n   `blogpost`_ why I wrote that (short summary: to work around bugs in\n   the firmware of the device which are not addressed by the\n   configurator code that comes with the device).\n - Config_File for python-syntax configuration files used in several of\n   my projects.\n - crm: Tools for the cluster resource manager of the pacemaker high\n   availability project. We allow querying of nodes, resources and\n   errors for resources as well as resetting errors and migration of\n   resources.\n - execute: module for executing commands and handling IO, this also\n   has a Lock and a Log mixin. Now there is also a framework for\n   executing processes in a pipeline, there can be fork-points in the\n   pipeline where the output of one process feeds several pipelines.\n   See test_exec.py, test2_exec.py and test3_exec.py.\n - grepmime: search for pattern in email attachments (even if these are\n   encoded)\n - inductance: Inductance calculation of air-cored cylindrical\n   flat-winded coil according to Robert Weaver\n   http://electronbunker.ca/CalcMethods3b.html\n - IP_Address: IP v4 and v6 Addresses with subnet masking\n - iter_recipes: magic with iterators\n - isdn: model the status of Asterisk ISDN lines, either Linux Call\n   Router (LCR) ISDN lines or lines managed by DAHDI. Special case for\n   Xorcom modules which provide more information using Xorcom-specific\n   files in /proc than native DAHDI modules.\n - lc_resonator: Frequency calculation for L-C resonator\n - Math implements Euclids algorithm for greatest common divisor and as\n   a by-product the least common multiple\n - nmap: A parser for output of nmap scans to (e.g. to generate tables\n   in TeX)\n - ocf: small framework for writing OCF scripts for the heartbeat\n   cluster resource manager (probably also usable for the newer version\n   called pacemaker but for now only tested with the version in Debian\n   stable aka lenny).\n - PDF_Signature: experimental code for checking signatures on adobe PDF\n   documents\n - Phone: Parse phone numbers (Austria-specific)\n - PM_Value: Possibly missing value, encapsulate a number which may be\n   missing and associated arithmetics.\n - pycompat: Utilities for running under different python versions\n - Rational: Implementation of Rational numbers\n - stateparser: Simple state-machine parser class, this is used for\n   writing line-based parsers using a state machine. For an example\n   usage see nmap. After parsing the result can be pickled but we lose\n   the ability to continue parsing after reading from the pickled\n   result.\n - sqlparser: Parse SQL dumps from postgreSQL and mysql and optionally\n   create an new (e.g. anonymized) sql dump\n - timeout: A simple timeout mechanism using SIGALRM\n - Tex_CSV_Writer: Write CVS files in a syntax that can be parsed by\n   TeX. Implements same interface as the csv module. Only implements\n   writing.\n - trafficshape: Simple traffic shaping configuration: Currently\n   generates Linux tc commands for a traffic shaping config using hfsc\n   for shaping and sfq or red for the leaf qdiscs. We also provide a\n   translator from iptables mangle rules (for traffic marking) to tc\n   commands for filtering. This is needed if we want to do inbound\n   shaping. The Linux kernel doesn't support inbound shaping, so we need\n   to redirect all traffic to an ifb device. On that device we do\n   *outbound* shaping. Unfortunately when sending traffic to an ifb\n   device with a tc filter + action mirred command this occurs *before*\n   the PREROUTING chain. This means packets are not yet marked. So we\n   provide a parser to translate mangle rules in the PREROUTING chain to\n   appropriate tc commands. For implementing this we mark packets (using\n   the tc action xt (formerly known as ipt used for iptables marking, a\n   backward-compatibility option can be used) in the original device and\n   then use the marked information in the ifb device to send the traffic\n   to appropriate qdiscs. This supports a two-level approach: Rules in\n   iptables that match on a packet mark (using --mark) are translated to\n   tc commands in the ifb device (they depend on the mark already\n   present). All other rules are translated to a tc action xt (using -j\n   MARK) and a tc action mirred redirect (for sending the traffic to the\n   ifb device) for the *original* device (e.g. eth0 redirecting to\n   ifb0). The PREROUTING commands by default are directly taken from the\n   running kernel by default (using \"iptables -t mangle -S -v\")\n\n.. _`bero*fos`: https://shop.beronet.com/product_info.php/cPath/56/products_id/159\n.. _`blogpost`: http://blog.runtux.com/2009/04/09/81/\n\nResources\n---------\n\nDownload the source at https://sourceforge.net/projects/rsclib/\nand install using the standard python setup, e.g.::\n\n python setup.py install --prefix=/usr/local\n\nAlternatively get it from pypi and/or install via pip.\n\n\nChanges\n-------\n\nVersion 0.56: ast_call, isdn\n\n    - The ast_call now is brought to latest version of pyst and asterisk\n    - isdn module now supports remote isdn via isdn gateway\n    - various python3 fixes\n\nVersion 0.55: LOCKDIR\n\n    - Now it's possible to set the locking directory (default is still\n      /var/lock which is a symlink to /run/lock on modern systems) via\n      the environment variable LOCKDIR.\n\nVersion 0.54: inductance, sqlparser\n\n    - The sqlparser now can do round-tripping (some items are in\n      different order)\n    - More inductance formulae\n\nVersion 0.53: inductance, IPv4 address\n\n    - Bring inductance to metric units (output in F, input in m)\n    - Fix IPv4 address parsing when address contains less than 3 dots\n\nVersion 0.52: Small fixes\n\n    - Fix unicode problem in sqlparser\n\nVersion 0.51: Small fixes\n\n    - Fix IP addresses in boolean context\n    - Add supported python versions to setup.py\n\nVersion 0.50: Small additions\n\n    - Change Rational to no longer print mixed fractions by default\n    - Allow setting the locking filename for Lock_Mixin in execute\n\nVersion 0.49: Python3 compatibility\n\n   - Remove ETree, HTML_Parse, PDF_Parse, multipart_form: These are\n     better handled by libraries like BeautifulSoup or specific PDF\n     handling libs or the requests library\n   - Remove ldap_lib.py: This is now nicely supported by ldap3 which\n     also has a native iterator for paged search\n   - Remove Freshmeat.py: Freshmeat is more or less dead now and they\n     don't support an API-Test so it is very hard to get this right\n   - Put Firstname (with all the history) into its own package, note\n     that this needs more work to run against the latest version of the\n     website\n   - Lots of fixes for python3 compatibility: Where doctests existed\n     these pass now but there is still untested code and some code where\n     libaries are missing for python3 (pyst asterisk bindings and\n     openssl wrappers)\n\nVersion 0.48: Fixes for execute\n\n   - Now we really close all relevant ends of pipes in other processes\n     which avoids hangs\n   - Add logging to Process\n\nVersion 0.47: Fixes for IP_Address; pypi\n\n   - IP_Address: Relax inheritance checks when comparing IP_Address\n     instances\n   - Version uploaded to pypi and documented in README\n\nVersion 0.46: Additions to ast_probe; Bug-fix\n\n   - ast_probe now has methods for checking sip registry and reloading\n     the sip subsystem in asterisk\n   - Add a small script, ast_sip_check for checking sip registration on\n     an asterisk server and restart sip if some registrations are\n     missing.\n   - Config_File fixes the __getattr_ method to return an\n     AttributeError in case of failure\n\nVersion 0.45: Fix ISDN ports\n\nString reprentation had leading unicode 'u'\n\n   - Fix string representation in ISDN ports\n\nVersion 0.44: Make line-waiting for bero configurable\n\nFor cluster resource berofos we make waiting for the L1 and L2 of the\nISDN line configurable. The hard-coded default was too low.\n\n   - New config-item ISDN_WAIT_UP\n\nVersion 0.43: Support new berofos firmware\n\nThe new berofos (failover switch) firmware has some new low-level\ncommands which we now accept when getting the device status.\n\n  - Fix bero.py to accept new low-level commands\n  - Add some more documentation to bero.py\n  - Add description of ast_probe in this README\n\nVersion 0.42: Feature enhancements\n\nAdd crm for pacemaker cluster management, new ast_probe for checking of\nasterisk status. Fixes to ocf and ast_call.\n\n  - Add crm.py\n  - Add ast_probe.py\n  - Allow specification of parsed config (cfg) for Call_Manager in\n    ast_call.py\n  - Better resource monitoring for asterisk and dahdi in ocf.py\n  - fix ocf.py to use new classes in isdn.py\n  - isdn.py now doesn't probe asterisk for the isdn stack in use if it\n    finds a hint in the config-file\n\nVersion 0.41: Minor feature enhancements\n\nFixes to Freshmeat, pycompat, sql-dump parser.\n\n  - Fix parsing of escaped quotes in mysql dumps\n  - Freshmeat\n  - pycompat fixes\n\nVersion 0.40: Distribution bug-fix\n\nRenaming of README lead to the missing file README.rst in the distro.\n\n  - Fix MANIFEST.in\n\nVersion 0.39: Minor feature enhancements\n\nFixes to hexdump, unicode issues (elementtree wrapper, stateparser).\nAdd some fixes to IP_Address comparison. The nmap output has changed in\nrecent versions, adapt to new format.\n\n  - Make address in hexdump configurable\n  - Bug-fix with comparison of sub-classes in IP_Address\n  - Unicode support in ETree\n  - Unicode support in stateparser\n  - Fix for trailing empty attributes in CSV output of PostgreSQL dumps\n    in sqlparser\n  - Unicode support in sqlparser (uses stateparser)\n  - Parse new nmap format\n  - Fix for configurable Releasetools location\n\nVersion 0.38: Minor feature enhancements\n\nFix boolean conversion of IP6_Address (and IP4_Address).\n\n - IP6_Address would throw an error when trying a truth-test. Add\n   __nonzero__ (which always returns True even for the 0 Address)\n\nVersion 0.37: Minor feature enhancements\n\nChange sort-order of IP_Address, make IP_Address immutable, use\nmetaclass magic to allow copy-constructor semantics.\n\n - Sort order of IP_Address objects (both v4 and v6) now reverses the\n   order of the netmask: If the IP-Address part of the objects to\n   compare are the same, we used to sort by *inverse* netmask (putting\n   smaller networks with higher netmask first). We now reversed this to\n   be compatible with PostgrSQL cidr type objects.\n - All attributes of IP_Address objects are now implemented as\n   properties to return the '_' variant of the attribute. Thus\n   IP_Address objects are (when using the public interface) immutable.\n   Since we already had a __hash__ method this effectively fixes the\n   interface to not allow mutation of objects that are in a dictionary.\n - Allow calling the IP_Address constructors with another IP_Address\n   object. Since IP_Address objects are now immutable we use metaclass\n   trickery to return the passed object itself (instead of generating a\n   copy).\n\nVersion 0.36: Minor feature enhancements\n\nAllow auto-coercion of comparison parameters. Add parent property and\nis_sibling test.\n\n - Now comparison operators and 'in' do auto coercion.\n - Add parent property (next bigger network)\n - Add is_sibling test (same parent)\n\nVersion 0.35: Minor feature enhancements\n\nAdd 'mask_len' as an alias of 'mask' to IP_Address.\n\n - Need the network mask length (aka prefix length) sometimes as\n   mask_len (e.g. for FFM on github).\n\nVersion 0.34: Minor feature enhancements\n\nFix trafficshape to use new tc syntax. Add label to hexdump.\n\n - The tc command has renamed the ``ipt`` action to ``xt`` (Linux\n   introduced xtables as a refactoring of iptables), the old ``ipt`` is\n   still available in ``iproute2`` but we make ``xt`` the default now.\n   A backward-compatibility parameter can be used to get the old\n   behavior.\n - Add save-mark to iptables action parser.\n - The hexdump class now can generate labels.\n\nVersion 0.33: Minor feature enhancements\n\nMore fixes for ast_call.\n\n - Add parser for events from asterisk wireshark trace\n - Add fail.log for 'real' test\n - Don't double-register call with Call_Manager\n - Allow explicit matching by account-code\n\nVersion 0.32: Minor feature enhancements\n\nMore fixes for ast_call.\n\n - Regression test with pyst asterisk emulator\n - Fix case where OriginateResponse immediately returns Failure\n - Tests for cases where Hangup comes before or after the\n   OriginateResponse\n\nVersion 0.31: Minor feature enhancements\n\nFix ast_call for immediately failing calls. Fix dahdi channel\ncomputation in isdn.py.\n\n - Fix OriginateResponse handling in ast_call\n - Fix dahdi channel computation, can't directly use the span, use the\n   basechan attribute\n\nVersion 0.30: Minor feature enhancements\n\nFix how dahdi vs. mISDN interpret what is called an interface and what\nis called a port. In mISDN we can combine several ports (physical lines)\nto an interface. In dahdi both are the same (a port is a span in dahdi).\n\n - Remove parsing of B- and C- channels from dahdi isdn parser\n\nVersion 0.29: Minor feature enhancements\n\nThe lcr module is now named isdn. It can now handle isdn interfaces\nmanaged by Asterisk DAHDI in addition to Linux Call Router (LCR).\n\nVersion 0.28: Minor feature enhancements\n\nFix inductance formula of Robert Weaver, thanks Robert for pointing me\nto the correction you did on your new site! For most doctests in the\ninductance module the error was in the lower percentage points.\nAdd an xxrange iterator to the iter_recipes that can replace pythons\nnative xrange iterator but works with long integers. Needed for some\noperations on IPv6 addresses in the IP_Address module.\n\n - Fix inductance calculation according to patch from Robert Weaver\n - Add xxrange iterator to iter_recipes\n - Use new xxrange instead of xrange in IP_Address module, add a test\n   that failed with large numbers for IPv6\n\nVersion 0.27: Minor feature enhancements\n\nAdd pageurl and pageinfo attributes to HTML_Parser.Page_Tree, other\nenhancements to HTML_Parser. Add pickle support to parser classes.\nFix comparison of IP_Address classes.\n\n - Add pageurl and pageinfo attributes to HTML_Parser.Page_Tree storing\n   information retrieved via geturl and info calls from urllib2.\n - Parser classes in stateparser.py and HTML_Parse.py where not\n   pickleable, fixed by removing parser-specific attributes when calling\n   pickle. Note that the parsing cannot be continued after reading class\n   from a pickle.\n - Add base_pickler module to allow pickle exceptions\n - HTML_Parse: Make Parse_Error a ValueError\n - HTML_Parse: Raise line number with exception\n - HTML_Parse: Add a timeout\n - HTML_Parse: raise Retries_Exceeded with url\n - HTML_Parse: url parameter may now be None, not joined with site\n   parameter\n - Add pageurl and pageinfo to HTML_Parse\n - IP_Address: Fix comparison\n - Slight refactoring of NMAP_Parser class\n\nVersion 0.26: Minor feature enhancements\n\nFix double-utf-8-encoding option for sqlparser. Enhance stderr handling\nfor exec_pipe.\n\n - More detected broken encodings for fix_double_encode option\n - execute.py: add error message from executed command to message raised\n   by exec_pipe, make stderr output available in non-failing case.\n\nVersion 0.25: Minor feature enhancements\n\nAdd sqlparser for parsing SQL dumps of PostgreSQL and mysql, add Phone\nto parse phone numbers.\n\n - sqlparser added\n - Phone added for parsing phone numbers\n\nVersion 0.24: Minor feature enhancements\n\nBetter syntax checks and comparison operators for IP_Address, bug fixes\nfor parser and __str__ for IP_Address.IP6_Address\n\n - IP_Address better syntax checks\n - IP_Address __cmp__ and __eq__ improved for comparison with other types\n - more regression tests for IP6_Address\n - bug fixes in __str__ and parser of IP6_Address\n - support for strict checking of netmask (all bits at right of netmask\n   must be zero if strict_mask is True)\n\nVersion 0.23: Minor feature enhancements\n\nIP4_Address can now be put in a dict, add a subnets iterator for\nIP4_Address. Factor IP_Address and add IP6_Address\n\n - Add __hash__ for IP_Address\n - The new subnets iterator for IP_Address iterates over all IPs in a\n   subnet. Optionally a netmask can be specified.\n - Support for IPv6 addresses\n - rename IP4_Address to IP_Address\n\nVersion 0.22: Minor feature enhancements\n\nAllow unicode ip address input, hopefully make rsclib installable via pip.\n\n - Address given to IP4_Address constructor now may be unicode\n - Add download_url to setup.py to make installable via pip\n\nVersion 0.21: Minor feature enhancements\n\nFix autosuper: allow to inherit from non-autosuper classes, some small\nfixes to ast_call and lcr parser. Fix ETree pretty-printing. Update\nFreshmeat to new hostname. Add dotted netmaks parsing to IP4_Address.\n\n - Since python2.6 constructor of \"object\" do not allow parameters, so\n   we need to strip these when doing the upcall from autosuper. This\n   fails when e.g. inheriting from a non-autosuper enabled class, e.g.,\n   class (With_Autosuper, dict)\n   in that case dict would get empty parameters. New implementation\n   finds out if our upcall is to \"object\", only in that case strip\n   parameters.\n - ast_call now processes all queued unhandled events when a call is\n   matched.\n - update regression test for ast_call.Call\n - lcr parser: fix regex, port can have an empty name.\n - Optimize call matching in ast_call: mark call as closed once we are\n   sure about the uniqueid. Add matching of Account-Code.\n - Fix ETree pretty-printing: don't print unicode strings when arguments\n   are already converted\n - freshmeat.net now is freecode.com (and the API redirects there),\n   update Freshmeat.py to new hostname (including .netrc credentials\n   with compatibility for old name).\n - explicit mask paramter of IP4_Address can now be a dotted netmask.\n\nVersion 0.20: Not announced on freshmeat\n\nDatabase value output for ast_cdr, added inductance calculation.\n\n - ast_cdr: Add methods for database values of CDR records -- database\n   values of CDRs are different, they don't include start, end, answer\n   time-stamps but instead only a calldate, in addition the amaflags are\n   numerical in the database.\n - added inductance calculation\n\nVersion 0.19: Not announced on freshmeat\n\nExtend ETree with a walk method and implement small ldap library\n\n - ETree: add walk method to walk the tree and call an optional pre- and\n   post-hook function\n - ldap_lib: common ldap tasks for user and group search, and an\n   iterator for paged search (used with active directory).\n\nVersion 0.18: Not announced on freshmeat\n\nBugfix of ast_call and update for asterisk 1.6, small extension to\nIP4_Address.\n\n - ast_call: match calls via (unique) account code\n - ast_call: State vs ChannelState parameter in Newstate event\n - ast_call: handle immediate error from asterisk (e.g. Permission Denied)\n - IP4_Address: add netblk (start and end address for address with\n   netmask)\n\nVersion 0.17: Not announced on freshmeat\n\nFactor ETree (extended ElementTree) from HTML_Parse. New Freshmeat\nmodule to get project information and submit new releases via the new\nfreshmeat REST API. New simple hexdump module.\n\n - New ETree.py (extended ElementTree)\n - New Freshmeat.py\n - New hexdump.py\n - adapt lcr module to new version of Linux Call Router\n\nVersion 0.16: Not announced on freshmeat\n\nAdd an iptables to tc translator for translating mangle rules in the\niptables PREROUTING chain to appropriate tc commands (using an ipt\naction and mirred redirect actions).\n\n - Add iptables to tc translator to trafficshape.py\n\nVersion 0.15: Not announced on freshmeat\n\nAdd a framework for traffic shaping with linux iproute (tc). Minor\nupdates to iter_recipes.\n\n - Initial implementation of trafficshape.py\n - Add iter_recipes.combinations from python2.6 manpage of itertools\n   for backward compatibility\n\nVersion 0.14: Not announced on freshmeat\n\nAdd a framework for process pipeline execution, processes can either be\npython methods or external programs (with parameter list).  They can be\nconnected in a pipe and there may be T-points in the pipe, where the\npipe forks into two or more pipelines fed by the output of one process.\n\n - Add process pipeline framework\n - HTML_Parse now has an explicit translate hook for preprocessing the\n   html page before parsing it. This defaults to the old behaviour of\n   filtering out common characters in broken HTML.\n - Add nmap parser (e.g. to generate TeX tables from an nmap scan)\n - Fix Lock_Mixin in execute module to remove lockfile at exit,\n   this used to rely on __del__ which breaks in certain cases.\n - add file upload to HTML_Parse\n\nVersion 0.13: Not announced on freshmeat\n\nBug-Fix Release: Fix signal handler in timeout.py\n\n - fix signal handler timeout.py\n\nVersion 0.12: Not announced on freshmeat\n\nAdd a simple timeout mechanism using SIGALRM.\n\n - add timeout.py\n\nVersion 0.11: Not announced on freshmeat\n\nAdd a parser for CDR records in asterisk. We currently use text-files\nonly, this might be later extended for database use. Some fixes for\nast_call, make call-handling more robust (some race conditions would\nidentify events of other calls as belonging to our initiated call).\nAdd an execute module for executing commands and handling IO, this also\nhas a Lock and a Log mixin. Add ocf.py, a small framework for writing\nOCF scripts for the heartbeat cluster resource manager (probably also\nusable for the newer version called pacemaker but for now only tested\nwith the version in Debian stable aka lenny). Add lcr.py to model the\nstatus of Linux Call Router ISDN lines.\n\n - add ast_cdr.py\n - fix ast_call.py\n - fix up-chaining in stateparser.py\n - add execute.py\n - add ocf.py\n - add lcr.py\n\nVersion 0.10: Not announced on freshmeat\n\nadd ast_call for asterisk auto-dialling, small fixes to IP4_Address, add\nbero*fos configurator, experimental code for checking PDF signature\n\n - add ast_call.py\n - Firstname: don't look up names with len < 2\n - IP4_Address: some aliases for common functions\n - IP4_Address: add __cmp__\n - bero.py: bero*fos configurator\n - HTML_Parse updated for python 2.5\n - stateparser update: use self.matrix by default\n - PDF_Signature: experimental code for checking signatures on adobe PDF\n   documents\n - iter_recipes: some magic with iterators\n\nVersion 0.9: Not announced on freshmeat\n\nAdd binom to the Math package, add Firstname, Bug-Fix Release Rational\n\n - binom (n, m) computes the binomial coefficient of n, m.\n - Firstname: check if candidate is a first name candidate according to\n   popular web site.\n - Rational: On division we could get a negative denominator -- fixed\n - make Config_File a descendent of autosuper\n\nVersion 0.8: Not announced on freshmeat\n\nAdded more documentation.\nState-machine parser stateparser implemented. Rational number arithmetic\npackage added.\n\n - stateparser implemented (simple state-machine line-oriented\n   configurable parser)\n - usage-example of IP4_Address prints debian /etc/network/interfaces\n   entry.\n - Math added (Euclids algorithm, gcd, lcm)\n - Rational number arithmetics\n - cookie processing for HTML_Parse\n - basic HTML auth for HTML_Parse\n - HTML_Parse: move to urllib2\n\nVersion 0.7: Not announced on freshmeat\n\nSmall Python library with various things such as Configuration file\nparsing (in Python syntax), HTML and PDF parsing.\n\n - First Release version\n", "description_content_type": "", "docs_url": null, "download_url": "http://downloads.sourceforge.net/project/rsclib/rsclib/0.56/rsclib-0.56.tar.gz", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://rsclib.sourceforge.net/", "keywords": "", "license": "GNU Library or Lesser General Public License (LGPL)", "maintainer": "", "maintainer_email": "", "name": "rsclib", "package_url": "https://pypi.org/project/rsclib/", "platform": "Any", "project_url": "https://pypi.org/project/rsclib/", "project_urls": {"Download": "http://downloads.sourceforge.net/project/rsclib/rsclib/0.56/rsclib-0.56.tar.gz", "Homepage": "http://rsclib.sourceforge.net/"}, "release_url": "https://pypi.org/project/rsclib/0.56/", "requires_dist": null, "requires_python": "", "summary": "Misc. basic stuff needed by RSCs tools", "version": "0.56", "yanked": false, "html_description": "<div class=\"project-description\">\n            <table>\n<col>\n<col>\n<tbody>\n<tr><th>Author:</th>\n<td>Ralf Schlatterbeck &lt;<a href=\"mailto:rsc%40runtux.com\">rsc<span>@</span>runtux<span>.</span>com</a>&gt;</td></tr>\n</tbody>\n</table>\n<p>The library includes various utility modules used in other projects.</p>\n<blockquote>\n<ul>\n<li>ast_call: A simple call manager using asterisk: This can be used to\noriginate a call and log all event associated to that call. So you\ncan find out the status of the call and optionally the dialstatus.</li>\n<li>ast_cdr: parser for CDR records in asterisk. We currently use\ntext-files only, this might be later extended for database use.</li>\n<li>ast_probe: Methods for checking for running asterisk</li>\n<li>Autosuper magic (originally from Guido van Rossums announcement of\nPython 2.2): For refactoring it’s a good idea that each class knows\nits parents (that the parent is not hardcoded in the upcall),\nachieved by adding a the __super attribute. Use as, e.g.,\nself.__super.method for calling method in the parent.</li>\n<li>base_pickler: Allow to specify a dictionary of pickle exceptions, if\nthe value in the dictionary is in __dict__ when pickle is called, the\nvalue in __dict__ is replaced with the value in the exception\ndictionary.</li>\n<li>bero: A configurator for the <a href=\"https://shop.beronet.com/product_info.php/cPath/56/products_id/159\" rel=\"nofollow\">bero*fos</a> failover switch. See my\n<a href=\"http://blog.runtux.com/2009/04/09/81/\" rel=\"nofollow\">blogpost</a> why I wrote that (short summary: to work around bugs in\nthe firmware of the device which are not addressed by the\nconfigurator code that comes with the device).</li>\n<li>Config_File for python-syntax configuration files used in several of\nmy projects.</li>\n<li>crm: Tools for the cluster resource manager of the pacemaker high\navailability project. We allow querying of nodes, resources and\nerrors for resources as well as resetting errors and migration of\nresources.</li>\n<li>execute: module for executing commands and handling IO, this also\nhas a Lock and a Log mixin. Now there is also a framework for\nexecuting processes in a pipeline, there can be fork-points in the\npipeline where the output of one process feeds several pipelines.\nSee test_exec.py, test2_exec.py and test3_exec.py.</li>\n<li>grepmime: search for pattern in email attachments (even if these are\nencoded)</li>\n<li>inductance: Inductance calculation of air-cored cylindrical\nflat-winded coil according to Robert Weaver\n<a href=\"http://electronbunker.ca/CalcMethods3b.html\" rel=\"nofollow\">http://electronbunker.ca/CalcMethods3b.html</a></li>\n<li>IP_Address: IP v4 and v6 Addresses with subnet masking</li>\n<li>iter_recipes: magic with iterators</li>\n<li>isdn: model the status of Asterisk ISDN lines, either Linux Call\nRouter (LCR) ISDN lines or lines managed by DAHDI. Special case for\nXorcom modules which provide more information using Xorcom-specific\nfiles in /proc than native DAHDI modules.</li>\n<li>lc_resonator: Frequency calculation for L-C resonator</li>\n<li>Math implements Euclids algorithm for greatest common divisor and as\na by-product the least common multiple</li>\n<li>nmap: A parser for output of nmap scans to (e.g. to generate tables\nin TeX)</li>\n<li>ocf: small framework for writing OCF scripts for the heartbeat\ncluster resource manager (probably also usable for the newer version\ncalled pacemaker but for now only tested with the version in Debian\nstable aka lenny).</li>\n<li>PDF_Signature: experimental code for checking signatures on adobe PDF\ndocuments</li>\n<li>Phone: Parse phone numbers (Austria-specific)</li>\n<li>PM_Value: Possibly missing value, encapsulate a number which may be\nmissing and associated arithmetics.</li>\n<li>pycompat: Utilities for running under different python versions</li>\n<li>Rational: Implementation of Rational numbers</li>\n<li>stateparser: Simple state-machine parser class, this is used for\nwriting line-based parsers using a state machine. For an example\nusage see nmap. After parsing the result can be pickled but we lose\nthe ability to continue parsing after reading from the pickled\nresult.</li>\n<li>sqlparser: Parse SQL dumps from postgreSQL and mysql and optionally\ncreate an new (e.g. anonymized) sql dump</li>\n<li>timeout: A simple timeout mechanism using SIGALRM</li>\n<li>Tex_CSV_Writer: Write CVS files in a syntax that can be parsed by\nTeX. Implements same interface as the csv module. Only implements\nwriting.</li>\n<li>trafficshape: Simple traffic shaping configuration: Currently\ngenerates Linux tc commands for a traffic shaping config using hfsc\nfor shaping and sfq or red for the leaf qdiscs. We also provide a\ntranslator from iptables mangle rules (for traffic marking) to tc\ncommands for filtering. This is needed if we want to do inbound\nshaping. The Linux kernel doesn’t support inbound shaping, so we need\nto redirect all traffic to an ifb device. On that device we do\n<em>outbound</em> shaping. Unfortunately when sending traffic to an ifb\ndevice with a tc filter + action mirred command this occurs <em>before</em>\nthe PREROUTING chain. This means packets are not yet marked. So we\nprovide a parser to translate mangle rules in the PREROUTING chain to\nappropriate tc commands. For implementing this we mark packets (using\nthe tc action xt (formerly known as ipt used for iptables marking, a\nbackward-compatibility option can be used) in the original device and\nthen use the marked information in the ifb device to send the traffic\nto appropriate qdiscs. This supports a two-level approach: Rules in\niptables that match on a packet mark (using –mark) are translated to\ntc commands in the ifb device (they depend on the mark already\npresent). All other rules are translated to a tc action xt (using -j\nMARK) and a tc action mirred redirect (for sending the traffic to the\nifb device) for the <em>original</em> device (e.g. eth0 redirecting to\nifb0). The PREROUTING commands by default are directly taken from the\nrunning kernel by default (using “iptables -t mangle -S -v”)</li>\n</ul>\n</blockquote>\n<div id=\"resources\">\n<h2>Resources</h2>\n<p>Download the source at <a href=\"https://sourceforge.net/projects/rsclib/\" rel=\"nofollow\">https://sourceforge.net/projects/rsclib/</a>\nand install using the standard python setup, e.g.:</p>\n<pre>python setup.py install --prefix=/usr/local\n</pre>\n<p>Alternatively get it from pypi and/or install via pip.</p>\n</div>\n<div id=\"changes\">\n<h2>Changes</h2>\n<p>Version 0.56: ast_call, isdn</p>\n<blockquote>\n<ul>\n<li>The ast_call now is brought to latest version of pyst and asterisk</li>\n<li>isdn module now supports remote isdn via isdn gateway</li>\n<li>various python3 fixes</li>\n</ul>\n</blockquote>\n<p>Version 0.55: LOCKDIR</p>\n<blockquote>\n<ul>\n<li>Now it’s possible to set the locking directory (default is still\n/var/lock which is a symlink to /run/lock on modern systems) via\nthe environment variable LOCKDIR.</li>\n</ul>\n</blockquote>\n<p>Version 0.54: inductance, sqlparser</p>\n<blockquote>\n<ul>\n<li>The sqlparser now can do round-tripping (some items are in\ndifferent order)</li>\n<li>More inductance formulae</li>\n</ul>\n</blockquote>\n<p>Version 0.53: inductance, IPv4 address</p>\n<blockquote>\n<ul>\n<li>Bring inductance to metric units (output in F, input in m)</li>\n<li>Fix IPv4 address parsing when address contains less than 3 dots</li>\n</ul>\n</blockquote>\n<p>Version 0.52: Small fixes</p>\n<blockquote>\n<ul>\n<li>Fix unicode problem in sqlparser</li>\n</ul>\n</blockquote>\n<p>Version 0.51: Small fixes</p>\n<blockquote>\n<ul>\n<li>Fix IP addresses in boolean context</li>\n<li>Add supported python versions to setup.py</li>\n</ul>\n</blockquote>\n<p>Version 0.50: Small additions</p>\n<blockquote>\n<ul>\n<li>Change Rational to no longer print mixed fractions by default</li>\n<li>Allow setting the locking filename for Lock_Mixin in execute</li>\n</ul>\n</blockquote>\n<p>Version 0.49: Python3 compatibility</p>\n<blockquote>\n<ul>\n<li>Remove ETree, HTML_Parse, PDF_Parse, multipart_form: These are\nbetter handled by libraries like BeautifulSoup or specific PDF\nhandling libs or the requests library</li>\n<li>Remove ldap_lib.py: This is now nicely supported by ldap3 which\nalso has a native iterator for paged search</li>\n<li>Remove Freshmeat.py: Freshmeat is more or less dead now and they\ndon’t support an API-Test so it is very hard to get this right</li>\n<li>Put Firstname (with all the history) into its own package, note\nthat this needs more work to run against the latest version of the\nwebsite</li>\n<li>Lots of fixes for python3 compatibility: Where doctests existed\nthese pass now but there is still untested code and some code where\nlibaries are missing for python3 (pyst asterisk bindings and\nopenssl wrappers)</li>\n</ul>\n</blockquote>\n<p>Version 0.48: Fixes for execute</p>\n<blockquote>\n<ul>\n<li>Now we really close all relevant ends of pipes in other processes\nwhich avoids hangs</li>\n<li>Add logging to Process</li>\n</ul>\n</blockquote>\n<p>Version 0.47: Fixes for IP_Address; pypi</p>\n<blockquote>\n<ul>\n<li>IP_Address: Relax inheritance checks when comparing IP_Address\ninstances</li>\n<li>Version uploaded to pypi and documented in README</li>\n</ul>\n</blockquote>\n<p>Version 0.46: Additions to ast_probe; Bug-fix</p>\n<blockquote>\n<ul>\n<li>ast_probe now has methods for checking sip registry and reloading\nthe sip subsystem in asterisk</li>\n<li>Add a small script, ast_sip_check for checking sip registration on\nan asterisk server and restart sip if some registrations are\nmissing.</li>\n<li>Config_File fixes the __getattr_ method to return an\nAttributeError in case of failure</li>\n</ul>\n</blockquote>\n<p>Version 0.45: Fix ISDN ports</p>\n<p>String reprentation had leading unicode ‘u’</p>\n<blockquote>\n<ul>\n<li>Fix string representation in ISDN ports</li>\n</ul>\n</blockquote>\n<p>Version 0.44: Make line-waiting for bero configurable</p>\n<p>For cluster resource berofos we make waiting for the L1 and L2 of the\nISDN line configurable. The hard-coded default was too low.</p>\n<blockquote>\n<ul>\n<li>New config-item ISDN_WAIT_UP</li>\n</ul>\n</blockquote>\n<p>Version 0.43: Support new berofos firmware</p>\n<p>The new berofos (failover switch) firmware has some new low-level\ncommands which we now accept when getting the device status.</p>\n<blockquote>\n<ul>\n<li>Fix bero.py to accept new low-level commands</li>\n<li>Add some more documentation to bero.py</li>\n<li>Add description of ast_probe in this README</li>\n</ul>\n</blockquote>\n<p>Version 0.42: Feature enhancements</p>\n<p>Add crm for pacemaker cluster management, new ast_probe for checking of\nasterisk status. Fixes to ocf and ast_call.</p>\n<blockquote>\n<ul>\n<li>Add crm.py</li>\n<li>Add ast_probe.py</li>\n<li>Allow specification of parsed config (cfg) for Call_Manager in\nast_call.py</li>\n<li>Better resource monitoring for asterisk and dahdi in ocf.py</li>\n<li>fix ocf.py to use new classes in isdn.py</li>\n<li>isdn.py now doesn’t probe asterisk for the isdn stack in use if it\nfinds a hint in the config-file</li>\n</ul>\n</blockquote>\n<p>Version 0.41: Minor feature enhancements</p>\n<p>Fixes to Freshmeat, pycompat, sql-dump parser.</p>\n<blockquote>\n<ul>\n<li>Fix parsing of escaped quotes in mysql dumps</li>\n<li>Freshmeat</li>\n<li>pycompat fixes</li>\n</ul>\n</blockquote>\n<p>Version 0.40: Distribution bug-fix</p>\n<p>Renaming of README lead to the missing file README.rst in the distro.</p>\n<blockquote>\n<ul>\n<li>Fix MANIFEST.in</li>\n</ul>\n</blockquote>\n<p>Version 0.39: Minor feature enhancements</p>\n<p>Fixes to hexdump, unicode issues (elementtree wrapper, stateparser).\nAdd some fixes to IP_Address comparison. The nmap output has changed in\nrecent versions, adapt to new format.</p>\n<blockquote>\n<ul>\n<li>Make address in hexdump configurable</li>\n<li>Bug-fix with comparison of sub-classes in IP_Address</li>\n<li>Unicode support in ETree</li>\n<li>Unicode support in stateparser</li>\n<li>Fix for trailing empty attributes in CSV output of PostgreSQL dumps\nin sqlparser</li>\n<li>Unicode support in sqlparser (uses stateparser)</li>\n<li>Parse new nmap format</li>\n<li>Fix for configurable Releasetools location</li>\n</ul>\n</blockquote>\n<p>Version 0.38: Minor feature enhancements</p>\n<p>Fix boolean conversion of IP6_Address (and IP4_Address).</p>\n<blockquote>\n<ul>\n<li>IP6_Address would throw an error when trying a truth-test. Add\n__nonzero__ (which always returns True even for the 0 Address)</li>\n</ul>\n</blockquote>\n<p>Version 0.37: Minor feature enhancements</p>\n<p>Change sort-order of IP_Address, make IP_Address immutable, use\nmetaclass magic to allow copy-constructor semantics.</p>\n<blockquote>\n<ul>\n<li>Sort order of IP_Address objects (both v4 and v6) now reverses the\norder of the netmask: If the IP-Address part of the objects to\ncompare are the same, we used to sort by <em>inverse</em> netmask (putting\nsmaller networks with higher netmask first). We now reversed this to\nbe compatible with PostgrSQL cidr type objects.</li>\n<li>All attributes of IP_Address objects are now implemented as\nproperties to return the ‘_’ variant of the attribute. Thus\nIP_Address objects are (when using the public interface) immutable.\nSince we already had a __hash__ method this effectively fixes the\ninterface to not allow mutation of objects that are in a dictionary.</li>\n<li>Allow calling the IP_Address constructors with another IP_Address\nobject. Since IP_Address objects are now immutable we use metaclass\ntrickery to return the passed object itself (instead of generating a\ncopy).</li>\n</ul>\n</blockquote>\n<p>Version 0.36: Minor feature enhancements</p>\n<p>Allow auto-coercion of comparison parameters. Add parent property and\nis_sibling test.</p>\n<blockquote>\n<ul>\n<li>Now comparison operators and ‘in’ do auto coercion.</li>\n<li>Add parent property (next bigger network)</li>\n<li>Add is_sibling test (same parent)</li>\n</ul>\n</blockquote>\n<p>Version 0.35: Minor feature enhancements</p>\n<p>Add ‘mask_len’ as an alias of ‘mask’ to IP_Address.</p>\n<blockquote>\n<ul>\n<li>Need the network mask length (aka prefix length) sometimes as\nmask_len (e.g. for FFM on github).</li>\n</ul>\n</blockquote>\n<p>Version 0.34: Minor feature enhancements</p>\n<p>Fix trafficshape to use new tc syntax. Add label to hexdump.</p>\n<blockquote>\n<ul>\n<li>The tc command has renamed the <tt>ipt</tt> action to <tt>xt</tt> (Linux\nintroduced xtables as a refactoring of iptables), the old <tt>ipt</tt> is\nstill available in <tt>iproute2</tt> but we make <tt>xt</tt> the default now.\nA backward-compatibility parameter can be used to get the old\nbehavior.</li>\n<li>Add save-mark to iptables action parser.</li>\n<li>The hexdump class now can generate labels.</li>\n</ul>\n</blockquote>\n<p>Version 0.33: Minor feature enhancements</p>\n<p>More fixes for ast_call.</p>\n<blockquote>\n<ul>\n<li>Add parser for events from asterisk wireshark trace</li>\n<li>Add fail.log for ‘real’ test</li>\n<li>Don’t double-register call with Call_Manager</li>\n<li>Allow explicit matching by account-code</li>\n</ul>\n</blockquote>\n<p>Version 0.32: Minor feature enhancements</p>\n<p>More fixes for ast_call.</p>\n<blockquote>\n<ul>\n<li>Regression test with pyst asterisk emulator</li>\n<li>Fix case where OriginateResponse immediately returns Failure</li>\n<li>Tests for cases where Hangup comes before or after the\nOriginateResponse</li>\n</ul>\n</blockquote>\n<p>Version 0.31: Minor feature enhancements</p>\n<p>Fix ast_call for immediately failing calls. Fix dahdi channel\ncomputation in isdn.py.</p>\n<blockquote>\n<ul>\n<li>Fix OriginateResponse handling in ast_call</li>\n<li>Fix dahdi channel computation, can’t directly use the span, use the\nbasechan attribute</li>\n</ul>\n</blockquote>\n<p>Version 0.30: Minor feature enhancements</p>\n<p>Fix how dahdi vs. mISDN interpret what is called an interface and what\nis called a port. In mISDN we can combine several ports (physical lines)\nto an interface. In dahdi both are the same (a port is a span in dahdi).</p>\n<blockquote>\n<ul>\n<li>Remove parsing of B- and C- channels from dahdi isdn parser</li>\n</ul>\n</blockquote>\n<p>Version 0.29: Minor feature enhancements</p>\n<p>The lcr module is now named isdn. It can now handle isdn interfaces\nmanaged by Asterisk DAHDI in addition to Linux Call Router (LCR).</p>\n<p>Version 0.28: Minor feature enhancements</p>\n<p>Fix inductance formula of Robert Weaver, thanks Robert for pointing me\nto the correction you did on your new site! For most doctests in the\ninductance module the error was in the lower percentage points.\nAdd an xxrange iterator to the iter_recipes that can replace pythons\nnative xrange iterator but works with long integers. Needed for some\noperations on IPv6 addresses in the IP_Address module.</p>\n<blockquote>\n<ul>\n<li>Fix inductance calculation according to patch from Robert Weaver</li>\n<li>Add xxrange iterator to iter_recipes</li>\n<li>Use new xxrange instead of xrange in IP_Address module, add a test\nthat failed with large numbers for IPv6</li>\n</ul>\n</blockquote>\n<p>Version 0.27: Minor feature enhancements</p>\n<p>Add pageurl and pageinfo attributes to HTML_Parser.Page_Tree, other\nenhancements to HTML_Parser. Add pickle support to parser classes.\nFix comparison of IP_Address classes.</p>\n<blockquote>\n<ul>\n<li>Add pageurl and pageinfo attributes to HTML_Parser.Page_Tree storing\ninformation retrieved via geturl and info calls from urllib2.</li>\n<li>Parser classes in stateparser.py and HTML_Parse.py where not\npickleable, fixed by removing parser-specific attributes when calling\npickle. Note that the parsing cannot be continued after reading class\nfrom a pickle.</li>\n<li>Add base_pickler module to allow pickle exceptions</li>\n<li>HTML_Parse: Make Parse_Error a ValueError</li>\n<li>HTML_Parse: Raise line number with exception</li>\n<li>HTML_Parse: Add a timeout</li>\n<li>HTML_Parse: raise Retries_Exceeded with url</li>\n<li>HTML_Parse: url parameter may now be None, not joined with site\nparameter</li>\n<li>Add pageurl and pageinfo to HTML_Parse</li>\n<li>IP_Address: Fix comparison</li>\n<li>Slight refactoring of NMAP_Parser class</li>\n</ul>\n</blockquote>\n<p>Version 0.26: Minor feature enhancements</p>\n<p>Fix double-utf-8-encoding option for sqlparser. Enhance stderr handling\nfor exec_pipe.</p>\n<blockquote>\n<ul>\n<li>More detected broken encodings for fix_double_encode option</li>\n<li>execute.py: add error message from executed command to message raised\nby exec_pipe, make stderr output available in non-failing case.</li>\n</ul>\n</blockquote>\n<p>Version 0.25: Minor feature enhancements</p>\n<p>Add sqlparser for parsing SQL dumps of PostgreSQL and mysql, add Phone\nto parse phone numbers.</p>\n<blockquote>\n<ul>\n<li>sqlparser added</li>\n<li>Phone added for parsing phone numbers</li>\n</ul>\n</blockquote>\n<p>Version 0.24: Minor feature enhancements</p>\n<p>Better syntax checks and comparison operators for IP_Address, bug fixes\nfor parser and __str__ for IP_Address.IP6_Address</p>\n<blockquote>\n<ul>\n<li>IP_Address better syntax checks</li>\n<li>IP_Address __cmp__ and __eq__ improved for comparison with other types</li>\n<li>more regression tests for IP6_Address</li>\n<li>bug fixes in __str__ and parser of IP6_Address</li>\n<li>support for strict checking of netmask (all bits at right of netmask\nmust be zero if strict_mask is True)</li>\n</ul>\n</blockquote>\n<p>Version 0.23: Minor feature enhancements</p>\n<p>IP4_Address can now be put in a dict, add a subnets iterator for\nIP4_Address. Factor IP_Address and add IP6_Address</p>\n<blockquote>\n<ul>\n<li>Add __hash__ for IP_Address</li>\n<li>The new subnets iterator for IP_Address iterates over all IPs in a\nsubnet. Optionally a netmask can be specified.</li>\n<li>Support for IPv6 addresses</li>\n<li>rename IP4_Address to IP_Address</li>\n</ul>\n</blockquote>\n<p>Version 0.22: Minor feature enhancements</p>\n<p>Allow unicode ip address input, hopefully make rsclib installable via pip.</p>\n<blockquote>\n<ul>\n<li>Address given to IP4_Address constructor now may be unicode</li>\n<li>Add download_url to setup.py to make installable via pip</li>\n</ul>\n</blockquote>\n<p>Version 0.21: Minor feature enhancements</p>\n<p>Fix autosuper: allow to inherit from non-autosuper classes, some small\nfixes to ast_call and lcr parser. Fix ETree pretty-printing. Update\nFreshmeat to new hostname. Add dotted netmaks parsing to IP4_Address.</p>\n<blockquote>\n<ul>\n<li>Since python2.6 constructor of “object” do not allow parameters, so\nwe need to strip these when doing the upcall from autosuper. This\nfails when e.g. inheriting from a non-autosuper enabled class, e.g.,\nclass (With_Autosuper, dict)\nin that case dict would get empty parameters. New implementation\nfinds out if our upcall is to “object”, only in that case strip\nparameters.</li>\n<li>ast_call now processes all queued unhandled events when a call is\nmatched.</li>\n<li>update regression test for ast_call.Call</li>\n<li>lcr parser: fix regex, port can have an empty name.</li>\n<li>Optimize call matching in ast_call: mark call as closed once we are\nsure about the uniqueid. Add matching of Account-Code.</li>\n<li>Fix ETree pretty-printing: don’t print unicode strings when arguments\nare already converted</li>\n<li>freshmeat.net now is freecode.com (and the API redirects there),\nupdate Freshmeat.py to new hostname (including .netrc credentials\nwith compatibility for old name).</li>\n<li>explicit mask paramter of IP4_Address can now be a dotted netmask.</li>\n</ul>\n</blockquote>\n<p>Version 0.20: Not announced on freshmeat</p>\n<p>Database value output for ast_cdr, added inductance calculation.</p>\n<blockquote>\n<ul>\n<li>ast_cdr: Add methods for database values of CDR records – database\nvalues of CDRs are different, they don’t include start, end, answer\ntime-stamps but instead only a calldate, in addition the amaflags are\nnumerical in the database.</li>\n<li>added inductance calculation</li>\n</ul>\n</blockquote>\n<p>Version 0.19: Not announced on freshmeat</p>\n<p>Extend ETree with a walk method and implement small ldap library</p>\n<blockquote>\n<ul>\n<li>ETree: add walk method to walk the tree and call an optional pre- and\npost-hook function</li>\n<li>ldap_lib: common ldap tasks for user and group search, and an\niterator for paged search (used with active directory).</li>\n</ul>\n</blockquote>\n<p>Version 0.18: Not announced on freshmeat</p>\n<p>Bugfix of ast_call and update for asterisk 1.6, small extension to\nIP4_Address.</p>\n<blockquote>\n<ul>\n<li>ast_call: match calls via (unique) account code</li>\n<li>ast_call: State vs ChannelState parameter in Newstate event</li>\n<li>ast_call: handle immediate error from asterisk (e.g. Permission Denied)</li>\n<li>IP4_Address: add netblk (start and end address for address with\nnetmask)</li>\n</ul>\n</blockquote>\n<p>Version 0.17: Not announced on freshmeat</p>\n<p>Factor ETree (extended ElementTree) from HTML_Parse. New Freshmeat\nmodule to get project information and submit new releases via the new\nfreshmeat REST API. New simple hexdump module.</p>\n<blockquote>\n<ul>\n<li>New ETree.py (extended ElementTree)</li>\n<li>New Freshmeat.py</li>\n<li>New hexdump.py</li>\n<li>adapt lcr module to new version of Linux Call Router</li>\n</ul>\n</blockquote>\n<p>Version 0.16: Not announced on freshmeat</p>\n<p>Add an iptables to tc translator for translating mangle rules in the\niptables PREROUTING chain to appropriate tc commands (using an ipt\naction and mirred redirect actions).</p>\n<blockquote>\n<ul>\n<li>Add iptables to tc translator to trafficshape.py</li>\n</ul>\n</blockquote>\n<p>Version 0.15: Not announced on freshmeat</p>\n<p>Add a framework for traffic shaping with linux iproute (tc). Minor\nupdates to iter_recipes.</p>\n<blockquote>\n<ul>\n<li>Initial implementation of trafficshape.py</li>\n<li>Add iter_recipes.combinations from python2.6 manpage of itertools\nfor backward compatibility</li>\n</ul>\n</blockquote>\n<p>Version 0.14: Not announced on freshmeat</p>\n<p>Add a framework for process pipeline execution, processes can either be\npython methods or external programs (with parameter list).  They can be\nconnected in a pipe and there may be T-points in the pipe, where the\npipe forks into two or more pipelines fed by the output of one process.</p>\n<blockquote>\n<ul>\n<li>Add process pipeline framework</li>\n<li>HTML_Parse now has an explicit translate hook for preprocessing the\nhtml page before parsing it. This defaults to the old behaviour of\nfiltering out common characters in broken HTML.</li>\n<li>Add nmap parser (e.g. to generate TeX tables from an nmap scan)</li>\n<li>Fix Lock_Mixin in execute module to remove lockfile at exit,\nthis used to rely on __del__ which breaks in certain cases.</li>\n<li>add file upload to HTML_Parse</li>\n</ul>\n</blockquote>\n<p>Version 0.13: Not announced on freshmeat</p>\n<p>Bug-Fix Release: Fix signal handler in timeout.py</p>\n<blockquote>\n<ul>\n<li>fix signal handler timeout.py</li>\n</ul>\n</blockquote>\n<p>Version 0.12: Not announced on freshmeat</p>\n<p>Add a simple timeout mechanism using SIGALRM.</p>\n<blockquote>\n<ul>\n<li>add timeout.py</li>\n</ul>\n</blockquote>\n<p>Version 0.11: Not announced on freshmeat</p>\n<p>Add a parser for CDR records in asterisk. We currently use text-files\nonly, this might be later extended for database use. Some fixes for\nast_call, make call-handling more robust (some race conditions would\nidentify events of other calls as belonging to our initiated call).\nAdd an execute module for executing commands and handling IO, this also\nhas a Lock and a Log mixin. Add ocf.py, a small framework for writing\nOCF scripts for the heartbeat cluster resource manager (probably also\nusable for the newer version called pacemaker but for now only tested\nwith the version in Debian stable aka lenny). Add lcr.py to model the\nstatus of Linux Call Router ISDN lines.</p>\n<blockquote>\n<ul>\n<li>add ast_cdr.py</li>\n<li>fix ast_call.py</li>\n<li>fix up-chaining in stateparser.py</li>\n<li>add execute.py</li>\n<li>add ocf.py</li>\n<li>add lcr.py</li>\n</ul>\n</blockquote>\n<p>Version 0.10: Not announced on freshmeat</p>\n<p>add ast_call for asterisk auto-dialling, small fixes to IP4_Address, add\nbero*fos configurator, experimental code for checking PDF signature</p>\n<blockquote>\n<ul>\n<li>add ast_call.py</li>\n<li>Firstname: don’t look up names with len &lt; 2</li>\n<li>IP4_Address: some aliases for common functions</li>\n<li>IP4_Address: add __cmp__</li>\n<li>bero.py: bero*fos configurator</li>\n<li>HTML_Parse updated for python 2.5</li>\n<li>stateparser update: use self.matrix by default</li>\n<li>PDF_Signature: experimental code for checking signatures on adobe PDF\ndocuments</li>\n<li>iter_recipes: some magic with iterators</li>\n</ul>\n</blockquote>\n<p>Version 0.9: Not announced on freshmeat</p>\n<p>Add binom to the Math package, add Firstname, Bug-Fix Release Rational</p>\n<blockquote>\n<ul>\n<li>binom (n, m) computes the binomial coefficient of n, m.</li>\n<li>Firstname: check if candidate is a first name candidate according to\npopular web site.</li>\n<li>Rational: On division we could get a negative denominator – fixed</li>\n<li>make Config_File a descendent of autosuper</li>\n</ul>\n</blockquote>\n<p>Version 0.8: Not announced on freshmeat</p>\n<p>Added more documentation.\nState-machine parser stateparser implemented. Rational number arithmetic\npackage added.</p>\n<blockquote>\n<ul>\n<li>stateparser implemented (simple state-machine line-oriented\nconfigurable parser)</li>\n<li>usage-example of IP4_Address prints debian /etc/network/interfaces\nentry.</li>\n<li>Math added (Euclids algorithm, gcd, lcm)</li>\n<li>Rational number arithmetics</li>\n<li>cookie processing for HTML_Parse</li>\n<li>basic HTML auth for HTML_Parse</li>\n<li>HTML_Parse: move to urllib2</li>\n</ul>\n</blockquote>\n<p>Version 0.7: Not announced on freshmeat</p>\n<p>Small Python library with various things such as Configuration file\nparsing (in Python syntax), HTML and PDF parsing.</p>\n<blockquote>\n<ul>\n<li>First Release version</li>\n</ul>\n</blockquote>\n</div>\n\n          </div>"}, "last_serial": 6740986, "releases": {"0.21.9310": [], "0.22.9670": [], "0.23.9706": [], "0.24.9714": [], "0.25.9747": [], "0.27.10243": [], "0.28.10251": [], "0.29.10330": [], "0.30.10510": [], "0.31.10517": [], "0.32.10528": [], "0.33.10540": [], "0.34.10653": [], "0.35.10687": [], "0.37.10730": [], "0.38.10748": [], "0.39": [], "0.40": [], "0.41": [], "0.42": [], "0.43": [], "0.44": [], "0.45": [], "0.46": [], "0.47": [{"comment_text": "", "digests": {"md5": "c2d56099b5a4c4f2d5d1233000900d9e", "sha256": "9842b4ecaaafd7b9e4dfdcf4d750cec5ddad5bbaa0a5709b7d86630ada590c95"}, "downloads": -1, "filename": "rsclib-0.47.tar.gz", "has_sig": false, "md5_digest": "c2d56099b5a4c4f2d5d1233000900d9e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 102987, "upload_time": "2016-06-06T11:23:57", "upload_time_iso_8601": "2016-06-06T11:23:57.979838Z", "url": "https://files.pythonhosted.org/packages/b5/c9/8f27fd42c17728e238a7b14a35d7c18bb028830574669ae7329a4544b453/rsclib-0.47.tar.gz", "yanked": false}], "0.48": [{"comment_text": "", "digests": {"md5": "bd47d8aeb671e3adf070a488c0651f2e", "sha256": "c0db54b92ae7acb2dbb73a8825a72b5f0f91e7a0ee3346cb923673f2a391b72e"}, "downloads": -1, "filename": "rsclib-0.48.tar.gz", "has_sig": false, "md5_digest": "bd47d8aeb671e3adf070a488c0651f2e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 103441, "upload_time": "2016-07-01T10:55:14", "upload_time_iso_8601": "2016-07-01T10:55:14.146960Z", "url": "https://files.pythonhosted.org/packages/f9/54/ed1c039c2ee9e5bf98022d3956a79740fbb89ec9714fe02ac6a272ab914f/rsclib-0.48.tar.gz", "yanked": false}], "0.49": [{"comment_text": "", "digests": {"md5": "bb9cca1e5a02be4a7f38f1632afc66a1", "sha256": "41c831329658da6b4870fd3287f32af9e89663cb7845700c0acdbc3035087427"}, "downloads": -1, "filename": "rsclib-0.49.tar.gz", "has_sig": false, "md5_digest": "bb9cca1e5a02be4a7f38f1632afc66a1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 85064, "upload_time": "2017-07-25T07:01:01", "upload_time_iso_8601": "2017-07-25T07:01:01.589717Z", "url": "https://files.pythonhosted.org/packages/44/ce/d1093105ee8a38f110b4d5e477241150b6c55b3d655304b8e2f1ffc7f82a/rsclib-0.49.tar.gz", "yanked": false}], "0.50": [{"comment_text": "", "digests": {"md5": "1ac8f6e6899a95f38378c0d717d05106", "sha256": "9a4bbf83c07c55fdf2faacdcb0b6eb2f5d7b97651562f9bad740156356a6fa16"}, "downloads": -1, "filename": "rsclib-0.50.tar.gz", "has_sig": false, "md5_digest": "1ac8f6e6899a95f38378c0d717d05106", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 85237, "upload_time": "2018-03-14T19:04:19", "upload_time_iso_8601": "2018-03-14T19:04:19.936668Z", "url": "https://files.pythonhosted.org/packages/c8/77/778525c91257d48de9019208d9f90509a44c8ee0c9372e413c20293865ea/rsclib-0.50.tar.gz", "yanked": false}], "0.51": [{"comment_text": "", "digests": {"md5": "9182c276302fcc5e16eab155fd45a6e1", "sha256": "38ca5288499b51e2b9d72601048d893964fbed365f0a9ade5dae5c0c3df14eab"}, "downloads": -1, "filename": "rsclib-0.51.tar.gz", "has_sig": false, "md5_digest": "9182c276302fcc5e16eab155fd45a6e1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 85476, "upload_time": "2018-03-19T15:37:13", "upload_time_iso_8601": "2018-03-19T15:37:13.672011Z", "url": "https://files.pythonhosted.org/packages/21/4c/62760d8fa2da0a843402aa39e5bb635690a74c83ac974b37fc08d91d6498/rsclib-0.51.tar.gz", "yanked": false}], "0.52": [{"comment_text": "", "digests": {"md5": "9ae6b7d7acc86558d239570cccba6344", "sha256": "1b50aef95dc95f8ec1df461dfba884a08a5e2d6eca358c9752ecbd4b918203e0"}, "downloads": -1, "filename": "rsclib-0.52.tar.gz", "has_sig": false, "md5_digest": "9ae6b7d7acc86558d239570cccba6344", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 85612, "upload_time": "2018-04-15T19:13:57", "upload_time_iso_8601": "2018-04-15T19:13:57.676386Z", "url": "https://files.pythonhosted.org/packages/44/7c/c1a1eea17cdf2a4a243f3d36b18a6c7a81d472accddd4f3b9587efa6ce6e/rsclib-0.52.tar.gz", "yanked": false}], "0.53": [{"comment_text": "", "digests": {"md5": "4b66bd5c3a059064c3df5dd879f57d75", "sha256": "9618f23e31caf4161bdb66b577e7ad07d734f1cc45658d79d9be85ed58520f1f"}, "downloads": -1, "filename": "rsclib-0.53.tar.gz", "has_sig": false, "md5_digest": "4b66bd5c3a059064c3df5dd879f57d75", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 86554, "upload_time": "2018-08-09T10:18:39", "upload_time_iso_8601": "2018-08-09T10:18:39.882585Z", "url": "https://files.pythonhosted.org/packages/31/46/4bb4cfa9ab76b8a2e7fc912455f08ffff78238e70cf7ff6f2f2378e48cc0/rsclib-0.53.tar.gz", "yanked": false}], "0.54": [{"comment_text": "", "digests": {"md5": "ac4e55bc52fca8d5883556b8af58af88", "sha256": "c94d76c719fd5e19230439d056b0bc02e63aa40f95098ea6ec0b8a385f2a3b3a"}, "downloads": -1, "filename": "rsclib-0.54.tar.gz", "has_sig": false, "md5_digest": "ac4e55bc52fca8d5883556b8af58af88", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 94852, "upload_time": "2018-10-06T12:02:58", "upload_time_iso_8601": "2018-10-06T12:02:58.476998Z", "url": "https://files.pythonhosted.org/packages/e5/8f/50c13a8832c9b2d74e42af8d6448ede832a172a130c7ed771df893b2976c/rsclib-0.54.tar.gz", "yanked": false}], "0.55": [{"comment_text": "", "digests": {"md5": "8bd17462c72480a00dcf90955da41cef", "sha256": "d05607eb3a74e4951005bbf6933e088cb9c72112d3a568d15bcdf8837b6e65c5"}, "downloads": -1, "filename": "rsclib-0.55.tar.gz", "has_sig": false, "md5_digest": "8bd17462c72480a00dcf90955da41cef", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 95476, "upload_time": "2019-03-07T17:26:14", "upload_time_iso_8601": "2019-03-07T17:26:14.505453Z", "url": "https://files.pythonhosted.org/packages/84/7b/8d13a9f7c690053408affb3ed3a3cb6d1b6fe6e8338afa4130ba24cdf52a/rsclib-0.55.tar.gz", "yanked": false}], "0.56": [{"comment_text": "", "digests": {"md5": "80935d03bbc63d2ab87f86e3720d39a6", "sha256": "2305fdb31a4b5ca83764b5949d91523a334ec310c3b469e3d16cc8b9d841e260"}, "downloads": -1, "filename": "rsclib-0.56.tar.gz", "has_sig": false, "md5_digest": "80935d03bbc63d2ab87f86e3720d39a6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 99332, "upload_time": "2020-03-03T14:19:54", "upload_time_iso_8601": "2020-03-03T14:19:54.026576Z", "url": "https://files.pythonhosted.org/packages/ca/74/6060d8c60e74c33ec7ea0bacecc065b6e014c99776b642ee76f5508b72a8/rsclib-0.56.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "80935d03bbc63d2ab87f86e3720d39a6", "sha256": "2305fdb31a4b5ca83764b5949d91523a334ec310c3b469e3d16cc8b9d841e260"}, "downloads": -1, "filename": "rsclib-0.56.tar.gz", "has_sig": false, "md5_digest": "80935d03bbc63d2ab87f86e3720d39a6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 99332, "upload_time": "2020-03-03T14:19:54", "upload_time_iso_8601": "2020-03-03T14:19:54.026576Z", "url": "https://files.pythonhosted.org/packages/ca/74/6060d8c60e74c33ec7ea0bacecc065b6e014c99776b642ee76f5508b72a8/rsclib-0.56.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:00:43 2020"}