{"info": {"author": "Carroll L. Wainwright", "author_email": "carroll@partnershiponai.org", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: Apache Software License", "Operating System :: OS Independent", "Programming Language :: Python :: 3", "Topic :: Scientific/Engineering :: Artificial Intelligence"], "description": "# SafeLife\n\nSafeLife is a novel environment to test the safety of reinforcement learning agents. The long term goal of this project is to develop training environments and benchmarks for numerous technical reinforcement learning safety problems, with the following attributes:\n\n* Controllable difficulty for the environment\n* Controllable difficulty for safety constraints\n* Procedurally generated levels with richly adjustable distributions of mechanics and phenomena to reduce overfitting\n\nThe initial SafeLife version 1.0 (and the roadmap for the next few releases)\nfocuses at first on the problem of side effects: how can one specify that an\nagent does whatever it needs to do to accomplish its goals, but nothing more? In SafeLife, an agent is tasked with creating or removing certain specified\npatterns, but its reward function is indifferent to its effects on other\npre-existing patterns. A *safe* agent will learn to minimize its effects on\nthose other patterns without explicitly being told to do so.\n\nThe SafeLife code base includes\n\n- the environment definition (observations, available actions, and transitions between states);\n- [example levels](./safelife/levels/), including benchmark levels;\n- methods to procedurally generate new levels of varying difficulty;\n- an implementation of proximal policy optimization to train reinforcement learning agents;\n- a set of scripts to simplify [training on Google Cloud](./gcloud).\n\nMinimizing side effects is very much an unsolved problem, and our baseline trained agents do not necessarily do a good job of it! The goal of SafeLife is to allow others to easily test their algorithms and improve upon the current state.\n\nA paper describing the SafeLife environment is available [on arXiv](https://arxiv.org/abs/1912.01217).\n\n\n## Quick start\n\n### Standard installation\n\nSafeLife requires Python 3.5 or better. If you wish to install in a clean environment, it's recommended to use [python virtual environments](https://docs.python.org/3/library/venv.html). You can then install SafeLife using\n\n    pip3 install safelife\n\nNote that the logging utilities (`safelife.safelife_logger`) have extra requirements which are not installed by default. These includes [ffmpeg](https://ffmpeg.org) (e.g., `sudo apt-get install ffmpeg` or `brew install ffmpeg`) and `tensorboardX` (`pip3 install tensorboardX`). However, these aren't required to run the environment either interactively or programmatically.\n\n### Local installation\n\nAlternatively, you can install locally by downloading this repository and running\n\n    pip3 install -r requirements.txt\n    python3 setup.py build_ext --inplace\n\nThis will download all of the requirements and build the C extensions in the `safelife` source folder. **Note that you must have have a C compiler installed on your system to compile the extensions!** This can be useful if forking and developing the project or running the standard training scripts.\n\nWhen running locally, console commands will need to use `python3 -m safelife [args]` instead of just `safelife [args]`.\n\n\n### Interactive play\n\nTo jump into a game, run\n\n    safelife play puzzles\n\nAll of the puzzle levels are solvable. See if you can do it without disturbing the green patterns!\n\n(You can run `safelife play --help` to get help on the command-line options. More detail of how the game works is provided below, but it can be fun to try to figure out the basic mechanics yourself.)\n\n\n### Training an agent\n\nThe `start-training` script is an easy way to get agents up and running using the default proximal policy optimization implementation. Just run\n\n    ./start-training my-training-run\n\nto start training locally with all saved files going into a new \"my-training-run\" directory. See below or `./start-training --help` for more details.\n\n\n## Contributing\n\nWe are very happy to have contributors and collaborators! To contribute code, fork this repo and make a pull request. All submitted code should be lint-free. Download flake8 (`pip3 install flake8`) and ensure that running `flake8` in this directory results in no errors.\n\nIf you would like to establish a longer collaboration or research agenda using SafeLife, contact carroll@partnershiponai.org directly.\n\n\n## Environment Overview\n\n<p align=\"center\">\n<img alt=\"pattern demo\" src=\"https://github.com/PartnershipOnAI/safelife-videos/blob/master/pattern-demo.gif?raw=true\"/>\n</p>\n\n### Rules\n\nSafeLife is based on [Conway's Game of Life](https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life), a set of rules for cellular automata on an infinite two-dimensional grid. In Conway's Game of Life, every cell on the grid is either *alive* or *dead*. At each time step the entire grid is updated. Any living cell with fewer than two or more than three living neighbors dies, and any dead cell with exactly three living neighbors comes alive. All other cells retain their previous state. With just these simple rules, extraordinarily complex patterns can emerge. Some patterns will be static—they won't change between time steps. Other patterns will oscillate between two, or three, [or more](https://www.conwaylife.com/wiki/Jason%27s_p156) states. Gliders and spaceships travel across the grid, while guns and [puffers](https://en.wikipedia.org/wiki/Puffer_train) can produce never-ending streams of new patterns. Conway's Game of Life is Turing complete; anything that can be calculated can be calculated in Game of Life using a large enough grid. Some enterprising souls have taken this to its logical conclusion and [implemented Tetris](https://codegolf.stackexchange.com/q/11880) in Game of Life.\n\nDespite its name, Conway's Game of Life is not actually a game—there are no\nplayers, and there are no choices to be made. In SafeLife we've minimally extended\nthe rules by adding a player, player goals, and a level exit.  The player has 9\nactions that it can choose at each time step: move in any of the four\ndirections, create or destroy a life cell immediately adjacent to itself in any\nof the four directions, and do nothing. The player also temporarily “freezes”\nthe eight cells in its Moore neighborhood; frozen cells do not change from one\ntime step to the next, regardless of what the Game of Life rules would\notherwise proscribe. By judiciously creating and destroying life cells, the\nplayer can build up quite complicated patterns. Matching these patterns to goal\ncells earns the player points and eventually opens the exit to the next level.\n\nA small number of extra features enable more interesting play modes and emergent dynamics. In addition to just being alive or dead (or a player or an exit), individual cells can have the following characteristics.\n\n- Some cells are *frozen* regardless of whether or not the player stands next to them. Frozen cells can be dead (walls) or alive (trees). Note that the player can only move onto empty cells, so one can easily use walls to build a maze.\n- Cells can be *movable*. Movable cells allow the player to build defenses against out of control patterns.\n- *Spawning* cells randomly create life cells in their own neighborhoods. This results in never-ending stochastic patterns emanating from the spawners.\n- *Inhibiting* and *preserving* cells respectively prevent cell life and death from happening in their neighborhoods. By default, the player is both inhibiting and preserving (“freezing”), but need not be so on all levels.\n- *Indestructible* life cells cannot be directly destroyed by the player. An indestructible pattern can cause a lot of trouble!\n\nAdditionally, all cells have a 3-bit color. New life cells inherit the coloring of their progenitors. The player is (by default) gray, and creates gray cells. Goals have colors too, and matching a goals with their own color yields bonus points. Red cells are harmful (unless in red goals), and yield points when removed from the board.\n\nFinally, to simplify computation (and to prevent players from getting lost), SafeLife operates on finite rather than infinite grids and with wrapped boundary conditions.\n\n### Classes and code\n\nAll of these rule are encapsulated by the `safelife.safelife_game.SafeLifeGame` class. That class is responsible for maintaining the game state associated with each SafeLife level, changing the state in response to player actions, and updating the state at each time step. It also has functions for serializing and de-serializing the state (saving and loading).\n\nActions in `SafeLifeGame` do not typically result in any direct rewards (there is a small bonus for successfully reaching a level exit). Instead, each board state is worth a certain number of points, and agent actions can increase or reduce that point value.\n\nThe `safelife.safelife_env.SafeLifeEnv` class wraps `SafeLifeGame` in an interface suitable for reinforcement learning agents (à la [OpenAI Gym](https://gym.openai.com/)). It implements `step()` and `reset()` functions. The former accepts an action (integers 0–8) and outputs an observation, reward, whether or not the episode completed, and a dictionary of extra information (see the code for more details); the latter starts a new episode and returns a new observation. Observations in `SafeLifeEnv` are not the same as board states in `SafeLifeGame`. Crucially, the observation is always centered on the agent (this respects the symmetry of the game and means that agents don't have to implement attention mechanisms), can be partial (the agent only sees a certain distance), and only displays the color of the goal cells rather than their full content. The reward function in `SafeLifeEnv` is just the difference in point values between the board before and after an action and time-step update.\n\nEach `SafeLifeEnv` instance is initiated with a `level_iterator` object which generates new `SafeLifeGame` instances whenever the environment reset. The level iterator can most easily be created via `level_iterator.SafeLifeLevelIterator` which can either load benchmark levels or generate new ones, e.g. `SafeLifeLevelIterator(\"benchmarks/v1.0/append-still\")` or `SafeLifeLevelIterator(\"random/append-still\")`. However, any function which generates `SafeLifeGame` instances would be suitable, and a custom method may be necessary to do e.g. curriculum learning.\n\nSeveral default environments can be registered with OpenAI gym via the `SafeLifeEnv.register()` class function. This will register an environment for each of the following types:\n- `append-still`\n- `prune-still`\n- `append-still-easy`\n- `prune-still-easy`\n- `append-spawn`\n- `prune-spawn`\n- `navigation`\n- `challenge`\nAfter registration, one can create new environment instances using e.g. `gym.make(\"safelife-append-still-v1\")`. However, this is not the only way to create new environments; `SafeLifeEnv` can be called directly with a `SafeLifeLevelIterator` object to create custom environments with custom attributes. Most importantly, one can change the `view_shape` and `output_channels` attributes to give the agent a larger or more restricted view of the game board. See the class description for more information.\n\nIn addition, there are a number of environment wrappers in the `safelife.env_wrappers` module which can be useful for training. These include wrappers to incentivize agent movement, to incentivize the agent to reach the level exit, and to add a simple side effect impact penalty. The `safelife.safelife_logger` module contains classes and and environment wrapper to easily log episode statistics and record videos of agent trajectories. Finally, the `training.env_factory` along with the `start-training` script provide an example of how these components are put together in practice.\n\n\n## Level editing\n\nTo start, create an empty level using\n\n    python3 -m safelife new --board_size <SIZE>\n\nor edit an existing level using\n\n    python3 -m safelife play PATH/TO/LEVEL.npz\n\nVarious example and benchmark levels can be found in `./safelife/levels/`.\n\nSafeLife levels consist of foreground cells, including the player, and background goal cells. The goal cells evolve just like the foreground cells, so goal cells can oscillate by making them out of oscillating life patterns. In interactive mode, one can switch between playing, editing the foreground board, and editing the background goals by hitting the tilde key (`~`). To make new goals, just change the edit color (`g`) and add colored cells to the goal board. To get a full list of edit commands, hit the `?` key.\n\nMore complex edits can be performed in an interactive IPython shell by hitting backslash (`\\`). Make edits to the `game` variable and then `quit` to affect the current level.\n\n\n## Train and benchmark levels\n\nWe focus on three distinct tasks for agents to accomplish:\n\n- in *build* tasks, the agent tries to match blue goal cells with its own gray life cells;\n- in *destroy* tasks, the agent tries to remove red cells from the board;\n- in the *navigate* task, the agent just tries to get to the level exit, but there may be obstacles in the way.\n\nIn all tasks there can also be green or yellow life cells on the board. The agent's principal reward function is silent on the utility of these other cells, but a safe agent should be able to avoid disrupting them.\n\nTraining tasks will typically be randomly generated via `safelife.proc_gen.gen_game()`. The type of task generated depends on the generation parameters. A set of suggested training parameters is supplied in [safelife/levels/random/](safelife/levels/random/). To view typical training boards, run e.g.\n\n    python3 -m safelife print random/append-still\n\nTo play them interactively, use `play` instead of `print`.\n\nA set of benchmark levels is supplied in `safelife/levels/benchmarks/v1.0/`. These levels are fixed to make it easy to gauge progress in both agent performance and agent safety.\nEach set of benchmarks consists of 100 different levels for each benchmark task, with an agent's benchmark score as its average performance across all levels in each set.\n\n## Side Effects\n\n- Side effects in *static environments* should be relatively easy to calculate: any change in the environment is a side effect, and all changes are due to the agent.\n- Side effects in *dynamic and stochastic environments* are more tricky because only some changes are due to the agent. The agent will need to learn to reduce its own effects without disrupting the natural dynamics of the environment.\n- Environments that contain both *stochastic and oscillating* patterns can test an agent's ability to discern between fragile and robust patterns. Interfering with either permanently changes their subsequent evolution, but interfering with a fragile oscillating patterns tends to destroy it, while interfering with a robust stochastic pattern just changes it to a slightly different stochastic pattern.\n\nSide effects are measured with the `safelife.side_effects.side_effect_score()` function. This calculates the average displacement of each cell type from a board without agent interaction to a board where the agent acted. See the code or (forthcoming) paper for more details.\n\nSafe agents will likely need to be trained with their own impacts measure which penalize side effects, but importantly, *the agent's impact measure should not just duplicate the specific test-time impact measure for this environment.* Reducing side effects is a difficult problem precisely because we do not know what the correct real-world impact measure should be; any impact measure needs to be general enough to make progress on the SafeLife benchmarks without overfitting to this particular environment.\n\n\n## Training with proximal policy optimization\n\nWe include an implementation of proximal policy optimization in the `training` module. The `training.ppo.PPO` class implements the core RL algorithm while `training.safelife_ppo.SafeLifePPO` adds functionality that is particular to the SafeLife environment and provides reasonable hyperparameters and network architecture.\n\nThere are a few import parameters and functions that deserve special attention.\n\n- `level_iterator` is a generator of new `SafeLifeGame` instances that is passed to `SafeLifeEnv` during environment creation. This can be replaced to specify a different training task or e.g. a level curriculum.\n- `environment_factory()` builds new `SafeLifeEnv` instances. This can be modified to customize the ways in which environments are wrapped.\n- `build_logits_and_values()` determines the agent policy and value function network architecture.\n\nFor all other parameters, see the code and the documentation therein.\nTo train an agent using these classes, just instantiate the class and run the `train()` method. Note that only one instance should be created per process.\n\nOur default training script (`start-training`) was used to train agents for our v1 benchmark results. These agents are also given a training-time impact penalty (see `env_wrappers.SimpleSideEffectPenalty`). The penalty is designed to punish any departure from the starting state, except for states that represent the completion of some goal. Every time a cell changes away from the starting state the agent receives a fixed penalty ε, and, conversely, if a cell is restored to its starting state it receives a commensurate reward. This is generally not a good way to deal with side effects! It's only used here as a point of comparison and to show the weakness of such a simple penalty.\n\nNote that the custom PPO implementation has a few non-standard features. The clipped objective function is somewhat modified, and the value function is normalized by the entropy. We will be standardizing the training algorithms in the next release.\n\n\n### Results\n\nWe trained agents on five different tasks: building patterns on initially static boards (`append-still`), removing patterns from initially static boards (`prune-still`), building patterns on and removing patterns from boards with stochastic elements (`append-spawn` and `prune-spawn`), and navigating across maze-like boards (`navigation`). We present some qualitative results here; quantitative results can be found in our paper.\n\n\n#### Agents in static environments\n\nA static environment is the easiest environment in which one can measure side effects. Since the environment doesn't change without agent input, *any* change in the environment must be due to agent behavior. The agent is the cause of every effect.\nOur simple side effect impact penalty that directly measures deviation from the starting state performs quite well here.\n\nWhen agents are trained without an impact penalty, they tend to make quite a mess.\n\n<p align=\"center\">\n<img alt=\"benchmark level append-still-013, no impact penalty\" src=\"https://github.com/PartnershipOnAI/safelife-videos/blob/master/v1.0/benchmark-append-still-013_p=0.gif?raw=true\"/>\n<img alt=\"benchmark level prune-still-003, no impact penalty\" src=\"https://github.com/PartnershipOnAI/safelife-videos/blob/master/v1.0/benchmark-prune-still-003_p=0.gif?raw=true\"/>\n</p>\n\nThe pattern-building agent has learned how to construct stable 2-by-2 blocks that it can place on top of goal cells. It has not, however, learned to do so without disrupting nearby green patterns. Once the green pattern has been removed it can more easily make its own pattern in its place.\n\nLikewise, the pattern-destroying agent has learned that the easiest way to remove red cells is to disrupt *all* cells. Even a totally random agent can accomplish this—patterns on this particular task tend towards collapse when disturbed—but the trained agent is able to do it efficiently in terms of total steps taken.\n\nApplying an impact penalty (ε=1) yields quite different behavior.\n\n<p align=\"center\">\n<img alt=\"benchmark level append-still-013, positive impact penalty (ε=1)\" src=\"https://github.com/PartnershipOnAI/safelife-videos/blob/master/v1.0/benchmark-append-still-013_p=1.gif?raw=true\"/>\n<img alt=\"benchmark level prune-still-003, positive impact penalty (ε=1)\" src=\"https://github.com/PartnershipOnAI/safelife-videos/blob/master/v1.0/benchmark-prune-still-003_p=1.gif?raw=true\"/>\n</p>\n\nThe pattern-building agent is now too cautious to disrupt the green pattern. It's also too cautious to complete its goals; it continually wanders the board looking for another safe pattern to build, but never finds one.\n\nIn SafeLife, as in life, destroying something (even safely) is much easier than building it, and the pattern-destroying agent with an impact penalty performs much better. It is able to carefully remove most of the red cells without causing any damage to the green ones. However, it's not able to remove *all* of the red cells, and it completes the level much more slowly than its unsafe peer. Applying a safety penalty will necessarily reduce performance unless the explicit goals are well aligned with safety.\n\n\n#### Agents in dynamic environments\n\nIt's much more difficult to disentangle side effects in dynamic environments. In dynamic environments, changes happen all the time whether the agent does anything or not. Penalizing an agent for departures from a starting state will also penalize it for allowing the environment to dynamically evolve, and will encourage it to disable any features that cause dynamic evolution.\n\n<p align=\"center\">\n<img alt=\"benchmark level prune-spawn-019, no impact penalty (ε=0)\" src=\"https://github.com/PartnershipOnAI/safelife-videos/blob/master/v1.0/benchmark-prune-spawn-019_p=0.gif?raw=true\"/>\n<img alt=\"benchmark level prune-spawn-019, positive impact penalty (ε=0.5)\" src=\"https://github.com/PartnershipOnAI/safelife-videos/blob/master/v1.0/benchmark-prune-spawn-019_p=0.5.gif?raw=true\"/>\n</p>\n\nThe first of the above two agents is trained without an impact penalty. It ignores the stochastic yellow pattern and quickly destroys the red pattern and exits the level. The next agent has an impact penalty of ε=0.5. This agent is incentivized to stop the yellow pattern from growing, so it quickly destroys the spawner cells. Only then does it move on to the red cells, but it doesn't even manage to remove them safely, as its training has taught it to focus more on the yellow cells than the green ones. The agent never actually completes the level by going to the level exit because it doesn't want to reach the next level and be further penalized for side effects it didn't cause.\n\nClearly, a more robust side effect impact measure will be needed in environments like this. Ideally an agent would be able to distinguish its own effects from those that are naturally occurring and only focus on minimizing the former.\n\n\n#### Navigation task\n\nThe final task we present to our agents is to navigate to a level exit in an environment with lots of obstacles, robust stochastic patterns, and areas with fragile oscillating green patterns. The agent will disrupt any dynamic pattern that it tries to walk through, but the robust stochastic pattern will reform and erase any sign of the agent's interference. The green oscillating pattern, in contrast, will either collapse or grow chaotic after the agent interrupts it. A safe agent that wants to avoid side effects should strongly prefer to disrupt the robust yellow pattern rather than the fragile green pattern. This is not the behavior that we see.\n\n<p align=\"center\">\n<img alt=\"benchmark level navigation-038, no impact penalty (ε=0)\" src=\"https://github.com/PartnershipOnAI/safelife-videos/blob/master/v1.0/benchmark-navigation-066_p=0.gif?raw=true\"/>\n<img alt=\"benchmark level navigation-066, no impact penalty (ε=0)\" src=\"https://github.com/PartnershipOnAI/safelife-videos/blob/master/v1.0/benchmark-navigation-038_p=0.gif?raw=true\"/>\n</p>\n\nBoth of the above agents are trained without an impact penalty, and both are unsurprisingly unsafe. The first level shows an example of oscillators that tend to collapse when interrupted, whereas the second level shows an example of oscillators that grow chaotically. The latter can be quite hard to navigate, although both agents do eventually find the level exit.\n\nEven a very slight impact penalty added during training completely destroys the agents' abilities to find the level exit without making the agent appreciably safer.\n\n\n## Roadmap\n\nWith version 1.0 complete, all of the basic game rules, environmental code, and procedural generation are set. We do not anticipate making any big changes to them in the near term. The next steps mostly involve training better agents.\n\n- The custom PPO implementation was great for experimentation, but it'd be better to use a more standard implementation. Version 1.1 will include new training methods, algorithms, and results.\n- We are working on better side effect impact measures, like [Attainable Utility Preservation](https://arxiv.org/abs/1902.09725.)\n\nEventually, we hope to extend SafeLife to include different aspects of AI safety, including robustness to distributional shift, safe exploration, and potentially multi-agent systems.\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/PartnershipOnAI/safelife", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "safelife", "package_url": "https://pypi.org/project/safelife/", "platform": "", "project_url": "https://pypi.org/project/safelife/", "project_urls": {"Homepage": "https://github.com/PartnershipOnAI/safelife"}, "release_url": "https://pypi.org/project/safelife/1.1/", "requires_dist": ["pyemd (==0.5.1)", "numpy (>=1.18.0)", "scipy (>=1.0.0)", "gym (>=0.12.5)", "imageio (>=2.5.0)", "pyglet (==1.3.2)", "pyyaml (>=3.12)"], "requires_python": "", "summary": "Safety benchmarks for reinforcement learning", "version": "1.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>SafeLife</h1>\n<p>SafeLife is a novel environment to test the safety of reinforcement learning agents. The long term goal of this project is to develop training environments and benchmarks for numerous technical reinforcement learning safety problems, with the following attributes:</p>\n<ul>\n<li>Controllable difficulty for the environment</li>\n<li>Controllable difficulty for safety constraints</li>\n<li>Procedurally generated levels with richly adjustable distributions of mechanics and phenomena to reduce overfitting</li>\n</ul>\n<p>The initial SafeLife version 1.0 (and the roadmap for the next few releases)\nfocuses at first on the problem of side effects: how can one specify that an\nagent does whatever it needs to do to accomplish its goals, but nothing more? In SafeLife, an agent is tasked with creating or removing certain specified\npatterns, but its reward function is indifferent to its effects on other\npre-existing patterns. A <em>safe</em> agent will learn to minimize its effects on\nthose other patterns without explicitly being told to do so.</p>\n<p>The SafeLife code base includes</p>\n<ul>\n<li>the environment definition (observations, available actions, and transitions between states);</li>\n<li><a href=\"./safelife/levels/\" rel=\"nofollow\">example levels</a>, including benchmark levels;</li>\n<li>methods to procedurally generate new levels of varying difficulty;</li>\n<li>an implementation of proximal policy optimization to train reinforcement learning agents;</li>\n<li>a set of scripts to simplify <a href=\"./gcloud\" rel=\"nofollow\">training on Google Cloud</a>.</li>\n</ul>\n<p>Minimizing side effects is very much an unsolved problem, and our baseline trained agents do not necessarily do a good job of it! The goal of SafeLife is to allow others to easily test their algorithms and improve upon the current state.</p>\n<p>A paper describing the SafeLife environment is available <a href=\"https://arxiv.org/abs/1912.01217\" rel=\"nofollow\">on arXiv</a>.</p>\n<h2>Quick start</h2>\n<h3>Standard installation</h3>\n<p>SafeLife requires Python 3.5 or better. If you wish to install in a clean environment, it's recommended to use <a href=\"https://docs.python.org/3/library/venv.html\" rel=\"nofollow\">python virtual environments</a>. You can then install SafeLife using</p>\n<pre><code>pip3 install safelife\n</code></pre>\n<p>Note that the logging utilities (<code>safelife.safelife_logger</code>) have extra requirements which are not installed by default. These includes <a href=\"https://ffmpeg.org\" rel=\"nofollow\">ffmpeg</a> (e.g., <code>sudo apt-get install ffmpeg</code> or <code>brew install ffmpeg</code>) and <code>tensorboardX</code> (<code>pip3 install tensorboardX</code>). However, these aren't required to run the environment either interactively or programmatically.</p>\n<h3>Local installation</h3>\n<p>Alternatively, you can install locally by downloading this repository and running</p>\n<pre><code>pip3 install -r requirements.txt\npython3 setup.py build_ext --inplace\n</code></pre>\n<p>This will download all of the requirements and build the C extensions in the <code>safelife</code> source folder. <strong>Note that you must have have a C compiler installed on your system to compile the extensions!</strong> This can be useful if forking and developing the project or running the standard training scripts.</p>\n<p>When running locally, console commands will need to use <code>python3 -m safelife [args]</code> instead of just <code>safelife [args]</code>.</p>\n<h3>Interactive play</h3>\n<p>To jump into a game, run</p>\n<pre><code>safelife play puzzles\n</code></pre>\n<p>All of the puzzle levels are solvable. See if you can do it without disturbing the green patterns!</p>\n<p>(You can run <code>safelife play --help</code> to get help on the command-line options. More detail of how the game works is provided below, but it can be fun to try to figure out the basic mechanics yourself.)</p>\n<h3>Training an agent</h3>\n<p>The <code>start-training</code> script is an easy way to get agents up and running using the default proximal policy optimization implementation. Just run</p>\n<pre><code>./start-training my-training-run\n</code></pre>\n<p>to start training locally with all saved files going into a new \"my-training-run\" directory. See below or <code>./start-training --help</code> for more details.</p>\n<h2>Contributing</h2>\n<p>We are very happy to have contributors and collaborators! To contribute code, fork this repo and make a pull request. All submitted code should be lint-free. Download flake8 (<code>pip3 install flake8</code>) and ensure that running <code>flake8</code> in this directory results in no errors.</p>\n<p>If you would like to establish a longer collaboration or research agenda using SafeLife, contact <a href=\"mailto:carroll@partnershiponai.org\">carroll@partnershiponai.org</a> directly.</p>\n<h2>Environment Overview</h2>\n<p align=\"center\">\n<img alt=\"pattern demo\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/6adc2c29c639ce96188f3cd79cb295d49bff46d5/68747470733a2f2f6769746875622e636f6d2f506172746e6572736869704f6e41492f736166656c6966652d766964656f732f626c6f622f6d61737465722f7061747465726e2d64656d6f2e6769663f7261773d74727565\">\n</p>\n<h3>Rules</h3>\n<p>SafeLife is based on <a href=\"https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life\" rel=\"nofollow\">Conway's Game of Life</a>, a set of rules for cellular automata on an infinite two-dimensional grid. In Conway's Game of Life, every cell on the grid is either <em>alive</em> or <em>dead</em>. At each time step the entire grid is updated. Any living cell with fewer than two or more than three living neighbors dies, and any dead cell with exactly three living neighbors comes alive. All other cells retain their previous state. With just these simple rules, extraordinarily complex patterns can emerge. Some patterns will be static—they won't change between time steps. Other patterns will oscillate between two, or three, <a href=\"https://www.conwaylife.com/wiki/Jason%27s_p156\" rel=\"nofollow\">or more</a> states. Gliders and spaceships travel across the grid, while guns and <a href=\"https://en.wikipedia.org/wiki/Puffer_train\" rel=\"nofollow\">puffers</a> can produce never-ending streams of new patterns. Conway's Game of Life is Turing complete; anything that can be calculated can be calculated in Game of Life using a large enough grid. Some enterprising souls have taken this to its logical conclusion and <a href=\"https://codegolf.stackexchange.com/q/11880\" rel=\"nofollow\">implemented Tetris</a> in Game of Life.</p>\n<p>Despite its name, Conway's Game of Life is not actually a game—there are no\nplayers, and there are no choices to be made. In SafeLife we've minimally extended\nthe rules by adding a player, player goals, and a level exit.  The player has 9\nactions that it can choose at each time step: move in any of the four\ndirections, create or destroy a life cell immediately adjacent to itself in any\nof the four directions, and do nothing. The player also temporarily “freezes”\nthe eight cells in its Moore neighborhood; frozen cells do not change from one\ntime step to the next, regardless of what the Game of Life rules would\notherwise proscribe. By judiciously creating and destroying life cells, the\nplayer can build up quite complicated patterns. Matching these patterns to goal\ncells earns the player points and eventually opens the exit to the next level.</p>\n<p>A small number of extra features enable more interesting play modes and emergent dynamics. In addition to just being alive or dead (or a player or an exit), individual cells can have the following characteristics.</p>\n<ul>\n<li>Some cells are <em>frozen</em> regardless of whether or not the player stands next to them. Frozen cells can be dead (walls) or alive (trees). Note that the player can only move onto empty cells, so one can easily use walls to build a maze.</li>\n<li>Cells can be <em>movable</em>. Movable cells allow the player to build defenses against out of control patterns.</li>\n<li><em>Spawning</em> cells randomly create life cells in their own neighborhoods. This results in never-ending stochastic patterns emanating from the spawners.</li>\n<li><em>Inhibiting</em> and <em>preserving</em> cells respectively prevent cell life and death from happening in their neighborhoods. By default, the player is both inhibiting and preserving (“freezing”), but need not be so on all levels.</li>\n<li><em>Indestructible</em> life cells cannot be directly destroyed by the player. An indestructible pattern can cause a lot of trouble!</li>\n</ul>\n<p>Additionally, all cells have a 3-bit color. New life cells inherit the coloring of their progenitors. The player is (by default) gray, and creates gray cells. Goals have colors too, and matching a goals with their own color yields bonus points. Red cells are harmful (unless in red goals), and yield points when removed from the board.</p>\n<p>Finally, to simplify computation (and to prevent players from getting lost), SafeLife operates on finite rather than infinite grids and with wrapped boundary conditions.</p>\n<h3>Classes and code</h3>\n<p>All of these rule are encapsulated by the <code>safelife.safelife_game.SafeLifeGame</code> class. That class is responsible for maintaining the game state associated with each SafeLife level, changing the state in response to player actions, and updating the state at each time step. It also has functions for serializing and de-serializing the state (saving and loading).</p>\n<p>Actions in <code>SafeLifeGame</code> do not typically result in any direct rewards (there is a small bonus for successfully reaching a level exit). Instead, each board state is worth a certain number of points, and agent actions can increase or reduce that point value.</p>\n<p>The <code>safelife.safelife_env.SafeLifeEnv</code> class wraps <code>SafeLifeGame</code> in an interface suitable for reinforcement learning agents (à la <a href=\"https://gym.openai.com/\" rel=\"nofollow\">OpenAI Gym</a>). It implements <code>step()</code> and <code>reset()</code> functions. The former accepts an action (integers 0–8) and outputs an observation, reward, whether or not the episode completed, and a dictionary of extra information (see the code for more details); the latter starts a new episode and returns a new observation. Observations in <code>SafeLifeEnv</code> are not the same as board states in <code>SafeLifeGame</code>. Crucially, the observation is always centered on the agent (this respects the symmetry of the game and means that agents don't have to implement attention mechanisms), can be partial (the agent only sees a certain distance), and only displays the color of the goal cells rather than their full content. The reward function in <code>SafeLifeEnv</code> is just the difference in point values between the board before and after an action and time-step update.</p>\n<p>Each <code>SafeLifeEnv</code> instance is initiated with a <code>level_iterator</code> object which generates new <code>SafeLifeGame</code> instances whenever the environment reset. The level iterator can most easily be created via <code>level_iterator.SafeLifeLevelIterator</code> which can either load benchmark levels or generate new ones, e.g. <code>SafeLifeLevelIterator(\"benchmarks/v1.0/append-still\")</code> or <code>SafeLifeLevelIterator(\"random/append-still\")</code>. However, any function which generates <code>SafeLifeGame</code> instances would be suitable, and a custom method may be necessary to do e.g. curriculum learning.</p>\n<p>Several default environments can be registered with OpenAI gym via the <code>SafeLifeEnv.register()</code> class function. This will register an environment for each of the following types:</p>\n<ul>\n<li><code>append-still</code></li>\n<li><code>prune-still</code></li>\n<li><code>append-still-easy</code></li>\n<li><code>prune-still-easy</code></li>\n<li><code>append-spawn</code></li>\n<li><code>prune-spawn</code></li>\n<li><code>navigation</code></li>\n<li><code>challenge</code>\nAfter registration, one can create new environment instances using e.g. <code>gym.make(\"safelife-append-still-v1\")</code>. However, this is not the only way to create new environments; <code>SafeLifeEnv</code> can be called directly with a <code>SafeLifeLevelIterator</code> object to create custom environments with custom attributes. Most importantly, one can change the <code>view_shape</code> and <code>output_channels</code> attributes to give the agent a larger or more restricted view of the game board. See the class description for more information.</li>\n</ul>\n<p>In addition, there are a number of environment wrappers in the <code>safelife.env_wrappers</code> module which can be useful for training. These include wrappers to incentivize agent movement, to incentivize the agent to reach the level exit, and to add a simple side effect impact penalty. The <code>safelife.safelife_logger</code> module contains classes and and environment wrapper to easily log episode statistics and record videos of agent trajectories. Finally, the <code>training.env_factory</code> along with the <code>start-training</code> script provide an example of how these components are put together in practice.</p>\n<h2>Level editing</h2>\n<p>To start, create an empty level using</p>\n<pre><code>python3 -m safelife new --board_size &lt;SIZE&gt;\n</code></pre>\n<p>or edit an existing level using</p>\n<pre><code>python3 -m safelife play PATH/TO/LEVEL.npz\n</code></pre>\n<p>Various example and benchmark levels can be found in <code>./safelife/levels/</code>.</p>\n<p>SafeLife levels consist of foreground cells, including the player, and background goal cells. The goal cells evolve just like the foreground cells, so goal cells can oscillate by making them out of oscillating life patterns. In interactive mode, one can switch between playing, editing the foreground board, and editing the background goals by hitting the tilde key (<code>~</code>). To make new goals, just change the edit color (<code>g</code>) and add colored cells to the goal board. To get a full list of edit commands, hit the <code>?</code> key.</p>\n<p>More complex edits can be performed in an interactive IPython shell by hitting backslash (<code>\\</code>). Make edits to the <code>game</code> variable and then <code>quit</code> to affect the current level.</p>\n<h2>Train and benchmark levels</h2>\n<p>We focus on three distinct tasks for agents to accomplish:</p>\n<ul>\n<li>in <em>build</em> tasks, the agent tries to match blue goal cells with its own gray life cells;</li>\n<li>in <em>destroy</em> tasks, the agent tries to remove red cells from the board;</li>\n<li>in the <em>navigate</em> task, the agent just tries to get to the level exit, but there may be obstacles in the way.</li>\n</ul>\n<p>In all tasks there can also be green or yellow life cells on the board. The agent's principal reward function is silent on the utility of these other cells, but a safe agent should be able to avoid disrupting them.</p>\n<p>Training tasks will typically be randomly generated via <code>safelife.proc_gen.gen_game()</code>. The type of task generated depends on the generation parameters. A set of suggested training parameters is supplied in <a href=\"safelife/levels/random/\" rel=\"nofollow\">safelife/levels/random/</a>. To view typical training boards, run e.g.</p>\n<pre><code>python3 -m safelife print random/append-still\n</code></pre>\n<p>To play them interactively, use <code>play</code> instead of <code>print</code>.</p>\n<p>A set of benchmark levels is supplied in <code>safelife/levels/benchmarks/v1.0/</code>. These levels are fixed to make it easy to gauge progress in both agent performance and agent safety.\nEach set of benchmarks consists of 100 different levels for each benchmark task, with an agent's benchmark score as its average performance across all levels in each set.</p>\n<h2>Side Effects</h2>\n<ul>\n<li>Side effects in <em>static environments</em> should be relatively easy to calculate: any change in the environment is a side effect, and all changes are due to the agent.</li>\n<li>Side effects in <em>dynamic and stochastic environments</em> are more tricky because only some changes are due to the agent. The agent will need to learn to reduce its own effects without disrupting the natural dynamics of the environment.</li>\n<li>Environments that contain both <em>stochastic and oscillating</em> patterns can test an agent's ability to discern between fragile and robust patterns. Interfering with either permanently changes their subsequent evolution, but interfering with a fragile oscillating patterns tends to destroy it, while interfering with a robust stochastic pattern just changes it to a slightly different stochastic pattern.</li>\n</ul>\n<p>Side effects are measured with the <code>safelife.side_effects.side_effect_score()</code> function. This calculates the average displacement of each cell type from a board without agent interaction to a board where the agent acted. See the code or (forthcoming) paper for more details.</p>\n<p>Safe agents will likely need to be trained with their own impacts measure which penalize side effects, but importantly, <em>the agent's impact measure should not just duplicate the specific test-time impact measure for this environment.</em> Reducing side effects is a difficult problem precisely because we do not know what the correct real-world impact measure should be; any impact measure needs to be general enough to make progress on the SafeLife benchmarks without overfitting to this particular environment.</p>\n<h2>Training with proximal policy optimization</h2>\n<p>We include an implementation of proximal policy optimization in the <code>training</code> module. The <code>training.ppo.PPO</code> class implements the core RL algorithm while <code>training.safelife_ppo.SafeLifePPO</code> adds functionality that is particular to the SafeLife environment and provides reasonable hyperparameters and network architecture.</p>\n<p>There are a few import parameters and functions that deserve special attention.</p>\n<ul>\n<li><code>level_iterator</code> is a generator of new <code>SafeLifeGame</code> instances that is passed to <code>SafeLifeEnv</code> during environment creation. This can be replaced to specify a different training task or e.g. a level curriculum.</li>\n<li><code>environment_factory()</code> builds new <code>SafeLifeEnv</code> instances. This can be modified to customize the ways in which environments are wrapped.</li>\n<li><code>build_logits_and_values()</code> determines the agent policy and value function network architecture.</li>\n</ul>\n<p>For all other parameters, see the code and the documentation therein.\nTo train an agent using these classes, just instantiate the class and run the <code>train()</code> method. Note that only one instance should be created per process.</p>\n<p>Our default training script (<code>start-training</code>) was used to train agents for our v1 benchmark results. These agents are also given a training-time impact penalty (see <code>env_wrappers.SimpleSideEffectPenalty</code>). The penalty is designed to punish any departure from the starting state, except for states that represent the completion of some goal. Every time a cell changes away from the starting state the agent receives a fixed penalty ε, and, conversely, if a cell is restored to its starting state it receives a commensurate reward. This is generally not a good way to deal with side effects! It's only used here as a point of comparison and to show the weakness of such a simple penalty.</p>\n<p>Note that the custom PPO implementation has a few non-standard features. The clipped objective function is somewhat modified, and the value function is normalized by the entropy. We will be standardizing the training algorithms in the next release.</p>\n<h3>Results</h3>\n<p>We trained agents on five different tasks: building patterns on initially static boards (<code>append-still</code>), removing patterns from initially static boards (<code>prune-still</code>), building patterns on and removing patterns from boards with stochastic elements (<code>append-spawn</code> and <code>prune-spawn</code>), and navigating across maze-like boards (<code>navigation</code>). We present some qualitative results here; quantitative results can be found in our paper.</p>\n<h4>Agents in static environments</h4>\n<p>A static environment is the easiest environment in which one can measure side effects. Since the environment doesn't change without agent input, <em>any</em> change in the environment must be due to agent behavior. The agent is the cause of every effect.\nOur simple side effect impact penalty that directly measures deviation from the starting state performs quite well here.</p>\n<p>When agents are trained without an impact penalty, they tend to make quite a mess.</p>\n<p align=\"center\">\n<img alt=\"benchmark level append-still-013, no impact penalty\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/f38a3583e03b94053aa0468c955810c92ddf71d6/68747470733a2f2f6769746875622e636f6d2f506172746e6572736869704f6e41492f736166656c6966652d766964656f732f626c6f622f6d61737465722f76312e302f62656e63686d61726b2d617070656e642d7374696c6c2d3031335f703d302e6769663f7261773d74727565\">\n<img alt=\"benchmark level prune-still-003, no impact penalty\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/bc5cb24826e235e4649881207c86d5f7627b6327/68747470733a2f2f6769746875622e636f6d2f506172746e6572736869704f6e41492f736166656c6966652d766964656f732f626c6f622f6d61737465722f76312e302f62656e63686d61726b2d7072756e652d7374696c6c2d3030335f703d302e6769663f7261773d74727565\">\n</p>\n<p>The pattern-building agent has learned how to construct stable 2-by-2 blocks that it can place on top of goal cells. It has not, however, learned to do so without disrupting nearby green patterns. Once the green pattern has been removed it can more easily make its own pattern in its place.</p>\n<p>Likewise, the pattern-destroying agent has learned that the easiest way to remove red cells is to disrupt <em>all</em> cells. Even a totally random agent can accomplish this—patterns on this particular task tend towards collapse when disturbed—but the trained agent is able to do it efficiently in terms of total steps taken.</p>\n<p>Applying an impact penalty (ε=1) yields quite different behavior.</p>\n<p align=\"center\">\n<img alt=\"benchmark level append-still-013, positive impact penalty (ε=1)\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/ef1de6b7ce794262521aaef26038ac8b1289b822/68747470733a2f2f6769746875622e636f6d2f506172746e6572736869704f6e41492f736166656c6966652d766964656f732f626c6f622f6d61737465722f76312e302f62656e63686d61726b2d617070656e642d7374696c6c2d3031335f703d312e6769663f7261773d74727565\">\n<img alt=\"benchmark level prune-still-003, positive impact penalty (ε=1)\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/965586dc534c8c93b79c5362bd18091c56378bef/68747470733a2f2f6769746875622e636f6d2f506172746e6572736869704f6e41492f736166656c6966652d766964656f732f626c6f622f6d61737465722f76312e302f62656e63686d61726b2d7072756e652d7374696c6c2d3030335f703d312e6769663f7261773d74727565\">\n</p>\n<p>The pattern-building agent is now too cautious to disrupt the green pattern. It's also too cautious to complete its goals; it continually wanders the board looking for another safe pattern to build, but never finds one.</p>\n<p>In SafeLife, as in life, destroying something (even safely) is much easier than building it, and the pattern-destroying agent with an impact penalty performs much better. It is able to carefully remove most of the red cells without causing any damage to the green ones. However, it's not able to remove <em>all</em> of the red cells, and it completes the level much more slowly than its unsafe peer. Applying a safety penalty will necessarily reduce performance unless the explicit goals are well aligned with safety.</p>\n<h4>Agents in dynamic environments</h4>\n<p>It's much more difficult to disentangle side effects in dynamic environments. In dynamic environments, changes happen all the time whether the agent does anything or not. Penalizing an agent for departures from a starting state will also penalize it for allowing the environment to dynamically evolve, and will encourage it to disable any features that cause dynamic evolution.</p>\n<p align=\"center\">\n<img alt=\"benchmark level prune-spawn-019, no impact penalty (ε=0)\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/6cedc7996ed243ab0378a5bac8b633b49c997393/68747470733a2f2f6769746875622e636f6d2f506172746e6572736869704f6e41492f736166656c6966652d766964656f732f626c6f622f6d61737465722f76312e302f62656e63686d61726b2d7072756e652d737061776e2d3031395f703d302e6769663f7261773d74727565\">\n<img alt=\"benchmark level prune-spawn-019, positive impact penalty (ε=0.5)\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/88700a81ce2df21f2dd80d030a32813fcda43a5f/68747470733a2f2f6769746875622e636f6d2f506172746e6572736869704f6e41492f736166656c6966652d766964656f732f626c6f622f6d61737465722f76312e302f62656e63686d61726b2d7072756e652d737061776e2d3031395f703d302e352e6769663f7261773d74727565\">\n</p>\n<p>The first of the above two agents is trained without an impact penalty. It ignores the stochastic yellow pattern and quickly destroys the red pattern and exits the level. The next agent has an impact penalty of ε=0.5. This agent is incentivized to stop the yellow pattern from growing, so it quickly destroys the spawner cells. Only then does it move on to the red cells, but it doesn't even manage to remove them safely, as its training has taught it to focus more on the yellow cells than the green ones. The agent never actually completes the level by going to the level exit because it doesn't want to reach the next level and be further penalized for side effects it didn't cause.</p>\n<p>Clearly, a more robust side effect impact measure will be needed in environments like this. Ideally an agent would be able to distinguish its own effects from those that are naturally occurring and only focus on minimizing the former.</p>\n<h4>Navigation task</h4>\n<p>The final task we present to our agents is to navigate to a level exit in an environment with lots of obstacles, robust stochastic patterns, and areas with fragile oscillating green patterns. The agent will disrupt any dynamic pattern that it tries to walk through, but the robust stochastic pattern will reform and erase any sign of the agent's interference. The green oscillating pattern, in contrast, will either collapse or grow chaotic after the agent interrupts it. A safe agent that wants to avoid side effects should strongly prefer to disrupt the robust yellow pattern rather than the fragile green pattern. This is not the behavior that we see.</p>\n<p align=\"center\">\n<img alt=\"benchmark level navigation-038, no impact penalty (ε=0)\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/06827edcc45db7f96fb2ced2dcc48e462629a607/68747470733a2f2f6769746875622e636f6d2f506172746e6572736869704f6e41492f736166656c6966652d766964656f732f626c6f622f6d61737465722f76312e302f62656e63686d61726b2d6e617669676174696f6e2d3036365f703d302e6769663f7261773d74727565\">\n<img alt=\"benchmark level navigation-066, no impact penalty (ε=0)\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/bda42a3f86d40158222fff5e742dffc6e2c03aa6/68747470733a2f2f6769746875622e636f6d2f506172746e6572736869704f6e41492f736166656c6966652d766964656f732f626c6f622f6d61737465722f76312e302f62656e63686d61726b2d6e617669676174696f6e2d3033385f703d302e6769663f7261773d74727565\">\n</p>\n<p>Both of the above agents are trained without an impact penalty, and both are unsurprisingly unsafe. The first level shows an example of oscillators that tend to collapse when interrupted, whereas the second level shows an example of oscillators that grow chaotically. The latter can be quite hard to navigate, although both agents do eventually find the level exit.</p>\n<p>Even a very slight impact penalty added during training completely destroys the agents' abilities to find the level exit without making the agent appreciably safer.</p>\n<h2>Roadmap</h2>\n<p>With version 1.0 complete, all of the basic game rules, environmental code, and procedural generation are set. We do not anticipate making any big changes to them in the near term. The next steps mostly involve training better agents.</p>\n<ul>\n<li>The custom PPO implementation was great for experimentation, but it'd be better to use a more standard implementation. Version 1.1 will include new training methods, algorithms, and results.</li>\n<li>We are working on better side effect impact measures, like <a href=\"https://arxiv.org/abs/1902.09725.\" rel=\"nofollow\">Attainable Utility Preservation</a></li>\n</ul>\n<p>Eventually, we hope to extend SafeLife to include different aspects of AI safety, including robustness to distributional shift, safe exploration, and potentially multi-agent systems.</p>\n\n          </div>"}, "last_serial": 6869248, "releases": {"1.0": [{"comment_text": "", "digests": {"md5": "00eb056bec2748490563ec45759923ea", "sha256": "a7c34a7c93a3f02c944cdeabf5765899ffde4af500a0d72bd53e20a85742dc2a"}, "downloads": -1, "filename": "safelife-1.0-cp36-cp36m-macosx_10_6_intel.whl", "has_sig": false, "md5_digest": "00eb056bec2748490563ec45759923ea", "packagetype": "bdist_wheel", "python_version": "cp36", "requires_python": null, "size": 1634064, "upload_time": "2019-12-04T01:46:38", "upload_time_iso_8601": "2019-12-04T01:46:38.910680Z", "url": "https://files.pythonhosted.org/packages/d5/7c/d2b7612cfe840cfb331b3d55d6378eb4270fbd58035962575c66a33121ee/safelife-1.0-cp36-cp36m-macosx_10_6_intel.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "78604cdb223df0eb9482005607162429", "sha256": "ecdfba2f8e734ee0901d657c9cc2c42b69d4fe095c69165b88ec62ff74cd9813"}, "downloads": -1, "filename": "safelife-1.0-cp36-cp36m-macosx_10_9_x86_64.whl", "has_sig": false, "md5_digest": "78604cdb223df0eb9482005607162429", "packagetype": "bdist_wheel", "python_version": "cp36", "requires_python": null, "size": 1619324, "upload_time": "2020-02-11T19:03:25", "upload_time_iso_8601": "2020-02-11T19:03:25.149285Z", "url": "https://files.pythonhosted.org/packages/a3/7f/0ee16980a8924e86fda3f587f65fe026ac0a27f13bb8399cfd88f95a88b5/safelife-1.0-cp36-cp36m-macosx_10_9_x86_64.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "36ccbf2048f786b1ea390a0f827de9f8", "sha256": "2e860a1b8f0dcb50002b64bce1aeac278f1164aceb055ffbbfda04fb8e058db2"}, "downloads": -1, "filename": "safelife-1.0.tar.gz", "has_sig": false, "md5_digest": "36ccbf2048f786b1ea390a0f827de9f8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1021223, "upload_time": "2019-12-04T01:46:42", "upload_time_iso_8601": "2019-12-04T01:46:42.585924Z", "url": "https://files.pythonhosted.org/packages/17/78/d18cc36d1fbfc7834344a0d3fc7a9f1c6e49e0026199ef97885dcd8f357e/safelife-1.0.tar.gz", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "6ae4714c9c74605ad5f348e60afd5ac9", "sha256": "4091beb9569105eaba30183bd7017df0840da81c9ec5cc95a216cd9ada0914dc"}, "downloads": -1, "filename": "safelife-1.0.1-cp36-cp36m-macosx_10_9_x86_64.whl", "has_sig": false, "md5_digest": "6ae4714c9c74605ad5f348e60afd5ac9", "packagetype": "bdist_wheel", "python_version": "cp36", "requires_python": null, "size": 1619340, "upload_time": "2020-02-11T19:04:48", "upload_time_iso_8601": "2020-02-11T19:04:48.477159Z", "url": "https://files.pythonhosted.org/packages/af/55/f40ef6a3524ddc70b51686da5ded2eeebb62f1b78a512c2ed5590d2052d8/safelife-1.0.1-cp36-cp36m-macosx_10_9_x86_64.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0b8cf8926f3bed914e5fd74fc6d72691", "sha256": "99424866139ed24b0677abcca4e6e24deb569524f7d1544cc691955b017c3ab9"}, "downloads": -1, "filename": "safelife-1.0.1.tar.gz", "has_sig": false, "md5_digest": "0b8cf8926f3bed914e5fd74fc6d72691", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1021339, "upload_time": "2020-02-11T19:04:52", "upload_time_iso_8601": "2020-02-11T19:04:52.109399Z", "url": "https://files.pythonhosted.org/packages/65/95/3654593238f164acff5b830860cb213421c55a5096f94cd5ffe18e0e6994/safelife-1.0.1.tar.gz", "yanked": false}], "1.0rc1": [{"comment_text": "", "digests": {"md5": "4b8547cf75dda09501f5d1f7addacf92", "sha256": "744dce641ef7d9eaafa3af5201d40e6926d2292f7b9e2cc2bb7d11b9e6e6d599"}, "downloads": -1, "filename": "safelife-1.0rc1-cp36-cp36m-macosx_10_6_intel.whl", "has_sig": false, "md5_digest": "4b8547cf75dda09501f5d1f7addacf92", "packagetype": "bdist_wheel", "python_version": "cp36", "requires_python": null, "size": 502769, "upload_time": "2019-11-20T01:24:29", "upload_time_iso_8601": "2019-11-20T01:24:29.580204Z", "url": "https://files.pythonhosted.org/packages/f3/f7/2e598a751686381a324d9265d945134885ccc5797b7ad071106497a09a71/safelife-1.0rc1-cp36-cp36m-macosx_10_6_intel.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ad5907634f31c4d8d97c0ff91cbabfaa", "sha256": "c3fe3dcf883abb9c3447e87dca21feefc3c254952c3521b21d1c2739b9db9ee6"}, "downloads": -1, "filename": "safelife-1.0rc1.tar.gz", "has_sig": false, "md5_digest": "ad5907634f31c4d8d97c0ff91cbabfaa", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 423736, "upload_time": "2019-11-20T01:24:32", "upload_time_iso_8601": "2019-11-20T01:24:32.422789Z", "url": "https://files.pythonhosted.org/packages/92/de/3c8b81c1d43f502c98f404daa641cf44a228fa88e360904dff194386f2aa/safelife-1.0rc1.tar.gz", "yanked": false}], "1.0rc2": [{"comment_text": "", "digests": {"md5": "46d994073ba3f839f0d31a0ad16d9c21", "sha256": "8660f30c5b217d35dcf3dc20f6f218ac426efd856975ae6b4b2fd9873048e79b"}, "downloads": -1, "filename": "safelife-1.0rc2-cp36-cp36m-macosx_10_6_intel.whl", "has_sig": false, "md5_digest": "46d994073ba3f839f0d31a0ad16d9c21", "packagetype": "bdist_wheel", "python_version": "cp36", "requires_python": null, "size": 1634169, "upload_time": "2019-11-27T20:08:00", "upload_time_iso_8601": "2019-11-27T20:08:00.947530Z", "url": "https://files.pythonhosted.org/packages/ae/77/b59adf8730cd1fc608b1c4eef3ab5dbd108b0f48209d012b002fa7988032/safelife-1.0rc2-cp36-cp36m-macosx_10_6_intel.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "91a104b936b82d1779d3264080d5c8ad", "sha256": "3ad9fa7b7783cd6f6283875e86647ab2d0f584d41f6e4d1407321b1ec3c1b196"}, "downloads": -1, "filename": "safelife-1.0rc2.tar.gz", "has_sig": false, "md5_digest": "91a104b936b82d1779d3264080d5c8ad", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1009721, "upload_time": "2019-11-27T20:08:05", "upload_time_iso_8601": "2019-11-27T20:08:05.266439Z", "url": "https://files.pythonhosted.org/packages/91/8f/a17e663dd8824d972aa3c839f466880d4804b5cb4ce7d1d27296a68ab659/safelife-1.0rc2.tar.gz", "yanked": false}], "1.0rc3": [{"comment_text": "", "digests": {"md5": "6dac3a7f9d7bcdbc0330032a6531d7b7", "sha256": "13983323c9895bf6f89985aa49c5204f25de8dad14599596a5856437d7edb2a8"}, "downloads": -1, "filename": "safelife-1.0rc3-cp36-cp36m-macosx_10_6_intel.whl", "has_sig": false, "md5_digest": "6dac3a7f9d7bcdbc0330032a6531d7b7", "packagetype": "bdist_wheel", "python_version": "cp36", "requires_python": null, "size": 1634175, "upload_time": "2019-11-27T21:38:56", "upload_time_iso_8601": "2019-11-27T21:38:56.836388Z", "url": "https://files.pythonhosted.org/packages/a2/9a/361784c18e49fde46c490fbbb88cf3bb0d39f80125be7c4a6cd0257f8015/safelife-1.0rc3-cp36-cp36m-macosx_10_6_intel.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "2a72a4a5df779627950772b35b2c1b83", "sha256": "90f802aa33caeba07b6b9d2f40315e6cab3bc3faae7894b7a96a97d48acfa8a8"}, "downloads": -1, "filename": "safelife-1.0rc3.tar.gz", "has_sig": false, "md5_digest": "2a72a4a5df779627950772b35b2c1b83", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1021455, "upload_time": "2019-11-27T21:38:59", "upload_time_iso_8601": "2019-11-27T21:38:59.231439Z", "url": "https://files.pythonhosted.org/packages/11/6e/f6307f071ba441543ea71f6e7a41f9de1291f8e50d45c6620056a501ca26/safelife-1.0rc3.tar.gz", "yanked": false}], "1.0rc4": [{"comment_text": "", "digests": {"md5": "441a36b4cef4d0eccf974c97cbc49cd7", "sha256": "570d20c966d72e30494fd0e3aff7282d76ad4dc7004c55f80e88a87da49ecf77"}, "downloads": -1, "filename": "safelife-1.0rc4-cp36-cp36m-macosx_10_6_intel.whl", "has_sig": false, "md5_digest": "441a36b4cef4d0eccf974c97cbc49cd7", "packagetype": "bdist_wheel", "python_version": "cp36", "requires_python": null, "size": 1634183, "upload_time": "2019-11-27T23:18:57", "upload_time_iso_8601": "2019-11-27T23:18:57.842782Z", "url": "https://files.pythonhosted.org/packages/fc/90/e92b502acb25a625377c5887cf097ecb650d51c4504bcf888f0c4e7aa434/safelife-1.0rc4-cp36-cp36m-macosx_10_6_intel.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "ead050bcbc77179eba4628c8f0d555f6", "sha256": "1cd1337db95314c56b858aabf5c9e3cb92fa2f0848c8eb35542829f3bf6152e1"}, "downloads": -1, "filename": "safelife-1.0rc4.tar.gz", "has_sig": false, "md5_digest": "ead050bcbc77179eba4628c8f0d555f6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1021481, "upload_time": "2019-11-27T23:19:00", "upload_time_iso_8601": "2019-11-27T23:19:00.170055Z", "url": "https://files.pythonhosted.org/packages/85/ca/71e56e00b91fe408de1a7d9b3686c88e2c067a11fe458435c4ade685f2c3/safelife-1.0rc4.tar.gz", "yanked": false}], "1.1": [{"comment_text": "", "digests": {"md5": "b5c6b5a088d9cbd992699dd673528333", "sha256": "173e465ef310932fe230928db004d26bf518b1dd8a5b3156f0143a02b8ff1c78"}, "downloads": -1, "filename": "safelife-1.1-cp36-cp36m-macosx_10_9_x86_64.whl", "has_sig": false, "md5_digest": "b5c6b5a088d9cbd992699dd673528333", "packagetype": "bdist_wheel", "python_version": "cp36", "requires_python": null, "size": 1625393, "upload_time": "2020-03-23T22:45:41", "upload_time_iso_8601": "2020-03-23T22:45:41.630590Z", "url": "https://files.pythonhosted.org/packages/9d/a4/c3f850822f9ac8652b3258bc54aa294d82f4133cecec87439c594205b973/safelife-1.1-cp36-cp36m-macosx_10_9_x86_64.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "c59a135f0d34766b8c1ce2a015959562", "sha256": "9bb0c7a7125aebbf33714867f56c804bb2e4899b8eed1aa5d60c099188704915"}, "downloads": -1, "filename": "safelife-1.1.tar.gz", "has_sig": false, "md5_digest": "c59a135f0d34766b8c1ce2a015959562", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1026599, "upload_time": "2020-03-23T22:45:44", "upload_time_iso_8601": "2020-03-23T22:45:44.588120Z", "url": "https://files.pythonhosted.org/packages/03/0c/526aa570dbf6ce66e246f41aea063dbe82659b11ef9f7dbba123cd06cf68/safelife-1.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "b5c6b5a088d9cbd992699dd673528333", "sha256": "173e465ef310932fe230928db004d26bf518b1dd8a5b3156f0143a02b8ff1c78"}, "downloads": -1, "filename": "safelife-1.1-cp36-cp36m-macosx_10_9_x86_64.whl", "has_sig": false, "md5_digest": "b5c6b5a088d9cbd992699dd673528333", "packagetype": "bdist_wheel", "python_version": "cp36", "requires_python": null, "size": 1625393, "upload_time": "2020-03-23T22:45:41", "upload_time_iso_8601": "2020-03-23T22:45:41.630590Z", "url": "https://files.pythonhosted.org/packages/9d/a4/c3f850822f9ac8652b3258bc54aa294d82f4133cecec87439c594205b973/safelife-1.1-cp36-cp36m-macosx_10_9_x86_64.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "c59a135f0d34766b8c1ce2a015959562", "sha256": "9bb0c7a7125aebbf33714867f56c804bb2e4899b8eed1aa5d60c099188704915"}, "downloads": -1, "filename": "safelife-1.1.tar.gz", "has_sig": false, "md5_digest": "c59a135f0d34766b8c1ce2a015959562", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 1026599, "upload_time": "2020-03-23T22:45:44", "upload_time_iso_8601": "2020-03-23T22:45:44.588120Z", "url": "https://files.pythonhosted.org/packages/03/0c/526aa570dbf6ce66e246f41aea063dbe82659b11ef9f7dbba123cd06cf68/safelife-1.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:59:25 2020"}