{"info": {"author": "Samapriya Roy", "author_email": "samapriya.roy@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Intended Audience :: Developers", "Intended Audience :: Science/Research", "License :: OSI Approved :: Apache Software License", "Natural Language :: English", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Topic :: Scientific/Engineering :: GIS"], "description": "# satadd: CLI pipeline for Planet, Satellogic, Google Earth Engine and Digital Globe Imagery\n[![DOI](https://zenodo.org/badge/DOI/10.5281/zenodo.1450622.svg)](https://doi.org/10.5281/zenodo.1450622)\n[![PyPI version](https://badge.fury.io/py/satadd.svg)](https://badge.fury.io/py/satadd)\n\nCite as\n\n```\nSamapriya Roy. (2018, October 6). samapriya/satadd: satadd: CLI pipeline for Planet, Satellogic,\nGoogle Earth Engine and Digital Globe Imagery (Version 0.0.3). Zenodo. http://doi.org/10.5281/zenodo.1450622\n```\n\nGoogle Earth Engine opened the door for the possibility of getting a curated list of public datasets already ingested in an analysis platform. With over 450+ raster datasets alone, they form one of the most unique collections for publicly available datasets and are still growing. While this was happening for free and open source datasets more and more data was coming in and companies were opening their doors to open data and has missions to include researchers, users, developers and everyone else who wanted to use this datasets. This included but is not limited to companies like Planet, Digital Globe and Satellogic making large chunks of their datasets open for users. Also introduction of high temporal resolution datasets like PlanetScope, high spatial resolution like Skysat and Digital Globe and high spectral resolution images like hyperspectral data from Satellogic was changing our approach to problem solving. While there has been development in building standard API and data access methods there is still room for growth and standrardization and above all easy access to these resources. Planet's [Open California Program](https://www.planet.com/products/open-california/), the [Education and Research Program](https://www.planet.com/markets/education-and-research/) , Digital Globe's [Open Data Program](https://www.digitalglobe.com/opendata) and [Education and Research program under Satellogic and their Open Data](https://github.com/satellogic/open-impact) it became obvious that questions we can ask from these sensors could get interesting.\n\nThis tool was built with a focus on the same issues and borrow parts from my other projects such as [ppipe](https://pypi.org/project/ppipe/) for handling Planet's datasets, [gee2drive](https://pypi.org/project/gee2drive/) to handle download collections already available in Google Earth Engine (GEE), [pygbdx](https://pypi.org/project/pygbdx/) which is a relatively new project to explore Digital Globe assets and I have now integrated tools to access and download Satellogic imagery. Core components from a lot of these tools have gone into building [satadd](https://pypi.org/project/satadd/) based on the idea of adding satelite data as needed. These tools include authentications setups for every account, and access to datasets, metadata among other tools. This was not build however for heavy lifting though I have tested this on hundreds and thousands of assets delivery so it behaves robustly for now. The tool is build and rebuilt as companies change their authentication protocal and delivery mechanisms and allow for improving many aspects of data delivery and preprocessing in the next iterations.\n\nWhile almost all of these tools allow for local export, GEE only exports for now to Google Drive or your Google Cloud Storage Buckets, though what is lost in the delivery endpoints is gained in the fact that GEE is already a mature platform to analyze and look at open datasets but also allows you to bring private datasets into GEE for analysis. So while data download and local analysis may have been the norm, it serves us well to think about posting analysis rather in analysis engines. But that is a discussion for a different time. At this point, I am hoping that this tool alows you to do exactly what the intentions might have been from different providers and to bring them together. Since this tool downloads data it is indeed bandwidth heavy and requires a steady internet connection. This tools handles authentication, downloading, and talking to different API end points and services. In the future I am hoping to include additional preprocessing and delivery to non local endpoints like existing ftp, servers or buckets.\n\n## Table of contents\n* [Installation](#installation)\n* [Getting started](#getting-started)\n* [satadd Satellite Data Download Addon](#satadd-satellite-data-download-addon)\n    * [Initialize and Authenticate](#initialize-and-authenticate)\n    * [Planet Tools](#satadd-refresh)\n    * [GBDX Tools](#satadd-idsearch)\n    * [Satellogic Tools](#satadd-intersect)\n    * [GEE Tools](#satadd-bandtype)\n\n## Installation\nThis assumes that you have native python & pip installed in your system, you can test this by going to the terminal (or windows command prompt) and trying\n\n```python``` and then ```pip list```\n\nIf you get no errors and you have python 2.7.14 or higher you should be good to go. Please note that I have released this as a python 2.7 but can be easily modified for python 3.\n\n**This toolbox also uses some functionality from GDAL**\nFor installing GDAL in Ubuntu\n```\nsudo add-apt-repository ppa:ubuntugis/ppa && sudo apt-get update\nsudo apt-get install gdal-bin\nsudo apt-get install python-gdal\n```\nFor Windows I found this [guide](https://sandbox.idre.ucla.edu/sandbox/tutorials/installing-gdal-for-windows) from UCLA\n\nIt has been brought to my notice that installing shapely on windows is not simply ```pip install shapely``` so install Shapely separely and [use instructions from their pypi project page](https://pypi.org/project/Shapely/) for Windows installation **Shapely is important requirement for the tool but since the installation varies based on the operating system but install it using the earlier instructions anyways before the next steps**. On other operating systems ```pip install shapely``` should work just fine.\n\n\nTo install **satadd**\nYou can install using two methods\n\n```pip install satadd```\n\nor you can also try\n\n```\ngit clone https://github.com/samapriya/satadd.git\ncd satadd\npython setup.py install\n```\nFor linux use sudo. This release also contains a windows installer which bypasses the need for you to have admin permission, it does however require you to have python in the system path meaning when you open up command prompt you should be able to type python and start it within the command prompt window. Post installation using the installer you can just call satadd using the command prompt similar to calling python. Give it a go post installation type\n\n```\nsatadd -h\n```\n\nInstallation is an optional step; the application can be also run directly by executing satadd.py script. The advantage of having it installed is being able to execute satadd as any command line tool. I recommend installation within virtual environment. If you don't want to install, browse into the satadd folder and try ```python satadd.py``` to get to the same result.\n\n## Getting started\n\nAs usual, to print help:\n\n```\nusage: satadd.py [-h]\n                 {planetkey,dginit,satinit,eeinit,dasync,savedsearch,metadata,simple_search,footprint,satraster,satmeta,metalist,reproject,refresh,idsearch,intersect,band\ntype,export}\n                 ...\n\nSimple CLI for piping Planet, Satellogic,GEE & GBDX Assets\n\npositional arguments:\n  {planetkey,dginit,satinit,eeinit,dasync,savedsearch,metadata,simple_search,footprint,satraster,satmeta,metalist,reproject,refresh,idsearch,intersect,bandtype,export}\n    planetkey           Setting up planet API Key\n    dginit              Initialize Digital Globe GBDX\n    satinit             Initialize Satellogic Tokens\n    eeinit              Initialize Google Earth Engine\n    credrefresh         Refresh Satellogic & GBDX tokens\n\n\n    dasync              Uses the Planet Client Async Downloader to download Planet Assets: Does not require activation\n    savedsearch         Tool to download saved searches from Planet Explorer\n    metadata            Tool to tabulate and convert all metadata files from Planet\n                        Item and Asset types for Ingestion into GEE\n\n\n    simple_search       Simple search to look for DG assets that intersect your AOI handles KML/SHP/GEOJSON\n    metadata            Exports metadata for simple search into constitutent folders as JSON files\n    footprint           Exports footprint for metadata files extracted earlier\n                        and converts them to individual geometries (GeoJSON)and combined geometry (GeoJSON) file\n\n\n    satraster           Filter and download Satellogic Imagery\n    satlist             Get url for band list based on filtered Satellogic Imagery\n    multiproc           Multiprocess based downloader based on satlist\n    satmeta             Filter and download Satellogic Metadata\n    metalist            Generates Basic Metadata list per scene for Satellogic Imagery\n    reproject           Batch reproject rasters using EPSG code\n\n\n    eerefresh           Refreshes your personal asset list and GEE Asset list\n    idsearch            Does possible matches using asset name to give you asseth id/full path\n    intersect           Exports a report of all assets(Personal & GEE) intersecting with provided geometry\n    bandtype            Prints GEE bandtype and generates list to be used for export\n    export              Export GEE Collections based on filter\n\noptional arguments:\n  -h, --help            show this help message and exit\n```\n\nTo obtain help for a specific functionality, simply call it with _help_ switch, e.g.: `satadd idsearch -h`. If you didn't install satadd, then you can run it just by going to *satadd* directory and running `python satadd.py [arguments go here]`\n\n### satadd Satellite Data Download Addon\nThis tool is designed to augment to the existing facilty of image export using a CLI, whereby you can pass it arguments to filter based on an area of interest geojson file, a start and end date for collection\n\n![cli](/images/satadd.jpg)\n\n### Initialize and Authenticate\nThis is an autosuggestive terminal which uses the gee2add package to perform all of the functions but has autosuggest for Earth Engine catalog and your own personal catalog. This way you can get access to image id without needing the catalog id in the javascript codeeditor.\n\n```\nplanetkey           Setting up planet API Key\ndginit              Initialize Digital Globe GBDX\nsatinit             Initialize Satellogic Tokens\neeinit              Initialize Google Earth Engine\ncredrefresh         Refresh Satellogic & GBDX tokens\n```\n\nEach of these authentication tools allow you to link and save credentials for each of these services you can check them by typing something like ```satadd planetkey```. Certain services require the authentication tokens to be refreshed you can simply access it using ```satadd credrefresh```.\n\n### Planet Tools\nThe Planet Toolsets consists of tools required to access control and download planet labs assets (PlanetScope and RapidEye OrthoTiles) as well as parse metadata in a tabular form which maybe required by other applications. These tools are designed to interact with [Planet's Python Client](https://pypi.org/project/planet/) and the saved search featured embedded in [Planet Explorer](https://www.planet.com/explorer/) and will allow you to access and download planet imagery and metadata as needed. This also allows you to process the metadata incase you are ingesting this to GEE.\n\n```\ndasync              Uses the Planet Client Async Downloader to download Planet Assets: Does not require activation\nsavedsearch         Tool to download saved searches from Planet Explorer\nmetadata            Tool to tabulate and convert all metadata files from Planet\n                    Item and Asset types for Ingestion into GEE\n```\n\n### GBDX Tools\nThis is a simple cli to Digital Globe's GBDX platform, this was designed from the perspective of community user (the freely available tier). This platform allows you to access all of DG's Open data and also open Ikonos data along with Landsat and Sentinel datasets. You can create a [notebook acccount here](https://notebooks.geobigdata.io). The notebook setup offers additional tools, a GUI and interactive framework while CLI simplifies some of the operational needs of batch processing and performing calls using your own local machine. This tool will allow you to perform a simple seach using a geometry to get asset summary, export the metadata as json file and also image footprint as a combined and individual geojson files.\n\n```\nsimple_search       Simple search to look for DG assets that intersect your AOI handles KML/SHP/GEOJSON\nmetadata            Exports metadata for simple search into constitutent folders as JSON files\nfootprint           Exports footprint for metadata files extracted earlier\n                    and converts them to individual geometries (GeoJSON)and combined geometry (GeoJSON) file\n```\n\n### Satellogic Tools\nThis tool allows you to access the [open data shared by Satellogic](https://github.com/satellogic/open-impact) and filter and pass a geometry object to get both micro(multiband) and macro (hyperspectral) rasters, metadata and basic metadalist. The download tool is a multipart downloader to handle quick downloads. The metalist tool can be used to create a simple metadata list for you to batch upload imagery into GEE for analysis. The reproject tool is included to handle batch reprojections as needed. The tool uses geometry passed as a geojson object go to [geojson.io](http://geojson.io). Satlist produces the band list urls and you can then use the multiproc tool to use multiprocessing to download the links.\n\n```\nsatraster           Filter and download Satellogic Imagery\nsatlist             Get url for band list based on filtered Satellogic Imagery\nmultiproc           Multiprocess based downloader based on satlist\nsatmeta             Filter and download Satellogic Metadata\nmetalist            Generates Basic Metadata list per scene for Satellogic Imagery\nreproject           Batch reproject rasters using EPSG code\n```\n\n### GEE Tools\nThis tool allows you to use the gee2drive tool functionalities to explore, match and export existing collections in GEE. Export requires all the bandtypes to be of the same kind. For the past couple of months I have [maintained a catalog of the most current Google Earth Engine assets](https://github.com/samapriya/Earth-Engine-Datasets-List), within their raster data catalog. I update this list every week. This tool downloads the most current version of this list, and allows the user to explore band types and export a collection as needed.\n\n```\neerefresh           Refreshes your personal asset list and GEE Asset list\nidsearch            Does possible matches using asset name to give you asseth id/full path\nintersect           Exports a report of all assets(Personal & GEE) intersecting with provided geometry\nbandtype            Prints GEE bandtype and generates list to be used for export\nexport              Export GEE Collections based on filter\n```\n\n## Changelog\n\n### v0.0.4\n\n- Fixed issue with Shapely install on windows\n- Updated credrefresh to better refresh gbdx tokens\n\n### v0.0.3\n\n- Added better filename parsing for Satellogic images\n- Added error handling for multiprocessing download of Satellogic images\n\n### v0.0.2\n\n- Now searches for all DG and non DG assets available within GBDX\n- Added capability to create url list for rasters and download support using multiprocessing", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/samapriya/satadd", "keywords": "", "license": "Apache 2.0", "maintainer": "", "maintainer_email": "", "name": "satadd", "package_url": "https://pypi.org/project/satadd/", "platform": "", "project_url": "https://pypi.org/project/satadd/", "project_urls": {"Homepage": "https://github.com/samapriya/satadd"}, "release_url": "https://pypi.org/project/satadd/0.0.4/", "requires_dist": null, "requires_python": "", "summary": "Simple CLI for piping Planet, Satellogic, GEE & GBDX Assets", "version": "0.0.4", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>satadd: CLI pipeline for Planet, Satellogic, Google Earth Engine and Digital Globe Imagery</h1>\n<p><a href=\"https://doi.org/10.5281/zenodo.1450622\" rel=\"nofollow\"><img alt=\"DOI\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/ce821bab0cdcbcdf06a0d3c6f6b0d5ebf3f84123/68747470733a2f2f7a656e6f646f2e6f72672f62616467652f444f492f31302e353238312f7a656e6f646f2e313435303632322e737667\"></a>\n<a href=\"https://badge.fury.io/py/satadd\" rel=\"nofollow\"><img alt=\"PyPI version\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/4e20325e97551511fcc01a07df6da52951c59747/68747470733a2f2f62616467652e667572792e696f2f70792f7361746164642e737667\"></a></p>\n<p>Cite as</p>\n<pre><code>Samapriya Roy. (2018, October 6). samapriya/satadd: satadd: CLI pipeline for Planet, Satellogic,\nGoogle Earth Engine and Digital Globe Imagery (Version 0.0.3). Zenodo. http://doi.org/10.5281/zenodo.1450622\n</code></pre>\n<p>Google Earth Engine opened the door for the possibility of getting a curated list of public datasets already ingested in an analysis platform. With over 450+ raster datasets alone, they form one of the most unique collections for publicly available datasets and are still growing. While this was happening for free and open source datasets more and more data was coming in and companies were opening their doors to open data and has missions to include researchers, users, developers and everyone else who wanted to use this datasets. This included but is not limited to companies like Planet, Digital Globe and Satellogic making large chunks of their datasets open for users. Also introduction of high temporal resolution datasets like PlanetScope, high spatial resolution like Skysat and Digital Globe and high spectral resolution images like hyperspectral data from Satellogic was changing our approach to problem solving. While there has been development in building standard API and data access methods there is still room for growth and standrardization and above all easy access to these resources. Planet's <a href=\"https://www.planet.com/products/open-california/\" rel=\"nofollow\">Open California Program</a>, the <a href=\"https://www.planet.com/markets/education-and-research/\" rel=\"nofollow\">Education and Research Program</a> , Digital Globe's <a href=\"https://www.digitalglobe.com/opendata\" rel=\"nofollow\">Open Data Program</a> and <a href=\"https://github.com/satellogic/open-impact\" rel=\"nofollow\">Education and Research program under Satellogic and their Open Data</a> it became obvious that questions we can ask from these sensors could get interesting.</p>\n<p>This tool was built with a focus on the same issues and borrow parts from my other projects such as <a href=\"https://pypi.org/project/ppipe/\" rel=\"nofollow\">ppipe</a> for handling Planet's datasets, <a href=\"https://pypi.org/project/gee2drive/\" rel=\"nofollow\">gee2drive</a> to handle download collections already available in Google Earth Engine (GEE), <a href=\"https://pypi.org/project/pygbdx/\" rel=\"nofollow\">pygbdx</a> which is a relatively new project to explore Digital Globe assets and I have now integrated tools to access and download Satellogic imagery. Core components from a lot of these tools have gone into building <a href=\"https://pypi.org/project/satadd/\" rel=\"nofollow\">satadd</a> based on the idea of adding satelite data as needed. These tools include authentications setups for every account, and access to datasets, metadata among other tools. This was not build however for heavy lifting though I have tested this on hundreds and thousands of assets delivery so it behaves robustly for now. The tool is build and rebuilt as companies change their authentication protocal and delivery mechanisms and allow for improving many aspects of data delivery and preprocessing in the next iterations.</p>\n<p>While almost all of these tools allow for local export, GEE only exports for now to Google Drive or your Google Cloud Storage Buckets, though what is lost in the delivery endpoints is gained in the fact that GEE is already a mature platform to analyze and look at open datasets but also allows you to bring private datasets into GEE for analysis. So while data download and local analysis may have been the norm, it serves us well to think about posting analysis rather in analysis engines. But that is a discussion for a different time. At this point, I am hoping that this tool alows you to do exactly what the intentions might have been from different providers and to bring them together. Since this tool downloads data it is indeed bandwidth heavy and requires a steady internet connection. This tools handles authentication, downloading, and talking to different API end points and services. In the future I am hoping to include additional preprocessing and delivery to non local endpoints like existing ftp, servers or buckets.</p>\n<h2>Table of contents</h2>\n<ul>\n<li><a href=\"#installation\" rel=\"nofollow\">Installation</a></li>\n<li><a href=\"#getting-started\" rel=\"nofollow\">Getting started</a></li>\n<li><a href=\"#satadd-satellite-data-download-addon\" rel=\"nofollow\">satadd Satellite Data Download Addon</a>\n<ul>\n<li><a href=\"#initialize-and-authenticate\" rel=\"nofollow\">Initialize and Authenticate</a></li>\n<li><a href=\"#satadd-refresh\" rel=\"nofollow\">Planet Tools</a></li>\n<li><a href=\"#satadd-idsearch\" rel=\"nofollow\">GBDX Tools</a></li>\n<li><a href=\"#satadd-intersect\" rel=\"nofollow\">Satellogic Tools</a></li>\n<li><a href=\"#satadd-bandtype\" rel=\"nofollow\">GEE Tools</a></li>\n</ul>\n</li>\n</ul>\n<h2>Installation</h2>\n<p>This assumes that you have native python &amp; pip installed in your system, you can test this by going to the terminal (or windows command prompt) and trying</p>\n<p><code>python</code> and then <code>pip list</code></p>\n<p>If you get no errors and you have python 2.7.14 or higher you should be good to go. Please note that I have released this as a python 2.7 but can be easily modified for python 3.</p>\n<p><strong>This toolbox also uses some functionality from GDAL</strong>\nFor installing GDAL in Ubuntu</p>\n<pre><code>sudo add-apt-repository ppa:ubuntugis/ppa &amp;&amp; sudo apt-get update\nsudo apt-get install gdal-bin\nsudo apt-get install python-gdal\n</code></pre>\n<p>For Windows I found this <a href=\"https://sandbox.idre.ucla.edu/sandbox/tutorials/installing-gdal-for-windows\" rel=\"nofollow\">guide</a> from UCLA</p>\n<p>It has been brought to my notice that installing shapely on windows is not simply <code>pip install shapely</code> so install Shapely separely and <a href=\"https://pypi.org/project/Shapely/\" rel=\"nofollow\">use instructions from their pypi project page</a> for Windows installation <strong>Shapely is important requirement for the tool but since the installation varies based on the operating system but install it using the earlier instructions anyways before the next steps</strong>. On other operating systems <code>pip install shapely</code> should work just fine.</p>\n<p>To install <strong>satadd</strong>\nYou can install using two methods</p>\n<p><code>pip install satadd</code></p>\n<p>or you can also try</p>\n<pre><code>git clone https://github.com/samapriya/satadd.git\ncd satadd\npython setup.py install\n</code></pre>\n<p>For linux use sudo. This release also contains a windows installer which bypasses the need for you to have admin permission, it does however require you to have python in the system path meaning when you open up command prompt you should be able to type python and start it within the command prompt window. Post installation using the installer you can just call satadd using the command prompt similar to calling python. Give it a go post installation type</p>\n<pre><code>satadd -h\n</code></pre>\n<p>Installation is an optional step; the application can be also run directly by executing satadd.py script. The advantage of having it installed is being able to execute satadd as any command line tool. I recommend installation within virtual environment. If you don't want to install, browse into the satadd folder and try <code>python satadd.py</code> to get to the same result.</p>\n<h2>Getting started</h2>\n<p>As usual, to print help:</p>\n<pre><code>usage: satadd.py [-h]\n                 {planetkey,dginit,satinit,eeinit,dasync,savedsearch,metadata,simple_search,footprint,satraster,satmeta,metalist,reproject,refresh,idsearch,intersect,band\ntype,export}\n                 ...\n\nSimple CLI for piping Planet, Satellogic,GEE &amp; GBDX Assets\n\npositional arguments:\n  {planetkey,dginit,satinit,eeinit,dasync,savedsearch,metadata,simple_search,footprint,satraster,satmeta,metalist,reproject,refresh,idsearch,intersect,bandtype,export}\n    planetkey           Setting up planet API Key\n    dginit              Initialize Digital Globe GBDX\n    satinit             Initialize Satellogic Tokens\n    eeinit              Initialize Google Earth Engine\n    credrefresh         Refresh Satellogic &amp; GBDX tokens\n\n\n    dasync              Uses the Planet Client Async Downloader to download Planet Assets: Does not require activation\n    savedsearch         Tool to download saved searches from Planet Explorer\n    metadata            Tool to tabulate and convert all metadata files from Planet\n                        Item and Asset types for Ingestion into GEE\n\n\n    simple_search       Simple search to look for DG assets that intersect your AOI handles KML/SHP/GEOJSON\n    metadata            Exports metadata for simple search into constitutent folders as JSON files\n    footprint           Exports footprint for metadata files extracted earlier\n                        and converts them to individual geometries (GeoJSON)and combined geometry (GeoJSON) file\n\n\n    satraster           Filter and download Satellogic Imagery\n    satlist             Get url for band list based on filtered Satellogic Imagery\n    multiproc           Multiprocess based downloader based on satlist\n    satmeta             Filter and download Satellogic Metadata\n    metalist            Generates Basic Metadata list per scene for Satellogic Imagery\n    reproject           Batch reproject rasters using EPSG code\n\n\n    eerefresh           Refreshes your personal asset list and GEE Asset list\n    idsearch            Does possible matches using asset name to give you asseth id/full path\n    intersect           Exports a report of all assets(Personal &amp; GEE) intersecting with provided geometry\n    bandtype            Prints GEE bandtype and generates list to be used for export\n    export              Export GEE Collections based on filter\n\noptional arguments:\n  -h, --help            show this help message and exit\n</code></pre>\n<p>To obtain help for a specific functionality, simply call it with <em>help</em> switch, e.g.: <code>satadd idsearch -h</code>. If you didn't install satadd, then you can run it just by going to <em>satadd</em> directory and running <code>python satadd.py [arguments go here]</code></p>\n<h3>satadd Satellite Data Download Addon</h3>\n<p>This tool is designed to augment to the existing facilty of image export using a CLI, whereby you can pass it arguments to filter based on an area of interest geojson file, a start and end date for collection</p>\n<p><img alt=\"cli\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/e901c065fc448c5a09e292d72c137be966f63385/2f696d616765732f7361746164642e6a7067\"></p>\n<h3>Initialize and Authenticate</h3>\n<p>This is an autosuggestive terminal which uses the gee2add package to perform all of the functions but has autosuggest for Earth Engine catalog and your own personal catalog. This way you can get access to image id without needing the catalog id in the javascript codeeditor.</p>\n<pre><code>planetkey           Setting up planet API Key\ndginit              Initialize Digital Globe GBDX\nsatinit             Initialize Satellogic Tokens\neeinit              Initialize Google Earth Engine\ncredrefresh         Refresh Satellogic &amp; GBDX tokens\n</code></pre>\n<p>Each of these authentication tools allow you to link and save credentials for each of these services you can check them by typing something like <code>satadd planetkey</code>. Certain services require the authentication tokens to be refreshed you can simply access it using <code>satadd credrefresh</code>.</p>\n<h3>Planet Tools</h3>\n<p>The Planet Toolsets consists of tools required to access control and download planet labs assets (PlanetScope and RapidEye OrthoTiles) as well as parse metadata in a tabular form which maybe required by other applications. These tools are designed to interact with <a href=\"https://pypi.org/project/planet/\" rel=\"nofollow\">Planet's Python Client</a> and the saved search featured embedded in <a href=\"https://www.planet.com/explorer/\" rel=\"nofollow\">Planet Explorer</a> and will allow you to access and download planet imagery and metadata as needed. This also allows you to process the metadata incase you are ingesting this to GEE.</p>\n<pre><code>dasync              Uses the Planet Client Async Downloader to download Planet Assets: Does not require activation\nsavedsearch         Tool to download saved searches from Planet Explorer\nmetadata            Tool to tabulate and convert all metadata files from Planet\n                    Item and Asset types for Ingestion into GEE\n</code></pre>\n<h3>GBDX Tools</h3>\n<p>This is a simple cli to Digital Globe's GBDX platform, this was designed from the perspective of community user (the freely available tier). This platform allows you to access all of DG's Open data and also open Ikonos data along with Landsat and Sentinel datasets. You can create a <a href=\"https://notebooks.geobigdata.io\" rel=\"nofollow\">notebook acccount here</a>. The notebook setup offers additional tools, a GUI and interactive framework while CLI simplifies some of the operational needs of batch processing and performing calls using your own local machine. This tool will allow you to perform a simple seach using a geometry to get asset summary, export the metadata as json file and also image footprint as a combined and individual geojson files.</p>\n<pre><code>simple_search       Simple search to look for DG assets that intersect your AOI handles KML/SHP/GEOJSON\nmetadata            Exports metadata for simple search into constitutent folders as JSON files\nfootprint           Exports footprint for metadata files extracted earlier\n                    and converts them to individual geometries (GeoJSON)and combined geometry (GeoJSON) file\n</code></pre>\n<h3>Satellogic Tools</h3>\n<p>This tool allows you to access the <a href=\"https://github.com/satellogic/open-impact\" rel=\"nofollow\">open data shared by Satellogic</a> and filter and pass a geometry object to get both micro(multiband) and macro (hyperspectral) rasters, metadata and basic metadalist. The download tool is a multipart downloader to handle quick downloads. The metalist tool can be used to create a simple metadata list for you to batch upload imagery into GEE for analysis. The reproject tool is included to handle batch reprojections as needed. The tool uses geometry passed as a geojson object go to <a href=\"http://geojson.io\" rel=\"nofollow\">geojson.io</a>. Satlist produces the band list urls and you can then use the multiproc tool to use multiprocessing to download the links.</p>\n<pre><code>satraster           Filter and download Satellogic Imagery\nsatlist             Get url for band list based on filtered Satellogic Imagery\nmultiproc           Multiprocess based downloader based on satlist\nsatmeta             Filter and download Satellogic Metadata\nmetalist            Generates Basic Metadata list per scene for Satellogic Imagery\nreproject           Batch reproject rasters using EPSG code\n</code></pre>\n<h3>GEE Tools</h3>\n<p>This tool allows you to use the gee2drive tool functionalities to explore, match and export existing collections in GEE. Export requires all the bandtypes to be of the same kind. For the past couple of months I have <a href=\"https://github.com/samapriya/Earth-Engine-Datasets-List\" rel=\"nofollow\">maintained a catalog of the most current Google Earth Engine assets</a>, within their raster data catalog. I update this list every week. This tool downloads the most current version of this list, and allows the user to explore band types and export a collection as needed.</p>\n<pre><code>eerefresh           Refreshes your personal asset list and GEE Asset list\nidsearch            Does possible matches using asset name to give you asseth id/full path\nintersect           Exports a report of all assets(Personal &amp; GEE) intersecting with provided geometry\nbandtype            Prints GEE bandtype and generates list to be used for export\nexport              Export GEE Collections based on filter\n</code></pre>\n<h2>Changelog</h2>\n<h3>v0.0.4</h3>\n<ul>\n<li>Fixed issue with Shapely install on windows</li>\n<li>Updated credrefresh to better refresh gbdx tokens</li>\n</ul>\n<h3>v0.0.3</h3>\n<ul>\n<li>Added better filename parsing for Satellogic images</li>\n<li>Added error handling for multiprocessing download of Satellogic images</li>\n</ul>\n<h3>v0.0.2</h3>\n<ul>\n<li>Now searches for all DG and non DG assets available within GBDX</li>\n<li>Added capability to create url list for rasters and download support using multiprocessing</li>\n</ul>\n\n          </div>"}, "last_serial": 4390572, "releases": {"0.0.1": [{"comment_text": "", "digests": {"md5": "e1d438b18811b647ffec6b42b3dc2429", "sha256": "a4094f7214373441b2dff61e9a8d0999800eb5e8ff86671b647389f0eab96f75"}, "downloads": -1, "filename": "satadd-0.0.1.tar.gz", "has_sig": false, "md5_digest": "e1d438b18811b647ffec6b42b3dc2429", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 29407, "upload_time": "2018-10-03T18:52:02", "upload_time_iso_8601": "2018-10-03T18:52:02.843258Z", "url": "https://files.pythonhosted.org/packages/70/61/95570ef662a94942417046f17aa27ae2cbdd9d143d9d8b77d6246f7267cc/satadd-0.0.1.tar.gz", "yanked": false}], "0.0.2": [{"comment_text": "", "digests": {"md5": "a23dec632fda17803fccb113d429af1d", "sha256": "29542bda498d19f070070ccb5729d4d0169aa00c3013dda1524c05ce9e7257b0"}, "downloads": -1, "filename": "satadd-0.0.2.tar.gz", "has_sig": false, "md5_digest": "a23dec632fda17803fccb113d429af1d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 31289, "upload_time": "2018-10-05T23:11:57", "upload_time_iso_8601": "2018-10-05T23:11:57.083915Z", "url": "https://files.pythonhosted.org/packages/ce/e4/8378723a3fdb7e1d9281c5126aae214d0a291a0dda5d9175e56212ab0421/satadd-0.0.2.tar.gz", "yanked": false}], "0.0.3": [{"comment_text": "", "digests": {"md5": "8df10f69a3df1ac92bb3022996136473", "sha256": "f2bfbf8d0211e064a05b2eafdfde460f6916a328d257459cfcb483dfb7895a4f"}, "downloads": -1, "filename": "satadd-0.0.3.tar.gz", "has_sig": false, "md5_digest": "8df10f69a3df1ac92bb3022996136473", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 31265, "upload_time": "2018-10-06T18:35:31", "upload_time_iso_8601": "2018-10-06T18:35:31.573391Z", "url": "https://files.pythonhosted.org/packages/4a/ef/76eb2cf419b66c65cd81e17a314533830d4fcb1eaf09dbf8394ff7dac8fa/satadd-0.0.3.tar.gz", "yanked": false}], "0.0.4": [{"comment_text": "", "digests": {"md5": "02da564b3fade34dfdc965a9071030b9", "sha256": "fd4dd09bae93217f4de58215cc3aaf91d7df53e96e1872f59cc2865df896e95e"}, "downloads": -1, "filename": "satadd-0.0.4.tar.gz", "has_sig": false, "md5_digest": "02da564b3fade34dfdc965a9071030b9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 31844, "upload_time": "2018-10-18T14:26:03", "upload_time_iso_8601": "2018-10-18T14:26:03.199705Z", "url": "https://files.pythonhosted.org/packages/28/4c/62798123209ab8a613c4d000bc51a36b7b726a257059d391385d2dc8bae6/satadd-0.0.4.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "02da564b3fade34dfdc965a9071030b9", "sha256": "fd4dd09bae93217f4de58215cc3aaf91d7df53e96e1872f59cc2865df896e95e"}, "downloads": -1, "filename": "satadd-0.0.4.tar.gz", "has_sig": false, "md5_digest": "02da564b3fade34dfdc965a9071030b9", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 31844, "upload_time": "2018-10-18T14:26:03", "upload_time_iso_8601": "2018-10-18T14:26:03.199705Z", "url": "https://files.pythonhosted.org/packages/28/4c/62798123209ab8a613c4d000bc51a36b7b726a257059d391385d2dc8bae6/satadd-0.0.4.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:58:31 2020"}