{"info": {"author": "codimoc", "author_email": "codimoc@prismoid.uk", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "## Introduction\nLike many wallet applications, this Python-based utility addresses the requirement of having a single point of access for the large amount\nof sensitive information that our social-media presence requires.\n\nIf simple and memorable passwords are bad, recycling the same password over and over is evil: with one access compromised, all our secrets and sensitive information are potentially exposed.\n\nProducing and remembering a different complex password for each remote account is hard, and it can quickly become unmanageable when passwords need changing frequently.\n\nTo store these secrets on paper is not very smart either: a notebook can be safely tucked away in a locked drawer, \nbut it is not very helpful when trying to remember the login credentials of a personal banking site or a private health insurance, while on holiday abroad.\n\nAnd if the secret wallet travels with us, it is constantly at risk of being compromised or lost. And with it, all the secrets it contains.\n\nKeeping these secrets on an electronic wallet instead, on a PC, a tablet or a phone, is as safe as the device where these secrets are stored on.\nData can be encrypted on a hard drive, but the disk can fail, the phone can be stolen, the tablet forgotten on a plane.\n\n## Index\n*  [motivations](#motivations)\n*  [description](#description)\n*  [concepts](#concepts)\n*  [requirements](#requirements)\n*  [installation](#installation)\n*  [first time configuration](#configuration)\n*  [password strength](#passwords)\n*  [syntax](#syntax)\n*  [usage](#usage)\n*  [the secret wallet session](#session)\n*  [customization of parameters](#customization)\n*  [reconfiguration](#reconfiguration)\n*  [work in progress](#work)\n*  [help needed](#help)\n*  [FAQ](#faq)\n*  [Release Notes](Release+Notes)\n\n## <a id=\"motivations\"></a>Motivations\n\nFundamentally there are two conflicting requirements to keep in mind: ease of access for the data-owner and protection from unwanted access.\n\nLet's consider these in detail:\n* **accessibility**: \n    * The data should be available remotely, from any location. \n    * There should be a single copy of the stored data.\n    * The data should be accessible from different devices, of different type. \n    * Data retrieval should be _user-friendly_ and fast.\n    * Data retrieved should be in a format that can be easily cut & pasted into a login form from the same device. \n* **security**:\n    * Sensitive data, stored remotely on a server or on the cloud, should be encrypted.\n    * There should be no risk of _man in the middle_, _i.e._ data should be transmitted in encrypted format.\n    * Data access should be protected by different and independent security tokens.\n    * Encryption should happen locally, on trusted devices. Trusted devices can be configured\n    by using the same hash-key for encryption (the salt). The generation of this hash-key should be password protected. \n    * The memorable password used as the encryption key should be remembered by the owner and not stored.\n    * The password for configuring the trusted device should be different from the memorable password used\n    to encrypt the data.\n    * There should be a third layer of protection on the remote store. \n\n\n## <a id=\"description\"></a> The secret wallet, by codimoc, and security considerations\n\nThis Python-based application strives to fulfil these requirements and motivations by:\n\n*   Using the AWS DynamoDB as the remote store, and relying on the security layer of the Amazon cloud as the third layer of protection. \n*   using the **cryptography** package for local encryption (on device).\n*   using the AWS **boto3** package to interact with the remote store.\n*   securing both devices and secrets with independent and strong passwords (**password_strength** package): these are the first two layers of protection.\n*   providing console-based interaction with the secret wallet (for the time being)\n\nSecuring the allowed devices with a configuration password provides safety against misuses of the store, once the memorable password is\ncompromised by accident. For example, if the memorable password is confided to others or guessed, only pre-configured devices can access \nthe secrets.\n\nOn the other hand, if a device is lost or stolen, the memorable password is still required to access the secrets. The AWS security layer does not help in this case, \nwith the AWS secure credentials helpfully located on the compromised device's file system.\n\n## <a id=\"concepts\"></a>Concepts\nThe basic unit of information stored on the remote DB is a **secret**. \nEach secret is identified by a pair of two keys, the domain key and the access key:\n*   **domain**: it is the principal context of that secret, _e.g_ the name of a service provider for which some access credentials are needed.\n*   **access**: it is a sub-context of the _domain_; for example if the main domain is a utility provider providing both a gas and electricity accounts, we might have two secrets with the same domain but different accesses. This separation of domain and access facilitates queries to the DB, since we might want to know all the accesses for a given domain, or all the available domains in the wallet.\n   \nEach secret contains three nullable items of data:\n*   **uid**: the user id, or the login credential for that secret. This is stored as an encrypted value,\n*   **pwd**: the password required to login in the account with the given user id, for example the user id and password for an online shopping account. \nThis password-data is also stored encrypted at the source (from the local client),\n*   **info**: a map of extra information regarding this secret. This meta-data is open-ended, in the sense that anything can go into this dictionary, and it is stored as a json dictionary, with keys not encrypted and values encrypted. For example, if the secret refers to a shopping account, the map could be as follows:\n\n\n    {'telephone' : 1234,\n     'delivery-agent' : 'Fast delivery Limited'}\n\n \n## <a id=\"requirements\"></a>Dependencies and requirements\nThe **secret wallet** uses the AWS cloud to store the secret information; in particular it relies on the *no-SQL* service, known as AWS *DynamoDB*. This is a database with tables that can be defined by the declaration of one or two primary keys. The remaining part of the schema can change and grow based on the data inserted, depending on the format of the records we want to store. The advantage of this storage solution are:\n*   It is a remote storage widely available on the Amazon cloud.\n*   It is easy to use and create new tables,\n*   It is available in the [AWS Free Tier](https://aws.amazon.com/free/?all-free-tier.sort-by=item.additionalFields.SortRank&all-free-tier.sort-order=asc) package that Amazon offers as an entry point into their echo-system.\n\nIn order to use the **secret wallet** it is necessary to use an Amazon AWS account,  or create a new one. This can be done quickly and easily from the [AWS Free Tier](https://aws.amazon.com/free/?all-free-tier.sort-by=item.additionalFields.SortRank&all-free-tier.sort-order=asc) page. Once the account has been created, three pieces of information are required for the **secret wallet**:\n*   the **aws_access_key_id**: to identify the account\n*   the **aws_secret_access_key**: which can be created after logging into the account; this key can be regenerated several times.\n*   the **region**: the physical location of the server, possibly close to the location of usage.\n\nThese three records should be noted down when creating the account or copied onto the clipboard or on a file. They will be needed later, when [configuring](#configuration) the **secret wallet**.\n\nIt should be noted that the initial AWS keys, produced on creation of the new account, are root credentials for that account. It is safer, once logged into this new AWS account, to generate a different IAM role with limited access, for example a programmatic user, and to use the relative credentials instead. Instruction on how to do this can be found [here](https://aws.amazon.com/iam/).\n\n## <a id=\"installation\"></a>Installation\nThe **secret wallet** is installed in the usual manner, as any other python packages, and requires a minimum Python version of 3.6.\nThe installation is done with:\n\n    pip install secret-wallet-codimoc \n\nAfter installing all the dependencies from other python packages,  it produce two new executable scripts:\n*   **secret_wallet** for the command line management of the secret wallet and\n*   **secret_wallet_conf** for the first time configuration as described below\n\n## <a id=\"configuration\"></a>First time configuration\nConfiguring the **secret wallet** is required in order to save both the AWS credentials for the Amazon cloud and the device's configuration key, which is the first layer of security to protect your secrets. This configuration also creates the DynamoDB table used to store the secrets.\n\nThis *first time configuration* is performed by running the **secret_wallet_conf** script from the command line. This script is interactive, in the old way of *questions and answers*, and provides some default values when possible. \nIt is divided into two separate steps, each of which can be skipped. Skipping a step allows to avoid overwriting credentials, if the system was partially configured, and a partial change of configuration is desired. \n\nThese steps are:\n*   Storing the **AWS credentials**: this results in creating or modifying the *credentials* file in the *.aws*  directory, located in the user home directory. This file is typically divided into separate sections. This allows to persist  different connections to different services on the Amazon cloud. The section relevant to the **secret-wallet** is market with the heading [secret-wallet].\n*   Storing the **secret wallet configuration**: this step persists the information in the *secretwallet.json* file in the *.secretwallet* directory, located in the user home directory. This configuration file is used to store the device encryption key, the name of the AWS connection profile and the table name where the secrets are stored. This file is also used to store customization parameters as described in [this section](#customization).  \n\nWhen questions are asked during the configuration, please type the first letter of the answer (e.g. *s* for *skip*) to select that choice. Whenever a default value is suggested, simply hit the *Return* button to confirm that choice.  \n\n## <a id=\"passwords\"></a>Password strength\nStrong passwords are required by this application.\nWhenever a new password is needed, two verification steps are performed:\n*   verify that the password is strong\n*   verify that the password is correctly typed, by re-entering it a second time.\n\nA chosen password is considered to be strong under the following requirements:\n*   At least eight characters long\n*   Should contain  at least one upper-case character\n*   Should contain  at least one number\n*   Should contain  at least one special character (!,~,^,@...)\n\nOnly two different passwords are ever required: the configuration password to produce the device's encrypted key and the memorable password.\n\nThe first password for the **device encryption key** will be used only when configuring the device, but must be remembered when configuring additional devices. Different configuration keys will result in an **InvalidToken** error when retrieving secrets saved by a different device.\n  \nThe **memorable password** is used whenever saving or retrieving secrets. This password should always be the same, and can only be changed by performing a full [reconfiguration process](reconfiguration). To prevent retyping this password many times over, a session is opened and it runs in the background keeping track of the password for a short period of time. This will be discussed in [this section](#session). \n\n## <a id=\"syntax\"></a>Syntax\nThe syntax of the **secret_wallet** script is:\n\n    secret_wallet <command> [options]\n\n\nwhere the options are different for different commands. To get a list of available commands simply type:\n\n\n    secret_wallet help\n\nPlease be aware that not all commands are be available in the first releases of this application.\n\nTo find about the available options for a given command, just type:\n\n\n    secret_wallet <command> -h \n\n\nFor example, the options for the *set* command can be displayed by:\n\n    secret_wallet set -h\n    \nTo avoid possible errors, please remember to enclose the textual arguments within single or double quotes, when these arguments contain spaces or special characters. \n\n\n## <a id=\"usage\"></a>Usage\nAs mentioned above, in the early releases of this application the interaction with the secret wallet is limited to the command line interface. A typical user would add secrets, retrieve secrets and look at a list of secrets stored in the remote wallet. \n\nLet's consider a realistic example: the energy provider *Smart Energy Ltd* provides both gas and electricity to our customer. It provides a single access through their web portal, to manage both the gas and electricity accounts. It requires a normal access with a login and password, and gives some customer's support through a telephone hot-line. In summary:\n\n| Field | Value |\n| ---- | ---- |\n| user id | joe@email.com |\n| password | xy67Gh!8 |\n| gas account | G15003798 |\n| electricity account | E15003799 |\n| hotline | 0800 123456 |\n\nFundamentally, one login and password to store and some extra information. We could to use *energy* as the domain name  and *smart energy* as the access name.\n\nWe start by inserting the user id and password:\n    \n    secret_wallet set -d energy -a 'smart energy' -u 'joe@email.com' -p 'xy67Gh!8'\n    \nNotice that we have wrapped some of the fields in single quotes. This to ensure that the shell interpreter (bash in my case) does not misinterpret some special characters in the password field or the space in the access field.\n\nA memorable password is first asked and then verified, and the data is entered in the wallet. We can check that the secret is there by typing:\n\n    secret_wallet list\n    \nWe then add the extra information, bit by bit. In fact an update of the secret is performed instead of a new insertion, whenever the same domain and access values are used:\n\n    secret_wallet set -d energy -a 'smart energy' -ik 'gas account' -iv G15003798\n    secret_wallet set -d energy -a 'smart energy' -ik 'electricity account' -iv E15003799\n    secret_wallet set -d energy -a 'smart energy' -ik 'hotline' -iv '0800 123456'\n    \nAll done! We can now look at the full secret stored:\n\n    secret_wallet get -d energy -a 'smart energy'\n    \nreturning:\n\n    **********************************************************\n    Secret id:\n    domain              : energy\n    access              : smart energy\n    \n    Secret credentials:\n    login               : joe@email.com\n    password            : xy67Gh!8\n    \n    Secret extra info:\n    electricity account : E15003799\n    gas account         : G15003798\n    hotline             : 0800 123456\n    \n    Last updated        : 2020-02-03T08:27:03.601671\n    **********************************************************\n\nIt is important to verify the integrity of the secret with the *get* command straight after insertion. This is to guarantee that all the secret data was stored with the same password. If any data had a different password when stored, the retrieval would produce an **InvalidToken** error.\n\nIf this happens, we should delete the record and start again. To delete the record simply use the *delete* command:\n\n    secret_wallet delete -d energy -a 'smart energy'\n    \nAt this stage it is interesting to compare with what stored remotely. After logging in with the AWS Management Console, and selecting the DynamoDB service, all items in the target table should appear encrypted.\n\n## <a id=\"session\"></a>The secret-wallet session\nWhen many secrets  need to be inserted sequentially, it is very tiring to type the memorable password twice for each insertion with the *set* command. For this reason two background processes are started when the first password is entered. \n\nThe first process keeps the memorable password alive for a short period of time, so that reiterated insertions or retrievals within this period don't require the re-insertion of the same password. The default **timeout** is of 60 seconds but can be customized manually as described in the [next section](#customization). After the timeout period lapses, this process is kept alive but the password is forgotten until the next password request.\n\nThe second process has a **lifetime** of 10 minutes, which is also manually customizable with a different value. This process' task is to kill the first process when the lifetime has expired. At the end, both processes are terminated, only to be restarted at the next password request.\n\n\n## <a id=\"customization\"></a>Customization of parameters\nThe application's custom parameters, like the device key, the aws profile name and the table name, are serialized in the json file located with path *home/.secretwallet/secretwallet.json*, where *home* is the path to the home directory.\nMost of these parameters are set only once when configuring the system for [the first time](#configuration).\nHowever this file can also be used to store custom parameters that modify the behavior of the application. In particular the timeout and the lifetime of the [session for the memorable password](#session) can be changed and persisted in this file. This can be done using the **conf** command with the option *-to* (timeout) and *-lf* (lifetime) as below:\n\n        secret_wallet conf -to 30 -lf 120\n\nwhere the values are in seconds, *i.e.* timeout of 30 seconds and a lifetime of 2 minutes.\n     \n## <a id=\"reconfiguration\"></a>Reconfiguration\nThe reconfiguration process allows the re-encryption of all existing secrets when the device password or the memorable password are changed. In this scenario all secrets need to be retrieved, decrypted and re-encrypted with the new key(s). This can be done with the **reconf** command, with optional parameters set to *-d* for a change of device password, and to *-m* for a change of memorable password.\n\nWhen this action is performed, a backup copy of the table containing the secrets is stored on the cloud. This can be used to restore the state of the table later on, if a roll-back is required.\n \n## <a id=\"work\"></a>Work in progress\nComing soon, in the next releases, there will be some feature improvements and fixes, like:\n\n*   adding new commands to the command line interface, like query capabilities,\n*   adding batch processing of secrets' insertion\n*   required bug fixes.\n\nOn a longer time scale:\n*   Adding a graphical user interface\n\n## <a id=\"help\"></a>Help needed\nThis simple application has the potential of becoming a useful productivity tool, and will require lot's of work for new features and better user interaction. \nHelp is needed and welcome. Please visit the the [github page](https://github.com/codimoc/secret-wallet) and raise new issues, or contact the author via email from the email address you will find in the secret-wallet page on [pypi](https://pypi.org/).    \n\n## <a id=\"faq\"></a>FAQ\nA *frequently asked questions* will be maintained [here](https://github.com/codimoc/secret-wallet/wiki/FAQ).", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/codimoc/secret-wallet", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "secret-wallet-codimoc", "package_url": "https://pypi.org/project/secret-wallet-codimoc/", "platform": "", "project_url": "https://pypi.org/project/secret-wallet-codimoc/", "project_urls": {"Homepage": "https://github.com/codimoc/secret-wallet"}, "release_url": "https://pypi.org/project/secret-wallet-codimoc/0.2.1/", "requires_dist": null, "requires_python": ">=3.6", "summary": "A cloud-based wallet for personal secrets", "version": "0.2.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h2>Introduction</h2>\n<p>Like many wallet applications, this Python-based utility addresses the requirement of having a single point of access for the large amount\nof sensitive information that our social-media presence requires.</p>\n<p>If simple and memorable passwords are bad, recycling the same password over and over is evil: with one access compromised, all our secrets and sensitive information are potentially exposed.</p>\n<p>Producing and remembering a different complex password for each remote account is hard, and it can quickly become unmanageable when passwords need changing frequently.</p>\n<p>To store these secrets on paper is not very smart either: a notebook can be safely tucked away in a locked drawer,\nbut it is not very helpful when trying to remember the login credentials of a personal banking site or a private health insurance, while on holiday abroad.</p>\n<p>And if the secret wallet travels with us, it is constantly at risk of being compromised or lost. And with it, all the secrets it contains.</p>\n<p>Keeping these secrets on an electronic wallet instead, on a PC, a tablet or a phone, is as safe as the device where these secrets are stored on.\nData can be encrypted on a hard drive, but the disk can fail, the phone can be stolen, the tablet forgotten on a plane.</p>\n<h2>Index</h2>\n<ul>\n<li><a href=\"#motivations\" rel=\"nofollow\">motivations</a></li>\n<li><a href=\"#description\" rel=\"nofollow\">description</a></li>\n<li><a href=\"#concepts\" rel=\"nofollow\">concepts</a></li>\n<li><a href=\"#requirements\" rel=\"nofollow\">requirements</a></li>\n<li><a href=\"#installation\" rel=\"nofollow\">installation</a></li>\n<li><a href=\"#configuration\" rel=\"nofollow\">first time configuration</a></li>\n<li><a href=\"#passwords\" rel=\"nofollow\">password strength</a></li>\n<li><a href=\"#syntax\" rel=\"nofollow\">syntax</a></li>\n<li><a href=\"#usage\" rel=\"nofollow\">usage</a></li>\n<li><a href=\"#session\" rel=\"nofollow\">the secret wallet session</a></li>\n<li><a href=\"#customization\" rel=\"nofollow\">customization of parameters</a></li>\n<li><a href=\"#reconfiguration\" rel=\"nofollow\">reconfiguration</a></li>\n<li><a href=\"#work\" rel=\"nofollow\">work in progress</a></li>\n<li><a href=\"#help\" rel=\"nofollow\">help needed</a></li>\n<li><a href=\"#faq\" rel=\"nofollow\">FAQ</a></li>\n<li><a href=\"Release+Notes\" rel=\"nofollow\">Release Notes</a></li>\n</ul>\n<h2><a id=\"motivations\"></a>Motivations</h2>\n<p>Fundamentally there are two conflicting requirements to keep in mind: ease of access for the data-owner and protection from unwanted access.</p>\n<p>Let's consider these in detail:</p>\n<ul>\n<li><strong>accessibility</strong>:\n<ul>\n<li>The data should be available remotely, from any location.</li>\n<li>There should be a single copy of the stored data.</li>\n<li>The data should be accessible from different devices, of different type.</li>\n<li>Data retrieval should be <em>user-friendly</em> and fast.</li>\n<li>Data retrieved should be in a format that can be easily cut &amp; pasted into a login form from the same device.</li>\n</ul>\n</li>\n<li><strong>security</strong>:\n<ul>\n<li>Sensitive data, stored remotely on a server or on the cloud, should be encrypted.</li>\n<li>There should be no risk of <em>man in the middle</em>, <em>i.e.</em> data should be transmitted in encrypted format.</li>\n<li>Data access should be protected by different and independent security tokens.</li>\n<li>Encryption should happen locally, on trusted devices. Trusted devices can be configured\nby using the same hash-key for encryption (the salt). The generation of this hash-key should be password protected.</li>\n<li>The memorable password used as the encryption key should be remembered by the owner and not stored.</li>\n<li>The password for configuring the trusted device should be different from the memorable password used\nto encrypt the data.</li>\n<li>There should be a third layer of protection on the remote store.</li>\n</ul>\n</li>\n</ul>\n<h2><a id=\"description\"></a> The secret wallet, by codimoc, and security considerations</h2>\n<p>This Python-based application strives to fulfil these requirements and motivations by:</p>\n<ul>\n<li>Using the AWS DynamoDB as the remote store, and relying on the security layer of the Amazon cloud as the third layer of protection.</li>\n<li>using the <strong>cryptography</strong> package for local encryption (on device).</li>\n<li>using the AWS <strong>boto3</strong> package to interact with the remote store.</li>\n<li>securing both devices and secrets with independent and strong passwords (<strong>password_strength</strong> package): these are the first two layers of protection.</li>\n<li>providing console-based interaction with the secret wallet (for the time being)</li>\n</ul>\n<p>Securing the allowed devices with a configuration password provides safety against misuses of the store, once the memorable password is\ncompromised by accident. For example, if the memorable password is confided to others or guessed, only pre-configured devices can access\nthe secrets.</p>\n<p>On the other hand, if a device is lost or stolen, the memorable password is still required to access the secrets. The AWS security layer does not help in this case,\nwith the AWS secure credentials helpfully located on the compromised device's file system.</p>\n<h2><a id=\"concepts\"></a>Concepts</h2>\n<p>The basic unit of information stored on the remote DB is a <strong>secret</strong>.\nEach secret is identified by a pair of two keys, the domain key and the access key:</p>\n<ul>\n<li><strong>domain</strong>: it is the principal context of that secret, <em>e.g</em> the name of a service provider for which some access credentials are needed.</li>\n<li><strong>access</strong>: it is a sub-context of the <em>domain</em>; for example if the main domain is a utility provider providing both a gas and electricity accounts, we might have two secrets with the same domain but different accesses. This separation of domain and access facilitates queries to the DB, since we might want to know all the accesses for a given domain, or all the available domains in the wallet.</li>\n</ul>\n<p>Each secret contains three nullable items of data:</p>\n<ul>\n<li>\n<p><strong>uid</strong>: the user id, or the login credential for that secret. This is stored as an encrypted value,</p>\n</li>\n<li>\n<p><strong>pwd</strong>: the password required to login in the account with the given user id, for example the user id and password for an online shopping account.\nThis password-data is also stored encrypted at the source (from the local client),</p>\n</li>\n<li>\n<p><strong>info</strong>: a map of extra information regarding this secret. This meta-data is open-ended, in the sense that anything can go into this dictionary, and it is stored as a json dictionary, with keys not encrypted and values encrypted. For example, if the secret refers to a shopping account, the map could be as follows:</p>\n<p>{'telephone' : 1234,\n'delivery-agent' : 'Fast delivery Limited'}</p>\n</li>\n</ul>\n<h2><a id=\"requirements\"></a>Dependencies and requirements</h2>\n<p>The <strong>secret wallet</strong> uses the AWS cloud to store the secret information; in particular it relies on the <em>no-SQL</em> service, known as AWS <em>DynamoDB</em>. This is a database with tables that can be defined by the declaration of one or two primary keys. The remaining part of the schema can change and grow based on the data inserted, depending on the format of the records we want to store. The advantage of this storage solution are:</p>\n<ul>\n<li>It is a remote storage widely available on the Amazon cloud.</li>\n<li>It is easy to use and create new tables,</li>\n<li>It is available in the <a href=\"https://aws.amazon.com/free/?all-free-tier.sort-by=item.additionalFields.SortRank&amp;all-free-tier.sort-order=asc\" rel=\"nofollow\">AWS Free Tier</a> package that Amazon offers as an entry point into their echo-system.</li>\n</ul>\n<p>In order to use the <strong>secret wallet</strong> it is necessary to use an Amazon AWS account,  or create a new one. This can be done quickly and easily from the <a href=\"https://aws.amazon.com/free/?all-free-tier.sort-by=item.additionalFields.SortRank&amp;all-free-tier.sort-order=asc\" rel=\"nofollow\">AWS Free Tier</a> page. Once the account has been created, three pieces of information are required for the <strong>secret wallet</strong>:</p>\n<ul>\n<li>the <strong>aws_access_key_id</strong>: to identify the account</li>\n<li>the <strong>aws_secret_access_key</strong>: which can be created after logging into the account; this key can be regenerated several times.</li>\n<li>the <strong>region</strong>: the physical location of the server, possibly close to the location of usage.</li>\n</ul>\n<p>These three records should be noted down when creating the account or copied onto the clipboard or on a file. They will be needed later, when <a href=\"#configuration\" rel=\"nofollow\">configuring</a> the <strong>secret wallet</strong>.</p>\n<p>It should be noted that the initial AWS keys, produced on creation of the new account, are root credentials for that account. It is safer, once logged into this new AWS account, to generate a different IAM role with limited access, for example a programmatic user, and to use the relative credentials instead. Instruction on how to do this can be found <a href=\"https://aws.amazon.com/iam/\" rel=\"nofollow\">here</a>.</p>\n<h2><a id=\"installation\"></a>Installation</h2>\n<p>The <strong>secret wallet</strong> is installed in the usual manner, as any other python packages, and requires a minimum Python version of 3.6.\nThe installation is done with:</p>\n<pre><code>pip install secret-wallet-codimoc \n</code></pre>\n<p>After installing all the dependencies from other python packages,  it produce two new executable scripts:</p>\n<ul>\n<li><strong>secret_wallet</strong> for the command line management of the secret wallet and</li>\n<li><strong>secret_wallet_conf</strong> for the first time configuration as described below</li>\n</ul>\n<h2><a id=\"configuration\"></a>First time configuration</h2>\n<p>Configuring the <strong>secret wallet</strong> is required in order to save both the AWS credentials for the Amazon cloud and the device's configuration key, which is the first layer of security to protect your secrets. This configuration also creates the DynamoDB table used to store the secrets.</p>\n<p>This <em>first time configuration</em> is performed by running the <strong>secret_wallet_conf</strong> script from the command line. This script is interactive, in the old way of <em>questions and answers</em>, and provides some default values when possible.\nIt is divided into two separate steps, each of which can be skipped. Skipping a step allows to avoid overwriting credentials, if the system was partially configured, and a partial change of configuration is desired.</p>\n<p>These steps are:</p>\n<ul>\n<li>Storing the <strong>AWS credentials</strong>: this results in creating or modifying the <em>credentials</em> file in the <em>.aws</em>  directory, located in the user home directory. This file is typically divided into separate sections. This allows to persist  different connections to different services on the Amazon cloud. The section relevant to the <strong>secret-wallet</strong> is market with the heading [secret-wallet].</li>\n<li>Storing the <strong>secret wallet configuration</strong>: this step persists the information in the <em>secretwallet.json</em> file in the <em>.secretwallet</em> directory, located in the user home directory. This configuration file is used to store the device encryption key, the name of the AWS connection profile and the table name where the secrets are stored. This file is also used to store customization parameters as described in <a href=\"#customization\" rel=\"nofollow\">this section</a>.</li>\n</ul>\n<p>When questions are asked during the configuration, please type the first letter of the answer (e.g. <em>s</em> for <em>skip</em>) to select that choice. Whenever a default value is suggested, simply hit the <em>Return</em> button to confirm that choice.</p>\n<h2><a id=\"passwords\"></a>Password strength</h2>\n<p>Strong passwords are required by this application.\nWhenever a new password is needed, two verification steps are performed:</p>\n<ul>\n<li>verify that the password is strong</li>\n<li>verify that the password is correctly typed, by re-entering it a second time.</li>\n</ul>\n<p>A chosen password is considered to be strong under the following requirements:</p>\n<ul>\n<li>At least eight characters long</li>\n<li>Should contain  at least one upper-case character</li>\n<li>Should contain  at least one number</li>\n<li>Should contain  at least one special character (!,~,^,@...)</li>\n</ul>\n<p>Only two different passwords are ever required: the configuration password to produce the device's encrypted key and the memorable password.</p>\n<p>The first password for the <strong>device encryption key</strong> will be used only when configuring the device, but must be remembered when configuring additional devices. Different configuration keys will result in an <strong>InvalidToken</strong> error when retrieving secrets saved by a different device.</p>\n<p>The <strong>memorable password</strong> is used whenever saving or retrieving secrets. This password should always be the same, and can only be changed by performing a full <a href=\"reconfiguration\" rel=\"nofollow\">reconfiguration process</a>. To prevent retyping this password many times over, a session is opened and it runs in the background keeping track of the password for a short period of time. This will be discussed in <a href=\"#session\" rel=\"nofollow\">this section</a>.</p>\n<h2><a id=\"syntax\"></a>Syntax</h2>\n<p>The syntax of the <strong>secret_wallet</strong> script is:</p>\n<pre><code>secret_wallet &lt;command&gt; [options]\n</code></pre>\n<p>where the options are different for different commands. To get a list of available commands simply type:</p>\n<pre><code>secret_wallet help\n</code></pre>\n<p>Please be aware that not all commands are be available in the first releases of this application.</p>\n<p>To find about the available options for a given command, just type:</p>\n<pre><code>secret_wallet &lt;command&gt; -h \n</code></pre>\n<p>For example, the options for the <em>set</em> command can be displayed by:</p>\n<pre><code>secret_wallet set -h\n</code></pre>\n<p>To avoid possible errors, please remember to enclose the textual arguments within single or double quotes, when these arguments contain spaces or special characters.</p>\n<h2><a id=\"usage\"></a>Usage</h2>\n<p>As mentioned above, in the early releases of this application the interaction with the secret wallet is limited to the command line interface. A typical user would add secrets, retrieve secrets and look at a list of secrets stored in the remote wallet.</p>\n<p>Let's consider a realistic example: the energy provider <em>Smart Energy Ltd</em> provides both gas and electricity to our customer. It provides a single access through their web portal, to manage both the gas and electricity accounts. It requires a normal access with a login and password, and gives some customer's support through a telephone hot-line. In summary:</p>\n<table>\n<thead>\n<tr>\n<th>Field</th>\n<th>Value</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>user id</td>\n<td><a href=\"mailto:joe@email.com\">joe@email.com</a></td>\n</tr>\n<tr>\n<td>password</td>\n<td>xy67Gh!8</td>\n</tr>\n<tr>\n<td>gas account</td>\n<td>G15003798</td>\n</tr>\n<tr>\n<td>electricity account</td>\n<td>E15003799</td>\n</tr>\n<tr>\n<td>hotline</td>\n<td>0800 123456</td>\n</tr></tbody></table>\n<p>Fundamentally, one login and password to store and some extra information. We could to use <em>energy</em> as the domain name  and <em>smart energy</em> as the access name.</p>\n<p>We start by inserting the user id and password:</p>\n<pre><code>secret_wallet set -d energy -a 'smart energy' -u 'joe@email.com' -p 'xy67Gh!8'\n</code></pre>\n<p>Notice that we have wrapped some of the fields in single quotes. This to ensure that the shell interpreter (bash in my case) does not misinterpret some special characters in the password field or the space in the access field.</p>\n<p>A memorable password is first asked and then verified, and the data is entered in the wallet. We can check that the secret is there by typing:</p>\n<pre><code>secret_wallet list\n</code></pre>\n<p>We then add the extra information, bit by bit. In fact an update of the secret is performed instead of a new insertion, whenever the same domain and access values are used:</p>\n<pre><code>secret_wallet set -d energy -a 'smart energy' -ik 'gas account' -iv G15003798\nsecret_wallet set -d energy -a 'smart energy' -ik 'electricity account' -iv E15003799\nsecret_wallet set -d energy -a 'smart energy' -ik 'hotline' -iv '0800 123456'\n</code></pre>\n<p>All done! We can now look at the full secret stored:</p>\n<pre><code>secret_wallet get -d energy -a 'smart energy'\n</code></pre>\n<p>returning:</p>\n<pre><code>**********************************************************\nSecret id:\ndomain              : energy\naccess              : smart energy\n\nSecret credentials:\nlogin               : joe@email.com\npassword            : xy67Gh!8\n\nSecret extra info:\nelectricity account : E15003799\ngas account         : G15003798\nhotline             : 0800 123456\n\nLast updated        : 2020-02-03T08:27:03.601671\n**********************************************************\n</code></pre>\n<p>It is important to verify the integrity of the secret with the <em>get</em> command straight after insertion. This is to guarantee that all the secret data was stored with the same password. If any data had a different password when stored, the retrieval would produce an <strong>InvalidToken</strong> error.</p>\n<p>If this happens, we should delete the record and start again. To delete the record simply use the <em>delete</em> command:</p>\n<pre><code>secret_wallet delete -d energy -a 'smart energy'\n</code></pre>\n<p>At this stage it is interesting to compare with what stored remotely. After logging in with the AWS Management Console, and selecting the DynamoDB service, all items in the target table should appear encrypted.</p>\n<h2><a id=\"session\"></a>The secret-wallet session</h2>\n<p>When many secrets  need to be inserted sequentially, it is very tiring to type the memorable password twice for each insertion with the <em>set</em> command. For this reason two background processes are started when the first password is entered.</p>\n<p>The first process keeps the memorable password alive for a short period of time, so that reiterated insertions or retrievals within this period don't require the re-insertion of the same password. The default <strong>timeout</strong> is of 60 seconds but can be customized manually as described in the <a href=\"#customization\" rel=\"nofollow\">next section</a>. After the timeout period lapses, this process is kept alive but the password is forgotten until the next password request.</p>\n<p>The second process has a <strong>lifetime</strong> of 10 minutes, which is also manually customizable with a different value. This process' task is to kill the first process when the lifetime has expired. At the end, both processes are terminated, only to be restarted at the next password request.</p>\n<h2><a id=\"customization\"></a>Customization of parameters</h2>\n<p>The application's custom parameters, like the device key, the aws profile name and the table name, are serialized in the json file located with path <em>home/.secretwallet/secretwallet.json</em>, where <em>home</em> is the path to the home directory.\nMost of these parameters are set only once when configuring the system for <a href=\"#configuration\" rel=\"nofollow\">the first time</a>.\nHowever this file can also be used to store custom parameters that modify the behavior of the application. In particular the timeout and the lifetime of the <a href=\"#session\" rel=\"nofollow\">session for the memorable password</a> can be changed and persisted in this file. This can be done using the <strong>conf</strong> command with the option <em>-to</em> (timeout) and <em>-lf</em> (lifetime) as below:</p>\n<pre><code>    secret_wallet conf -to 30 -lf 120\n</code></pre>\n<p>where the values are in seconds, <em>i.e.</em> timeout of 30 seconds and a lifetime of 2 minutes.</p>\n<h2><a id=\"reconfiguration\"></a>Reconfiguration</h2>\n<p>The reconfiguration process allows the re-encryption of all existing secrets when the device password or the memorable password are changed. In this scenario all secrets need to be retrieved, decrypted and re-encrypted with the new key(s). This can be done with the <strong>reconf</strong> command, with optional parameters set to <em>-d</em> for a change of device password, and to <em>-m</em> for a change of memorable password.</p>\n<p>When this action is performed, a backup copy of the table containing the secrets is stored on the cloud. This can be used to restore the state of the table later on, if a roll-back is required.</p>\n<h2><a id=\"work\"></a>Work in progress</h2>\n<p>Coming soon, in the next releases, there will be some feature improvements and fixes, like:</p>\n<ul>\n<li>adding new commands to the command line interface, like query capabilities,</li>\n<li>adding batch processing of secrets' insertion</li>\n<li>required bug fixes.</li>\n</ul>\n<p>On a longer time scale:</p>\n<ul>\n<li>Adding a graphical user interface</li>\n</ul>\n<h2><a id=\"help\"></a>Help needed</h2>\n<p>This simple application has the potential of becoming a useful productivity tool, and will require lot's of work for new features and better user interaction.\nHelp is needed and welcome. Please visit the the <a href=\"https://github.com/codimoc/secret-wallet\" rel=\"nofollow\">github page</a> and raise new issues, or contact the author via email from the email address you will find in the secret-wallet page on <a href=\"https://pypi.org/\" rel=\"nofollow\">pypi</a>.</p>\n<h2><a id=\"faq\"></a>FAQ</h2>\n<p>A <em>frequently asked questions</em> will be maintained <a href=\"https://github.com/codimoc/secret-wallet/wiki/FAQ\" rel=\"nofollow\">here</a>.</p>\n\n          </div>"}, "last_serial": 6815956, "releases": {"0.2.0": [{"comment_text": "", "digests": {"md5": "2763d80086b24a29ee717b6d833fd831", "sha256": "061308651df704509bb48eb8533b0f4cd7acfadcf690c1a9f9ac6258490fbff6"}, "downloads": -1, "filename": "secret_wallet_codimoc-0.2.0-py3-none-any.whl", "has_sig": false, "md5_digest": "2763d80086b24a29ee717b6d833fd831", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 32584, "upload_time": "2020-03-01T18:43:19", "upload_time_iso_8601": "2020-03-01T18:43:19.708737Z", "url": "https://files.pythonhosted.org/packages/a5/44/0dd76dd3f2215c2a23b452e25d0cec3f79a6f534ebad5d8331cc38b31532/secret_wallet_codimoc-0.2.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1d1e3b3dc52a5a620c67eba09580adb5", "sha256": "a4ac5daa02c0e8f33a5b9079f08887d914420e64a300093f6b6cc7d7bd7055ca"}, "downloads": -1, "filename": "secret-wallet-codimoc-0.2.0.tar.gz", "has_sig": false, "md5_digest": "1d1e3b3dc52a5a620c67eba09580adb5", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 28560, "upload_time": "2020-03-01T18:42:54", "upload_time_iso_8601": "2020-03-01T18:42:54.256761Z", "url": "https://files.pythonhosted.org/packages/65/a7/385adabecaf7a1234b43a8ecd9e2e8e4d950b84275655e44204e6d248810/secret-wallet-codimoc-0.2.0.tar.gz", "yanked": false}], "0.2.1": [{"comment_text": "", "digests": {"md5": "2dd4d9472bce16b867ed2d2422f7daf9", "sha256": "b299ca723502b0881d8b621062bf498ba266ff85eaa2918e78273255026dc47f"}, "downloads": -1, "filename": "secret_wallet_codimoc-0.2.1-py3-none-any.whl", "has_sig": false, "md5_digest": "2dd4d9472bce16b867ed2d2422f7daf9", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 33009, "upload_time": "2020-03-15T15:32:34", "upload_time_iso_8601": "2020-03-15T15:32:34.223306Z", "url": "https://files.pythonhosted.org/packages/2d/a5/8b70b72408fea2c4c4f43211009741da1c74513fd714520ef7dc04319239/secret_wallet_codimoc-0.2.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7bfebee579ae318109518957b5ac4d96", "sha256": "39abdd7af83afc5b650944af54495e89f7c123cfc61be2c5fa1c4d16b79bb69b"}, "downloads": -1, "filename": "secret-wallet-codimoc-0.2.1.tar.gz", "has_sig": false, "md5_digest": "7bfebee579ae318109518957b5ac4d96", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 29016, "upload_time": "2020-03-15T15:32:09", "upload_time_iso_8601": "2020-03-15T15:32:09.596507Z", "url": "https://files.pythonhosted.org/packages/72/d4/a4f9369071a09de7d064c51e91996984a8964b4e8882efc16e224e8e6015/secret-wallet-codimoc-0.2.1.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "2dd4d9472bce16b867ed2d2422f7daf9", "sha256": "b299ca723502b0881d8b621062bf498ba266ff85eaa2918e78273255026dc47f"}, "downloads": -1, "filename": "secret_wallet_codimoc-0.2.1-py3-none-any.whl", "has_sig": false, "md5_digest": "2dd4d9472bce16b867ed2d2422f7daf9", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.6", "size": 33009, "upload_time": "2020-03-15T15:32:34", "upload_time_iso_8601": "2020-03-15T15:32:34.223306Z", "url": "https://files.pythonhosted.org/packages/2d/a5/8b70b72408fea2c4c4f43211009741da1c74513fd714520ef7dc04319239/secret_wallet_codimoc-0.2.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7bfebee579ae318109518957b5ac4d96", "sha256": "39abdd7af83afc5b650944af54495e89f7c123cfc61be2c5fa1c4d16b79bb69b"}, "downloads": -1, "filename": "secret-wallet-codimoc-0.2.1.tar.gz", "has_sig": false, "md5_digest": "7bfebee579ae318109518957b5ac4d96", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.6", "size": 29016, "upload_time": "2020-03-15T15:32:09", "upload_time_iso_8601": "2020-03-15T15:32:09.596507Z", "url": "https://files.pythonhosted.org/packages/72/d4/a4f9369071a09de7d064c51e91996984a8964b4e8882efc16e224e8e6015/secret-wallet-codimoc-0.2.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:55:57 2020"}