{"info": {"author": "Carlos Valcarcel", "author_email": "carlos.d.valcarcel.w@gmail.com", "bugtrack_url": null, "classifiers": [], "description": "# Spot Connect\n\n__Note to reader__: This module requires you to setup an AWS account as well as the proper permissions within that account. This README is still in progress and does not include full walkthrough despite the module being operational.  \n\n`pip install spot-connect`\n\n## Dependencies \n\nThe only dependency that MUST be installed by the user is the `awscli`: \n\n`pip install awscli` \n\nOnce the awscli (AWS command line interface) has been installed you must configure it by typing: \n\n`aws configure` \n\nand then entering your credentials and default region. This will make sure that any connection requests you make to AWS are automatically directed to your account without needing to enter any sort of login credentials. \n\nGo to [this link](https://docs.aws.amazon.com/cli/latest/userguide/cli-chap-configure.html) for a more detailed explanation of `aws configure`. \n\nThe rest of the package dependencies are installed automatically: \n\n- `boto3` \n\n- `netaddr` \n\n- `paramiko`\n\n- `path` \n\n## Spot Instances:\n\nSpot instances are excess capacity that AWS rents out at a discount through a bidding mechanism. Users can set a maximum price to bid on any excess capacity of any type of hardware loaded with any type of os image. \n\nUsing this module users may: \n\n**1)** launch a spot instance with any capacity and image they like from a command prompt, script or notebook.\n\n**2)** create elastic file systems (EFS) to that can be mounted on any number of instances for immediate data access. \n\n**3)** using a command prompt, open a prompt that is directly linked to any running instance \n\n**4)** perform a number of other essential tasks such as executing scripts and commands, uploading data directly to an instance, transfer data from S3 to EFS and back, and more. \n\n**Warning**:\n\nBecause spot instances rely on excess capacity they can be requisitioned by Amazon when demand increases, this gives users a 2 minute window to close their session and abandon the spot instance, forcing any unfinished work to resume on another spot instance should that be the user's choice. Read more about this in the **Suggested Project Guidelines** section below. \n\n## Command Line Argument\n\n`spot_connect -n <name> -p <profile> -s <scripts to run> -f <filesystem> -u <files or dir to upload> -r <path on instance to upload to> -a <active shell> -t <terminate instance> -m <enable cloud monitoring for the instance> -em <connect to or create a filesystem> -nm <create a new mount for the EFS> -ip <instance profile access>`\n\nThe `connect.py` script can be executed from the command line to launch or reconnect to an instance, mount an elastic files system, upload files, execute scripts and leave an active shell connected to the instance open in your command line. \n\nLaunching an instance is as easy as:  \n\n`spot_connect -n instance_1 -p default -a True` \n\nThis will create an instance that will appear with the name \"instance_1\" in you EC2 concole, it will launch it with the default profile and instance type and leave an open prompt that is connected to the instance on your command prompt. \n\n**Options**\n\n`-n` <br>\n*Name* for the spot instance, a key and security group will be created for the instance with this name. The private key will be saved to the directory in a .pem file. \n\n`-p` <br>\n*Profile* dictionary of parameters that describe the instance to be launched, the list of predefined profiles can be viewed using `spot_connect.sutils.load_profiles()`. \n\n`-s` <br>\n*Script* path or list of paths to scripts to be executed. If you're running linux os on your instance these should be bash scripts. \n\n`-f` <br>\n*Filesystem* creation token name. The `--efsmount` option must be set to True for this to have an effect. The name of the filesystem you want to connect to, if it does not exist one will be created and connected to. \n\n`-u` <br>\n*Upload* is the file path or directory that will be uploaded via paramiko ssh transfer. Upload speed depends only on internet speed and not instance type. **\n\n__Example for upload files__:\n\n\t-u C:\\Data\\file.txt  # uploading one file \n\t-u C:\\Data\\file_1.txt,C:\\MapData\\file_2.zip  #uploading a list of files \n\n`-r` <br>\n*Remotepath* is the directory on the EC2 instance to upload the files in the `-u` (upload) option to. \n\n **Syntax for remotepath:**\n\n\t-r /home/ec2-user/efs/data  \n\n`-a` <br>\n*Activeprompt* is a boolean (`True` or `False`) for whether to leave an active shell connected to the instance after the scripts have finished running (if your instance has a linux ami, for example, this will be a linux shell).\n\n`-t`<br>\n*Terminate* is a boolean. If \"True\" the instance specified in the `-n` (name) argument will be terminated and nothing else will be done (*Terminate* overrides all other arguments). \n\n`-m`<br>\n*Monitoring* if set to True will activate cloudwatch monitoring for the instance. \n\n`-em`<br>\n*EFSMount* if set to True will connect to the EFS specified in the `-f` arg or create an EFS with that name if none exists. \n\n`-nm`<br> \n*Newmount* if set to True will create a new mount to an EFS for this instance. This is rarely necessary. \n\n`-ip`<br> \n*Instanceprofile* attaches a given instance profile to your instance to grant it access to other **AWS** services. \n\n**Launching vs. reconnecting to an instance**\n\nThe settings you may define only when launching an instance are: \n- profile\n- monitoring \n- instance_profile \n\n__example__: \n\n`spot_connect -n VM1 -p t3.small -m True -ip role1`  \n\nOnce an instance is launched with these settings they are fixed and do not need to be defined again when connecting, such that I could open a prompt onto the instance using:\n\n`spot_connect -n VM1 -a True`\n\nand the instance would already be on a t3 processor with monitoring enabled and the instance_profile \"role1\" \n\n__Changing these specific settings after an instance has been created can be done but has not been incorporated into this module because, given the temporary nature of spot instances, relaunching the instance is an easier alternative.__ \n\n## SpotInstance Class\n\n`from spot_connect.spotted import SpotInstance`\n\nThe `SpotInstance` class in the `spotted` module can be imported and run from scripts and notebooks and has all the same functionality of the command line tool. \n\n`my_instance = SpotInstance('VM1', profile=\"t3.small\", monitoring=True, instance_profile=\"role1\")`\n\nThe `my_instance` variable instantiated above would connect to or create an instance called \"VM1\" with profile \"t3.small,\" cloudwatch monitoring enables and instance profile \"role1.\"\n\nThe `SpotInstance` class even lets you define some of the profile settings directly such as,*image_id*, *instance_type*, *price*, *region*, and *firewall* (firewall settings). It even lets you specify some more detailed options such as the *key_pair*, *kp_dir* (key-pair directory), and *sec_group* (security group). In fact, the only option that is available in the command line and NOT available through the `spotted` module is `activeprompt`. \n\nHowever, the `SpotInstance` class does provide other functionality that makes it easier to handle and just as useful as the command line tool: \n\n- **`upload`**: upload files from a local directory directly to the instance. \n\n`my_instance.upload(files, remotepath)`\n\n- **`download`**: download files from the instance to a local directory \n\n`my_instance.download(files, localpath)`\n\n- **`run`**: run scripts or commands on the instance. \n\n`my_instance.run('my_script.sh')` # Runs a script called my_script.sh\n\n`my_instance.run('ls', cmd=True)` # Runs the \"ls\" command on the instance and prints out the directory of the home folder. \n\nScripts can be converted into strings where each command is separated by a \"\\n\" character to avoid creating files. For example: \n\n\tmy_instance.upload('C://list_efs_files.py', '/home/ec2-user/efs/')\n\tresults = my_instance.run('cd efs\\n python list_efs_files.py', cmd=True, return_output=True) \n\nThe first line uploads a python script to the \"efs\" directory where my elastic file system is mounted.\nThe second line changes the working direcotry to the \"efs\" direcotry and then runs the python file I just uploaded. The `cmd` option tells the `run` method that I've submitted a command and not a script, the `return_output` option redirects any printed output to the \"results\" variable. \n\n## LinkAWS Class\n\n`from spot_connect.link import LinkAWS`\n\nThe `LinkAWS` class takes the `spotted` module one step further and provides the functionality for users to handle multiple spot instances and distribute workloads across these. \n\n`my_link = LinkAWS()` \n\nThis provides useful functionality that makes working with the entire `spot_connect` module much easier, for example:\n\n- **`launch_instance`** : Launch a spot instance and store it in the `LinkAWS.instances` dict attribute.\n\n- **`instance_s3_transfer`** : Will launch a new instance to transfer files from an S3 bucket to an instance or vice-versa. An instance profile with S3 access must be defined otherwise an error will be returned. See section on instance profiles below. \n\n- **`clone_repo`**, **`update_repo`** : Clone/update a git repo on the instance. \n\n- **`run_distributed_jobs`** : Distribute scripts and workloads across a given number of instances with a given profile\n\nThe `LinkAWS` class also provides shortcuts for some utility functions such as: \n\n- **`get_instance_home_directory`** : prints the home directory for a given instance so the user can specify instance paths easily. \n\n- **`count_cores`** : prints the number physical and logical cores on a given instance.\n\n- **`list_profiles`** : same as `spot_connect.sutils.load_profiles()`\n\n\n## Suggested Project Guidelines\n\n**Make sure your work can be stopped and resumed programatically**. As mentioned at the outset of this document, some instances may be requisitioned by AWS and force your work to stop. This is more likely if you are working on high capacity instances. Later versions of this module will make it possible for you to anticipate these shut-downs so you can save your work and then launch another instance immediately and resume in the same elastic file system. \n\n*Note: the functionality to detect when an instance is being shut-down is still in development*\n\n<br><br>\n# AWS\n\n## [Elastic File System](https://aws.amazon.com/efs/)\n\nElastic file systems are a type of file storage provided by AWS that expand as more data are added to them. Data can be added to the and EFS directly through an instance or via DataSync which is a separate process offered by AWS. \n\nAny data you add to an EFS will persist such that if you mount an instance, upload data to the EFS folder, terminate the instance, launch a new instance, connect that instance to the same EFS (which you can do easily with the `-f` option) the data you uploaded earlier will automatically be available in the new instance. This makes it easy to resume work and save results quickly. \n\n**Connecting an Instance to an EFS**:\n\nYou can specify the name of *new* EFS you want to create or the *existing* EFS you want to connect to using the `-f` (**filesystem**) option when launching instances from the command line or `spotted` module. \n\nAt least one mount target (a connection point) must be created for an EFS to connect to an instance. This module will automatically create or identify existing mount targets for a given EFS and will connect to it using the first IP address available in the subnet (for a full explanation of Subnets see https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Subnets.html).\n\nTo link an EFS to an instance the **instance** must request to connect to the EFS. When an instance is launched an an EFS is specified the module connects to the instance and runs a script that makes this request. Once an EFS has been mounted onto an instance it does not need to be mounted again, even if you disconnect from that instance. \n\n<br><br>\n## Instance Types & Images \n\nAWS makes different hardware available for instances, you can select the hardware you want for your instance when you select the instance type. For a full list of instance types check [this link](https://aws.amazon.com/ec2/instance-types/).\n\nImages or AMIs are the pre-set configurations available for instances. To my knowledge, every AMI in a given region is available for every instance type available in that region. You can browse through many pre-set AMIs can be browsed in the AWS EC2 launch wizard and then specified in profiles.\n\n## Profiles & Specifying Instance Specs \n\nThe profiles that come with the module can be viewed by using `spot_connect.sutils.load_profiles()`. These are stored in a file called \"profiles.txt\" which is installed along with the module. \n\nThe \"profiles.txt\" file only contains a dictionary with different instance spec configurations that have been created for the user's convenience.\n\n**Users will have to edit \"profiles.txt\" to fit their own aws configurations**:\n\n- **region** : Almost every other setting is dependent on region. You can change all the regions in every profile listed in \"profiles.txt\" using `spot_connect.sutils.change_default_region(<region>)`\n\n- **image_id** : The default AMI is the deep learning image for Linux, this can be changed for every profile listed in \"profiles.txt\" using `spot_connect.sutils.change_default_image(<image id>)`\n\n- **price** : Price is the maximum price you are willing to bid for an instance. For a list of spot-instance prices check [this link](https://aws.amazon.com/ec2/spot/pricing/). Price varies by region so make sure you edit these accordingly in \"profile.txt\" if you change regions. \n\n- **username** : Usually \"ec2-user\" but can depend on the instance AMI. For a list of default usernames see: https://alestic.com/2014/01/ec2-ssh-username/\n\nThere is really no need to change any of the other settings in the any of the profiles listed in \"profiles.txt\"\n\n## Instance Profiles \n\nInstance profiles are rolls that you can create and assign to instances in order to grant them access to other AWS resources such as S3. Read more about what they are and how to use them in [this link](https://docs.aws.amazon.com/codedeploy/latest/userguide/getting-started-create-iam-instance-profile.html). \n\nIf you navigate to the IAM resource in your AWS dashboard you can create access roles specific for EC2 instances to access other resources. Once these roles have been created you can create an instance profile from a shell, script or notebook using the `boto3` module: \n\n```\nimport boto3\n\n# Connect to the IAM client \niam_client = boto3.client('iam')\n\n# Create an instance profile\niam_client.create_instance_profile(\n    InstanceProfileName = 'ec2_and_s3',\n)\n\n# Connect to the resource and the instance profile you've just created \niam_resource = boto3.resource('iam')\ninstance_profile = iam_resource.InstanceProfile('ec2_and_s3')\n\n# Add the desired IAM role, this should have been created earlier in the AWS console\ninstance_profile.add_role(RoleName='full_s3_access')\n```\n\nIn the above block of code we create an instance profile names \"ec2_and_s3\" and assign it the access role \"full_s3_access\" which I created earlier through the dashboard. \n\nYou know an instance has successfully been granted access because if you open a prompt to the instance and type `aws configure` your keys will already be filled. \n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/losDaniel/spot-connect.git", "keywords": "aws ec2 cloud ssh machinelearning virtualmachine", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "spot-connect", "package_url": "https://pypi.org/project/spot-connect/", "platform": "", "project_url": "https://pypi.org/project/spot-connect/", "project_urls": {"Homepage": "https://github.com/losDaniel/spot-connect.git"}, "release_url": "https://pypi.org/project/spot-connect/1.0.2/", "requires_dist": ["boto3", "netaddr", "paramiko", "path"], "requires_python": ">=3.7", "summary": "A package to create and manage AWS resources, centered around EC2 spot-instances", "version": "1.0.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Spot Connect</h1>\n<p><strong>Note to reader</strong>: This module requires you to setup an AWS account as well as the proper permissions within that account. This README is still in progress and does not include full walkthrough despite the module being operational.</p>\n<p><code>pip install spot-connect</code></p>\n<h2>Dependencies</h2>\n<p>The only dependency that MUST be installed by the user is the <code>awscli</code>:</p>\n<p><code>pip install awscli</code></p>\n<p>Once the awscli (AWS command line interface) has been installed you must configure it by typing:</p>\n<p><code>aws configure</code></p>\n<p>and then entering your credentials and default region. This will make sure that any connection requests you make to AWS are automatically directed to your account without needing to enter any sort of login credentials.</p>\n<p>Go to <a href=\"https://docs.aws.amazon.com/cli/latest/userguide/cli-chap-configure.html\" rel=\"nofollow\">this link</a> for a more detailed explanation of <code>aws configure</code>.</p>\n<p>The rest of the package dependencies are installed automatically:</p>\n<ul>\n<li>\n<p><code>boto3</code></p>\n</li>\n<li>\n<p><code>netaddr</code></p>\n</li>\n<li>\n<p><code>paramiko</code></p>\n</li>\n<li>\n<p><code>path</code></p>\n</li>\n</ul>\n<h2>Spot Instances:</h2>\n<p>Spot instances are excess capacity that AWS rents out at a discount through a bidding mechanism. Users can set a maximum price to bid on any excess capacity of any type of hardware loaded with any type of os image.</p>\n<p>Using this module users may:</p>\n<p><strong>1)</strong> launch a spot instance with any capacity and image they like from a command prompt, script or notebook.</p>\n<p><strong>2)</strong> create elastic file systems (EFS) to that can be mounted on any number of instances for immediate data access.</p>\n<p><strong>3)</strong> using a command prompt, open a prompt that is directly linked to any running instance</p>\n<p><strong>4)</strong> perform a number of other essential tasks such as executing scripts and commands, uploading data directly to an instance, transfer data from S3 to EFS and back, and more.</p>\n<p><strong>Warning</strong>:</p>\n<p>Because spot instances rely on excess capacity they can be requisitioned by Amazon when demand increases, this gives users a 2 minute window to close their session and abandon the spot instance, forcing any unfinished work to resume on another spot instance should that be the user's choice. Read more about this in the <strong>Suggested Project Guidelines</strong> section below.</p>\n<h2>Command Line Argument</h2>\n<p><code>spot_connect -n &lt;name&gt; -p &lt;profile&gt; -s &lt;scripts to run&gt; -f &lt;filesystem&gt; -u &lt;files or dir to upload&gt; -r &lt;path on instance to upload to&gt; -a &lt;active shell&gt; -t &lt;terminate instance&gt; -m &lt;enable cloud monitoring for the instance&gt; -em &lt;connect to or create a filesystem&gt; -nm &lt;create a new mount for the EFS&gt; -ip &lt;instance profile access&gt;</code></p>\n<p>The <code>connect.py</code> script can be executed from the command line to launch or reconnect to an instance, mount an elastic files system, upload files, execute scripts and leave an active shell connected to the instance open in your command line.</p>\n<p>Launching an instance is as easy as:</p>\n<p><code>spot_connect -n instance_1 -p default -a True</code></p>\n<p>This will create an instance that will appear with the name \"instance_1\" in you EC2 concole, it will launch it with the default profile and instance type and leave an open prompt that is connected to the instance on your command prompt.</p>\n<p><strong>Options</strong></p>\n<p><code>-n</code> <br>\n<em>Name</em> for the spot instance, a key and security group will be created for the instance with this name. The private key will be saved to the directory in a .pem file.</p>\n<p><code>-p</code> <br>\n<em>Profile</em> dictionary of parameters that describe the instance to be launched, the list of predefined profiles can be viewed using <code>spot_connect.sutils.load_profiles()</code>.</p>\n<p><code>-s</code> <br>\n<em>Script</em> path or list of paths to scripts to be executed. If you're running linux os on your instance these should be bash scripts.</p>\n<p><code>-f</code> <br>\n<em>Filesystem</em> creation token name. The <code>--efsmount</code> option must be set to True for this to have an effect. The name of the filesystem you want to connect to, if it does not exist one will be created and connected to.</p>\n<p><code>-u</code> <br>\n<em>Upload</em> is the file path or directory that will be uploaded via paramiko ssh transfer. Upload speed depends only on internet speed and not instance type. **</p>\n<p><strong>Example for upload files</strong>:</p>\n<pre><code>-u C:\\Data\\file.txt  # uploading one file \n-u C:\\Data\\file_1.txt,C:\\MapData\\file_2.zip  #uploading a list of files \n</code></pre>\n<p><code>-r</code> <br>\n<em>Remotepath</em> is the directory on the EC2 instance to upload the files in the <code>-u</code> (upload) option to.</p>\n<p><strong>Syntax for remotepath:</strong></p>\n<pre><code>-r /home/ec2-user/efs/data  \n</code></pre>\n<p><code>-a</code> <br>\n<em>Activeprompt</em> is a boolean (<code>True</code> or <code>False</code>) for whether to leave an active shell connected to the instance after the scripts have finished running (if your instance has a linux ami, for example, this will be a linux shell).</p>\n<p><code>-t</code><br>\n<em>Terminate</em> is a boolean. If \"True\" the instance specified in the <code>-n</code> (name) argument will be terminated and nothing else will be done (<em>Terminate</em> overrides all other arguments).</p>\n<p><code>-m</code><br>\n<em>Monitoring</em> if set to True will activate cloudwatch monitoring for the instance.</p>\n<p><code>-em</code><br>\n<em>EFSMount</em> if set to True will connect to the EFS specified in the <code>-f</code> arg or create an EFS with that name if none exists.</p>\n<p><code>-nm</code><br>\n<em>Newmount</em> if set to True will create a new mount to an EFS for this instance. This is rarely necessary.</p>\n<p><code>-ip</code><br>\n<em>Instanceprofile</em> attaches a given instance profile to your instance to grant it access to other <strong>AWS</strong> services.</p>\n<p><strong>Launching vs. reconnecting to an instance</strong></p>\n<p>The settings you may define only when launching an instance are:</p>\n<ul>\n<li>profile</li>\n<li>monitoring</li>\n<li>instance_profile</li>\n</ul>\n<p><strong>example</strong>:</p>\n<p><code>spot_connect -n VM1 -p t3.small -m True -ip role1</code></p>\n<p>Once an instance is launched with these settings they are fixed and do not need to be defined again when connecting, such that I could open a prompt onto the instance using:</p>\n<p><code>spot_connect -n VM1 -a True</code></p>\n<p>and the instance would already be on a t3 processor with monitoring enabled and the instance_profile \"role1\"</p>\n<p><strong>Changing these specific settings after an instance has been created can be done but has not been incorporated into this module because, given the temporary nature of spot instances, relaunching the instance is an easier alternative.</strong></p>\n<h2>SpotInstance Class</h2>\n<p><code>from spot_connect.spotted import SpotInstance</code></p>\n<p>The <code>SpotInstance</code> class in the <code>spotted</code> module can be imported and run from scripts and notebooks and has all the same functionality of the command line tool.</p>\n<p><code>my_instance = SpotInstance('VM1', profile=\"t3.small\", monitoring=True, instance_profile=\"role1\")</code></p>\n<p>The <code>my_instance</code> variable instantiated above would connect to or create an instance called \"VM1\" with profile \"t3.small,\" cloudwatch monitoring enables and instance profile \"role1.\"</p>\n<p>The <code>SpotInstance</code> class even lets you define some of the profile settings directly such as,<em>image_id</em>, <em>instance_type</em>, <em>price</em>, <em>region</em>, and <em>firewall</em> (firewall settings). It even lets you specify some more detailed options such as the <em>key_pair</em>, <em>kp_dir</em> (key-pair directory), and <em>sec_group</em> (security group). In fact, the only option that is available in the command line and NOT available through the <code>spotted</code> module is <code>activeprompt</code>.</p>\n<p>However, the <code>SpotInstance</code> class does provide other functionality that makes it easier to handle and just as useful as the command line tool:</p>\n<ul>\n<li><strong><code>upload</code></strong>: upload files from a local directory directly to the instance.</li>\n</ul>\n<p><code>my_instance.upload(files, remotepath)</code></p>\n<ul>\n<li><strong><code>download</code></strong>: download files from the instance to a local directory</li>\n</ul>\n<p><code>my_instance.download(files, localpath)</code></p>\n<ul>\n<li><strong><code>run</code></strong>: run scripts or commands on the instance.</li>\n</ul>\n<p><code>my_instance.run('my_script.sh')</code> # Runs a script called my_script.sh</p>\n<p><code>my_instance.run('ls', cmd=True)</code> # Runs the \"ls\" command on the instance and prints out the directory of the home folder.</p>\n<p>Scripts can be converted into strings where each command is separated by a \"\\n\" character to avoid creating files. For example:</p>\n<pre><code>my_instance.upload('C://list_efs_files.py', '/home/ec2-user/efs/')\nresults = my_instance.run('cd efs\\n python list_efs_files.py', cmd=True, return_output=True) \n</code></pre>\n<p>The first line uploads a python script to the \"efs\" directory where my elastic file system is mounted.\nThe second line changes the working direcotry to the \"efs\" direcotry and then runs the python file I just uploaded. The <code>cmd</code> option tells the <code>run</code> method that I've submitted a command and not a script, the <code>return_output</code> option redirects any printed output to the \"results\" variable.</p>\n<h2>LinkAWS Class</h2>\n<p><code>from spot_connect.link import LinkAWS</code></p>\n<p>The <code>LinkAWS</code> class takes the <code>spotted</code> module one step further and provides the functionality for users to handle multiple spot instances and distribute workloads across these.</p>\n<p><code>my_link = LinkAWS()</code></p>\n<p>This provides useful functionality that makes working with the entire <code>spot_connect</code> module much easier, for example:</p>\n<ul>\n<li>\n<p><strong><code>launch_instance</code></strong> : Launch a spot instance and store it in the <code>LinkAWS.instances</code> dict attribute.</p>\n</li>\n<li>\n<p><strong><code>instance_s3_transfer</code></strong> : Will launch a new instance to transfer files from an S3 bucket to an instance or vice-versa. An instance profile with S3 access must be defined otherwise an error will be returned. See section on instance profiles below.</p>\n</li>\n<li>\n<p><strong><code>clone_repo</code></strong>, <strong><code>update_repo</code></strong> : Clone/update a git repo on the instance.</p>\n</li>\n<li>\n<p><strong><code>run_distributed_jobs</code></strong> : Distribute scripts and workloads across a given number of instances with a given profile</p>\n</li>\n</ul>\n<p>The <code>LinkAWS</code> class also provides shortcuts for some utility functions such as:</p>\n<ul>\n<li>\n<p><strong><code>get_instance_home_directory</code></strong> : prints the home directory for a given instance so the user can specify instance paths easily.</p>\n</li>\n<li>\n<p><strong><code>count_cores</code></strong> : prints the number physical and logical cores on a given instance.</p>\n</li>\n<li>\n<p><strong><code>list_profiles</code></strong> : same as <code>spot_connect.sutils.load_profiles()</code></p>\n</li>\n</ul>\n<h2>Suggested Project Guidelines</h2>\n<p><strong>Make sure your work can be stopped and resumed programatically</strong>. As mentioned at the outset of this document, some instances may be requisitioned by AWS and force your work to stop. This is more likely if you are working on high capacity instances. Later versions of this module will make it possible for you to anticipate these shut-downs so you can save your work and then launch another instance immediately and resume in the same elastic file system.</p>\n<p><em>Note: the functionality to detect when an instance is being shut-down is still in development</em></p>\n<p><br><br></p>\n<h1>AWS</h1>\n<h2><a href=\"https://aws.amazon.com/efs/\" rel=\"nofollow\">Elastic File System</a></h2>\n<p>Elastic file systems are a type of file storage provided by AWS that expand as more data are added to them. Data can be added to the and EFS directly through an instance or via DataSync which is a separate process offered by AWS.</p>\n<p>Any data you add to an EFS will persist such that if you mount an instance, upload data to the EFS folder, terminate the instance, launch a new instance, connect that instance to the same EFS (which you can do easily with the <code>-f</code> option) the data you uploaded earlier will automatically be available in the new instance. This makes it easy to resume work and save results quickly.</p>\n<p><strong>Connecting an Instance to an EFS</strong>:</p>\n<p>You can specify the name of <em>new</em> EFS you want to create or the <em>existing</em> EFS you want to connect to using the <code>-f</code> (<strong>filesystem</strong>) option when launching instances from the command line or <code>spotted</code> module.</p>\n<p>At least one mount target (a connection point) must be created for an EFS to connect to an instance. This module will automatically create or identify existing mount targets for a given EFS and will connect to it using the first IP address available in the subnet (for a full explanation of Subnets see <a href=\"https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Subnets.html\" rel=\"nofollow\">https://docs.aws.amazon.com/vpc/latest/userguide/VPC_Subnets.html</a>).</p>\n<p>To link an EFS to an instance the <strong>instance</strong> must request to connect to the EFS. When an instance is launched an an EFS is specified the module connects to the instance and runs a script that makes this request. Once an EFS has been mounted onto an instance it does not need to be mounted again, even if you disconnect from that instance.</p>\n<p><br><br></p>\n<h2>Instance Types &amp; Images</h2>\n<p>AWS makes different hardware available for instances, you can select the hardware you want for your instance when you select the instance type. For a full list of instance types check <a href=\"https://aws.amazon.com/ec2/instance-types/\" rel=\"nofollow\">this link</a>.</p>\n<p>Images or AMIs are the pre-set configurations available for instances. To my knowledge, every AMI in a given region is available for every instance type available in that region. You can browse through many pre-set AMIs can be browsed in the AWS EC2 launch wizard and then specified in profiles.</p>\n<h2>Profiles &amp; Specifying Instance Specs</h2>\n<p>The profiles that come with the module can be viewed by using <code>spot_connect.sutils.load_profiles()</code>. These are stored in a file called \"profiles.txt\" which is installed along with the module.</p>\n<p>The \"profiles.txt\" file only contains a dictionary with different instance spec configurations that have been created for the user's convenience.</p>\n<p><strong>Users will have to edit \"profiles.txt\" to fit their own aws configurations</strong>:</p>\n<ul>\n<li>\n<p><strong>region</strong> : Almost every other setting is dependent on region. You can change all the regions in every profile listed in \"profiles.txt\" using <code>spot_connect.sutils.change_default_region(&lt;region&gt;)</code></p>\n</li>\n<li>\n<p><strong>image_id</strong> : The default AMI is the deep learning image for Linux, this can be changed for every profile listed in \"profiles.txt\" using <code>spot_connect.sutils.change_default_image(&lt;image id&gt;)</code></p>\n</li>\n<li>\n<p><strong>price</strong> : Price is the maximum price you are willing to bid for an instance. For a list of spot-instance prices check <a href=\"https://aws.amazon.com/ec2/spot/pricing/\" rel=\"nofollow\">this link</a>. Price varies by region so make sure you edit these accordingly in \"profile.txt\" if you change regions.</p>\n</li>\n<li>\n<p><strong>username</strong> : Usually \"ec2-user\" but can depend on the instance AMI. For a list of default usernames see: <a href=\"https://alestic.com/2014/01/ec2-ssh-username/\" rel=\"nofollow\">https://alestic.com/2014/01/ec2-ssh-username/</a></p>\n</li>\n</ul>\n<p>There is really no need to change any of the other settings in the any of the profiles listed in \"profiles.txt\"</p>\n<h2>Instance Profiles</h2>\n<p>Instance profiles are rolls that you can create and assign to instances in order to grant them access to other AWS resources such as S3. Read more about what they are and how to use them in <a href=\"https://docs.aws.amazon.com/codedeploy/latest/userguide/getting-started-create-iam-instance-profile.html\" rel=\"nofollow\">this link</a>.</p>\n<p>If you navigate to the IAM resource in your AWS dashboard you can create access roles specific for EC2 instances to access other resources. Once these roles have been created you can create an instance profile from a shell, script or notebook using the <code>boto3</code> module:</p>\n<pre><code>import boto3\n\n# Connect to the IAM client \niam_client = boto3.client('iam')\n\n# Create an instance profile\niam_client.create_instance_profile(\n    InstanceProfileName = 'ec2_and_s3',\n)\n\n# Connect to the resource and the instance profile you've just created \niam_resource = boto3.resource('iam')\ninstance_profile = iam_resource.InstanceProfile('ec2_and_s3')\n\n# Add the desired IAM role, this should have been created earlier in the AWS console\ninstance_profile.add_role(RoleName='full_s3_access')\n</code></pre>\n<p>In the above block of code we create an instance profile names \"ec2_and_s3\" and assign it the access role \"full_s3_access\" which I created earlier through the dashboard.</p>\n<p>You know an instance has successfully been granted access because if you open a prompt to the instance and type <code>aws configure</code> your keys will already be filled.</p>\n\n          </div>"}, "last_serial": 6970199, "releases": {"1.0.0": [{"comment_text": "", "digests": {"md5": "a5ea2c3883c7b779f96e624904dab0a0", "sha256": "dcc9e3294a04024aa42068df142a368d1109b070901db0375f01620859dd8549"}, "downloads": -1, "filename": "spot_connect-1.0.0-py3-none-any.whl", "has_sig": false, "md5_digest": "a5ea2c3883c7b779f96e624904dab0a0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.7", "size": 23675, "upload_time": "2020-03-25T20:31:13", "upload_time_iso_8601": "2020-03-25T20:31:13.512071Z", "url": "https://files.pythonhosted.org/packages/e5/af/787dd7d29e71fbfb8c309b38a1c28d6e7364b830db4fc5c466ce4ab74697/spot_connect-1.0.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "59b045ebbf4a5ec3d9fde312bd290bad", "sha256": "a5cdf2fa0179fc9107c32c015b252bfb93e592c3112bf953b53ba5ca93d8d1f1"}, "downloads": -1, "filename": "spot-connect-1.0.0.tar.gz", "has_sig": false, "md5_digest": "59b045ebbf4a5ec3d9fde312bd290bad", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7", "size": 21933, "upload_time": "2020-03-25T20:31:15", "upload_time_iso_8601": "2020-03-25T20:31:15.272988Z", "url": "https://files.pythonhosted.org/packages/19/1e/519ec2f7f7af0eb4aeb1a28b0a440f07c67c4513b8a8c519b2b82fd48287/spot-connect-1.0.0.tar.gz", "yanked": false}], "1.0.0a1": [{"comment_text": "", "digests": {"md5": "a33d39602f03a5be785a8bc87a392f0f", "sha256": "0833ffb48d7d1f3b445691bcc17948a5a2054cc2f3a1f9a41db6d65f96ac2b4d"}, "downloads": -1, "filename": "spot_connect-1.0.0a1-py3-none-any.whl", "has_sig": false, "md5_digest": "a33d39602f03a5be785a8bc87a392f0f", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.7", "size": 17528, "upload_time": "2020-03-20T21:58:54", "upload_time_iso_8601": "2020-03-20T21:58:54.431248Z", "url": "https://files.pythonhosted.org/packages/cc/de/d36d2cb16fdcc7473b613947c1b5c1e554e691a630febd9eed7a99df682f/spot_connect-1.0.0a1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "70b6ae10ec308a14fecc2a0f23f84e53", "sha256": "6efc0389e4cd7d040d4993641d133ed4d67e13a783ebaeaa85576683064c88e6"}, "downloads": -1, "filename": "spot-connect-1.0.0a1.tar.gz", "has_sig": false, "md5_digest": "70b6ae10ec308a14fecc2a0f23f84e53", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7", "size": 14119, "upload_time": "2020-03-20T21:58:56", "upload_time_iso_8601": "2020-03-20T21:58:56.238023Z", "url": "https://files.pythonhosted.org/packages/18/1a/8d98cd33d723cc25174646ff8a1bf61822813930815195bcc75c897d5da8/spot-connect-1.0.0a1.tar.gz", "yanked": false}], "1.0.0a2": [{"comment_text": "", "digests": {"md5": "2fb396643584f70bdda5a43485b584fc", "sha256": "28cb99d17d991f2bfd6324e04c0e8c11c1e3b2f5b456286e0a8dc1094a4fdefb"}, "downloads": -1, "filename": "spot_connect-1.0.0a2-py3-none-any.whl", "has_sig": false, "md5_digest": "2fb396643584f70bdda5a43485b584fc", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.7", "size": 5839, "upload_time": "2020-03-25T00:54:17", "upload_time_iso_8601": "2020-03-25T00:54:17.114520Z", "url": "https://files.pythonhosted.org/packages/5c/fc/18364306970c78aadca8d7fbd80896e272022590e8cbbf4e4c2357ea77f0/spot_connect-1.0.0a2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "fb36cc11c8c25339d0d99885530bec7b", "sha256": "b0cc4fc4d1c2dfdfa8714b40d4226295ab0300b666f5ced662a685233508fb99"}, "downloads": -1, "filename": "spot-connect-1.0.0a2.tar.gz", "has_sig": false, "md5_digest": "fb36cc11c8c25339d0d99885530bec7b", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7", "size": 5538, "upload_time": "2020-03-25T00:54:18", "upload_time_iso_8601": "2020-03-25T00:54:18.109855Z", "url": "https://files.pythonhosted.org/packages/b8/41/fc73157cbd40007995ab67bfffa566996475774aeaecd533bbb28ce90614/spot-connect-1.0.0a2.tar.gz", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "eae4592c0f2f9f7258e278d8bdf12cf1", "sha256": "45b048aa435d222966cc1cd58e6b4c1680afa73bf5e62a46abf646b109613c11"}, "downloads": -1, "filename": "spot_connect-1.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "eae4592c0f2f9f7258e278d8bdf12cf1", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.7", "size": 24215, "upload_time": "2020-04-01T20:22:42", "upload_time_iso_8601": "2020-04-01T20:22:42.253180Z", "url": "https://files.pythonhosted.org/packages/65/b8/947a0295374e62ec5fd4e4a829fea3dd31556f25a910ad067fab9d2fd4bc/spot_connect-1.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7259c64aeee5a24b3633e27eb1d7fd30", "sha256": "4b6da1ce47ec5f38b2aeffebdd1c0768c4239af5b4ec4f96f11621d807d4600c"}, "downloads": -1, "filename": "spot-connect-1.0.1.tar.gz", "has_sig": false, "md5_digest": "7259c64aeee5a24b3633e27eb1d7fd30", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7", "size": 22522, "upload_time": "2020-04-01T20:22:49", "upload_time_iso_8601": "2020-04-01T20:22:49.727262Z", "url": "https://files.pythonhosted.org/packages/dc/f1/30dd4666d6f99b209e9d5bb8bf838dda67c7aa87684aff39a67217b1b719/spot-connect-1.0.1.tar.gz", "yanked": false}], "1.0.2": [{"comment_text": "", "digests": {"md5": "61110055ced6678f9fbb8333303cc91d", "sha256": "a9808affd85ca8e7d7471daddbe5d9f203aa52414ebc739642a25dfe0fb3f7f0"}, "downloads": -1, "filename": "spot_connect-1.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "61110055ced6678f9fbb8333303cc91d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.7", "size": 31716, "upload_time": "2020-04-07T13:59:57", "upload_time_iso_8601": "2020-04-07T13:59:57.249742Z", "url": "https://files.pythonhosted.org/packages/99/56/b78621036a127321160a00d535a48505419c4abddcdfa3c9102cd04f3f59/spot_connect-1.0.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9fd2b946b8edde7503db898c76af73e9", "sha256": "4f704b645157980db8c326076c4123c93275c64ee33e6de348f1f3253598bcae"}, "downloads": -1, "filename": "spot-connect-1.0.2.tar.gz", "has_sig": false, "md5_digest": "9fd2b946b8edde7503db898c76af73e9", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7", "size": 31168, "upload_time": "2020-04-07T13:59:58", "upload_time_iso_8601": "2020-04-07T13:59:58.135096Z", "url": "https://files.pythonhosted.org/packages/7f/00/814aad75a8621035dc477c2f70902ce17b58cd534b4bed861a3b36a65bd9/spot-connect-1.0.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "61110055ced6678f9fbb8333303cc91d", "sha256": "a9808affd85ca8e7d7471daddbe5d9f203aa52414ebc739642a25dfe0fb3f7f0"}, "downloads": -1, "filename": "spot_connect-1.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "61110055ced6678f9fbb8333303cc91d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.7", "size": 31716, "upload_time": "2020-04-07T13:59:57", "upload_time_iso_8601": "2020-04-07T13:59:57.249742Z", "url": "https://files.pythonhosted.org/packages/99/56/b78621036a127321160a00d535a48505419c4abddcdfa3c9102cd04f3f59/spot_connect-1.0.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9fd2b946b8edde7503db898c76af73e9", "sha256": "4f704b645157980db8c326076c4123c93275c64ee33e6de348f1f3253598bcae"}, "downloads": -1, "filename": "spot-connect-1.0.2.tar.gz", "has_sig": false, "md5_digest": "9fd2b946b8edde7503db898c76af73e9", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7", "size": 31168, "upload_time": "2020-04-07T13:59:58", "upload_time_iso_8601": "2020-04-07T13:59:58.135096Z", "url": "https://files.pythonhosted.org/packages/7f/00/814aad75a8621035dc477c2f70902ce17b58cd534b4bed861a3b36a65bd9/spot-connect-1.0.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:04:33 2020"}