{"info": {"author": "srevinsaju", "author_email": "srevin03@gmail.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: GNU General Public License v3 (GPLv3)", "Operating System :: MacOS :: MacOS X", "Operating System :: Microsoft :: Windows", "Operating System :: OS Independent", "Operating System :: POSIX", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3.8"], "description": "<img src=sugaroid/gui/ui/sugaroid.png width=25%>\n\n# Sugaroid\n[![Become a Patron](https://c5.patreon.com/external/logo/become_a_patron_button.png)](https://www.patreon.com/srevinsaju?fan_landing=true)\n\n> **IMPORTANT** : Sugaroid is an open source software. The web server is deployed on Microsoft Azure. Your support for this open source software is highly necessary to make this project continued to be served on the world wide web. Consider being my patron to help Sugaroid host its servers or if you are willing to lend servers for Sugaroid, press the sponsor button and email me. Thanks. However, Sugaroid will always remain free forever :smile:\n\n## Introduction\n\nSugaroid is a new Artificial Intelligence which uses Natural Language Processing (NLP) with Machine Learning and neural networks to manipulate user input to provide a intuitive response. The AI is built on `Python 3.8.2` and was built out of personal interest, to tackle three important issues in the Python framework\n\n* Natural Language Processing / Machine Learning\n* Graphical User Interface\n* Database Management, Configuration file management and Web Development\n\nSugaroid Chatbot has a comprehensive and modular interface utilizing Object Oriented Programming to benefit activities of [Sugarlabs](www.sugarlabs.org), a non-profit educational organization. Initially built to serve as a companion bot, the Sugaroid Virtual Assistant helps to comprehend most of the messages, to generate a probable response. The future plans of sugaroid aims to extend Sugaroid as a documentation reader of which beta previews are `still under testing`. \n\nThe Sugaroid bot is deployed in production servers particularly for testing. \n\n* [The web interface](https://sed.lol/sugaroid)\n* The discord bot\n* IRC bot hosted on self when necessary\n\n## Installation\n\n### Installing from PYPI\n\nThe Sugaroid Chatbot is built on [wheels](https://pythonwheels.com/) and is also published on the [Python Packaging Index (PYPI)](pypi.org). This was done, so as to provide easy access to the bot without the end-user undergoing a lot of hassle\n\n```bash\npip3 install sugaroid\n```\n\n> `NOTE`: Users have reported cases when installation was unsuccessful especially if the native operating system  is Windows. The testing on the `Windows` and related operating systems like `ReactOS` is only under progress. If you would like to contribute to windows testing, let me know as an issue on the repository or a mail\n\n### Installation from Source\n\nSugaroid chatbot can also be installed from the latest commits by \n\n```\npip3 install https://github.com/srevinsaju/sugaroid/archive/master.zip\n```\n\nAlternatively\n\n```bash\ngit clone https://github.com/srevinsaju/sugaroid\ncd sugaroid\npython3 setup.py install --user\n```\n\n\n\n## Execution\n\nRunning `sugaroid` is easy as pie\n\nJust execute\n\n```bash\n$ sugaroid\n```\n\nfrom the Terminal (Linux, Mac OS) and PowerShell (on Windows)\n\nThere are few arguments that can be passed to sugaroid\n\n* `qt` : Running `sugaroid qt` will start the `sugaroid` graphical user interface\n* `audio` : Running `sugaroid audio` will include audio support for `sugaroid` (Data charges may apply)\n* `train`: Running `sugaroid train` will start the sugaroid trainer, which you can use to train sugaroid for some responses \n* `update` : Running `sugaroid update` will clear the current database and train the new data and store it persistently to the configuration path as `sugaroid.db` . (See [Configuration](#Configuraton) for more details)\n\nTo launch the sugaroid web server on any IP address, do a local clone of the package by\n\n```bash\ngit clone https://github.com/srevinsaju/sugaroid-wsgi --depth=1\ncd sugaroid-wsgi\npython manage.py runserver\n```\n\nFollow the on-screen instructions to get it running on your web browser. If the command completed with a status `OK`, you should be able to see sugaroid running on https://0.0.0.0:8000\n\n## Interfaces\n\n### Command Line Interface \n\n`sugaroid` was initially built to be a command line. This was beneficial for testing an development of new algorithms without calling the GUI every time. A CLI is more familiar to developers. Logging could be manually adjusted to show the verbose outputs. This was implemented within `sugaroid.sugaroid` and could be toggled, by setting \n\n```python\nsugaroid.sugaroid.verbosity = logging.INFO\n```\n\nThe `INFO` can be replaced to match any of the following `WARNING`, `ERROR` , `INFO`\n\n![sugaroid console](docs/img/sugaroid_console.png)\n\n### Graphical User Interface (Local)\n\n![](/home/ss/repo/sugaroid/docs/img/sugaroid_qt.gif)\n\nThe modular capacity of Sugaroid makes it easy to implement a GUI without rewriting the code. This is highly efficient because it reuses objects and reduces the size of the end distribution. The GUI for sugaroid is built on `LGPL` based open source GUI framework, viz. `PyQt5`. The implemented `PyQt5` framework in `Sugaroid` looks similar to the following image. (Image may vary with updates)\n\n### Django (Web) Interface\n\nIn order to provide a server side chatbot server, the sugaroid AI was configured to be used to Django. This used open source bootstrap templates to create a chatbot appearance that was pretty neat and effective way to host it on a Django server (if one exists)\n\n![sugaroid_django](docs/img/sugaroid_django.gif)\n\nThe current work left on the Django system is to enable cookies to store the data on the client side temporarily and not on the server side. The current Django implementation is based on server-side, which implies the chat history is saved on the server\n\n## Similarity Algorithms\n\n### Jaccard Similarity\n\nJaccard Similarity / sigma similarity uses a simple, but less memory intensive algorithm to analyze the statements. The equation is given as follows\n$$\n\\theta = \\frac {n}{x+y}\n$$\nWhere n, number of common words in list x and list y, and (x+ y) shows the union of x and y similarity. \n\nThe benefits of using Jaccard similarity is that, sugaroid can implement `can_process` methods in an object with optimal resource usage. There is no need to use complex cosine dot product for finding similarity in cases there are only one word as list x and list y respectively. This helped to optimize the sugaroid bot partly\n\nJaccard Similarity can be accessed by `sugaroid.brain.preprocessors.sigma_similarity`\n\n### Cosine Dot product \n\nThe Sugaroid AI selectively uses Cosine Dot product for comparing statements on the ratio of similarity and selects an appropriate statement stored to the database. \n$$\n\\vec A.\\vec B = ABcos\\theta \\\\\ncos \\theta = \\frac{\\vec A . \\vec B}{A.B}\n$$\nWords are classified as vectors in this case. Similar words are given similar but unique vector quantity, such that only equal phrases can have the common cosine dot product. This vector model was downloaded from the universal `nltk.wordnet` is a collection of word and their classification\n\n![img](/home/ss/repo/sugaroid/docs/img/wordnet-event.png)\n\nThis complex collection of details helped to club similar nouns and verbs together and provide customized answers, reduce training data and increasing program logic. Therefore, each data was not to be separately forced to the sugaroid bot to understand and learn but also learn the phrases of message input by itself and store it in the SQL Database for future reference\n\nCosine Dot product can be accessed within sugaroid by `sugaroid.brain.postprocessors.cosine_similarity`\n\n### Jensen Shannon Distance (JSD)\n\nThe [Jensen Shannon Distance](https://en.wikipedia.org/wiki/Jensen–Shannon_divergence) is the last and the complex algorithm used inside `sugaroid` bot. The equation for finding Jensen Shannon Distance is not directly used within \n$$\nD(M || Q) = \\sum M(i) . \\log \\frac {M(i)}{Q(i)} \\\\\nJSD (M || Q) = \\frac 12\\sum ( \\log(\\frac {M(i)}{\\frac12M(i) + Q(i)}) + \\log(\\frac{Q(i)}{\\frac 12 M(i) + Q(i)}))\n$$\nThis being a complex and CPU intensive process, is handled systematically by a Natural Language Processing library with Industrial Processing support, viz, SpaCy. The [SpaCy](spacy.io) library handles this effectively by loading data from `en_core_web_sm` and `en_core_web_lg`\n\nThe difference between `sm` and `lg` is that, `en_core_web_sm` is collection of all the word in the dictionary with vectors only  and weighs 7.5 MB. The `en_core_web_lg` weighs 880 MB, and has data for `tensors` too. This dataset is more efficient because, the data so obtained has tensor data and this helps to correctly measure Jensen Shannon Distance. \n\nThe JSD is internally implemented in an `nlp` object called `LanguageProcessor` and handles most of the complex conversations inside `sugaroid.brain.utils.LanguageProcessor` is a signed class with two methods `tokenize` and `similarity` The `similarity` method return the resultant net vector displacement of the given vectors.\n\n#### Sentiments Analyzer\n\nThe `sugaroid.brain` features another comprehensive object derived from `wordnet` called `SentimentsIntensityAnalyzer` or `sia` for short. The `SentimentIntensityAnanlyzer` has a list of words with positivity, negativity and neutrality. `sugaroid` bot uses `vader_lexicon` to classify sentences as attributive or corruptive and then gives an equal answer.\n\n### Faults in Similarity Algorithms\n\nSometimes, the similarity algorithms may give a completely incorrect answer that may lead to false response by the bot to the user. This is because tensors have no resultant displacement and has multiple direction. To compute zero vectors, SpaCy uses an approximation algorithm called Word Mover Distance. This might lead to unknown predictions. Such predictions should be raised as an issue on the Sugaroid repository to create a tackler adapter that would override the answer with a suitable confidence value. \n\nThe other complex and efficient algorithms have been neglected. This is to reduce the size of the distribution as well as reduce the time of installation on an end-user's PC. Complex and accurate Natural Language Processing systems like `pytorch` and `tensorflow` exists, but this may result in the net user installation size to be approximately 2 GB +, which is probably not what the end-user requires.\n\n## Configuration\n\nSugaroid saves some data to your PC. The path where `sugaroid` saves the data is `~/.config/sugaroid` on Linux and Mac OS, but on Windows it is in `C:\\Users\\<username>\\AppData\\sugaroid\\ ` \n\nThis is the training database used my sugaroid to answer your questions. Particularly related to `sugaroid` brain, the files are `sugaroid.db` and `sugaroid.trainer.json` \n\n* `sugaroid.db` : The Sugaroid bot uses `SQLite` to read data from a persistent database. Remove `sugaroid.db` will reset `sugaroid`s brain, and a fresh database will be created  from scratch\n* `sugaroid.trainer.json` : Is a JavaScript Object Notation file which stores trained responses in order to reset or retrain them whenever there is a necessity. This file may or may not be present in end user's systems and depends solely on the type of release `dev` or `stable`\n\nThere might also be additional files in the configuration directory. These are Audio files, In the case that the `audio` keyword is passed as an argument, it creates samples of audio files downloaded from the `Google` server to serve [TTS (Text to Speech)](https://cloud.google.com/text-to-speech) to the end user. \n\n### TTS Configuration files\n\nThe TTS configuration files are created by the `sugaroid.tts.Text2Speech` class. This follows an optimization algorithm. The following is the steps followed by it in short:\n\n```mermaid\ngraph LR\n    C{Path Exists}\n    C -->|False| D[Create folder]\n    C -->|True| E{Audio exists}\n    E -->|True| F[Play]\n    E -->|False| G[Download]\n    G --> F\n\n\n```\n\nThis algorithm is implemented to prevent the download of Audio files on each request by the sugaroid bot.\n\n\n\n## Memory \n\nThe Sugaroid bot has been designed to provide an acceptable answer and the author had been focusing on refining the response by the bot more and more better. However this has resulted in bad PEP practices and dis allocated memory modules. \n\n| Time                      | Memory (KB) | Memory (MB) |\n| ------------------------- | ----------- | ----------- |\n| Initial Loading           | 83500 KB    | 83.5 MB     |\n| Pause after loading       | 173800 KB   | 173.8 MB    |\n| First Question (Hello)    | 266500 KB   | 266.5 MB    |\n| Second Question (Hey)     | 287500 KB   | 287.5 MB    |\n| Third Question (Emotion)  | 289500 KB   | 289.5 MB    |\n| Fourth Question (Emotion) | 289950 KB   | 290 MB      |\n\nThis is because, a lot of unnecessary objects have been created in the memory. This should be removed before the release of `sugaroid` version 1.0\n\n### Update v 0.7\n\nThe unnecessary `spaCy` tokenizers were forced to be implemented into a single function called `sugaroid.sugaroid.SugaroidStatement`  which calculates the `spacy.nlp.Doc` on each object initialization. All the rest of the statement tokenizers were replaced by the base class usage. This prevents the recalculation of the similarity and tokens for each adapter. However, the number of adapters have increased considerably. The net memory decrease cannot be plotted, nevertheless. On the addition of each Adapter, the average RAM increases logarithmically as far as 1% of the total RAM used. This increases exponentially until the bases state where the coverage of sugaroid has been achieved to be above 75% and all the adapters have been significantly used to process at least 1 statement.\n\n## CPU Usage\n\nThe Sugaroid bot does not have significant CPU usage. Tested on Linux Manjaro running with 1.8 GHz with other applications running did not affect system stability. \n\n## Adapters\n\nThe brain of sugaroid relies in the modules it uses. Sugaroid uses many modules to process statements called `Adapters` to process statements. Each statement is checked against two functions `LogicAdapter.can_process()` and `LogicAdapter.process()`.  `LogicAdapter.can_process()` gives a boolean response if the statement can or cannot be processed. If the statement can be processed, `LogicAdapter.process()` is called. \n\nAs of Sugaroid `v0.7`, it has:\n\n* BoolAdapter: Processes Boolean based answers\n* AkinatorAdapter: Adapter which ports the wrapper of the Akinator game to Sugaroid\n* HangmanAdapter: Plays hangman with you \n* OrAdapter: Selects a random operand of the provided statement \n* OkayAdapter: Handles statements with a plain old okay \n* ByeAdapter: Destroys Sugaroid on bye \n* TimeAdapter: Provides time and time related functions except time conversion \n* CurrencyAdapter: Gives a random response, because Sugaroid tries not to say I don't know \n* LearnAdapter: a specific adapter for learning responses \n* TriviaAdapter: Plays a short game of trivia \n* WhoAdapter: Handles statements with 'who' as one of the tokens \n* NewsAdapter: Ports the SugaroidNews Wrapper for easier access by the SugaroidChatbot Class \n* JokeAdapter: Gets a random joke from the Chuck Norris Database \n* PlayAdapter: [DEPRECATED] Plays a game on desktops only \n* CanAdapter: Processes statements which features a Modal question (can, may) \n* BecauseAdapter: Processes statements which starts with Because or gives a reason \n* ReReverseAdapter: Processes statements featuring conversational flow. It scans the previous statements \n     and takes a cosine similarity of the statemnts, and TFiD Vector cross product to get \n     the most probable answer \n* ReverseAdapter: A random adapter. Top Secret \n* MyNameAdapter: Handles sentences featuring 'my' and 'name' \n* MeAdapter: Processes the statements showing possessive \n* AboutAdapter: Defines the personality of sugaroid \n* WikiAdapter: Handles Wikipedia based questions \n   DoLikeAdapter: Handles likes of Sugaroid \n   FeelAdapter: Handles sentences containing the word feel \n   DoLikeAdapter: Handles likes of Sugaroid \n   DoAdapter: Processes statements beginning with 'Do' and 'know' \n   EmotionAdapter: Handles positive and negative emotional statements \n   DisAdapter: A complex algorithm sorting the words beginning with negative based on the probability. \n     and achieving a similar confidence ratio of the word percentage. \n     The DisAdapter keeps the confidence below 0.5 so that the BestAdapter may find some \n     other answer similar to \n   TwoWordAdapter: Hanfles sentences having two wrods \n   OneWordAdapter: Logical adapter for processing data with one words \n   DebugAdapter: Internal Admin feature to debug Sugaroid statements \n   WhyWhenAdapter: Processes wh-adverbs \n   ReaderAdapter: Logical adapter for processing data with one words \n   ImitateAdapter: Handles statements involving imitations of some sentences \n   FunAdapter: Gives a random response, because Sugaroid tries not to say I don't know \n   UnitConversion: The UnitConversion logic adapter parse inputs to convert values\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "https://github.com/srevinsaju/guiscrcpy/archive/master.zip", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://srevinsaju.github.io/guiscrcpy", "keywords": "", "license": "GPL v3", "maintainer": "", "maintainer_email": "", "name": "sugaroid", "package_url": "https://pypi.org/project/sugaroid/", "platform": "", "project_url": "https://pypi.org/project/sugaroid/", "project_urls": {"Download": "https://github.com/srevinsaju/guiscrcpy/archive/master.zip", "Homepage": "https://srevinsaju.github.io/guiscrcpy"}, "release_url": "https://pypi.org/project/sugaroid/0.6/", "requires_dist": ["GitPython", "googletrans", "google", "Django", "pyjokes", "scikit-learn", "nltk", "lxml", "pyinflect", "wikipedia-API", "pyyaml", "newsapi-python", "sugaroid-chatterbot", "pyspellchecker", "python-dotenv", "sugaroid-chatterbot-corpus", "freegames", "spacy", "requests", "beautifulsoup4", "django-googlesearch", "wikipedia", "akinator.py", "emoji", "currencyconverter"], "requires_python": "", "summary": "sugaroid", "version": "0.6", "yanked": false, "html_description": "<div class=\"project-description\">\n            <img src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/c4e1a18163fc99677215579be63ab88c027acfa7/73756761726f69642f6775692f75692f73756761726f69642e706e67\" width=\"25%\">\n<h1>Sugaroid</h1>\n<p><a href=\"https://www.patreon.com/srevinsaju?fan_landing=true\" rel=\"nofollow\"><img alt=\"Become a Patron\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/cf6b2799bdc4927927a79c4813b7b540815cd744/68747470733a2f2f63352e70617472656f6e2e636f6d2f65787465726e616c2f6c6f676f2f6265636f6d655f615f706174726f6e5f627574746f6e2e706e67\"></a></p>\n<blockquote>\n<p><strong>IMPORTANT</strong> : Sugaroid is an open source software. The web server is deployed on Microsoft Azure. Your support for this open source software is highly necessary to make this project continued to be served on the world wide web. Consider being my patron to help Sugaroid host its servers or if you are willing to lend servers for Sugaroid, press the sponsor button and email me. Thanks. However, Sugaroid will always remain free forever :smile:</p>\n</blockquote>\n<h2>Introduction</h2>\n<p>Sugaroid is a new Artificial Intelligence which uses Natural Language Processing (NLP) with Machine Learning and neural networks to manipulate user input to provide a intuitive response. The AI is built on <code>Python 3.8.2</code> and was built out of personal interest, to tackle three important issues in the Python framework</p>\n<ul>\n<li>Natural Language Processing / Machine Learning</li>\n<li>Graphical User Interface</li>\n<li>Database Management, Configuration file management and Web Development</li>\n</ul>\n<p>Sugaroid Chatbot has a comprehensive and modular interface utilizing Object Oriented Programming to benefit activities of <a href=\"www.sugarlabs.org\" rel=\"nofollow\">Sugarlabs</a>, a non-profit educational organization. Initially built to serve as a companion bot, the Sugaroid Virtual Assistant helps to comprehend most of the messages, to generate a probable response. The future plans of sugaroid aims to extend Sugaroid as a documentation reader of which beta previews are <code>still under testing</code>.</p>\n<p>The Sugaroid bot is deployed in production servers particularly for testing.</p>\n<ul>\n<li><a href=\"https://sed.lol/sugaroid\" rel=\"nofollow\">The web interface</a></li>\n<li>The discord bot</li>\n<li>IRC bot hosted on self when necessary</li>\n</ul>\n<h2>Installation</h2>\n<h3>Installing from PYPI</h3>\n<p>The Sugaroid Chatbot is built on <a href=\"https://pythonwheels.com/\" rel=\"nofollow\">wheels</a> and is also published on the <a href=\"pypi.org\" rel=\"nofollow\">Python Packaging Index (PYPI)</a>. This was done, so as to provide easy access to the bot without the end-user undergoing a lot of hassle</p>\n<pre>pip3 install sugaroid\n</pre>\n<blockquote>\n<p><code>NOTE</code>: Users have reported cases when installation was unsuccessful especially if the native operating system  is Windows. The testing on the <code>Windows</code> and related operating systems like <code>ReactOS</code> is only under progress. If you would like to contribute to windows testing, let me know as an issue on the repository or a mail</p>\n</blockquote>\n<h3>Installation from Source</h3>\n<p>Sugaroid chatbot can also be installed from the latest commits by</p>\n<pre><code>pip3 install https://github.com/srevinsaju/sugaroid/archive/master.zip\n</code></pre>\n<p>Alternatively</p>\n<pre>git clone https://github.com/srevinsaju/sugaroid\n<span class=\"nb\">cd</span> sugaroid\npython3 setup.py install --user\n</pre>\n<h2>Execution</h2>\n<p>Running <code>sugaroid</code> is easy as pie</p>\n<p>Just execute</p>\n<pre>$ sugaroid\n</pre>\n<p>from the Terminal (Linux, Mac OS) and PowerShell (on Windows)</p>\n<p>There are few arguments that can be passed to sugaroid</p>\n<ul>\n<li><code>qt</code> : Running <code>sugaroid qt</code> will start the <code>sugaroid</code> graphical user interface</li>\n<li><code>audio</code> : Running <code>sugaroid audio</code> will include audio support for <code>sugaroid</code> (Data charges may apply)</li>\n<li><code>train</code>: Running <code>sugaroid train</code> will start the sugaroid trainer, which you can use to train sugaroid for some responses</li>\n<li><code>update</code> : Running <code>sugaroid update</code> will clear the current database and train the new data and store it persistently to the configuration path as <code>sugaroid.db</code> . (See <a href=\"#Configuraton\" rel=\"nofollow\">Configuration</a> for more details)</li>\n</ul>\n<p>To launch the sugaroid web server on any IP address, do a local clone of the package by</p>\n<pre>git clone https://github.com/srevinsaju/sugaroid-wsgi --depth<span class=\"o\">=</span><span class=\"m\">1</span>\n<span class=\"nb\">cd</span> sugaroid-wsgi\npython manage.py runserver\n</pre>\n<p>Follow the on-screen instructions to get it running on your web browser. If the command completed with a status <code>OK</code>, you should be able to see sugaroid running on <a href=\"https://0.0.0.0:8000\" rel=\"nofollow\">https://0.0.0.0:8000</a></p>\n<h2>Interfaces</h2>\n<h3>Command Line Interface</h3>\n<p><code>sugaroid</code> was initially built to be a command line. This was beneficial for testing an development of new algorithms without calling the GUI every time. A CLI is more familiar to developers. Logging could be manually adjusted to show the verbose outputs. This was implemented within <code>sugaroid.sugaroid</code> and could be toggled, by setting</p>\n<pre><span class=\"n\">sugaroid</span><span class=\"o\">.</span><span class=\"n\">sugaroid</span><span class=\"o\">.</span><span class=\"n\">verbosity</span> <span class=\"o\">=</span> <span class=\"n\">logging</span><span class=\"o\">.</span><span class=\"n\">INFO</span>\n</pre>\n<p>The <code>INFO</code> can be replaced to match any of the following <code>WARNING</code>, <code>ERROR</code> , <code>INFO</code></p>\n<p><img alt=\"sugaroid console\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/a6d82baca3efbe4fcd7a4af6d67ecc1ecf81af52/646f63732f696d672f73756761726f69645f636f6e736f6c652e706e67\"></p>\n<h3>Graphical User Interface (Local)</h3>\n<p><img alt=\"\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/441ce68801ed8cf101e8e5533d29346006b94844/2f686f6d652f73732f7265706f2f73756761726f69642f646f63732f696d672f73756761726f69645f71742e676966\"></p>\n<p>The modular capacity of Sugaroid makes it easy to implement a GUI without rewriting the code. This is highly efficient because it reuses objects and reduces the size of the end distribution. The GUI for sugaroid is built on <code>LGPL</code> based open source GUI framework, viz. <code>PyQt5</code>. The implemented <code>PyQt5</code> framework in <code>Sugaroid</code> looks similar to the following image. (Image may vary with updates)</p>\n<h3>Django (Web) Interface</h3>\n<p>In order to provide a server side chatbot server, the sugaroid AI was configured to be used to Django. This used open source bootstrap templates to create a chatbot appearance that was pretty neat and effective way to host it on a Django server (if one exists)</p>\n<p><img alt=\"sugaroid_django\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/836b000cbd9bc55e665aad9aa534f46db83a8aaf/646f63732f696d672f73756761726f69645f646a616e676f2e676966\"></p>\n<p>The current work left on the Django system is to enable cookies to store the data on the client side temporarily and not on the server side. The current Django implementation is based on server-side, which implies the chat history is saved on the server</p>\n<h2>Similarity Algorithms</h2>\n<h3>Jaccard Similarity</h3>\n<p>Jaccard Similarity / sigma similarity uses a simple, but less memory intensive algorithm to analyze the statements. The equation is given as follows\n$$\n\\theta = \\frac {n}{x+y}\n$$\nWhere n, number of common words in list x and list y, and (x+ y) shows the union of x and y similarity.</p>\n<p>The benefits of using Jaccard similarity is that, sugaroid can implement <code>can_process</code> methods in an object with optimal resource usage. There is no need to use complex cosine dot product for finding similarity in cases there are only one word as list x and list y respectively. This helped to optimize the sugaroid bot partly</p>\n<p>Jaccard Similarity can be accessed by <code>sugaroid.brain.preprocessors.sigma_similarity</code></p>\n<h3>Cosine Dot product</h3>\n<p>The Sugaroid AI selectively uses Cosine Dot product for comparing statements on the ratio of similarity and selects an appropriate statement stored to the database.\n$$\n\\vec A.\\vec B = ABcos\\theta \\\ncos \\theta = \\frac{\\vec A . \\vec B}{A.B}\n$$\nWords are classified as vectors in this case. Similar words are given similar but unique vector quantity, such that only equal phrases can have the common cosine dot product. This vector model was downloaded from the universal <code>nltk.wordnet</code> is a collection of word and their classification</p>\n<p><img alt=\"img\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/d933028f9004784d94173fc77378ad8a646d32ae/2f686f6d652f73732f7265706f2f73756761726f69642f646f63732f696d672f776f72646e65742d6576656e742e706e67\"></p>\n<p>This complex collection of details helped to club similar nouns and verbs together and provide customized answers, reduce training data and increasing program logic. Therefore, each data was not to be separately forced to the sugaroid bot to understand and learn but also learn the phrases of message input by itself and store it in the SQL Database for future reference</p>\n<p>Cosine Dot product can be accessed within sugaroid by <code>sugaroid.brain.postprocessors.cosine_similarity</code></p>\n<h3>Jensen Shannon Distance (JSD)</h3>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Jensen%E2%80%93Shannon_divergence\" rel=\"nofollow\">Jensen Shannon Distance</a> is the last and the complex algorithm used inside <code>sugaroid</code> bot. The equation for finding Jensen Shannon Distance is not directly used within\n$$\nD(M || Q) = \\sum M(i) . \\log \\frac {M(i)}{Q(i)} \\\nJSD (M || Q) = \\frac 12\\sum ( \\log(\\frac {M(i)}{\\frac12M(i) + Q(i)}) + \\log(\\frac{Q(i)}{\\frac 12 M(i) + Q(i)}))\n$$\nThis being a complex and CPU intensive process, is handled systematically by a Natural Language Processing library with Industrial Processing support, viz, SpaCy. The <a href=\"spacy.io\" rel=\"nofollow\">SpaCy</a> library handles this effectively by loading data from <code>en_core_web_sm</code> and <code>en_core_web_lg</code></p>\n<p>The difference between <code>sm</code> and <code>lg</code> is that, <code>en_core_web_sm</code> is collection of all the word in the dictionary with vectors only  and weighs 7.5 MB. The <code>en_core_web_lg</code> weighs 880 MB, and has data for <code>tensors</code> too. This dataset is more efficient because, the data so obtained has tensor data and this helps to correctly measure Jensen Shannon Distance.</p>\n<p>The JSD is internally implemented in an <code>nlp</code> object called <code>LanguageProcessor</code> and handles most of the complex conversations inside <code>sugaroid.brain.utils.LanguageProcessor</code> is a signed class with two methods <code>tokenize</code> and <code>similarity</code> The <code>similarity</code> method return the resultant net vector displacement of the given vectors.</p>\n<h4>Sentiments Analyzer</h4>\n<p>The <code>sugaroid.brain</code> features another comprehensive object derived from <code>wordnet</code> called <code>SentimentsIntensityAnalyzer</code> or <code>sia</code> for short. The <code>SentimentIntensityAnanlyzer</code> has a list of words with positivity, negativity and neutrality. <code>sugaroid</code> bot uses <code>vader_lexicon</code> to classify sentences as attributive or corruptive and then gives an equal answer.</p>\n<h3>Faults in Similarity Algorithms</h3>\n<p>Sometimes, the similarity algorithms may give a completely incorrect answer that may lead to false response by the bot to the user. This is because tensors have no resultant displacement and has multiple direction. To compute zero vectors, SpaCy uses an approximation algorithm called Word Mover Distance. This might lead to unknown predictions. Such predictions should be raised as an issue on the Sugaroid repository to create a tackler adapter that would override the answer with a suitable confidence value.</p>\n<p>The other complex and efficient algorithms have been neglected. This is to reduce the size of the distribution as well as reduce the time of installation on an end-user's PC. Complex and accurate Natural Language Processing systems like <code>pytorch</code> and <code>tensorflow</code> exists, but this may result in the net user installation size to be approximately 2 GB +, which is probably not what the end-user requires.</p>\n<h2>Configuration</h2>\n<p>Sugaroid saves some data to your PC. The path where <code>sugaroid</code> saves the data is <code>~/.config/sugaroid</code> on Linux and Mac OS, but on Windows it is in <code>C:\\Users\\&lt;username&gt;\\AppData\\sugaroid\\</code></p>\n<p>This is the training database used my sugaroid to answer your questions. Particularly related to <code>sugaroid</code> brain, the files are <code>sugaroid.db</code> and <code>sugaroid.trainer.json</code></p>\n<ul>\n<li><code>sugaroid.db</code> : The Sugaroid bot uses <code>SQLite</code> to read data from a persistent database. Remove <code>sugaroid.db</code> will reset <code>sugaroid</code>s brain, and a fresh database will be created  from scratch</li>\n<li><code>sugaroid.trainer.json</code> : Is a JavaScript Object Notation file which stores trained responses in order to reset or retrain them whenever there is a necessity. This file may or may not be present in end user's systems and depends solely on the type of release <code>dev</code> or <code>stable</code></li>\n</ul>\n<p>There might also be additional files in the configuration directory. These are Audio files, In the case that the <code>audio</code> keyword is passed as an argument, it creates samples of audio files downloaded from the <code>Google</code> server to serve <a href=\"https://cloud.google.com/text-to-speech\" rel=\"nofollow\">TTS (Text to Speech)</a> to the end user.</p>\n<h3>TTS Configuration files</h3>\n<p>The TTS configuration files are created by the <code>sugaroid.tts.Text2Speech</code> class. This follows an optimization algorithm. The following is the steps followed by it in short:</p>\n<pre>graph LR\n    C{Path Exists}\n    C --&gt;|False| D[Create folder]\n    C --&gt;|True| E{Audio exists}\n    E --&gt;|True| F[Play]\n    E --&gt;|False| G[Download]\n    G --&gt; F\n</pre>\n<p>This algorithm is implemented to prevent the download of Audio files on each request by the sugaroid bot.</p>\n<h2>Memory</h2>\n<p>The Sugaroid bot has been designed to provide an acceptable answer and the author had been focusing on refining the response by the bot more and more better. However this has resulted in bad PEP practices and dis allocated memory modules.</p>\n<table>\n<thead>\n<tr>\n<th>Time</th>\n<th>Memory (KB)</th>\n<th>Memory (MB)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Initial Loading</td>\n<td>83500 KB</td>\n<td>83.5 MB</td>\n</tr>\n<tr>\n<td>Pause after loading</td>\n<td>173800 KB</td>\n<td>173.8 MB</td>\n</tr>\n<tr>\n<td>First Question (Hello)</td>\n<td>266500 KB</td>\n<td>266.5 MB</td>\n</tr>\n<tr>\n<td>Second Question (Hey)</td>\n<td>287500 KB</td>\n<td>287.5 MB</td>\n</tr>\n<tr>\n<td>Third Question (Emotion)</td>\n<td>289500 KB</td>\n<td>289.5 MB</td>\n</tr>\n<tr>\n<td>Fourth Question (Emotion)</td>\n<td>289950 KB</td>\n<td>290 MB</td>\n</tr></tbody></table>\n<p>This is because, a lot of unnecessary objects have been created in the memory. This should be removed before the release of <code>sugaroid</code> version 1.0</p>\n<h3>Update v 0.7</h3>\n<p>The unnecessary <code>spaCy</code> tokenizers were forced to be implemented into a single function called <code>sugaroid.sugaroid.SugaroidStatement</code>  which calculates the <code>spacy.nlp.Doc</code> on each object initialization. All the rest of the statement tokenizers were replaced by the base class usage. This prevents the recalculation of the similarity and tokens for each adapter. However, the number of adapters have increased considerably. The net memory decrease cannot be plotted, nevertheless. On the addition of each Adapter, the average RAM increases logarithmically as far as 1% of the total RAM used. This increases exponentially until the bases state where the coverage of sugaroid has been achieved to be above 75% and all the adapters have been significantly used to process at least 1 statement.</p>\n<h2>CPU Usage</h2>\n<p>The Sugaroid bot does not have significant CPU usage. Tested on Linux Manjaro running with 1.8 GHz with other applications running did not affect system stability.</p>\n<h2>Adapters</h2>\n<p>The brain of sugaroid relies in the modules it uses. Sugaroid uses many modules to process statements called <code>Adapters</code> to process statements. Each statement is checked against two functions <code>LogicAdapter.can_process()</code> and <code>LogicAdapter.process()</code>.  <code>LogicAdapter.can_process()</code> gives a boolean response if the statement can or cannot be processed. If the statement can be processed, <code>LogicAdapter.process()</code> is called.</p>\n<p>As of Sugaroid <code>v0.7</code>, it has:</p>\n<ul>\n<li>BoolAdapter: Processes Boolean based answers</li>\n<li>AkinatorAdapter: Adapter which ports the wrapper of the Akinator game to Sugaroid</li>\n<li>HangmanAdapter: Plays hangman with you</li>\n<li>OrAdapter: Selects a random operand of the provided statement</li>\n<li>OkayAdapter: Handles statements with a plain old okay</li>\n<li>ByeAdapter: Destroys Sugaroid on bye</li>\n<li>TimeAdapter: Provides time and time related functions except time conversion</li>\n<li>CurrencyAdapter: Gives a random response, because Sugaroid tries not to say I don't know</li>\n<li>LearnAdapter: a specific adapter for learning responses</li>\n<li>TriviaAdapter: Plays a short game of trivia</li>\n<li>WhoAdapter: Handles statements with 'who' as one of the tokens</li>\n<li>NewsAdapter: Ports the SugaroidNews Wrapper for easier access by the SugaroidChatbot Class</li>\n<li>JokeAdapter: Gets a random joke from the Chuck Norris Database</li>\n<li>PlayAdapter: [DEPRECATED] Plays a game on desktops only</li>\n<li>CanAdapter: Processes statements which features a Modal question (can, may)</li>\n<li>BecauseAdapter: Processes statements which starts with Because or gives a reason</li>\n<li>ReReverseAdapter: Processes statements featuring conversational flow. It scans the previous statements\nand takes a cosine similarity of the statemnts, and TFiD Vector cross product to get\nthe most probable answer</li>\n<li>ReverseAdapter: A random adapter. Top Secret</li>\n<li>MyNameAdapter: Handles sentences featuring 'my' and 'name'</li>\n<li>MeAdapter: Processes the statements showing possessive</li>\n<li>AboutAdapter: Defines the personality of sugaroid</li>\n<li>WikiAdapter: Handles Wikipedia based questions\nDoLikeAdapter: Handles likes of Sugaroid\nFeelAdapter: Handles sentences containing the word feel\nDoLikeAdapter: Handles likes of Sugaroid\nDoAdapter: Processes statements beginning with 'Do' and 'know'\nEmotionAdapter: Handles positive and negative emotional statements\nDisAdapter: A complex algorithm sorting the words beginning with negative based on the probability.\nand achieving a similar confidence ratio of the word percentage.\nThe DisAdapter keeps the confidence below 0.5 so that the BestAdapter may find some\nother answer similar to\nTwoWordAdapter: Hanfles sentences having two wrods\nOneWordAdapter: Logical adapter for processing data with one words\nDebugAdapter: Internal Admin feature to debug Sugaroid statements\nWhyWhenAdapter: Processes wh-adverbs\nReaderAdapter: Logical adapter for processing data with one words\nImitateAdapter: Handles statements involving imitations of some sentences\nFunAdapter: Gives a random response, because Sugaroid tries not to say I don't know\nUnitConversion: The UnitConversion logic adapter parse inputs to convert values</li>\n</ul>\n\n          </div>"}, "last_serial": 6968371, "releases": {"0.1": [{"comment_text": "", "digests": {"md5": "55f6dd9bc34e21447602ad619a06b864", "sha256": "be36ef30b1f1571dafe84fb8e9023cad372bd8cb20076881cfc0db5b88a31177"}, "downloads": -1, "filename": "sugaroid-0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "55f6dd9bc34e21447602ad619a06b864", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 47015, "upload_time": "2020-02-27T10:06:02", "upload_time_iso_8601": "2020-02-27T10:06:02.183044Z", "url": "https://files.pythonhosted.org/packages/ee/6d/e47522de911a95596b49bef0f3cfdeac981109f45a554e938779618e9de9/sugaroid-0.1-py3-none-any.whl", "yanked": false}], "0.1.0.1": [{"comment_text": "", "digests": {"md5": "91862156c5ad995a729249b93b7c68fe", "sha256": "ae554c68efa390679e7a71273a00a026ad81f869f0c2c6f97375e338f6eb80de"}, "downloads": -1, "filename": "sugaroid-0.1.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "91862156c5ad995a729249b93b7c68fe", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 47489, "upload_time": "2020-02-27T10:51:51", "upload_time_iso_8601": "2020-02-27T10:51:51.231065Z", "url": "https://files.pythonhosted.org/packages/2e/5b/9e781b187689f345f45227b484e4c3b58cf4a0a15c2ed41fecdafe8b8e13/sugaroid-0.1.0.1-py3-none-any.whl", "yanked": false}], "0.1.0.2": [{"comment_text": "", "digests": {"md5": "aa9d126900a1c5b12000e152774e13f3", "sha256": "cbdd94405ef139369b936d8f7cbaad33ac62103e20e175b5ffd8709ac21aadfb"}, "downloads": -1, "filename": "sugaroid-0.1.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "aa9d126900a1c5b12000e152774e13f3", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 47500, "upload_time": "2020-02-27T10:54:09", "upload_time_iso_8601": "2020-02-27T10:54:09.623988Z", "url": "https://files.pythonhosted.org/packages/a5/ca/63ae7e352c2120be650b34da2b62ddda7894be8e8d56a2356687f48c3a95/sugaroid-0.1.0.2-py3-none-any.whl", "yanked": false}], "0.1.0.6": [{"comment_text": "", "digests": {"md5": "73a7d9dc67128e798c1b7a03c99c6bc0", "sha256": "ec91a5fcb5b0baacc20e7928bcca5c4428c8e3afe1ca133179653347e9c821a8"}, "downloads": -1, "filename": "sugaroid-0.1.0.6-py3-none-any.whl", "has_sig": false, "md5_digest": "73a7d9dc67128e798c1b7a03c99c6bc0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 47525, "upload_time": "2020-02-27T11:39:30", "upload_time_iso_8601": "2020-02-27T11:39:30.448748Z", "url": "https://files.pythonhosted.org/packages/48/b5/fa0cb069578e9a326bcb3efe484af4050126bb9be40598a88e9b4f0c073a/sugaroid-0.1.0.6-py3-none-any.whl", "yanked": false}], "0.2": [{"comment_text": "", "digests": {"md5": "c27903a64eb11a05af7fe7b62e1b3309", "sha256": "5a17bca32f8c38067592001132354218399d1b5f25a2f1f7c7b5b93e33f92cf4"}, "downloads": -1, "filename": "sugaroid-0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "c27903a64eb11a05af7fe7b62e1b3309", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 55672, "upload_time": "2020-02-28T19:12:36", "upload_time_iso_8601": "2020-02-28T19:12:36.211223Z", "url": "https://files.pythonhosted.org/packages/be/d9/7cf2870c7834f9df7649a1b198f75accb9d14a7b8c63add89033e0c76fa9/sugaroid-0.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f49f4fc0d31ecd5fd9cbf3f51fb83101", "sha256": "a1dd940d755e30c03288e58e70732d5b7558ca717c5d10ea5b72d67bbe7b99b9"}, "downloads": -1, "filename": "sugaroid-0.2.tar.gz", "has_sig": false, "md5_digest": "f49f4fc0d31ecd5fd9cbf3f51fb83101", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 15061, "upload_time": "2020-02-28T19:12:37", "upload_time_iso_8601": "2020-02-28T19:12:37.888412Z", "url": "https://files.pythonhosted.org/packages/63/18/e510baa7819a69b90cf9113ec258c9cc55d684d73b640bc341bff0839206/sugaroid-0.2.tar.gz", "yanked": false}], "0.2.1": [{"comment_text": "", "digests": {"md5": "1fe576f17d3351606536ca85ccc5dce3", "sha256": "9da10a8a069796427de11164300d1b50620aab5b56bf41091ae629e5998bcbd4"}, "downloads": -1, "filename": "sugaroid-0.2.1-py3-none-any.whl", "has_sig": false, "md5_digest": "1fe576f17d3351606536ca85ccc5dce3", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 64492, "upload_time": "2020-03-03T16:15:38", "upload_time_iso_8601": "2020-03-03T16:15:38.636053Z", "url": "https://files.pythonhosted.org/packages/54/7c/2081be919fb443b7ce3bfe25974120c5273a56e5c55d1fed3470cdec343b/sugaroid-0.2.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "13839804f29aa0fc4d0b4f318412eb42", "sha256": "add2956e1d2fed8de84802c68cdf0f5222098fe6c4019f26ee64da82b2c07f29"}, "downloads": -1, "filename": "sugaroid-0.2.1.tar.gz", "has_sig": false, "md5_digest": "13839804f29aa0fc4d0b4f318412eb42", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 16173, "upload_time": "2020-03-03T16:15:40", "upload_time_iso_8601": "2020-03-03T16:15:40.493602Z", "url": "https://files.pythonhosted.org/packages/b0/a4/5b6f5f65b86af6da42e5d35bc002b845d39c59d3cba2a0522edba979b689/sugaroid-0.2.1.tar.gz", "yanked": false}], "0.3.0": [{"comment_text": "", "digests": {"md5": "425c3f5075c9cb387356d6dd603558f0", "sha256": "d43a3061803e12058278630b104fe8170a73e2b767e790296bb8abbc13e6cb16"}, "downloads": -1, "filename": "sugaroid-0.3.0-py3-none-any.whl", "has_sig": false, "md5_digest": "425c3f5075c9cb387356d6dd603558f0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 5694789, "upload_time": "2020-03-14T15:00:37", "upload_time_iso_8601": "2020-03-14T15:00:37.167228Z", "url": "https://files.pythonhosted.org/packages/25/3c/6a104c49b116559a79fcc68dc57ad5c1b10636732b668710215152f38783/sugaroid-0.3.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4b81caf04bdc45a7fcec32e22e075d54", "sha256": "73982b5ccd189db3313045c10531a88d491ab3affebf0a76f0e62cf309675c73"}, "downloads": -1, "filename": "sugaroid-0.3.0.tar.gz", "has_sig": false, "md5_digest": "4b81caf04bdc45a7fcec32e22e075d54", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 17312, "upload_time": "2020-03-14T15:00:38", "upload_time_iso_8601": "2020-03-14T15:00:38.994626Z", "url": "https://files.pythonhosted.org/packages/31/1e/4c32b5202904198f69299686e791ca4a6b726963831f951fd7dc3fe8e7c6/sugaroid-0.3.0.tar.gz", "yanked": false}], "0.5.1.post50.dev0": [{"comment_text": "", "digests": {"md5": "7a3eb3f72eb25f20342474bb05206c49", "sha256": "86daa795eb128780af86c052afee77c241d6b9ed503f8d4637653aeb17d69011"}, "downloads": -1, "filename": "sugaroid-0.5.1.post50.dev0-py3-none-any.whl", "has_sig": false, "md5_digest": "7a3eb3f72eb25f20342474bb05206c49", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 8001586, "upload_time": "2020-04-03T13:04:08", "upload_time_iso_8601": "2020-04-03T13:04:08.633126Z", "url": "https://files.pythonhosted.org/packages/ca/d6/b80b6a164dae104b11036e7c3129695fafbc0b25f285edeb837fe71d5b7a/sugaroid-0.5.1.post50.dev0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "54eb07368113b9f5f71f5e97f473bfda", "sha256": "688f2b57d07779dc9f859bf3da24088d4327498227494eb4a2a0c125ab0c57aa"}, "downloads": -1, "filename": "sugaroid-0.5.1.post50.dev0.tar.gz", "has_sig": false, "md5_digest": "54eb07368113b9f5f71f5e97f473bfda", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 24144, "upload_time": "2020-04-03T13:04:10", "upload_time_iso_8601": "2020-04-03T13:04:10.725274Z", "url": "https://files.pythonhosted.org/packages/17/c6/29f7abb381428a72b06fdfecfa5538a691225252d28024745ae429f17f77/sugaroid-0.5.1.post50.dev0.tar.gz", "yanked": false}], "0.5.2": [{"comment_text": "", "digests": {"md5": "b75ca2ee0cf333a8bf0aaf380c81744a", "sha256": "552ecf24252b83cdc27caecee4afd0d13cf15c71ed5b9b3db3c98253b524a2ac"}, "downloads": -1, "filename": "sugaroid-0.5.2-py3-none-any.whl", "has_sig": false, "md5_digest": "b75ca2ee0cf333a8bf0aaf380c81744a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 8255585, "upload_time": "2020-04-06T19:32:22", "upload_time_iso_8601": "2020-04-06T19:32:22.734182Z", "url": "https://files.pythonhosted.org/packages/1e/bc/2e98fca70ded65999ab535e73e2b38fb253a2aeaee66c3db9f8126ca87e6/sugaroid-0.5.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "cbf82de4ecab3169b3d1c84411f37e38", "sha256": "081da03f9032a81e3bd9c494f524dd62acfc49ad5b7917c4d96f1eee6d691338"}, "downloads": -1, "filename": "sugaroid-0.5.2.tar.gz", "has_sig": false, "md5_digest": "cbf82de4ecab3169b3d1c84411f37e38", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23958, "upload_time": "2020-04-06T19:32:29", "upload_time_iso_8601": "2020-04-06T19:32:29.190433Z", "url": "https://files.pythonhosted.org/packages/36/51/086d6d9e05ba1f5607c9e41d2d395b6ab9d44f85317ccdbfcd5027700caf/sugaroid-0.5.2.tar.gz", "yanked": false}], "0.5.2.post1.dev0": [{"comment_text": "", "digests": {"md5": "afd56c538a8c6d628b7a17ec8d9d7163", "sha256": "2349afa111f2f33a78be7277f1e8481ed8439a902dce3f51471e04a72d3b3b0a"}, "downloads": -1, "filename": "sugaroid-0.5.2.post1.dev0-py3-none-any.whl", "has_sig": false, "md5_digest": "afd56c538a8c6d628b7a17ec8d9d7163", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 8255738, "upload_time": "2020-04-07T10:13:57", "upload_time_iso_8601": "2020-04-07T10:13:57.493520Z", "url": "https://files.pythonhosted.org/packages/bc/c1/91cd999199da5f13871e66bb8ab99a1f6e8f7044a8d53d20fc16f3d37d41/sugaroid-0.5.2.post1.dev0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "bf38f1e2d55ceba03123bac17a98a8d1", "sha256": "fa0189f285a9362e10bd9eb82bcb3e28102f8352064ebc8a9c00e573ea420573"}, "downloads": -1, "filename": "sugaroid-0.5.2.post1.dev0.tar.gz", "has_sig": false, "md5_digest": "bf38f1e2d55ceba03123bac17a98a8d1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23916, "upload_time": "2020-04-07T10:13:59", "upload_time_iso_8601": "2020-04-07T10:13:59.401918Z", "url": "https://files.pythonhosted.org/packages/c1/f7/f980892faf85cefe4be076a6b89749f07d259995ebf00cbd40937a65e53a/sugaroid-0.5.2.post1.dev0.tar.gz", "yanked": false}], "0.6": [{"comment_text": "", "digests": {"md5": "130857778115f46086cd0f256ab6769c", "sha256": "fd1e3332a9f17386bca686fd4003c71fd8c05c0e541d3ce473dcd2543d233ff8"}, "downloads": -1, "filename": "sugaroid-0.6-py3-none-any.whl", "has_sig": false, "md5_digest": "130857778115f46086cd0f256ab6769c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 8255531, "upload_time": "2020-04-07T10:28:51", "upload_time_iso_8601": "2020-04-07T10:28:51.350223Z", "url": "https://files.pythonhosted.org/packages/9d/20/b786e319fb245722ac5d1398b1bcc3f42aff332296fc56f925031c1951e9/sugaroid-0.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0f24919f9e5d95fb1927e18eb519f801", "sha256": "ed2dd041d75f1795543d3c9c411698b86ad673aab07cad422bc67f2950452150"}, "downloads": -1, "filename": "sugaroid-0.6.tar.gz", "has_sig": false, "md5_digest": "0f24919f9e5d95fb1927e18eb519f801", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23889, "upload_time": "2020-04-07T10:28:53", "upload_time_iso_8601": "2020-04-07T10:28:53.739541Z", "url": "https://files.pythonhosted.org/packages/50/02/7d21b4775fd01d802eb8c4f3d6ffa9669a6eda18611d6c6f2e5e7a4006bb/sugaroid-0.6.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "130857778115f46086cd0f256ab6769c", "sha256": "fd1e3332a9f17386bca686fd4003c71fd8c05c0e541d3ce473dcd2543d233ff8"}, "downloads": -1, "filename": "sugaroid-0.6-py3-none-any.whl", "has_sig": false, "md5_digest": "130857778115f46086cd0f256ab6769c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 8255531, "upload_time": "2020-04-07T10:28:51", "upload_time_iso_8601": "2020-04-07T10:28:51.350223Z", "url": "https://files.pythonhosted.org/packages/9d/20/b786e319fb245722ac5d1398b1bcc3f42aff332296fc56f925031c1951e9/sugaroid-0.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0f24919f9e5d95fb1927e18eb519f801", "sha256": "ed2dd041d75f1795543d3c9c411698b86ad673aab07cad422bc67f2950452150"}, "downloads": -1, "filename": "sugaroid-0.6.tar.gz", "has_sig": false, "md5_digest": "0f24919f9e5d95fb1927e18eb519f801", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23889, "upload_time": "2020-04-07T10:28:53", "upload_time_iso_8601": "2020-04-07T10:28:53.739541Z", "url": "https://files.pythonhosted.org/packages/50/02/7d21b4775fd01d802eb8c4f3d6ffa9669a6eda18611d6c6f2e5e7a4006bb/sugaroid-0.6.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:00:30 2020"}