{"info": {"author": "James Diffenderfer", "author_email": "jdiffen1@ufl.edu", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Intended Audience :: Science/Research", "License :: OSI Approved :: GNU General Public License v2 (GPLv2)", "Operating System :: POSIX :: Linux", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Topic :: Scientific/Engineering"], "description": "# SuiteOPT\nSuiteOPT is designed to solve optimization problems of the form\n\n    min f(x)    subject to    bl <= Ax <= bu, lo <= x <= hi\n\nwhere `x` is a vector of length `ncol`, `f(x)` is a smooth (i.e., continuously differentiable) real-valued function, `A` is a real-valued `nrow` by `ncol` matrix, `bl` and `bu` are real-valued vectors of length `nrow`, and `lo` and `hi` are real-valued vectors of length `ncol`. In problems where `f(x)` is quadratic or linear, the user can provide special evaluation routines and/or vectors for optimized performance. Additionally, SuiteOPT can solve unconstrained or partially constrained problems by omitting any of the constraints when specifying the problem data.\n\n## Installation\nSuiteOPT for Python has been tested with Python versions 2.7, 3.5, 3.6, and 3.7 on Ubuntu. SuiteOPT for python can be installed using the package manager [**pip**](https://pip.pypa.io/en/stable/) which will build all of the required dynamic libraries for SuiteOPT with Python. As part of the installation routine, SuiteOPT for Python will build the required dynamic libraries for the C/C++ packages [**SuiteSparse**](https://github.com/jluttine/suitesparse) and [**SuiteOPT**](http://users.clas.ufl.edu/hager/papers/Software/). The dynamic libraries for the C/C++ packages SuiteSparse and SuiteOPT require BLAS and LAPACK. The default installation is configured to use the [**OpenBLAS**](https://www.openblas.net/) library for BLAS and LAPACK if installed on the user's system, however, users can provide desired libraries for BLAS and LAPACK using custom installation options.\n\n#### 1. Installing Dependencies\nSeveral dependencies are required before calling the `pip install` command to install SuiteOPT for Python. These dependencies are outlined below.\n##### 1.1 Python Dependencies: Setuptools, Numpy, and Scipy\nInside the setup.py file used to install SuiteOPT, the Python packages [**setuptools**](https://pypi.org/project/setuptools/) and [**numpy**](https://numpy.org/) are imported to complete the installation and the package and [**scipy**](https://www.scipy.org/) is required for SuiteOPT to run. As a result, users missing one or more of these packages when installing SuiteOPT will encounter an error. These packages can be installed using [**pip**](https://pip.pypa.io/en/stable/) by entering any of the following commands into the terminal to install the packages missing on the user's system:\n\n```sh\n$ pip install setuptools\n$ pip install numpy\n$ pip install scipy\n```\n\nNote: Numpy version >= 1.16.x should be installed as errors have been observed with previous versions. For users with Python 2.7 we have found that Scipy version = 1.2.2 works successfully while users with Python version 3.5 or greater can use Scipy 1.3.1 as it is compatible with SuiteOPT. Other versions may work as well but no errors with SuiteOPT involving Numpy or Scipy have occurred when using these versions.\n\n##### 1.2 SuiteOPT and SuiteSparse Dependencies: BLAS, LAPACK, and CMake\nUsers with BLAS, LAPACK, and CMake already available on their system may proceed to step 2.\n\nUsers without BLAS and LAPACK on should choose desired BLAS and LAPACK libraries suitable for their system. SuiteOPT is configured to use [**OpenBLAS**](https://www.openblas.net/) by default but can be customized at installation to use other BLAS and LAPACK configurations. SuiteOPT has been successfully tested with [**OpenBLAS**](https://www.openblas.net/) and [**Intel's MKL BLAS and LAPACK**](https://software.intel.com/en-us/mkl/choose-download). Note: Users should ensure that all dependencies required by their version of BLAS and LAPACK are installed prior to proceeding to the following step.\n\nUsers without [**CMake**](https://cmake.org/) should install it on their system before proceeding to the following step. CMake is required to build the dynamic library for [**METIS**](http://glaros.dtc.umn.edu/gkhome/metis/metis/overview) which is used by SuiteSparse.\n\n#### 2. Installing SuiteOPT for Python\nIf [**OpenBLAS**](https://www.openblas.net/) is installed on your system and the directory containing `libopenblas` and `liblapack` is located in a directory found during compilation by default, then follow the instructions for **Default Installation**. Otherwise, follow the instructions for **Custom Installation**.\n\n- **Default Installation**\n    Type the following command into the terminal window to install SuiteOPT for Python with default BLAS and LAPACK configurations:\n\n    ```sh\n    $ pip install SuiteOPT --user\n    ```\n\n    Note: If any errors involving BLAS and LAPACK are raised during the installation routine then it is likely that the installer was unable to identify information necessary for using the user's BLAS and LAPACK libraries when building the dynamic libraries for the C/C++ packages SuiteSparse and SuiteOPT. Users experiencing this problem should follow the instructions in **Custom Installation**.\n\n- **Custom Installation**\n    Users wishing to use custom BLAS and LAPACK configurations for SuiteOPT can pass them to pip during the installation procedure. There are two ways to provide custom BLAS and LAPACK configurations both of which are outlined below.\n\n    **Option 1: Pass File Containing BLAS, LAPACK, and LDLIBS**.\n    With this option, users can create a file with variables `BLAS`, `LAPACK`, and `LDLIBS` that specify their BLAS and LAPACK libraries and the location on these libraries on their system, LDLIBS. The file should have one line for each variable. An example configuration for Intel's MKL BLAS and LAPACK is provided below.\n\n    **Example: Custom Configuration File Using Intel's MKL BLAS and LAPACK.**\n    ```mk\n    # Contents of user created file 'mklconfig.txt'\n    BLAS = -lmkl_intel_lp64 -lmkl_intel_thread -lmkl_core -liomp5 -lpthread -lm\n    LAPACK = -lmkl_lapack95_lp64\n    LDLIBS = -L/opt/intel/mkl/lib/intel64 -L/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64\n    ```\n\n  Alternatively, the user can omit the `LDLIBS` variable if either the location of the BLAS and LAPACK libraries is known by the compiler or the full path to each library is included. As an example, a configuration for OpenBLAS using the alternative convention is provided below.\n\n    **Example: Custom Configuration File Using OpenBLAS.**\n    ```mk\n    # Contents of user created file 'openblasconfig.txt'\n    BLAS = /full/path/to/libopenblas.so -lgfortran -lpthread\n    LAPACK = /full/path/to/liblapack.a\n    ```\n\n  Once the user's configuration for BLAS and LAPACK is saved to a file of their choice, say `myconfig.txt`, the full path to the file can be provided as an `--install-option` during the pip installation routine for SuiteOPT by entering the following command into the terminal:\n\n    ```sh\n    $ pip install SuiteOPT --user --install-option=\"--blfile=/full/path/to/myconfig.txt\"\n    ```\n\n  Note: In particular, the `--install-option` is used to set the flag `--blfile` equal to the full path to the user's BLAS and LAPACK configuration file.\n\n    **Option 2: Pass BLAS, LAPACK, and LDLIBS as Individual `--install-option` Flags**.\n    With this option, the user can specify their BLAS and LAPACK libraries and the location(s) of these libraries directly as part of the pip install command by using `--install-option` flags to set the `--blas`, `--lapack`, and `--ldlibs` flags equal to the user's BLAS libraries, LAPACK libraries, and the absolute path location(s) of their BLAS and LAPACK libraries, respectively. Examples using various BLAS and LAPACK configurations are provided below.\n\n    **Example: Custom Configuration Using Intel's MKL BLAS and LAPACK.**\n    ```sh\n    $ pip install SuiteOPT --user \\\n    --install-option=\"--blas=-lmkl_intel_lp64 -lmkl_intel_thread -lmkl_core -liomp5 -lpthread -lm\" \\\n    --install-option=\"--lapack=-lmkl_lapack95_lp64\" \\\n    --install-option=\"--ldlibs=-L/opt/intel/mkl/lib/intel64 -L/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64\"\n    ```\n    **Example: Custom Configuration Using OpenBLAS.**\n    ```sh\n    $ pip install SuiteOPT --user \\\n    --install-option=\"--blas=-lopenblas -lgfortran -lpthread\" \\\n    --install-option=\"--lapack=-llapack\" \\\n    --install-option=\"--ldlibs=-L/full/path/to/openblas/directory\"\n    ```\n\n#### Notes on Troubleshooting Issues with BLAS and LAPACK\nSteps 0 -- 2 should be sufficient for installing SuiteOPT, however if errors are occurring at runtime involving BLAS and/or LAPACK please refer to this section to check for potential solutions to your problems. During runtime, SuiteOPT for Python will require the user's BLAS and LAPACK libraries and the C/C++ dynamic libraries for SuiteSparse and SuiteOPT compiled during step 2 of the installation. The installation routine in the `setup.py` file is designed to use the provided BLAS and LAPACK information to prevent runtime errors involving BLAS and LAPACK from occurring. If any of these libraries cannot be located runtime errors may occur when using SuiteOPT for Python. This step outlines how to set certain environment variables so that the necessary libraries can be found at runtime.\n\nFor users encountering runtime errors involving the libraries `libpasa`, `libpproj`, `libcg_descent`, `libnapheap`, `libamd`, `libcamd`, `libcolamd`, `libccolamd`, `libcholmod`, or `libmetis`, see 1. For users encountering runtime errors involving BLAS or LAPACK libraries see 2.\n\n1. **Add SuiteSparse and SuiteOPT dynamic library directories to `$LD_LIBRARY_PATH` environment variable.**\n    Directories containing the dynamic libraries built by SuiteOPT and SuiteSparse need to be found in the user's `$LD_LIBRARY_PATH`. During installation, the required dynamic libraries for SuiteOPT and SuiteSparse are saved in directories called `SuiteOPT-libraries` and `SuiteSparse-libraries`, respectively, and should be located where python saves installed package information. The full path to these directories should be added to the `$LD_LIBRARY_PATH` environment variable. Examples are provided below for various shell configurations.\n\n    **Example: Bourne/bash shell**\n    ```bash\n    export LD_LIBRARY_PATH=\"${LD_LIBRARY_PATH}:/full/path/to/SuiteOPT-libraries\"\n    export LD_LIBRARY_PATH=\"${LD_LIBRARY_PATH}:/full/path/to/SuiteSparse-libraries\"\n    ```\n\n    **Example: TCSH/CSH shell**\n    ```sh\n    setenv LD_LIBRARY_PATH ${LD_LIBRARY_PATH}:/full/path/to/SuiteOPT-libraries\n    setenv LD_LIBRARY_PATH ${LD_LIBRARY_PATH}:/full/path/to/SuiteSparse-libraries\n    ```\n\n2. **Add BLAS and LAPACK dynamic library directories to `$LD_LIBRARY_PATH` environment variable.**\n    Directories containing the user's BLAS and LAPACK dynamic libraries also need to be found in the user's `$LD_LIBRARY_PATH`. Below we provide information and examples for two popular versions of BLAS and LAPACK that should translate to other BLAS and LAPACK configurations.\n\n    **Users with Openblas.** When using OpenBLAS, users should be able to bypass this step as it is common for the directory containing `libopenblas` and `liblapack` to be contained in a subdirectory of `/usr/lib` (on Linux) and, hence, located in a directory that is checked by default for dynamic libraries. However, if an error is encountered indicating that OpenBLAS cannot be found, then add the absolute path to the directory containing `libopenblas` and `liblapack` to the `$LD_LIBRARY_PATH` environment variable. Examples are provided below for various shell and BLAS/LAPACK configurations.\n\n    **Example: Bourne/bash shell using Openblas**\n    ```bash\n    export LD_LIBRARY_PATH=\"${LD_LIBRARY_PATH}:/full/path/to/openblas/dir\"\n    ```\n\n    **Example: TCSH/CSH shell using Openblas**\n    ```bash\n    setenv LD_LIBRARY_PATH ${LD_LIBRARY_PATH}:/full/path/to/openblas/dir\n    ```\n\n  **Users with Intel's MKL BLAS and LAPACK.** It is not common for the directory containing [**Intel's MKL BLAS and LAPACK**](https://software.intel.com/en-us/mkl/choose-download) to be installed in a directory that is checked by default for dynamic libraries (at least on Linux operating systems). Hence, the absolute path to the directory containing Intel's MKL BLAS and LAPACK dynamic libraries should be added to the `$LD_LIBRARY_PATH` environment variable. Additionally, it is a common requirement to link to the library `libiomp5` included with the Intel MKL package when using Intel's MKL BLAS and LAPACK and, thus, the user should also add the full path to the directory containing the `libiomp5` dynamic library to the `$LD_LIBRARY_PATH` environment variable.\n\n  Additionally, users should add MKL dynamic libraries to the `$LD_PRELOAD` environment variable. When the MKL dynamic libraries are not added to the `$LD_PRELOAD` environment variable it has been observed that either (a) runtime errors or (b) poor performance of SuiteOPT for Python occurs. Some information outlining the prescribed solution included here was found in [**Intel's Forum on MKL**](https://software.intel.com/en-us/forums/intel-math-kernel-library/topic/748309). Examples are provided below for various shell configurations but note that the required dynamic libraries may vary from system to system.\n\n  **Example: Bourne/bash shell using Intel's MKL BLAS and LAPACK**\n  ```bash\n  export LD_LIBRARY_PATH=\"${LD_LIBRARY_PATH}:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64\"\n  export LD_LIBRARY_PATH=\"${LD_LIBRARY_PATH}:/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64\"\n  export LD_PRELOAD=\"${LD_PRELOAD}:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_def.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_avx2.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_intel_lp64.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_intel_thread.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_core.so:/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64/libiomp5.so\"\n  ```\n\n  **Example: TCSH/CSH shell using Intel's MKL BLAS and LAPACK**\n  ```bash\n  setenv LD_LIBRARY_PATH ${LD_LIBRARY_PATH}:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64\n  setenv LD_LIBRARY_PATH ${LD_LIBRARY_PATH}:/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64\n  setenv LD_PRELOAD ${LD_PRELOAD}:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_def.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_avx2.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_intel_lp64.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_intel_thread.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_core.so:/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64/libiomp5.so\n  ```\n\n## Usage\nWe now outline how to import the SuiteOPT module, set up a problem to solve with SuiteOPT, how to solve a problem with SuiteOPT, how to view problem statistics with SuiteOPT, and conclude with references to several demo files illustrating how to solve various problem configurations using SuiteOPT. Throughout the usage section, we provide sample blocks of code illustrating how to work with each component of SuiteOPT.\n#### Importing SuiteOPT module\nThe SuiteOPT module can be imported within python by using the following command in python:\n```python\nimport SuiteOPT\n```\n#### `SuiteOPT.problem` class\nProblem data is expected to be provided as an instance of the class `SuiteOPT.problem`. The attributes of the `SuiteOPT.problem` class are listed below. Note that each attribute of the `SuiteOPT.problem` class that is an array must be provided as a [**numpy**](https://numpy.org) array.\n- `ncol`      : dimension of initial guess x (also, number of columns in constraint matrix A)\n- `nrow`      : number of rows in matrix A\n- `x`         : Initial guess for primal variable (numpy array of length ncol)\n- `lo`        : lower bounds for x (numpy array of length ncol)\n- `hi`        : upper bounds for x (numpy array of length ncol)\n- `A`         : constraint matrix (numpy matrix or scipy.sparse.csc_matrix of dimension nrow by ncol)\n- `bl`        : lower bounds for Ax (numpy array of length nrow)\n- `bu`        : upper bounds for Ax (numpy array of length nrow)\n- `pylambda`  : multiplier for Ax (dual variable; numpy array of length nrow)\n- `y`         : Project y onto polyhedron (if solving polyhedral projection problem; numpy array of length ncol)\n- `a`         : Napsack constraint vector bl <= a'x <= bu (if solving napsack problem; numpy array of length ncol)\n- `d`         : Diagonal of hessian (if solving napsack problem; numpy array of length nrow)\n- `c`         : Linear term in objective function (if using Quadratic or Linear mode)\n- `objective` : Objective function (Python function)\n- `gradient`  : Gradient of the objective function (Python function)\n- `objgrad`   : Objective function and its gradient (Python function)\n- `hprod`     : Product of objective hessian times vector (if using quadratic mode; Python function)\n- `cg_hprod`  : Product of objective hessian times vector (unconstrained problem in quadratic mode; Python function)\n- `parm`      : Custom `SuiteOPT.solve()` parameter values (Python dict; keys = parm names, values = parm values)\n- `stat`      : Problem statistics after solving problem (Python dict; keys = stat names, values = stat values)\n\n##### Initializing `SuiteOPT.problem` class\nTo initialize an instance of the class containing the problem data, for example, call\n```python\nproblem = SuiteOPT.problem(ncol, nrow)\n```\nIf the problem has no matrix `A` then the value for `nrow` can be omitted and it will be initialized to zero. Alternatively, the values for `ncol` and `nrow` can be omitted upon initialization and they will be set to zero.\n\n##### Setting problem data\n**Initial Guess.** If the user wishes to provide an initial guess for the primal (decision) variable then the attribute `x` should be updated after initializing an instance of the `SuiteOPT.problem` class. If the user wishes to provide an initial guess for the dual variable (KKT multiplier) then the attribute `pylambda` should be updated after initializing an instance of the `SuiteOPT.problem` class.\n\n```python\n# Suppose that x and pylambda have been set to desired numpy arrays\nproblem.x  = x   # Initial guess for solution\nproblem.pylambda  = pylambda   # Initial guess for dual variable\n```\n\n**Bound Constraints.** If the user wishes to enforce the constraint `lo <= x` then `lo` is required. If the user wishes to enforce the constraint `x <= hi` then `hi` is required. If `lo = hi` for the user's problem, then `lo` and `hi` must both be provided with `lo = hi`. If `lo` is not provided then it will be assumed that there is no lower bound on `x`. Similarly, if `hi` is not provided then it will be assumed that there is no upper bound on `x`.\n\n```python\n# Suppose that lo and hi have been set to desired numpy arrays\nproblem.lo = lo  # Lower bound on primal variable,   lo <= x\nproblem.hi = hi  # Upper bound on primal variable,   x <= hi\n```\n\n**Polyhedral Constraints.** If the user wishes to enforce the constraint `bl <= Ax <= bu` then `A` and at least one of the vectors `bl` and `bu` are required. If `bl` is not provided then it will be assumed that there is no lower bound on `Ax`. Similarly, if `bu` is not provided then it will be assumed that there is no upper bound on `Ax`. If `bl = bu` in your problem, both `bl` and `bu` must be provided as the same vector. If the user does not wish to enforce this constraint then `A`, `bl`, and `bu` should not be updated after initializing an instance of the `SuiteOPT.problem` class.\n\n```python\n# Suppose that bl and bl have been set to desired numpy arrays and A set to desired numpy matrix or csc_matrix\nproblem.A  = A   # Linear constraint matrix A,       bl <= Ax <= bu\nproblem.bl = bl  # Lower bound on linear constraint, bl <= Ax\nproblem.bu = bu  # Upper bound on linear constraint, Ax <= bu\n```\n\n**Special Attributes.** The attributes `y`, `a`, `d`, and `c` should only be provided for certain problem formulations. In particular, special implementations are used by SuiteOPT for solving polyhedral projection, separable convex quadratic knapsack, and unconstrained problems. More information on these problem formulations and how to solve them efficiently using SuiteOPT can be found in the **Special Modes and Problem Formulations in SuiteOPT** subsection.\n\n**Objective Function.** As a general rule for determining which function attributes in `SuiteOPT.problem` are necessary for solving a problem, ensure that the attributes provided in `SuiteOPT.problem` are sufficient for computing **(a) the objective function** and **(b) the gradient of the objective function**. For straightforward use note that it is always sufficient to provide the attributes `SuiteOPT.problem.objective` and `SuiteOPT.problem.gradient`. However, alternative choices of the function attributes can be used depending on the type of problem in order to obtain improved performance. More detailed information on which attributes of `SuiteOPT.problem` are sufficient and optimized for solving problems of various types (nonlinear objective, quadratic objective, ...) can be found in the **Special Modes and Problem Formulations in SuiteOPT** subsection.\n\n**Customizing `SuiteOPT.solve()` Parameters.** If the user wishes to provide custom parameter values for the solver `SuiteOPT.solve()`, the user can modify the values of each parameter by name by inserting it into the `SuiteOPT.problem.parm` dictionary. To see a list of all parameters and their default values, the user can call the method `SuiteOPT.print_parm()`. The following calls to this function can be used to view full or partial lists of customizable parameters within SuiteOPT:\n\n    SuiteOPT.print_parm(\"all\")     : List of all default parameters values\n    SuiteOPT.print_parm(\"parm\")    : List of default pasa parameter values\n    SuiteOPT.print_parm(\"pproj\")   : List of default pproj parameter values\n    SuiteOPT.print_parm(\"cg\")      : List of default cg parameter values\n    SuiteOPT.print_parm(\"napheap\") : List of default napheap parameter values\n\nOnce the desired parameters have been identified, they can be modified by inserting them into the `SuiteOPT.problem.parm` dictionary attribute using the parameter name as the key and the desired parameter value as the value.\n```python\n# Suppose we want to set the parameter 'PrintLevel' to be 3 (maximum printing during SuiteOPT)\n# and the stopping tolerance, 'grad_tol' to be 1e-8\nparm = dict(PrintLevel=3, grad_tol=1e-8)\n# Provide custom parameters to instance of SuiteOPT.problem class\nproblem.parm = parm  # custom parameter values (optional)\n```\n\n#### Special Modes and Problem Formulations in SuiteOPT\n\n##### Nonlinear Mode\nHere we outline which functions are required and optional when `f(x)` is a nonlinear cost function.\n\n- Required Functions : `SuiteOPT.problem.objective` and `SuiteOPT.problem.gradient`\n- Optional Function  : `SuiteOPT.problem.objgrad`\n\nNote that `objective` and `gradient` must be functions with one input (vector to evaluate function at) and one output (function/gradient value, respectively). `objgrad` must be a function with one input (vector to evaluate function/gradient at) and two outputs (function value, gradient value). `objgrad` can be provided in instances where values computed during the computation of the objective function can be reused during the computation of the gradient resulting in reduced computation cost by computing the objective and gradient values simultaneously. If the user provides `objgrad` then when SuiteOPT requires updates to both the objective and gradient the `objgrad` function will be used. Otherwise, SuiteOPT will make a call to the `objective` and `gradient` functions.\n\n##### Quadratic Mode\nIf the objective `f(x)` is quadratic, say of the form `f(x) = 0.5 x^T H x + c^T x`, the user should provide a routine, `hprod`, to evaluate the product between the objective Hessian `H` and the nonzero components of a vector `x`, so as to compute `Hx`, and the linear term in the objective, `c`.\n\n- Required Attributes : `SuiteOPT.problem.hprod` and `SuiteOPT.problem.c`\n\nNote that `hprod` must be a function with two inputs and one output. Using the above form for `f(x)`, `hprod` should compute the vector `Hx` given a vector `x` and an array containing the nonzero indices of `x`. In particular, the first input of the function `SuiteOPT.problem.hprod` should be the vector to take the product with, the second input should be a vector containing the indices for which the input vector is nonzero, and the output should be the matrix-vector product.\n\nFor unconstrained problems with quadratic cost functions the user should instead provide `cg_hprod`. `cg_hprod` must be a function with one input, the vector `x` to compute the matrix-vector product with, and one output, the matrix-vector product `Hx`.\n\n##### Linear Mode\nIf the objective `f(x)` is linear, say of the form `f(x) = c^T x`, the user should provide the linear term in the objective, `c`.\n\n- Required Input : `SuiteOPT.problem.c`\n\n##### Polyhedral Projection Problem\nSuiteOPT implements a special routine, called [**PPROJ**](http://users.clas.ufl.edu/hager/papers/CG/pproj.pdf), for solving a polyhedral projection problem of the form\n\n    min  0.5 * || x - y || ** 2    subject to    bl <= Ax <= bu, lo <= x <= hi\n\nwhere `y` is the point to be projected onto the polyhedral set `{x : bl <= Ax <= bu, lo <= x <= hi}`. When solving a problem of this form, it is sufficient to provide the following information to compute the objective and gradient values:\n\n- Required Input : `SuiteOPT.problem.y`\n\n##### Separable Convex Quadratic Knapsack Problem\nSuiteOPT implements a special routine, called [**NAPHEAP**](http://users.clas.ufl.edu/hager/papers/CG/knapsack.pdf), for solving a separable convex quadratic knapsack problem of the form\n\n    min  0.5 * x^T D x - c^T x    subject to    bl <= a^T x <= bu, lo <= x <= hi\n\nwhere `D` is a diagonal matrix with nonnegative diagonal equal to the vector `SuiteOPT.problem.d`, `a` is a vector of length `ncol`, and `bl` and `bu` are scalars. When solving a problem of this form, it is sufficient to provide the following information to compute the objective and gradient values:\n\n- Required Input : `SuiteOPT.problem.d`, `SuiteOPT.problem.c`\n\nAdditionally, instead of providing a constraint matrix `A`, the user should provide a constraint vector as a numpy array in the attribute `SuiteOPT.problem.a`.\n\n##### Unconstrained Problem\nSuiteOPT implements a special routine, called [**CG_DESCENT**](http://users.clas.ufl.edu/hager/papers/CG/cg_code.pdf), for solving unconstrained optimization problems of the form\n\n    min  f(x)    subject to    x in R^n\n\nIn addition to nonlinear mode, quadratic mode can be used to evaluate the objective and gradient for unconstrained problems. Be sure to follow the details in the subsection **Special Modes and Problem Formulations in SuiteOPT: Quadratic Mode** to use quadratic mode with unconstrained problems.\n\n#### `SuiteOPT.solve()` method\n`SuiteOPT.solve()` requires a single input which is an instance of the `SuiteOPT.problem` class and returns a single output argument which is a numpy array containing the problem solution.\n```python\n# Solve problem using SuiteOPT and store solution in xnew\nxnew = SuiteOPT.solve(problem)\n```\n\n#### Problem Statistics\nProblem statistics generated during a run of `SuiteOPT.solve()` are stored in the `SuiteOPT.problem.stats` attribute as a dictionary and can be printed using the method `SuiteOPT.problem.print_stats()`.\n\n### SuiteOPT Examples\nExample files illustrating how to setup an instance of `SuiteOPT.problem`, call `SuiteOPT.solve()`, and print `SuiteOPT.problem.stats` are available in the `Demo` directory at https://github.com/chrundle/python-SuiteOPT. The type of problem and corresponding demo file are listed below:\n\n     Nonlinear Objective : demo.py\n     Quadratic Objective : demoQP.py\n     Linear Objective    : demoLP.py\n\nUsers with the [**pycutest**](https://pypi.org/project/pycutest/) package installed may also run the `demo_cutest.py` file to solve any problem from the [**CUTEst**](https://github.com/ralna/CUTEst/wiki) optimization test suite. When running `demo_cutest.py`, the user will be prompted to enter the name of the problem from the CUTEst test set that they wish to solve using SuiteOPT.\n\n## License\n[**GPLv2**](https://www.gnu.org/licenses/old-licenses/gpl-2.0.en.html)", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/chrundle", "keywords": "optimization", "license": "GPLv2", "maintainer": "", "maintainer_email": "", "name": "SuiteOPT", "package_url": "https://pypi.org/project/SuiteOPT/", "platform": "", "project_url": "https://pypi.org/project/SuiteOPT/", "project_urls": {"Homepage": "https://github.com/chrundle"}, "release_url": "https://pypi.org/project/SuiteOPT/1.0.3/", "requires_dist": null, "requires_python": "", "summary": "Python Wrapper for Optimization Software Suite SuiteOPT", "version": "1.0.3", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>SuiteOPT</h1>\n<p>SuiteOPT is designed to solve optimization problems of the form</p>\n<pre><code>min f(x)    subject to    bl &lt;= Ax &lt;= bu, lo &lt;= x &lt;= hi\n</code></pre>\n<p>where <code>x</code> is a vector of length <code>ncol</code>, <code>f(x)</code> is a smooth (i.e., continuously differentiable) real-valued function, <code>A</code> is a real-valued <code>nrow</code> by <code>ncol</code> matrix, <code>bl</code> and <code>bu</code> are real-valued vectors of length <code>nrow</code>, and <code>lo</code> and <code>hi</code> are real-valued vectors of length <code>ncol</code>. In problems where <code>f(x)</code> is quadratic or linear, the user can provide special evaluation routines and/or vectors for optimized performance. Additionally, SuiteOPT can solve unconstrained or partially constrained problems by omitting any of the constraints when specifying the problem data.</p>\n<h2>Installation</h2>\n<p>SuiteOPT for Python has been tested with Python versions 2.7, 3.5, 3.6, and 3.7 on Ubuntu. SuiteOPT for python can be installed using the package manager <a href=\"https://pip.pypa.io/en/stable/\" rel=\"nofollow\"><strong>pip</strong></a> which will build all of the required dynamic libraries for SuiteOPT with Python. As part of the installation routine, SuiteOPT for Python will build the required dynamic libraries for the C/C++ packages <a href=\"https://github.com/jluttine/suitesparse\" rel=\"nofollow\"><strong>SuiteSparse</strong></a> and <a href=\"http://users.clas.ufl.edu/hager/papers/Software/\" rel=\"nofollow\"><strong>SuiteOPT</strong></a>. The dynamic libraries for the C/C++ packages SuiteSparse and SuiteOPT require BLAS and LAPACK. The default installation is configured to use the <a href=\"https://www.openblas.net/\" rel=\"nofollow\"><strong>OpenBLAS</strong></a> library for BLAS and LAPACK if installed on the user's system, however, users can provide desired libraries for BLAS and LAPACK using custom installation options.</p>\n<h4>1. Installing Dependencies</h4>\n<p>Several dependencies are required before calling the <code>pip install</code> command to install SuiteOPT for Python. These dependencies are outlined below.</p>\n<h5>1.1 Python Dependencies: Setuptools, Numpy, and Scipy</h5>\n<p>Inside the setup.py file used to install SuiteOPT, the Python packages <a href=\"https://pypi.org/project/setuptools/\" rel=\"nofollow\"><strong>setuptools</strong></a> and <a href=\"https://numpy.org/\" rel=\"nofollow\"><strong>numpy</strong></a> are imported to complete the installation and the package and <a href=\"https://www.scipy.org/\" rel=\"nofollow\"><strong>scipy</strong></a> is required for SuiteOPT to run. As a result, users missing one or more of these packages when installing SuiteOPT will encounter an error. These packages can be installed using <a href=\"https://pip.pypa.io/en/stable/\" rel=\"nofollow\"><strong>pip</strong></a> by entering any of the following commands into the terminal to install the packages missing on the user's system:</p>\n<pre>$ pip install setuptools\n$ pip install numpy\n$ pip install scipy\n</pre>\n<p>Note: Numpy version &gt;= 1.16.x should be installed as errors have been observed with previous versions. For users with Python 2.7 we have found that Scipy version = 1.2.2 works successfully while users with Python version 3.5 or greater can use Scipy 1.3.1 as it is compatible with SuiteOPT. Other versions may work as well but no errors with SuiteOPT involving Numpy or Scipy have occurred when using these versions.</p>\n<h5>1.2 SuiteOPT and SuiteSparse Dependencies: BLAS, LAPACK, and CMake</h5>\n<p>Users with BLAS, LAPACK, and CMake already available on their system may proceed to step 2.</p>\n<p>Users without BLAS and LAPACK on should choose desired BLAS and LAPACK libraries suitable for their system. SuiteOPT is configured to use <a href=\"https://www.openblas.net/\" rel=\"nofollow\"><strong>OpenBLAS</strong></a> by default but can be customized at installation to use other BLAS and LAPACK configurations. SuiteOPT has been successfully tested with <a href=\"https://www.openblas.net/\" rel=\"nofollow\"><strong>OpenBLAS</strong></a> and <a href=\"https://software.intel.com/en-us/mkl/choose-download\" rel=\"nofollow\"><strong>Intel's MKL BLAS and LAPACK</strong></a>. Note: Users should ensure that all dependencies required by their version of BLAS and LAPACK are installed prior to proceeding to the following step.</p>\n<p>Users without <a href=\"https://cmake.org/\" rel=\"nofollow\"><strong>CMake</strong></a> should install it on their system before proceeding to the following step. CMake is required to build the dynamic library for <a href=\"http://glaros.dtc.umn.edu/gkhome/metis/metis/overview\" rel=\"nofollow\"><strong>METIS</strong></a> which is used by SuiteSparse.</p>\n<h4>2. Installing SuiteOPT for Python</h4>\n<p>If <a href=\"https://www.openblas.net/\" rel=\"nofollow\"><strong>OpenBLAS</strong></a> is installed on your system and the directory containing <code>libopenblas</code> and <code>liblapack</code> is located in a directory found during compilation by default, then follow the instructions for <strong>Default Installation</strong>. Otherwise, follow the instructions for <strong>Custom Installation</strong>.</p>\n<ul>\n<li>\n<p><strong>Default Installation</strong>\nType the following command into the terminal window to install SuiteOPT for Python with default BLAS and LAPACK configurations:</p>\n<pre>$ pip install SuiteOPT --user\n</pre>\n<p>Note: If any errors involving BLAS and LAPACK are raised during the installation routine then it is likely that the installer was unable to identify information necessary for using the user's BLAS and LAPACK libraries when building the dynamic libraries for the C/C++ packages SuiteSparse and SuiteOPT. Users experiencing this problem should follow the instructions in <strong>Custom Installation</strong>.</p>\n</li>\n<li>\n<p><strong>Custom Installation</strong>\nUsers wishing to use custom BLAS and LAPACK configurations for SuiteOPT can pass them to pip during the installation procedure. There are two ways to provide custom BLAS and LAPACK configurations both of which are outlined below.</p>\n<p><strong>Option 1: Pass File Containing BLAS, LAPACK, and LDLIBS</strong>.\nWith this option, users can create a file with variables <code>BLAS</code>, <code>LAPACK</code>, and <code>LDLIBS</code> that specify their BLAS and LAPACK libraries and the location on these libraries on their system, LDLIBS. The file should have one line for each variable. An example configuration for Intel's MKL BLAS and LAPACK is provided below.</p>\n<p><strong>Example: Custom Configuration File Using Intel's MKL BLAS and LAPACK.</strong></p>\n<pre># Contents of user created file 'mklconfig.txt'\nBLAS = -lmkl_intel_lp64 -lmkl_intel_thread -lmkl_core -liomp5 -lpthread -lm\nLAPACK = -lmkl_lapack95_lp64\nLDLIBS = -L/opt/intel/mkl/lib/intel64 -L/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64\n</pre>\n<p>Alternatively, the user can omit the <code>LDLIBS</code> variable if either the location of the BLAS and LAPACK libraries is known by the compiler or the full path to each library is included. As an example, a configuration for OpenBLAS using the alternative convention is provided below.</p>\n<p><strong>Example: Custom Configuration File Using OpenBLAS.</strong></p>\n<pre># Contents of user created file 'openblasconfig.txt'\nBLAS = /full/path/to/libopenblas.so -lgfortran -lpthread\nLAPACK = /full/path/to/liblapack.a\n</pre>\n<p>Once the user's configuration for BLAS and LAPACK is saved to a file of their choice, say <code>myconfig.txt</code>, the full path to the file can be provided as an <code>--install-option</code> during the pip installation routine for SuiteOPT by entering the following command into the terminal:</p>\n<pre>$ pip install SuiteOPT --user --install-option<span class=\"o\">=</span><span class=\"s2\">\"--blfile=/full/path/to/myconfig.txt\"</span>\n</pre>\n<p>Note: In particular, the <code>--install-option</code> is used to set the flag <code>--blfile</code> equal to the full path to the user's BLAS and LAPACK configuration file.</p>\n<p><strong>Option 2: Pass BLAS, LAPACK, and LDLIBS as Individual <code>--install-option</code> Flags</strong>.\nWith this option, the user can specify their BLAS and LAPACK libraries and the location(s) of these libraries directly as part of the pip install command by using <code>--install-option</code> flags to set the <code>--blas</code>, <code>--lapack</code>, and <code>--ldlibs</code> flags equal to the user's BLAS libraries, LAPACK libraries, and the absolute path location(s) of their BLAS and LAPACK libraries, respectively. Examples using various BLAS and LAPACK configurations are provided below.</p>\n<p><strong>Example: Custom Configuration Using Intel's MKL BLAS and LAPACK.</strong></p>\n<pre>$ pip install SuiteOPT --user <span class=\"se\">\\</span>\n--install-option<span class=\"o\">=</span><span class=\"s2\">\"--blas=-lmkl_intel_lp64 -lmkl_intel_thread -lmkl_core -liomp5 -lpthread -lm\"</span> <span class=\"se\">\\</span>\n--install-option<span class=\"o\">=</span><span class=\"s2\">\"--lapack=-lmkl_lapack95_lp64\"</span> <span class=\"se\">\\</span>\n--install-option<span class=\"o\">=</span><span class=\"s2\">\"--ldlibs=-L/opt/intel/mkl/lib/intel64 -L/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64\"</span>\n</pre>\n<p><strong>Example: Custom Configuration Using OpenBLAS.</strong></p>\n<pre>$ pip install SuiteOPT --user <span class=\"se\">\\</span>\n--install-option<span class=\"o\">=</span><span class=\"s2\">\"--blas=-lopenblas -lgfortran -lpthread\"</span> <span class=\"se\">\\</span>\n--install-option<span class=\"o\">=</span><span class=\"s2\">\"--lapack=-llapack\"</span> <span class=\"se\">\\</span>\n--install-option<span class=\"o\">=</span><span class=\"s2\">\"--ldlibs=-L/full/path/to/openblas/directory\"</span>\n</pre>\n</li>\n</ul>\n<h4>Notes on Troubleshooting Issues with BLAS and LAPACK</h4>\n<p>Steps 0 -- 2 should be sufficient for installing SuiteOPT, however if errors are occurring at runtime involving BLAS and/or LAPACK please refer to this section to check for potential solutions to your problems. During runtime, SuiteOPT for Python will require the user's BLAS and LAPACK libraries and the C/C++ dynamic libraries for SuiteSparse and SuiteOPT compiled during step 2 of the installation. The installation routine in the <code>setup.py</code> file is designed to use the provided BLAS and LAPACK information to prevent runtime errors involving BLAS and LAPACK from occurring. If any of these libraries cannot be located runtime errors may occur when using SuiteOPT for Python. This step outlines how to set certain environment variables so that the necessary libraries can be found at runtime.</p>\n<p>For users encountering runtime errors involving the libraries <code>libpasa</code>, <code>libpproj</code>, <code>libcg_descent</code>, <code>libnapheap</code>, <code>libamd</code>, <code>libcamd</code>, <code>libcolamd</code>, <code>libccolamd</code>, <code>libcholmod</code>, or <code>libmetis</code>, see 1. For users encountering runtime errors involving BLAS or LAPACK libraries see 2.</p>\n<ol>\n<li>\n<p><strong>Add SuiteSparse and SuiteOPT dynamic library directories to <code>$LD_LIBRARY_PATH</code> environment variable.</strong>\nDirectories containing the dynamic libraries built by SuiteOPT and SuiteSparse need to be found in the user's <code>$LD_LIBRARY_PATH</code>. During installation, the required dynamic libraries for SuiteOPT and SuiteSparse are saved in directories called <code>SuiteOPT-libraries</code> and <code>SuiteSparse-libraries</code>, respectively, and should be located where python saves installed package information. The full path to these directories should be added to the <code>$LD_LIBRARY_PATH</code> environment variable. Examples are provided below for various shell configurations.</p>\n<p><strong>Example: Bourne/bash shell</strong></p>\n<pre><span class=\"nb\">export</span> <span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"o\">=</span><span class=\"s2\">\"</span><span class=\"si\">${</span><span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"si\">}</span><span class=\"s2\">:/full/path/to/SuiteOPT-libraries\"</span>\n<span class=\"nb\">export</span> <span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"o\">=</span><span class=\"s2\">\"</span><span class=\"si\">${</span><span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"si\">}</span><span class=\"s2\">:/full/path/to/SuiteSparse-libraries\"</span>\n</pre>\n<p><strong>Example: TCSH/CSH shell</strong></p>\n<pre>setenv LD_LIBRARY_PATH <span class=\"si\">${</span><span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"si\">}</span>:/full/path/to/SuiteOPT-libraries\nsetenv LD_LIBRARY_PATH <span class=\"si\">${</span><span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"si\">}</span>:/full/path/to/SuiteSparse-libraries\n</pre>\n</li>\n<li>\n<p><strong>Add BLAS and LAPACK dynamic library directories to <code>$LD_LIBRARY_PATH</code> environment variable.</strong>\nDirectories containing the user's BLAS and LAPACK dynamic libraries also need to be found in the user's <code>$LD_LIBRARY_PATH</code>. Below we provide information and examples for two popular versions of BLAS and LAPACK that should translate to other BLAS and LAPACK configurations.</p>\n<p><strong>Users with Openblas.</strong> When using OpenBLAS, users should be able to bypass this step as it is common for the directory containing <code>libopenblas</code> and <code>liblapack</code> to be contained in a subdirectory of <code>/usr/lib</code> (on Linux) and, hence, located in a directory that is checked by default for dynamic libraries. However, if an error is encountered indicating that OpenBLAS cannot be found, then add the absolute path to the directory containing <code>libopenblas</code> and <code>liblapack</code> to the <code>$LD_LIBRARY_PATH</code> environment variable. Examples are provided below for various shell and BLAS/LAPACK configurations.</p>\n<p><strong>Example: Bourne/bash shell using Openblas</strong></p>\n<pre><span class=\"nb\">export</span> <span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"o\">=</span><span class=\"s2\">\"</span><span class=\"si\">${</span><span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"si\">}</span><span class=\"s2\">:/full/path/to/openblas/dir\"</span>\n</pre>\n<p><strong>Example: TCSH/CSH shell using Openblas</strong></p>\n<pre>setenv LD_LIBRARY_PATH <span class=\"si\">${</span><span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"si\">}</span>:/full/path/to/openblas/dir\n</pre>\n</li>\n</ol>\n<p><strong>Users with Intel's MKL BLAS and LAPACK.</strong> It is not common for the directory containing <a href=\"https://software.intel.com/en-us/mkl/choose-download\" rel=\"nofollow\"><strong>Intel's MKL BLAS and LAPACK</strong></a> to be installed in a directory that is checked by default for dynamic libraries (at least on Linux operating systems). Hence, the absolute path to the directory containing Intel's MKL BLAS and LAPACK dynamic libraries should be added to the <code>$LD_LIBRARY_PATH</code> environment variable. Additionally, it is a common requirement to link to the library <code>libiomp5</code> included with the Intel MKL package when using Intel's MKL BLAS and LAPACK and, thus, the user should also add the full path to the directory containing the <code>libiomp5</code> dynamic library to the <code>$LD_LIBRARY_PATH</code> environment variable.</p>\n<p>Additionally, users should add MKL dynamic libraries to the <code>$LD_PRELOAD</code> environment variable. When the MKL dynamic libraries are not added to the <code>$LD_PRELOAD</code> environment variable it has been observed that either (a) runtime errors or (b) poor performance of SuiteOPT for Python occurs. Some information outlining the prescribed solution included here was found in <a href=\"https://software.intel.com/en-us/forums/intel-math-kernel-library/topic/748309\" rel=\"nofollow\"><strong>Intel's Forum on MKL</strong></a>. Examples are provided below for various shell configurations but note that the required dynamic libraries may vary from system to system.</p>\n<p><strong>Example: Bourne/bash shell using Intel's MKL BLAS and LAPACK</strong></p>\n<pre><span class=\"nb\">export</span> <span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"o\">=</span><span class=\"s2\">\"</span><span class=\"si\">${</span><span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"si\">}</span><span class=\"s2\">:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64\"</span>\n<span class=\"nb\">export</span> <span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"o\">=</span><span class=\"s2\">\"</span><span class=\"si\">${</span><span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"si\">}</span><span class=\"s2\">:/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64\"</span>\n<span class=\"nb\">export</span> <span class=\"nv\">LD_PRELOAD</span><span class=\"o\">=</span><span class=\"s2\">\"</span><span class=\"si\">${</span><span class=\"nv\">LD_PRELOAD</span><span class=\"si\">}</span><span class=\"s2\">:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_def.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_avx2.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_intel_lp64.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_intel_thread.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_core.so:/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64/libiomp5.so\"</span>\n</pre>\n<p><strong>Example: TCSH/CSH shell using Intel's MKL BLAS and LAPACK</strong></p>\n<pre>setenv LD_LIBRARY_PATH <span class=\"si\">${</span><span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"si\">}</span>:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64\nsetenv LD_LIBRARY_PATH <span class=\"si\">${</span><span class=\"nv\">LD_LIBRARY_PATH</span><span class=\"si\">}</span>:/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64\nsetenv LD_PRELOAD <span class=\"si\">${</span><span class=\"nv\">LD_PRELOAD</span><span class=\"si\">}</span>:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_def.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_avx2.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_intel_lp64.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_intel_thread.so:/opt/intel/compilers_and_libraries/linux/mkl/lib/intel64/libmkl_core.so:/opt/intel/compilers_and_libraries_2019.5.281/linux/compiler/lib/intel64/libiomp5.so\n</pre>\n<h2>Usage</h2>\n<p>We now outline how to import the SuiteOPT module, set up a problem to solve with SuiteOPT, how to solve a problem with SuiteOPT, how to view problem statistics with SuiteOPT, and conclude with references to several demo files illustrating how to solve various problem configurations using SuiteOPT. Throughout the usage section, we provide sample blocks of code illustrating how to work with each component of SuiteOPT.</p>\n<h4>Importing SuiteOPT module</h4>\n<p>The SuiteOPT module can be imported within python by using the following command in python:</p>\n<pre><span class=\"kn\">import</span> <span class=\"nn\">SuiteOPT</span>\n</pre>\n<h4><code>SuiteOPT.problem</code> class</h4>\n<p>Problem data is expected to be provided as an instance of the class <code>SuiteOPT.problem</code>. The attributes of the <code>SuiteOPT.problem</code> class are listed below. Note that each attribute of the <code>SuiteOPT.problem</code> class that is an array must be provided as a <a href=\"https://numpy.org\" rel=\"nofollow\"><strong>numpy</strong></a> array.</p>\n<ul>\n<li><code>ncol</code>      : dimension of initial guess x (also, number of columns in constraint matrix A)</li>\n<li><code>nrow</code>      : number of rows in matrix A</li>\n<li><code>x</code>         : Initial guess for primal variable (numpy array of length ncol)</li>\n<li><code>lo</code>        : lower bounds for x (numpy array of length ncol)</li>\n<li><code>hi</code>        : upper bounds for x (numpy array of length ncol)</li>\n<li><code>A</code>         : constraint matrix (numpy matrix or scipy.sparse.csc_matrix of dimension nrow by ncol)</li>\n<li><code>bl</code>        : lower bounds for Ax (numpy array of length nrow)</li>\n<li><code>bu</code>        : upper bounds for Ax (numpy array of length nrow)</li>\n<li><code>pylambda</code>  : multiplier for Ax (dual variable; numpy array of length nrow)</li>\n<li><code>y</code>         : Project y onto polyhedron (if solving polyhedral projection problem; numpy array of length ncol)</li>\n<li><code>a</code>         : Napsack constraint vector bl &lt;= a'x &lt;= bu (if solving napsack problem; numpy array of length ncol)</li>\n<li><code>d</code>         : Diagonal of hessian (if solving napsack problem; numpy array of length nrow)</li>\n<li><code>c</code>         : Linear term in objective function (if using Quadratic or Linear mode)</li>\n<li><code>objective</code> : Objective function (Python function)</li>\n<li><code>gradient</code>  : Gradient of the objective function (Python function)</li>\n<li><code>objgrad</code>   : Objective function and its gradient (Python function)</li>\n<li><code>hprod</code>     : Product of objective hessian times vector (if using quadratic mode; Python function)</li>\n<li><code>cg_hprod</code>  : Product of objective hessian times vector (unconstrained problem in quadratic mode; Python function)</li>\n<li><code>parm</code>      : Custom <code>SuiteOPT.solve()</code> parameter values (Python dict; keys = parm names, values = parm values)</li>\n<li><code>stat</code>      : Problem statistics after solving problem (Python dict; keys = stat names, values = stat values)</li>\n</ul>\n<h5>Initializing <code>SuiteOPT.problem</code> class</h5>\n<p>To initialize an instance of the class containing the problem data, for example, call</p>\n<pre><span class=\"n\">problem</span> <span class=\"o\">=</span> <span class=\"n\">SuiteOPT</span><span class=\"o\">.</span><span class=\"n\">problem</span><span class=\"p\">(</span><span class=\"n\">ncol</span><span class=\"p\">,</span> <span class=\"n\">nrow</span><span class=\"p\">)</span>\n</pre>\n<p>If the problem has no matrix <code>A</code> then the value for <code>nrow</code> can be omitted and it will be initialized to zero. Alternatively, the values for <code>ncol</code> and <code>nrow</code> can be omitted upon initialization and they will be set to zero.</p>\n<h5>Setting problem data</h5>\n<p><strong>Initial Guess.</strong> If the user wishes to provide an initial guess for the primal (decision) variable then the attribute <code>x</code> should be updated after initializing an instance of the <code>SuiteOPT.problem</code> class. If the user wishes to provide an initial guess for the dual variable (KKT multiplier) then the attribute <code>pylambda</code> should be updated after initializing an instance of the <code>SuiteOPT.problem</code> class.</p>\n<pre><span class=\"c1\"># Suppose that x and pylambda have been set to desired numpy arrays</span>\n<span class=\"n\">problem</span><span class=\"o\">.</span><span class=\"n\">x</span>  <span class=\"o\">=</span> <span class=\"n\">x</span>   <span class=\"c1\"># Initial guess for solution</span>\n<span class=\"n\">problem</span><span class=\"o\">.</span><span class=\"n\">pylambda</span>  <span class=\"o\">=</span> <span class=\"n\">pylambda</span>   <span class=\"c1\"># Initial guess for dual variable</span>\n</pre>\n<p><strong>Bound Constraints.</strong> If the user wishes to enforce the constraint <code>lo &lt;= x</code> then <code>lo</code> is required. If the user wishes to enforce the constraint <code>x &lt;= hi</code> then <code>hi</code> is required. If <code>lo = hi</code> for the user's problem, then <code>lo</code> and <code>hi</code> must both be provided with <code>lo = hi</code>. If <code>lo</code> is not provided then it will be assumed that there is no lower bound on <code>x</code>. Similarly, if <code>hi</code> is not provided then it will be assumed that there is no upper bound on <code>x</code>.</p>\n<pre><span class=\"c1\"># Suppose that lo and hi have been set to desired numpy arrays</span>\n<span class=\"n\">problem</span><span class=\"o\">.</span><span class=\"n\">lo</span> <span class=\"o\">=</span> <span class=\"n\">lo</span>  <span class=\"c1\"># Lower bound on primal variable,   lo &lt;= x</span>\n<span class=\"n\">problem</span><span class=\"o\">.</span><span class=\"n\">hi</span> <span class=\"o\">=</span> <span class=\"n\">hi</span>  <span class=\"c1\"># Upper bound on primal variable,   x &lt;= hi</span>\n</pre>\n<p><strong>Polyhedral Constraints.</strong> If the user wishes to enforce the constraint <code>bl &lt;= Ax &lt;= bu</code> then <code>A</code> and at least one of the vectors <code>bl</code> and <code>bu</code> are required. If <code>bl</code> is not provided then it will be assumed that there is no lower bound on <code>Ax</code>. Similarly, if <code>bu</code> is not provided then it will be assumed that there is no upper bound on <code>Ax</code>. If <code>bl = bu</code> in your problem, both <code>bl</code> and <code>bu</code> must be provided as the same vector. If the user does not wish to enforce this constraint then <code>A</code>, <code>bl</code>, and <code>bu</code> should not be updated after initializing an instance of the <code>SuiteOPT.problem</code> class.</p>\n<pre><span class=\"c1\"># Suppose that bl and bl have been set to desired numpy arrays and A set to desired numpy matrix or csc_matrix</span>\n<span class=\"n\">problem</span><span class=\"o\">.</span><span class=\"n\">A</span>  <span class=\"o\">=</span> <span class=\"n\">A</span>   <span class=\"c1\"># Linear constraint matrix A,       bl &lt;= Ax &lt;= bu</span>\n<span class=\"n\">problem</span><span class=\"o\">.</span><span class=\"n\">bl</span> <span class=\"o\">=</span> <span class=\"n\">bl</span>  <span class=\"c1\"># Lower bound on linear constraint, bl &lt;= Ax</span>\n<span class=\"n\">problem</span><span class=\"o\">.</span><span class=\"n\">bu</span> <span class=\"o\">=</span> <span class=\"n\">bu</span>  <span class=\"c1\"># Upper bound on linear constraint, Ax &lt;= bu</span>\n</pre>\n<p><strong>Special Attributes.</strong> The attributes <code>y</code>, <code>a</code>, <code>d</code>, and <code>c</code> should only be provided for certain problem formulations. In particular, special implementations are used by SuiteOPT for solving polyhedral projection, separable convex quadratic knapsack, and unconstrained problems. More information on these problem formulations and how to solve them efficiently using SuiteOPT can be found in the <strong>Special Modes and Problem Formulations in SuiteOPT</strong> subsection.</p>\n<p><strong>Objective Function.</strong> As a general rule for determining which function attributes in <code>SuiteOPT.problem</code> are necessary for solving a problem, ensure that the attributes provided in <code>SuiteOPT.problem</code> are sufficient for computing <strong>(a) the objective function</strong> and <strong>(b) the gradient of the objective function</strong>. For straightforward use note that it is always sufficient to provide the attributes <code>SuiteOPT.problem.objective</code> and <code>SuiteOPT.problem.gradient</code>. However, alternative choices of the function attributes can be used depending on the type of problem in order to obtain improved performance. More detailed information on which attributes of <code>SuiteOPT.problem</code> are sufficient and optimized for solving problems of various types (nonlinear objective, quadratic objective, ...) can be found in the <strong>Special Modes and Problem Formulations in SuiteOPT</strong> subsection.</p>\n<p><strong>Customizing <code>SuiteOPT.solve()</code> Parameters.</strong> If the user wishes to provide custom parameter values for the solver <code>SuiteOPT.solve()</code>, the user can modify the values of each parameter by name by inserting it into the <code>SuiteOPT.problem.parm</code> dictionary. To see a list of all parameters and their default values, the user can call the method <code>SuiteOPT.print_parm()</code>. The following calls to this function can be used to view full or partial lists of customizable parameters within SuiteOPT:</p>\n<pre><code>SuiteOPT.print_parm(\"all\")     : List of all default parameters values\nSuiteOPT.print_parm(\"parm\")    : List of default pasa parameter values\nSuiteOPT.print_parm(\"pproj\")   : List of default pproj parameter values\nSuiteOPT.print_parm(\"cg\")      : List of default cg parameter values\nSuiteOPT.print_parm(\"napheap\") : List of default napheap parameter values\n</code></pre>\n<p>Once the desired parameters have been identified, they can be modified by inserting them into the <code>SuiteOPT.problem.parm</code> dictionary attribute using the parameter name as the key and the desired parameter value as the value.</p>\n<pre><span class=\"c1\"># Suppose we want to set the parameter 'PrintLevel' to be 3 (maximum printing during SuiteOPT)</span>\n<span class=\"c1\"># and the stopping tolerance, 'grad_tol' to be 1e-8</span>\n<span class=\"n\">parm</span> <span class=\"o\">=</span> <span class=\"nb\">dict</span><span class=\"p\">(</span><span class=\"n\">PrintLevel</span><span class=\"o\">=</span><span class=\"mi\">3</span><span class=\"p\">,</span> <span class=\"n\">grad_tol</span><span class=\"o\">=</span><span class=\"mf\">1e-8</span><span class=\"p\">)</span>\n<span class=\"c1\"># Provide custom parameters to instance of SuiteOPT.problem class</span>\n<span class=\"n\">problem</span><span class=\"o\">.</span><span class=\"n\">parm</span> <span class=\"o\">=</span> <span class=\"n\">parm</span>  <span class=\"c1\"># custom parameter values (optional)</span>\n</pre>\n<h4>Special Modes and Problem Formulations in SuiteOPT</h4>\n<h5>Nonlinear Mode</h5>\n<p>Here we outline which functions are required and optional when <code>f(x)</code> is a nonlinear cost function.</p>\n<ul>\n<li>Required Functions : <code>SuiteOPT.problem.objective</code> and <code>SuiteOPT.problem.gradient</code></li>\n<li>Optional Function  : <code>SuiteOPT.problem.objgrad</code></li>\n</ul>\n<p>Note that <code>objective</code> and <code>gradient</code> must be functions with one input (vector to evaluate function at) and one output (function/gradient value, respectively). <code>objgrad</code> must be a function with one input (vector to evaluate function/gradient at) and two outputs (function value, gradient value). <code>objgrad</code> can be provided in instances where values computed during the computation of the objective function can be reused during the computation of the gradient resulting in reduced computation cost by computing the objective and gradient values simultaneously. If the user provides <code>objgrad</code> then when SuiteOPT requires updates to both the objective and gradient the <code>objgrad</code> function will be used. Otherwise, SuiteOPT will make a call to the <code>objective</code> and <code>gradient</code> functions.</p>\n<h5>Quadratic Mode</h5>\n<p>If the objective <code>f(x)</code> is quadratic, say of the form <code>f(x) = 0.5 x^T H x + c^T x</code>, the user should provide a routine, <code>hprod</code>, to evaluate the product between the objective Hessian <code>H</code> and the nonzero components of a vector <code>x</code>, so as to compute <code>Hx</code>, and the linear term in the objective, <code>c</code>.</p>\n<ul>\n<li>Required Attributes : <code>SuiteOPT.problem.hprod</code> and <code>SuiteOPT.problem.c</code></li>\n</ul>\n<p>Note that <code>hprod</code> must be a function with two inputs and one output. Using the above form for <code>f(x)</code>, <code>hprod</code> should compute the vector <code>Hx</code> given a vector <code>x</code> and an array containing the nonzero indices of <code>x</code>. In particular, the first input of the function <code>SuiteOPT.problem.hprod</code> should be the vector to take the product with, the second input should be a vector containing the indices for which the input vector is nonzero, and the output should be the matrix-vector product.</p>\n<p>For unconstrained problems with quadratic cost functions the user should instead provide <code>cg_hprod</code>. <code>cg_hprod</code> must be a function with one input, the vector <code>x</code> to compute the matrix-vector product with, and one output, the matrix-vector product <code>Hx</code>.</p>\n<h5>Linear Mode</h5>\n<p>If the objective <code>f(x)</code> is linear, say of the form <code>f(x) = c^T x</code>, the user should provide the linear term in the objective, <code>c</code>.</p>\n<ul>\n<li>Required Input : <code>SuiteOPT.problem.c</code></li>\n</ul>\n<h5>Polyhedral Projection Problem</h5>\n<p>SuiteOPT implements a special routine, called <a href=\"http://users.clas.ufl.edu/hager/papers/CG/pproj.pdf\" rel=\"nofollow\"><strong>PPROJ</strong></a>, for solving a polyhedral projection problem of the form</p>\n<pre><code>min  0.5 * || x - y || ** 2    subject to    bl &lt;= Ax &lt;= bu, lo &lt;= x &lt;= hi\n</code></pre>\n<p>where <code>y</code> is the point to be projected onto the polyhedral set <code>{x : bl &lt;= Ax &lt;= bu, lo &lt;= x &lt;= hi}</code>. When solving a problem of this form, it is sufficient to provide the following information to compute the objective and gradient values:</p>\n<ul>\n<li>Required Input : <code>SuiteOPT.problem.y</code></li>\n</ul>\n<h5>Separable Convex Quadratic Knapsack Problem</h5>\n<p>SuiteOPT implements a special routine, called <a href=\"http://users.clas.ufl.edu/hager/papers/CG/knapsack.pdf\" rel=\"nofollow\"><strong>NAPHEAP</strong></a>, for solving a separable convex quadratic knapsack problem of the form</p>\n<pre><code>min  0.5 * x^T D x - c^T x    subject to    bl &lt;= a^T x &lt;= bu, lo &lt;= x &lt;= hi\n</code></pre>\n<p>where <code>D</code> is a diagonal matrix with nonnegative diagonal equal to the vector <code>SuiteOPT.problem.d</code>, <code>a</code> is a vector of length <code>ncol</code>, and <code>bl</code> and <code>bu</code> are scalars. When solving a problem of this form, it is sufficient to provide the following information to compute the objective and gradient values:</p>\n<ul>\n<li>Required Input : <code>SuiteOPT.problem.d</code>, <code>SuiteOPT.problem.c</code></li>\n</ul>\n<p>Additionally, instead of providing a constraint matrix <code>A</code>, the user should provide a constraint vector as a numpy array in the attribute <code>SuiteOPT.problem.a</code>.</p>\n<h5>Unconstrained Problem</h5>\n<p>SuiteOPT implements a special routine, called <a href=\"http://users.clas.ufl.edu/hager/papers/CG/cg_code.pdf\" rel=\"nofollow\"><strong>CG_DESCENT</strong></a>, for solving unconstrained optimization problems of the form</p>\n<pre><code>min  f(x)    subject to    x in R^n\n</code></pre>\n<p>In addition to nonlinear mode, quadratic mode can be used to evaluate the objective and gradient for unconstrained problems. Be sure to follow the details in the subsection <strong>Special Modes and Problem Formulations in SuiteOPT: Quadratic Mode</strong> to use quadratic mode with unconstrained problems.</p>\n<h4><code>SuiteOPT.solve()</code> method</h4>\n<p><code>SuiteOPT.solve()</code> requires a single input which is an instance of the <code>SuiteOPT.problem</code> class and returns a single output argument which is a numpy array containing the problem solution.</p>\n<pre><span class=\"c1\"># Solve problem using SuiteOPT and store solution in xnew</span>\n<span class=\"n\">xnew</span> <span class=\"o\">=</span> <span class=\"n\">SuiteOPT</span><span class=\"o\">.</span><span class=\"n\">solve</span><span class=\"p\">(</span><span class=\"n\">problem</span><span class=\"p\">)</span>\n</pre>\n<h4>Problem Statistics</h4>\n<p>Problem statistics generated during a run of <code>SuiteOPT.solve()</code> are stored in the <code>SuiteOPT.problem.stats</code> attribute as a dictionary and can be printed using the method <code>SuiteOPT.problem.print_stats()</code>.</p>\n<h3>SuiteOPT Examples</h3>\n<p>Example files illustrating how to setup an instance of <code>SuiteOPT.problem</code>, call <code>SuiteOPT.solve()</code>, and print <code>SuiteOPT.problem.stats</code> are available in the <code>Demo</code> directory at <a href=\"https://github.com/chrundle/python-SuiteOPT\" rel=\"nofollow\">https://github.com/chrundle/python-SuiteOPT</a>. The type of problem and corresponding demo file are listed below:</p>\n<pre><code> Nonlinear Objective : demo.py\n Quadratic Objective : demoQP.py\n Linear Objective    : demoLP.py\n</code></pre>\n<p>Users with the <a href=\"https://pypi.org/project/pycutest/\" rel=\"nofollow\"><strong>pycutest</strong></a> package installed may also run the <code>demo_cutest.py</code> file to solve any problem from the <a href=\"https://github.com/ralna/CUTEst/wiki\" rel=\"nofollow\"><strong>CUTEst</strong></a> optimization test suite. When running <code>demo_cutest.py</code>, the user will be prompted to enter the name of the problem from the CUTEst test set that they wish to solve using SuiteOPT.</p>\n<h2>License</h2>\n<p><a href=\"https://www.gnu.org/licenses/old-licenses/gpl-2.0.en.html\" rel=\"nofollow\"><strong>GPLv2</strong></a></p>\n\n          </div>"}, "last_serial": 6083571, "releases": {"1.0.0": [{"comment_text": "", "digests": {"md5": "972a428cdf97d073bda49ba5a2f5c4d2", "sha256": "109d9244a1d25fbe052724dd95b317773ff328c221eea63df89aac8e5ca5b43c"}, "downloads": -1, "filename": "SuiteOPT-1.0.0.tar.gz", "has_sig": false, "md5_digest": "972a428cdf97d073bda49ba5a2f5c4d2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6256846, "upload_time": "2019-11-05T18:17:32", "upload_time_iso_8601": "2019-11-05T18:17:32.095743Z", "url": "https://files.pythonhosted.org/packages/b8/1d/ba974031df8e5e49015bc85f56ceae686842abc4c236726312819bc3c596/SuiteOPT-1.0.0.tar.gz", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "53d82e9666a952798b0379ef1351473e", "sha256": "170d973341430f0db63ab95a9221eda71a1582566537dad88b00792c0525dd6b"}, "downloads": -1, "filename": "SuiteOPT-1.0.1.tar.gz", "has_sig": false, "md5_digest": "53d82e9666a952798b0379ef1351473e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6256836, "upload_time": "2019-11-05T19:24:30", "upload_time_iso_8601": "2019-11-05T19:24:30.955692Z", "url": "https://files.pythonhosted.org/packages/54/3f/9a45a3e00ebef5c35183713c7f4da88ed5c3254d9519641ff26c7a3f0c60/SuiteOPT-1.0.1.tar.gz", "yanked": false}], "1.0.2": [{"comment_text": "", "digests": {"md5": "02e2812504b70929a4ad2f024292ba22", "sha256": "fb059be6a3268b26f75e0c8c6c4d44dc8ae8dd8a4ebcf5651dd1540e6ba9dd0b"}, "downloads": -1, "filename": "SuiteOPT-1.0.2.tar.gz", "has_sig": false, "md5_digest": "02e2812504b70929a4ad2f024292ba22", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6264548, "upload_time": "2019-11-05T19:57:05", "upload_time_iso_8601": "2019-11-05T19:57:05.150982Z", "url": "https://files.pythonhosted.org/packages/c5/b1/1925063dd50960475d054441b44fd65598c2d4710225092c33d7fc97ed57/SuiteOPT-1.0.2.tar.gz", "yanked": false}], "1.0.3": [{"comment_text": "", "digests": {"md5": "e4f7b2cc7469c0f2cb6142906141abc6", "sha256": "d6ee7b3874822f311abf41cc7b29c1bf3d0a6652ad1fd4496710ade0e8b57268"}, "downloads": -1, "filename": "SuiteOPT-1.0.3.tar.gz", "has_sig": false, "md5_digest": "e4f7b2cc7469c0f2cb6142906141abc6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6264496, "upload_time": "2019-11-05T23:05:07", "upload_time_iso_8601": "2019-11-05T23:05:07.055024Z", "url": "https://files.pythonhosted.org/packages/16/1c/1f3729230a2f0777f37cdea38420eb1f0159751fc12db0d91a6a3141fcfd/SuiteOPT-1.0.3.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "e4f7b2cc7469c0f2cb6142906141abc6", "sha256": "d6ee7b3874822f311abf41cc7b29c1bf3d0a6652ad1fd4496710ade0e8b57268"}, "downloads": -1, "filename": "SuiteOPT-1.0.3.tar.gz", "has_sig": false, "md5_digest": "e4f7b2cc7469c0f2cb6142906141abc6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6264496, "upload_time": "2019-11-05T23:05:07", "upload_time_iso_8601": "2019-11-05T23:05:07.055024Z", "url": "https://files.pythonhosted.org/packages/16/1c/1f3729230a2f0777f37cdea38420eb1f0159751fc12db0d91a6a3141fcfd/SuiteOPT-1.0.3.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:00:28 2020"}