{"info": {"author": "Christopher Johnstone", "author_email": "meson800@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 2 - Pre-Alpha", "License :: OSI Approved :: MIT License", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# tame\nAn unobtrusive YAML based metadata system for arbitrary data management.\n\n## Rationale\nIn many fields, large amounts of interlinked data are generated. Contextual information, such as the experimental layout of the plate used for microscopy or the configuration of a system used to generate a large profile file, is sometimes stored in the relevant file formats. However, the more common case is that this contextual information must be encoded elsewhere.\n\n`tame` aims to be a minimal metadata management system. Metadata is written in the form of YAML files, without defined schemas. These metadata files should always remain human-understandable, even if generated by external tools. In the case of scientific data, these metadata files must often be written by the scientist, which means that complicated non-plaintext formats or even heavily-delimited plain-text formats (ala JSON) are untenable. At the same time, having this metadata be computer-readable is a boon; relations between files can be programmatically queried, used, and modified.\n\n## Basic use\n#### Writing metadata files\nFor each piece data you want to attach metadata to, write a YAML document. `tame` only looks for one required tag for each metadata file, a `type` key. Normally, the `files` key is also present, unless there is a piece of data that is metadata-only. Optionally, the keys `name` and `uid` can be included and have a special meaning for `tame`. Other keys may be present and remain tracked by `tame`.\n\n - `type`: A use-specific term describing what information is being tracked. User-written custom code, such as validators or locators, primarily operates on different types.\n - `files` _(required, unless you have a metadata-only document)_: Which files the metadata is attached to. Paths to files can either be *absolute* or *relative to the location of the YAML document*.\n - `name` _(optional)_: A string describing what the metadata describes. In the absence of a `uid` field, the name and type of metadata is used for linking pieces of metadata together. `tame` allows multiple pieces of metadata to have the same type and name.\n - `uid` _(optional)_: A string referring to a piece of metadata. `tame` enforces that two pieces of metadata _cannot_ have the same `uid` and `type`. When the `uid` is present, it can be used for linking metadata together.\n \n\n#### Linking metadata together\nMost metadata is not entirely self-contained, and needs contextual information. `tame` handles this with _parent links_. A piece of metadata can be linked to any number of other metadata entries. These links can be specified in one of three ways:\n- By filename. A single key is expected in this case, with value `file`. This directly links a piece of metadata to the named YAML document.\n- By type/name. Two key/value pairs are expected. This attempts to link this piece of metadata to another piece of metadata, looked up by type/name. This can fail if there are multiple pieces of metadata with the same type and name!\n- By type/uid. Because `meta` enforces that type/uid's are unique, there cannot be multiple pieces of metadata with the same type and UID.\n- TODO: locators. How to link to \"submetadata\" files.\n\nSee the example below for more details.\n\nLinks are specified with a YAML list from the key `parent`.\n\n#### Example\nImagine a directory layout as follows:\n```\nâ”œâ”€â”€plasmids\nâ”‚   â”œâ”€â”€â”€GFP.gb\nâ”‚   â””â”€â”€â”€GFP.yaml\nâ”œâ”€â”€microscopy\nâ”‚   â”œâ”€â”€â”€20200101.yaml\nâ”‚   â”œâ”€â”€â”€green_channel.tif\nâ”‚   â”œâ”€â”€â”€red_channel.tif\nâ”‚   â””â”€â”€â”€overlay.tif\n\n```\nwith a plasmid YAML file: \n\n`plasmids/GFP.yaml`\n```\n---\ntype: plasmid   # Required meta tag\nname: GFP       # Optional tag for linking purposes\nuid: p001       # Optional tag for linking purposes\nfiles:          # Required meta tag\n  - GFP.gb      # This file is specified using a relative path\nresistance: Amp # Use-specific tag (in this case a biology metadata field)\n```\n\nIf the microscopy experiment needs to be linked to the plasmid,\nwe could specify the linkage in one of these three ways: \n\n`microscopy/20200101.yaml`\n```\n---\ntype: image\nfiles:\n  - green_channel.tif\n  - red_channel.tif\n  - overlay.tif\nparent:\n  - file: ../plasmids/GFP.yaml # Directly specify the parent relationship\n  - type: plasmid              # Specify the parent relationship with\n    name: GFP                  # a type/name pair, using explicit YAML syntax\n  - {type: plasmid, uid: p001} # Specify the parent relationship with inline YAML syntax\n```\n\n## Software support\n`tame` supports four basic operations that act on these linked metadata trees, `validate`, `describe`, `collect`, and `freeze`. \n#### `tame validate`\nWhen given a single file, `tame validate` verifies that the given YAML document is in fact valid YAML. If it is, `tame` then verifies that the entire tree of parent relationships is valid. `tame` raises an error if there is invalid YAML syntax somewhere, if a parent link cannot be found, or if there is a type/name collision given a parent link.\n\nWhen given a directory, `tame` performs this validation operation on all reachable YAML files beneath the directory.\n\nTODO: How do we ensure that a project that has non-meta YAML files is covered/doesn't error out when we do this? Should we switch the filetype to \".meta\" instead of just \".yaml\"? That would break the idea that you could use this metadata system even without the program `tame`\n\n#### `tame describe`\nGiven a YAML data file, this attempts to \"describe\" the metadata item, often by giving information derived from itself and its parents. This is often extended by user code to give meaningful information to all of the other key:value pairs that `tame` does not normally care about.\n\n#### `tame collect`\nGiven a metadata file, this tells `tame` to collect tne entire tree of parent links from the given metadata file into a self-contained directory. This collection then has the complete contextual information to be shared elsewhere. In the micrscopy example above, performing a `tame collect` on the GFP.yaml file would only include itself and the GFP plasmid, because this plasmid does not depend on anything else. Performing a `tame collect` on the microscopy YAML file would include both the micrscopy images _and_ the GFP plasmid file, because the parental link means that the image should not be separated from its context of the plasmid from which the cells came from.\n\n#### `tame freeze`\nTODO: finish thinking about what this means. The goal is to have a command that would:\n- Expand wildcards into the specifically included files (e.g. if someone wrote *.tif, it actually \"freezes\" the file include to whatever TIF files are currently present.\n- Hash the included files, saving the hash value, to make sure we have confirmation that files have not been modified.\n\nThis moves uncomfortably towards a version control system. If you freeze, you should probably save the frozen original files somewhere, as there's no other way to make sure they don't get modified.\n\n## Finding metadata files\nTODO: decide how to do this. Could use a root system, e.g. a tame.yaml file at the top-level, where subdirectories are searched from that point downward.\n\n## Extending `tame` to your metadata scheme\nFor most usecases, no Python has to be written to extend `tame`. Just start writing YAML files!\n\n`tame` is extended with Python in two important ways, via `locators` and `descriptors`. At the top-level of the tracked metadata, the user can write Python code that implements this locator and descriptor for each `type` of metadata.\n\n#### Locators\nLocators allow an additional level of granualartiy in parent links. As an example on where this might be useful, consider a multiple-sample experiment. One metadata YAML file might describe the relevant information of the entire experiment, but there may be additional pieces of data such as micrscopy images that only pertain to single samples. Locators are then the logic that links/matches metadata files together at this sub-file level.\n\nTODO: extend with examples/more reasoning\n\n#### Descriptors\nDescriptors are given a Python view of a metadata file of a given type, and are responbible for formatting the output of a `tame describe` call. The default descriptor simply prints out the key/value pairs that are not special/reserved for `tame`.\n\nTODO: extend with examples/more reasoning\n\n## Development setup\nThis project uses a development strategy inspired by [git-flow](https://nvie.com/posts/a-successful-git-branching-model/). For release sanity and simplicity of non-developers cloning the repository, the `master` branch is _always_ a stable release. Main development occurs on the `develop` branch, so switch to that branch if you want to make changes!\n\nFeel free to ignore the git-flow-ism's of unnecessary merge commits.\n\n## License\nThis software is released under the [MIT license](LICENSE). This code should be as free as your metadata.", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/meson800/tame", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "tame", "package_url": "https://pypi.org/project/tame/", "platform": "", "project_url": "https://pypi.org/project/tame/", "project_urls": {"Homepage": "https://github.com/meson800/tame"}, "release_url": "https://pypi.org/project/tame/0.0.2/", "requires_dist": null, "requires_python": ">=3", "summary": "A minimal YAML-based metadata management system.", "version": "0.0.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>tame</h1>\n<p>An unobtrusive YAML based metadata system for arbitrary data management.</p>\n<h2>Rationale</h2>\n<p>In many fields, large amounts of interlinked data are generated. Contextual information, such as the experimental layout of the plate used for microscopy or the configuration of a system used to generate a large profile file, is sometimes stored in the relevant file formats. However, the more common case is that this contextual information must be encoded elsewhere.</p>\n<p><code>tame</code> aims to be a minimal metadata management system. Metadata is written in the form of YAML files, without defined schemas. These metadata files should always remain human-understandable, even if generated by external tools. In the case of scientific data, these metadata files must often be written by the scientist, which means that complicated non-plaintext formats or even heavily-delimited plain-text formats (ala JSON) are untenable. At the same time, having this metadata be computer-readable is a boon; relations between files can be programmatically queried, used, and modified.</p>\n<h2>Basic use</h2>\n<h4>Writing metadata files</h4>\n<p>For each piece data you want to attach metadata to, write a YAML document. <code>tame</code> only looks for one required tag for each metadata file, a <code>type</code> key. Normally, the <code>files</code> key is also present, unless there is a piece of data that is metadata-only. Optionally, the keys <code>name</code> and <code>uid</code> can be included and have a special meaning for <code>tame</code>. Other keys may be present and remain tracked by <code>tame</code>.</p>\n<ul>\n<li><code>type</code>: A use-specific term describing what information is being tracked. User-written custom code, such as validators or locators, primarily operates on different types.</li>\n<li><code>files</code> <em>(required, unless you have a metadata-only document)</em>: Which files the metadata is attached to. Paths to files can either be <em>absolute</em> or <em>relative to the location of the YAML document</em>.</li>\n<li><code>name</code> <em>(optional)</em>: A string describing what the metadata describes. In the absence of a <code>uid</code> field, the name and type of metadata is used for linking pieces of metadata together. <code>tame</code> allows multiple pieces of metadata to have the same type and name.</li>\n<li><code>uid</code> <em>(optional)</em>: A string referring to a piece of metadata. <code>tame</code> enforces that two pieces of metadata <em>cannot</em> have the same <code>uid</code> and <code>type</code>. When the <code>uid</code> is present, it can be used for linking metadata together.</li>\n</ul>\n<h4>Linking metadata together</h4>\n<p>Most metadata is not entirely self-contained, and needs contextual information. <code>tame</code> handles this with <em>parent links</em>. A piece of metadata can be linked to any number of other metadata entries. These links can be specified in one of three ways:</p>\n<ul>\n<li>By filename. A single key is expected in this case, with value <code>file</code>. This directly links a piece of metadata to the named YAML document.</li>\n<li>By type/name. Two key/value pairs are expected. This attempts to link this piece of metadata to another piece of metadata, looked up by type/name. This can fail if there are multiple pieces of metadata with the same type and name!</li>\n<li>By type/uid. Because <code>meta</code> enforces that type/uid's are unique, there cannot be multiple pieces of metadata with the same type and UID.</li>\n<li>TODO: locators. How to link to \"submetadata\" files.</li>\n</ul>\n<p>See the example below for more details.</p>\n<p>Links are specified with a YAML list from the key <code>parent</code>.</p>\n<h4>Example</h4>\n<p>Imagine a directory layout as follows:</p>\n<pre><code>â”œâ”€â”€plasmids\nâ”‚   â”œâ”€â”€â”€GFP.gb\nâ”‚   â””â”€â”€â”€GFP.yaml\nâ”œâ”€â”€microscopy\nâ”‚   â”œâ”€â”€â”€20200101.yaml\nâ”‚   â”œâ”€â”€â”€green_channel.tif\nâ”‚   â”œâ”€â”€â”€red_channel.tif\nâ”‚   â””â”€â”€â”€overlay.tif\n\n</code></pre>\n<p>with a plasmid YAML file:</p>\n<p><code>plasmids/GFP.yaml</code></p>\n<pre><code>---\ntype: plasmid   # Required meta tag\nname: GFP       # Optional tag for linking purposes\nuid: p001       # Optional tag for linking purposes\nfiles:          # Required meta tag\n  - GFP.gb      # This file is specified using a relative path\nresistance: Amp # Use-specific tag (in this case a biology metadata field)\n</code></pre>\n<p>If the microscopy experiment needs to be linked to the plasmid,\nwe could specify the linkage in one of these three ways:</p>\n<p><code>microscopy/20200101.yaml</code></p>\n<pre><code>---\ntype: image\nfiles:\n  - green_channel.tif\n  - red_channel.tif\n  - overlay.tif\nparent:\n  - file: ../plasmids/GFP.yaml # Directly specify the parent relationship\n  - type: plasmid              # Specify the parent relationship with\n    name: GFP                  # a type/name pair, using explicit YAML syntax\n  - {type: plasmid, uid: p001} # Specify the parent relationship with inline YAML syntax\n</code></pre>\n<h2>Software support</h2>\n<p><code>tame</code> supports four basic operations that act on these linked metadata trees, <code>validate</code>, <code>describe</code>, <code>collect</code>, and <code>freeze</code>.</p>\n<h4><code>tame validate</code></h4>\n<p>When given a single file, <code>tame validate</code> verifies that the given YAML document is in fact valid YAML. If it is, <code>tame</code> then verifies that the entire tree of parent relationships is valid. <code>tame</code> raises an error if there is invalid YAML syntax somewhere, if a parent link cannot be found, or if there is a type/name collision given a parent link.</p>\n<p>When given a directory, <code>tame</code> performs this validation operation on all reachable YAML files beneath the directory.</p>\n<p>TODO: How do we ensure that a project that has non-meta YAML files is covered/doesn't error out when we do this? Should we switch the filetype to \".meta\" instead of just \".yaml\"? That would break the idea that you could use this metadata system even without the program <code>tame</code></p>\n<h4><code>tame describe</code></h4>\n<p>Given a YAML data file, this attempts to \"describe\" the metadata item, often by giving information derived from itself and its parents. This is often extended by user code to give meaningful information to all of the other key:value pairs that <code>tame</code> does not normally care about.</p>\n<h4><code>tame collect</code></h4>\n<p>Given a metadata file, this tells <code>tame</code> to collect tne entire tree of parent links from the given metadata file into a self-contained directory. This collection then has the complete contextual information to be shared elsewhere. In the micrscopy example above, performing a <code>tame collect</code> on the GFP.yaml file would only include itself and the GFP plasmid, because this plasmid does not depend on anything else. Performing a <code>tame collect</code> on the microscopy YAML file would include both the micrscopy images <em>and</em> the GFP plasmid file, because the parental link means that the image should not be separated from its context of the plasmid from which the cells came from.</p>\n<h4><code>tame freeze</code></h4>\n<p>TODO: finish thinking about what this means. The goal is to have a command that would:</p>\n<ul>\n<li>Expand wildcards into the specifically included files (e.g. if someone wrote *.tif, it actually \"freezes\" the file include to whatever TIF files are currently present.</li>\n<li>Hash the included files, saving the hash value, to make sure we have confirmation that files have not been modified.</li>\n</ul>\n<p>This moves uncomfortably towards a version control system. If you freeze, you should probably save the frozen original files somewhere, as there's no other way to make sure they don't get modified.</p>\n<h2>Finding metadata files</h2>\n<p>TODO: decide how to do this. Could use a root system, e.g. a tame.yaml file at the top-level, where subdirectories are searched from that point downward.</p>\n<h2>Extending <code>tame</code> to your metadata scheme</h2>\n<p>For most usecases, no Python has to be written to extend <code>tame</code>. Just start writing YAML files!</p>\n<p><code>tame</code> is extended with Python in two important ways, via <code>locators</code> and <code>descriptors</code>. At the top-level of the tracked metadata, the user can write Python code that implements this locator and descriptor for each <code>type</code> of metadata.</p>\n<h4>Locators</h4>\n<p>Locators allow an additional level of granualartiy in parent links. As an example on where this might be useful, consider a multiple-sample experiment. One metadata YAML file might describe the relevant information of the entire experiment, but there may be additional pieces of data such as micrscopy images that only pertain to single samples. Locators are then the logic that links/matches metadata files together at this sub-file level.</p>\n<p>TODO: extend with examples/more reasoning</p>\n<h4>Descriptors</h4>\n<p>Descriptors are given a Python view of a metadata file of a given type, and are responbible for formatting the output of a <code>tame describe</code> call. The default descriptor simply prints out the key/value pairs that are not special/reserved for <code>tame</code>.</p>\n<p>TODO: extend with examples/more reasoning</p>\n<h2>Development setup</h2>\n<p>This project uses a development strategy inspired by <a href=\"https://nvie.com/posts/a-successful-git-branching-model/\" rel=\"nofollow\">git-flow</a>. For release sanity and simplicity of non-developers cloning the repository, the <code>master</code> branch is <em>always</em> a stable release. Main development occurs on the <code>develop</code> branch, so switch to that branch if you want to make changes!</p>\n<p>Feel free to ignore the git-flow-ism's of unnecessary merge commits.</p>\n<h2>License</h2>\n<p>This software is released under the <a href=\"LICENSE\" rel=\"nofollow\">MIT license</a>. This code should be as free as your metadata.</p>\n\n          </div>"}, "last_serial": 6932717, "releases": {"0.0.1": [{"comment_text": "", "digests": {"md5": "299d79b613a0417161832330c0edafd0", "sha256": "0d670237bfbd4be73f00e177326a95fc3e25cb1d559518b1366dcc1d38b7edd5"}, "downloads": -1, "filename": "tame-0.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "299d79b613a0417161832330c0edafd0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3", "size": 5981, "upload_time": "2020-02-04T01:35:28", "upload_time_iso_8601": "2020-02-04T01:35:28.760342Z", "url": "https://files.pythonhosted.org/packages/70/c7/2b1219308cd18d72a399c16ff749697468afad39521f1e46367ea96d1e82/tame-0.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f76a7b443fc41d682e77fa883f28d4f7", "sha256": "f487e0f9e4dc94f13827f93d42f1aa4532e386f25de59e4c9d90b4f464153802"}, "downloads": -1, "filename": "tame-0.0.1.tar.gz", "has_sig": false, "md5_digest": "f76a7b443fc41d682e77fa883f28d4f7", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 6241, "upload_time": "2020-02-04T01:35:30", "upload_time_iso_8601": "2020-02-04T01:35:30.973637Z", "url": "https://files.pythonhosted.org/packages/3a/e1/606160f17bd04bea9dfe4b69a8954c0f88eaa67101579cdc70998563a260/tame-0.0.1.tar.gz", "yanked": false}], "0.0.2": [{"comment_text": "", "digests": {"md5": "84c69fc9c725edf8ce9cffc44cbf08b6", "sha256": "36222bf714bcb24cb7955e5e6c13d8b25ff48b9a33cfe7233e45932099240962"}, "downloads": -1, "filename": "tame-0.0.2.tar.gz", "has_sig": false, "md5_digest": "84c69fc9c725edf8ce9cffc44cbf08b6", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 5845, "upload_time": "2020-04-02T02:32:01", "upload_time_iso_8601": "2020-04-02T02:32:01.359515Z", "url": "https://files.pythonhosted.org/packages/af/63/33a27771e50bfeb94f4928c05b1f6520603447fc1b923159d329655dfdfd/tame-0.0.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "84c69fc9c725edf8ce9cffc44cbf08b6", "sha256": "36222bf714bcb24cb7955e5e6c13d8b25ff48b9a33cfe7233e45932099240962"}, "downloads": -1, "filename": "tame-0.0.2.tar.gz", "has_sig": false, "md5_digest": "84c69fc9c725edf8ce9cffc44cbf08b6", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3", "size": 5845, "upload_time": "2020-04-02T02:32:01", "upload_time_iso_8601": "2020-04-02T02:32:01.359515Z", "url": "https://files.pythonhosted.org/packages/af/63/33a27771e50bfeb94f4928c05b1f6520603447fc1b923159d329655dfdfd/tame-0.0.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:58:13 2020"}