{"info": {"author": "Zac Adam-MacEwen", "author_email": "zadammac@kenshosec.com", "bugtrack_url": null, "classifiers": [], "description": "# Tapestry (Specialized Backup Tool)\n\n## Introduction\n\nTapestry is a bespoke data backup tool designed to provide secure and reliable backups without the need to trust the storage media/device. Written in python, Tapestry uses Gnu Privacy Guard (GPG) to generate archive \"blocks\" from targeted directories on a given system and reproduce those blocks in a same-or-similar organizational format  upon restoration. The tool automatically subdivides the archive into blocks of a user-configurable size without breaking the content data (that is, the  structure of individual files is maintained). The blocks are then encrypted using the users Disaster Recovery PGP key and presented as ready-to-move.\n\nFull documentation is available as part of DOCUMENTATION.md\n\n## Requirements\n\t-Python 3.6.7\n\t-Python-gnupg 0.4.2\n\t-GnuPG 2 or later, installed as default\n\n## Contribution and Acknowledgement\n\nBuilding Tapestry has been a large and time-consuming project, but it would have been even more so without the work of the developers of our dependencies - GnuPG, the Python-GnuPG module, and obvious python itself.\n\nIf you would like to contribute to the development of Tapestry, feel free to submit a pull request, or perhaps buy me a coffee at [ko-fi.com/KenshoSec](https://ko-fi.com/KenshoSec), or consider backing [@ZAdamMac on Github Sponsors](https://github.com/users/ZAdamMac/sponsorship.)\n\n## Security Considerations\nTapestry relies on Gnu Privacy Guard (GPG), a well-known FOSS implementation of the PGP protocol, in order to securely store the archives it generates, and also to provide a mechanism for verifying the individual who generated the backup. It does this using two separate keys - the Encryption Key (sometimes called the \"Disaster Recovery\" key, after the comment included on keys Tapestry generates) and an optional, though strongly recommended, signing key specified by the user.\n\n### Care and Feeding of the Disaster Recovery Key\nWhen you run Tapestry with the `--genKey` flag the program will export a new Disaster Recovery key from GPG as two separate files: `DR.key` and `DR-pub.key`. The former contains both the private and public keys of the RSA key-pair - the latter contains only the public portion.\n\nThe private key and its associated file should be kept in a secure location - preferably either on removable media accessible only by trusted administrators or possibly on the keyring of a single-user/single-machine system, protected by a pass-phrase. **The use of DR keys without pass-phrases is considered harmful and should not be implemented.** It is even recommendable that you change the pass-phrase of the DR key regularly. If you are using the DR key across several systems, it is recommended that you also generate a revocation certificate (see GPG's docs) so that it can be revoked in the event of compromise.\n\nBy design, the public key can be widely distributed if desired, as it cannot be used to decrypt files it was used to encrypt, and public keys are not meant to be held as secret anyway.\n\n### Reacting to Key Compromises\nIt's possible that your `DR.key` (private half) file may be compromised through misuse, overuse, carelessness, or malicious action. Don't panic. If your archives are stored remotely and on offline, removable media they will not be immediately accessible to an attacker, necessarily. The decision to destroy these archives or not is ultimately up to the user.\n\nIf a compromise of your key storage is not in your threat model, you can still issue the revocation certificate over your key server of choice, preventing further archives from being written to the corresponding public key. Doing only prevents new archives from being generated - the compromised key can still be used to open your files.\n\nDo not simply change the passphrase - it will not save you now. Simply revoke and delete the old key, and generate a new one. A tool is under consideration in the future for retroactively recreating .tap archives to use your new key. At present, the only solution is to follow the usual recommendations in generating a fresh backup.\n\n### Signing - Why and How\nIf you are a single user operating Tapestry on one machine and your threat model does not include the possibility of a forged archive being addressed to you, because you are only storing your archives offline and in a space you physically control, you do not need signing. \n\nHowever, if you are using Tapestry across many machines or you are concerned that your public key could be used to generate archives with malicious content, there is a solution, and it is part in parcel with the PGP protocol. In fact, it is the feature of cryptographic signatures that will allow future additions like a network storage mode to be used relatively safely.\n\nA cryptographic signature can be generated alongside the backup itself at relatively little computational and storage overhead, and the use of signing is highly encouraged. If a file with a corresponding signature is modified after signing, attempts to verify the signature is failed. Similarly, only the person in possession of the *private* key of a keypair can sign a document, thereby verifying that they themselves did so, assuming they retain control of their key and follow best practices.\n\n**A signature is not an assurance that there is no malicious code in the signed file or message.** It is merely an assurance of the identify of the person who signed the code. Under tapestry's use case, it is an assurance that the person who ran tapestry was in the possession of both the private key they used and its passphrase. ***Never*** *use a key with no passphrase for signing*. This practice is such a bad idea that Tapestry will choke and die if you try.\n\nTapestry cannot see the passphrase you use to unlock your signing key. Instead, we trust the local GPG installation's existing pinentry configuration to launch the appropriate pin-entry binary to collect the passphrase and unlock the key.\n\n\n### How to Store Keys\nI can't speak for everyone's use case and I'm also not an expert on the matter. I personally store the public key of the disaster recovery key on every device I intend to use it on. The private key lives on a USB drive along with a few tools I use for cleaning up computers, and can be imported if necessary. I also keep a paper copy of the private key.\n\nAs for my signing key, I am currently using my main signing key, which lives on an OpenPGP smart key. In point of fact, Tapestry is perfectly oblivious to how you choose to store your keys - if it can't find them in your keyring it assumes they don't exist.\n\n## Installation and First Time Setup\n### Dependencies\nIf you are lacking any of the above requirements, please install them first. GPG is available on most Linux distros by default.\n\nIn any event, it is likely you are missing python-gnupg. That's okay, we can get python modules using `pip` at the command line.\n\nUnder Linux:\n```\n    sudo pip install python-gnupg\n    sudo pip3 install python-gnupg\n```\n\nOnce you have all the requirements installed it's time to go ahead with installing Tapestry itself.\n\n### Installing Tapestry\nThe following steps are for if you wish to download Tapestry's source files and install them locally. You can install tapestry all in one step using pip, for example: `python3.6 -m pip install tapestry`. This will always get you the current production-release version.\n\n**1. Begin by downloading the latest release of tapestry and its signature from the official github repo.** While older versions are made available for users of the older versions to aid recovery, it is always recommended to use the most recent release version. You should also download the corresponding signature file so that we can verify it. I'll show you how. If you haven't already, this is a good time to obtain the key with the fingerprint \"E122 9B2A 2DF4 F2FE 50A5 A23F F373 FF4B 43FC 742F\" from an appropriate keyserver. You'll need it to verify the package.\n\n**2. Verify the signature.** Linux users can use Kleopatra, or they can open the terminal in the directory where they have stored the downloaded signature and file and run the following command:\n    `gpg --verify <sigfile>`\n\nIf the files have not been tampered with and you have correctly imported the public key belonging to Zachary Adam-MacEwen or its corresponding master key you should receive a message that the signature is valid. It may not be fully trusted - this is a limitation of GPG's web-of-trust principle and a sign that I am not getting enough people to sign my key!\n\n**3. Unpack the archive.** When you downloaded a release version of the program you downloaded a tarfile and the signature of that tarfile. Unpack the archive to a directory of your choosing - it makes no real difference to Tapestry's Operation.\n\n**4. Install Tapestry From Source** Point your command prompt at the directory where you unpacked tapestry and run the following commands:\n```commandline\npython setup.py sdist bdist_wheel\npip install .\n```\n\nOnce done, you can delete everything you unpacked except the tapestry.cfg configuration file, which you'll need.\n\n**4. First-Time Configuration** The `tapestry.cfg` file among the extracted files is a duplicate of either my own personal configuration or the configuration of the test instance. Either way it won't do you much good. Simply open the file in a text editor and make a few changes: \n 1.  The Environment Variable \"uid\" *must* match the username of the user who will be running Tapestry, as it appears in the directory structure.\n 2. CompID can be any value, but you should make it something that would make sense to you. A descriptor or the machine's host name would both serve well. This is especially important if you are using network storage or don't intend to label your physical disks.\n 3. Blocksize can be any size - the config file is expressed in MB. For most users the default should be sufficient - it ensures both the archive and its signature can be placed on the same single-layer DVD-R disk.\n 4. The \"expected FP\" value can be set to 0. When Tapestry generates your DR key for you, it will automatically set this value to the value of the new key.\n 5. \"Sign by Default\" controls the default signing of output files. ***It is very much recommended that signing of backups be done***. However, if you find this to be impractical (say, running Tapestry as an automated task at 3AM with the signing key on a smart card), you can set it to false, but I strongly encourage you to sign the backups before burning them. It is your only assurance that they haven't been tampered with since they were created.\n 7. Set any of the further values as you would like them, bearing in mind the following:\n  - The directory path shown is the top of a recursive dive. All of its subdirectories will be included\n  - category names (\"doc\") should be duplicated where possible between /nix and /Win, but cannot be duplicated internally.\n  - Default Locations will be backed up with a simple call to the program. Additional locations require the additional argument `--inc` to be passed at runtime.\n 8. Set the recovery and output paths as desired. **If you are recovering from physical media, set the recovery path to `/media/` or the drive letter for the device.**\n 9. Save your configuration and consider backing it up to a spare removable drive now. It's possible to recover without your original configuration file, but not nearly as easy.\n 10. Launch tapestry with the argument `--genKey`. This will cause the program to generate and export the keys you need in order to operate it. (You may then delete the secret key from the keyring manually at your own discretion).\n\nCongratulations, Tapestry is now ready to use.\n\n## Regular Use\n***Note: After 2.0.0, all runs of Tapestry MUST include a reference to a configuration file in the format `-c <some config file>`!***\n\nDuring regular operation, Tapestry is pretty straightforward to use. The main choice is whether or not to invoke it using `--inc` or not. This is going to depend a lot on your threat model and backup policy. I use `--inc` about every 3 months, but my inclusive operation only adds music and videos to the list, and I don't change those directories often.\n\nTapestry can also be scheduled as a cron job or triggered using the Windows Task Scheduler.\n\nBefore running Tapestry, it is important to scan your computer for malware to ensure everything is good and clean before backing up, as Tapestry currently provides no means of ensuring the contents of a backup are \"clean\". Obviously, recovering from an infected backup would put you right back where to started, so check first!\n\n## Recovery Options\nRecovering under tapestry is as easy as making sure the correct secret key is available on the keyring, or otherwise present, inserting one of the disks from a Tapestry backup, and running tapestry with the `--rcv` argument. Tapestry will automatically recover your files to the category locations defined in the local config file! If no location is given in `Tapestry.cfg`, that's okay - Tapestry will create a subdirectory in its output directory for that category and unpack your files there!\n\n\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://www.github.com/zadammac/Tapestry", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "tapestry", "package_url": "https://pypi.org/project/tapestry/", "platform": "", "project_url": "https://pypi.org/project/tapestry/", "project_urls": {"Homepage": "https://www.github.com/zadammac/Tapestry"}, "release_url": "https://pypi.org/project/tapestry/2.1.0/", "requires_dist": ["python-gnupg", "pysftp", "paramiko"], "requires_python": "", "summary": "Tapestry Bespoke Backup Utility", "version": "2.1.0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Tapestry (Specialized Backup Tool)</h1>\n<h2>Introduction</h2>\n<p>Tapestry is a bespoke data backup tool designed to provide secure and reliable backups without the need to trust the storage media/device. Written in python, Tapestry uses Gnu Privacy Guard (GPG) to generate archive \"blocks\" from targeted directories on a given system and reproduce those blocks in a same-or-similar organizational format  upon restoration. The tool automatically subdivides the archive into blocks of a user-configurable size without breaking the content data (that is, the  structure of individual files is maintained). The blocks are then encrypted using the users Disaster Recovery PGP key and presented as ready-to-move.</p>\n<p>Full documentation is available as part of DOCUMENTATION.md</p>\n<h2>Requirements</h2>\n<pre><code>-Python 3.6.7\n-Python-gnupg 0.4.2\n-GnuPG 2 or later, installed as default\n</code></pre>\n<h2>Contribution and Acknowledgement</h2>\n<p>Building Tapestry has been a large and time-consuming project, but it would have been even more so without the work of the developers of our dependencies - GnuPG, the Python-GnuPG module, and obvious python itself.</p>\n<p>If you would like to contribute to the development of Tapestry, feel free to submit a pull request, or perhaps buy me a coffee at <a href=\"https://ko-fi.com/KenshoSec\" rel=\"nofollow\">ko-fi.com/KenshoSec</a>, or consider backing <a href=\"https://github.com/users/ZAdamMac/sponsorship.\" rel=\"nofollow\">@ZAdamMac on Github Sponsors</a></p>\n<h2>Security Considerations</h2>\n<p>Tapestry relies on Gnu Privacy Guard (GPG), a well-known FOSS implementation of the PGP protocol, in order to securely store the archives it generates, and also to provide a mechanism for verifying the individual who generated the backup. It does this using two separate keys - the Encryption Key (sometimes called the \"Disaster Recovery\" key, after the comment included on keys Tapestry generates) and an optional, though strongly recommended, signing key specified by the user.</p>\n<h3>Care and Feeding of the Disaster Recovery Key</h3>\n<p>When you run Tapestry with the <code>--genKey</code> flag the program will export a new Disaster Recovery key from GPG as two separate files: <code>DR.key</code> and <code>DR-pub.key</code>. The former contains both the private and public keys of the RSA key-pair - the latter contains only the public portion.</p>\n<p>The private key and its associated file should be kept in a secure location - preferably either on removable media accessible only by trusted administrators or possibly on the keyring of a single-user/single-machine system, protected by a pass-phrase. <strong>The use of DR keys without pass-phrases is considered harmful and should not be implemented.</strong> It is even recommendable that you change the pass-phrase of the DR key regularly. If you are using the DR key across several systems, it is recommended that you also generate a revocation certificate (see GPG's docs) so that it can be revoked in the event of compromise.</p>\n<p>By design, the public key can be widely distributed if desired, as it cannot be used to decrypt files it was used to encrypt, and public keys are not meant to be held as secret anyway.</p>\n<h3>Reacting to Key Compromises</h3>\n<p>It's possible that your <code>DR.key</code> (private half) file may be compromised through misuse, overuse, carelessness, or malicious action. Don't panic. If your archives are stored remotely and on offline, removable media they will not be immediately accessible to an attacker, necessarily. The decision to destroy these archives or not is ultimately up to the user.</p>\n<p>If a compromise of your key storage is not in your threat model, you can still issue the revocation certificate over your key server of choice, preventing further archives from being written to the corresponding public key. Doing only prevents new archives from being generated - the compromised key can still be used to open your files.</p>\n<p>Do not simply change the passphrase - it will not save you now. Simply revoke and delete the old key, and generate a new one. A tool is under consideration in the future for retroactively recreating .tap archives to use your new key. At present, the only solution is to follow the usual recommendations in generating a fresh backup.</p>\n<h3>Signing - Why and How</h3>\n<p>If you are a single user operating Tapestry on one machine and your threat model does not include the possibility of a forged archive being addressed to you, because you are only storing your archives offline and in a space you physically control, you do not need signing.</p>\n<p>However, if you are using Tapestry across many machines or you are concerned that your public key could be used to generate archives with malicious content, there is a solution, and it is part in parcel with the PGP protocol. In fact, it is the feature of cryptographic signatures that will allow future additions like a network storage mode to be used relatively safely.</p>\n<p>A cryptographic signature can be generated alongside the backup itself at relatively little computational and storage overhead, and the use of signing is highly encouraged. If a file with a corresponding signature is modified after signing, attempts to verify the signature is failed. Similarly, only the person in possession of the <em>private</em> key of a keypair can sign a document, thereby verifying that they themselves did so, assuming they retain control of their key and follow best practices.</p>\n<p><strong>A signature is not an assurance that there is no malicious code in the signed file or message.</strong> It is merely an assurance of the identify of the person who signed the code. Under tapestry's use case, it is an assurance that the person who ran tapestry was in the possession of both the private key they used and its passphrase. <em><strong>Never</strong></em> <em>use a key with no passphrase for signing</em>. This practice is such a bad idea that Tapestry will choke and die if you try.</p>\n<p>Tapestry cannot see the passphrase you use to unlock your signing key. Instead, we trust the local GPG installation's existing pinentry configuration to launch the appropriate pin-entry binary to collect the passphrase and unlock the key.</p>\n<h3>How to Store Keys</h3>\n<p>I can't speak for everyone's use case and I'm also not an expert on the matter. I personally store the public key of the disaster recovery key on every device I intend to use it on. The private key lives on a USB drive along with a few tools I use for cleaning up computers, and can be imported if necessary. I also keep a paper copy of the private key.</p>\n<p>As for my signing key, I am currently using my main signing key, which lives on an OpenPGP smart key. In point of fact, Tapestry is perfectly oblivious to how you choose to store your keys - if it can't find them in your keyring it assumes they don't exist.</p>\n<h2>Installation and First Time Setup</h2>\n<h3>Dependencies</h3>\n<p>If you are lacking any of the above requirements, please install them first. GPG is available on most Linux distros by default.</p>\n<p>In any event, it is likely you are missing python-gnupg. That's okay, we can get python modules using <code>pip</code> at the command line.</p>\n<p>Under Linux:</p>\n<pre><code>    sudo pip install python-gnupg\n    sudo pip3 install python-gnupg\n</code></pre>\n<p>Once you have all the requirements installed it's time to go ahead with installing Tapestry itself.</p>\n<h3>Installing Tapestry</h3>\n<p>The following steps are for if you wish to download Tapestry's source files and install them locally. You can install tapestry all in one step using pip, for example: <code>python3.6 -m pip install tapestry</code>. This will always get you the current production-release version.</p>\n<p><strong>1. Begin by downloading the latest release of tapestry and its signature from the official github repo.</strong> While older versions are made available for users of the older versions to aid recovery, it is always recommended to use the most recent release version. You should also download the corresponding signature file so that we can verify it. I'll show you how. If you haven't already, this is a good time to obtain the key with the fingerprint \"E122 9B2A 2DF4 F2FE 50A5 A23F F373 FF4B 43FC 742F\" from an appropriate keyserver. You'll need it to verify the package.</p>\n<p><strong>2. Verify the signature.</strong> Linux users can use Kleopatra, or they can open the terminal in the directory where they have stored the downloaded signature and file and run the following command:\n<code>gpg --verify &lt;sigfile&gt;</code></p>\n<p>If the files have not been tampered with and you have correctly imported the public key belonging to Zachary Adam-MacEwen or its corresponding master key you should receive a message that the signature is valid. It may not be fully trusted - this is a limitation of GPG's web-of-trust principle and a sign that I am not getting enough people to sign my key!</p>\n<p><strong>3. Unpack the archive.</strong> When you downloaded a release version of the program you downloaded a tarfile and the signature of that tarfile. Unpack the archive to a directory of your choosing - it makes no real difference to Tapestry's Operation.</p>\n<p><strong>4. Install Tapestry From Source</strong> Point your command prompt at the directory where you unpacked tapestry and run the following commands:</p>\n<pre>python setup.py sdist bdist_wheel\npip install .\n</pre>\n<p>Once done, you can delete everything you unpacked except the tapestry.cfg configuration file, which you'll need.</p>\n<p><strong>4. First-Time Configuration</strong> The <code>tapestry.cfg</code> file among the extracted files is a duplicate of either my own personal configuration or the configuration of the test instance. Either way it won't do you much good. Simply open the file in a text editor and make a few changes:</p>\n<ol>\n<li>The Environment Variable \"uid\" <em>must</em> match the username of the user who will be running Tapestry, as it appears in the directory structure.</li>\n<li>CompID can be any value, but you should make it something that would make sense to you. A descriptor or the machine's host name would both serve well. This is especially important if you are using network storage or don't intend to label your physical disks.</li>\n<li>Blocksize can be any size - the config file is expressed in MB. For most users the default should be sufficient - it ensures both the archive and its signature can be placed on the same single-layer DVD-R disk.</li>\n<li>The \"expected FP\" value can be set to 0. When Tapestry generates your DR key for you, it will automatically set this value to the value of the new key.</li>\n<li>\"Sign by Default\" controls the default signing of output files. <em><strong>It is very much recommended that signing of backups be done</strong></em>. However, if you find this to be impractical (say, running Tapestry as an automated task at 3AM with the signing key on a smart card), you can set it to false, but I strongly encourage you to sign the backups before burning them. It is your only assurance that they haven't been tampered with since they were created.</li>\n<li>Set any of the further values as you would like them, bearing in mind the following:</li>\n</ol>\n<ul>\n<li>The directory path shown is the top of a recursive dive. All of its subdirectories will be included</li>\n<li>category names (\"doc\") should be duplicated where possible between /nix and /Win, but cannot be duplicated internally.</li>\n<li>Default Locations will be backed up with a simple call to the program. Additional locations require the additional argument <code>--inc</code> to be passed at runtime.</li>\n</ul>\n<ol>\n<li>Set the recovery and output paths as desired. <strong>If you are recovering from physical media, set the recovery path to <code>/media/</code> or the drive letter for the device.</strong></li>\n<li>Save your configuration and consider backing it up to a spare removable drive now. It's possible to recover without your original configuration file, but not nearly as easy.</li>\n<li>Launch tapestry with the argument <code>--genKey</code>. This will cause the program to generate and export the keys you need in order to operate it. (You may then delete the secret key from the keyring manually at your own discretion).</li>\n</ol>\n<p>Congratulations, Tapestry is now ready to use.</p>\n<h2>Regular Use</h2>\n<p><em><strong>Note: After 2.0.0, all runs of Tapestry MUST include a reference to a configuration file in the format <code>-c &lt;some config file&gt;</code>!</strong></em></p>\n<p>During regular operation, Tapestry is pretty straightforward to use. The main choice is whether or not to invoke it using <code>--inc</code> or not. This is going to depend a lot on your threat model and backup policy. I use <code>--inc</code> about every 3 months, but my inclusive operation only adds music and videos to the list, and I don't change those directories often.</p>\n<p>Tapestry can also be scheduled as a cron job or triggered using the Windows Task Scheduler.</p>\n<p>Before running Tapestry, it is important to scan your computer for malware to ensure everything is good and clean before backing up, as Tapestry currently provides no means of ensuring the contents of a backup are \"clean\". Obviously, recovering from an infected backup would put you right back where to started, so check first!</p>\n<h2>Recovery Options</h2>\n<p>Recovering under tapestry is as easy as making sure the correct secret key is available on the keyring, or otherwise present, inserting one of the disks from a Tapestry backup, and running tapestry with the <code>--rcv</code> argument. Tapestry will automatically recover your files to the category locations defined in the local config file! If no location is given in <code>Tapestry.cfg</code>, that's okay - Tapestry will create a subdirectory in its output directory for that category and unpack your files there!</p>\n\n          </div>"}, "last_serial": 7069094, "releases": {"2.0.0": [{"comment_text": "", "digests": {"md5": "8ea1f96544fb5d3d17066231926777fe", "sha256": "ccf2d718674719a0781cb72167b97298bc3eaf2716236612b4737557f99da873"}, "downloads": -1, "filename": "tapestry-2.0.0-py3-none-any.whl", "has_sig": false, "md5_digest": "8ea1f96544fb5d3d17066231926777fe", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 36444, "upload_time": "2019-04-17T10:09:11", "upload_time_iso_8601": "2019-04-17T10:09:11.750621Z", "url": "https://files.pythonhosted.org/packages/8c/21/9527778ee5719c17d7c07afd13fd57cd4c60b871a7a9536ba97fc1111297/tapestry-2.0.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "54f5b09c5d108528d85e66fa9c71d365", "sha256": "e4fdad812f091b3244373fee2ed6d4019ea9ab797ce226d269638d3aadda13b1"}, "downloads": -1, "filename": "tapestry-2.0.0.tar.gz", "has_sig": false, "md5_digest": "54f5b09c5d108528d85e66fa9c71d365", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 22934, "upload_time": "2019-04-17T10:09:14", "upload_time_iso_8601": "2019-04-17T10:09:14.132548Z", "url": "https://files.pythonhosted.org/packages/7f/dd/f27ec71800672b7e369fe19fb2e66d97fb176d38c938bb39b6f262e74b46/tapestry-2.0.0.tar.gz", "yanked": false}], "2.0.0.post1": [{"comment_text": "", "digests": {"md5": "46a00899ee82f3695968e392621b7e78", "sha256": "beb653abb3a6e04b9afe589fa2b66e86d1363ed2ccecabbcaee724a9b6af9ff1"}, "downloads": -1, "filename": "tapestry-2.0.0.post1-py3-none-any.whl", "has_sig": false, "md5_digest": "46a00899ee82f3695968e392621b7e78", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 36536, "upload_time": "2019-04-17T14:50:00", "upload_time_iso_8601": "2019-04-17T14:50:00.862307Z", "url": "https://files.pythonhosted.org/packages/2f/97/74b659c53834820c65613ba952b337e20bc1c213f1c4f1ebbe2626b3e721/tapestry-2.0.0.post1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d250351d0c0503992a94f2864ef1f1da", "sha256": "fbda1f2592f9576eb95dc5d081a19a549542900080c25ccbe06126db489e09ac"}, "downloads": -1, "filename": "tapestry-2.0.0.post1.tar.gz", "has_sig": false, "md5_digest": "d250351d0c0503992a94f2864ef1f1da", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 22979, "upload_time": "2019-04-17T14:50:02", "upload_time_iso_8601": "2019-04-17T14:50:02.864845Z", "url": "https://files.pythonhosted.org/packages/72/e7/45f124d309f13c9a403659d4d911a4ee5d7dabb058e06559ea2c50bd5c5d/tapestry-2.0.0.post1.tar.gz", "yanked": false}], "2.0.1": [{"comment_text": "", "digests": {"md5": "06352fc20176e024bb8c7a70239818ab", "sha256": "b1ed42ee48af7cf101819518b4866a8e140c73c201a7e9d430f7f4eeba92947e"}, "downloads": -1, "filename": "tapestry-2.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "06352fc20176e024bb8c7a70239818ab", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 36548, "upload_time": "2019-05-14T23:52:38", "upload_time_iso_8601": "2019-05-14T23:52:38.464979Z", "url": "https://files.pythonhosted.org/packages/88/fa/596774208c980735598dc1e64c6c227bbb780776697eb625d0fa5de069b8/tapestry-2.0.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "57ae421f80a9c47f74dd886d07ad2691", "sha256": "d0c23e89484e485d6808702611f99751d22a94ad4063beb81184ff25e456f5a7"}, "downloads": -1, "filename": "tapestry-2.0.1.tar.gz", "has_sig": false, "md5_digest": "57ae421f80a9c47f74dd886d07ad2691", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23024, "upload_time": "2019-05-14T23:52:40", "upload_time_iso_8601": "2019-05-14T23:52:40.136924Z", "url": "https://files.pythonhosted.org/packages/5f/84/7355f09d2640d72eab7dbd94ec0f920bdd00c20d93e876735800ffc96a43/tapestry-2.0.1.tar.gz", "yanked": false}], "2.0.2": [{"comment_text": "", "digests": {"md5": "6ad9d9d196129d389e6bc2e68d142779", "sha256": "10ac25a1639fdfcd5cd0ce9e5dba02fb8dbda4f2c9d735f27c4b7693dc4c2298"}, "downloads": -1, "filename": "tapestry-2.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "6ad9d9d196129d389e6bc2e68d142779", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 36703, "upload_time": "2019-10-13T18:00:35", "upload_time_iso_8601": "2019-10-13T18:00:35.745244Z", "url": "https://files.pythonhosted.org/packages/43/57/bcc70c0ea2e3c669c2b63e000ec5155b6735f4ec31c1aee98763510d0670/tapestry-2.0.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "0496c034c69735e6f12b76f0bb71b6df", "sha256": "1007173449832da38c176b124832170f20c47217c1935b4eb61144d97c1eb4ef"}, "downloads": -1, "filename": "tapestry-2.0.2.tar.gz", "has_sig": false, "md5_digest": "0496c034c69735e6f12b76f0bb71b6df", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23168, "upload_time": "2019-10-13T18:00:37", "upload_time_iso_8601": "2019-10-13T18:00:37.574665Z", "url": "https://files.pythonhosted.org/packages/88/23/e39defec058cfd3200deb7c651a6ac65ff1124ccf08f9616effa09a8f232/tapestry-2.0.2.tar.gz", "yanked": false}], "2.1.0": [{"comment_text": "", "digests": {"md5": "c9adbf98988efbb30d2b0aae4c0cd4ff", "sha256": "b9ab3dd18ce240ed7657c40773f8175d02313ddc45fdbe756c94ad6c68a857d1"}, "downloads": -1, "filename": "tapestry-2.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "c9adbf98988efbb30d2b0aae4c0cd4ff", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 44199, "upload_time": "2020-04-21T16:12:55", "upload_time_iso_8601": "2020-04-21T16:12:55.156886Z", "url": "https://files.pythonhosted.org/packages/a8/de/b52296e3b3320e3aac6f5078a6018261209a1b69d7a8958635079ad797c6/tapestry-2.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9b02536e22a2f94893bcb2669fe836e3", "sha256": "95fa7167ba24a82a30ae227a67fa76351bc1368216132aafff3a5c578b81b089"}, "downloads": -1, "filename": "tapestry-2.1.0.tar.gz", "has_sig": false, "md5_digest": "9b02536e22a2f94893bcb2669fe836e3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30312, "upload_time": "2020-04-21T16:12:56", "upload_time_iso_8601": "2020-04-21T16:12:56.343446Z", "url": "https://files.pythonhosted.org/packages/b8/64/c32151e3b994bd519f347425f5b906502194cc37d2f636101909a0bf2c75/tapestry-2.1.0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "c9adbf98988efbb30d2b0aae4c0cd4ff", "sha256": "b9ab3dd18ce240ed7657c40773f8175d02313ddc45fdbe756c94ad6c68a857d1"}, "downloads": -1, "filename": "tapestry-2.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "c9adbf98988efbb30d2b0aae4c0cd4ff", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 44199, "upload_time": "2020-04-21T16:12:55", "upload_time_iso_8601": "2020-04-21T16:12:55.156886Z", "url": "https://files.pythonhosted.org/packages/a8/de/b52296e3b3320e3aac6f5078a6018261209a1b69d7a8958635079ad797c6/tapestry-2.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9b02536e22a2f94893bcb2669fe836e3", "sha256": "95fa7167ba24a82a30ae227a67fa76351bc1368216132aafff3a5c578b81b089"}, "downloads": -1, "filename": "tapestry-2.1.0.tar.gz", "has_sig": false, "md5_digest": "9b02536e22a2f94893bcb2669fe836e3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 30312, "upload_time": "2020-04-21T16:12:56", "upload_time_iso_8601": "2020-04-21T16:12:56.343446Z", "url": "https://files.pythonhosted.org/packages/b8/64/c32151e3b994bd519f347425f5b906502194cc37d2f636101909a0bf2c75/tapestry-2.1.0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:58:07 2020"}