{"info": {"author": "Teradata Corporation", "author_email": "teradatasql@teradata.com", "bugtrack_url": null, "classifiers": ["Development Status :: 5 - Production/Stable", "License :: Other/Proprietary License", "Operating System :: MacOS :: MacOS X", "Operating System :: Microsoft :: Windows", "Operating System :: POSIX :: Linux", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: 3 :: Only", "Topic :: Database :: Front-Ends"], "description": "## Teradata SQL Driver for Python\n\nThis package enables Python applications to connect to the Teradata Database.\n\nThis package implements the [PEP-249 Python Database API Specification 2.0](https://www.python.org/dev/peps/pep-0249/).\n\nThis package requires 64-bit Python 3.4 or later, and runs on Windows, macOS, and Linux. 32-bit Python is not supported.\n\nFor community support, please visit the [Teradata Community forums](https://community.teradata.com/).\n\nFor Teradata customer support, please visit [Teradata Access](https://access.teradata.com/).\n\nPlease note, this driver may contain beta/preview features (\"Beta Features\"). As such, by downloading and/or using the driver, in addition to agreeing to the licensing terms below, you acknowledge that the Beta Features are experimental in nature and that the Beta Features are provided \"AS IS\" and may not be functional on any machine or in any environment.\n\nCopyright 2020 Teradata. All Rights Reserved.\n\n### Table of Contents\n\n* [Features](#Features)\n* [Limitations](#Limitations)\n* [Installation](#Installation)\n* [License](#License)\n* [Documentation](#Documentation)\n* [Sample Programs](#SamplePrograms)\n* [Using the Teradata SQL Driver for Python](#Using)\n* [Connection Parameters](#ConnectionParameters)\n* [COP Discovery](#COPDiscovery)\n* [Stored Password Protection](#StoredPasswordProtection)\n* [Transaction Mode](#TransactionMode)\n* [Auto-Commit](#AutoCommit)\n* [Data Types](#DataTypes)\n* [Null Values](#NullValues)\n* [Character Export Width](#CharacterExportWidth)\n* [Module Constructors](#ModuleConstructors)\n* [Module Globals](#ModuleGlobals)\n* [Module Exceptions](#ModuleExceptions)\n* [Connection Methods](#ConnectionMethods)\n* [Cursor Attributes](#CursorAttributes)\n* [Cursor Methods](#CursorMethods)\n* [Type Objects](#TypeObjects)\n* [Escape Syntax](#EscapeSyntax)\n* [FastLoad](#FastLoad)\n* [Change Log](#ChangeLog)\n\nTable of Contents links do not work on PyPI due to a [PyPI limitation](https://github.com/pypa/warehouse/issues/4064).\n\n<a name=\"Features\"></a>\n\n### Features\n\nThe *Teradata SQL Driver for Python* is a DBAPI Driver that enables Python applications to connect to the Teradata Database. The Teradata SQL Driver for Python implements the [PEP-249 Python Database API Specification 2.0](https://www.python.org/dev/peps/pep-0249/).\n\nThe Teradata SQL Driver for Python is a young product that offers a basic feature set. We are working diligently to add features to the Teradata SQL Driver for Python, and our goal is feature parity with the Teradata JDBC Driver.\n\nAt the present time, the Teradata SQL Driver for Python offers the following features.\n\n* Supported for use with Teradata Database 14.10 and later releases. Informally tested to work with Teradata Database 12.0 and later releases.\n* COP Discovery.\n* Encrypted logon using the `TD2`, `JWT`, `LDAP`, `KRB5` (Kerberos), or `TDNEGO` logon mechanisms.\n* Data encryption enabled via the `encryptdata` connection parameter.\n* Unicode character data transferred via the UTF8 session character set.\n* Auto-commit for ANSI and TERA transaction modes.\n* 1 MB rows supported with Teradata Database 16.0 and later.\n* Multi-statement requests that return multiple result sets.\n* Most JDBC escape syntax.\n* Parameterized SQL requests with question-mark parameter markers.\n* Parameterized batch SQL requests with multiple rows of data bound to question-mark parameter markers.\n* ElicitFile protocol support for DDL commands that create external UDFs or stored procedures and upload a file from client to database.\n* `CREATE PROCEDURE` and `REPLACE PROCEDURE` commands.\n* Stored Procedure Dynamic Result Sets.\n\n<a name=\"Limitations\"></a>\n\n### Limitations\n\n* The UTF8 session character set is always used. The `charset` connection parameter is not supported.\n* The following complex data types are not supported yet: `JSON`, `DATASET STORAGE FORMAT AVRO`, and `DATASET STORAGE FORMAT CSV`.\n* No support yet for data encryption that is governed by central administration. To enable data encryption, you must specify a `true` value for the `encryptdata` connection parameter.\n* Laddered Concurrent Connect is not supported yet.\n* No support yet for Recoverable Network Protocol and Redrive.\n* FastExport is not available yet.\n* Monitor partition support is not available yet.\n\n<a name=\"Installation\"></a>\n\n### Installation\n\nThe Teradata SQL Driver for Python depends on the `pycryptodome` package which is available from PyPI.\n\nUse `pip install` to download and install the Teradata SQL Driver for Python and its dependencies automatically.\n\nPlatform       | Command\n-------------- | ---\nmacOS or Linux | `pip install teradatasql`\nWindows        | `py -3 -m pip install teradatasql`\n\nWhen upgrading to a new version of the Teradata SQL Driver for Python, you may need to use pip install's `--no-cache-dir` option to force the download of the new version.\n\nPlatform       | Command\n-------------- | ---\nmacOS or Linux | `pip install --no-cache-dir -U teradatasql`\nWindows        | `py -3 -m pip install --no-cache-dir -U teradatasql`\n\n<a name=\"License\"></a>\n\n### License\n\nUse of the Teradata SQL Driver for Python is governed by the *License Agreement for the Teradata SQL Driver for Python*.\n\nWhen the Teradata SQL Driver for Python is installed, the `LICENSE` and `THIRDPARTYLICENSE` files are placed in the `teradatasql` directory under your Python installation directory.\n\nIn addition to the license terms, the driver may contain beta/preview features (\"Beta Features\"). As such, by downloading and/or using the driver, in addition to the licensing terms, you acknowledge that the Beta Features are experimental in nature and that the Beta Features are provided \"AS IS\" and may not be functional on any machine or in any environment.\n\n<a name=\"Documentation\"></a>\n\n### Documentation\n\nWhen the Teradata SQL Driver for Python is installed, the `README.md` file is placed in the `teradatasql` directory under your Python installation directory. This permits you to view the documentation offline, when you are not connected to the Internet.\n\nThe `README.md` file is a plain text file containing the documentation for the Teradata SQL Driver for Python. While the file can be viewed with any text file viewer or editor, your viewing experience will be best with an editor that understands Markdown format.\n\n<a name=\"SamplePrograms\"></a>\n\n### Sample Programs\n\nSample programs are provided to demonstrate how to use the Teradata SQL Driver for Python. When the Teradata SQL Driver for Python is installed, the sample programs are placed in the `teradatasql/samples` directory under your Python installation directory.\n\nThe sample programs are coded with a fake Teradata Database hostname `whomooz`, username `guest`, and password `please`. Substitute your actual Teradata Database hostname and credentials before running a sample program.\n\nProgram                                                                                                             | Purpose\n------------------------------------------------------------------------------------------------------------------- | ---\n[BatchInsert.py](https://github.com/Teradata/python-driver/blob/master/samples/BatchInsert.py)                      | Demonstrates how to insert a batch of rows\n[BatchInsPerf.py](https://github.com/Teradata/python-driver/blob/master/samples/BatchInsPerf.py)                    | Measures time to insert one million rows\n[CharPadding.py](https://github.com/Teradata/python-driver/blob/master/samples/CharPadding.py)                      | Demonstrates the Teradata Database's _Character Export Width_ behavior\n[CommitRollback.py](https://github.com/Teradata/python-driver/blob/master/samples/CommitRollback.py)                | Demonstrates commit and rollback methods with auto-commit off.\n[DriverDatabaseVersion.py](https://github.com/Teradata/python-driver/blob/master/samples/DriverDatabaseVersion.py)  | Displays the Teradata SQL Driver version and Teradata Database version\n[ElicitFile.py](https://github.com/Teradata/python-driver/blob/master/samples/ElicitFile.py)                        | Demonstrates C source file upload to create a User-Defined Function (UDF)\n[FakeResultSetCon.py](https://github.com/Teradata/python-driver/blob/master/samples/FakeResultSetCon.py)            | Demonstrates connection parameter for fake result sets\n[FakeResultSetEsc.py](https://github.com/Teradata/python-driver/blob/master/samples/FakeResultSetEsc.py)            | Demonstrates escape function for fake result sets\n[FastLoadBatch.py](https://github.com/Teradata/python-driver/blob/master/samples/FastLoadBatch.py)                  | Demonstrates how to FastLoad batches of rows\n[HelpSession.py](https://github.com/Teradata/python-driver/blob/master/samples/HelpSession.py)                      | Displays session information\n[IgnoreErrors.py](https://github.com/Teradata/python-driver/blob/master/samples/IgnoreErrors.py)                    | Demonstrates how to ignore errors\n[InsertXML.py](https://github.com/Teradata/python-driver/blob/master/samples/InsertXML.py)                          | Demonstrates how to insert and retrieve XML values\n[LoadCSVFile.py](https://github.com/Teradata/python-driver/blob/master/samples/LoadCSVFile.py)                      | Demonstrates how to load data from a CSV file into a table\n[MetadataFromPrepare.py](https://github.com/Teradata/python-driver/blob/master/samples/MetadataFromPrepare.py)      | Demonstrates how to prepare a SQL request and obtain SQL statement metadata\n[ParamDataTypes.py](https://github.com/Teradata/python-driver/blob/master/samples/ParamDataTypes.py)                | Demonstrates how to specify data types for parameter marker bind values\n[StoredProc.py](https://github.com/Teradata/python-driver/blob/master/samples/StoredProc.py)                        | Demonstrates how to create and call a SQL stored procedure\n[TJEncryptPassword.py](https://github.com/Teradata/python-driver/blob/master/samples/TJEncryptPassword.py)          | Creates encrypted password files\n\n<a name=\"Using\"></a>\n\n### Using the Teradata SQL Driver for Python\n\nYour Python script must import the `teradatasql` package in order to use the Teradata SQL Driver for Python.\n\n    import teradatasql\n\nAfter importing the `teradatasql` package, your Python script calls the `teradatasql.connect` function to open a connection to the Teradata Database.\n\nYou may specify connection parameters as a JSON string, as `kwargs`, or using a combination of the two approaches. The `teradatasql.connect` function's first argument is an optional JSON string. The `teradatasql.connect` function's second and subsequent arguments are optional `kwargs`.\n\nConnection parameters specified only as `kwargs`:\n\n    con = teradatasql.connect(host=\"whomooz\", user=\"guest\", password=\"please\")\n\nConnection parameters specified only as a JSON string:\n\n    con = teradatasql.connect('{\"host\":\"whomooz\",\"user\":\"guest\",\"password\":\"please\"}')\n\nConnection parameters specified using a combination:\n\n    con = teradatasql.connect('{\"host\":\"whomooz\"}', user=\"guest\", password=\"please\")\n\nWhen a combination of parameters are specified, connection parameters specified as `kwargs` take precedence over same-named connection parameters specified in the JSON string.\n\n<a name=\"ConnectionParameters\"></a>\n\n### Connection Parameters\n\nThe following table lists the connection parameters currently offered by the Teradata SQL Driver for Python.\n\nOur goal is consistency for the connection parameters offered by the Teradata SQL Driver for Python and the Teradata JDBC Driver, with respect to connection parameter names and functionality. For comparison, Teradata JDBC Driver connection parameters are [documented here](https://downloads.teradata.com/doc/connectivity/jdbc/reference/current/jdbcug_chapter_2.html#BGBHDDGB).\n\nParameter          | Default     | Type           | Description\n------------------ | ----------- | -------------- | ---\n`account`          |             | string         | Specifies the Teradata Database account. Equivalent to the Teradata JDBC Driver `ACCOUNT` connection parameter.\n`column_name`      | `\"false\"`   | quoted boolean | Controls the behavior of cursor `.description` sequence `name` items. Equivalent to the Teradata JDBC Driver `COLUMN_NAME` connection parameter. False specifies that a cursor `.description` sequence `name` item provides the AS-clause name if available, or the column name if available, or the column title. True specifies that a cursor `.description` sequence `name` item provides the column name if available, but has no effect when StatementInfo parcel support is unavailable.\n`cop`              | `\"true\"`    | quoted boolean | Specifies whether COP Discovery is performed. Equivalent to the Teradata JDBC Driver `COP` connection parameter.\n`coplast`          | `\"false\"`   | quoted boolean | Specifies how COP Discovery determines the last COP hostname. Equivalent to the Teradata JDBC Driver `COPLAST` connection parameter. When `coplast` is `false` or omitted, or COP Discovery is turned off, then no DNS lookup occurs for the coplast hostname. When `coplast` is `true`, and COP Discovery is turned on, then a DNS lookup occurs for a coplast hostname.\n`database`         |             | string         | Specifies the initial database to use after logon, instead of the user's default database. Equivalent to the Teradata JDBC Driver `DATABASE` connection parameter.\n`dbs_port`         | `\"1025\"`    | quoted integer | Specifies the Teradata Database port number. Equivalent to the Teradata JDBC Driver `DBS_PORT` connection parameter.\n`encryptdata`      | `\"false\"`   | quoted boolean | Controls encryption of data exchanged between the Teradata Database and the Teradata SQL Driver for Python. Equivalent to the Teradata JDBC Driver `ENCRYPTDATA` connection parameter.\n`fake_result_sets` | `\"false\"`   | quoted boolean | Controls whether a fake result set containing statement metadata precedes each real result set.\n`host`             |             | string         | Specifies the Teradata Database hostname.\n`lob_support`      | `\"true\"`    | quoted boolean | Controls LOB support. Equivalent to the Teradata JDBC Driver `LOB_SUPPORT` connection parameter.\n`log`              | `\"0\"`       | quoted integer | Controls debug logging. Somewhat equivalent to the Teradata JDBC Driver `LOG` connection parameter. This parameter's behavior is subject to change in the future. This parameter's value is currently defined as an integer in which the 1-bit governs function and method tracing, the 2-bit governs debug logging, the 4-bit governs transmit and receive message hex dumps, and the 8-bit governs timing. Compose the value by adding together 1, 2, 4, and/or 8.\n`logdata`          |             | string         | Specifies extra data for the chosen logon authentication method. Equivalent to the Teradata JDBC Driver `LOGDATA` connection parameter.\n`logmech`          | `\"TD2\"`     | string         | Specifies the logon authentication method. Equivalent to the Teradata JDBC Driver `LOGMECH` connection parameter. Possible values are `TD2` (the default), `JWT`, `LDAP`, `KRB5` for Kerberos, or `TDNEGO`.\n`max_message_body` | `\"2097000\"` | quoted integer | Not fully implemented yet and intended for future usage. Equivalent to the Teradata JDBC Driver `MAX_MESSAGE_BODY` connection parameter.\n`partition`        | `\"DBC/SQL\"` | string         | Specifies the Teradata Database Partition. Equivalent to the Teradata JDBC Driver `PARTITION` connection parameter.\n`password`         |             | string         | Specifies the Teradata Database password. Equivalent to the Teradata JDBC Driver `PASSWORD` connection parameter.\n`sip_support`      | `\"true\"`    | quoted boolean | Controls whether StatementInfo parcel is used. Equivalent to the Teradata JDBC Driver `SIP_SUPPORT` connection parameter.\n`teradata_values`  | `\"true\"`    | quoted boolean | Controls whether `str` or a more specific Python data type is used for certain result set column value types. Refer to the [Data Types](#DataTypes) table below for details.\n`tmode`            | `\"DEFAULT\"` | string         | Specifies the transaction mode. Equivalent to the Teradata JDBC Driver `TMODE` connection parameter. Possible values are `DEFAULT` (the default), `ANSI`, or `TERA`.\n`user`             |             | string         | Specifies the Teradata Database username. Equivalent to the Teradata JDBC Driver `USER` connection parameter.\n\n<a name=\"COPDiscovery\"></a>\n\n### COP Discovery\n\nThe Teradata SQL Driver for Python provides Communications Processor (COP) discovery behavior when the `cop` connection parameter is `true` or omitted. COP Discovery is turned off when the `cop` connection parameter is `false`.\n\nA Teradata Database system can be composed of multiple Teradata Database nodes. One or more of the Teradata Database nodes can be configured to run the Teradata Database Gateway process. Each Teradata Database node that runs the Teradata Database Gateway process is termed a Communications Processor, or COP. COP Discovery refers to the procedure of identifying all the available COP hostnames and their IP addresses. COP hostnames can be defined in DNS, or can be defined in the client system's `hosts` file. Teradata strongly recommends that COP hostnames be defined in DNS, rather than the client system's `hosts` file. Defining COP hostnames in DNS provides centralized administration, and enables centralized changes to COP hostnames if and when the Teradata Database is reconfigured.\n\nThe `coplast` connection parameter specifies how COP Discovery determines the last COP hostname.\n* When `coplast` is `false` or omitted, or COP Discovery is turned off, then the Teradata SQL Driver for Python will not perform a DNS lookup for the coplast hostname.\n* When `coplast` is `true`, and COP Discovery is turned on, then the Teradata SQL Driver for Python will first perform a DNS lookup for a coplast hostname to obtain the IP address of the last COP hostname before performing COP Discovery. Subsequently, during COP Discovery, the Teradata SQL Driver for Python will stop searching for COP hostnames when either an unknown COP hostname is encountered, or a COP hostname is encountered whose IP address matches the IP address of the coplast hostname.\n\nSpecifying `coplast` as `true` can improve performance with DNS that is slow to respond for DNS lookup failures, and is necessary for DNS that never returns a DNS lookup failure.\n\nWhen performing COP Discovery, the Teradata SQL Driver for Python starts with cop1, which is appended to the database hostname, and then proceeds with cop2, cop3, ..., copN. The Teradata SQL Driver for Python supports domain-name qualification for COP Discovery and the coplast hostname. Domain-name qualification is recommended, because it can improve performance by avoiding unnecessary DNS lookups for DNS search suffixes.\n\nThe following table illustrates the DNS lookups performed for a hypothetical three-node Teradata Database system named \"whomooz\".\n\n&nbsp; | No domain name qualification | With domain name qualification<br />(Recommended)\n------ | ---------------------------- | ---\nApplication-specified<br />Teradata Database hostname | `whomooz` | `whomooz.domain.com`\nDefault: COP Discovery turned on, and `coplast` is `false` or omitted,<br />perform DNS lookups until unknown COP hostname is encountered | `whomoozcop1`&rarr;`10.0.0.1`<br />`whomoozcop2`&rarr;`10.0.0.2`<br />`whomoozcop3`&rarr;`10.0.0.3`<br />`whomoozcop4`&rarr;undefined | `whomoozcop1.domain.com`&rarr;`10.0.0.1`<br />`whomoozcop2.domain.com`&rarr;`10.0.0.2`<br />`whomoozcop3.domain.com`&rarr;`10.0.0.3`<br />`whomoozcop4.domain.com`&rarr;undefined\nCOP Discovery turned on, and `coplast` is `true`,<br />perform DNS lookups until COP hostname is found whose IP address matches the coplast hostname, or unknown COP hostname is encountered | `whomoozcoplast`&rarr;`10.0.0.3`<br />`whomoozcop1`&rarr;`10.0.0.1`<br />`whomoozcop2`&rarr;`10.0.0.2`<br />`whomoozcop3`&rarr;`10.0.0.3` | `whomoozcoplast.domain.com`&rarr;`10.0.0.3`<br />`whomoozcop1.domain.com`&rarr;`10.0.0.1`<br />`whomoozcop2.domain.com`&rarr;`10.0.0.2`<br />`whomoozcop3.domain.com`&rarr;`10.0.0.3`\nCOP Discovery turned off and round-robin DNS,<br />perform one DNS lookup that returns multiple IP addresses | `whomooz`&rarr;`10.0.0.1`, `10.0.0.2`, `10.0.0.3` | `whomooz.domain.com`&rarr;`10.0.0.1`, `10.0.0.2`, `10.0.0.3`\n\nRound-robin DNS rotates the list of IP addresses automatically to provide load distribution. Round-robin is only possible with DNS, not with the client system `hosts` file.\n\nThe Teradata SQL Driver for Python supports the definition of multiple IP addresses for COP hostnames and non-COP hostnames.\n\nFor the first connection to a particular Teradata Database system, the Teradata SQL Driver for Python generates a random number to index into the list of COPs. For each subsequent connection, the Teradata SQL Driver for Python increments the saved index until it wraps around to the first position. This behavior provides load distribution across all discovered COPs.\n\nThe Teradata SQL Driver for Python masks connection failures to down COPs, thereby hiding most connection failures from the client application. An exception is thrown to the application only when all the COPs are down for that database. If a COP is down, the next COP in the sequence (including a wrap-around to the first COP) receives extra connections that were originally destined for the down COP. When multiple IP addresses are defined in DNS for a COP, the Teradata SQL Driver for Python will attempt to connect to each of the COP's IP addresses, and the COP is considered down only when connection attempts fail to all of the COP's IP addresses.\n\nIf COP Discovery is turned off, or no COP hostnames are defined in DNS, the Teradata SQL Driver for Python connects directly to the hostname specified in the `host` connection parameter. This permits load distribution schemes other than the COP Discovery approach. For example, round-robin DNS or a TCP/IP load distribution product can be used. COP Discovery takes precedence over simple database hostname lookup. To use an alternative load distribution scheme, either ensure that no COP hostnames are defined in DNS, or turn off COP Discovery with `cop` as `false`.\n\n<a name=\"StoredPasswordProtection\"></a>\n\n### Stored Password Protection\n\n#### Overview\n\nStored Password Protection enables an application to provide a connection password in encrypted form to the Teradata SQL Driver for Python.\n\nAn encrypted password may be specified in the following contexts:\n* A login password specified as the `password` connection parameter.\n* A login password specified within the `logdata` connection parameter.\n\nIf the password, however specified, begins with the prefix `ENCRYPTED_PASSWORD(` then the specified password must follow this format:\n\n`ENCRYPTED_PASSWORD(file:`*PasswordEncryptionKeyFileName*`,file:`*EncryptedPasswordFileName*`)`\n\nEach filename must be preceded by the `file:` prefix. The *PasswordEncryptionKeyFileName* must be separated from the *EncryptedPasswordFileName* by a single comma.\n\nThe *PasswordEncryptionKeyFileName* specifies the name of a file that contains the password encryption key and associated information. The *EncryptedPasswordFileName* specifies the name of a file that contains the encrypted password and associated information. The two files are described below.\n\nStored Password Protection is offered by the Teradata JDBC Driver, the Teradata SQL Driver for Python, and the Teradata SQL Driver for R. These drivers use the same file format.\n\n#### Program TJEncryptPassword\n\n`TJEncryptPassword.py` is a sample program to create encrypted password files for use with Stored Password Protection. When the Teradata SQL Driver for Python is installed, the sample programs are placed in the `teradatasql/samples` directory under your Python installation directory.\n\nThis program works in conjunction with Stored Password Protection offered by the Teradata JDBC Driver and the Teradata SQL Driver for Python. This program creates the files containing the password encryption key and encrypted password, which can be subsequently specified via the `ENCRYPTED_PASSWORD(` syntax.\n\nYou are not required to use this program to create the files containing the password encryption key and encrypted password. You can develop your own software to create the necessary files. You may also use the [`TJEncryptPassword.java`](https://downloads.teradata.com/doc/connectivity/jdbc/reference/current/samp/TJEncryptPassword.java.txt) sample program that is available with the [Teradata JDBC Driver Reference](https://downloads.teradata.com/doc/connectivity/jdbc/reference/current/frameset.html). The only requirement is that the files must match the format expected by the Teradata SQL Driver for Python, which is documented below.\n\nThis program encrypts the password and then immediately decrypts the password, in order to verify that the password can be successfully decrypted. This program mimics the password decryption of the Teradata SQL Driver for Python, and is intended to openly illustrate its operation and enable scrutiny by the community.\n\nThe encrypted password is only as safe as the two files. You are responsible for restricting access to the files containing the password encryption key and encrypted password. If an attacker obtains both files, the password can be decrypted. The operating system file permissions for the two files should be as limited and restrictive as possible, to ensure that only the intended operating system userid has access to the files.\n\nThe two files can be kept on separate physical volumes, to reduce the risk that both files might be lost at the same time. If either or both of the files are located on a network volume, then an encrypted wire protocol can be used to access the network volume, such as sshfs, encrypted NFSv4, or encrypted SMB 3.0.\n\nThis program accepts eight command-line arguments:\n\nArgument                      | Example              | Description\n----------------------------- | -------------------- | ---\nTransformation                | `AES/CBC/NoPadding`  | Specifies the transformation in the form *Algorithm*`/`*Mode*`/`*Padding*. Supported transformations are listed in a table below.\nKeySizeInBits                 | `256`                | Specifies the algorithm key size, which governs the encryption strength.\nMAC                           | `HmacSHA256`         | Specifies the message authentication code (MAC) algorithm `HmacSHA1` or `HmacSHA256`.\nPasswordEncryptionKeyFileName | `PassKey.properties` | Specifies a filename in the current directory, a relative pathname, or an absolute pathname. The file is created by this program. If the file already exists, it will be overwritten by the new file.\nEncryptedPasswordFileName     | `EncPass.properties` | Specifies a filename in the current directory, a relative pathname, or an absolute pathname. The filename or pathname that must differ from the PasswordEncryptionKeyFileName. The file is created by this program. If the file already exists, it will be overwritten by the new file.\nHostname                      | `whomooz`            | Specifies the Teradata Database hostname.\nUsername                      | `guest`              | Specifies the Teradata Database username.\nPassword                      | `please`             | Specifies the Teradata Database password to be encrypted. Unicode characters in the password can be specified with the `\\u`*XXXX* escape sequence.\n\n#### Example Commands\n\nThe TJEncryptPassword program uses the Teradata SQL Driver for Python to log on to the specified Teradata Database using the encrypted password, so the Teradata SQL Driver for Python must have been installed with the `pip install teradatasql` command.\n\nThe following commands assume that the `TJEncryptPassword.py` program file is located in the current directory. When the Teradata SQL Driver for Python is installed, the sample programs are placed in the `teradatasql/samples` directory under your Python installation directory. Change your current directory to the `teradatasql/samples` directory under your Python installation directory.\n\nThe following example commands illustrate using a 256-bit AES key, and using the HmacSHA256 algorithm.\n\nPlatform       | Command\n-------------- | ---\nmacOS or Linux | `python TJEncryptPassword.py AES/CBC/NoPadding 256 HmacSHA256 PassKey.properties EncPass.properties whomooz guest please`\nWindows        | `py -3 TJEncryptPassword.py AES/CBC/NoPadding 256 HmacSHA256 PassKey.properties EncPass.properties whomooz guest please`\n\n#### Password Encryption Key File Format\n\nYou are not required to use the TJEncryptPassword program to create the files containing the password encryption key and encrypted password. You can develop your own software to create the necessary files, but the files must match the format expected by the Teradata SQL Driver for Python.\n\nThe password encryption key file is a text file in Java Properties file format, using the ISO 8859-1 character encoding.\n\nThe file must contain the following string properties:\n\nProperty                                          | Description\n------------------------------------------------- | ---\n`version=1`                                       | The version number must be `1`. This property is required.\n`transformation=`*Algorithm*`/`*Mode*`/`*Padding* | Specifies the transformation in the form *Algorithm*`/`*Mode*`/`*Padding*. Supported transformations are listed in a table below. This property is required.\n`algorithm=`*Algorithm*                           | This value must correspond to the *Algorithm* portion of the transformation. This property is required.\n`match=`*MatchValue*                              | The password encryption key and encrypted password files must contain the same match value. The match values are compared to ensure that the two specified files are related to each other, serving as a \"sanity check\" to help avoid configuration errors. This property is required.\n`key=`*HexDigits*                                 | This value is the password encryption key, encoded as hex digits. This property is required.\n`mac=`*MACAlgorithm*                              | Specifies the message authentication code (MAC) algorithm `HmacSHA1` or `HmacSHA256`. Stored Password Protection performs Encrypt-then-MAC for protection from a padding oracle attack. This property is required.\n`mackey=`*HexDigits*                              | This value is the MAC key, encoded as hex digits. This property is required.\n\nThe TJEncryptPassword program uses a timestamp as a shared match value, but a timestamp is not required. Any shared string can serve as a match value. The timestamp is not related in any way to the encryption of the password, and the timestamp cannot be used to decrypt the password.\n\n#### Encrypted Password File Format\n\nThe encrypted password file is a text file in Java Properties file format, using the ISO 8859-1 character encoding.\n\nThe file must contain the following string properties:\n\nProperty                                          | Description\n------------------------------------------------- | ---\n`version=1`                                       | The version number must be `1`. This property is required.\n`match=`*MatchValue*                              | The password encryption key and encrypted password files must contain the same match value. The match values are compared to ensure that the two specified files are related to each other, serving as a \"sanity check\" to help avoid configuration errors. This property is required.\n`password=`*HexDigits*                            | This value is the encrypted password, encoded as hex digits. This property is required.\n`params=`*HexDigits*                              | This value contains the cipher algorithm parameters, if any, encoded as hex digits. Some ciphers need algorithm parameters that cannot be derived from the key, such as an initialization vector. This property is optional, depending on whether the cipher algorithm has associated parameters.\n`hash=`*HexDigits*                                | This value is the expected message authentication code (MAC), encoded as hex digits. After encryption, the expected MAC is calculated using the ciphertext, transformation name, and algorithm parameters if any. Before decryption, the Teradata SQL Driver for Python calculates the MAC using the ciphertext, transformation name, and algorithm parameters if any, and verifies that the calculated MAC matches the expected MAC. If the calculated MAC differs from the expected MAC, then either or both of the files may have been tampered with. This property is required.\n\nWhile `params` is technically optional, an initialization vector is required by all three block cipher modes `CBC`, `CFB`, and `OFB` that are supported by the Teradata SQL Driver for Python. ECB (Electronic Codebook) does not require `params`, but ECB is not supported by the Teradata SQL Driver for Python.\n\n#### Transformation, Key Size, and MAC\n\nA transformation is a string that describes the set of operations to be performed on the given input, to produce transformed output. A transformation specifies the name of a cryptographic algorithm such as DES or AES, followed by a feedback mode and padding scheme.\n\nThe Teradata SQL Driver for Python supports the following transformations and key sizes.\n\nTransformation              | Key Size\n--------------------------- | ---\n`DES/CBC/NoPadding`         | 64\n`DES/CBC/PKCS5Padding`      | 64\n`DES/CFB/NoPadding`         | 64\n`DES/CFB/PKCS5Padding`      | 64\n`DES/OFB/NoPadding`         | 64\n`DES/OFB/PKCS5Padding`      | 64\n`DESede/CBC/NoPadding`      | 192\n`DESede/CBC/PKCS5Padding`   | 192\n`DESede/CFB/NoPadding`      | 192\n`DESede/CFB/PKCS5Padding`   | 192\n`DESede/OFB/NoPadding`      | 192\n`DESede/OFB/PKCS5Padding`   | 192\n`AES/CBC/NoPadding`         | 128\n`AES/CBC/NoPadding`         | 192\n`AES/CBC/NoPadding`         | 256\n`AES/CBC/PKCS5Padding`      | 128\n`AES/CBC/PKCS5Padding`      | 192\n`AES/CBC/PKCS5Padding`      | 256\n`AES/CFB/NoPadding`         | 128\n`AES/CFB/NoPadding`         | 192\n`AES/CFB/NoPadding`         | 256\n`AES/CFB/PKCS5Padding`      | 128\n`AES/CFB/PKCS5Padding`      | 192\n`AES/CFB/PKCS5Padding`      | 256\n`AES/OFB/NoPadding`         | 128\n`AES/OFB/NoPadding`         | 192\n`AES/OFB/NoPadding`         | 256\n`AES/OFB/PKCS5Padding`      | 128\n`AES/OFB/PKCS5Padding`      | 192\n`AES/OFB/PKCS5Padding`      | 256\n\nStored Password Protection uses a symmetric encryption algorithm such as DES or AES, in which the same secret key is used for encryption and decryption of the password. Stored Password Protection does not use an asymmetric encryption algorithm such as RSA, with separate public and private keys.\n\nCBC (Cipher Block Chaining) is a block cipher encryption mode. With CBC, each ciphertext block is dependent on all plaintext blocks processed up to that point. CBC is suitable for encrypting data whose total byte count exceeds the algorithm's block size, and is therefore suitable for use with Stored Password Protection.\n\nStored Password Protection hides the password length in the encrypted password file by extending the length of the UTF8-encoded password with trailing null bytes. The length is extended to the next 512-byte boundary.\n\n* A block cipher with no padding, such as `AES/CBC/NoPadding`, may only be used to encrypt data whose byte count after extension is a multiple of the algorithm's block size. The 512-byte boundary is compatible with many block ciphers. AES, for example, has a block size of 128 bits (16 bytes), and is therefore compatible with the 512-byte boundary.\n* A block cipher with padding, such as `AES/CBC/PKCS5Padding`, can be used to encrypt data of any length. However, CBC with padding is vulnerable to a \"padding oracle attack\", so Stored Password Protection performs Encrypt-then-MAC for protection from a padding oracle attack. MAC algorithms `HmacSHA1` and `HmacSHA256` are supported.\n* The Teradata SQL Driver for Python does not support block ciphers used as byte-oriented ciphers via modes such as `CFB8` or `OFB8`.\n\nThe strength of the encryption depends on your choice of cipher algorithm and key size.\n\n* AES uses a 128-bit (16 byte), 192-bit (24 byte), or 256-bit (32 byte) key.\n* DESede uses a 192-bit (24 byte) key. The The Teradata SQL Driver for Python does not support a 128-bit (16 byte) key for DESede.\n* DES uses a 64-bit (8 byte) key.\n\n#### Sharing Files with the Teradata JDBC Driver\n\nThe Teradata SQL Driver for Python and the Teradata JDBC Driver can share the files containing the password encryption key and encrypted password, if you use a transformation, key size, and MAC algorithm that is supported by both drivers.\n\n* Recommended choices for compatibility are `AES/CBC/NoPadding` and `HmacSHA256`.\n* Use a 256-bit key if your Java environment has the Java Cryptography Extension (JCE) Unlimited Strength Jurisdiction Policy Files from Oracle.\n* Use a 128-bit key if your Java environment does not have the Unlimited Strength Jurisdiction Policy Files.\n* Use `HmacSHA1` for compatibility with JDK 1.4.2.\n\n#### File Locations\n\nFor the `ENCRYPTED_PASSWORD(` syntax of the Teradata SQL Driver for Python, each filename must be preceded by the `file:` prefix.\nThe *PasswordEncryptionKeyFileName* must be separated from the *EncryptedPasswordFileName* by a single comma. The files can be located in the current directory, specified with a relative path, or specified with an absolute path.\n\n\nExample for files in the current directory:\n\n    ENCRYPTED_PASSWORD(file:JohnDoeKey.properties,file:JohnDoePass.properties)\n\nExample with relative paths:\n\n    ENCRYPTED_PASSWORD(file:../dir1/JohnDoeKey.properties,file:../dir2/JohnDoePass.properties)\n\nExample with absolute paths on Windows:\n\n    ENCRYPTED_PASSWORD(file:c:/dir1/JohnDoeKey.properties,file:c:/dir2/JohnDoePass.properties)\n\nExample with absolute paths on Linux:\n\n    ENCRYPTED_PASSWORD(file:/dir1/JohnDoeKey.properties,file:/dir2/JohnDoePass.properties)\n\n#### Processing Sequence\n\nThe two filenames specified for an encrypted password must be accessible to the Teradata SQL Driver for Python and must conform to the properties file formats described above. The Teradata SQL Driver for Python raises an exception if the file is not accessible, or the file does not conform to the required file format.\n\nThe Teradata SQL Driver for Python verifies that the match values in the two files are present, and match each other. The Teradata SQL Driver for Python raises an exception if the match values differ from each other. The match values are compared to ensure that the two specified files are related to each other, serving as a \"sanity check\" to help avoid configuration errors. The TJEncryptPassword program uses a timestamp as a shared match value, but a timestamp is not required. Any shared string can serve as a match value. The timestamp is not related in any way to the encryption of the password, and the timestamp cannot be used to decrypt the password.\n\nBefore decryption, the Teradata SQL Driver for Python calculates the MAC using the ciphertext, transformation name, and algorithm parameters if any, and verifies that the calculated MAC matches the expected MAC. The Teradata SQL Driver for Python raises an exception if the calculated MAC differs from the expected MAC, to indicate that either or both of the files may have been tampered with.\n\nFinally, the Teradata SQL Driver for Python uses the decrypted password to log on to the Teradata Database.\n\n<a name=\"TransactionMode\"></a>\n\n### Transaction Mode\n\nThe `tmode` connection parameter enables an application to specify the transaction mode for the connection.\n* `\"tmode\":\"ANSI\"` provides American National Standards Institute (ANSI) transaction semantics. This mode is recommended.\n* `\"tmode\":\"TERA\"` provides legacy Teradata transaction semantics. This mode is only recommended for legacy applications that require Teradata transaction semantics.\n* `\"tmode\":\"DEFAULT\"` provides the default transaction mode configured for the Teradata Database, which may be either ANSI or TERA mode. `\"tmode\":\"DEFAULT\"` is the default when the `tmode` connection parameter is omitted.\n\nWhile ANSI mode is generally recommended, please note that every application is different, and some applications may need to use TERA mode. The following differences between ANSI and TERA mode might affect a typical user or application:\n1. Silent truncation of inserted data occurs in TERA mode, but not ANSI mode. In ANSI mode, the Teradata Database returns an error instead of truncating data.\n2. Tables created in ANSI mode are `MULTISET` by default. Tables created in TERA mode are `SET` tables by default.\n3. For tables created in ANSI mode, character columns are `CASESPECIFIC` by default. For tables created in TERA mode, character columns are `NOT CASESPECIFIC` by default.\n4. In ANSI mode, character literals are `CASESPECIFIC`. In TERA mode, character literals are `NOT CASESPECIFIC`.\n\nThe last two behavior differences, taken together, may cause character data comparisons (such as in `WHERE` clause conditions) to be case-insensitive in TERA mode, but case-sensitive in ANSI mode. This, in turn, can produce different query results in ANSI mode versus TERA mode. Comparing two `NOT CASESPECIFIC` expressions is case-insensitive regardless of mode, and comparing a `CASESPECIFIC` expression to another expression of any kind is case-sensitive regardless of mode. You may explicitly `CAST` an expression to be `CASESPECIFIC` or `NOT CASESPECIFIC` to obtain the character data comparison required by your application.\n\nThe Teradata Database Reference / *SQL Request and Transaction Processing* recommends that ANSI mode be used for all new applications. The primary benefit of using ANSI mode is that inadvertent data truncation is avoided. In contrast, when using TERA mode, silent data truncation can occur when data is inserted, because silent data truncation is a feature of TERA mode.\n\nA drawback of using ANSI mode is that you can only call stored procedures that were created using ANSI mode, and you cannot call stored procedures that were created using TERA mode. It may not be possible to switch over to ANSI mode exclusively, because you may have some legacy applications that require TERA mode to work properly. You can work around this drawback by creating your stored procedures twice, in two different users/databases, once using ANSI mode, and once using TERA mode.\n\nRefer to the Teradata Database Reference / *SQL Request and Transaction Processing* for complete information regarding the differences between ANSI and TERA transaction modes.\n\n<a name=\"AutoCommit\"></a>\n\n### Auto-Commit\n\nThe Teradata SQL Driver for Python provides auto-commit on and off functionality for both ANSI and TERA mode.\n\nWhen a connection is first established, it begins with the default auto-commit setting, which is on. When auto-commit is on, the driver is solely responsible for managing transactions, and the driver commits each SQL request that is successfully executed. An application should not execute any transaction management SQL commands when auto-commit is on. An application should not call the `commit` method or the `rollback` method when auto-commit is on.\n\nAn application can manage transactions itself by calling the `execute` method with the `teradata_nativesql` and `teradata_autocommit_off` escape functions to turn off auto-commit.\n\n    cur.execute(\"{fn teradata_nativesql}{fn teradata_autocommit_off}\")\n\nWhen auto-commit is off, the driver leaves the current transaction open after each SQL request is executed, and the application is responsible for committing or rolling back the transaction by calling the `commit` or the `rollback` method, respectively.\n\nAuto-commit remains turned off until the application turns it back on.\n\n    cur.execute(\"{fn teradata_nativesql}{fn teradata_autocommit_on}\")\n\nBest practices recommend that an application avoid executing database-vendor-specific transaction management commands such as `BT`, `ET`, `ABORT`, `COMMIT`, or `ROLLBACK`, because such commands differ from one vendor to another. (They even differ between Teradata's two modes ANSI and TERA.) Instead, best practices recommend that an application only call the standard methods `commit` and `rollback` for transaction management.\n1. When auto-commit is on in ANSI mode, the driver automatically executes `COMMIT` after every successful SQL request.\n2. When auto-commit is off in ANSI mode, the driver does not automatically execute `COMMIT`. When the application calls the `commit` method, then the driver executes `COMMIT`.\n3. When auto-commit is on in TERA mode, the driver does not execute `BT` or `ET`, unless the application explicitly executes `BT` or `ET` commands itself, which is not recommended.\n4. When auto-commit is off in TERA mode, the driver executes `BT` before submitting the application's first SQL request of a new transaction. When the application calls the `commit` method, then the driver executes `ET` until the transaction is complete.\n\nAs part of the wire protocol between the Teradata Database and Teradata client interface software (such as the Teradata SQL Driver for Python), each message transmitted from the Teradata Database to the client has a bit designated to indicate whether the session has a transaction in progress or not. Thus, the client interface software is kept informed as to whether the session has a transaction in progress or not.\n\nIn TERA mode with auto-commit off, when the application uses the driver to execute a SQL request, if the session does not have a transaction in progress, then the driver automatically executes `BT` before executing the application's SQL request. Subsequently, in TERA mode with auto-commit off, when the application uses the driver to execute another SQL request, and the session already has a transaction in progress, then the driver has no need to execute `BT` before executing the application's SQL request.\n\nIn TERA mode, `BT` and `ET` pairs can be nested, and the Teradata Database keeps track of the nesting level. The outermost `BT`/`ET` pair defines the transaction scope; inner `BT`/`ET` pairs have no effect on the transaction because the Teradata Database does not provide actual transaction nesting. To commit the transaction, `ET` commands must be repeatedly executed until the nesting is unwound. The Teradata wire protocol bit (mentioned earlier) indicates when the nesting is unwound and the transaction is complete. When the application calls the `commit` method in TERA mode, the driver repeatedly executes `ET` commands until the nesting is unwound and the transaction is complete.\n\nIn rare cases, an application may not follow best practices and may explicitly execute transaction management commands. Such an application must turn off auto-commit before executing transaction management commands such as `BT`, `ET`, `ABORT`, `COMMIT`, or `ROLLBACK`. The application is responsible for executing the appropriate commands for the transaction mode in effect. TERA mode commands are `BT`, `ET`, and `ABORT`. ANSI mode commands are `COMMIT` and `ROLLBACK`. An application must take special care when opening a transaction in TERA mode with auto-commit off. In TERA mode with auto-commit off, when the application executes a SQL request, if the session does not have a transaction in progress, then the driver automatically executes `BT` before executing the application's SQL request. Therefore, the application should not begin a transaction by executing `BT`.\n\n    # TERA mode example showing undesirable BT/ET nesting\n    cur.execute(\"{fn teradata_nativesql}{fn teradata_autocommit_off}\")\n    cur.execute(\"BT\") # BT automatically executed by the driver before this, and produces a nested BT\n    cur.execute(\"insert into mytable1 values(1, 2)\")\n    cur.execute(\"insert into mytable2 values(3, 4)\")\n    cur.execute(\"ET\") # unwind nesting\n    cur.execute(\"ET\") # complete transaction\n\n    # TERA mode example showing how to avoid BT/ET nesting\n    cur.execute(\"{fn teradata_nativesql}{fn teradata_autocommit_off}\")\n    cur.execute(\"insert into mytable1 values(1, 2)\") # BT automatically executed by the driver before this\n    cur.execute(\"insert into mytable2 values(3, 4)\")\n    cur.execute(\"ET\") # complete transaction\n\nPlease note that neither previous example shows best practices. Best practices recommend that an application only call the standard methods `commit` and `rollback` for transaction management.\n\n    # Example showing best practice\n    cur.execute(\"{fn teradata_nativesql}{fn teradata_autocommit_off}\")\n    cur.execute(\"insert into mytable1 values(1, 2)\")\n    cur.execute(\"insert into mytable2 values(3, 4)\")\n    con.commit()\n\n<a name=\"DataTypes\"></a>\n\n### Data Types\n\nThe table below lists the Teradata Database data types supported by the Teradata SQL Driver for Python, and indicates the corresponding Python data type returned in result set rows.\n\nTeradata Database data type        | Result set Python data type       | With `teradata_values` as `false`\n---------------------------------- | --------------------------------- | ---\n`BIGINT`                           | `int`                             |\n`BLOB`                             | `bytes`                           |\n`BYTE`                             | `bytes`                           |\n`BYTEINT`                          | `int`                             |\n`CHAR`                             | `str`                             |\n`CLOB`                             | `str`                             |\n`DATE`                             | `datetime.date`                   | `str`\n`DECIMAL`                          | `decimal.Decimal`                 | `str`\n`FLOAT`                            | `float`                           |\n`INTEGER`                          | `int`                             |\n`INTERVAL YEAR`                    | `str`                             |\n`INTERVAL YEAR TO MONTH`           | `str`                             |\n`INTERVAL MONTH`                   | `str`                             |\n`INTERVAL DAY`                     | `str`                             |\n`INTERVAL DAY TO HOUR`             | `str`                             |\n`INTERVAL DAY TO MINUTE`           | `str`                             |\n`INTERVAL DAY TO SECOND`           | `str`                             |\n`INTERVAL HOUR`                    | `str`                             |\n`INTERVAL HOUR TO MINUTE`          | `str`                             |\n`INTERVAL HOUR TO SECOND`          | `str`                             |\n`INTERVAL MINUTE`                  | `str`                             |\n`INTERVAL MINUTE TO SECOND`        | `str`                             |\n`INTERVAL SECOND`                  | `str`                             |\n`NUMBER`                           | `decimal.Decimal`                 | `str`\n`PERIOD(DATE)`                     | `str`                             |\n`PERIOD(TIME)`                     | `str`                             |\n`PERIOD(TIME WITH TIME ZONE)`      | `str`                             |\n`PERIOD(TIMESTAMP)`                | `str`                             |\n`PERIOD(TIMESTAMP WITH TIME ZONE)` | `str`                             |\n`SMALLINT`                         | `int`                             |\n`TIME`                             | `datetime.time`                   | `str`\n`TIME WITH TIME ZONE`              | `datetime.time` with `tzinfo`     | `str`\n`TIMESTAMP`                        | `datetime.datetime`               | `str`\n`TIMESTAMP WITH TIME ZONE`         | `datetime.datetime` with `tzinfo` | `str`\n`VARBYTE`                          | `bytes`                           |\n`VARCHAR`                          | `str`                             |\n`XML`                              | `str`                             |\n\nThe table below lists the parameterized SQL bind-value Python data types supported by the Teradata SQL Driver for Python, and indicates the corresponding Teradata Database data type transmitted to the server.\n\nBind-value Python data type       | Teradata Database data type\n--------------------------------- | ---\n`bytes`                           | `VARBYTE`\n`datetime.date`                   | `DATE`\n`datetime.datetime`               | `TIMESTAMP`\n`datetime.datetime` with `tzinfo` | `TIMESTAMP WITH TIME ZONE`\n`datetime.time`                   | `TIME`\n`datetime.time` with `tzinfo`     | `TIME WITH TIME ZONE`\n`datetime.timedelta`              | `VARCHAR` format compatible with `INTERVAL DAY TO SECOND`\n`decimal.Decimal`                 | `NUMBER`\n`float`                           | `FLOAT`\n`int`                             | `BIGINT`\n`str`                             | `VARCHAR`\n\nTransforms are used for SQL `ARRAY` data values, and they can be transferred to and from the database as `VARCHAR` values.\n\nTransforms are used for structured UDT data values, and they can be transferred to and from the database as `VARCHAR` values.\n\n<a name=\"NullValues\"></a>\n\n### Null Values\n\nSQL `NULL` values received from the Teradata Database are returned in result set rows as Python `None` values.\n\nA Python `None` value bound to a question-mark parameter marker is transmitted to the Teradata Database as a `NULL` `VARCHAR` value.\n\n<a name=\"CharacterExportWidth\"></a>\n\n### Character Export Width\n\nThe Teradata SQL Driver for Python always uses the UTF8 session character set, and the `charset` connection parameter is not supported. Be aware of the Teradata Database's _Character Export Width_ behavior that adds trailing space padding to fixed-width `CHAR` data type result set column values when using the UTF8 session character set.\n\nThe Teradata Database `CHAR(`_n_`)` data type is a fixed-width data type (holding _n_ characters), and the Teradata Database reserves a fixed number of bytes for the `CHAR(`_n_`)` data type in response spools and in network message traffic.\n\nUTF8 is a variable-width character encoding scheme that requires a varying number of bytes for each character. When the UTF8 session character set is used, the Teradata Database reserves the maximum number of bytes that the `CHAR(`_n_`)` data type could occupy in response spools and in network message traffic. When the UTF8 session character set is used, the Teradata Database appends padding characters to the tail end of `CHAR(`_n_`)` values smaller than the reserved maximum size, so that the `CHAR(`_n_`)` values all occupy the same fixed number of bytes in response spools and in network message traffic.\n\nWork around this drawback by using `CAST` or `TRIM` in SQL `SELECT` statements, or in views, to convert fixed-width `CHAR` data types to `VARCHAR`.\n\nGiven a table with fixed-width `CHAR` columns:\n\n`CREATE TABLE MyTable (c1 CHAR(10), c2 CHAR(10))`\n\nOriginal query that produces trailing space padding:\n\n`SELECT c1, c2 FROM MyTable`\n\nModified query with either `CAST` or `TRIM` to avoid trailing space padding:\n\n`SELECT CAST(c1 AS VARCHAR(10)), TRIM(TRAILING FROM c1) FROM MyTable`\n\nOr wrap query in a view with `CAST` or `TRIM` to avoid trailing space padding:\n\n`CREATE VIEW MyView (c1, c2) AS SELECT CAST(c1 AS VARCHAR(10)), TRIM(TRAILING FROM c2) FROM MyTable`\n\n`SELECT c1, c2 FROM MyView`\n\nThis technique is also demonstrated in sample program `CharPadding.py`.\n\n<a name=\"ModuleConstructors\"></a>\n\n### Module Constructors\n\n`teradatasql.connect(` *JSONConnectionString* `,` *Parameters...* `)`\n\nCreates a connection to the database and returns a Connection object.\n\nThe first parameter is an optional JSON string that defaults to `None`. The second and subsequent arguments are optional `kwargs`. Specify connection parameters as a JSON string, as `kwargs`, or a combination of the two.\n\nWhen a combination of parameters are specified, connection parameters specified as `kwargs` take precedence over same-named connection parameters specified in the JSON string.\n\n---\n\n`teradatasql.Date(` *Year* `,` *Month* `,` *Day* `)`\n\nCreates and returns a `datetime.date` value.\n\n---\n\n`teradatasql.DateFromTicks(` *Seconds* `)`\n\nCreates and returns a `datetime.date` value corresponding to the specified number of seconds after 1970-01-01 00:00:00.\n\n---\n\n`teradatasql.Time(` *Hour* `,` *Minute* `,` *Second* `)`\n\nCreates and returns a `datetime.time` value.\n\n---\n\n`teradatasql.TimeFromTicks(` *Seconds* `)`\n\nCreates and returns a `datetime.time` value corresponding to the specified number of seconds after 1970-01-01 00:00:00.\n\n---\n\n`teradatasql.Timestamp(` *Year* `,` *Month* `,` *Day* `,` *Hour* `,` *Minute* `,` *Second* `)`\n\nCreates and returns a `datetime.datetime` value.\n\n---\n\n`teradatasql.TimestampFromTicks(` *Seconds* `)`\n\nCreates and returns a `datetime.datetime` value corresponding to the specified number of seconds after 1970-01-01 00:00:00.\n\n<a name=\"ModuleGlobals\"></a>\n\n### Module Globals\n\n`teradatasql.apilevel`\n\nString constant `\"2.0\"` indicating that the Teradata SQL Driver for Python implements the [PEP-249 Python Database API Specification 2.0](https://www.python.org/dev/peps/pep-0249/).\n\n---\n\n`teradatasql.threadsafety`\n\nInteger constant `2` indicating that threads may share this module, and threads may share connections, but threads must not share cursors.\n\n---\n\n`teradatasql.paramstyle`\n\nString constant `\"qmark\"` indicating that prepared SQL requests use question-mark parameter markers.\n\n<a name=\"ModuleExceptions\"></a>\n\n### Module Exceptions\n\n`teradatasql.Error` is the base class for other exceptions.\n* `teradatasql.InterfaceError` is raised for errors related to the driver. Not supported yet.\n* `teradatasql.DatabaseError` is raised for errors related to the database.\n  * `teradatasql.DataError` is raised for data value errors such as division by zero. Not supported yet.\n  * `teradatasql.IntegrityError` is raised for referential integrity violations. Not supported yet.\n  * `teradatasql.OperationalError` is raised for errors related to the database's operation.\n  * `teradatasql.ProgrammingError` is raised for SQL object existence errors and SQL syntax errors. Not supported yet.\n\n<a name=\"ConnectionMethods\"></a>\n\n### Connection Methods\n\n`.close()`\n\nCloses the Connection.\n\n---\n\n`.commit()`\n\nCommits the current transaction.\n\n---\n\n`.cursor()`\n\nCreates and returns a new Cursor object for the Connection.\n\n---\n\n`.rollback()`\n\nRolls back the current transaction.\n\n<a name=\"CursorAttributes\"></a>\n\n### Cursor Attributes\n\n`.arraysize`\n\nRead/write attribute specifying the number of rows to fetch at a time with the `.fetchmany()` method. Defaults to `1` meaning fetch a single row at a time.\n\n---\n\n`.connection`\n\nRead-only attribute indicating the Cursor's parent Connection object.\n\n---\n\n`.description`\n\nRead-only attribute consisting of a sequence of seven-item sequences that each describe a result set column, available after a SQL request is executed.\n* `.description[`*Column*`][0]` provides the column name.\n* `.description[`*Column*`][1]` provides the column type code as an object comparable to one of the Type Objects listed below.\n* `.description[`*Column*`][2]` provides the column display size in characters. Not implemented yet.\n* `.description[`*Column*`][3]` provides the column size in bytes.\n* `.description[`*Column*`][4]` provides the column precision if applicable, or `None` otherwise.\n* `.description[`*Column*`][5]` provides the column scale if applicable, or `None` otherwise.\n* `.description[`*Column*`][6]` provides the column nullability as `True` or `False`.\n\n---\n\n`.rowcount`\n\nRead-only attribute indicating the number of rows returned from, or affected by, the current SQL statement.\n\n<a name=\"CursorMethods\"></a>\n\n### Cursor Methods\n\n`.callproc(` *ProcedureName* `,` *OptionalSequenceOfParameterValues* `)`\n\nCalls the stored procedure specified by *ProcedureName*.\nProvide the second argument as a sequence of `IN` and `INOUT` parameter values to bind the values to question-mark parameter markers in the SQL request.\nSpecifying parameter values as a mapping is not supported.\nReturns a result set consisting of the `INOUT` parameter output values, if any, followed by any dynamic result sets.\n\n`OUT` parameters are not supported by this method. Use `.execute` to call a stored procedure with `OUT` parameters.\n\n---\n\n`.close()`\n\nCloses the Cursor.\n\n---\n\n`.execute(` *SQLRequest* `,` *OptionalSequenceOfParameterValues* `, ignoreErrors=` *OptionalSequenceOfIgnoredErrorCodes* `)`\n\nExecutes the SQL request.\nIf a sequence of parameter values is provided as the second argument, the values will be bound to question-mark parameter markers in the SQL request. Specifying parameter values as a mapping is not supported.\n\nThe `ignoreErrors` parameter is optional. The ignored error codes must be specified as a sequence of integers.\n\n---\n\n`.executemany(` *SQLRequest* `,` *SequenceOfSequencesOfParameterValues* `, ignoreErrors=` *OptionalSequenceOfIgnoredErrorCodes* `)`\n\nExecutes the SQL request as an iterated SQL request for the batch of parameter values.\nThe batch of parameter values must be specified as a sequence of sequences. Specifying parameter values as a mapping is not supported.\n\nThe `ignoreErrors` parameter is optional. The ignored error codes must be specified as a sequence of integers.\n\n---\n\n`.fetchall()`\n\nFetches all remaining rows of the current result set.\nReturns a sequence of sequences of column values.\n\n---\n\n`.fetchmany(` *OptionalRowCount* `)`\n\nFetches the next series of rows of the current result set.\nThe argument specifies the number of rows to fetch. If no argument is provided, then the Cursor's `.arraysize` attribute will determine the number of rows to fetch.\nReturns a sequence of sequences of column values, or an empty sequence to indicate that all rows have been fetched.\n\n---\n\n`.fetchone()`\n\nFetches the next row of the current result set.\nReturns a sequence of column values, or `None` to indicate that all rows have been fetched.\n\n---\n\n`.nextset()`\n\nAdvances to the next result set.\nReturns `True` if another result set is available, or `None` to indicate that all result sets have been fetched.\n\n---\n\n`.setinputsizes(` *SequenceOfTypesOrSizes* `)`\n\nHas no effect.\n\n---\n\n`.setoutputsize(` *Size* `,` *OptionalColumnIndex* `)`\n\nHas no effect.\n\n<a name=\"TypeObjects\"></a>\n\n### Type Objects\n\n`teradatasql.BINARY`\n\nIdentifies a SQL `BLOB`, `BYTE`, or `VARBYTE` column as a binary data type when compared with the Cursor's description attribute.\n\n`.description[`*Column*`][1] == teradatasql.BINARY`\n\n---\n\n`teradatasql.DATETIME`\n\nIdentifies a SQL `DATE`, `TIME`, `TIME WITH TIME ZONE`, `TIMESTAMP`, or `TIMESTAMP WITH TIME ZONE` column as a date/time data type when compared with the Cursor's description attribute.\n\n`.description[`*Column*`][1] == teradatasql.DATETIME`\n\n---\n\n`teradatasql.NUMBER`\n\nIdentifies a SQL `BIGINT`, `BYTEINT`, `DECIMAL`, `FLOAT`, `INTEGER`, `NUMBER`, or `SMALLINT` column as a numeric data type when compared with the Cursor's description attribute.\n\n`.description[`*Column*`][1] == teradatasql.NUMBER`\n\n---\n\n`teradatasql.STRING`\n\nIdentifies a SQL `CHAR`, `CLOB`, `INTERVAL`, `PERIOD`, or `VARCHAR` column as a character data type when compared with the Cursor's description attribute.\n\n`.description[`*Column*`][1] == teradatasql.STRING`\n\n<a name=\"EscapeSyntax\"></a>\n\n### Escape Syntax\n\nThe Teradata SQL Driver for Python accepts most of the JDBC escape clauses offered by the Teradata JDBC Driver.\n\n#### Date and Time Literals\n\nDate and time literal escape clauses are replaced by the corresponding SQL literal before the SQL request text is transmitted to the database.\n\nLiteral Type | Format\n------------ | ------\nDate         | `{d '`*yyyy-mm-dd*`'}`\nTime         | `{t '`*hh:mm:ss*`'}`\nTimestamp    | `{ts '`*yyyy-mm-dd hh:mm:ss*`'}`\nTimestamp    | `{ts '`*yyyy-mm-dd hh:mm:ss.f*`'}`\n\nFor timestamp literal escape clauses, the decimal point and fractional digits may be omitted, or 1 to 6 fractional digits *f* may be specified after a decimal point.\n\n#### Scalar Functions\n\nScalar function escape clauses are replaced by the corresponding SQL expression before the SQL request text is transmitted to the database.\n\nNumeric Function                       | Returns\n-------------------------------------- | ---\n`{fn ABS(`*number*`)}`                 | Absolute value of *number*\n`{fn ACOS(`*float*`)}`                 | Arccosine, in radians, of *float*\n`{fn ASIN(`*float*`)}`                 | Arcsine, in radians, of *float*\n`{fn ATAN(`*float*`)}`                 | Arctangent, in radians, of *float*\n`{fn ATAN2(`*y*`,`*x*`)}`              | Arctangent, in radians, of *y* / *x*\n`{fn CEILING(`*number*`)}`             | Smallest integer greater than or equal to *number*\n`{fn COS(`*float*`)}`                  | Cosine of *float* radians\n`{fn COT(`*float*`)}`                  | Cotangent of *float* radians\n`{fn DEGREES(`*number*`)}`             | Degrees in *number* radians\n`{fn EXP(`*float*`)}`                  | *e* raised to the power of *float*\n`{fn FLOOR(`*number*`)}`               | Largest integer less than or equal to *number*\n`{fn LOG(`*float*`)}`                  | Natural (base *e*) logarithm of *float*\n`{fn LOG10(`*float*`)}`                | Base 10 logarithm of *float*\n`{fn MOD(`*integer1*`,`*integer2*`)}`  | Remainder for *integer1* / *integer2*\n`{fn PI()}`                            | The constant pi, approximately equal to 3.14159...\n`{fn POWER(`*number*`,`*integer*`)}`   | *number* raised to *integer* power\n`{fn RADIANS(`*number*`)}`             | Radians in *number* degrees\n`{fn RAND(`*seed*`)}`                  | A random float value such that 0 &le; value < 1, and *seed* is ignored\n`{fn ROUND(`*number*`,`*places*`)}`    | *number* rounded to *places*\n`{fn SIGN(`*number*`)}`                | -1 if *number* is negative; 0 if *number* is 0; 1 if *number* is positive\n`{fn SIN(`*float*`)}`                  | Sine of *float* radians\n`{fn SQRT(`*float*`)}`                 | Square root of *float*\n`{fn TAN(`*float*`)}`                  | Tangent of *float* radians\n`{fn TRUNCATE(`*number*`,`*places*`)}` | *number* truncated to *places*\n\nString Function                                                | Returns\n-------------------------------------------------------------- | ---\n`{fn ASCII(`*string*`)}`                                       | ASCII code of the first character in *string*\n`{fn CHAR(`*code*`)}`                                          | Character with ASCII *code*\n`{fn CHAR_LENGTH(`*string*`)}`                                 | Length in characters of *string*\n`{fn CHARACTER_LENGTH(`*string*`)}`                            | Length in characters of *string*\n`{fn CONCAT(`*string1*`,`*string2*`)}`                         | String formed by concatenating *string1* and *string2*\n`{fn DIFFERENCE(`*string1*`,`*string2*`)}`                     | A number from 0 to 4 that indicates the phonetic similarity of *string1* and *string2* based on their Soundex codes, such that a larger return value indicates greater phonetic similarity; 0 indicates no similarity, 4 indicates strong similarity\n`{fn INSERT(`*string1*`,`*position*`,`*length*`,`*string2*`)}` | String formed by replacing the *length*-character segment of *string1* at *position* with *string2*, available beginning with Teradata Database 15.0\n`{fn LCASE(`*string*`)}`                                       | String formed by replacing all uppercase characters in *string* with their lowercase equivalents\n`{fn LEFT(`*string*`,`*count*`)}`                              | Leftmost *count* characters of *string*\n`{fn LENGTH(`*string*`)}`                                      | Length in characters of *string*\n`{fn LOCATE(`*string1*`,`*string2*`)}`                         | Position in *string2* of the first occurrence of *string1*, or 0 if *string2* does not contain *string1*\n`{fn LTRIM(`*string*`)}`                                       | String formed by removing leading spaces from *string*\n`{fn OCTET_LENGTH(`*string*`)}`                                | Length in octets (bytes) of *string*\n`{fn POSITION(`*string1*` IN `*string2*`)}`                    | Position in *string2* of the first occurrence of *string1*, or 0 if *string2* does not contain *string1*\n`{fn REPEAT(`*string*`,`*count*`)}`                            | String formed by repeating *string* *count* times, available beginning with Teradata Database 15.0\n`{fn REPLACE(`*string1*`,`*string2*`,`*string3*`)}`            | String formed by replacing all occurrences of *string2* in *string1* with *string3*\n`{fn RIGHT(`*string*`,`*count*`)}`                             | Rightmost *count* characters of *string*, available beginning with Teradata Database 15.0\n`{fn RTRIM(`*string*`)}`                                       | String formed by removing trailing spaces from *string*\n`{fn SOUNDEX(`*string*`)}`                                     | Soundex code for *string*\n`{fn SPACE(`*count*`)}`                                        | String consisting of *count* spaces\n`{fn SUBSTRING(`*string*`,`*position*`,`*length*`)}`           | The *length*-character segment of *string* at *position*\n`{fn UCASE(`*string*`)}`                                       | String formed by replacing all lowercase characters in *string* with their uppercase equivalents\n\nSystem Function                         | Returns\n--------------------------------------- | ---\n`{fn DATABASE()}`                       | Current default database name\n`{fn IFNULL(`*expression*`,`*value*`)}` | *expression* if *expression* is not NULL, or *value* if *expression* is NULL\n`{fn USER()}`                           | Logon user name, which may differ from the current authorized user name after `SET QUERY_BAND` sets a proxy user\n\nTime/Date Function                                                 | Returns\n------------------------------------------------------------------ | ---\n`{fn CURDATE()}`                                                   | Current date\n`{fn CURRENT_DATE()}`                                              | Current date\n`{fn CURRENT_TIME()}`                                              | Current time\n`{fn CURRENT_TIMESTAMP()}`                                         | Current date and time\n`{fn CURTIME()}`                                                   | Current time\n`{fn DAYOFMONTH(`*date*`)}`                                        | Integer from 1 to 31 indicating the day of month in *date*\n`{fn EXTRACT(YEAR FROM `*value*`)}`                                | The year component of the date and/or time *value*\n`{fn EXTRACT(MONTH FROM `*value*`)}`                               | The month component of the date and/or time *value*\n`{fn EXTRACT(DAY FROM `*value*`)}`                                 | The day component of the date and/or time *value*\n`{fn EXTRACT(HOUR FROM `*value*`)}`                                | The hour component of the date and/or time *value*\n`{fn EXTRACT(MINUTE FROM `*value*`)}`                              | The minute component of the date and/or time *value*\n`{fn EXTRACT(SECOND FROM `*value*`)}`                              | The second component of the date and/or time *value*\n`{fn HOUR(`*time*`)}`                                              | Integer from 0 to 23 indicating the hour of *time*\n`{fn MINUTE(`*time*`)}`                                            | Integer from 0 to 59 indicating the minute of *time*\n`{fn MONTH(`*date*`)}`                                             | Integer from 1 to 12 indicating the month of *date*\n`{fn NOW()}`                                                       | Current date and time\n`{fn SECOND(`*time*`)}`                                            | Integer from 0 to 59 indicating the second of *time*\n`{fn TIMESTAMPADD(SQL_TSI_YEAR,`*count*`,`*timestamp*`)}`          | Timestamp formed by adding *count* years to *timestamp*\n`{fn TIMESTAMPADD(SQL_TSI_MONTH,`*count*`,`*timestamp*`)}`         | Timestamp formed by adding *count* months to *timestamp*\n`{fn TIMESTAMPADD(SQL_TSI_DAY,`*count*`,`*timestamp*`)}`           | Timestamp formed by adding *count* days to *timestamp*\n`{fn TIMESTAMPADD(SQL_TSI_HOUR,`*count*`,`*timestamp*`)}`          | Timestamp formed by adding *count* hours to *timestamp*\n`{fn TIMESTAMPADD(SQL_TSI_MINUTE,`*count*`,`*timestamp*`)}`        | Timestamp formed by adding *count* minutes to *timestamp*\n`{fn TIMESTAMPADD(SQL_TSI_SECOND,`*count*`,`*timestamp*`)}`        | Timestamp formed by adding *count* seconds to *timestamp*\n`{fn TIMESTAMPDIFF(SQL_TSI_YEAR,`*timestamp1*`,`*timestamp2*`)}`   | Number of years by which *timestamp2* exceeds *timestamp1*\n`{fn TIMESTAMPDIFF(SQL_TSI_MONTH,`*timestamp1*`,`*timestamp2*`)}`  | Number of months by which *timestamp2* exceeds *timestamp1*\n`{fn TIMESTAMPDIFF(SQL_TSI_DAY,`*timestamp1*`,`*timestamp2*`)}`    | Number of days by which *timestamp2* exceeds *timestamp1*\n`{fn TIMESTAMPDIFF(SQL_TSI_HOUR,`*timestamp1*`,`*timestamp2*`)}`   | Number of hours by which *timestamp2* exceeds *timestamp1*\n`{fn TIMESTAMPDIFF(SQL_TSI_MINUTE,`*timestamp1*`,`*timestamp2*`)}` | Number of minutes by which *timestamp2* exceeds *timestamp1*\n`{fn TIMESTAMPDIFF(SQL_TSI_SECOND,`*timestamp1*`,`*timestamp2*`)}` | Number of seconds by which *timestamp2* exceeds *timestamp1*\n`{fn YEAR(`*date*`)}`                                              | The year of *date*\n\n#### Conversion Functions\n\nConversion function escape clauses are replaced by the corresponding SQL expression before the SQL request text is transmitted to the database.\n\nConversion Function                                             | Returns\n--------------------------------------------------------------- | ---\n`{fn CONVERT(`*value*`, SQL_BIGINT)}`                           | *value* converted to SQL `BIGINT`\n`{fn CONVERT(`*value*`, SQL_BINARY(`*size*`))}`                 | *value* converted to SQL `BYTE(`*size*`)`\n`{fn CONVERT(`*value*`, SQL_CHAR(`*size*`))}`                   | *value* converted to SQL `CHAR(`*size*`)`\n`{fn CONVERT(`*value*`, SQL_DATE)}`                             | *value* converted to SQL `DATE`\n`{fn CONVERT(`*value*`, SQL_DECIMAL(`*precision*`,`*scale*`))}` | *value* converted to SQL `DECIMAL(`*precision*`,`*scale*`)`\n`{fn CONVERT(`*value*`, SQL_DOUBLE)}`                           | *value* converted to SQL `DOUBLE PRECISION`, a synonym for `FLOAT`\n`{fn CONVERT(`*value*`, SQL_FLOAT)}`                            | *value* converted to SQL `FLOAT`\n`{fn CONVERT(`*value*`, SQL_INTEGER)}`                          | *value* converted to SQL `INTEGER`\n`{fn CONVERT(`*value*`, SQL_LONGVARBINARY)}`                    | *value* converted to SQL `VARBYTE(64000)`\n`{fn CONVERT(`*value*`, SQL_LONGVARCHAR)}`                      | *value* converted to SQL `LONG VARCHAR`\n`{fn CONVERT(`*value*`, SQL_NUMERIC)}`                          | *value* converted to SQL `NUMBER`\n`{fn CONVERT(`*value*`, SQL_SMALLINT)}`                         | *value* converted to SQL `SMALLINT`\n`{fn CONVERT(`*value*`, SQL_TIME(`*scale*`))}`                  | *value* converted to SQL `TIME(`*scale*`)`\n`{fn CONVERT(`*value*`, SQL_TIMESTAMP(`*scale*`))}`             | *value* converted to SQL `TIMESTAMP(`*scale*`)`\n`{fn CONVERT(`*value*`, SQL_TINYINT)}`                          | *value* converted to SQL `BYTEINT`\n`{fn CONVERT(`*value*`, SQL_VARBINARY(`*size*`))}`              | *value* converted to SQL `VARBYTE(`*size*`)`\n`{fn CONVERT(`*value*`, SQL_VARCHAR(`*size*`))}`                | *value* converted to SQL `VARCHAR(`*size*`)`\n\n#### LIKE Predicate Escape Character\n\nWithin a `LIKE` predicate's *pattern* argument, the characters `%` (percent) and `_` (underscore) serve as wildcards.\nTo interpret a particular wildcard character literally in a `LIKE` predicate's *pattern* argument, the wildcard character must be preceded by an escape character, and the escape character must be indicated in the `LIKE` predicate's `ESCAPE` clause.\n\n`LIKE` predicate escape character escape clauses are replaced by the corresponding SQL clause before the SQL request text is transmitted to the database.\n\n`{escape '`*EscapeCharacter*`'}`\n\nThe escape clause must be specified immediately after the `LIKE` predicate that it applies to.\n\n#### Outer Joins\n\nOuter join escape clauses are replaced by the corresponding SQL clause before the SQL request text is transmitted to the database.\n\n`{oj `*TableName*` `*OptionalCorrelationName*` LEFT OUTER JOIN `*TableName*` `*OptionalCorrelationName*` ON `*JoinCondition*`}`\n\n`{oj `*TableName*` `*OptionalCorrelationName*` RIGHT OUTER JOIN `*TableName*` `*OptionalCorrelationName*` ON `*JoinCondition*`}`\n\n`{oj `*TableName*` `*OptionalCorrelationName*` FULL OUTER JOIN `*TableName*` `*OptionalCorrelationName*` ON `*JoinCondition*`}`\n\n#### Stored Procedure Calls\n\nStored procedure call escape clauses are replaced by the corresponding SQL clause before the SQL request text is transmitted to the database.\n\n`{call `*ProcedureName*`}`\n\n`{call `*ProcedureName*`(`*CommaSeparatedParameterValues...*`)}`\n\n#### Native SQL\n\nWhen a SQL request contains the native SQL escape clause, all escape clauses are replaced in the SQL request text, and the modified SQL request text is returned to the application as a result set containing a single row and a single VARCHAR column. The SQL request text is not transmitted to the database, and the SQL request is not executed. The native SQL escape clause mimics the functionality of the JDBC API `Connection.nativeSQL` method.\n\n`{fn teradata_nativesql}`\n\n#### Connection Functions\n\nThe following table lists connection function escape clauses that are intended for use with the native SQL escape clause `{fn teradata_nativesql}`.\n\nThese functions provide information about the connection, or control the behavior of the connection.\nFunctions that provide information return locally-cached information and avoid a round-trip to the database.\nConnection function escape clauses are replaced by the returned information before the SQL request text is transmitted to the database.\n\nConnection Function                           | Returns\n--------------------------------------------- | ---\n`{fn teradata_amp_count}`                     | Number of AMPs of the Teradata Database system\n`{fn teradata_database_version}`              | Version number of the Teradata Database\n`{fn teradata_driver_version}`                | Version number of the Teradata SQL Driver for Python\n`{fn teradata_getloglevel}`                   | Current log level\n`{fn teradata_logon_sequence_number}`         | Session's Logon Sequence Number, if available\n`{fn teradata_provide(config_response)}`      | Config Response parcel contents in JSON format\n`{fn teradata_provide(connection_id)}`        | Connection's unique identifier within the process\n`{fn teradata_provide(default_connection)}`   | `false` indicating this is not a stored procedure default connection\n`{fn teradata_provide(host_id)}`              | Session's host ID\n`{fn teradata_provide(java_charset_name)}`    | `UTF8`\n`{fn teradata_provide(lob_support)}`          | `true` or `false` indicating this connection's LOB support\n`{fn teradata_provide(local_address)}`        | Local address of the connection's TCP socket\n`{fn teradata_provide(local_port)}`           | Local port of the connection's TCP socket\n`{fn teradata_provide(original_hostname)}`    | Original specified Teradata Database hostname\n`{fn teradata_provide(redrive_active)}`       | `true` or `false` indicating whether this connection has Redrive active\n`{fn teradata_provide(remote_address)}`       | Hostname (if available) and IP address of the connected Teradata Database node\n`{fn teradata_provide(remote_port)}`          | TCP port number of the Teradata Database\n`{fn teradata_provide(rnp_active)}`           | `true` or `false` indicating whether this connection has Recoverable Network Protocol active\n`{fn teradata_provide(session_charset_code)}` | Session character set code `191`\n`{fn teradata_provide(session_charset_name)}` | Session character set name `UTF8`\n`{fn teradata_provide(sip_support)}`          | `true` or `false` indicating this connection's StatementInfo parcel support\n`{fn teradata_provide(transaction_mode)}`     | Session's transaction mode, `ANSI` or `TERA`\n`{fn teradata_session_number}`                | Session number\n`{fn teradata_setloglevel(`*LogLevel*`)}`     | Empty string, and changes the connection's *LogLevel*\n\n#### Request-Scope Functions\n\nThe following table lists request-scope function escape clauses that are intended for use with the Cursor `.execute` or `.executemany` methods.\n\nThese functions control the behavior of the corresponding Cursor, and are limited in scope to the particular SQL request in which they are specified.\nRequest-scope function escape clauses are removed before the SQL request text is transmitted to the database.\n\nRequest-Scope Function                                 | Effect\n------------------------------------------------------ | ---\n`{fn teradata_failfast}`                               | Reject (\"fail fast\") this SQL request rather than delay by a workload management rule or throttle\n`{fn teradata_fake_result_sets}`                       | A fake result set containing statement metadata precedes each real result set\n`{fn teradata_lobselect(`*Option*`)}`                  | Executes the SQL request with LOB select *Option* `S` (spool-scoped LOB locators), `T` (transaction-scoped LOB locators), or the default `I` (inline materialized LOB values)\n`{fn teradata_parameter(`*Index*`,`*DataType*`)`       | Transmits parameter *Index* bind values as *DataType*\n`{fn teradata_provide(request_scope_lob_support_off)}` | Turns off LOB support for this SQL request\n`{fn teradata_provide(request_scope_refresh_rsmd)}`    | Executes the SQL request with the default request processing option `B` (both)\n`{fn teradata_provide(request_scope_sip_support_off)}` | Turns off StatementInfo parcel support for this SQL request\n`{fn teradata_rpo(`*RequestProcessingOption*`)}`       | Executes the SQL request with *RequestProcessingOption* `S` (prepare), `E` (execute), or the default `B` (both)\n`{fn teradata_untrusted}`                              | Marks the SQL request as untrusted; not implemented yet\n\n<a name=\"FastLoad\"></a>\n\n### FastLoad\n\nThe Teradata SQL Driver for Python now offers FastLoad.\n\nPlease be aware that this is just the initial release of the FastLoad feature. Think of it as a beta or preview version. It works, but does not yet offer all the features that JDBC FastLoad offers. FastLoad is still under active development, and we will continue to enhance it in subsequent builds.\n\nFastLoad has limitations and cannot be used in all cases as a substitute for SQL batch insert:\n* FastLoad can only load into an empty permanent table.\n* FastLoad cannot load additional rows into a table that already contains rows.\n* FastLoad cannot load into a volatile table or global temporary table.\n* FastLoad cannot load duplicate rows into a `MULTISET` table.\n* Do not use FastLoad to load only a few rows, because FastLoad opens extra connections to the database, which is time consuming.\n* Only use FastLoad to load many rows (at least 100,000 rows) so that the row-loading performance gain exceeds the overhead of opening additional connections.\n* FastLoad does not support all Teradata Database data types. For example, `BLOB` and `CLOB` are not supported.\n* FastLoad requires StatementInfo parcel support to be enabled.\n* FastLoad locks the destination table.\n* If Online Archive encounters a table being loaded with FastLoad, online archiving of that table will be bypassed.\n\nYour application can bind a single row of data for FastLoad, but that is not recommended because the overhead of opening additional connections causes FastLoad to be slower than a regular SQL `INSERT` for a single row.\n\nHow to use FastLoad:\n* Auto-commit should be turned off before beginning a FastLoad.\n* FastLoad is intended for binding many rows at a time. Each batch of rows must be able to fit into memory.\n* When auto-commit is turned off, your application can insert multiple batches in a loop for the same FastLoad.\n* Each column's data type must be consistent across every row in every batch over the entire FastLoad.\n* The column values of the first row of the first batch dictate what the column data types must be in all subsequent rows and all subsequent batches of the FastLoad.\n\nFastLoad opens multiple data transfer connections to the database. FastLoad evenly distributes each batch of rows across the available data transfer connections, and uses overlapped I/O to send and receive messages in parallel.\n\nTo use FastLoad, your application must prepend one of the following escape functions to the `INSERT` statement:\n* `{fn teradata_try_fastload}` tries to use FastLoad for the `INSERT` statement, and automatically executes the `INSERT` as a regular SQL statement when the `INSERT` is not compatible with FastLoad.\n* `{fn teradata_require_fastload}` requires FastLoad for the `INSERT` statement, and fails with an error when the `INSERT` is not compatible with FastLoad.\n\nYour application can prepend other optional escape functions to the `INSERT` statement:\n* `{fn teradata_sessions(`n`)}` specifies the number of data transfer connections to be opened, and is capped at the number of AMPs. The default is the smaller of 8 or the number of AMPs. `CHECK WORKLOAD` is not yet used, meaning that the driver does not ask the database how many data transfer connections should be used.\n* `{fn teradata_error_table_1_suffix(`suffix`)}` specifies what suffix to append to the name of FastLoad error table 1. The default suffix is `_ERR_1`.\n* `{fn teradata_error_table_2_suffix(`suffix`)}` specifies what suffix to append to the name of FastLoad error table 2. The default suffix is `_ERR_2`.\n* `{fn teradata_error_table_database(`dbname`)}` specifies the parent database name for FastLoad error tables 1 and 2. By default, the FastLoad error tables reside in the same database as the destination table.\n\nAfter beginning a FastLoad, your application can obtain the Logon Sequence Number (LSN) assigned to the FastLoad by prepending the following escape functions to the `INSERT` statement:\n* `{fn teradata_nativesql}{fn teradata_logon_sequence_number}` returns the string form of an integer representing the Logon Sequence Number (LSN) for the FastLoad. Returns an empty string if the request is not a FastLoad.\n\nFastLoad does not stop for data errors such as constraint violations or unique primary index violations. After inserting each batch of rows, your application must obtain warning and error information by prepending the following escape functions to the `INSERT` statement:\n* `{fn teradata_nativesql}{fn teradata_get_warnings}` returns in one string all warnings generated by FastLoad for the request.\n* `{fn teradata_nativesql}{fn teradata_get_errors}` returns in one string all data errors observed by FastLoad for the most recent batch. The data errors are obtained from FastLoad error table 1, for problems such as constraint violations, data type conversion errors, and unavailable AMP conditions.\n\nYour application ends FastLoad by committing or rolling back the current transaction. After commit or rollback, your application must obtain warning and error information by prepending the following escape functions to the `INSERT` statement:\n* `{fn teradata_nativesql}{fn teradata_get_warnings}` returns in one string all warnings generated by FastLoad for the commit or rollback. The warnings are obtained from FastLoad error table 2, for problems such as duplicate rows.\n* `{fn teradata_nativesql}{fn teradata_get_errors}` returns in one string all data errors observed by FastLoad for the commit or rollback. The data errors are obtained from FastLoad error table 2, for problems such as unique primary index violations.\n\nWarning and error information remains available until the next batch is inserted or until the commit or rollback. Each batch execution clears the prior warnings and errors. Each commit or rollback clears the prior warnings and errors.\n\n<a name=\"ChangeLog\"></a>\n\n### Change Log\n\n`16.20.0.61` - Apr 30, 2020\n* GOSQL-57 Deferred LOB values larger than 1MB\n\n`16.20.0.60` - Mar 27, 2020\n* GOSQL-22 enable insert of large LOB values over 64KB\n* GOSQL-52 teradata_try_fastload consider bind value data types\n* GOSQL-54 enforce Decimal value maximum precision 38\n* PYDBAPI-37 Teradata Data Types Support up to 14.10 including LOB data\n\n`16.20.0.59` - Jan 8, 2020\n* GOSQL-51 FastLoad fails when table is dropped and recreated\n* PYDBAPI-72 bind value performance improvement\n* PYDBAPI-73 DBAPI fails to insert 16383 rows\n\n`16.20.0.58` - Dec 11, 2019\n* PYDBAPI-71 execute and executemany ignoreErrors parameter\n\n`16.20.0.57` - Dec 10, 2019\n* GOSQL-50 provide FastLoad duplicate row errors with auto-commit on\n\n`16.20.0.56` - Dec 4, 2019\n* PYDBAPI-70 raise error for closed cursor usage\n\n`16.20.0.55` - Nov 26, 2019\n* GOSQL-15 add database connection parameter\n* PYDBAPI-66 Better exception when running on 32-bit Python\n\n`16.20.0.54` - Nov 21, 2019\n* GOSQL-49 FastLoad support for additional connection parameters\n\n`16.20.0.53` - Nov 15, 2019\n* GOSQL-36 segment and iterate parameter batches per batch row limit\n* GOSQL-43 segment and iterate parameter batches per request message size limit for FastLoad\n\n`16.20.0.52` - Oct 18, 2019\n* Sample programs for fake result sets\n\n`16.20.0.51` - Oct 16, 2019\n* GOSQL-46 LDAP password special characters\n\n`16.20.0.50` - Oct 7, 2019\n* PYDBAPI-68 improve performance for batch bind values\n\n`16.20.0.49` - Oct 3, 2019\n* GOSQL-45 FastLoad interop with Stored Password Protection\n\n`16.20.0.48` - Sep 6, 2019\n* GOSQL-14 add support for FastLoad protocol\n* GOSQL-34 negative scale for Number values\n* PYDBAPI-29 Data Transfer - FastLoad Protocol\n\n`16.20.0.47` - Aug 27, 2019\n* GOSQL-40 Skip executing empty SQL request text\n* PYDBAPI-67 teradatasql.connect JSON connection string optional\n\n`16.20.0.46` - Aug 16, 2019\n* GOSQL-39 COP Discovery interop with Kerberos\n\n`16.20.0.45` - Aug 12, 2019\n* GOSQL-38 timestamp prefix log messages\n\n`16.20.0.44` - Aug 7, 2019\n* GOSQL-4 Support COP discovery\n* PYDBAPI-36 COP Discovery\n\n`16.20.0.43` - Jul 29, 2019\n* GOSQL-18 Auto-commit\n* PYDBAPI-61 commit and rollback methods\n\n`16.20.0.42` - Jun 7, 2019\n* PYDBAPI-65 sample program `BatchInsert.py`\n\n`16.20.0.41` - Feb 14, 2019\n* PYDBAPI-57 fetchmany may return \"rows are closed\" instead of empty result set\n\n`16.20.0.40` - Feb 8, 2019\n* GOSQL-11 JWT authentication method\n* GOSQL-16 tmode connection parameter\n* GOSQL-17 commit and rollback functions\n\n`16.20.0.39` - Oct 26, 2018\n* GOSQL-33 CALL to stored procedure INOUT and OUT parameter output values\n\n`16.20.0.38` - Oct 25, 2018\n* PYDBAPI-56 Stored Procedure Dynamic Result Sets\n\n`16.20.0.37` - Oct 22, 2018\n* Documentation change\n\n`16.20.0.36` - Oct 22, 2018\n* GOSQL-5 Create/Replace Procedure MultiTSR protocol\n\n`16.20.0.35` - Oct 22, 2018\n* GOSQL-10 Stored Password Protection\n* PYDBAPI-28 Secure Password at rest\n* PYDBAPI-47 Port sample program TJEncryptPassword to Python\n\n`16.20.0.34` - Oct 15, 2018\n* Fix for sample program `TJEncryptPassword.py`\n\n`16.20.0.33` - Oct 12, 2018\n* Installation dependency pycryptodome\n\n`16.20.0.32` - Sep 19, 2018\n* Sample programs `LoadCSVFile.py` and `MetadataFromPrepare.py`\n* Escape function teradata_fake_result_sets\n\n`16.20.0.31` - Sep 19, 2018\n* Added function tracing\n\n`16.20.0.30` - Sep 14, 2018\n* PYDBAPI-12 Connectivity\n* PYDBAPI-33 Pandas library Interoperability\n* Moved samples directory\n\n`16.20.0.29` - Sep 14, 2018\n* Sample program `ElicitFile.py`\n\n`16.20.0.28` - Sep 13, 2018\n* Documentation change\n\n`16.20.0.27` - Sep 12, 2018\n* Documentation change\n\n`16.20.0.26` - Sep 11, 2018\n* PYDBAPI-8 Documentation\n* PYDBAPI-9 User Guide Content\n\n`16.20.0.25` - Sep 10, 2018\n* Documentation change\n\n`16.20.0.24` - Sep 6, 2018\n* PYDBAPI-54 Implement cursor rowcount attribute\n* PYDBAPI-55 Improved support for Python data types\n\n`16.20.0.23` - Aug 31, 2018\n* KeepResponse only for LOB locators\n\n`16.20.0.22` - Aug 30, 2018\n* Fixed NUMBER values\n\n`16.20.0.21` - Aug 29, 2018\n* Close orphaned rows\n\n`16.20.0.20` - Aug 28, 2018\n* decimal and datetime values\n\n`16.20.0.19` - Aug 22, 2018\n* timedelta bind values\n\n`16.20.0.18` - Aug 21, 2018\n* datetime.datetime bind values\n\n`16.20.0.17` - Aug 20, 2018\n* Version number in errors\n\n`16.20.0.16` - Aug 17, 2018\n* SLES 11 SP1 compatibility\n\n`16.20.0.15` - Aug 17, 2018\n* Documentation change\n\n`16.20.0.14` - Aug 10, 2018\n* Documentation change\n\n`16.20.0.13` - Aug 9, 2018\n* Documentation change\n\n`16.20.0.12` - Aug 9, 2018\n* PYDBAPI-10 User Guide Delivery and Viewability\n* PYDBAPI-11 Searchability\n\n`16.20.0.11` - Aug 8, 2018\n* Documentation change\n\n`16.20.0.10` - Aug 8, 2018\n* Documentation change\n\n`16.20.0.9` - Aug 7, 2018\n* Install documentation in teradatasql directory\n\n`16.20.0.8` - Aug 7, 2018\n* GOSQL-7 TDNEGO authentication method\n* PYDBAPI-42 Teradata Logon mechanism - TDNEGO\n\n`16.20.0.7` - Jul 30, 2018\n* GOSQL-8 Support parameter marker batch insert\n* PYDBAPI-45 Parameterized Batch Insertion using executeMany\n\n`16.20.0.6` - Jul 25, 2018\n* Thread safety for handle maps\n\n`16.20.0.5` - Jul 25, 2018\n* Removed atexit\n\n`16.20.0.4` - Jul 23, 2018\n* PYDBAPI-4 Provide Python Driver license file\n\n`16.20.0.3` - Jul 19, 2018\n* PYDBAPI-46 Accept subclasses of bytes, int, float, str as bind values\n\n`16.20.0.2` - Jul 19, 2018\n* Package attributes change\n\n`16.20.0.1` - Jul 18, 2018\n* Version number change\n\n`16.20.0.0` - Jul 18, 2018\n* GOSQL-1 Encrypted logon\n* GOSQL-2 LDAP and Kerberos authentication\n* GOSQL-3 Support for 1MB Rows\n* GOSQL-6 Elicit File protocol\n* PYDBAPI-1 Distribution\n* PYDBAPI-5 cursor.execute method return cursor\n* PYDBAPI-6 Install and Deployment\n* PYDBAPI-7 pip install of python driver package\n* PYDBAPI-13 Operating System Platforms\n* PYDBAPI-14 Driver must be available for use by Windows OS Users\n* PYDBAPI-15 Driver must be available for use by OSX (Mac) Users\n* PYDBAPI-16 Driver must be available for use by Linux OS Users\n* PYDBAPI-17 Python Language version\n* PYDBAPI-18 Python language version 3.4\n* PYDBAPI-19 Distribution\n* PYDBAPI-23 Teradata Analytics Platform Interoperability/Support\n* PYDBAPI-24 Works with Teradata Database 16.10, 16.20\n* PYDBAPI-26 Teradata Logon mechanism - Kerberos\n* PYDBAPI-32 Downloadable from pypi.org\n* PYDBAPI-40 Teradata Logon mechanism - LDAP\n* PYDBAPI-41 Teradata Logon mechanism - TD2\n* PYDBAPI-43 parameterized single-row inserts\n* PYDBAPI-44 parameterized queries\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://www.teradata.com/", "keywords": "Teradata", "license": "Teradata License Agreement", "maintainer": "", "maintainer_email": "", "name": "teradatasql", "package_url": "https://pypi.org/project/teradatasql/", "platform": "Windows", "project_url": "https://pypi.org/project/teradatasql/", "project_urls": {"Homepage": "http://www.teradata.com/"}, "release_url": "https://pypi.org/project/teradatasql/16.20.0.61/", "requires_dist": ["pycryptodome"], "requires_python": ">=3.4", "summary": "Teradata SQL Driver for Python", "version": "16.20.0.61", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h2>Teradata SQL Driver for Python</h2>\n<p>This package enables Python applications to connect to the Teradata Database.</p>\n<p>This package implements the <a href=\"https://www.python.org/dev/peps/pep-0249/\" rel=\"nofollow\">PEP-249 Python Database API Specification 2.0</a>.</p>\n<p>This package requires 64-bit Python 3.4 or later, and runs on Windows, macOS, and Linux. 32-bit Python is not supported.</p>\n<p>For community support, please visit the <a href=\"https://community.teradata.com/\" rel=\"nofollow\">Teradata Community forums</a>.</p>\n<p>For Teradata customer support, please visit <a href=\"https://access.teradata.com/\" rel=\"nofollow\">Teradata Access</a>.</p>\n<p>Please note, this driver may contain beta/preview features (\"Beta Features\"). As such, by downloading and/or using the driver, in addition to agreeing to the licensing terms below, you acknowledge that the Beta Features are experimental in nature and that the Beta Features are provided \"AS IS\" and may not be functional on any machine or in any environment.</p>\n<p>Copyright 2020 Teradata. All Rights Reserved.</p>\n<h3>Table of Contents</h3>\n<ul>\n<li><a href=\"#Features\" rel=\"nofollow\">Features</a></li>\n<li><a href=\"#Limitations\" rel=\"nofollow\">Limitations</a></li>\n<li><a href=\"#Installation\" rel=\"nofollow\">Installation</a></li>\n<li><a href=\"#License\" rel=\"nofollow\">License</a></li>\n<li><a href=\"#Documentation\" rel=\"nofollow\">Documentation</a></li>\n<li><a href=\"#SamplePrograms\" rel=\"nofollow\">Sample Programs</a></li>\n<li><a href=\"#Using\" rel=\"nofollow\">Using the Teradata SQL Driver for Python</a></li>\n<li><a href=\"#ConnectionParameters\" rel=\"nofollow\">Connection Parameters</a></li>\n<li><a href=\"#COPDiscovery\" rel=\"nofollow\">COP Discovery</a></li>\n<li><a href=\"#StoredPasswordProtection\" rel=\"nofollow\">Stored Password Protection</a></li>\n<li><a href=\"#TransactionMode\" rel=\"nofollow\">Transaction Mode</a></li>\n<li><a href=\"#AutoCommit\" rel=\"nofollow\">Auto-Commit</a></li>\n<li><a href=\"#DataTypes\" rel=\"nofollow\">Data Types</a></li>\n<li><a href=\"#NullValues\" rel=\"nofollow\">Null Values</a></li>\n<li><a href=\"#CharacterExportWidth\" rel=\"nofollow\">Character Export Width</a></li>\n<li><a href=\"#ModuleConstructors\" rel=\"nofollow\">Module Constructors</a></li>\n<li><a href=\"#ModuleGlobals\" rel=\"nofollow\">Module Globals</a></li>\n<li><a href=\"#ModuleExceptions\" rel=\"nofollow\">Module Exceptions</a></li>\n<li><a href=\"#ConnectionMethods\" rel=\"nofollow\">Connection Methods</a></li>\n<li><a href=\"#CursorAttributes\" rel=\"nofollow\">Cursor Attributes</a></li>\n<li><a href=\"#CursorMethods\" rel=\"nofollow\">Cursor Methods</a></li>\n<li><a href=\"#TypeObjects\" rel=\"nofollow\">Type Objects</a></li>\n<li><a href=\"#EscapeSyntax\" rel=\"nofollow\">Escape Syntax</a></li>\n<li><a href=\"#FastLoad\" rel=\"nofollow\">FastLoad</a></li>\n<li><a href=\"#ChangeLog\" rel=\"nofollow\">Change Log</a></li>\n</ul>\n<p>Table of Contents links do not work on PyPI due to a <a href=\"https://github.com/pypa/warehouse/issues/4064\" rel=\"nofollow\">PyPI limitation</a>.</p>\n<p><a></a></p>\n<h3>Features</h3>\n<p>The <em>Teradata SQL Driver for Python</em> is a DBAPI Driver that enables Python applications to connect to the Teradata Database. The Teradata SQL Driver for Python implements the <a href=\"https://www.python.org/dev/peps/pep-0249/\" rel=\"nofollow\">PEP-249 Python Database API Specification 2.0</a>.</p>\n<p>The Teradata SQL Driver for Python is a young product that offers a basic feature set. We are working diligently to add features to the Teradata SQL Driver for Python, and our goal is feature parity with the Teradata JDBC Driver.</p>\n<p>At the present time, the Teradata SQL Driver for Python offers the following features.</p>\n<ul>\n<li>Supported for use with Teradata Database 14.10 and later releases. Informally tested to work with Teradata Database 12.0 and later releases.</li>\n<li>COP Discovery.</li>\n<li>Encrypted logon using the <code>TD2</code>, <code>JWT</code>, <code>LDAP</code>, <code>KRB5</code> (Kerberos), or <code>TDNEGO</code> logon mechanisms.</li>\n<li>Data encryption enabled via the <code>encryptdata</code> connection parameter.</li>\n<li>Unicode character data transferred via the UTF8 session character set.</li>\n<li>Auto-commit for ANSI and TERA transaction modes.</li>\n<li>1 MB rows supported with Teradata Database 16.0 and later.</li>\n<li>Multi-statement requests that return multiple result sets.</li>\n<li>Most JDBC escape syntax.</li>\n<li>Parameterized SQL requests with question-mark parameter markers.</li>\n<li>Parameterized batch SQL requests with multiple rows of data bound to question-mark parameter markers.</li>\n<li>ElicitFile protocol support for DDL commands that create external UDFs or stored procedures and upload a file from client to database.</li>\n<li><code>CREATE PROCEDURE</code> and <code>REPLACE PROCEDURE</code> commands.</li>\n<li>Stored Procedure Dynamic Result Sets.</li>\n</ul>\n<p><a></a></p>\n<h3>Limitations</h3>\n<ul>\n<li>The UTF8 session character set is always used. The <code>charset</code> connection parameter is not supported.</li>\n<li>The following complex data types are not supported yet: <code>JSON</code>, <code>DATASET STORAGE FORMAT AVRO</code>, and <code>DATASET STORAGE FORMAT CSV</code>.</li>\n<li>No support yet for data encryption that is governed by central administration. To enable data encryption, you must specify a <code>true</code> value for the <code>encryptdata</code> connection parameter.</li>\n<li>Laddered Concurrent Connect is not supported yet.</li>\n<li>No support yet for Recoverable Network Protocol and Redrive.</li>\n<li>FastExport is not available yet.</li>\n<li>Monitor partition support is not available yet.</li>\n</ul>\n<p><a></a></p>\n<h3>Installation</h3>\n<p>The Teradata SQL Driver for Python depends on the <code>pycryptodome</code> package which is available from PyPI.</p>\n<p>Use <code>pip install</code> to download and install the Teradata SQL Driver for Python and its dependencies automatically.</p>\n<table>\n<thead>\n<tr>\n<th>Platform</th>\n<th>Command</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>macOS or Linux</td>\n<td><code>pip install teradatasql</code></td>\n</tr>\n<tr>\n<td>Windows</td>\n<td><code>py -3 -m pip install teradatasql</code></td>\n</tr></tbody></table>\n<p>When upgrading to a new version of the Teradata SQL Driver for Python, you may need to use pip install's <code>--no-cache-dir</code> option to force the download of the new version.</p>\n<table>\n<thead>\n<tr>\n<th>Platform</th>\n<th>Command</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>macOS or Linux</td>\n<td><code>pip install --no-cache-dir -U teradatasql</code></td>\n</tr>\n<tr>\n<td>Windows</td>\n<td><code>py -3 -m pip install --no-cache-dir -U teradatasql</code></td>\n</tr></tbody></table>\n<p><a></a></p>\n<h3>License</h3>\n<p>Use of the Teradata SQL Driver for Python is governed by the <em>License Agreement for the Teradata SQL Driver for Python</em>.</p>\n<p>When the Teradata SQL Driver for Python is installed, the <code>LICENSE</code> and <code>THIRDPARTYLICENSE</code> files are placed in the <code>teradatasql</code> directory under your Python installation directory.</p>\n<p>In addition to the license terms, the driver may contain beta/preview features (\"Beta Features\"). As such, by downloading and/or using the driver, in addition to the licensing terms, you acknowledge that the Beta Features are experimental in nature and that the Beta Features are provided \"AS IS\" and may not be functional on any machine or in any environment.</p>\n<p><a></a></p>\n<h3>Documentation</h3>\n<p>When the Teradata SQL Driver for Python is installed, the <code>README.md</code> file is placed in the <code>teradatasql</code> directory under your Python installation directory. This permits you to view the documentation offline, when you are not connected to the Internet.</p>\n<p>The <code>README.md</code> file is a plain text file containing the documentation for the Teradata SQL Driver for Python. While the file can be viewed with any text file viewer or editor, your viewing experience will be best with an editor that understands Markdown format.</p>\n<p><a></a></p>\n<h3>Sample Programs</h3>\n<p>Sample programs are provided to demonstrate how to use the Teradata SQL Driver for Python. When the Teradata SQL Driver for Python is installed, the sample programs are placed in the <code>teradatasql/samples</code> directory under your Python installation directory.</p>\n<p>The sample programs are coded with a fake Teradata Database hostname <code>whomooz</code>, username <code>guest</code>, and password <code>please</code>. Substitute your actual Teradata Database hostname and credentials before running a sample program.</p>\n<table>\n<thead>\n<tr>\n<th>Program</th>\n<th>Purpose</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/BatchInsert.py\" rel=\"nofollow\">BatchInsert.py</a></td>\n<td>Demonstrates how to insert a batch of rows</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/BatchInsPerf.py\" rel=\"nofollow\">BatchInsPerf.py</a></td>\n<td>Measures time to insert one million rows</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/CharPadding.py\" rel=\"nofollow\">CharPadding.py</a></td>\n<td>Demonstrates the Teradata Database's <em>Character Export Width</em> behavior</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/CommitRollback.py\" rel=\"nofollow\">CommitRollback.py</a></td>\n<td>Demonstrates commit and rollback methods with auto-commit off.</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/DriverDatabaseVersion.py\" rel=\"nofollow\">DriverDatabaseVersion.py</a></td>\n<td>Displays the Teradata SQL Driver version and Teradata Database version</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/ElicitFile.py\" rel=\"nofollow\">ElicitFile.py</a></td>\n<td>Demonstrates C source file upload to create a User-Defined Function (UDF)</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/FakeResultSetCon.py\" rel=\"nofollow\">FakeResultSetCon.py</a></td>\n<td>Demonstrates connection parameter for fake result sets</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/FakeResultSetEsc.py\" rel=\"nofollow\">FakeResultSetEsc.py</a></td>\n<td>Demonstrates escape function for fake result sets</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/FastLoadBatch.py\" rel=\"nofollow\">FastLoadBatch.py</a></td>\n<td>Demonstrates how to FastLoad batches of rows</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/HelpSession.py\" rel=\"nofollow\">HelpSession.py</a></td>\n<td>Displays session information</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/IgnoreErrors.py\" rel=\"nofollow\">IgnoreErrors.py</a></td>\n<td>Demonstrates how to ignore errors</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/InsertXML.py\" rel=\"nofollow\">InsertXML.py</a></td>\n<td>Demonstrates how to insert and retrieve XML values</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/LoadCSVFile.py\" rel=\"nofollow\">LoadCSVFile.py</a></td>\n<td>Demonstrates how to load data from a CSV file into a table</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/MetadataFromPrepare.py\" rel=\"nofollow\">MetadataFromPrepare.py</a></td>\n<td>Demonstrates how to prepare a SQL request and obtain SQL statement metadata</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/ParamDataTypes.py\" rel=\"nofollow\">ParamDataTypes.py</a></td>\n<td>Demonstrates how to specify data types for parameter marker bind values</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/StoredProc.py\" rel=\"nofollow\">StoredProc.py</a></td>\n<td>Demonstrates how to create and call a SQL stored procedure</td>\n</tr>\n<tr>\n<td><a href=\"https://github.com/Teradata/python-driver/blob/master/samples/TJEncryptPassword.py\" rel=\"nofollow\">TJEncryptPassword.py</a></td>\n<td>Creates encrypted password files</td>\n</tr></tbody></table>\n<p><a></a></p>\n<h3>Using the Teradata SQL Driver for Python</h3>\n<p>Your Python script must import the <code>teradatasql</code> package in order to use the Teradata SQL Driver for Python.</p>\n<pre><code>import teradatasql\n</code></pre>\n<p>After importing the <code>teradatasql</code> package, your Python script calls the <code>teradatasql.connect</code> function to open a connection to the Teradata Database.</p>\n<p>You may specify connection parameters as a JSON string, as <code>kwargs</code>, or using a combination of the two approaches. The <code>teradatasql.connect</code> function's first argument is an optional JSON string. The <code>teradatasql.connect</code> function's second and subsequent arguments are optional <code>kwargs</code>.</p>\n<p>Connection parameters specified only as <code>kwargs</code>:</p>\n<pre><code>con = teradatasql.connect(host=\"whomooz\", user=\"guest\", password=\"please\")\n</code></pre>\n<p>Connection parameters specified only as a JSON string:</p>\n<pre><code>con = teradatasql.connect('{\"host\":\"whomooz\",\"user\":\"guest\",\"password\":\"please\"}')\n</code></pre>\n<p>Connection parameters specified using a combination:</p>\n<pre><code>con = teradatasql.connect('{\"host\":\"whomooz\"}', user=\"guest\", password=\"please\")\n</code></pre>\n<p>When a combination of parameters are specified, connection parameters specified as <code>kwargs</code> take precedence over same-named connection parameters specified in the JSON string.</p>\n<p><a></a></p>\n<h3>Connection Parameters</h3>\n<p>The following table lists the connection parameters currently offered by the Teradata SQL Driver for Python.</p>\n<p>Our goal is consistency for the connection parameters offered by the Teradata SQL Driver for Python and the Teradata JDBC Driver, with respect to connection parameter names and functionality. For comparison, Teradata JDBC Driver connection parameters are <a href=\"https://downloads.teradata.com/doc/connectivity/jdbc/reference/current/jdbcug_chapter_2.html#BGBHDDGB\" rel=\"nofollow\">documented here</a>.</p>\n<table>\n<thead>\n<tr>\n<th>Parameter</th>\n<th>Default</th>\n<th>Type</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>account</code></td>\n<td></td>\n<td>string</td>\n<td>Specifies the Teradata Database account. Equivalent to the Teradata JDBC Driver <code>ACCOUNT</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>column_name</code></td>\n<td><code>\"false\"</code></td>\n<td>quoted boolean</td>\n<td>Controls the behavior of cursor <code>.description</code> sequence <code>name</code> items. Equivalent to the Teradata JDBC Driver <code>COLUMN_NAME</code> connection parameter. False specifies that a cursor <code>.description</code> sequence <code>name</code> item provides the AS-clause name if available, or the column name if available, or the column title. True specifies that a cursor <code>.description</code> sequence <code>name</code> item provides the column name if available, but has no effect when StatementInfo parcel support is unavailable.</td>\n</tr>\n<tr>\n<td><code>cop</code></td>\n<td><code>\"true\"</code></td>\n<td>quoted boolean</td>\n<td>Specifies whether COP Discovery is performed. Equivalent to the Teradata JDBC Driver <code>COP</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>coplast</code></td>\n<td><code>\"false\"</code></td>\n<td>quoted boolean</td>\n<td>Specifies how COP Discovery determines the last COP hostname. Equivalent to the Teradata JDBC Driver <code>COPLAST</code> connection parameter. When <code>coplast</code> is <code>false</code> or omitted, or COP Discovery is turned off, then no DNS lookup occurs for the coplast hostname. When <code>coplast</code> is <code>true</code>, and COP Discovery is turned on, then a DNS lookup occurs for a coplast hostname.</td>\n</tr>\n<tr>\n<td><code>database</code></td>\n<td></td>\n<td>string</td>\n<td>Specifies the initial database to use after logon, instead of the user's default database. Equivalent to the Teradata JDBC Driver <code>DATABASE</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>dbs_port</code></td>\n<td><code>\"1025\"</code></td>\n<td>quoted integer</td>\n<td>Specifies the Teradata Database port number. Equivalent to the Teradata JDBC Driver <code>DBS_PORT</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>encryptdata</code></td>\n<td><code>\"false\"</code></td>\n<td>quoted boolean</td>\n<td>Controls encryption of data exchanged between the Teradata Database and the Teradata SQL Driver for Python. Equivalent to the Teradata JDBC Driver <code>ENCRYPTDATA</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>fake_result_sets</code></td>\n<td><code>\"false\"</code></td>\n<td>quoted boolean</td>\n<td>Controls whether a fake result set containing statement metadata precedes each real result set.</td>\n</tr>\n<tr>\n<td><code>host</code></td>\n<td></td>\n<td>string</td>\n<td>Specifies the Teradata Database hostname.</td>\n</tr>\n<tr>\n<td><code>lob_support</code></td>\n<td><code>\"true\"</code></td>\n<td>quoted boolean</td>\n<td>Controls LOB support. Equivalent to the Teradata JDBC Driver <code>LOB_SUPPORT</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>log</code></td>\n<td><code>\"0\"</code></td>\n<td>quoted integer</td>\n<td>Controls debug logging. Somewhat equivalent to the Teradata JDBC Driver <code>LOG</code> connection parameter. This parameter's behavior is subject to change in the future. This parameter's value is currently defined as an integer in which the 1-bit governs function and method tracing, the 2-bit governs debug logging, the 4-bit governs transmit and receive message hex dumps, and the 8-bit governs timing. Compose the value by adding together 1, 2, 4, and/or 8.</td>\n</tr>\n<tr>\n<td><code>logdata</code></td>\n<td></td>\n<td>string</td>\n<td>Specifies extra data for the chosen logon authentication method. Equivalent to the Teradata JDBC Driver <code>LOGDATA</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>logmech</code></td>\n<td><code>\"TD2\"</code></td>\n<td>string</td>\n<td>Specifies the logon authentication method. Equivalent to the Teradata JDBC Driver <code>LOGMECH</code> connection parameter. Possible values are <code>TD2</code> (the default), <code>JWT</code>, <code>LDAP</code>, <code>KRB5</code> for Kerberos, or <code>TDNEGO</code>.</td>\n</tr>\n<tr>\n<td><code>max_message_body</code></td>\n<td><code>\"2097000\"</code></td>\n<td>quoted integer</td>\n<td>Not fully implemented yet and intended for future usage. Equivalent to the Teradata JDBC Driver <code>MAX_MESSAGE_BODY</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>partition</code></td>\n<td><code>\"DBC/SQL\"</code></td>\n<td>string</td>\n<td>Specifies the Teradata Database Partition. Equivalent to the Teradata JDBC Driver <code>PARTITION</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>password</code></td>\n<td></td>\n<td>string</td>\n<td>Specifies the Teradata Database password. Equivalent to the Teradata JDBC Driver <code>PASSWORD</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>sip_support</code></td>\n<td><code>\"true\"</code></td>\n<td>quoted boolean</td>\n<td>Controls whether StatementInfo parcel is used. Equivalent to the Teradata JDBC Driver <code>SIP_SUPPORT</code> connection parameter.</td>\n</tr>\n<tr>\n<td><code>teradata_values</code></td>\n<td><code>\"true\"</code></td>\n<td>quoted boolean</td>\n<td>Controls whether <code>str</code> or a more specific Python data type is used for certain result set column value types. Refer to the <a href=\"#DataTypes\" rel=\"nofollow\">Data Types</a> table below for details.</td>\n</tr>\n<tr>\n<td><code>tmode</code></td>\n<td><code>\"DEFAULT\"</code></td>\n<td>string</td>\n<td>Specifies the transaction mode. Equivalent to the Teradata JDBC Driver <code>TMODE</code> connection parameter. Possible values are <code>DEFAULT</code> (the default), <code>ANSI</code>, or <code>TERA</code>.</td>\n</tr>\n<tr>\n<td><code>user</code></td>\n<td></td>\n<td>string</td>\n<td>Specifies the Teradata Database username. Equivalent to the Teradata JDBC Driver <code>USER</code> connection parameter.</td>\n</tr></tbody></table>\n<p><a></a></p>\n<h3>COP Discovery</h3>\n<p>The Teradata SQL Driver for Python provides Communications Processor (COP) discovery behavior when the <code>cop</code> connection parameter is <code>true</code> or omitted. COP Discovery is turned off when the <code>cop</code> connection parameter is <code>false</code>.</p>\n<p>A Teradata Database system can be composed of multiple Teradata Database nodes. One or more of the Teradata Database nodes can be configured to run the Teradata Database Gateway process. Each Teradata Database node that runs the Teradata Database Gateway process is termed a Communications Processor, or COP. COP Discovery refers to the procedure of identifying all the available COP hostnames and their IP addresses. COP hostnames can be defined in DNS, or can be defined in the client system's <code>hosts</code> file. Teradata strongly recommends that COP hostnames be defined in DNS, rather than the client system's <code>hosts</code> file. Defining COP hostnames in DNS provides centralized administration, and enables centralized changes to COP hostnames if and when the Teradata Database is reconfigured.</p>\n<p>The <code>coplast</code> connection parameter specifies how COP Discovery determines the last COP hostname.</p>\n<ul>\n<li>When <code>coplast</code> is <code>false</code> or omitted, or COP Discovery is turned off, then the Teradata SQL Driver for Python will not perform a DNS lookup for the coplast hostname.</li>\n<li>When <code>coplast</code> is <code>true</code>, and COP Discovery is turned on, then the Teradata SQL Driver for Python will first perform a DNS lookup for a coplast hostname to obtain the IP address of the last COP hostname before performing COP Discovery. Subsequently, during COP Discovery, the Teradata SQL Driver for Python will stop searching for COP hostnames when either an unknown COP hostname is encountered, or a COP hostname is encountered whose IP address matches the IP address of the coplast hostname.</li>\n</ul>\n<p>Specifying <code>coplast</code> as <code>true</code> can improve performance with DNS that is slow to respond for DNS lookup failures, and is necessary for DNS that never returns a DNS lookup failure.</p>\n<p>When performing COP Discovery, the Teradata SQL Driver for Python starts with cop1, which is appended to the database hostname, and then proceeds with cop2, cop3, ..., copN. The Teradata SQL Driver for Python supports domain-name qualification for COP Discovery and the coplast hostname. Domain-name qualification is recommended, because it can improve performance by avoiding unnecessary DNS lookups for DNS search suffixes.</p>\n<p>The following table illustrates the DNS lookups performed for a hypothetical three-node Teradata Database system named \"whomooz\".</p>\n<table>\n<thead>\n<tr>\n<th> </th>\n<th>No domain name qualification</th>\n<th>With domain name qualification<br>(Recommended)</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Application-specified<br>Teradata Database hostname</td>\n<td><code>whomooz</code></td>\n<td><code>whomooz.domain.com</code></td>\n</tr>\n<tr>\n<td>Default: COP Discovery turned on, and <code>coplast</code> is <code>false</code> or omitted,<br>perform DNS lookups until unknown COP hostname is encountered</td>\n<td><code>whomoozcop1</code>→<code>10.0.0.1</code><br><code>whomoozcop2</code>→<code>10.0.0.2</code><br><code>whomoozcop3</code>→<code>10.0.0.3</code><br><code>whomoozcop4</code>→undefined</td>\n<td><code>whomoozcop1.domain.com</code>→<code>10.0.0.1</code><br><code>whomoozcop2.domain.com</code>→<code>10.0.0.2</code><br><code>whomoozcop3.domain.com</code>→<code>10.0.0.3</code><br><code>whomoozcop4.domain.com</code>→undefined</td>\n</tr>\n<tr>\n<td>COP Discovery turned on, and <code>coplast</code> is <code>true</code>,<br>perform DNS lookups until COP hostname is found whose IP address matches the coplast hostname, or unknown COP hostname is encountered</td>\n<td><code>whomoozcoplast</code>→<code>10.0.0.3</code><br><code>whomoozcop1</code>→<code>10.0.0.1</code><br><code>whomoozcop2</code>→<code>10.0.0.2</code><br><code>whomoozcop3</code>→<code>10.0.0.3</code></td>\n<td><code>whomoozcoplast.domain.com</code>→<code>10.0.0.3</code><br><code>whomoozcop1.domain.com</code>→<code>10.0.0.1</code><br><code>whomoozcop2.domain.com</code>→<code>10.0.0.2</code><br><code>whomoozcop3.domain.com</code>→<code>10.0.0.3</code></td>\n</tr>\n<tr>\n<td>COP Discovery turned off and round-robin DNS,<br>perform one DNS lookup that returns multiple IP addresses</td>\n<td><code>whomooz</code>→<code>10.0.0.1</code>, <code>10.0.0.2</code>, <code>10.0.0.3</code></td>\n<td><code>whomooz.domain.com</code>→<code>10.0.0.1</code>, <code>10.0.0.2</code>, <code>10.0.0.3</code></td>\n</tr></tbody></table>\n<p>Round-robin DNS rotates the list of IP addresses automatically to provide load distribution. Round-robin is only possible with DNS, not with the client system <code>hosts</code> file.</p>\n<p>The Teradata SQL Driver for Python supports the definition of multiple IP addresses for COP hostnames and non-COP hostnames.</p>\n<p>For the first connection to a particular Teradata Database system, the Teradata SQL Driver for Python generates a random number to index into the list of COPs. For each subsequent connection, the Teradata SQL Driver for Python increments the saved index until it wraps around to the first position. This behavior provides load distribution across all discovered COPs.</p>\n<p>The Teradata SQL Driver for Python masks connection failures to down COPs, thereby hiding most connection failures from the client application. An exception is thrown to the application only when all the COPs are down for that database. If a COP is down, the next COP in the sequence (including a wrap-around to the first COP) receives extra connections that were originally destined for the down COP. When multiple IP addresses are defined in DNS for a COP, the Teradata SQL Driver for Python will attempt to connect to each of the COP's IP addresses, and the COP is considered down only when connection attempts fail to all of the COP's IP addresses.</p>\n<p>If COP Discovery is turned off, or no COP hostnames are defined in DNS, the Teradata SQL Driver for Python connects directly to the hostname specified in the <code>host</code> connection parameter. This permits load distribution schemes other than the COP Discovery approach. For example, round-robin DNS or a TCP/IP load distribution product can be used. COP Discovery takes precedence over simple database hostname lookup. To use an alternative load distribution scheme, either ensure that no COP hostnames are defined in DNS, or turn off COP Discovery with <code>cop</code> as <code>false</code>.</p>\n<p><a></a></p>\n<h3>Stored Password Protection</h3>\n<h4>Overview</h4>\n<p>Stored Password Protection enables an application to provide a connection password in encrypted form to the Teradata SQL Driver for Python.</p>\n<p>An encrypted password may be specified in the following contexts:</p>\n<ul>\n<li>A login password specified as the <code>password</code> connection parameter.</li>\n<li>A login password specified within the <code>logdata</code> connection parameter.</li>\n</ul>\n<p>If the password, however specified, begins with the prefix <code>ENCRYPTED_PASSWORD(</code> then the specified password must follow this format:</p>\n<p><code>ENCRYPTED_PASSWORD(file:</code><em>PasswordEncryptionKeyFileName</em><code>,file:</code><em>EncryptedPasswordFileName</em><code>)</code></p>\n<p>Each filename must be preceded by the <code>file:</code> prefix. The <em>PasswordEncryptionKeyFileName</em> must be separated from the <em>EncryptedPasswordFileName</em> by a single comma.</p>\n<p>The <em>PasswordEncryptionKeyFileName</em> specifies the name of a file that contains the password encryption key and associated information. The <em>EncryptedPasswordFileName</em> specifies the name of a file that contains the encrypted password and associated information. The two files are described below.</p>\n<p>Stored Password Protection is offered by the Teradata JDBC Driver, the Teradata SQL Driver for Python, and the Teradata SQL Driver for R. These drivers use the same file format.</p>\n<h4>Program TJEncryptPassword</h4>\n<p><code>TJEncryptPassword.py</code> is a sample program to create encrypted password files for use with Stored Password Protection. When the Teradata SQL Driver for Python is installed, the sample programs are placed in the <code>teradatasql/samples</code> directory under your Python installation directory.</p>\n<p>This program works in conjunction with Stored Password Protection offered by the Teradata JDBC Driver and the Teradata SQL Driver for Python. This program creates the files containing the password encryption key and encrypted password, which can be subsequently specified via the <code>ENCRYPTED_PASSWORD(</code> syntax.</p>\n<p>You are not required to use this program to create the files containing the password encryption key and encrypted password. You can develop your own software to create the necessary files. You may also use the <a href=\"https://downloads.teradata.com/doc/connectivity/jdbc/reference/current/samp/TJEncryptPassword.java.txt\" rel=\"nofollow\"><code>TJEncryptPassword.java</code></a> sample program that is available with the <a href=\"https://downloads.teradata.com/doc/connectivity/jdbc/reference/current/frameset.html\" rel=\"nofollow\">Teradata JDBC Driver Reference</a>. The only requirement is that the files must match the format expected by the Teradata SQL Driver for Python, which is documented below.</p>\n<p>This program encrypts the password and then immediately decrypts the password, in order to verify that the password can be successfully decrypted. This program mimics the password decryption of the Teradata SQL Driver for Python, and is intended to openly illustrate its operation and enable scrutiny by the community.</p>\n<p>The encrypted password is only as safe as the two files. You are responsible for restricting access to the files containing the password encryption key and encrypted password. If an attacker obtains both files, the password can be decrypted. The operating system file permissions for the two files should be as limited and restrictive as possible, to ensure that only the intended operating system userid has access to the files.</p>\n<p>The two files can be kept on separate physical volumes, to reduce the risk that both files might be lost at the same time. If either or both of the files are located on a network volume, then an encrypted wire protocol can be used to access the network volume, such as sshfs, encrypted NFSv4, or encrypted SMB 3.0.</p>\n<p>This program accepts eight command-line arguments:</p>\n<table>\n<thead>\n<tr>\n<th>Argument</th>\n<th>Example</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Transformation</td>\n<td><code>AES/CBC/NoPadding</code></td>\n<td>Specifies the transformation in the form <em>Algorithm</em><code>/</code><em>Mode</em><code>/</code><em>Padding</em>. Supported transformations are listed in a table below.</td>\n</tr>\n<tr>\n<td>KeySizeInBits</td>\n<td><code>256</code></td>\n<td>Specifies the algorithm key size, which governs the encryption strength.</td>\n</tr>\n<tr>\n<td>MAC</td>\n<td><code>HmacSHA256</code></td>\n<td>Specifies the message authentication code (MAC) algorithm <code>HmacSHA1</code> or <code>HmacSHA256</code>.</td>\n</tr>\n<tr>\n<td>PasswordEncryptionKeyFileName</td>\n<td><code>PassKey.properties</code></td>\n<td>Specifies a filename in the current directory, a relative pathname, or an absolute pathname. The file is created by this program. If the file already exists, it will be overwritten by the new file.</td>\n</tr>\n<tr>\n<td>EncryptedPasswordFileName</td>\n<td><code>EncPass.properties</code></td>\n<td>Specifies a filename in the current directory, a relative pathname, or an absolute pathname. The filename or pathname that must differ from the PasswordEncryptionKeyFileName. The file is created by this program. If the file already exists, it will be overwritten by the new file.</td>\n</tr>\n<tr>\n<td>Hostname</td>\n<td><code>whomooz</code></td>\n<td>Specifies the Teradata Database hostname.</td>\n</tr>\n<tr>\n<td>Username</td>\n<td><code>guest</code></td>\n<td>Specifies the Teradata Database username.</td>\n</tr>\n<tr>\n<td>Password</td>\n<td><code>please</code></td>\n<td>Specifies the Teradata Database password to be encrypted. Unicode characters in the password can be specified with the <code>\\u</code><em>XXXX</em> escape sequence.</td>\n</tr></tbody></table>\n<h4>Example Commands</h4>\n<p>The TJEncryptPassword program uses the Teradata SQL Driver for Python to log on to the specified Teradata Database using the encrypted password, so the Teradata SQL Driver for Python must have been installed with the <code>pip install teradatasql</code> command.</p>\n<p>The following commands assume that the <code>TJEncryptPassword.py</code> program file is located in the current directory. When the Teradata SQL Driver for Python is installed, the sample programs are placed in the <code>teradatasql/samples</code> directory under your Python installation directory. Change your current directory to the <code>teradatasql/samples</code> directory under your Python installation directory.</p>\n<p>The following example commands illustrate using a 256-bit AES key, and using the HmacSHA256 algorithm.</p>\n<table>\n<thead>\n<tr>\n<th>Platform</th>\n<th>Command</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>macOS or Linux</td>\n<td><code>python TJEncryptPassword.py AES/CBC/NoPadding 256 HmacSHA256 PassKey.properties EncPass.properties whomooz guest please</code></td>\n</tr>\n<tr>\n<td>Windows</td>\n<td><code>py -3 TJEncryptPassword.py AES/CBC/NoPadding 256 HmacSHA256 PassKey.properties EncPass.properties whomooz guest please</code></td>\n</tr></tbody></table>\n<h4>Password Encryption Key File Format</h4>\n<p>You are not required to use the TJEncryptPassword program to create the files containing the password encryption key and encrypted password. You can develop your own software to create the necessary files, but the files must match the format expected by the Teradata SQL Driver for Python.</p>\n<p>The password encryption key file is a text file in Java Properties file format, using the ISO 8859-1 character encoding.</p>\n<p>The file must contain the following string properties:</p>\n<table>\n<thead>\n<tr>\n<th>Property</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>version=1</code></td>\n<td>The version number must be <code>1</code>. This property is required.</td>\n</tr>\n<tr>\n<td><code>transformation=</code><em>Algorithm</em><code>/</code><em>Mode</em><code>/</code><em>Padding</em></td>\n<td>Specifies the transformation in the form <em>Algorithm</em><code>/</code><em>Mode</em><code>/</code><em>Padding</em>. Supported transformations are listed in a table below. This property is required.</td>\n</tr>\n<tr>\n<td><code>algorithm=</code><em>Algorithm</em></td>\n<td>This value must correspond to the <em>Algorithm</em> portion of the transformation. This property is required.</td>\n</tr>\n<tr>\n<td><code>match=</code><em>MatchValue</em></td>\n<td>The password encryption key and encrypted password files must contain the same match value. The match values are compared to ensure that the two specified files are related to each other, serving as a \"sanity check\" to help avoid configuration errors. This property is required.</td>\n</tr>\n<tr>\n<td><code>key=</code><em>HexDigits</em></td>\n<td>This value is the password encryption key, encoded as hex digits. This property is required.</td>\n</tr>\n<tr>\n<td><code>mac=</code><em>MACAlgorithm</em></td>\n<td>Specifies the message authentication code (MAC) algorithm <code>HmacSHA1</code> or <code>HmacSHA256</code>. Stored Password Protection performs Encrypt-then-MAC for protection from a padding oracle attack. This property is required.</td>\n</tr>\n<tr>\n<td><code>mackey=</code><em>HexDigits</em></td>\n<td>This value is the MAC key, encoded as hex digits. This property is required.</td>\n</tr></tbody></table>\n<p>The TJEncryptPassword program uses a timestamp as a shared match value, but a timestamp is not required. Any shared string can serve as a match value. The timestamp is not related in any way to the encryption of the password, and the timestamp cannot be used to decrypt the password.</p>\n<h4>Encrypted Password File Format</h4>\n<p>The encrypted password file is a text file in Java Properties file format, using the ISO 8859-1 character encoding.</p>\n<p>The file must contain the following string properties:</p>\n<table>\n<thead>\n<tr>\n<th>Property</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>version=1</code></td>\n<td>The version number must be <code>1</code>. This property is required.</td>\n</tr>\n<tr>\n<td><code>match=</code><em>MatchValue</em></td>\n<td>The password encryption key and encrypted password files must contain the same match value. The match values are compared to ensure that the two specified files are related to each other, serving as a \"sanity check\" to help avoid configuration errors. This property is required.</td>\n</tr>\n<tr>\n<td><code>password=</code><em>HexDigits</em></td>\n<td>This value is the encrypted password, encoded as hex digits. This property is required.</td>\n</tr>\n<tr>\n<td><code>params=</code><em>HexDigits</em></td>\n<td>This value contains the cipher algorithm parameters, if any, encoded as hex digits. Some ciphers need algorithm parameters that cannot be derived from the key, such as an initialization vector. This property is optional, depending on whether the cipher algorithm has associated parameters.</td>\n</tr>\n<tr>\n<td><code>hash=</code><em>HexDigits</em></td>\n<td>This value is the expected message authentication code (MAC), encoded as hex digits. After encryption, the expected MAC is calculated using the ciphertext, transformation name, and algorithm parameters if any. Before decryption, the Teradata SQL Driver for Python calculates the MAC using the ciphertext, transformation name, and algorithm parameters if any, and verifies that the calculated MAC matches the expected MAC. If the calculated MAC differs from the expected MAC, then either or both of the files may have been tampered with. This property is required.</td>\n</tr></tbody></table>\n<p>While <code>params</code> is technically optional, an initialization vector is required by all three block cipher modes <code>CBC</code>, <code>CFB</code>, and <code>OFB</code> that are supported by the Teradata SQL Driver for Python. ECB (Electronic Codebook) does not require <code>params</code>, but ECB is not supported by the Teradata SQL Driver for Python.</p>\n<h4>Transformation, Key Size, and MAC</h4>\n<p>A transformation is a string that describes the set of operations to be performed on the given input, to produce transformed output. A transformation specifies the name of a cryptographic algorithm such as DES or AES, followed by a feedback mode and padding scheme.</p>\n<p>The Teradata SQL Driver for Python supports the following transformations and key sizes.</p>\n<table>\n<thead>\n<tr>\n<th>Transformation</th>\n<th>Key Size</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>DES/CBC/NoPadding</code></td>\n<td>64</td>\n</tr>\n<tr>\n<td><code>DES/CBC/PKCS5Padding</code></td>\n<td>64</td>\n</tr>\n<tr>\n<td><code>DES/CFB/NoPadding</code></td>\n<td>64</td>\n</tr>\n<tr>\n<td><code>DES/CFB/PKCS5Padding</code></td>\n<td>64</td>\n</tr>\n<tr>\n<td><code>DES/OFB/NoPadding</code></td>\n<td>64</td>\n</tr>\n<tr>\n<td><code>DES/OFB/PKCS5Padding</code></td>\n<td>64</td>\n</tr>\n<tr>\n<td><code>DESede/CBC/NoPadding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>DESede/CBC/PKCS5Padding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>DESede/CFB/NoPadding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>DESede/CFB/PKCS5Padding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>DESede/OFB/NoPadding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>DESede/OFB/PKCS5Padding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>AES/CBC/NoPadding</code></td>\n<td>128</td>\n</tr>\n<tr>\n<td><code>AES/CBC/NoPadding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>AES/CBC/NoPadding</code></td>\n<td>256</td>\n</tr>\n<tr>\n<td><code>AES/CBC/PKCS5Padding</code></td>\n<td>128</td>\n</tr>\n<tr>\n<td><code>AES/CBC/PKCS5Padding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>AES/CBC/PKCS5Padding</code></td>\n<td>256</td>\n</tr>\n<tr>\n<td><code>AES/CFB/NoPadding</code></td>\n<td>128</td>\n</tr>\n<tr>\n<td><code>AES/CFB/NoPadding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>AES/CFB/NoPadding</code></td>\n<td>256</td>\n</tr>\n<tr>\n<td><code>AES/CFB/PKCS5Padding</code></td>\n<td>128</td>\n</tr>\n<tr>\n<td><code>AES/CFB/PKCS5Padding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>AES/CFB/PKCS5Padding</code></td>\n<td>256</td>\n</tr>\n<tr>\n<td><code>AES/OFB/NoPadding</code></td>\n<td>128</td>\n</tr>\n<tr>\n<td><code>AES/OFB/NoPadding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>AES/OFB/NoPadding</code></td>\n<td>256</td>\n</tr>\n<tr>\n<td><code>AES/OFB/PKCS5Padding</code></td>\n<td>128</td>\n</tr>\n<tr>\n<td><code>AES/OFB/PKCS5Padding</code></td>\n<td>192</td>\n</tr>\n<tr>\n<td><code>AES/OFB/PKCS5Padding</code></td>\n<td>256</td>\n</tr></tbody></table>\n<p>Stored Password Protection uses a symmetric encryption algorithm such as DES or AES, in which the same secret key is used for encryption and decryption of the password. Stored Password Protection does not use an asymmetric encryption algorithm such as RSA, with separate public and private keys.</p>\n<p>CBC (Cipher Block Chaining) is a block cipher encryption mode. With CBC, each ciphertext block is dependent on all plaintext blocks processed up to that point. CBC is suitable for encrypting data whose total byte count exceeds the algorithm's block size, and is therefore suitable for use with Stored Password Protection.</p>\n<p>Stored Password Protection hides the password length in the encrypted password file by extending the length of the UTF8-encoded password with trailing null bytes. The length is extended to the next 512-byte boundary.</p>\n<ul>\n<li>A block cipher with no padding, such as <code>AES/CBC/NoPadding</code>, may only be used to encrypt data whose byte count after extension is a multiple of the algorithm's block size. The 512-byte boundary is compatible with many block ciphers. AES, for example, has a block size of 128 bits (16 bytes), and is therefore compatible with the 512-byte boundary.</li>\n<li>A block cipher with padding, such as <code>AES/CBC/PKCS5Padding</code>, can be used to encrypt data of any length. However, CBC with padding is vulnerable to a \"padding oracle attack\", so Stored Password Protection performs Encrypt-then-MAC for protection from a padding oracle attack. MAC algorithms <code>HmacSHA1</code> and <code>HmacSHA256</code> are supported.</li>\n<li>The Teradata SQL Driver for Python does not support block ciphers used as byte-oriented ciphers via modes such as <code>CFB8</code> or <code>OFB8</code>.</li>\n</ul>\n<p>The strength of the encryption depends on your choice of cipher algorithm and key size.</p>\n<ul>\n<li>AES uses a 128-bit (16 byte), 192-bit (24 byte), or 256-bit (32 byte) key.</li>\n<li>DESede uses a 192-bit (24 byte) key. The The Teradata SQL Driver for Python does not support a 128-bit (16 byte) key for DESede.</li>\n<li>DES uses a 64-bit (8 byte) key.</li>\n</ul>\n<h4>Sharing Files with the Teradata JDBC Driver</h4>\n<p>The Teradata SQL Driver for Python and the Teradata JDBC Driver can share the files containing the password encryption key and encrypted password, if you use a transformation, key size, and MAC algorithm that is supported by both drivers.</p>\n<ul>\n<li>Recommended choices for compatibility are <code>AES/CBC/NoPadding</code> and <code>HmacSHA256</code>.</li>\n<li>Use a 256-bit key if your Java environment has the Java Cryptography Extension (JCE) Unlimited Strength Jurisdiction Policy Files from Oracle.</li>\n<li>Use a 128-bit key if your Java environment does not have the Unlimited Strength Jurisdiction Policy Files.</li>\n<li>Use <code>HmacSHA1</code> for compatibility with JDK 1.4.2.</li>\n</ul>\n<h4>File Locations</h4>\n<p>For the <code>ENCRYPTED_PASSWORD(</code> syntax of the Teradata SQL Driver for Python, each filename must be preceded by the <code>file:</code> prefix.\nThe <em>PasswordEncryptionKeyFileName</em> must be separated from the <em>EncryptedPasswordFileName</em> by a single comma. The files can be located in the current directory, specified with a relative path, or specified with an absolute path.</p>\n<p>Example for files in the current directory:</p>\n<pre><code>ENCRYPTED_PASSWORD(file:JohnDoeKey.properties,file:JohnDoePass.properties)\n</code></pre>\n<p>Example with relative paths:</p>\n<pre><code>ENCRYPTED_PASSWORD(file:../dir1/JohnDoeKey.properties,file:../dir2/JohnDoePass.properties)\n</code></pre>\n<p>Example with absolute paths on Windows:</p>\n<pre><code>ENCRYPTED_PASSWORD(file:c:/dir1/JohnDoeKey.properties,file:c:/dir2/JohnDoePass.properties)\n</code></pre>\n<p>Example with absolute paths on Linux:</p>\n<pre><code>ENCRYPTED_PASSWORD(file:/dir1/JohnDoeKey.properties,file:/dir2/JohnDoePass.properties)\n</code></pre>\n<h4>Processing Sequence</h4>\n<p>The two filenames specified for an encrypted password must be accessible to the Teradata SQL Driver for Python and must conform to the properties file formats described above. The Teradata SQL Driver for Python raises an exception if the file is not accessible, or the file does not conform to the required file format.</p>\n<p>The Teradata SQL Driver for Python verifies that the match values in the two files are present, and match each other. The Teradata SQL Driver for Python raises an exception if the match values differ from each other. The match values are compared to ensure that the two specified files are related to each other, serving as a \"sanity check\" to help avoid configuration errors. The TJEncryptPassword program uses a timestamp as a shared match value, but a timestamp is not required. Any shared string can serve as a match value. The timestamp is not related in any way to the encryption of the password, and the timestamp cannot be used to decrypt the password.</p>\n<p>Before decryption, the Teradata SQL Driver for Python calculates the MAC using the ciphertext, transformation name, and algorithm parameters if any, and verifies that the calculated MAC matches the expected MAC. The Teradata SQL Driver for Python raises an exception if the calculated MAC differs from the expected MAC, to indicate that either or both of the files may have been tampered with.</p>\n<p>Finally, the Teradata SQL Driver for Python uses the decrypted password to log on to the Teradata Database.</p>\n<p><a></a></p>\n<h3>Transaction Mode</h3>\n<p>The <code>tmode</code> connection parameter enables an application to specify the transaction mode for the connection.</p>\n<ul>\n<li><code>\"tmode\":\"ANSI\"</code> provides American National Standards Institute (ANSI) transaction semantics. This mode is recommended.</li>\n<li><code>\"tmode\":\"TERA\"</code> provides legacy Teradata transaction semantics. This mode is only recommended for legacy applications that require Teradata transaction semantics.</li>\n<li><code>\"tmode\":\"DEFAULT\"</code> provides the default transaction mode configured for the Teradata Database, which may be either ANSI or TERA mode. <code>\"tmode\":\"DEFAULT\"</code> is the default when the <code>tmode</code> connection parameter is omitted.</li>\n</ul>\n<p>While ANSI mode is generally recommended, please note that every application is different, and some applications may need to use TERA mode. The following differences between ANSI and TERA mode might affect a typical user or application:</p>\n<ol>\n<li>Silent truncation of inserted data occurs in TERA mode, but not ANSI mode. In ANSI mode, the Teradata Database returns an error instead of truncating data.</li>\n<li>Tables created in ANSI mode are <code>MULTISET</code> by default. Tables created in TERA mode are <code>SET</code> tables by default.</li>\n<li>For tables created in ANSI mode, character columns are <code>CASESPECIFIC</code> by default. For tables created in TERA mode, character columns are <code>NOT CASESPECIFIC</code> by default.</li>\n<li>In ANSI mode, character literals are <code>CASESPECIFIC</code>. In TERA mode, character literals are <code>NOT CASESPECIFIC</code>.</li>\n</ol>\n<p>The last two behavior differences, taken together, may cause character data comparisons (such as in <code>WHERE</code> clause conditions) to be case-insensitive in TERA mode, but case-sensitive in ANSI mode. This, in turn, can produce different query results in ANSI mode versus TERA mode. Comparing two <code>NOT CASESPECIFIC</code> expressions is case-insensitive regardless of mode, and comparing a <code>CASESPECIFIC</code> expression to another expression of any kind is case-sensitive regardless of mode. You may explicitly <code>CAST</code> an expression to be <code>CASESPECIFIC</code> or <code>NOT CASESPECIFIC</code> to obtain the character data comparison required by your application.</p>\n<p>The Teradata Database Reference / <em>SQL Request and Transaction Processing</em> recommends that ANSI mode be used for all new applications. The primary benefit of using ANSI mode is that inadvertent data truncation is avoided. In contrast, when using TERA mode, silent data truncation can occur when data is inserted, because silent data truncation is a feature of TERA mode.</p>\n<p>A drawback of using ANSI mode is that you can only call stored procedures that were created using ANSI mode, and you cannot call stored procedures that were created using TERA mode. It may not be possible to switch over to ANSI mode exclusively, because you may have some legacy applications that require TERA mode to work properly. You can work around this drawback by creating your stored procedures twice, in two different users/databases, once using ANSI mode, and once using TERA mode.</p>\n<p>Refer to the Teradata Database Reference / <em>SQL Request and Transaction Processing</em> for complete information regarding the differences between ANSI and TERA transaction modes.</p>\n<p><a></a></p>\n<h3>Auto-Commit</h3>\n<p>The Teradata SQL Driver for Python provides auto-commit on and off functionality for both ANSI and TERA mode.</p>\n<p>When a connection is first established, it begins with the default auto-commit setting, which is on. When auto-commit is on, the driver is solely responsible for managing transactions, and the driver commits each SQL request that is successfully executed. An application should not execute any transaction management SQL commands when auto-commit is on. An application should not call the <code>commit</code> method or the <code>rollback</code> method when auto-commit is on.</p>\n<p>An application can manage transactions itself by calling the <code>execute</code> method with the <code>teradata_nativesql</code> and <code>teradata_autocommit_off</code> escape functions to turn off auto-commit.</p>\n<pre><code>cur.execute(\"{fn teradata_nativesql}{fn teradata_autocommit_off}\")\n</code></pre>\n<p>When auto-commit is off, the driver leaves the current transaction open after each SQL request is executed, and the application is responsible for committing or rolling back the transaction by calling the <code>commit</code> or the <code>rollback</code> method, respectively.</p>\n<p>Auto-commit remains turned off until the application turns it back on.</p>\n<pre><code>cur.execute(\"{fn teradata_nativesql}{fn teradata_autocommit_on}\")\n</code></pre>\n<p>Best practices recommend that an application avoid executing database-vendor-specific transaction management commands such as <code>BT</code>, <code>ET</code>, <code>ABORT</code>, <code>COMMIT</code>, or <code>ROLLBACK</code>, because such commands differ from one vendor to another. (They even differ between Teradata's two modes ANSI and TERA.) Instead, best practices recommend that an application only call the standard methods <code>commit</code> and <code>rollback</code> for transaction management.</p>\n<ol>\n<li>When auto-commit is on in ANSI mode, the driver automatically executes <code>COMMIT</code> after every successful SQL request.</li>\n<li>When auto-commit is off in ANSI mode, the driver does not automatically execute <code>COMMIT</code>. When the application calls the <code>commit</code> method, then the driver executes <code>COMMIT</code>.</li>\n<li>When auto-commit is on in TERA mode, the driver does not execute <code>BT</code> or <code>ET</code>, unless the application explicitly executes <code>BT</code> or <code>ET</code> commands itself, which is not recommended.</li>\n<li>When auto-commit is off in TERA mode, the driver executes <code>BT</code> before submitting the application's first SQL request of a new transaction. When the application calls the <code>commit</code> method, then the driver executes <code>ET</code> until the transaction is complete.</li>\n</ol>\n<p>As part of the wire protocol between the Teradata Database and Teradata client interface software (such as the Teradata SQL Driver for Python), each message transmitted from the Teradata Database to the client has a bit designated to indicate whether the session has a transaction in progress or not. Thus, the client interface software is kept informed as to whether the session has a transaction in progress or not.</p>\n<p>In TERA mode with auto-commit off, when the application uses the driver to execute a SQL request, if the session does not have a transaction in progress, then the driver automatically executes <code>BT</code> before executing the application's SQL request. Subsequently, in TERA mode with auto-commit off, when the application uses the driver to execute another SQL request, and the session already has a transaction in progress, then the driver has no need to execute <code>BT</code> before executing the application's SQL request.</p>\n<p>In TERA mode, <code>BT</code> and <code>ET</code> pairs can be nested, and the Teradata Database keeps track of the nesting level. The outermost <code>BT</code>/<code>ET</code> pair defines the transaction scope; inner <code>BT</code>/<code>ET</code> pairs have no effect on the transaction because the Teradata Database does not provide actual transaction nesting. To commit the transaction, <code>ET</code> commands must be repeatedly executed until the nesting is unwound. The Teradata wire protocol bit (mentioned earlier) indicates when the nesting is unwound and the transaction is complete. When the application calls the <code>commit</code> method in TERA mode, the driver repeatedly executes <code>ET</code> commands until the nesting is unwound and the transaction is complete.</p>\n<p>In rare cases, an application may not follow best practices and may explicitly execute transaction management commands. Such an application must turn off auto-commit before executing transaction management commands such as <code>BT</code>, <code>ET</code>, <code>ABORT</code>, <code>COMMIT</code>, or <code>ROLLBACK</code>. The application is responsible for executing the appropriate commands for the transaction mode in effect. TERA mode commands are <code>BT</code>, <code>ET</code>, and <code>ABORT</code>. ANSI mode commands are <code>COMMIT</code> and <code>ROLLBACK</code>. An application must take special care when opening a transaction in TERA mode with auto-commit off. In TERA mode with auto-commit off, when the application executes a SQL request, if the session does not have a transaction in progress, then the driver automatically executes <code>BT</code> before executing the application's SQL request. Therefore, the application should not begin a transaction by executing <code>BT</code>.</p>\n<pre><code># TERA mode example showing undesirable BT/ET nesting\ncur.execute(\"{fn teradata_nativesql}{fn teradata_autocommit_off}\")\ncur.execute(\"BT\") # BT automatically executed by the driver before this, and produces a nested BT\ncur.execute(\"insert into mytable1 values(1, 2)\")\ncur.execute(\"insert into mytable2 values(3, 4)\")\ncur.execute(\"ET\") # unwind nesting\ncur.execute(\"ET\") # complete transaction\n\n# TERA mode example showing how to avoid BT/ET nesting\ncur.execute(\"{fn teradata_nativesql}{fn teradata_autocommit_off}\")\ncur.execute(\"insert into mytable1 values(1, 2)\") # BT automatically executed by the driver before this\ncur.execute(\"insert into mytable2 values(3, 4)\")\ncur.execute(\"ET\") # complete transaction\n</code></pre>\n<p>Please note that neither previous example shows best practices. Best practices recommend that an application only call the standard methods <code>commit</code> and <code>rollback</code> for transaction management.</p>\n<pre><code># Example showing best practice\ncur.execute(\"{fn teradata_nativesql}{fn teradata_autocommit_off}\")\ncur.execute(\"insert into mytable1 values(1, 2)\")\ncur.execute(\"insert into mytable2 values(3, 4)\")\ncon.commit()\n</code></pre>\n<p><a></a></p>\n<h3>Data Types</h3>\n<p>The table below lists the Teradata Database data types supported by the Teradata SQL Driver for Python, and indicates the corresponding Python data type returned in result set rows.</p>\n<table>\n<thead>\n<tr>\n<th>Teradata Database data type</th>\n<th>Result set Python data type</th>\n<th>With <code>teradata_values</code> as <code>false</code></th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>BIGINT</code></td>\n<td><code>int</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>BLOB</code></td>\n<td><code>bytes</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>BYTE</code></td>\n<td><code>bytes</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>BYTEINT</code></td>\n<td><code>int</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>CHAR</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>CLOB</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>DATE</code></td>\n<td><code>datetime.date</code></td>\n<td><code>str</code></td>\n</tr>\n<tr>\n<td><code>DECIMAL</code></td>\n<td><code>decimal.Decimal</code></td>\n<td><code>str</code></td>\n</tr>\n<tr>\n<td><code>FLOAT</code></td>\n<td><code>float</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTEGER</code></td>\n<td><code>int</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL YEAR</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL YEAR TO MONTH</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL MONTH</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL DAY</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL DAY TO HOUR</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL DAY TO MINUTE</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL DAY TO SECOND</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL HOUR</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL HOUR TO MINUTE</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL HOUR TO SECOND</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL MINUTE</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL MINUTE TO SECOND</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>INTERVAL SECOND</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>NUMBER</code></td>\n<td><code>decimal.Decimal</code></td>\n<td><code>str</code></td>\n</tr>\n<tr>\n<td><code>PERIOD(DATE)</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>PERIOD(TIME)</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>PERIOD(TIME WITH TIME ZONE)</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>PERIOD(TIMESTAMP)</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>PERIOD(TIMESTAMP WITH TIME ZONE)</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>SMALLINT</code></td>\n<td><code>int</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>TIME</code></td>\n<td><code>datetime.time</code></td>\n<td><code>str</code></td>\n</tr>\n<tr>\n<td><code>TIME WITH TIME ZONE</code></td>\n<td><code>datetime.time</code> with <code>tzinfo</code></td>\n<td><code>str</code></td>\n</tr>\n<tr>\n<td><code>TIMESTAMP</code></td>\n<td><code>datetime.datetime</code></td>\n<td><code>str</code></td>\n</tr>\n<tr>\n<td><code>TIMESTAMP WITH TIME ZONE</code></td>\n<td><code>datetime.datetime</code> with <code>tzinfo</code></td>\n<td><code>str</code></td>\n</tr>\n<tr>\n<td><code>VARBYTE</code></td>\n<td><code>bytes</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>VARCHAR</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr>\n<tr>\n<td><code>XML</code></td>\n<td><code>str</code></td>\n<td></td>\n</tr></tbody></table>\n<p>The table below lists the parameterized SQL bind-value Python data types supported by the Teradata SQL Driver for Python, and indicates the corresponding Teradata Database data type transmitted to the server.</p>\n<table>\n<thead>\n<tr>\n<th>Bind-value Python data type</th>\n<th>Teradata Database data type</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>bytes</code></td>\n<td><code>VARBYTE</code></td>\n</tr>\n<tr>\n<td><code>datetime.date</code></td>\n<td><code>DATE</code></td>\n</tr>\n<tr>\n<td><code>datetime.datetime</code></td>\n<td><code>TIMESTAMP</code></td>\n</tr>\n<tr>\n<td><code>datetime.datetime</code> with <code>tzinfo</code></td>\n<td><code>TIMESTAMP WITH TIME ZONE</code></td>\n</tr>\n<tr>\n<td><code>datetime.time</code></td>\n<td><code>TIME</code></td>\n</tr>\n<tr>\n<td><code>datetime.time</code> with <code>tzinfo</code></td>\n<td><code>TIME WITH TIME ZONE</code></td>\n</tr>\n<tr>\n<td><code>datetime.timedelta</code></td>\n<td><code>VARCHAR</code> format compatible with <code>INTERVAL DAY TO SECOND</code></td>\n</tr>\n<tr>\n<td><code>decimal.Decimal</code></td>\n<td><code>NUMBER</code></td>\n</tr>\n<tr>\n<td><code>float</code></td>\n<td><code>FLOAT</code></td>\n</tr>\n<tr>\n<td><code>int</code></td>\n<td><code>BIGINT</code></td>\n</tr>\n<tr>\n<td><code>str</code></td>\n<td><code>VARCHAR</code></td>\n</tr></tbody></table>\n<p>Transforms are used for SQL <code>ARRAY</code> data values, and they can be transferred to and from the database as <code>VARCHAR</code> values.</p>\n<p>Transforms are used for structured UDT data values, and they can be transferred to and from the database as <code>VARCHAR</code> values.</p>\n<p><a></a></p>\n<h3>Null Values</h3>\n<p>SQL <code>NULL</code> values received from the Teradata Database are returned in result set rows as Python <code>None</code> values.</p>\n<p>A Python <code>None</code> value bound to a question-mark parameter marker is transmitted to the Teradata Database as a <code>NULL</code> <code>VARCHAR</code> value.</p>\n<p><a></a></p>\n<h3>Character Export Width</h3>\n<p>The Teradata SQL Driver for Python always uses the UTF8 session character set, and the <code>charset</code> connection parameter is not supported. Be aware of the Teradata Database's <em>Character Export Width</em> behavior that adds trailing space padding to fixed-width <code>CHAR</code> data type result set column values when using the UTF8 session character set.</p>\n<p>The Teradata Database <code>CHAR(</code><em>n</em><code>)</code> data type is a fixed-width data type (holding <em>n</em> characters), and the Teradata Database reserves a fixed number of bytes for the <code>CHAR(</code><em>n</em><code>)</code> data type in response spools and in network message traffic.</p>\n<p>UTF8 is a variable-width character encoding scheme that requires a varying number of bytes for each character. When the UTF8 session character set is used, the Teradata Database reserves the maximum number of bytes that the <code>CHAR(</code><em>n</em><code>)</code> data type could occupy in response spools and in network message traffic. When the UTF8 session character set is used, the Teradata Database appends padding characters to the tail end of <code>CHAR(</code><em>n</em><code>)</code> values smaller than the reserved maximum size, so that the <code>CHAR(</code><em>n</em><code>)</code> values all occupy the same fixed number of bytes in response spools and in network message traffic.</p>\n<p>Work around this drawback by using <code>CAST</code> or <code>TRIM</code> in SQL <code>SELECT</code> statements, or in views, to convert fixed-width <code>CHAR</code> data types to <code>VARCHAR</code>.</p>\n<p>Given a table with fixed-width <code>CHAR</code> columns:</p>\n<p><code>CREATE TABLE MyTable (c1 CHAR(10), c2 CHAR(10))</code></p>\n<p>Original query that produces trailing space padding:</p>\n<p><code>SELECT c1, c2 FROM MyTable</code></p>\n<p>Modified query with either <code>CAST</code> or <code>TRIM</code> to avoid trailing space padding:</p>\n<p><code>SELECT CAST(c1 AS VARCHAR(10)), TRIM(TRAILING FROM c1) FROM MyTable</code></p>\n<p>Or wrap query in a view with <code>CAST</code> or <code>TRIM</code> to avoid trailing space padding:</p>\n<p><code>CREATE VIEW MyView (c1, c2) AS SELECT CAST(c1 AS VARCHAR(10)), TRIM(TRAILING FROM c2) FROM MyTable</code></p>\n<p><code>SELECT c1, c2 FROM MyView</code></p>\n<p>This technique is also demonstrated in sample program <code>CharPadding.py</code>.</p>\n<p><a></a></p>\n<h3>Module Constructors</h3>\n<p><code>teradatasql.connect(</code> <em>JSONConnectionString</em> <code>,</code> <em>Parameters...</em> <code>)</code></p>\n<p>Creates a connection to the database and returns a Connection object.</p>\n<p>The first parameter is an optional JSON string that defaults to <code>None</code>. The second and subsequent arguments are optional <code>kwargs</code>. Specify connection parameters as a JSON string, as <code>kwargs</code>, or a combination of the two.</p>\n<p>When a combination of parameters are specified, connection parameters specified as <code>kwargs</code> take precedence over same-named connection parameters specified in the JSON string.</p>\n<hr>\n<p><code>teradatasql.Date(</code> <em>Year</em> <code>,</code> <em>Month</em> <code>,</code> <em>Day</em> <code>)</code></p>\n<p>Creates and returns a <code>datetime.date</code> value.</p>\n<hr>\n<p><code>teradatasql.DateFromTicks(</code> <em>Seconds</em> <code>)</code></p>\n<p>Creates and returns a <code>datetime.date</code> value corresponding to the specified number of seconds after 1970-01-01 00:00:00.</p>\n<hr>\n<p><code>teradatasql.Time(</code> <em>Hour</em> <code>,</code> <em>Minute</em> <code>,</code> <em>Second</em> <code>)</code></p>\n<p>Creates and returns a <code>datetime.time</code> value.</p>\n<hr>\n<p><code>teradatasql.TimeFromTicks(</code> <em>Seconds</em> <code>)</code></p>\n<p>Creates and returns a <code>datetime.time</code> value corresponding to the specified number of seconds after 1970-01-01 00:00:00.</p>\n<hr>\n<p><code>teradatasql.Timestamp(</code> <em>Year</em> <code>,</code> <em>Month</em> <code>,</code> <em>Day</em> <code>,</code> <em>Hour</em> <code>,</code> <em>Minute</em> <code>,</code> <em>Second</em> <code>)</code></p>\n<p>Creates and returns a <code>datetime.datetime</code> value.</p>\n<hr>\n<p><code>teradatasql.TimestampFromTicks(</code> <em>Seconds</em> <code>)</code></p>\n<p>Creates and returns a <code>datetime.datetime</code> value corresponding to the specified number of seconds after 1970-01-01 00:00:00.</p>\n<p><a></a></p>\n<h3>Module Globals</h3>\n<p><code>teradatasql.apilevel</code></p>\n<p>String constant <code>\"2.0\"</code> indicating that the Teradata SQL Driver for Python implements the <a href=\"https://www.python.org/dev/peps/pep-0249/\" rel=\"nofollow\">PEP-249 Python Database API Specification 2.0</a>.</p>\n<hr>\n<p><code>teradatasql.threadsafety</code></p>\n<p>Integer constant <code>2</code> indicating that threads may share this module, and threads may share connections, but threads must not share cursors.</p>\n<hr>\n<p><code>teradatasql.paramstyle</code></p>\n<p>String constant <code>\"qmark\"</code> indicating that prepared SQL requests use question-mark parameter markers.</p>\n<p><a></a></p>\n<h3>Module Exceptions</h3>\n<p><code>teradatasql.Error</code> is the base class for other exceptions.</p>\n<ul>\n<li><code>teradatasql.InterfaceError</code> is raised for errors related to the driver. Not supported yet.</li>\n<li><code>teradatasql.DatabaseError</code> is raised for errors related to the database.\n<ul>\n<li><code>teradatasql.DataError</code> is raised for data value errors such as division by zero. Not supported yet.</li>\n<li><code>teradatasql.IntegrityError</code> is raised for referential integrity violations. Not supported yet.</li>\n<li><code>teradatasql.OperationalError</code> is raised for errors related to the database's operation.</li>\n<li><code>teradatasql.ProgrammingError</code> is raised for SQL object existence errors and SQL syntax errors. Not supported yet.</li>\n</ul>\n</li>\n</ul>\n<p><a></a></p>\n<h3>Connection Methods</h3>\n<p><code>.close()</code></p>\n<p>Closes the Connection.</p>\n<hr>\n<p><code>.commit()</code></p>\n<p>Commits the current transaction.</p>\n<hr>\n<p><code>.cursor()</code></p>\n<p>Creates and returns a new Cursor object for the Connection.</p>\n<hr>\n<p><code>.rollback()</code></p>\n<p>Rolls back the current transaction.</p>\n<p><a></a></p>\n<h3>Cursor Attributes</h3>\n<p><code>.arraysize</code></p>\n<p>Read/write attribute specifying the number of rows to fetch at a time with the <code>.fetchmany()</code> method. Defaults to <code>1</code> meaning fetch a single row at a time.</p>\n<hr>\n<p><code>.connection</code></p>\n<p>Read-only attribute indicating the Cursor's parent Connection object.</p>\n<hr>\n<p><code>.description</code></p>\n<p>Read-only attribute consisting of a sequence of seven-item sequences that each describe a result set column, available after a SQL request is executed.</p>\n<ul>\n<li><code>.description[</code><em>Column</em><code>][0]</code> provides the column name.</li>\n<li><code>.description[</code><em>Column</em><code>][1]</code> provides the column type code as an object comparable to one of the Type Objects listed below.</li>\n<li><code>.description[</code><em>Column</em><code>][2]</code> provides the column display size in characters. Not implemented yet.</li>\n<li><code>.description[</code><em>Column</em><code>][3]</code> provides the column size in bytes.</li>\n<li><code>.description[</code><em>Column</em><code>][4]</code> provides the column precision if applicable, or <code>None</code> otherwise.</li>\n<li><code>.description[</code><em>Column</em><code>][5]</code> provides the column scale if applicable, or <code>None</code> otherwise.</li>\n<li><code>.description[</code><em>Column</em><code>][6]</code> provides the column nullability as <code>True</code> or <code>False</code>.</li>\n</ul>\n<hr>\n<p><code>.rowcount</code></p>\n<p>Read-only attribute indicating the number of rows returned from, or affected by, the current SQL statement.</p>\n<p><a></a></p>\n<h3>Cursor Methods</h3>\n<p><code>.callproc(</code> <em>ProcedureName</em> <code>,</code> <em>OptionalSequenceOfParameterValues</em> <code>)</code></p>\n<p>Calls the stored procedure specified by <em>ProcedureName</em>.\nProvide the second argument as a sequence of <code>IN</code> and <code>INOUT</code> parameter values to bind the values to question-mark parameter markers in the SQL request.\nSpecifying parameter values as a mapping is not supported.\nReturns a result set consisting of the <code>INOUT</code> parameter output values, if any, followed by any dynamic result sets.</p>\n<p><code>OUT</code> parameters are not supported by this method. Use <code>.execute</code> to call a stored procedure with <code>OUT</code> parameters.</p>\n<hr>\n<p><code>.close()</code></p>\n<p>Closes the Cursor.</p>\n<hr>\n<p><code>.execute(</code> <em>SQLRequest</em> <code>,</code> <em>OptionalSequenceOfParameterValues</em> <code>, ignoreErrors=</code> <em>OptionalSequenceOfIgnoredErrorCodes</em> <code>)</code></p>\n<p>Executes the SQL request.\nIf a sequence of parameter values is provided as the second argument, the values will be bound to question-mark parameter markers in the SQL request. Specifying parameter values as a mapping is not supported.</p>\n<p>The <code>ignoreErrors</code> parameter is optional. The ignored error codes must be specified as a sequence of integers.</p>\n<hr>\n<p><code>.executemany(</code> <em>SQLRequest</em> <code>,</code> <em>SequenceOfSequencesOfParameterValues</em> <code>, ignoreErrors=</code> <em>OptionalSequenceOfIgnoredErrorCodes</em> <code>)</code></p>\n<p>Executes the SQL request as an iterated SQL request for the batch of parameter values.\nThe batch of parameter values must be specified as a sequence of sequences. Specifying parameter values as a mapping is not supported.</p>\n<p>The <code>ignoreErrors</code> parameter is optional. The ignored error codes must be specified as a sequence of integers.</p>\n<hr>\n<p><code>.fetchall()</code></p>\n<p>Fetches all remaining rows of the current result set.\nReturns a sequence of sequences of column values.</p>\n<hr>\n<p><code>.fetchmany(</code> <em>OptionalRowCount</em> <code>)</code></p>\n<p>Fetches the next series of rows of the current result set.\nThe argument specifies the number of rows to fetch. If no argument is provided, then the Cursor's <code>.arraysize</code> attribute will determine the number of rows to fetch.\nReturns a sequence of sequences of column values, or an empty sequence to indicate that all rows have been fetched.</p>\n<hr>\n<p><code>.fetchone()</code></p>\n<p>Fetches the next row of the current result set.\nReturns a sequence of column values, or <code>None</code> to indicate that all rows have been fetched.</p>\n<hr>\n<p><code>.nextset()</code></p>\n<p>Advances to the next result set.\nReturns <code>True</code> if another result set is available, or <code>None</code> to indicate that all result sets have been fetched.</p>\n<hr>\n<p><code>.setinputsizes(</code> <em>SequenceOfTypesOrSizes</em> <code>)</code></p>\n<p>Has no effect.</p>\n<hr>\n<p><code>.setoutputsize(</code> <em>Size</em> <code>,</code> <em>OptionalColumnIndex</em> <code>)</code></p>\n<p>Has no effect.</p>\n<p><a></a></p>\n<h3>Type Objects</h3>\n<p><code>teradatasql.BINARY</code></p>\n<p>Identifies a SQL <code>BLOB</code>, <code>BYTE</code>, or <code>VARBYTE</code> column as a binary data type when compared with the Cursor's description attribute.</p>\n<p><code>.description[</code><em>Column</em><code>][1] == teradatasql.BINARY</code></p>\n<hr>\n<p><code>teradatasql.DATETIME</code></p>\n<p>Identifies a SQL <code>DATE</code>, <code>TIME</code>, <code>TIME WITH TIME ZONE</code>, <code>TIMESTAMP</code>, or <code>TIMESTAMP WITH TIME ZONE</code> column as a date/time data type when compared with the Cursor's description attribute.</p>\n<p><code>.description[</code><em>Column</em><code>][1] == teradatasql.DATETIME</code></p>\n<hr>\n<p><code>teradatasql.NUMBER</code></p>\n<p>Identifies a SQL <code>BIGINT</code>, <code>BYTEINT</code>, <code>DECIMAL</code>, <code>FLOAT</code>, <code>INTEGER</code>, <code>NUMBER</code>, or <code>SMALLINT</code> column as a numeric data type when compared with the Cursor's description attribute.</p>\n<p><code>.description[</code><em>Column</em><code>][1] == teradatasql.NUMBER</code></p>\n<hr>\n<p><code>teradatasql.STRING</code></p>\n<p>Identifies a SQL <code>CHAR</code>, <code>CLOB</code>, <code>INTERVAL</code>, <code>PERIOD</code>, or <code>VARCHAR</code> column as a character data type when compared with the Cursor's description attribute.</p>\n<p><code>.description[</code><em>Column</em><code>][1] == teradatasql.STRING</code></p>\n<p><a></a></p>\n<h3>Escape Syntax</h3>\n<p>The Teradata SQL Driver for Python accepts most of the JDBC escape clauses offered by the Teradata JDBC Driver.</p>\n<h4>Date and Time Literals</h4>\n<p>Date and time literal escape clauses are replaced by the corresponding SQL literal before the SQL request text is transmitted to the database.</p>\n<table>\n<thead>\n<tr>\n<th>Literal Type</th>\n<th>Format</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>Date</td>\n<td><code>{d '</code><em>yyyy-mm-dd</em><code>'}</code></td>\n</tr>\n<tr>\n<td>Time</td>\n<td><code>{t '</code><em>hh:mm:ss</em><code>'}</code></td>\n</tr>\n<tr>\n<td>Timestamp</td>\n<td><code>{ts '</code><em>yyyy-mm-dd hh:mm:ss</em><code>'}</code></td>\n</tr>\n<tr>\n<td>Timestamp</td>\n<td><code>{ts '</code><em>yyyy-mm-dd hh:mm:ss.f</em><code>'}</code></td>\n</tr></tbody></table>\n<p>For timestamp literal escape clauses, the decimal point and fractional digits may be omitted, or 1 to 6 fractional digits <em>f</em> may be specified after a decimal point.</p>\n<h4>Scalar Functions</h4>\n<p>Scalar function escape clauses are replaced by the corresponding SQL expression before the SQL request text is transmitted to the database.</p>\n<table>\n<thead>\n<tr>\n<th>Numeric Function</th>\n<th>Returns</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>{fn ABS(</code><em>number</em><code>)}</code></td>\n<td>Absolute value of <em>number</em></td>\n</tr>\n<tr>\n<td><code>{fn ACOS(</code><em>float</em><code>)}</code></td>\n<td>Arccosine, in radians, of <em>float</em></td>\n</tr>\n<tr>\n<td><code>{fn ASIN(</code><em>float</em><code>)}</code></td>\n<td>Arcsine, in radians, of <em>float</em></td>\n</tr>\n<tr>\n<td><code>{fn ATAN(</code><em>float</em><code>)}</code></td>\n<td>Arctangent, in radians, of <em>float</em></td>\n</tr>\n<tr>\n<td><code>{fn ATAN2(</code><em>y</em><code>,</code><em>x</em><code>)}</code></td>\n<td>Arctangent, in radians, of <em>y</em> / <em>x</em></td>\n</tr>\n<tr>\n<td><code>{fn CEILING(</code><em>number</em><code>)}</code></td>\n<td>Smallest integer greater than or equal to <em>number</em></td>\n</tr>\n<tr>\n<td><code>{fn COS(</code><em>float</em><code>)}</code></td>\n<td>Cosine of <em>float</em> radians</td>\n</tr>\n<tr>\n<td><code>{fn COT(</code><em>float</em><code>)}</code></td>\n<td>Cotangent of <em>float</em> radians</td>\n</tr>\n<tr>\n<td><code>{fn DEGREES(</code><em>number</em><code>)}</code></td>\n<td>Degrees in <em>number</em> radians</td>\n</tr>\n<tr>\n<td><code>{fn EXP(</code><em>float</em><code>)}</code></td>\n<td><em>e</em> raised to the power of <em>float</em></td>\n</tr>\n<tr>\n<td><code>{fn FLOOR(</code><em>number</em><code>)}</code></td>\n<td>Largest integer less than or equal to <em>number</em></td>\n</tr>\n<tr>\n<td><code>{fn LOG(</code><em>float</em><code>)}</code></td>\n<td>Natural (base <em>e</em>) logarithm of <em>float</em></td>\n</tr>\n<tr>\n<td><code>{fn LOG10(</code><em>float</em><code>)}</code></td>\n<td>Base 10 logarithm of <em>float</em></td>\n</tr>\n<tr>\n<td><code>{fn MOD(</code><em>integer1</em><code>,</code><em>integer2</em><code>)}</code></td>\n<td>Remainder for <em>integer1</em> / <em>integer2</em></td>\n</tr>\n<tr>\n<td><code>{fn PI()}</code></td>\n<td>The constant pi, approximately equal to 3.14159...</td>\n</tr>\n<tr>\n<td><code>{fn POWER(</code><em>number</em><code>,</code><em>integer</em><code>)}</code></td>\n<td><em>number</em> raised to <em>integer</em> power</td>\n</tr>\n<tr>\n<td><code>{fn RADIANS(</code><em>number</em><code>)}</code></td>\n<td>Radians in <em>number</em> degrees</td>\n</tr>\n<tr>\n<td><code>{fn RAND(</code><em>seed</em><code>)}</code></td>\n<td>A random float value such that 0 ≤ value &lt; 1, and <em>seed</em> is ignored</td>\n</tr>\n<tr>\n<td><code>{fn ROUND(</code><em>number</em><code>,</code><em>places</em><code>)}</code></td>\n<td><em>number</em> rounded to <em>places</em></td>\n</tr>\n<tr>\n<td><code>{fn SIGN(</code><em>number</em><code>)}</code></td>\n<td>-1 if <em>number</em> is negative; 0 if <em>number</em> is 0; 1 if <em>number</em> is positive</td>\n</tr>\n<tr>\n<td><code>{fn SIN(</code><em>float</em><code>)}</code></td>\n<td>Sine of <em>float</em> radians</td>\n</tr>\n<tr>\n<td><code>{fn SQRT(</code><em>float</em><code>)}</code></td>\n<td>Square root of <em>float</em></td>\n</tr>\n<tr>\n<td><code>{fn TAN(</code><em>float</em><code>)}</code></td>\n<td>Tangent of <em>float</em> radians</td>\n</tr>\n<tr>\n<td><code>{fn TRUNCATE(</code><em>number</em><code>,</code><em>places</em><code>)}</code></td>\n<td><em>number</em> truncated to <em>places</em></td>\n</tr></tbody></table>\n<table>\n<thead>\n<tr>\n<th>String Function</th>\n<th>Returns</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>{fn ASCII(</code><em>string</em><code>)}</code></td>\n<td>ASCII code of the first character in <em>string</em></td>\n</tr>\n<tr>\n<td><code>{fn CHAR(</code><em>code</em><code>)}</code></td>\n<td>Character with ASCII <em>code</em></td>\n</tr>\n<tr>\n<td><code>{fn CHAR_LENGTH(</code><em>string</em><code>)}</code></td>\n<td>Length in characters of <em>string</em></td>\n</tr>\n<tr>\n<td><code>{fn CHARACTER_LENGTH(</code><em>string</em><code>)}</code></td>\n<td>Length in characters of <em>string</em></td>\n</tr>\n<tr>\n<td><code>{fn CONCAT(</code><em>string1</em><code>,</code><em>string2</em><code>)}</code></td>\n<td>String formed by concatenating <em>string1</em> and <em>string2</em></td>\n</tr>\n<tr>\n<td><code>{fn DIFFERENCE(</code><em>string1</em><code>,</code><em>string2</em><code>)}</code></td>\n<td>A number from 0 to 4 that indicates the phonetic similarity of <em>string1</em> and <em>string2</em> based on their Soundex codes, such that a larger return value indicates greater phonetic similarity; 0 indicates no similarity, 4 indicates strong similarity</td>\n</tr>\n<tr>\n<td><code>{fn INSERT(</code><em>string1</em><code>,</code><em>position</em><code>,</code><em>length</em><code>,</code><em>string2</em><code>)}</code></td>\n<td>String formed by replacing the <em>length</em>-character segment of <em>string1</em> at <em>position</em> with <em>string2</em>, available beginning with Teradata Database 15.0</td>\n</tr>\n<tr>\n<td><code>{fn LCASE(</code><em>string</em><code>)}</code></td>\n<td>String formed by replacing all uppercase characters in <em>string</em> with their lowercase equivalents</td>\n</tr>\n<tr>\n<td><code>{fn LEFT(</code><em>string</em><code>,</code><em>count</em><code>)}</code></td>\n<td>Leftmost <em>count</em> characters of <em>string</em></td>\n</tr>\n<tr>\n<td><code>{fn LENGTH(</code><em>string</em><code>)}</code></td>\n<td>Length in characters of <em>string</em></td>\n</tr>\n<tr>\n<td><code>{fn LOCATE(</code><em>string1</em><code>,</code><em>string2</em><code>)}</code></td>\n<td>Position in <em>string2</em> of the first occurrence of <em>string1</em>, or 0 if <em>string2</em> does not contain <em>string1</em></td>\n</tr>\n<tr>\n<td><code>{fn LTRIM(</code><em>string</em><code>)}</code></td>\n<td>String formed by removing leading spaces from <em>string</em></td>\n</tr>\n<tr>\n<td><code>{fn OCTET_LENGTH(</code><em>string</em><code>)}</code></td>\n<td>Length in octets (bytes) of <em>string</em></td>\n</tr>\n<tr>\n<td><code>{fn POSITION(</code><em>string1</em><code>IN</code><em>string2</em><code>)}</code></td>\n<td>Position in <em>string2</em> of the first occurrence of <em>string1</em>, or 0 if <em>string2</em> does not contain <em>string1</em></td>\n</tr>\n<tr>\n<td><code>{fn REPEAT(</code><em>string</em><code>,</code><em>count</em><code>)}</code></td>\n<td>String formed by repeating <em>string</em> <em>count</em> times, available beginning with Teradata Database 15.0</td>\n</tr>\n<tr>\n<td><code>{fn REPLACE(</code><em>string1</em><code>,</code><em>string2</em><code>,</code><em>string3</em><code>)}</code></td>\n<td>String formed by replacing all occurrences of <em>string2</em> in <em>string1</em> with <em>string3</em></td>\n</tr>\n<tr>\n<td><code>{fn RIGHT(</code><em>string</em><code>,</code><em>count</em><code>)}</code></td>\n<td>Rightmost <em>count</em> characters of <em>string</em>, available beginning with Teradata Database 15.0</td>\n</tr>\n<tr>\n<td><code>{fn RTRIM(</code><em>string</em><code>)}</code></td>\n<td>String formed by removing trailing spaces from <em>string</em></td>\n</tr>\n<tr>\n<td><code>{fn SOUNDEX(</code><em>string</em><code>)}</code></td>\n<td>Soundex code for <em>string</em></td>\n</tr>\n<tr>\n<td><code>{fn SPACE(</code><em>count</em><code>)}</code></td>\n<td>String consisting of <em>count</em> spaces</td>\n</tr>\n<tr>\n<td><code>{fn SUBSTRING(</code><em>string</em><code>,</code><em>position</em><code>,</code><em>length</em><code>)}</code></td>\n<td>The <em>length</em>-character segment of <em>string</em> at <em>position</em></td>\n</tr>\n<tr>\n<td><code>{fn UCASE(</code><em>string</em><code>)}</code></td>\n<td>String formed by replacing all lowercase characters in <em>string</em> with their uppercase equivalents</td>\n</tr></tbody></table>\n<table>\n<thead>\n<tr>\n<th>System Function</th>\n<th>Returns</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>{fn DATABASE()}</code></td>\n<td>Current default database name</td>\n</tr>\n<tr>\n<td><code>{fn IFNULL(</code><em>expression</em><code>,</code><em>value</em><code>)}</code></td>\n<td><em>expression</em> if <em>expression</em> is not NULL, or <em>value</em> if <em>expression</em> is NULL</td>\n</tr>\n<tr>\n<td><code>{fn USER()}</code></td>\n<td>Logon user name, which may differ from the current authorized user name after <code>SET QUERY_BAND</code> sets a proxy user</td>\n</tr></tbody></table>\n<table>\n<thead>\n<tr>\n<th>Time/Date Function</th>\n<th>Returns</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>{fn CURDATE()}</code></td>\n<td>Current date</td>\n</tr>\n<tr>\n<td><code>{fn CURRENT_DATE()}</code></td>\n<td>Current date</td>\n</tr>\n<tr>\n<td><code>{fn CURRENT_TIME()}</code></td>\n<td>Current time</td>\n</tr>\n<tr>\n<td><code>{fn CURRENT_TIMESTAMP()}</code></td>\n<td>Current date and time</td>\n</tr>\n<tr>\n<td><code>{fn CURTIME()}</code></td>\n<td>Current time</td>\n</tr>\n<tr>\n<td><code>{fn DAYOFMONTH(</code><em>date</em><code>)}</code></td>\n<td>Integer from 1 to 31 indicating the day of month in <em>date</em></td>\n</tr>\n<tr>\n<td><code>{fn EXTRACT(YEAR FROM</code><em>value</em><code>)}</code></td>\n<td>The year component of the date and/or time <em>value</em></td>\n</tr>\n<tr>\n<td><code>{fn EXTRACT(MONTH FROM</code><em>value</em><code>)}</code></td>\n<td>The month component of the date and/or time <em>value</em></td>\n</tr>\n<tr>\n<td><code>{fn EXTRACT(DAY FROM</code><em>value</em><code>)}</code></td>\n<td>The day component of the date and/or time <em>value</em></td>\n</tr>\n<tr>\n<td><code>{fn EXTRACT(HOUR FROM</code><em>value</em><code>)}</code></td>\n<td>The hour component of the date and/or time <em>value</em></td>\n</tr>\n<tr>\n<td><code>{fn EXTRACT(MINUTE FROM</code><em>value</em><code>)}</code></td>\n<td>The minute component of the date and/or time <em>value</em></td>\n</tr>\n<tr>\n<td><code>{fn EXTRACT(SECOND FROM</code><em>value</em><code>)}</code></td>\n<td>The second component of the date and/or time <em>value</em></td>\n</tr>\n<tr>\n<td><code>{fn HOUR(</code><em>time</em><code>)}</code></td>\n<td>Integer from 0 to 23 indicating the hour of <em>time</em></td>\n</tr>\n<tr>\n<td><code>{fn MINUTE(</code><em>time</em><code>)}</code></td>\n<td>Integer from 0 to 59 indicating the minute of <em>time</em></td>\n</tr>\n<tr>\n<td><code>{fn MONTH(</code><em>date</em><code>)}</code></td>\n<td>Integer from 1 to 12 indicating the month of <em>date</em></td>\n</tr>\n<tr>\n<td><code>{fn NOW()}</code></td>\n<td>Current date and time</td>\n</tr>\n<tr>\n<td><code>{fn SECOND(</code><em>time</em><code>)}</code></td>\n<td>Integer from 0 to 59 indicating the second of <em>time</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPADD(SQL_TSI_YEAR,</code><em>count</em><code>,</code><em>timestamp</em><code>)}</code></td>\n<td>Timestamp formed by adding <em>count</em> years to <em>timestamp</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPADD(SQL_TSI_MONTH,</code><em>count</em><code>,</code><em>timestamp</em><code>)}</code></td>\n<td>Timestamp formed by adding <em>count</em> months to <em>timestamp</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPADD(SQL_TSI_DAY,</code><em>count</em><code>,</code><em>timestamp</em><code>)}</code></td>\n<td>Timestamp formed by adding <em>count</em> days to <em>timestamp</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPADD(SQL_TSI_HOUR,</code><em>count</em><code>,</code><em>timestamp</em><code>)}</code></td>\n<td>Timestamp formed by adding <em>count</em> hours to <em>timestamp</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPADD(SQL_TSI_MINUTE,</code><em>count</em><code>,</code><em>timestamp</em><code>)}</code></td>\n<td>Timestamp formed by adding <em>count</em> minutes to <em>timestamp</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPADD(SQL_TSI_SECOND,</code><em>count</em><code>,</code><em>timestamp</em><code>)}</code></td>\n<td>Timestamp formed by adding <em>count</em> seconds to <em>timestamp</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPDIFF(SQL_TSI_YEAR,</code><em>timestamp1</em><code>,</code><em>timestamp2</em><code>)}</code></td>\n<td>Number of years by which <em>timestamp2</em> exceeds <em>timestamp1</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPDIFF(SQL_TSI_MONTH,</code><em>timestamp1</em><code>,</code><em>timestamp2</em><code>)}</code></td>\n<td>Number of months by which <em>timestamp2</em> exceeds <em>timestamp1</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPDIFF(SQL_TSI_DAY,</code><em>timestamp1</em><code>,</code><em>timestamp2</em><code>)}</code></td>\n<td>Number of days by which <em>timestamp2</em> exceeds <em>timestamp1</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPDIFF(SQL_TSI_HOUR,</code><em>timestamp1</em><code>,</code><em>timestamp2</em><code>)}</code></td>\n<td>Number of hours by which <em>timestamp2</em> exceeds <em>timestamp1</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPDIFF(SQL_TSI_MINUTE,</code><em>timestamp1</em><code>,</code><em>timestamp2</em><code>)}</code></td>\n<td>Number of minutes by which <em>timestamp2</em> exceeds <em>timestamp1</em></td>\n</tr>\n<tr>\n<td><code>{fn TIMESTAMPDIFF(SQL_TSI_SECOND,</code><em>timestamp1</em><code>,</code><em>timestamp2</em><code>)}</code></td>\n<td>Number of seconds by which <em>timestamp2</em> exceeds <em>timestamp1</em></td>\n</tr>\n<tr>\n<td><code>{fn YEAR(</code><em>date</em><code>)}</code></td>\n<td>The year of <em>date</em></td>\n</tr></tbody></table>\n<h4>Conversion Functions</h4>\n<p>Conversion function escape clauses are replaced by the corresponding SQL expression before the SQL request text is transmitted to the database.</p>\n<table>\n<thead>\n<tr>\n<th>Conversion Function</th>\n<th>Returns</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_BIGINT)}</code></td>\n<td><em>value</em> converted to SQL <code>BIGINT</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_BINARY(</code><em>size</em><code>))}</code></td>\n<td><em>value</em> converted to SQL <code>BYTE(</code><em>size</em><code>)</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_CHAR(</code><em>size</em><code>))}</code></td>\n<td><em>value</em> converted to SQL <code>CHAR(</code><em>size</em><code>)</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_DATE)}</code></td>\n<td><em>value</em> converted to SQL <code>DATE</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_DECIMAL(</code><em>precision</em><code>,</code><em>scale</em><code>))}</code></td>\n<td><em>value</em> converted to SQL <code>DECIMAL(</code><em>precision</em><code>,</code><em>scale</em><code>)</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_DOUBLE)}</code></td>\n<td><em>value</em> converted to SQL <code>DOUBLE PRECISION</code>, a synonym for <code>FLOAT</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_FLOAT)}</code></td>\n<td><em>value</em> converted to SQL <code>FLOAT</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_INTEGER)}</code></td>\n<td><em>value</em> converted to SQL <code>INTEGER</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_LONGVARBINARY)}</code></td>\n<td><em>value</em> converted to SQL <code>VARBYTE(64000)</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_LONGVARCHAR)}</code></td>\n<td><em>value</em> converted to SQL <code>LONG VARCHAR</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_NUMERIC)}</code></td>\n<td><em>value</em> converted to SQL <code>NUMBER</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_SMALLINT)}</code></td>\n<td><em>value</em> converted to SQL <code>SMALLINT</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_TIME(</code><em>scale</em><code>))}</code></td>\n<td><em>value</em> converted to SQL <code>TIME(</code><em>scale</em><code>)</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_TIMESTAMP(</code><em>scale</em><code>))}</code></td>\n<td><em>value</em> converted to SQL <code>TIMESTAMP(</code><em>scale</em><code>)</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_TINYINT)}</code></td>\n<td><em>value</em> converted to SQL <code>BYTEINT</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_VARBINARY(</code><em>size</em><code>))}</code></td>\n<td><em>value</em> converted to SQL <code>VARBYTE(</code><em>size</em><code>)</code></td>\n</tr>\n<tr>\n<td><code>{fn CONVERT(</code><em>value</em><code>, SQL_VARCHAR(</code><em>size</em><code>))}</code></td>\n<td><em>value</em> converted to SQL <code>VARCHAR(</code><em>size</em><code>)</code></td>\n</tr></tbody></table>\n<h4>LIKE Predicate Escape Character</h4>\n<p>Within a <code>LIKE</code> predicate's <em>pattern</em> argument, the characters <code>%</code> (percent) and <code>_</code> (underscore) serve as wildcards.\nTo interpret a particular wildcard character literally in a <code>LIKE</code> predicate's <em>pattern</em> argument, the wildcard character must be preceded by an escape character, and the escape character must be indicated in the <code>LIKE</code> predicate's <code>ESCAPE</code> clause.</p>\n<p><code>LIKE</code> predicate escape character escape clauses are replaced by the corresponding SQL clause before the SQL request text is transmitted to the database.</p>\n<p><code>{escape '</code><em>EscapeCharacter</em><code>'}</code></p>\n<p>The escape clause must be specified immediately after the <code>LIKE</code> predicate that it applies to.</p>\n<h4>Outer Joins</h4>\n<p>Outer join escape clauses are replaced by the corresponding SQL clause before the SQL request text is transmitted to the database.</p>\n<p><code>{oj</code><em>TableName</em><code></code><em>OptionalCorrelationName</em><code>LEFT OUTER JOIN</code><em>TableName</em><code></code><em>OptionalCorrelationName</em><code>ON</code><em>JoinCondition</em><code>}</code></p>\n<p><code>{oj</code><em>TableName</em><code></code><em>OptionalCorrelationName</em><code>RIGHT OUTER JOIN</code><em>TableName</em><code></code><em>OptionalCorrelationName</em><code>ON</code><em>JoinCondition</em><code>}</code></p>\n<p><code>{oj</code><em>TableName</em><code></code><em>OptionalCorrelationName</em><code>FULL OUTER JOIN</code><em>TableName</em><code></code><em>OptionalCorrelationName</em><code>ON</code><em>JoinCondition</em><code>}</code></p>\n<h4>Stored Procedure Calls</h4>\n<p>Stored procedure call escape clauses are replaced by the corresponding SQL clause before the SQL request text is transmitted to the database.</p>\n<p><code>{call</code><em>ProcedureName</em><code>}</code></p>\n<p><code>{call</code><em>ProcedureName</em><code>(</code><em>CommaSeparatedParameterValues...</em><code>)}</code></p>\n<h4>Native SQL</h4>\n<p>When a SQL request contains the native SQL escape clause, all escape clauses are replaced in the SQL request text, and the modified SQL request text is returned to the application as a result set containing a single row and a single VARCHAR column. The SQL request text is not transmitted to the database, and the SQL request is not executed. The native SQL escape clause mimics the functionality of the JDBC API <code>Connection.nativeSQL</code> method.</p>\n<p><code>{fn teradata_nativesql}</code></p>\n<h4>Connection Functions</h4>\n<p>The following table lists connection function escape clauses that are intended for use with the native SQL escape clause <code>{fn teradata_nativesql}</code>.</p>\n<p>These functions provide information about the connection, or control the behavior of the connection.\nFunctions that provide information return locally-cached information and avoid a round-trip to the database.\nConnection function escape clauses are replaced by the returned information before the SQL request text is transmitted to the database.</p>\n<table>\n<thead>\n<tr>\n<th>Connection Function</th>\n<th>Returns</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>{fn teradata_amp_count}</code></td>\n<td>Number of AMPs of the Teradata Database system</td>\n</tr>\n<tr>\n<td><code>{fn teradata_database_version}</code></td>\n<td>Version number of the Teradata Database</td>\n</tr>\n<tr>\n<td><code>{fn teradata_driver_version}</code></td>\n<td>Version number of the Teradata SQL Driver for Python</td>\n</tr>\n<tr>\n<td><code>{fn teradata_getloglevel}</code></td>\n<td>Current log level</td>\n</tr>\n<tr>\n<td><code>{fn teradata_logon_sequence_number}</code></td>\n<td>Session's Logon Sequence Number, if available</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(config_response)}</code></td>\n<td>Config Response parcel contents in JSON format</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(connection_id)}</code></td>\n<td>Connection's unique identifier within the process</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(default_connection)}</code></td>\n<td><code>false</code> indicating this is not a stored procedure default connection</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(host_id)}</code></td>\n<td>Session's host ID</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(java_charset_name)}</code></td>\n<td><code>UTF8</code></td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(lob_support)}</code></td>\n<td><code>true</code> or <code>false</code> indicating this connection's LOB support</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(local_address)}</code></td>\n<td>Local address of the connection's TCP socket</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(local_port)}</code></td>\n<td>Local port of the connection's TCP socket</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(original_hostname)}</code></td>\n<td>Original specified Teradata Database hostname</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(redrive_active)}</code></td>\n<td><code>true</code> or <code>false</code> indicating whether this connection has Redrive active</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(remote_address)}</code></td>\n<td>Hostname (if available) and IP address of the connected Teradata Database node</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(remote_port)}</code></td>\n<td>TCP port number of the Teradata Database</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(rnp_active)}</code></td>\n<td><code>true</code> or <code>false</code> indicating whether this connection has Recoverable Network Protocol active</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(session_charset_code)}</code></td>\n<td>Session character set code <code>191</code></td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(session_charset_name)}</code></td>\n<td>Session character set name <code>UTF8</code></td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(sip_support)}</code></td>\n<td><code>true</code> or <code>false</code> indicating this connection's StatementInfo parcel support</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(transaction_mode)}</code></td>\n<td>Session's transaction mode, <code>ANSI</code> or <code>TERA</code></td>\n</tr>\n<tr>\n<td><code>{fn teradata_session_number}</code></td>\n<td>Session number</td>\n</tr>\n<tr>\n<td><code>{fn teradata_setloglevel(</code><em>LogLevel</em><code>)}</code></td>\n<td>Empty string, and changes the connection's <em>LogLevel</em></td>\n</tr></tbody></table>\n<h4>Request-Scope Functions</h4>\n<p>The following table lists request-scope function escape clauses that are intended for use with the Cursor <code>.execute</code> or <code>.executemany</code> methods.</p>\n<p>These functions control the behavior of the corresponding Cursor, and are limited in scope to the particular SQL request in which they are specified.\nRequest-scope function escape clauses are removed before the SQL request text is transmitted to the database.</p>\n<table>\n<thead>\n<tr>\n<th>Request-Scope Function</th>\n<th>Effect</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><code>{fn teradata_failfast}</code></td>\n<td>Reject (\"fail fast\") this SQL request rather than delay by a workload management rule or throttle</td>\n</tr>\n<tr>\n<td><code>{fn teradata_fake_result_sets}</code></td>\n<td>A fake result set containing statement metadata precedes each real result set</td>\n</tr>\n<tr>\n<td><code>{fn teradata_lobselect(</code><em>Option</em><code>)}</code></td>\n<td>Executes the SQL request with LOB select <em>Option</em> <code>S</code> (spool-scoped LOB locators), <code>T</code> (transaction-scoped LOB locators), or the default <code>I</code> (inline materialized LOB values)</td>\n</tr>\n<tr>\n<td><code>{fn teradata_parameter(</code><em>Index</em><code>,</code><em>DataType</em><code>)</code></td>\n<td>Transmits parameter <em>Index</em> bind values as <em>DataType</em></td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(request_scope_lob_support_off)}</code></td>\n<td>Turns off LOB support for this SQL request</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(request_scope_refresh_rsmd)}</code></td>\n<td>Executes the SQL request with the default request processing option <code>B</code> (both)</td>\n</tr>\n<tr>\n<td><code>{fn teradata_provide(request_scope_sip_support_off)}</code></td>\n<td>Turns off StatementInfo parcel support for this SQL request</td>\n</tr>\n<tr>\n<td><code>{fn teradata_rpo(</code><em>RequestProcessingOption</em><code>)}</code></td>\n<td>Executes the SQL request with <em>RequestProcessingOption</em> <code>S</code> (prepare), <code>E</code> (execute), or the default <code>B</code> (both)</td>\n</tr>\n<tr>\n<td><code>{fn teradata_untrusted}</code></td>\n<td>Marks the SQL request as untrusted; not implemented yet</td>\n</tr></tbody></table>\n<p><a></a></p>\n<h3>FastLoad</h3>\n<p>The Teradata SQL Driver for Python now offers FastLoad.</p>\n<p>Please be aware that this is just the initial release of the FastLoad feature. Think of it as a beta or preview version. It works, but does not yet offer all the features that JDBC FastLoad offers. FastLoad is still under active development, and we will continue to enhance it in subsequent builds.</p>\n<p>FastLoad has limitations and cannot be used in all cases as a substitute for SQL batch insert:</p>\n<ul>\n<li>FastLoad can only load into an empty permanent table.</li>\n<li>FastLoad cannot load additional rows into a table that already contains rows.</li>\n<li>FastLoad cannot load into a volatile table or global temporary table.</li>\n<li>FastLoad cannot load duplicate rows into a <code>MULTISET</code> table.</li>\n<li>Do not use FastLoad to load only a few rows, because FastLoad opens extra connections to the database, which is time consuming.</li>\n<li>Only use FastLoad to load many rows (at least 100,000 rows) so that the row-loading performance gain exceeds the overhead of opening additional connections.</li>\n<li>FastLoad does not support all Teradata Database data types. For example, <code>BLOB</code> and <code>CLOB</code> are not supported.</li>\n<li>FastLoad requires StatementInfo parcel support to be enabled.</li>\n<li>FastLoad locks the destination table.</li>\n<li>If Online Archive encounters a table being loaded with FastLoad, online archiving of that table will be bypassed.</li>\n</ul>\n<p>Your application can bind a single row of data for FastLoad, but that is not recommended because the overhead of opening additional connections causes FastLoad to be slower than a regular SQL <code>INSERT</code> for a single row.</p>\n<p>How to use FastLoad:</p>\n<ul>\n<li>Auto-commit should be turned off before beginning a FastLoad.</li>\n<li>FastLoad is intended for binding many rows at a time. Each batch of rows must be able to fit into memory.</li>\n<li>When auto-commit is turned off, your application can insert multiple batches in a loop for the same FastLoad.</li>\n<li>Each column's data type must be consistent across every row in every batch over the entire FastLoad.</li>\n<li>The column values of the first row of the first batch dictate what the column data types must be in all subsequent rows and all subsequent batches of the FastLoad.</li>\n</ul>\n<p>FastLoad opens multiple data transfer connections to the database. FastLoad evenly distributes each batch of rows across the available data transfer connections, and uses overlapped I/O to send and receive messages in parallel.</p>\n<p>To use FastLoad, your application must prepend one of the following escape functions to the <code>INSERT</code> statement:</p>\n<ul>\n<li><code>{fn teradata_try_fastload}</code> tries to use FastLoad for the <code>INSERT</code> statement, and automatically executes the <code>INSERT</code> as a regular SQL statement when the <code>INSERT</code> is not compatible with FastLoad.</li>\n<li><code>{fn teradata_require_fastload}</code> requires FastLoad for the <code>INSERT</code> statement, and fails with an error when the <code>INSERT</code> is not compatible with FastLoad.</li>\n</ul>\n<p>Your application can prepend other optional escape functions to the <code>INSERT</code> statement:</p>\n<ul>\n<li><code>{fn teradata_sessions(</code>n<code>)}</code> specifies the number of data transfer connections to be opened, and is capped at the number of AMPs. The default is the smaller of 8 or the number of AMPs. <code>CHECK WORKLOAD</code> is not yet used, meaning that the driver does not ask the database how many data transfer connections should be used.</li>\n<li><code>{fn teradata_error_table_1_suffix(</code>suffix<code>)}</code> specifies what suffix to append to the name of FastLoad error table 1. The default suffix is <code>_ERR_1</code>.</li>\n<li><code>{fn teradata_error_table_2_suffix(</code>suffix<code>)}</code> specifies what suffix to append to the name of FastLoad error table 2. The default suffix is <code>_ERR_2</code>.</li>\n<li><code>{fn teradata_error_table_database(</code>dbname<code>)}</code> specifies the parent database name for FastLoad error tables 1 and 2. By default, the FastLoad error tables reside in the same database as the destination table.</li>\n</ul>\n<p>After beginning a FastLoad, your application can obtain the Logon Sequence Number (LSN) assigned to the FastLoad by prepending the following escape functions to the <code>INSERT</code> statement:</p>\n<ul>\n<li><code>{fn teradata_nativesql}{fn teradata_logon_sequence_number}</code> returns the string form of an integer representing the Logon Sequence Number (LSN) for the FastLoad. Returns an empty string if the request is not a FastLoad.</li>\n</ul>\n<p>FastLoad does not stop for data errors such as constraint violations or unique primary index violations. After inserting each batch of rows, your application must obtain warning and error information by prepending the following escape functions to the <code>INSERT</code> statement:</p>\n<ul>\n<li><code>{fn teradata_nativesql}{fn teradata_get_warnings}</code> returns in one string all warnings generated by FastLoad for the request.</li>\n<li><code>{fn teradata_nativesql}{fn teradata_get_errors}</code> returns in one string all data errors observed by FastLoad for the most recent batch. The data errors are obtained from FastLoad error table 1, for problems such as constraint violations, data type conversion errors, and unavailable AMP conditions.</li>\n</ul>\n<p>Your application ends FastLoad by committing or rolling back the current transaction. After commit or rollback, your application must obtain warning and error information by prepending the following escape functions to the <code>INSERT</code> statement:</p>\n<ul>\n<li><code>{fn teradata_nativesql}{fn teradata_get_warnings}</code> returns in one string all warnings generated by FastLoad for the commit or rollback. The warnings are obtained from FastLoad error table 2, for problems such as duplicate rows.</li>\n<li><code>{fn teradata_nativesql}{fn teradata_get_errors}</code> returns in one string all data errors observed by FastLoad for the commit or rollback. The data errors are obtained from FastLoad error table 2, for problems such as unique primary index violations.</li>\n</ul>\n<p>Warning and error information remains available until the next batch is inserted or until the commit or rollback. Each batch execution clears the prior warnings and errors. Each commit or rollback clears the prior warnings and errors.</p>\n<p><a></a></p>\n<h3>Change Log</h3>\n<p><code>16.20.0.61</code> - Apr 30, 2020</p>\n<ul>\n<li>GOSQL-57 Deferred LOB values larger than 1MB</li>\n</ul>\n<p><code>16.20.0.60</code> - Mar 27, 2020</p>\n<ul>\n<li>GOSQL-22 enable insert of large LOB values over 64KB</li>\n<li>GOSQL-52 teradata_try_fastload consider bind value data types</li>\n<li>GOSQL-54 enforce Decimal value maximum precision 38</li>\n<li>PYDBAPI-37 Teradata Data Types Support up to 14.10 including LOB data</li>\n</ul>\n<p><code>16.20.0.59</code> - Jan 8, 2020</p>\n<ul>\n<li>GOSQL-51 FastLoad fails when table is dropped and recreated</li>\n<li>PYDBAPI-72 bind value performance improvement</li>\n<li>PYDBAPI-73 DBAPI fails to insert 16383 rows</li>\n</ul>\n<p><code>16.20.0.58</code> - Dec 11, 2019</p>\n<ul>\n<li>PYDBAPI-71 execute and executemany ignoreErrors parameter</li>\n</ul>\n<p><code>16.20.0.57</code> - Dec 10, 2019</p>\n<ul>\n<li>GOSQL-50 provide FastLoad duplicate row errors with auto-commit on</li>\n</ul>\n<p><code>16.20.0.56</code> - Dec 4, 2019</p>\n<ul>\n<li>PYDBAPI-70 raise error for closed cursor usage</li>\n</ul>\n<p><code>16.20.0.55</code> - Nov 26, 2019</p>\n<ul>\n<li>GOSQL-15 add database connection parameter</li>\n<li>PYDBAPI-66 Better exception when running on 32-bit Python</li>\n</ul>\n<p><code>16.20.0.54</code> - Nov 21, 2019</p>\n<ul>\n<li>GOSQL-49 FastLoad support for additional connection parameters</li>\n</ul>\n<p><code>16.20.0.53</code> - Nov 15, 2019</p>\n<ul>\n<li>GOSQL-36 segment and iterate parameter batches per batch row limit</li>\n<li>GOSQL-43 segment and iterate parameter batches per request message size limit for FastLoad</li>\n</ul>\n<p><code>16.20.0.52</code> - Oct 18, 2019</p>\n<ul>\n<li>Sample programs for fake result sets</li>\n</ul>\n<p><code>16.20.0.51</code> - Oct 16, 2019</p>\n<ul>\n<li>GOSQL-46 LDAP password special characters</li>\n</ul>\n<p><code>16.20.0.50</code> - Oct 7, 2019</p>\n<ul>\n<li>PYDBAPI-68 improve performance for batch bind values</li>\n</ul>\n<p><code>16.20.0.49</code> - Oct 3, 2019</p>\n<ul>\n<li>GOSQL-45 FastLoad interop with Stored Password Protection</li>\n</ul>\n<p><code>16.20.0.48</code> - Sep 6, 2019</p>\n<ul>\n<li>GOSQL-14 add support for FastLoad protocol</li>\n<li>GOSQL-34 negative scale for Number values</li>\n<li>PYDBAPI-29 Data Transfer - FastLoad Protocol</li>\n</ul>\n<p><code>16.20.0.47</code> - Aug 27, 2019</p>\n<ul>\n<li>GOSQL-40 Skip executing empty SQL request text</li>\n<li>PYDBAPI-67 teradatasql.connect JSON connection string optional</li>\n</ul>\n<p><code>16.20.0.46</code> - Aug 16, 2019</p>\n<ul>\n<li>GOSQL-39 COP Discovery interop with Kerberos</li>\n</ul>\n<p><code>16.20.0.45</code> - Aug 12, 2019</p>\n<ul>\n<li>GOSQL-38 timestamp prefix log messages</li>\n</ul>\n<p><code>16.20.0.44</code> - Aug 7, 2019</p>\n<ul>\n<li>GOSQL-4 Support COP discovery</li>\n<li>PYDBAPI-36 COP Discovery</li>\n</ul>\n<p><code>16.20.0.43</code> - Jul 29, 2019</p>\n<ul>\n<li>GOSQL-18 Auto-commit</li>\n<li>PYDBAPI-61 commit and rollback methods</li>\n</ul>\n<p><code>16.20.0.42</code> - Jun 7, 2019</p>\n<ul>\n<li>PYDBAPI-65 sample program <code>BatchInsert.py</code></li>\n</ul>\n<p><code>16.20.0.41</code> - Feb 14, 2019</p>\n<ul>\n<li>PYDBAPI-57 fetchmany may return \"rows are closed\" instead of empty result set</li>\n</ul>\n<p><code>16.20.0.40</code> - Feb 8, 2019</p>\n<ul>\n<li>GOSQL-11 JWT authentication method</li>\n<li>GOSQL-16 tmode connection parameter</li>\n<li>GOSQL-17 commit and rollback functions</li>\n</ul>\n<p><code>16.20.0.39</code> - Oct 26, 2018</p>\n<ul>\n<li>GOSQL-33 CALL to stored procedure INOUT and OUT parameter output values</li>\n</ul>\n<p><code>16.20.0.38</code> - Oct 25, 2018</p>\n<ul>\n<li>PYDBAPI-56 Stored Procedure Dynamic Result Sets</li>\n</ul>\n<p><code>16.20.0.37</code> - Oct 22, 2018</p>\n<ul>\n<li>Documentation change</li>\n</ul>\n<p><code>16.20.0.36</code> - Oct 22, 2018</p>\n<ul>\n<li>GOSQL-5 Create/Replace Procedure MultiTSR protocol</li>\n</ul>\n<p><code>16.20.0.35</code> - Oct 22, 2018</p>\n<ul>\n<li>GOSQL-10 Stored Password Protection</li>\n<li>PYDBAPI-28 Secure Password at rest</li>\n<li>PYDBAPI-47 Port sample program TJEncryptPassword to Python</li>\n</ul>\n<p><code>16.20.0.34</code> - Oct 15, 2018</p>\n<ul>\n<li>Fix for sample program <code>TJEncryptPassword.py</code></li>\n</ul>\n<p><code>16.20.0.33</code> - Oct 12, 2018</p>\n<ul>\n<li>Installation dependency pycryptodome</li>\n</ul>\n<p><code>16.20.0.32</code> - Sep 19, 2018</p>\n<ul>\n<li>Sample programs <code>LoadCSVFile.py</code> and <code>MetadataFromPrepare.py</code></li>\n<li>Escape function teradata_fake_result_sets</li>\n</ul>\n<p><code>16.20.0.31</code> - Sep 19, 2018</p>\n<ul>\n<li>Added function tracing</li>\n</ul>\n<p><code>16.20.0.30</code> - Sep 14, 2018</p>\n<ul>\n<li>PYDBAPI-12 Connectivity</li>\n<li>PYDBAPI-33 Pandas library Interoperability</li>\n<li>Moved samples directory</li>\n</ul>\n<p><code>16.20.0.29</code> - Sep 14, 2018</p>\n<ul>\n<li>Sample program <code>ElicitFile.py</code></li>\n</ul>\n<p><code>16.20.0.28</code> - Sep 13, 2018</p>\n<ul>\n<li>Documentation change</li>\n</ul>\n<p><code>16.20.0.27</code> - Sep 12, 2018</p>\n<ul>\n<li>Documentation change</li>\n</ul>\n<p><code>16.20.0.26</code> - Sep 11, 2018</p>\n<ul>\n<li>PYDBAPI-8 Documentation</li>\n<li>PYDBAPI-9 User Guide Content</li>\n</ul>\n<p><code>16.20.0.25</code> - Sep 10, 2018</p>\n<ul>\n<li>Documentation change</li>\n</ul>\n<p><code>16.20.0.24</code> - Sep 6, 2018</p>\n<ul>\n<li>PYDBAPI-54 Implement cursor rowcount attribute</li>\n<li>PYDBAPI-55 Improved support for Python data types</li>\n</ul>\n<p><code>16.20.0.23</code> - Aug 31, 2018</p>\n<ul>\n<li>KeepResponse only for LOB locators</li>\n</ul>\n<p><code>16.20.0.22</code> - Aug 30, 2018</p>\n<ul>\n<li>Fixed NUMBER values</li>\n</ul>\n<p><code>16.20.0.21</code> - Aug 29, 2018</p>\n<ul>\n<li>Close orphaned rows</li>\n</ul>\n<p><code>16.20.0.20</code> - Aug 28, 2018</p>\n<ul>\n<li>decimal and datetime values</li>\n</ul>\n<p><code>16.20.0.19</code> - Aug 22, 2018</p>\n<ul>\n<li>timedelta bind values</li>\n</ul>\n<p><code>16.20.0.18</code> - Aug 21, 2018</p>\n<ul>\n<li>datetime.datetime bind values</li>\n</ul>\n<p><code>16.20.0.17</code> - Aug 20, 2018</p>\n<ul>\n<li>Version number in errors</li>\n</ul>\n<p><code>16.20.0.16</code> - Aug 17, 2018</p>\n<ul>\n<li>SLES 11 SP1 compatibility</li>\n</ul>\n<p><code>16.20.0.15</code> - Aug 17, 2018</p>\n<ul>\n<li>Documentation change</li>\n</ul>\n<p><code>16.20.0.14</code> - Aug 10, 2018</p>\n<ul>\n<li>Documentation change</li>\n</ul>\n<p><code>16.20.0.13</code> - Aug 9, 2018</p>\n<ul>\n<li>Documentation change</li>\n</ul>\n<p><code>16.20.0.12</code> - Aug 9, 2018</p>\n<ul>\n<li>PYDBAPI-10 User Guide Delivery and Viewability</li>\n<li>PYDBAPI-11 Searchability</li>\n</ul>\n<p><code>16.20.0.11</code> - Aug 8, 2018</p>\n<ul>\n<li>Documentation change</li>\n</ul>\n<p><code>16.20.0.10</code> - Aug 8, 2018</p>\n<ul>\n<li>Documentation change</li>\n</ul>\n<p><code>16.20.0.9</code> - Aug 7, 2018</p>\n<ul>\n<li>Install documentation in teradatasql directory</li>\n</ul>\n<p><code>16.20.0.8</code> - Aug 7, 2018</p>\n<ul>\n<li>GOSQL-7 TDNEGO authentication method</li>\n<li>PYDBAPI-42 Teradata Logon mechanism - TDNEGO</li>\n</ul>\n<p><code>16.20.0.7</code> - Jul 30, 2018</p>\n<ul>\n<li>GOSQL-8 Support parameter marker batch insert</li>\n<li>PYDBAPI-45 Parameterized Batch Insertion using executeMany</li>\n</ul>\n<p><code>16.20.0.6</code> - Jul 25, 2018</p>\n<ul>\n<li>Thread safety for handle maps</li>\n</ul>\n<p><code>16.20.0.5</code> - Jul 25, 2018</p>\n<ul>\n<li>Removed atexit</li>\n</ul>\n<p><code>16.20.0.4</code> - Jul 23, 2018</p>\n<ul>\n<li>PYDBAPI-4 Provide Python Driver license file</li>\n</ul>\n<p><code>16.20.0.3</code> - Jul 19, 2018</p>\n<ul>\n<li>PYDBAPI-46 Accept subclasses of bytes, int, float, str as bind values</li>\n</ul>\n<p><code>16.20.0.2</code> - Jul 19, 2018</p>\n<ul>\n<li>Package attributes change</li>\n</ul>\n<p><code>16.20.0.1</code> - Jul 18, 2018</p>\n<ul>\n<li>Version number change</li>\n</ul>\n<p><code>16.20.0.0</code> - Jul 18, 2018</p>\n<ul>\n<li>GOSQL-1 Encrypted logon</li>\n<li>GOSQL-2 LDAP and Kerberos authentication</li>\n<li>GOSQL-3 Support for 1MB Rows</li>\n<li>GOSQL-6 Elicit File protocol</li>\n<li>PYDBAPI-1 Distribution</li>\n<li>PYDBAPI-5 cursor.execute method return cursor</li>\n<li>PYDBAPI-6 Install and Deployment</li>\n<li>PYDBAPI-7 pip install of python driver package</li>\n<li>PYDBAPI-13 Operating System Platforms</li>\n<li>PYDBAPI-14 Driver must be available for use by Windows OS Users</li>\n<li>PYDBAPI-15 Driver must be available for use by OSX (Mac) Users</li>\n<li>PYDBAPI-16 Driver must be available for use by Linux OS Users</li>\n<li>PYDBAPI-17 Python Language version</li>\n<li>PYDBAPI-18 Python language version 3.4</li>\n<li>PYDBAPI-19 Distribution</li>\n<li>PYDBAPI-23 Teradata Analytics Platform Interoperability/Support</li>\n<li>PYDBAPI-24 Works with Teradata Database 16.10, 16.20</li>\n<li>PYDBAPI-26 Teradata Logon mechanism - Kerberos</li>\n<li>PYDBAPI-32 Downloadable from pypi.org</li>\n<li>PYDBAPI-40 Teradata Logon mechanism - LDAP</li>\n<li>PYDBAPI-41 Teradata Logon mechanism - TD2</li>\n<li>PYDBAPI-43 parameterized single-row inserts</li>\n<li>PYDBAPI-44 parameterized queries</li>\n</ul>\n\n          </div>"}, "last_serial": 7138959, "releases": {"16.20.0.0": [{"comment_text": "", "digests": {"md5": "3d05c0e14b5830d5bb21f5298f93076e", "sha256": "aa8ee1f9f1a31a1133e439d68e3bb449b3379b3f5ccd615e7b03c34cb80ce477"}, "downloads": -1, "filename": "teradatasql-16.20.0.0-py3-none-any.whl", "has_sig": false, "md5_digest": "3d05c0e14b5830d5bb21f5298f93076e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12096792, "upload_time": "2018-07-18T20:50:29", "upload_time_iso_8601": "2018-07-18T20:50:29.913258Z", "url": "https://files.pythonhosted.org/packages/59/96/76a2b1e186619ad297d16f366378ec9cac43251ee12d4020f47504e15353/teradatasql-16.20.0.0-py3-none-any.whl", "yanked": false}], "16.20.0.1": [{"comment_text": "", "digests": {"md5": "9ea15c5e8c3c69820a1969f35a9f7b80", "sha256": "59d521a5da482bab61214cefec71de023a6b2ea578d215986a0e3619a3ec1d87"}, "downloads": -1, "filename": "teradatasql-16.20.0.1-py3-none-any.whl", "has_sig": false, "md5_digest": "9ea15c5e8c3c69820a1969f35a9f7b80", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12095646, "upload_time": "2018-07-18T23:52:22", "upload_time_iso_8601": "2018-07-18T23:52:22.985729Z", "url": "https://files.pythonhosted.org/packages/44/b9/db192e7f678bba5788991918b7b6273c8290ccf1a56d1e06bd14f6dbda38/teradatasql-16.20.0.1-py3-none-any.whl", "yanked": false}], "16.20.0.10": [{"comment_text": "", "digests": {"md5": "6859c5fefaa79eb82ff460a4a5b15bf1", "sha256": "a3c26dafc2f23069584cecebd65912cb86c89cf3f14554d1182364c6b0381412"}, "downloads": -1, "filename": "teradatasql-16.20.0.10-py3-none-any.whl", "has_sig": false, "md5_digest": "6859c5fefaa79eb82ff460a4a5b15bf1", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12284336, "upload_time": "2018-08-09T00:56:57", "upload_time_iso_8601": "2018-08-09T00:56:57.729675Z", "url": "https://files.pythonhosted.org/packages/a7/5a/3c61f6181e3d18abfd2f240321b851483f77015d608059128ffb62ba31d9/teradatasql-16.20.0.10-py3-none-any.whl", "yanked": false}], "16.20.0.11": [{"comment_text": "", "digests": {"md5": "b958c77054d1034996f2448cb959f156", "sha256": "67c8e1dd3b895264584bb7ca93fa63bb2c4de3f90debcdecf9ffafc271943d7b"}, "downloads": -1, "filename": "teradatasql-16.20.0.11-py3-none-any.whl", "has_sig": false, "md5_digest": "b958c77054d1034996f2448cb959f156", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12284428, "upload_time": "2018-08-09T01:13:37", "upload_time_iso_8601": "2018-08-09T01:13:37.633901Z", "url": "https://files.pythonhosted.org/packages/ba/bf/3f9a1d1b9a69b79d0d3fe0766637aa1761a7cce7a6a0879ae6e9a051b9bc/teradatasql-16.20.0.11-py3-none-any.whl", "yanked": false}], "16.20.0.12": [{"comment_text": "", "digests": {"md5": "6c6546620e26567ceeaa99381de084ab", "sha256": "1520f47fa971ed983b6109b45d0aecf804df711c64d4c3fc90c4eea92a85fd56"}, "downloads": -1, "filename": "teradatasql-16.20.0.12-py3-none-any.whl", "has_sig": false, "md5_digest": "6c6546620e26567ceeaa99381de084ab", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12284563, "upload_time": "2018-08-09T18:30:33", "upload_time_iso_8601": "2018-08-09T18:30:33.412751Z", "url": "https://files.pythonhosted.org/packages/b7/02/9654f2c0ff86e76c566727808f7dc0534f5dcf0f61ab76874dee348dc874/teradatasql-16.20.0.12-py3-none-any.whl", "yanked": false}], "16.20.0.13": [{"comment_text": "", "digests": {"md5": "82891ed690e40cdd76399bddd098d673", "sha256": "179e8dfe50884c6dc582089226cfb09fadf96825a46fb95413e59363bca9184f"}, "downloads": -1, "filename": "teradatasql-16.20.0.13-py3-none-any.whl", "has_sig": false, "md5_digest": "82891ed690e40cdd76399bddd098d673", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12284570, "upload_time": "2018-08-09T21:53:25", "upload_time_iso_8601": "2018-08-09T21:53:25.940862Z", "url": "https://files.pythonhosted.org/packages/f4/f8/e45a916ef4a331dca86c88a9328098ff07ec8b7b63b6f3b48d27734e270b/teradatasql-16.20.0.13-py3-none-any.whl", "yanked": false}], "16.20.0.14": [{"comment_text": "", "digests": {"md5": "85e0bc02b9eefb14ecc965ddd4ca68a2", "sha256": "07070b2b851388c6bb2b6d523ae5b0b2a1b5f47cb6bf28dbbf1c989114ad58da"}, "downloads": -1, "filename": "teradatasql-16.20.0.14-py3-none-any.whl", "has_sig": false, "md5_digest": "85e0bc02b9eefb14ecc965ddd4ca68a2", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12284572, "upload_time": "2018-08-10T18:14:33", "upload_time_iso_8601": "2018-08-10T18:14:33.964100Z", "url": "https://files.pythonhosted.org/packages/70/f8/a713fd615b135a1695d6bc365b64f3e62771e94c039e1e65cb01e291bac8/teradatasql-16.20.0.14-py3-none-any.whl", "yanked": false}], "16.20.0.15": [{"comment_text": "", "digests": {"md5": "530f2761bebc14b30a765a60f0b5e877", "sha256": "8e618869ebc79e0f498893cf7875290569191f23876386e8ed053c21268775d8"}, "downloads": -1, "filename": "teradatasql-16.20.0.15-py3-none-any.whl", "has_sig": false, "md5_digest": "530f2761bebc14b30a765a60f0b5e877", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12284578, "upload_time": "2018-08-17T19:42:50", "upload_time_iso_8601": "2018-08-17T19:42:50.207189Z", "url": "https://files.pythonhosted.org/packages/bd/0d/b14e37179c306068c5ff0344d5b66a5c09886924af1962f1c572594d1634/teradatasql-16.20.0.15-py3-none-any.whl", "yanked": false}], "16.20.0.16": [{"comment_text": "", "digests": {"md5": "18f46f4e7d601381d820aaed5cd380ab", "sha256": "4b5760035e087b8036d9b0c9c9c791cb4a07e0b206b07fb944c401f5a2a0b589"}, "downloads": -1, "filename": "teradatasql-16.20.0.16-py3-none-any.whl", "has_sig": false, "md5_digest": "18f46f4e7d601381d820aaed5cd380ab", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12281206, "upload_time": "2018-08-17T20:16:26", "upload_time_iso_8601": "2018-08-17T20:16:26.690229Z", "url": "https://files.pythonhosted.org/packages/bf/9d/652c538137e421fefefa76ce15560d8281d5c88bed1b9208c8bc4c1086a1/teradatasql-16.20.0.16-py3-none-any.whl", "yanked": false}], "16.20.0.17": [{"comment_text": "", "digests": {"md5": "f929992d8b69721b13d1de32a4620b17", "sha256": "a0a55d5ce9811e27fbe8f422cac4dcb02e8f513c70261546a6625fbce79174b6"}, "downloads": -1, "filename": "teradatasql-16.20.0.17-py3-none-any.whl", "has_sig": false, "md5_digest": "f929992d8b69721b13d1de32a4620b17", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12282107, "upload_time": "2018-08-20T23:15:36", "upload_time_iso_8601": "2018-08-20T23:15:36.525551Z", "url": "https://files.pythonhosted.org/packages/86/67/3ec9ac9b2a8d8adbc2a4f1fd5aa4e8264c297a2b9af6d5ffba68ec8f9d92/teradatasql-16.20.0.17-py3-none-any.whl", "yanked": false}], "16.20.0.18": [{"comment_text": "", "digests": {"md5": "3dffd4b8b1674ec2e81a67db0644b7fc", "sha256": "db814cffb075fe79473176e3cfb24dcb64a4fdbb3160d0d72753150065461a4a"}, "downloads": -1, "filename": "teradatasql-16.20.0.18-py3-none-any.whl", "has_sig": false, "md5_digest": "3dffd4b8b1674ec2e81a67db0644b7fc", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12282128, "upload_time": "2018-08-21T17:36:31", "upload_time_iso_8601": "2018-08-21T17:36:31.098976Z", "url": "https://files.pythonhosted.org/packages/e3/fb/8e2c5478f0dde45ec07cd0820e30c7b213ef60790e3ee285e421d4aa6b60/teradatasql-16.20.0.18-py3-none-any.whl", "yanked": false}], "16.20.0.19": [{"comment_text": "", "digests": {"md5": "1e5463676953a405b7a7f89f9be0b657", "sha256": "5f30eb66ea8282ad61f85616bd13c39274e0a204a5449af08e92c934f5158414"}, "downloads": -1, "filename": "teradatasql-16.20.0.19-py3-none-any.whl", "has_sig": false, "md5_digest": "1e5463676953a405b7a7f89f9be0b657", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12282392, "upload_time": "2018-08-22T17:08:36", "upload_time_iso_8601": "2018-08-22T17:08:36.899808Z", "url": "https://files.pythonhosted.org/packages/8c/f5/9c696e8b0c77b8d3be291a92e68d5a175b8035a3fd624b30680f7366151d/teradatasql-16.20.0.19-py3-none-any.whl", "yanked": false}], "16.20.0.2": [{"comment_text": "", "digests": {"md5": "d6c8be4173ee823011c0c79e91556eda", "sha256": "9cbdd9cf9ef69b926baa600c226f558ac7689e77a4c1b761d84b2c538a023eea"}, "downloads": -1, "filename": "teradatasql-16.20.0.2-py3-none-any.whl", "has_sig": false, "md5_digest": "d6c8be4173ee823011c0c79e91556eda", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12095640, "upload_time": "2018-07-19T16:25:38", "upload_time_iso_8601": "2018-07-19T16:25:38.004492Z", "url": "https://files.pythonhosted.org/packages/97/9e/23faaa05fa7d0c0286b48f9e11daccf6b05432c5a4eef517b69ff34a249b/teradatasql-16.20.0.2-py3-none-any.whl", "yanked": false}], "16.20.0.20": [{"comment_text": "", "digests": {"md5": "f26f6bd291d43fed2606cad881cdd898", "sha256": "5f6815db74092e3368ad515aca29dbdcd2637202b6a0917332ec69f523015cd2"}, "downloads": -1, "filename": "teradatasql-16.20.0.20-py3-none-any.whl", "has_sig": false, "md5_digest": "f26f6bd291d43fed2606cad881cdd898", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12318540, "upload_time": "2018-08-28T23:22:22", "upload_time_iso_8601": "2018-08-28T23:22:22.440811Z", "url": "https://files.pythonhosted.org/packages/12/43/ccb446a17ccc07ec4b9b3324bec3e29a6d07cb1857905aa092408fb995a3/teradatasql-16.20.0.20-py3-none-any.whl", "yanked": false}], "16.20.0.21": [{"comment_text": "", "digests": {"md5": "283177dddacaae7ecd6732b6a878c970", "sha256": "9e1d6a52dad371d138f07033d27f8b3ef81352bf503e7bc1620f4126c6b7d253"}, "downloads": -1, "filename": "teradatasql-16.20.0.21-py3-none-any.whl", "has_sig": false, "md5_digest": "283177dddacaae7ecd6732b6a878c970", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12326258, "upload_time": "2018-08-30T01:10:23", "upload_time_iso_8601": "2018-08-30T01:10:23.004724Z", "url": "https://files.pythonhosted.org/packages/eb/d8/1b8221a829ce80fe5811095bbf2aeb1851eb02559903fbc686d5d96038c9/teradatasql-16.20.0.21-py3-none-any.whl", "yanked": false}], "16.20.0.22": [{"comment_text": "", "digests": {"md5": "6ea3ed704123d8b51b366b0bbcb8be16", "sha256": "72c43b1a77b5f7c82dc693d10255f543b6e6a1781339a2b71941f5455ddf6578"}, "downloads": -1, "filename": "teradatasql-16.20.0.22-py3-none-any.whl", "has_sig": false, "md5_digest": "6ea3ed704123d8b51b366b0bbcb8be16", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12326535, "upload_time": "2018-08-31T01:20:44", "upload_time_iso_8601": "2018-08-31T01:20:44.714642Z", "url": "https://files.pythonhosted.org/packages/9e/30/1e31852626c0f2d17a359d7d70705f57b3730c2929588941e0c268fd7296/teradatasql-16.20.0.22-py3-none-any.whl", "yanked": false}], "16.20.0.23": [{"comment_text": "", "digests": {"md5": "9b824607ca283e304da67a75a733b00f", "sha256": "8c55f0d77a5d4e767a073c0873cfe1c4093046d359de176e61d0cc1a9ef4cdbf"}, "downloads": -1, "filename": "teradatasql-16.20.0.23-py3-none-any.whl", "has_sig": false, "md5_digest": "9b824607ca283e304da67a75a733b00f", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12328272, "upload_time": "2018-08-31T23:44:03", "upload_time_iso_8601": "2018-08-31T23:44:03.207270Z", "url": "https://files.pythonhosted.org/packages/97/2c/53a1f810becb4eeea0b2ad6dedc3717edb0c6e5bffb31bf96faf351452a6/teradatasql-16.20.0.23-py3-none-any.whl", "yanked": false}], "16.20.0.24": [{"comment_text": "", "digests": {"md5": "77992e51515db252faaf1a5f608a4d7f", "sha256": "108e70385610fabe64211489687cf96743402d60b1f37cfdc9557e0a03903067"}, "downloads": -1, "filename": "teradatasql-16.20.0.24-py3-none-any.whl", "has_sig": false, "md5_digest": "77992e51515db252faaf1a5f608a4d7f", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12337485, "upload_time": "2018-09-06T22:01:49", "upload_time_iso_8601": "2018-09-06T22:01:49.246299Z", "url": "https://files.pythonhosted.org/packages/19/a6/509eaf918768d4fbd882f66181af6a0a926e369ca154f32721b75a7c2fda/teradatasql-16.20.0.24-py3-none-any.whl", "yanked": false}], "16.20.0.25": [{"comment_text": "", "digests": {"md5": "1714dfb69b06b7a1961732f3fe07d262", "sha256": "79550bca4df530213f7a9572af727b09557af1a14cee9673d6696f0fbe7cf4fa"}, "downloads": -1, "filename": "teradatasql-16.20.0.25-py3-none-any.whl", "has_sig": false, "md5_digest": "1714dfb69b06b7a1961732f3fe07d262", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12337923, "upload_time": "2018-09-10T17:39:26", "upload_time_iso_8601": "2018-09-10T17:39:26.021229Z", "url": "https://files.pythonhosted.org/packages/ab/f8/f852e2a18ea569c22a2cca8098747cbbcbec264e766e49273389d364ce2e/teradatasql-16.20.0.25-py3-none-any.whl", "yanked": false}], "16.20.0.26": [{"comment_text": "", "digests": {"md5": "67091e49e0b16b281a44cd50cfcab2da", "sha256": "9afee2f720c6a21c5ae470bda82dfbb2f04bbf75eedde68fd8415c2a57529d8a"}, "downloads": -1, "filename": "teradatasql-16.20.0.26-py3-none-any.whl", "has_sig": false, "md5_digest": "67091e49e0b16b281a44cd50cfcab2da", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12341596, "upload_time": "2018-09-11T23:35:42", "upload_time_iso_8601": "2018-09-11T23:35:42.408278Z", "url": "https://files.pythonhosted.org/packages/97/19/36717c4ad52edc7d1dade67df0e00ebbc68c9bf2cd065c7942b5a2861ece/teradatasql-16.20.0.26-py3-none-any.whl", "yanked": false}], "16.20.0.27": [{"comment_text": "", "digests": {"md5": "1e4582ad3405b3afc473052ead02e227", "sha256": "2aa9a57af0230ae2a70dc90a67ffb5e958457a3f472ee9d03ba0ed6227f53df6"}, "downloads": -1, "filename": "teradatasql-16.20.0.27-py3-none-any.whl", "has_sig": false, "md5_digest": "1e4582ad3405b3afc473052ead02e227", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12341802, "upload_time": "2018-09-12T17:37:00", "upload_time_iso_8601": "2018-09-12T17:37:00.431605Z", "url": "https://files.pythonhosted.org/packages/f8/ea/b6882b08c805976f1362e96908d2f5ff30c273fc306d83c0784dd748ea11/teradatasql-16.20.0.27-py3-none-any.whl", "yanked": false}], "16.20.0.28": [{"comment_text": "", "digests": {"md5": "cdddd1e486bff79f1045b070547f82ad", "sha256": "76528b2eef837d7c3e2fd8a48974c2c3ce987b12a10ed1c64f75537eac33a7e6"}, "downloads": -1, "filename": "teradatasql-16.20.0.28-py3-none-any.whl", "has_sig": false, "md5_digest": "cdddd1e486bff79f1045b070547f82ad", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12349919, "upload_time": "2018-09-13T20:26:06", "upload_time_iso_8601": "2018-09-13T20:26:06.569747Z", "url": "https://files.pythonhosted.org/packages/ac/c3/aafaf7cbbfbacdeda241af27d3df48569de7a3046e57ebafed51ced38705/teradatasql-16.20.0.28-py3-none-any.whl", "yanked": false}], "16.20.0.29": [{"comment_text": "", "digests": {"md5": "75bd4db296b6ba3d7b37b8bcf47ab75c", "sha256": "570dba44c689bb575e2c6b916b63f0b04c8b96c863b76b11ffb2f3cb3bd8b685"}, "downloads": -1, "filename": "teradatasql-16.20.0.29-py3-none-any.whl", "has_sig": false, "md5_digest": "75bd4db296b6ba3d7b37b8bcf47ab75c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12351457, "upload_time": "2018-09-14T23:25:21", "upload_time_iso_8601": "2018-09-14T23:25:21.228574Z", "url": "https://files.pythonhosted.org/packages/68/ca/c86c4f2d9d353804b31f82f437b75b112039f7e2adfbf31173bedca27f90/teradatasql-16.20.0.29-py3-none-any.whl", "yanked": false}], "16.20.0.3": [{"comment_text": "", "digests": {"md5": "0570b4b1c7f0d1408e23fc4662b4c69e", "sha256": "5c3446973f6b4021acf91daa15e3f26b594ec03ba529c485f039177018440c4e"}, "downloads": -1, "filename": "teradatasql-16.20.0.3-py3-none-any.whl", "has_sig": false, "md5_digest": "0570b4b1c7f0d1408e23fc4662b4c69e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12095674, "upload_time": "2018-07-19T22:32:33", "upload_time_iso_8601": "2018-07-19T22:32:33.616406Z", "url": "https://files.pythonhosted.org/packages/97/0e/d0556f7bcbc9dd027aed9f2f68cda2ee83565a6f6e36d299e5026ac1387c/teradatasql-16.20.0.3-py3-none-any.whl", "yanked": false}], "16.20.0.30": [{"comment_text": "", "digests": {"md5": "34e45c6446e586f6af7e9405a5a58560", "sha256": "2b439a4886c5bd9202e946d58451cec2b5b804e2118169de58c6c6cfe07026c1"}, "downloads": -1, "filename": "teradatasql-16.20.0.30-py3-none-any.whl", "has_sig": false, "md5_digest": "34e45c6446e586f6af7e9405a5a58560", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12351458, "upload_time": "2018-09-15T02:31:15", "upload_time_iso_8601": "2018-09-15T02:31:15.227308Z", "url": "https://files.pythonhosted.org/packages/24/e9/6b395ab50c0e95def546b09736c38a712e04599fc8c520834260e6aa8cf8/teradatasql-16.20.0.30-py3-none-any.whl", "yanked": false}], "16.20.0.31": [{"comment_text": "", "digests": {"md5": "c131b121531f6b2d38d343d52a71a246", "sha256": "97468ab7a5eafe6e8a7ed25ad5e4ee9fc78f0f6df4a9a822b50d8d042121a660"}, "downloads": -1, "filename": "teradatasql-16.20.0.31-py3-none-any.whl", "has_sig": false, "md5_digest": "c131b121531f6b2d38d343d52a71a246", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12351718, "upload_time": "2018-09-19T19:09:57", "upload_time_iso_8601": "2018-09-19T19:09:57.565198Z", "url": "https://files.pythonhosted.org/packages/48/0e/366dbadfc4375d86ccb0e266da1d4d0cdbec78bf6b9a140d9ce7c6d92579/teradatasql-16.20.0.31-py3-none-any.whl", "yanked": false}], "16.20.0.32": [{"comment_text": "", "digests": {"md5": "384ce98083f986ee70f3d5eb968b30ac", "sha256": "b451843aa208991695bca3695a3c21e19a68ca1456dc108e2fcb8f2ec2c76bc1"}, "downloads": -1, "filename": "teradatasql-16.20.0.32-py3-none-any.whl", "has_sig": false, "md5_digest": "384ce98083f986ee70f3d5eb968b30ac", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12357840, "upload_time": "2018-09-19T22:53:58", "upload_time_iso_8601": "2018-09-19T22:53:58.501721Z", "url": "https://files.pythonhosted.org/packages/23/5c/0e77c1c3445d581a0957f4259a50b361f9d5fcbb5c417327939bc265b725/teradatasql-16.20.0.32-py3-none-any.whl", "yanked": false}], "16.20.0.33": [{"comment_text": "", "digests": {"md5": "b648091785c00a3165d53a55dd9ab9de", "sha256": "80485c1ed093c8936924f96264434ab0135c8e9877123b110add820af199a8f3"}, "downloads": -1, "filename": "teradatasql-16.20.0.33-py3-none-any.whl", "has_sig": false, "md5_digest": "b648091785c00a3165d53a55dd9ab9de", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12677426, "upload_time": "2018-10-12T20:46:29", "upload_time_iso_8601": "2018-10-12T20:46:29.276951Z", "url": "https://files.pythonhosted.org/packages/e7/fb/d8a670c04f8da43bfe7099a82a2810e3c9a8cf6c41cf209799314bbf22d1/teradatasql-16.20.0.33-py3-none-any.whl", "yanked": false}], "16.20.0.34": [{"comment_text": "", "digests": {"md5": "ebee985efb4da66a221b1cc695c60c0e", "sha256": "84c6fba789f348a236baf2cffc8bc946badd2725bdd9f28c14d5949f72868bd6"}, "downloads": -1, "filename": "teradatasql-16.20.0.34-py3-none-any.whl", "has_sig": false, "md5_digest": "ebee985efb4da66a221b1cc695c60c0e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12677445, "upload_time": "2018-10-15T16:50:42", "upload_time_iso_8601": "2018-10-15T16:50:42.428325Z", "url": "https://files.pythonhosted.org/packages/92/5b/64f48c4f6e381acb7ad33e4a67c04dc894f4496782f0e55cd23ef3c1148d/teradatasql-16.20.0.34-py3-none-any.whl", "yanked": false}], "16.20.0.35": [{"comment_text": "", "digests": {"md5": "f5670d3af76d2231642471ee3c68436e", "sha256": "9600916934ec6950d8c393bb4dafd98537c0e22de3a79baecf395bdb0d822326"}, "downloads": -1, "filename": "teradatasql-16.20.0.35-py3-none-any.whl", "has_sig": false, "md5_digest": "f5670d3af76d2231642471ee3c68436e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12684497, "upload_time": "2018-10-22T18:27:36", "upload_time_iso_8601": "2018-10-22T18:27:36.991891Z", "url": "https://files.pythonhosted.org/packages/92/76/130cbe40f41f8190d32e04318135875ed88209722585c12d5e603a47cc13/teradatasql-16.20.0.35-py3-none-any.whl", "yanked": false}], "16.20.0.36": [{"comment_text": "", "digests": {"md5": "f0ccc0c43f11a9c8f307443225cc0ba3", "sha256": "7cca9c500ac084b607bf34c102a38189fb5f579c31d13b425053a8c2312508ef"}, "downloads": -1, "filename": "teradatasql-16.20.0.36-py3-none-any.whl", "has_sig": false, "md5_digest": "f0ccc0c43f11a9c8f307443225cc0ba3", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12697448, "upload_time": "2018-10-22T21:00:43", "upload_time_iso_8601": "2018-10-22T21:00:43.998910Z", "url": "https://files.pythonhosted.org/packages/b9/6b/72bad720ac138ab04f2ba0ce4517e633666d02e920b3c138fc2cf4eba506/teradatasql-16.20.0.36-py3-none-any.whl", "yanked": false}], "16.20.0.37": [{"comment_text": "", "digests": {"md5": "ea9086297a2799ecc661302f16d19158", "sha256": "1b2f4fba83989fb6111c5337e139ea8242ae756aa8426654497871804dbf4d64"}, "downloads": -1, "filename": "teradatasql-16.20.0.37-py3-none-any.whl", "has_sig": false, "md5_digest": "ea9086297a2799ecc661302f16d19158", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12697410, "upload_time": "2018-10-22T21:07:49", "upload_time_iso_8601": "2018-10-22T21:07:49.661091Z", "url": "https://files.pythonhosted.org/packages/7c/a3/b831d3c2d467482f67cbda268608362d0b0d1f2204887077d27c24112c50/teradatasql-16.20.0.37-py3-none-any.whl", "yanked": false}], "16.20.0.38": [{"comment_text": "", "digests": {"md5": "cbb4810494fde4d87820156131158207", "sha256": "1f7da6b751837f0ba625c6cd53b43fa63d752fb68548ca6b3b81421f2ff5cb9c"}, "downloads": -1, "filename": "teradatasql-16.20.0.38-py3-none-any.whl", "has_sig": false, "md5_digest": "cbb4810494fde4d87820156131158207", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12697735, "upload_time": "2018-10-25T23:05:34", "upload_time_iso_8601": "2018-10-25T23:05:34.616502Z", "url": "https://files.pythonhosted.org/packages/a9/29/43afb874e4eb026c736093fc427cb7376d0a68a392e1d22c815768d5925a/teradatasql-16.20.0.38-py3-none-any.whl", "yanked": false}], "16.20.0.39": [{"comment_text": "", "digests": {"md5": "b22327db550493e552908939bebc65fe", "sha256": "6c1fac30da348879f67e74078eccfebf78631bde4f6f4d7acb0763dd17146cc0"}, "downloads": -1, "filename": "teradatasql-16.20.0.39-py3-none-any.whl", "has_sig": false, "md5_digest": "b22327db550493e552908939bebc65fe", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12699333, "upload_time": "2018-10-26T22:37:26", "upload_time_iso_8601": "2018-10-26T22:37:26.006777Z", "url": "https://files.pythonhosted.org/packages/b1/0f/11f18838b2e16f7f9562199bd6bc4ab63f740861225ed66a0a901f3e98a3/teradatasql-16.20.0.39-py3-none-any.whl", "yanked": false}], "16.20.0.4": [{"comment_text": "", "digests": {"md5": "75214c4d5cfda16a166bcecf02a0628c", "sha256": "cce8f7c92edaa363f5409ba596589dbd875bd7054aba7936f196cbaf2d500402"}, "downloads": -1, "filename": "teradatasql-16.20.0.4-py3-none-any.whl", "has_sig": false, "md5_digest": "75214c4d5cfda16a166bcecf02a0628c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12104298, "upload_time": "2018-07-23T20:07:17", "upload_time_iso_8601": "2018-07-23T20:07:17.171737Z", "url": "https://files.pythonhosted.org/packages/27/86/8a04a47991f454c10015091f62b0775c4a670c57334468b3ff9876120b0b/teradatasql-16.20.0.4-py3-none-any.whl", "yanked": false}], "16.20.0.40": [{"comment_text": "", "digests": {"md5": "566f325aa64290d117036bcb42627fce", "sha256": "e3d0ac7280ee4f030e2c7bbe663f2512aa16bcd4f85d177e2d907ab30f95951b"}, "downloads": -1, "filename": "teradatasql-16.20.0.40-py3-none-any.whl", "has_sig": false, "md5_digest": "566f325aa64290d117036bcb42627fce", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12894862, "upload_time": "2019-02-08T20:18:53", "upload_time_iso_8601": "2019-02-08T20:18:53.269929Z", "url": "https://files.pythonhosted.org/packages/27/ba/42d846eb1210dedfcd131a789299112748f6052a97172920f47e326f5a46/teradatasql-16.20.0.40-py3-none-any.whl", "yanked": false}], "16.20.0.41": [{"comment_text": "", "digests": {"md5": "b332fc503d3d9f2891390748f8ee2c2b", "sha256": "56162a16a0be764ebfbc8120a1b4d3215eaaa6d15c8ef55f17c1a5fc15debd9f"}, "downloads": -1, "filename": "teradatasql-16.20.0.41-py3-none-any.whl", "has_sig": false, "md5_digest": "b332fc503d3d9f2891390748f8ee2c2b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12899624, "upload_time": "2019-02-15T01:57:18", "upload_time_iso_8601": "2019-02-15T01:57:18.363036Z", "url": "https://files.pythonhosted.org/packages/ca/11/450ec55881d9b17ab999839214a26a006111ce3929b95f275a4f4ab4a349/teradatasql-16.20.0.41-py3-none-any.whl", "yanked": false}], "16.20.0.42": [{"comment_text": "", "digests": {"md5": "3ed9e53011956552a5bf3ddab5236216", "sha256": "ae354912c2e81eb51388b14cdf4ae2f11b65c51ccb528cad518802a197474195"}, "downloads": -1, "filename": "teradatasql-16.20.0.42-py3-none-any.whl", "has_sig": false, "md5_digest": "3ed9e53011956552a5bf3ddab5236216", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12981299, "upload_time": "2019-06-07T17:19:49", "upload_time_iso_8601": "2019-06-07T17:19:49.692131Z", "url": "https://files.pythonhosted.org/packages/a0/80/4c8e421583a82795ac613b5bcc98d2fd37142a76a92d31c3aabed0f4a06f/teradatasql-16.20.0.42-py3-none-any.whl", "yanked": false}], "16.20.0.43": [{"comment_text": "", "digests": {"md5": "9b2e83135bbda08b31c4ace10d84a495", "sha256": "233145d8266adf5bed9ff164f73661f400f21a94a815207e4b72ccc537a042a6"}, "downloads": -1, "filename": "teradatasql-16.20.0.43-py3-none-any.whl", "has_sig": false, "md5_digest": "9b2e83135bbda08b31c4ace10d84a495", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 12983056, "upload_time": "2019-07-29T21:59:43", "upload_time_iso_8601": "2019-07-29T21:59:43.406967Z", "url": "https://files.pythonhosted.org/packages/ca/7a/dae96c467ed4be1a5340d7caee74010a7eed0e333d91321f0d888720295d/teradatasql-16.20.0.43-py3-none-any.whl", "yanked": false}], "16.20.0.44": [{"comment_text": "", "digests": {"md5": "c30a8e67d2761e9cc71e7d6c5ee88072", "sha256": "4c9ef72ff6dbf1b168d064a8167a3af9b0a75150f259bd4131a770b899f828f5"}, "downloads": -1, "filename": "teradatasql-16.20.0.44-py3-none-any.whl", "has_sig": false, "md5_digest": "c30a8e67d2761e9cc71e7d6c5ee88072", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13018925, "upload_time": "2019-08-07T20:43:39", "upload_time_iso_8601": "2019-08-07T20:43:39.154918Z", "url": "https://files.pythonhosted.org/packages/cc/08/3035d6a121bde23895803db936616c2ebcce187ed6ec750a1dd87f55941c/teradatasql-16.20.0.44-py3-none-any.whl", "yanked": false}], "16.20.0.45": [{"comment_text": "", "digests": {"md5": "b0730bd08778f8d0ab79b103f0fc3281", "sha256": "accccc04c312b9aaa2961703f6f634eedcfff9c50ce2df2d3d56825ccbe72f2e"}, "downloads": -1, "filename": "teradatasql-16.20.0.45-py3-none-any.whl", "has_sig": false, "md5_digest": "b0730bd08778f8d0ab79b103f0fc3281", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13020826, "upload_time": "2019-08-12T22:36:35", "upload_time_iso_8601": "2019-08-12T22:36:35.060561Z", "url": "https://files.pythonhosted.org/packages/7d/7b/65534d49f393ccf6c5fdfeaa371d7731f6ca448bd2c2c1e378cff0019e35/teradatasql-16.20.0.45-py3-none-any.whl", "yanked": false}], "16.20.0.46": [{"comment_text": "", "digests": {"md5": "a137ba0dbd1376d7699164f889eb6290", "sha256": "6cb7bef8af0d45c9edea5b4776b1a736975766733753afb121e39531c04d6e9e"}, "downloads": -1, "filename": "teradatasql-16.20.0.46-py3-none-any.whl", "has_sig": false, "md5_digest": "a137ba0dbd1376d7699164f889eb6290", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13018293, "upload_time": "2019-08-16T22:02:47", "upload_time_iso_8601": "2019-08-16T22:02:47.198257Z", "url": "https://files.pythonhosted.org/packages/bf/90/bb9ace6a3454cb19ff721dd16a52cd28b81210280111d75aee8a6fc14bf5/teradatasql-16.20.0.46-py3-none-any.whl", "yanked": false}], "16.20.0.47": [{"comment_text": "", "digests": {"md5": "c5edc3daa2977818d4a3c10cd02a2ac6", "sha256": "3d0a78690212ce047015b56ac5d9c0c420c2e9a1868d4613c97cd7424d555c78"}, "downloads": -1, "filename": "teradatasql-16.20.0.47-py3-none-any.whl", "has_sig": false, "md5_digest": "c5edc3daa2977818d4a3c10cd02a2ac6", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13023533, "upload_time": "2019-08-27T17:40:49", "upload_time_iso_8601": "2019-08-27T17:40:49.901893Z", "url": "https://files.pythonhosted.org/packages/de/9b/166f81afbd912d853060ba935a020f6d26474ebd79b995272dc19a12ff94/teradatasql-16.20.0.47-py3-none-any.whl", "yanked": false}], "16.20.0.48": [{"comment_text": "", "digests": {"md5": "1ef0479570e8568fd3f9a7d22a92fe69", "sha256": "40aaafd585ba79e61801ed4bf3a985b8bc4063bfa4aa573b76b0d3881ba60f95"}, "downloads": -1, "filename": "teradatasql-16.20.0.48-py3-none-any.whl", "has_sig": false, "md5_digest": "1ef0479570e8568fd3f9a7d22a92fe69", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13239544, "upload_time": "2019-09-07T04:51:49", "upload_time_iso_8601": "2019-09-07T04:51:49.294122Z", "url": "https://files.pythonhosted.org/packages/6e/e2/d40d39f7ffb11469e626d6a74f6f5f42c5204221ea97df279e80ac989a26/teradatasql-16.20.0.48-py3-none-any.whl", "yanked": false}], "16.20.0.49": [{"comment_text": "", "digests": {"md5": "cdfcaee496474bdd2b295ae2a81a340a", "sha256": "73d35e82c3752610b9d6e30ad12faa3ddc631668b1f6cc0d58b94bf312400d81"}, "downloads": -1, "filename": "teradatasql-16.20.0.49-py3-none-any.whl", "has_sig": false, "md5_digest": "cdfcaee496474bdd2b295ae2a81a340a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13242012, "upload_time": "2019-10-03T18:49:30", "upload_time_iso_8601": "2019-10-03T18:49:30.940793Z", "url": "https://files.pythonhosted.org/packages/02/ec/fe7237bd3f483df7a6c2260502090a9a67e00d4d335a31cda471fd806b8d/teradatasql-16.20.0.49-py3-none-any.whl", "yanked": false}], "16.20.0.5": [{"comment_text": "", "digests": {"md5": "8df4ba4c3c45f36863a3fb5e249056d4", "sha256": "cb5452bf33b0350537608661059258e7d6dc44cdadf0d385489db26628212439"}, "downloads": -1, "filename": "teradatasql-16.20.0.5-py3-none-any.whl", "has_sig": false, "md5_digest": "8df4ba4c3c45f36863a3fb5e249056d4", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12104250, "upload_time": "2018-07-25T13:52:39", "upload_time_iso_8601": "2018-07-25T13:52:39.074092Z", "url": "https://files.pythonhosted.org/packages/ed/98/357b0abc213c9eef607cb843a88c0244c31c979a7f205b33b43bffabd0f5/teradatasql-16.20.0.5-py3-none-any.whl", "yanked": false}], "16.20.0.50": [{"comment_text": "", "digests": {"md5": "867e865c9ab720b24ecf557f17a7d22e", "sha256": "2ed7eac296b859d0d992098bc45907a2002ad45953acb1b1c01c66906b4ce090"}, "downloads": -1, "filename": "teradatasql-16.20.0.50-py3-none-any.whl", "has_sig": false, "md5_digest": "867e865c9ab720b24ecf557f17a7d22e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13243205, "upload_time": "2019-10-07T22:56:28", "upload_time_iso_8601": "2019-10-07T22:56:28.450805Z", "url": "https://files.pythonhosted.org/packages/7e/97/ee4545d0173a5f82781761c88c79cdd9c034eefab719a9b5ad955ea9a8d7/teradatasql-16.20.0.50-py3-none-any.whl", "yanked": false}], "16.20.0.51": [{"comment_text": "", "digests": {"md5": "e2d7b88775b61c3e32f85f2166a4770c", "sha256": "bd851377d44290a9dcdd07d6559afa69e8d7ff980cc066640d4743a80ccd24bf"}, "downloads": -1, "filename": "teradatasql-16.20.0.51-py3-none-any.whl", "has_sig": false, "md5_digest": "e2d7b88775b61c3e32f85f2166a4770c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13243098, "upload_time": "2019-10-16T21:49:02", "upload_time_iso_8601": "2019-10-16T21:49:02.131927Z", "url": "https://files.pythonhosted.org/packages/99/a8/560ee49a898f5e960e367b30dc84c510ec2430f170f5496da374ea26c960/teradatasql-16.20.0.51-py3-none-any.whl", "yanked": false}], "16.20.0.52": [{"comment_text": "", "digests": {"md5": "5f6955a1b746285037ba5b41a7f7d739", "sha256": "7973233a153be50649c1d92c14a7951bb67fd2ffceac824ce761815ddc9e0e75"}, "downloads": -1, "filename": "teradatasql-16.20.0.52-py3-none-any.whl", "has_sig": false, "md5_digest": "5f6955a1b746285037ba5b41a7f7d739", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13245072, "upload_time": "2019-10-18T21:05:46", "upload_time_iso_8601": "2019-10-18T21:05:46.816817Z", "url": "https://files.pythonhosted.org/packages/5c/ae/35b996fafa463639e0cf80192520e334a95e051013d108567c02fccbfac0/teradatasql-16.20.0.52-py3-none-any.whl", "yanked": false}], "16.20.0.53": [{"comment_text": "", "digests": {"md5": "5ace930f61837e8bcce35042ffdc5f59", "sha256": "5d9da9ba1a803ba04d0015566da654628a1cad8f102b2e310b93b0fa57124751"}, "downloads": -1, "filename": "teradatasql-16.20.0.53-py3-none-any.whl", "has_sig": false, "md5_digest": "5ace930f61837e8bcce35042ffdc5f59", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13258517, "upload_time": "2019-11-16T00:56:26", "upload_time_iso_8601": "2019-11-16T00:56:26.816817Z", "url": "https://files.pythonhosted.org/packages/b6/68/199680ce83b3d15c9ff6b6f6b794f4e3d71a2482993167c4d85b20272a06/teradatasql-16.20.0.53-py3-none-any.whl", "yanked": false}], "16.20.0.54": [{"comment_text": "", "digests": {"md5": "8859d2248615cfbbf6685fd3cea5e9cd", "sha256": "d406e89d86ab03616d7a5fbd7cf30e997d8375808ec93c83f874c76df4cf5b2b"}, "downloads": -1, "filename": "teradatasql-16.20.0.54-py3-none-any.whl", "has_sig": false, "md5_digest": "8859d2248615cfbbf6685fd3cea5e9cd", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13260036, "upload_time": "2019-11-21T20:42:04", "upload_time_iso_8601": "2019-11-21T20:42:04.631185Z", "url": "https://files.pythonhosted.org/packages/55/d0/47a6840aa9441e9d3ae3002ae3bbf3287cd9174d8743a20af4c61984481e/teradatasql-16.20.0.54-py3-none-any.whl", "yanked": false}], "16.20.0.55": [{"comment_text": "", "digests": {"md5": "f4a2337834d0df7f33a26f73e62543e4", "sha256": "38bbea35c4cd25a17ee4cc9fec7c4bded9c76935bb558b5d949ef0e28e12633f"}, "downloads": -1, "filename": "teradatasql-16.20.0.55-py3-none-any.whl", "has_sig": false, "md5_digest": "f4a2337834d0df7f33a26f73e62543e4", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13286148, "upload_time": "2019-11-26T18:56:05", "upload_time_iso_8601": "2019-11-26T18:56:05.907572Z", "url": "https://files.pythonhosted.org/packages/9f/d3/2c1773b62f5f881b63af0545751df1e8355ae8af62647436e1db13f1190b/teradatasql-16.20.0.55-py3-none-any.whl", "yanked": false}], "16.20.0.56": [{"comment_text": "", "digests": {"md5": "695b6192e8297fdb02f299064b26be2c", "sha256": "7d5d4338d6c2d372b2b286e898b3f56c29fb3717af52adfd0a7eeacfbc5cb41f"}, "downloads": -1, "filename": "teradatasql-16.20.0.56-py3-none-any.whl", "has_sig": false, "md5_digest": "695b6192e8297fdb02f299064b26be2c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13286355, "upload_time": "2019-12-04T23:02:09", "upload_time_iso_8601": "2019-12-04T23:02:09.094822Z", "url": "https://files.pythonhosted.org/packages/60/a4/1d677d0690143b6138f777dd54b192045cba1d636a1470dde4f4d27041cb/teradatasql-16.20.0.56-py3-none-any.whl", "yanked": false}], "16.20.0.57": [{"comment_text": "", "digests": {"md5": "147bacefa812f259a9d5a5ad61b4ca94", "sha256": "0f665007bc597fd09a5af51ca7c0c31786044e60abf5489d71b5e26bdbc1937f"}, "downloads": -1, "filename": "teradatasql-16.20.0.57-py3-none-any.whl", "has_sig": false, "md5_digest": "147bacefa812f259a9d5a5ad61b4ca94", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13285950, "upload_time": "2019-12-10T17:38:01", "upload_time_iso_8601": "2019-12-10T17:38:01.858708Z", "url": "https://files.pythonhosted.org/packages/b7/f4/162efbee84ef702ecff5b9f866e856a1f01b4c24d3f241fd741968336892/teradatasql-16.20.0.57-py3-none-any.whl", "yanked": false}], "16.20.0.58": [{"comment_text": "", "digests": {"md5": "9033b1c0b92ba85c266773890ed5d38c", "sha256": "c5d04772f9522a32f56df1bf05e77bb88dce155eeb7adb504d29eeef99bb3fce"}, "downloads": -1, "filename": "teradatasql-16.20.0.58-py3-none-any.whl", "has_sig": false, "md5_digest": "9033b1c0b92ba85c266773890ed5d38c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13287628, "upload_time": "2019-12-11T17:49:25", "upload_time_iso_8601": "2019-12-11T17:49:25.501634Z", "url": "https://files.pythonhosted.org/packages/ac/a3/b923739a79b3e88fc97d5d0aa918d66c5d3864ddaa0fa9f32024d28f6740/teradatasql-16.20.0.58-py3-none-any.whl", "yanked": false}], "16.20.0.59": [{"comment_text": "", "digests": {"md5": "7b2a4344f0708c42421650dab61ea1f5", "sha256": "e26a6da17fa572118553f1f495241b7435a6c9bdea0a17bcf3d93f891189bd76"}, "downloads": -1, "filename": "teradatasql-16.20.0.59-py3-none-any.whl", "has_sig": false, "md5_digest": "7b2a4344f0708c42421650dab61ea1f5", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13287893, "upload_time": "2020-01-09T20:19:11", "upload_time_iso_8601": "2020-01-09T20:19:11.443967Z", "url": "https://files.pythonhosted.org/packages/c9/5d/90bbc2a5213516f2d393261bbe204654774eefe57b1d5be387a96b5bad1e/teradatasql-16.20.0.59-py3-none-any.whl", "yanked": false}], "16.20.0.6": [{"comment_text": "", "digests": {"md5": "a7ab3c13156ad395307eca3e0d063c87", "sha256": "b2595aa3b95a6aae2660b95a68f970551d09b8ebb7f5546ff2d11be0a9b191db"}, "downloads": -1, "filename": "teradatasql-16.20.0.6-py3-none-any.whl", "has_sig": false, "md5_digest": "a7ab3c13156ad395307eca3e0d063c87", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12101782, "upload_time": "2018-07-25T21:54:11", "upload_time_iso_8601": "2018-07-25T21:54:11.723975Z", "url": "https://files.pythonhosted.org/packages/04/8f/753f52b4081fafc5583a966c7e47a15741ffd6903c39928d55c0b90e5662/teradatasql-16.20.0.6-py3-none-any.whl", "yanked": false}], "16.20.0.60": [{"comment_text": "", "digests": {"md5": "a0f7bf3b9a6803c5881ec843ab417041", "sha256": "2b70a45b508a11a7e696e92ec49ea598027d9860af90549bfd3426fbd4fd4c7e"}, "downloads": -1, "filename": "teradatasql-16.20.0.60-py3-none-any.whl", "has_sig": false, "md5_digest": "a0f7bf3b9a6803c5881ec843ab417041", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13433395, "upload_time": "2020-03-27T20:52:44", "upload_time_iso_8601": "2020-03-27T20:52:44.518331Z", "url": "https://files.pythonhosted.org/packages/7e/88/bedce0fabdd3dd98b7ed207cc963748bc11a09cbab9f7ac5dacad5f91994/teradatasql-16.20.0.60-py3-none-any.whl", "yanked": false}], "16.20.0.61": [{"comment_text": "", "digests": {"md5": "85a85a23ee9e0e561089993a6d46ff55", "sha256": "79b557f63fa99937754be51b47866619a56cfcaf4c951865db29fb785382a68a"}, "downloads": -1, "filename": "teradatasql-16.20.0.61-py3-none-any.whl", "has_sig": false, "md5_digest": "85a85a23ee9e0e561089993a6d46ff55", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13433486, "upload_time": "2020-04-30T17:16:15", "upload_time_iso_8601": "2020-04-30T17:16:15.695419Z", "url": "https://files.pythonhosted.org/packages/39/3d/bedd864e7db01bf3d51049951447e86ab8d2499500107cac28925f157ac8/teradatasql-16.20.0.61-py3-none-any.whl", "yanked": false}], "16.20.0.7": [{"comment_text": "", "digests": {"md5": "5862e4c6167ac030cd2de3fdd4875c2b", "sha256": "d028aa31f0b86b3db53ad285d6491a9a5d2f9b2db5c601d22369cc5798bd3341"}, "downloads": -1, "filename": "teradatasql-16.20.0.7-py3-none-any.whl", "has_sig": false, "md5_digest": "5862e4c6167ac030cd2de3fdd4875c2b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12165992, "upload_time": "2018-07-30T19:24:46", "upload_time_iso_8601": "2018-07-30T19:24:46.534291Z", "url": "https://files.pythonhosted.org/packages/82/ad/10046d6be9843d9417273174b4f1ae5285d36a2eb6917673388330c2ef06/teradatasql-16.20.0.7-py3-none-any.whl", "yanked": false}], "16.20.0.8": [{"comment_text": "", "digests": {"md5": "f2df9ca6b57cafbf2fcc69cfa8045ef0", "sha256": "2d78a07f540afd827ee7769daddf8ba582514d1a64062dcbbb3cfa02deb9e85b"}, "downloads": -1, "filename": "teradatasql-16.20.0.8-py3-none-any.whl", "has_sig": false, "md5_digest": "f2df9ca6b57cafbf2fcc69cfa8045ef0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12277895, "upload_time": "2018-08-07T20:58:55", "upload_time_iso_8601": "2018-08-07T20:58:55.143193Z", "url": "https://files.pythonhosted.org/packages/4c/9a/771c0e69be12fe9ffded252b4a33b84529d6958c1a96c0d45665623b505e/teradatasql-16.20.0.8-py3-none-any.whl", "yanked": false}], "16.20.0.9": [{"comment_text": "", "digests": {"md5": "79c42b7dbf9b77b89d29371270ae40f3", "sha256": "95a61d91f9e140abfaed7d3fd8390e4088050ac62d1009a9a7bc0fd1e7d0bf46"}, "downloads": -1, "filename": "teradatasql-16.20.0.9-py3-none-any.whl", "has_sig": false, "md5_digest": "79c42b7dbf9b77b89d29371270ae40f3", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 12278445, "upload_time": "2018-08-07T22:57:56", "upload_time_iso_8601": "2018-08-07T22:57:56.866543Z", "url": "https://files.pythonhosted.org/packages/c2/aa/40f8b0caa2062ae29edc7901774801be7fe657987fd1deaf41904824a049/teradatasql-16.20.0.9-py3-none-any.whl", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "85a85a23ee9e0e561089993a6d46ff55", "sha256": "79b557f63fa99937754be51b47866619a56cfcaf4c951865db29fb785382a68a"}, "downloads": -1, "filename": "teradatasql-16.20.0.61-py3-none-any.whl", "has_sig": false, "md5_digest": "85a85a23ee9e0e561089993a6d46ff55", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": ">=3.4", "size": 13433486, "upload_time": "2020-04-30T17:16:15", "upload_time_iso_8601": "2020-04-30T17:16:15.695419Z", "url": "https://files.pythonhosted.org/packages/39/3d/bedd864e7db01bf3d51049951447e86ab8d2499500107cac28925f157ac8/teradatasql-16.20.0.61-py3-none-any.whl", "yanked": false}], "timestamp": "Fri May  8 02:55:59 2020"}