{"info": {"author": "Erik Hendrix", "author_email": "", "bugtrack_url": null, "classifiers": ["Intended Audience :: End Users/Desktop", "License :: OSI Approved :: Apache Software License", "Programming Language :: Python", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: Implementation :: CPython", "Programming Language :: Python :: Implementation :: PyPy", "Topic :: Multimedia :: Video :: Conversion"], "description": "\ntesla_dashcam\n=============\n\nPython program that provides an easy method to merge saved Tesla Dashcam footage into a single video.\n\nWhen saving Tesla Dashcam footage a folder is created on the USB drive for each event and within it multiple MP4 video files are\ncreated. Currently the dashcam leverages four (4) cameras (front, rear, left repeater, and right repeater) and will create a\nfile for each of them. Every minute is stored into a separate file as well. This means that when saving dashcam footage\nthere is a total of 40 files video files for every 10 minutes, each event of 10 minutes is put into a separate folder.\n\nUsing this program, one can combine the 40 video files of an event into one (1), and combine video of multiple events together.\nThe layout of the four (4) different cameras within the resulting video can be determined by choosing one of the available layouts.\n\nThis program has multiple options providing a high level of flexibility on the videos to process, cameras to include,\nlayout of the resulting videos, location, format, encoding, .... See usage section below to read upon all the possibilities.\n\n**Video Input** provides options related to the source videos.\n\n*Trigger Monitor* is to have processing of videos not start upon execution of the program but instead be based on a trigger\n(i.e. inserting the USB/SD card in the PC).\n\n**Video Layout** provides parameters to define what the resulting video should look like. There are 4 different layouts to\nchoose from. This can then be further adjusted by having the left/right cameras be in perspective or not. Swap left/right\nor front/rear cameras, change the scale for all cameras and/or for certain cameras, make left/right/rear seem as if you\nwere watching it through a mirror, or as if you turn your head around and looking backwards.\n\n**Camera Exclusion** exclude certain cameras from the resulting video.\n\n**Timestamp** options allow you to define what the timestamp in the resulting video should look like, or just to not have\nit display at all.\n\n**Timestamp Restriction** provides with the possibility to only create a video of the portion that are important. Instead\nof uploading a video where the first 5 minutes is nothing, specify the start and end timestamps to shorten the video\nto the important section instead.\n\n**Event offsets** allows you to skip a portion from the start (and/or the end) for each event.\n\n**Video Output** then further defines what the output should look like. Fast-forward through the Sentry video where nothing\nis happening, speed up or slow down the video, ...\n\n**Advanced encoding settings** allows you to further define additional encoding settings\n\nAnd **Update Check** will make sure you always have the latest version available.\n\nCheck out the Usage section of this README to get more information on all available parameters and what each does.\n\n\nBinaries\n--------\n\nStand-alone binaries can be retrieved from:\n\n- Windows: https://github.com/ehendrix23/tesla_dashcam/releases/latest/download/tesla_dashcam.zip\n- MacOS (OSX): https://github.com/ehendrix23/tesla_dashcam/releases/latest/download/tesla_dashcam.dmg\n\n`ffmpeg <https://www.ffmpeg.org/legal.html>`_ is included within the respective package.\nffmpeg is a separately licensed product under the `GNU Lesser General Public License (LGPL) version 2.1 or later <http://www.gnu.org/licenses/old-licenses/lgpl-2.1.html>`_.\nFFmpeg incorporates several optional parts and optimizations that are covered by the GNU General Public License (GPL) version 2 or later. If those parts get used the GPL applies to all of FFmpeg.\nFor more information on ffmpeg license please see: https://www.ffmpeg.org/legal.html\n\nWindows binary of ffmpeg was downloaded from: https://ffmpeg.zeranoe.com/builds/\n\nMacOS binary of ffmpeg was downloaded from: https://evermeet.cx/ffmpeg/\n\n\nNotes\n-----\n\nThe video files for the same minute between the 4 cameras are not always the same length. If there is a difference in\ntheir duration then the background color (black by default) will be shown for the camera which video ended before the\nothers (within the minute).\nIt is thus possible within a video to see the background color for one of the cameras, and then when that minute has passed\nfor it to show video again.\n\nThe date and time shown within the video comes from the timestamp embedded in the saved videos themselves, not from the\nfilename. Date and time shown within resulting videos is converted to timezone set upon the PC it is being run on.\n\n\nRequirements\n-------------\n\nThis package relies on `ffmpeg <https://ffmpeg.org>`__ to be installed, this is a free, open source cross-platform\nsolution to convert video. The created executables for Windows and MacOS include an ffmpeg version.\n\nIf not using the executables (Windows and MacOS) then `Python <https://www.python.org>`__ 3.7 or higher is required.\n\n\nInstallation\n-------------\n\nDownloading the respective bundle (ZIP for Windows, DMG for MacOS) and unpacking this in a location of your choosing is\nsufficient to install this.\n\nIf downloading the source files (i.e. for Linux) then Python has to be installed as well. I recommend in that case to\ninstall the package from pypi using pip to ensure all package requirements (except for ffmpeg) are met.\n\nThis package is available from `pypi <https://pypi.org/project/tesla-dashcam/>`__.\n\nInstall from pypi is done through:\n\n.. code:: bash\n\n    python3 -m pip install tesla_dashcam\n\n\n\nUsage\n-----\n\n.. code:: bash\n\n    usage: tesla_dashcam.py [-h] [--version]\n                            [--loglevel {DEBUG,INFO,WARNING,ERROR,CRITICAL}]\n                            [--temp_dir TEMP_DIR] [--no-notification]\n                            [--skip_existing] [--delete_source]\n                            [--exclude_subdirs] [--monitor] [--monitor_once]\n                            [--monitor_trigger MONITOR_TRIGGER]\n                            [--layout {WIDESCREEN,FULLSCREEN,PERSPECTIVE,CROSS,DIAMOND}]\n                            [--perspective] [--scale CLIP_SCALE [CLIP_SCALE ...]]\n                            [--mirror] [--rear] [--swap] [--no-swap]\n                            [--swap_frontrear] [--background BACKGROUND]\n                            [--no-front] [--no-left] [--no-right] [--no-rear]\n                            [--no-timestamp] [--halign {LEFT,CENTER,RIGHT}]\n                            [--valign {TOP,MIDDLE,BOTTOM}] [--font FONT]\n                            [--fontsize FONTSIZE] [--fontcolor FONTCOLOR]\n                            [--start_timestamp START_TIMESTAMP]\n                            [--end_timestamp END_TIMESTAMP]\n                            [--start_offset START_OFFSET]\n                            [--end_offset END_OFFSET] [--output OUTPUT]\n                            [--motion_only] [--slowdown SLOW_DOWN]\n                            [--speedup SPEED_UP] [--chapter_offset CHAPTER_OFFSET]\n                            [--merge] [--keep-intermediate] [--no-gpu]\n                            [--no-faststart]\n                            [--quality {LOWEST,LOWER,LOW,MEDIUM,HIGH}]\n                            [--compression {ultrafast,superfast,veryfast,faster,fast,medium,slow,slower,veryslow}]\n                            [--fps FPS] [--ffmpeg FFMPEG] [--encoding {x264,x265}]\n                            [--enc ENC] [--check_for_update]\n                            [--no-check_for_update] [--include_test]\n                            [source [source ...]]\n\n    tesla_dashcam - Tesla DashCam & Sentry Video Creator\n\n    positional arguments:\n      source                Folder(s) (events) containing the saved camera files.\n                            Filenames can be provided as well to manage individual\n                            clips. (default: None)\n\n    optional arguments:\n      -h, --help            show this help message and exit\n      --version             show program''s version number and exit\n      --loglevel {DEBUG,INFO,WARNING,ERROR,CRITICAL}\n                            Logging level. (default: INFO)\n      --temp_dir TEMP_DIR   Path to store temporary files. (default: None)\n      --no-notification     Do not create a notification upon completion.\n                            (default: True)\n\n    Video Input:\n      Options related to what clips and events to process.\n\n      --skip_existing       Skip creating encoded video file if it already exist.\n                            Note that only existence is checked, not if layout\n                            etc. are the same. (default: False)\n      --delete_source       Delete the processed files upon completion. (default:\n                            False)\n      --exclude_subdirs     Do not search sub folders (events) for video files to\n                            process. (default: False)\n\n    Trigger Monitor:\n      Parameters for monitoring of insertion of TeslaCam drive, folder, or file\n      existence.\n\n      --monitor             Enable monitoring for drive to be attached with\n                            TeslaCam folder. (default: False)\n      --monitor_once        Enable monitoring and exit once drive with TeslaCam\n                            folder has been attached and files processed.\n                            (default: False)\n      --monitor_trigger MONITOR_TRIGGER\n                            Trigger file to look for instead of waiting for drive\n                            to be attached. Once file is discovered then\n                            processing will start, file will be deleted when\n                            processing has been completed. If source is not\n                            provided then folder where file is located will be\n                            used as source. (default: None)\n\n    Video Layout:\n      Set what the layout of the resulting video should be\n\n      --layout {WIDESCREEN,FULLSCREEN,PERSPECTIVE,CROSS,DIAMOND}\n                            Layout of the created video.\n                                FULLSCREEN: Front camera center top, side cameras underneath it with rear camera between side camera.\n                                WIDESCREEN: Front camera on top with side and rear cameras smaller underneath it.\n                                PERSPECTIVE: Similar to FULLSCREEN but then with side cameras in perspective.\n                                CROSS: Front camera center top, side cameras underneath, and rear camera center bottom.\n                                DIAMOND: Front camera center top, side cameras below front camera left and right of front, and rear camera center bottom.\n                             (default: FULLSCREEN)\n      --perspective         Show side cameras in perspective. (default: False)\n      --scale CLIP_SCALE [CLIP_SCALE ...]\n                            Set camera clip scale for all clips, scale of 1 is 1280x960 camera clip.\n                            If provided with value then it is default for all cameras, to set the scale for a specific camera provide camera=<front, left, right,rear> <scale>\n                            for example:\n                              --scale 0.5                                             all are 640x480\n                              --scale 640x480                                         all are 640x480\n                              --scale 0.5 --scale camera=front 1                      all are 640x480 except front at 1280x960\n                              --scale camera=left .25 --scale camera=right 320x240    left and right are set to 320x240\n                            Defaults:\n                                WIDESCREEN: 1/2 (front 1280x960, others 640x480, video is 1920x1920)\n                                FULLSCREEN: 1/2 (640x480, video is 1920x960)\n                                CROSS: 1/2 (640x480, video is 1280x1440)\n                                DIAMOND: 1/2 (640x480, video is 1920x976)\n                             (default: None)\n      --mirror              Video from side and rear cameras as if being viewed\n                            through the mirror. Default when not providing\n                            parameter --no-front. Cannot be used in combination\n                            with --rear. (default: None)\n      --rear                Video from side and rear cameras as if looking\n                            backwards. Default when providing parameter --no-\n                            front. Cannot be used in combination with --mirror.\n                            (default: None)\n      --swap                Swap left and right cameras in output, default when\n                            side and rear cameras are as if looking backwards. See\n                            --rear parameter. (default: None)\n      --no-swap             Do not swap left and right cameras, default when side\n                            and rear cameras are as if looking through a mirror.\n                            Also see --mirror parameter (default: None)\n      --swap_frontrear      Swap front and rear cameras in output. (default:\n                            False)\n      --background BACKGROUND\n                            Background color for video. Can be a color string or\n                            RGB value. Also see --fontcolor. (default: black)\n\n    Camera Exclusion:\n      Exclude one or more cameras:\n\n      --no-front            Exclude front camera from video. (default: False)\n      --no-left             Exclude left camera from video. (default: False)\n      --no-right            Exclude right camera from video. (default: False)\n      --no-rear             Exclude rear camera from video. (default: False)\n\n    Timestamp:\n      Options on how to show date/time in resulting video:\n\n      --no-timestamp        Do not show timestamp in video (default: False)\n      --halign {LEFT,CENTER,RIGHT}\n                            Horizontal alignment for timestamp (default: None)\n      --valign {TOP,MIDDLE,BOTTOM}\n                            Vertical Alignment for timestamp (default: None)\n      --font FONT           Fully qualified filename (.ttf) to the font to be\n                            chosen for timestamp. (default: /Library/Fonts/Arial\n                            Unicode.ttf)\n      --fontsize FONTSIZE   Font size for timestamp. Default is scaled based on\n                            resulting video size. (default: None)\n      --fontcolor FONTCOLOR\n                            Font color for timestamp. Any color is accepted as a color string or RGB value.\n                            Some potential values are:\n                                white\n                                yellowgreen\n                                yellowgreen@0.9\n                                Red\n                            :    0x2E8B57\n                            For more information on this see ffmpeg documentation for color: https://ffmpeg.org/ffmpeg-utils.html#Color (default: white)\n\n    Timestamp Restriction:\n      Restrict video to be between start and/or end timestamps. Timestamp to be\n      provided in a ISO-8601 format (see https://fits.gsfc.nasa.gov/iso-\n      time.html for examples)\n\n      --start_timestamp START_TIMESTAMP\n                            Starting timestamp (default: None)\n      --end_timestamp END_TIMESTAMP\n                            Ending timestamp (default: None)\n\n    Event offsets:\n      Start and/or end offsets for events\n\n      --start_offset START_OFFSET\n                            Skip x number of seconds from start of event for\n                            resulting video. (default: None)\n      --end_offset END_OFFSET\n                            Ignore the last x seconds of the event for resulting\n                            video (default: None)\n\n    Video Output:\n      Options related to resulting video creation.\n\n      --output OUTPUT       Path/Filename for the new movie file. Event files will be stored in same folder.\n                             (default: /Users/ehendrix/Movies/Tesla_Dashcam/)\n      --motion_only         Fast-forward through video when there is no motion.\n                            (default: False)\n      --slowdown SLOW_DOWN  Slow down video output. Accepts a number that is then\n                            used as multiplier, providing 2 means half the speed.\n      --speedup SPEED_UP    Speed up the video. Accepts a number that is then used\n                            as a multiplier, providing 2 means twice the speed.\n      --chapter_offset CHAPTER_OFFSET\n                            Offset in seconds for chapters in merged video.\n                            Negative offset is # of seconds before the end of the\n                            subdir video, positive offset if # of seconds after\n                            the start of the subdir video. (default: 0)\n      --merge               Merge the video files from different folders (events)\n                            into 1 big video file. (default: False)\n      --keep-intermediate   Do not remove the clip video files that are created\n                            (default: False)\n\n    Advanced encoding settings:\n      Advanced options for encoding\n\n      --no-gpu (Mac)|--gpu (Non-Mac Only)\n                            Use GPU acceleration, only enable if supported by hardware.\n                             MAC: All MACs with Haswell CPU or later support this (Macs after 2013).\n                                  See following link as well:\n                                     https://en.wikipedia.org/wiki/List_of_Macintosh_models_grouped_by_CPU_type#Haswell\n                             (default: False)\n\n      --gpu_type {nvidia,intel,RPi} (Non-Mac only)\n                            Type of graphics card (GPU) in the system. This\n                            determines the encoder that will be used.This\n                            parameter is mandatory if --gpu is provided. (default:\n                            None)\n\n      --no-faststart        Do not enable flag faststart on the resulting video\n                            files. Use this when using a network share and errors\n                            occur during encoding. (default: False)\n      --quality {LOWEST,LOWER,LOW,MEDIUM,HIGH}\n                            Define the quality setting for the video, higher\n                            quality means bigger file size but might not be\n                            noticeable. (default: LOWER)\n      --compression {ultrafast,superfast,veryfast,faster,fast,medium,slow,slower,veryslow}\n                            Speed to optimize video. Faster speed results in a\n                            bigger file. This does not impact the quality of the\n                            video, just how much time is used to compress it.\n                            (default: medium)\n      --fps FPS             Frames per second for resulting video. Tesla records\n                            at about 33fps hence going higher wouldn't do much as\n                            frames would just be duplicated. Default is 24fps\n                            which is the standard for movies and TV shows\n                            (default: 24)\n      --ffmpeg FFMPEG       Path and filename for ffmpeg. Specify if ffmpeg is not\n                            within path. (default: /Users/ehendrix/Documents_local\n                            /GitHub/tesla_dashcam/tesla_dashcam/ffmpeg)\n      --encoding {x264,x265}\n                            Encoding to use for video creation.\n                                x264: standard encoding, can be viewed on most devices but results in bigger file.\n                                x265: newer encoding standard but not all devices support this yet.\n      --enc ENC             Provide a custom encoder for video creation. Cannot be used in combination with --encoding.\n                            Note: when using this option the --gpu option is ignored. To use GPU hardware acceleration specify an encoding that provides this.\n\n    Update Check:\n      Check for updates\n\n      --check_for_update    Check for update and exit. (default: False)\n      --no-check_for_update\n                            A check for new updates is performed every time. With\n                            this parameter that can be disabled (default: False)\n      --include_test        Include test (beta) releases when checking for\n                            updates. (default: False)\n\n\nPositional Argument\n-------------------\n\nSource does not have a specific parameter. Just provide the folder(s) to be scanned and processed. One can provide\nfolder(s) and/or file(s) here. Source is not mandatory, if not provided then the default will be SavedClips and SentryClips.\nThe path searches for SavedClips and SentryClips will depend if there was a Trigger Monitor parameter provided or not.\nIf source is not provided and no Trigger Monitor provided then --monitor_once will be enabled with SavedClips and SentryClips.\n\n\nOptional Arguments\n------------------\n\nThese are some other optional arguments that don't change in what will be processed, how, layout, resulting video file\nor so.\n\n*-h or --help*\n\n  Show the help message and exit.\n\n*--version*\n\n  Show the version number of the program and exit.\n\n*--loglevel <level>*\n\n  Log level for additional output. Currently only used for DEBUG, providing any other value will not change anything.\n\n*--temp_dir <path>*\n\n  Temporary path to store the temporary (intermediate) clip video files. When processing a temporary video file is\n  created for each minute within an event folder combining the different cameras together. Then these temporary video\n  files are merged together to produce the resulting event video file. By default the temporary clip video files will\n  be stored in the same folder as specified where the resulting video file will be stored. Using this parameter one\n  can thus specify another folder instead. Can be especially helpful when the resulting videos are being stored on\n  a network share as one can then specify a local drive that would be faster for the temporary files.\n\n*--no-notification*\n\n  Upon completion a notification is provided on the screen that processing is completed. Use this parameter to\n  disable this notification.\n\nVideo Input\n-----------\n\nFollowing options are to manage what should be processed and what to do once processed.\n\n*--skip_existing*\n\n  Default: False\n\n  By default if a resulting video files already exist then it will be overwritten (except with --monitor). By providing this\n  parameter if the resulting video file already exist then it will not be recreated. Note that this only checks for existence\n  of the video file and not if the layout etc. of that video file matches current selection.\n\n*--delete_source*\n\n  Default: False\n\n  Delete the clips (files) and events (folders) on the source once processing has been completed.\n\n*--exclude_subdirs*\n\n  Default: False\n\n  Do not scan any subfolders within the source provided for valid clips.\n\n\nTrigger Monitor\n---------------\n\nWhen the program is executed the provide source folders are being scanned for events and clip files, processed, and\nthen the program exits. Using these parameters it is possible however to start the program before the SD or USB has been\ninserted and have it wait. It can then be set to wait again after first time processing or to stop.\n\n*--monitor*\n\n  Default: False\n\n  Monitor for drive to be attached that has the TeslaCam folder in its root. If not already one attached then wait till\n  one is attached. Once a drive with the TeslaCam folder is attached processing will start based on the source provided.\n  If no source was provided then all events within SavedClips and SentryClips will be processed instead. To have it\n  process all 3 folders then provide the following for source:\n\n  SavedClips SentryClips RecentClips\n\n  After processing the program will wait until the drive has been ejected from the system. Once ejected it will\n  start monitoring again for a drive to be attached. This loop will continue until stopped with CTRL-C.\n\n*--monitor_once*\n\n  Default: False\n\n  This is the same as --monitor however instead of waiting for the drive to be ejected after processing the program\n  will stop.\n\n*--monitor_trigger <File or folder>*\n\n  Monitor for existence of a folder (or file) instead of a drive with TeslaCam folder. Once the file (or folder) exist\n  then processing will start. If source is provided then that will be used for scanning for events and clips. If no\n  source was provided then the path provided for this parameter will be used as source instead. If the provided source\n  is a relative path (i.e. Tesla/MyVideos) then it will be relative based on the location of the trigger file/path.\n\n  Upon completion, if a trigger file was provided then that file will be deleted and the program will wait again\n  until the trigger file exist again. If a trigger folder was provided then the program will wait until this folder\n  has been removed. Then it will start monitoring again for existence for this folder.\n\n\nVideo Layout\n------------\n\nThe layout of the resulting video can be adjusted in many ways through multiple parameters. Parameter --layout\nspecifies where each camera clip should be placed within the resulting video. (see above for examples).\n\n*--layout*\n\n  Default: FULLSCREEN\n\n* FULLSCREEN: Resolution: 1920x960\n\n::\n\n    +---------------+----------------+----------------+\n    |               | Front Camera   |                |\n    +---------------+----------------+----------------+\n    | Left Camera   |  Rear Camera   |  Right Camera  |\n    +---------------+----------------+----------------+\n\nVideo example: https://youtu.be/P5k9PXPGKWQ\n\n\n* WIDESCREEN: Resolution: 1920x1920\n\n::\n\n    +---------------+----------------+----------------+\n    |                 Front Camera                    |\n    +---------------+----------------+----------------+\n    | Left Camera   |  Rear Camera   |  Right Camera  |\n    +---------------+----------------+----------------+\n\nVideo example: https://youtu.be/nPleIhVxyhQ\n\n\n* CROSS: Resolution: 1280x1440\n\n::\n\n    +---------------+----------------+----------------+\n    |               | Front Camera   |                |\n    +---------------+----------------+----------------+\n    |     Left Camera      |       Right Camera       |\n    +---------------+----------------+----------------+\n    |               | Rear Camera    |                |\n    +---------------+----------------+----------------+\n\n\n* DIAMOND: Resolution: 1920x976\n\n::\n\n    +---------------+----------------+----------------+\n    |               |  Front Camera  |                |\n    +---------------+                +----------------+\n    |   Left Camera |----------------| Right Camera   |\n    +               +  Rear Camera   +                +\n    |---------------|                |----------------|\n    +---------------+----------------+----------------+\n\n\n*--perspective*\n\n  Default: False\n\n  Show the side cameras in perspective mode.\n\n\n*--scale*\n\n  This can then be further adjusted by changing the scale for all cameras or changing the scale for one or more making\n  them smaller or bigger then the others. This is done with the --scale parameter. If just provided with a number then\n  scale is multiplied based on that number.\n\n  For example, 0.5 results in 640x480 as standard resolution is 1280x960. Or one can also provide the resolution instead\n  of the scale. For example providing 640x480. Changing the scale can be done for specific cameras as well. This is\n  done by preceding the scale number (or resolution) with camera=<camera> where <camera> can be front, rear, left,\n  or right. One can provide the --scale parameter multiple times.\n\n  For example:\n\n  \\-\\-scale 1 --scale camera=left .25 --scale camera=right 640x480\n\n  results in front and rear camera clips to be of size 1280x960, left camera would be 320x240, and right camera would\n  be 640x480.\n\n\n*--mirror or --rear*\n\n  By default the left, right, and rear cameras are shown as if one is sitting inside the car and looking through the\n  mirrors. However, if the front camera is not included (with option --no-front) then this is changed making it seem\n  as if one is looking backwards and not through a mirror. With option --mirror or --rear one can override the default\n  for this.\n\n  Using --rear you can thus make it so that it is shown as if looking backwards yet still having the front one shown.\n  Same, using --mirror one can make it as if the view is shown through a mirror without showing the front camera.\n\n*--swap or --no-swap*\n\n  Default is to swap left and right cameras (left one is shown on the right in the video and right one is shown on the left)\n  when they are viewed as if looking backwards (see --rear). Using --no-swap this can then be overridden.\n\n\n  Similar, when looking as if through a mirror the default is not to swap left and right cameras. With --swap this can be\n  overridden.\n\n*--swap_frontrear*\n\n  Default: False\n\n  Using this you can swap the front and the rear camera in the layouts. The front camera is normally on top with the rear\n  camera being at the bottom. With this the front camera will be shown at the bottom and the rear on the top.\n\n*--background*\n\n  Default: Black\n\n  Specify the background color for the video. Default is black. See --fontcolor for possible values.\n\nCamera Exclusion\n----------------\n\nBy default the output from all 4 cameras is shown within the merged video if existing. Using these parameters one can\nexclude one or more cameras from the resulting video.\n\n*--no-front*\n\n  Default: False\n\n  Exclude the front camera from the resulting video.\n\n*--no-left*\n\n  Default: False\n\n  Exclude the left camera from the resulting video.\n\n*--no-right*\n\n  Default: False\n\n  Exclude the right camera from the resulting video.\n\n*--no-rear*\n\n  Default: False\n\n  Exclude the rear camera from the resulting video.\n\nTimestamp\n---------\n\nFollowing parameters are to change settings for the timestamp that is being added to the resulting video.\n\n*--no-timestamp*\n\n  Default: False\n\n  Do not display timestamp within the resulting video.\n\n*--halign*\n\n  Default: CENTER\n\n  Determine the horizontal alignment of the timestamp within the resulting video. The default for this normally\n  is to display the timestamp in the center of the video. Exception to this is for DIAMOND layout when excluding\n  left or right camera in which case the horizontal placement of the font is adjusted so that it is still displayed\n  between the front and rear camera. The alignment can be overridden with:\n\n  LEFT: place timestamp to the left of the video\n\n  CENTER: place timestamp in the center of the video\n\n  RIGHT: place timestamp to the right of the video\n\n*--valign*\n\n  Default: BOTTOM\n\n  Set the vertical alignment of the timestamp within the resulting video. Default is at the bottom of the video except\n  for layout DIAMOND where it is in the middle to be placed in the space between the front and rear camera.\n\n  TOP: place timestamp at the top of the video\n\n  MIDDLE: place timestamp in the middle of the video\n\n  BOTTOM: place timestamp at the bottom of the video\n\n*--font <filename>*\n\n  Override the default font for the timestamp. Filename/path provided here has to be a fully qualified filename to the\n  font file (.ttf).\n\n*--fontsize <size>*\n\n  Font size for the timestamp. Default font size is scaled based on the resulting video size, use this to override and\n  provide a fix font size.\n\n*--fontcolor <color*\n\n  Default: white\n\n  The color for the timestamp as a color string or RGB value. More information on how to provide the color can be\n  found here: `https://ffmpeg.org/ffmpeg-utils.html#Color <https://ffmpeg.org/ffmpeg-utils.html#Color>`_\n\n  Some possible values are:\n    white\n\n    yellowgreen\n\n    yellowgreen@0.9\n\n    Red\n\n    0x2E8B57\n\n\nTimestamp Restriction\n---------------------\n\nThe events/clips to be processed and thus be put in the resulting video can be restricted by providing a start and/or\nend timestamp.\n\nThe timestamps provided do not need to match the start or end timestamp of a specific event or specific clip. Video within\nthe clip will be skipped if it falls outside of the timestamp.\n\nBy default the timestamp will be interpreted based on the timezone of the PC the program runs on. This can be\noverridden however.\n\nThe timestamp is to be provided based on the ISO-8601 format (see\n`https://fits.gsfc.nasa.gov/iso-time.html <https://fits.gsfc.nasa.gov/iso-time.html>`_) for description and examples of\nthis format.\n\nIn general, the date is provided in the format YYYY, YYYY-MM, YYYY-MM-DD, YYYY-Wxx, YYYY-ddd\n\nHere are some examples:\n\n  2019 to process restrict video to year 2019.\n\n  2019-09 for September, 2019.\n\n  2019-09-10 or 20190910 for 10th of September, 2019\n\n  2019-W37 (or 2019W37) for week 37 in 2019\n\n  2019-W37-2 (or 2019W372) for Tuesday (day 2) of Week 37 in 2019\n\n  2019-253 (or 2019253) for day 253 in 2019 (which is 10th of September, 2019)\n\nTo identify the time, one can use hh, hh:mm, or hh:mm:ss.\nIf providing both a date and a time then these are seperated using the letter T:\n\n  2019-09-10T11:15:10 for 11:15AM on the 10th of September, 2019.\n\nTimezone for the timestamp can be provided as well.\n  For UTC time add the letter Z to the time: 2019-09-10T11:15:10Z for 11:15AM on the 10th of September, 2019 UTC time.\n\nOne can also use +hh:mm, +hhmm, +hh, -hh:mm, -hhmm, -hh to use a different timezone.\n\n  2019-09-10T11:15:10-0500 is for 11:15AM on the 10th of September, 2019 EST.\n\nFor further guidance on potential values see: https://www.cl.cam.ac.uk/~mgk25/iso-time.html\n\n*--start_timestamp <timestamp>*\n\n  Starting timestamp to include in resulting video. Anything before this timestamp will be skipped (even when inside\n  the clip containing the starting timestamp).\n\n*--end_timestamp <timestamp>*\n\n  Ending timestamp to include in resulting video. Anything after this timestamp will be skipped (even when inside\n  the clip containing the ending timestamp).\n\nEvent offsets\n-------------\n\nThis is to skip forward or stop earlier within an event. The skipping is done for each event (folder) individually.\nFor example, one can set it to skip the 1st 5 minutes of each event by providing the --start_offset 300 (300 seconds = 5 minutes).\nProvided offsets are calculated before any video adjustments such as speeding up, slowing down, or motion only. Offsets\ncan work in combination with the timestamp restriction however the offsets will always be calculated based on the event\nstart and end timestamps. Thus if the start timestamp is set to be 2 minutes into the event, and the offset is set to 5 minutes\nthen the resulting video will start 5 minutes in (and not 7 minutes into the event). If the start timestamp is 3 minutes into\nthe event, and the starting offset is set to 2 minutes then the resulting video will start at 3 minutes in. Same\nmethodology is applied for ending offset and end timestamp.\n\n*--start_offset <offset>*\n\n  Starting offset within the event. <offset> is in seconds.\n\n*--end_offset <offset>*\n\n  Ending offset within the event. <offset> is in seconds.\n\nVideo Output\n------------\n\nThese are additional parameters related to the resulting video creation.\n\n*--output <path/filename>*\n\n  Path/filename for the resulting video. If a filename is provided here and --merge is set then the resulting merged\n  video will be saved with this filename. The event videos will be stored within the same folder.\n\n*--motion_only*\n\n  Default: False\n\n  Resulting video will show fast forwarded video for any portion where there is no or very little motion. This can\n  be especially useful for Sentry events since those are 10-minute events but often only have a few minutes (if that)\n  of useful activity in it that resulted in the event being created.\n\n*--slowdown <speed>*\n\n  Slow the resulting video down by provided multiplier. For example, a <speed> of 2 would mean that the video\n  will be half the speed of normal.\n\n*--speedup <speed>*\n\n  Increase the speed of the resulting video by provided multiplier. For example, a value of 2 means that the video\n  will be going twice the normal speed.\n\n*--chapter_offset <seconds>*\n\n  Sets an offset for the chapter markers in the merged video. By default a chapter marker is set at the start of each\n  event within the merged video. Using this one can set the chapter marker <seconds> before or after the start of the event.\n\n  Providing a negative value here results in the chapter marker being set x number of seconds before the end of the event.\n\n  Providing a positive value results in the chapter marker being set x number of seconds after the start of the event.\n\n*--merge*\n\n  Default: False\n\n  A video file is created for each event (folder) found. When parameter --merge is provided these individual event\n  video files will then be further merged into 1 bigger video file.\n\n*--keep-intermediate*\n\n  Default: False\n\n  Temporary video files are being created during the processing of the events. These temporary video files are the\n  combined camera clips for 1 minute, and thus normally 10 of these video files are created (one for each minute).\n  These files are then deleted once the event is processed and the event video file has been created. Use this\n  parameter to keep these temporary video files instead. Note that depending on the number of events a lot more\n  storage will be required then.\n\nAdvanced Encoding Settings\n--------------------------\n\nThe following parameters are more advanced settings to determine how ffmpeg should encode the videos.\n\n*--gpu or --no-gpu*\n\n  Determine if GPU acceleration should be used or not. On MACs the default is to use GPU acceleration whereas on all\n  other platforms the default is not to use GPU acceleration (this is because the encoder being used on other\n  platforms is depending then on the GPU installed in the PC).\n\n  For Macs, use --no-gpu to disable using the GPU for encoding, note that encoding will use a lot more CPU and will\n  end up being slower.\n\n  For all other platforms, use --gpu to enable GPU encoding. When enabling you will also need to provide the GPU\n  installed within the system (see --gpu_type).\n\n  Note, --gpu option is only available on non-Macs whereas option --no-gpu is only available on Macs!\n\n*--gpu_type*\n\n  All platforms except Macs. Provide the GPU type installed in the system.\n\n    intel: if INTEL GPU is installed\n\n    nvidia: if NVIDIA GPU is installed\n\n    RPi: on Raspberry Pi systems\n\n*--no-faststart*\n\n   Default: False\n\n   By default the ffmpeg flag faststart is set. Doing this will ensure that certain meta data is placed at the start\n   of the resulting video which then improves streaming (i.e. YouTube, WebSites, ...). This parameter is to disable\n   this and thus having the meta data placed at the end of the video file (which is normal default). This can improve\n   performance as video files will not have to be rewritten after processing to put the metadata at the beginning of the\n   file, and it can also prevent issues with video files are located on a network share.\n\n*--quality*\n\n  Default: LOWER\n\n  Set the overall quality for the resulting video. Setting this to a higher value can improve the quality (not guaranteed)\n  but most likely will also result in bigger file sizes. Resulting improvement might not be noticeable.\n\n    Valid values: LOWEST, LOWER, LOW, MEDIUM, HIGH\n\n*--compression*\n\n  Default: medium\n\n  Defines how much time should be spend to compress the resulting video file. Slower speed can result in improved\n  compression of the video file and thus a smaller video size. However it would also result in longer processing time.\n\n    ultrafast will result in least amount of time processing to compress the video file, but largest video size.\n\n    veryslow will result in the smallest video file, but the longest amount of time to create the video file.\n\n  Note that increasing or decreasing compression time will not impact the quality of the resulting video. Just the\n  resulting file size.\n\n    Valid values: ultrafast, superfast,veryfast,faster,fast,medium,slow,slower,veryslow\n\n*--fps <frames>*\n\n  Default: 24\n\n  Set the frames per seconds for the resulting video. Default frames per second for movies and TV shows is 24fps. Tesla\n  cameras are recording and saving at about 33fps. Using default about 9 frames per second are dropped from the resulting\n  video. With this parameter the fps for the resulting video can be adjusted. Set it to 33 to keep the number of frames\n  similar to Tesla's. Setting this value higher would just result in frames being duplicated. For example, setting it to\n  66 would mean that for every second, each frame is duplicated to get from 33fps to 66fps.\n\n*--ffmpeg <executable>*\n\n  For Windows and MacOS an executable is delivered with FFMPEG build-in. When using this executable this parameter\n  can be easily ignored unless one wants to specify a different ffmpeg version then what is delivered.\n\n  On all other platforms (or on Windows and MacOS when not using the executable) ffmpeg has to be downloaded and\n  installed separately. If ffmpeg is within the search path (on most platforms defined through environment variable PATH)\n  then there is also no reason to provide this. If ffmpeg is not within the search path (or one wants to use a different\n  ffmpeg then what is provided in the executable) then one can provide the fully qualified name for the ffmpeg to be used.\n\n*--encoding*\n\n  Default: x264\n\n  Provide the encoding for the resulting video. Default is x264 as today this is still the most common format for\n  video files. One can also encode it in x265 which is the newer video standard. Encoding in x265 results in a smaller\n  video file however certain programs or platforms might not be able to view this yet. Use x264 if providing the\n  video to a wide audience, you can use x265 for private usage and ability to view x265.\n\n    Valid values: x264, x265\n\n*--enc <encoder>*\n\n  ffmpeg uses an encoder to create (encode) the video files. By default the encoder selected is based on platform\n  (Windows, Mac, Linux), GPU acceleration and GPU type, and encoding (x264, x265). With this parameter it is possible\n  to provide a different encoder instead to create the video file. For further information please see the ffmpeg\n  documentation on video encoders. The value provided here will be provided to parameter c:v <encoder>\n\nUpdate Check\n------------\n\nA check to determine if a newer version is available will be performed every time the program is executed. These\nparameters allow you to influence this.\n\n*--check_for_update*\n\n  Check if there is a new update available and then just exit. This allows you to perform the check without processing\n  anything.\n\n*--no-check_for_update*\n\n  Default: False\n\n  Do not perform the check if there is an update available. Not recommended as no checks are performed, but can be\n  used when there is no internet available, slow internet, ...\n\n*--include_test*\n\n  Default: False\n\n  Include test (beta) releases when checking for new updates. If this parameter is provided then it will also include\n  any beta releases. Note that it has to be an actual beta releases within releases. Sometimes the development branch\n  can have releases that have not been released as a test release.\n\n\nArgument (Parameter) file\n-------------------------\n\nA lot of different parameters can be provided, thus to make it easier one can have these parameters within a text file\nand then supply this text file instead of having to enter them each time on the command line. Combination of\nhaving parameters in a text file and supplying it together with additional parameters on the command line is possible\nas well. This thus allows having multiple text files based on different preferences (i.e. layouts, ...) and still\nprovide other parameters (i.e. start_timestamp and end_timestamp) on the command line.\n\nArguments within the text file can all be on one (1) line, on separate lines, or a combination thereof. Use # to identify\ncomments. Everything behind # on a line is then ignored.\nNote, on Windows the argument specifying the parameter file has to be between double quotes (\")\n\nHaving a text file (i.e. my_preference.txt) with the following contents:\n\n.. code:: bash\n\n    --speedup 10 --rear\n    --merge --output /home/me/Tesla\n    --monitor_once SavedClips\n\nAnd then executing tesla_dashcam as follows:\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe \"@my_preference.txt\"\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam @my_preference.txt\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py @my_preference.txt\n\nWould result in the same as if those parameters were provided on the command itself. One can also combine a parameter file with parameters on the command line.\nPreference is given to what occurs first. For example, if providing the following arguments:\n\n.. code:: bash\n\n    --speedup 2 @my_preference.txt\n\nThen the clips will only be sped up two-fold instead of 10-fold as --speedup 2 occurs before --speedup 10 from the parameter file.\nBut with:\n\n.. code:: bash\n\n    @my_preference.txt --speedup 2\n\nthe clips will be sped up ten-fold.\n\nExamples\n--------\n\nTo show help:\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe -h\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam -h\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py -h\n\n\nUsing defaults:\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe c:\\Tesla\\2019-02-27_14-02-03\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py /home/me/Tesla/2019-02-27_14-02-03\n\nUsing defaults but not knowing what to provide for source path. Goal to only process the SavedClips and only do this once.\nStore the resulting video files in c:\\Tesla (Windows) or /Users/me/Desktop/Tesla (MacOS). Delete the files from the\nUSB (or SD) when processed.\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe --monitor_once --delete_source --output c:\\Tesla SavedClips\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam --monitor_once --delete_source --output /Users/me/Desktop/Tesla SavedClips\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py --monitor_once --delete_source --output /home/me/Tesla SavedClips\n\nSpecify video file and location:\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe --output c:\\Tesla\\My_Video_Trip.mp4 c:\\Tesla\\2019-02-27_14-02-03\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam --output /Users/me/Desktop/Tesla/My_Video_Trip.mp4 /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py --output /home/me/Tesla/My_Video_Trip.mp4 /home/me/Tesla/2019-02-27_14-02-03\n\nWithout timestamp:\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe --no-timestamp c:\\Tesla\\2019-02-27_14-02-03\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam --no-timestamp /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py --no-timestamp /home/me/Tesla/2019-02-27_14-02-03\n\nPut timestamp center top in yellowgreen:\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe --fontcolor yellowgreen@0.9 -halign CENTER -valign TOP c:\\Tesla\\2019-02-27_14-02-03\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam --fontcolor yellowgreen@0.9 -halign CENTER -valign TOP /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py --fontcolor yellowgreen@0.9 -halign CENTER -valign TOP /home/me/Tesla/2019-02-27_14-02-03\n\nLayout so front is shown top middle with side cameras below it and font size of 24 (FULLSCREEN):\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe --layout FULLSCREEN --fontsize 24 c:\\Tesla\\2019-02-27_14-02-03\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam --layout FULLSCREEN --fontsize 24 /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py --layout FULLSCREEN --fontsize 24 /home/me/Tesla/2019-02-27_14-02-03\n\nSpecify location of ffmpeg binay (in case ffmpeg is not in path):\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe --ffmpeg c:\\ffmpeg\\ffmpeg.exe c:\\Tesla\\2019-02-27_14-02-03\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam --ffmpeg /Applications/ffmpeg /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py --ffmpeg /home/me/ffmpeg /home/me/Tesla/2019-02-27_14-02-03\n\nLayout of PERSPECTIVE with a different font for timestamp and path for ffmpeg:\n\n* Windows: Note how to specify the path, : and \\ needs to be escaped by putting a \\ in front of them.\n\n.. code:: bash\n\n    tesla_dashcam.exe --layout PERSPECTIVE --ffmpeg c:\\ffmpeg\\ffmpeg.exe --font \"C\\:\\\\Windows\\\\Fonts\\\\Courier New.ttf\" c:\\Tesla\\2019-02-27_14-02-03\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam --layout PERSPECTIVE --ffmpeg /Applications/ffmpeg --font '/Library/Fonts/Courier New.ttf' /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py --layout PERSPECTIVE --ffmpeg /Applications/ffmpeg --font '/usr/share/fonts/truetype/freefont/Courier New.ttf' /home/me/Tesla/2019-02-27_14-02-03\n\nEnable monitoring for the Tesla Dashcam USB (or SD) to be inserted and then process all the files (both RecentClips and SavedClips).\nIncrease speed of resulting videos tenfold and store all videos in folder specified by output.\nDelete the source files afterwards:\n\n\n.. code:: bash\n\n    tesla_dashcam.exe --speed 10 --output c:\\Tesla\\ --monitor .\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam /Users/me/Desktop/Tesla --monitor .\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py /home/me/Desktop/Tesla --monitor .\n\n\nEnable one-time monitoring for the Tesla Dashcam USB (or SD) to be inserted and then process all the files from SavedClips.\nNote that for source we provide the folder name (SavedClips), the complete path will be created by the program.\nSlowdown speed of resulting videos to half, show left/right cameras as if looking backwards, store all videos in folder specified by output.\nAlso create a movie file that has them all merged together.\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe --slowdown 2 --rear --merge --output c:\\Tesla\\ --monitor_once SavedClips\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam --slowdown 2 --rear --merge --output /Users/me/Desktop/Tesla --monitor_once SavedClips\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py --slowdown 2 --rear --merge --output /home/me/Tesla --monitor_once SavedClips\n\nEnable monitoring using a trigger file (or folder) to start processing all the files from SavedClips.\nNote that for source we provide the folder name (SavedClips), the complete path will be created by the program using the\npath of the trigger file (if it is a file) or folder. Videos are stored in folder specified by --output. Videos from all\nthe folders are then merged into 1 folder with name TeslaDashcam followed by timestamp of processing (timestamp is\nadded automatically). Chapter offset is set to be 2 minutes (120 seconds) before the end of the respective folder clips.\n\n* Windows:\n\n.. code:: bash\n\n    tesla_dashcam.exe --merge --chapter_offset -120 --output c:\\Tesla\\TeslaDashcam.mp4 --monitor --monitor_trigger x:\\TeslaCam\\start_processing.txt SavedClips\n\n* Mac:\n\n.. code:: bash\n\n    tesla_dashcam --merge --chapter_offset -120 --output /Users/me/Desktop/Tesla --monitor --monitor_trigger /Users/me/TeslaCam/start_processing.txt SavedClips\n\n* Linux:\n\n.. code:: bash\n\n    python3 tesla_dashcam.py --merge --chapter_offset -120 --output /home/me/Tesla --monitor --monitor_trigger /home/me/TeslaCam/start_processing.txt SavedClips\n\n\nSupport\n-------\n\nThere is no official support nor should there be any expectation for support to be provided. As per license this is\nprovided As-Is.\nHowever, any issues or requests can be reported on `GitHub <https://github.com/ehendrix23/tesla_dashcam/issues>`__ and\nI will do my best (time permitting) to provide support.\n\n\nRelease Notes\n-------------\n\n0.1.4:\n    - Initial Release\n0.1.5:\n    - Fixed: font issue on Windows\n0.1.6:\n    - Changed: Output folder is now optional\n    - Changed: Source is positional argument (in preparation for self-contained executable and drag&drop)\n0.1.7:\n    - New: Added perspective layout (thanks to `lairdb <https://model3ownersclub.com/members/lairdb.16314/>`__ from `model3ownersclub <https://model3ownersclub.com>`__ forums to provide this layout).\n    - New: Added font size option to set the font size for timestamp\n    - New: Added font color option to set the font color for timestamp\n    - New: Added halign option to horizontally align timestamp (left, center, right)\n    - New: Added valign option to vertically align timestamp (top, middle, bottom)\n    - Changed: Perspective is now default layout.\n0.1.8:\n    - New: Added GPU hardware accelerated encoding for Mac and PCs with NVIDIA. On Mac it is enabled by default\n    - New: Added option to have video from side cameras be shown as if one were to look at it through the mirror (option --mirror). This is now the default\n    - New: Added option --rear to show video from side cameras as if one was looking to the rear of the car. This was how it was originally.\n    - New: Added option to swap left and right camera in output. Mostly beneficial in FULLSCREEN with --rear option as it then seems like it is from a rear camera\n    - New: Added option to speedup (--speedup) or slowdown (--slowdown) the video.\n    - New: Added option to provide a different encoder for ffmpeg to use. This is for those more experienced with ffmpeg.\n    - New: Added a default font path for Linux systems\n    - New: Added --version to get the version number\n    - New: Releases will now be bundled in a ZIP file (Windows) or a DMG file (MacOS) with self-contained executables in them. This means Python does not need to be installed anymore (located on github)\n    - New: ffmpeg executable binary for Windows and MacOS added into respective bundle.\n    - Changed: For output (--output) one can now also just specify a folder name. The resulting filename will be based on the name of the folder it is then put in\n    - Changed: If there is only 1 video file for merging then will now just rename intermediate (or copy if --keep-intermediate is set).\n    - Changed: The intermediate files (combining of the 3 cameras into 1 video file per minute) will now be written to the output folder if one provided.\n    - Changed: The intermediate files will be deleted once the complete video file is created. This can be disabled through option --keep-intermediate\n    - Changed: Set FULLSCREEN back as the default layout\n    - Changed: Help output (-h) will show what default value is for each parameter\n    - Changed: Cleaned up help output\n    - Changed: Default path for ffmpeg will be set to same path as tesla_dashcam is located in, if not exist then default will be based that ffmpeg is part of PATH.\n    - Fixed: Now able to handle if a camera file is missing, a black screen will be shown for that duration for the missing file\n    - Fixed: Fixed (I believe) cygwin path for fonts.\n0.1.9:\n    - New: Added scanning of sub-folders clip files. Each folder will be processed and resulting movie file created. This can be disabled through parameter --exclude_subdirs\n    - New: Added option to merge the video files from multiple sub-folders into 1 movie file. Use parameter --merge to enable.\n    - New: Added option to monitor if the USB drive (or SD card) is inserted in the PC and then automatically start processing the files. Use parameter --monitor to enable.\n      Parameter --monitor_once will stop monitoring and exit after 1st time drive was inserted.\n      Parameter --delete_source will delete the source files and folder once the movie file for that folder has been created.\n    - New: Added update checker to determine if there is a newer version, additional arguments to just perform check (--check_for_update), include test releases (--include_test), or disable always checking for updates (--no-check_for_update)\n    - New: ffmpeg is part of the tesla_dashcam executable\n    - New: Desktop notification when processing starts (when using monitor) and when it completes.\n    - New: DockerFile added making it easy to run tesla_dashcam within Docker (jeanfabrice)\n    - New: Time it took to create the video files will now be provided upon completion of processing.\n    - Changed: Formatted output to easily show progress\n    - Fixed: Will now handle it much better if a video file from a camera is corrupt (i.e. zero-byte file).\n    - Fixed: combining clips to movie would not use GPU or provided encoding.\n    - Fixed: Added additional check that video file exist before merging into movie.\n0.1.10:\n    - New: Added scale option to set the scale of the clips and thus resulting video. (--scale)\n    - New: Added option to specify a parameter file using @<filename> where parameters can be located in. (@<filename>)\n    - New: One can now specify multiple sources instead of just 1.\n    - New: Individual file(s) can now be provided as a source as well (only 1 camera filename has to be provided to get all 3)\n    - New: Source is now optional, if not provided then it will be same as --monitor_once with as source SavedClips.\n    - Changed: Timestamp within video will now be used for concatenation of the clips at folder level and all (--merge option) instead of filename. This will ensure that even when crossing timezones the order of the video is still accurate.\n    - Changed: --delete_source will delete source files when specified even when --monitor or --monitor_once is not specified `Issue #28 <https://github.com/ehendrix23/tesla_dashcam/issues/28>`_\n    - Changed: output will default to Videos\\Tesla_Dashcam (Windows) Movies/Tesla_Dashcam (MacOS), or Videos\\Tesla_Dashcam (Linux) if not output folder specified.\n    - Changed: Filename for the folder video files will not have start and end timestamp in local timezone instead of just folder name. `Issue #30 <https://github.com/ehendrix23/tesla_dashcam/issues/30>`_ and `Issue #33 <https://github.com/ehendrix23/tesla_dashcam/issues/33>`_\n    - Changed: Updated release notes for each release better identifying what is new, changed, and fixed.\n    - Fixed: issue where sometimes encoding with GPU would fail by also allowing software based encoding\n    - Fixed: traceback when unable to retrieve latest release from GitHub\n    - Fixed: running tesla_dashcam when installed using pip. `Issue #23 <https://github.com/ehendrix23/tesla_dashcam/issues/23>`_ and `Issue #31 <https://github.com/ehendrix23/tesla_dashcam/issues/31>`_\n    - Fixed: Folder clip would be removed if only 1 set in folder with same name as folder name if keep_intermediate not specified\n    - Fixed: Font issue in Windows (hopefully final fix) `Issue #29 <https://github.com/ehendrix23/tesla_dashcam/issues/29>`_\n    - Fixed: Python version has to be 3.7 or higher due to use of capture_output `Issue #19 <https://github.com/ehendrix23/tesla_dashcam/issues/19>`_\n0.1.11:\n    - Fixed: Traceback when getting ffmpeg path in Linux `Issue #39 <https://github.com/ehendrix23/tesla_dashcam/issues/39>`_\n    - Fixed: Running tesla_dashcam when installed using pip. `Issue #38 <https://github.com/ehendrix23/tesla_dashcam/issues/38>`_\n    - Fixed: Just providing a filename for output would result in traceback.\n    - Fixed: When providing a folder as output it would be possible that the last folder name was stripped potentially resulting in error.\n0.1.12:\n    - New: Added chapter markers in the concatenated movies. Folder ones will have a chapter marker for each intermediate clip, merged one has a chapter marker for each folder.\n    - New: Option --chapter_offset for use with --merge to offset the chapter marker in relation to the folder clip.\n    - New: Added flag -movstart +faststart for video files better suited with browsers etc. (i.e. YouTube). Thanks to sf302 for suggestion.\n    - New: Option to add trigger (--monitor_trigger_file) to use existence of a file/folder/link for starting processing instead of USB/SD being inserted.\n    - Changed: Method for concatenating the clips together has been changed resulting in massive performance improvement (less then 1 second to do concatenation). Big thanks to sf302!\n    - Fixed: Folders will now be deleted if there are 0-byte or corrupt video files within the folder `Issue #40 <https://github.com/ehendrix23/tesla_dashcam/issues/40>`_\n    - Fixed: Providing a filename for --output would create a folder instead and not setting resulting file to filename provided `Issue #52 <https://github.com/ehendrix23/tesla_dashcam/issues/52>`_\n    - Fixed: Thread exception in Windows that ToastNotifier does not have an attribute classAtom (potential fix). `Issue #54 <https://github.com/ehendrix23/tesla_dashcam/issues/54>`_\n    - Fixed: Traceback when invalid output path (none-existing) is provided or when unable to create target folder in given path.\n    - Fixed: Including sub dirs did not work correctly, it would only grab the 1st folder.\n    - Fixed: When using monitor, if . was provided as source then nothing would be processed. Now it will process everything as intended.\n    - Fixed: File created when providing a filename with --output and --monitor option did not put timestamp in filename to ensure unique filenames\n    - Fixed: Argument to get release notes was provided incorrectly when checking for updates. Thank you to demonbane for fixing.\n0.1.13:\n    - New: Support for rear camera (introduced in V10). This also results in layouts having been modified to allow inclusion of rear camera. `Issue #71 <https://github.com/ehendrix23/tesla_dashcam/issues/71>`_\n    - New: Support for hardware encoding for systems with supported Intel GPUs.\n    - New: Support for hardware encoding on Raspberry Pi (RPi) (H.264 only) `Issue #66 <https://github.com/ehendrix23/tesla_dashcam/issues/66>`_\n    - New: Layout CROSS with front camera top centered, side camera underneath it, and rear camera then underneath side cameras centered.\n    - New: Layout DIAMOND with front camera top centered, rear camera under front and side camera centered at the left and right of front&rear.\n    - New: Option --motion_only to fast-forward through the portions in the video that does not have anything motion (done through removal of duplicate frames). Thanks to supRy for providing this\n    - New: Option --skip_existing to skip creation of video files that already exist. Existence only is checked, not if layout etc are the same.\n    - New: Option --perspective for showing side cameras to be displayed in perspective mode irrespective of layout. Layout PERSPECTIVE is thus same as layout FULLSCREEN with --perspective option.\n    - New: Options --start_offset and --end_offset can be used to provide starting and ending offset in seconds for resulting video (at folder level).\n    - New: Options --start_timestamp and --end_timestamp can be used to restrict resulting video (and processing) to specific timestamps. This can be used in combination with --start_offset and/or --end_offset\n    - New: Options --no-front, --no-left, --no-right, and --no-rear to exclude camera(s) from the videos\n    - New: Option --gpu_type to provide GPU installed in the system for Windows/Linux. Current supported options are nvidia, intel, and RPi.\n    - New: Option  --no-faststart for not setting the faststart flag in the video files as doing this can result in encoding failures on network shares `Issue #62 <https://github.com/ehendrix23/tesla_dashcam/issues/62>`_\n    - New: Option --temp_dir to provide a different path to store the temporary video files that are created `Issue #67 <https://github.com/ehendrix23/tesla_dashcam/issues/67>`_\n    - New: Description metadata to include video was created by tesla_dashcam with version number.\n    - Changed: WIDESCREEN layout will now by default show the front camera on top with higher resolution compared to others due to incorporation of rear camera\n    - Changed: Include folder SentryClips in default source list if no source provided (SavedClips was already default).\n    - Changed: Check to ensure that Python version is at required level or higher (currently 3.7).\n    - Changed: Existence of font file (provided or default) will be checked and error returned if not existing.\n    - Changed: Existence of ffmpeg will be checked and error returned if not existing.\n    - Changed: If no filename provided for merged video then current date/time will be used for filename.\n    - Fixed: Merge of videos fails when a relative path instead of an absolute path is provided for --output `Issue #62 <https://github.com/ehendrix23/tesla_dashcam/issues/62>`_\n    - Fixed: Issue during processing of metadata if files were missing\n    - Fixed: Hidden files (files starting with period) on Mac/Linux were not ignored. This could cause issues as some programs might create these files when viewing the video.\n0.1.14:\n    - Fixed: Checking if font path exist in Windows failed.\n0.1.15:\n    - Changed: Reduced sensitivity for motion detection\n    - Changed: Minor improvement for font path checking, mainly message provided.\n    - Fixed: Rear view camera filename was changed from -rear_view to -back in TeslaCam folders. `Issue #78 <https://github.com/ehendrix23/tesla_dashcam/issues/78>`_\n    - Fixed: Missing python-dateutil package when installing from PIP `Issue #77 <https://github.com/ehendrix23/tesla_dashcam/issues/77>`_\n    - Fixed: Missing fonts in Docker Image (thanks to moorecp for providing fix)\n    - Fixed: Only the 1st source was processed When using MONITOR or MONITOR_ONCE, or with V10 only SavedClips was processed when not providing a source\n0.1.16:\n    - New: Option --scale now accepts value of camera=<front, rear, left, right>. to set the scale of for each camera individually (value of 1 is 1280x960 for the clip)\n    - New: Option --swap_frontrear to swap front&rear cameras in output.\n    - New: Option --background to specify background color (default is black).\n    - New: Option --fps to set the frame rate for resulting video. Default is set to 24 (Tesla records at about 33 fps). `Issue #85 <https://github.com/ehendrix23/tesla_dashcam/issues/85>`_\n    - New: Parameter file (provided using @) can now include comments (specify using #)\n    - New: Option --loglevel to allow for debug information to be printed.\n    - Changed: --speedup and --slowdown now accepts a float allowing for example to speed video up by 1.5\n    - Changed: Option --scale also accept fixed resolution (i.e. 640x480) for the clip.\n    - Changed: View of rear camera will be mirrored as well if side cameras are shown as mirror\n    - Changed: For all layouts default is to show mirror for rear&side if front camera is shown, otherwise show as rear viewing.\n    - Changed: Swap left&right cameras when showing rear&side as rear viewing, and not to swap them when showing rear&side as mirror view.\n    - Changed: Re-organized help (-h) for all parameters by grouping them.\n    - Changed: Added message to install fonts using apt-get install ttf-freefont on Linux if font file is not found.\n    - Changed: Only execute if we're main allowing to be imported into other scripts. `Issue #94 <https://github.com/ehendrix23/tesla_dashcam/issues/94>`_\n    - Changed: Cleaned-up this README file to provide better information.\n    - Fixed: Providing paths with spaces did not work in parameter files even although it worked from command line. `Issue #89 <https://github.com/ehendrix23/tesla_dashcam/issues/89>`_\n    - Fixed: Changed Arial font on MacOS to Arial Unicode (from Arial) as it seems Arial is not available anymore on MacOS 10.15 (Catalina). `Issue #64 <https://github.com/ehendrix23/tesla_dashcam/issues/64>`_\n    - Fixed: Incorrect encoder for x265 with Intel GPU hardware encoding - mbaileys\n\nTODO\n----\n\n* Implement option to crop individual camera output\n* Option for end-user layout\n* Monitor path for new folders/files as trigger option\n* Provide option to copy or move from source to output folder before starting to process\n* Develop method to run as a service with --monitor option\n* GUI Front-end\n* Support drag&drop of video folder (supported in Windows now, MacOS not yet)\n* Add object detection (i.e. people) and possible output when object was detected\n* Saving of options\n* Use timestamp in video to ensure full synchronization between the 4 cameras\n* Add option for source/output to be S3 bucket (with temp folder for creating temporary files)\n* Develop Web Front-End\n* Develop method to have run in AWS, allowing user to upload video files and interact using Web Front-End\n\n\n\n", "description_content_type": "text/x-rst", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/ehendrix23/tesla_dashcam", "keywords": "", "license": "Apache License 2.0", "maintainer": "", "maintainer_email": "", "name": "tesla-dashcam", "package_url": "https://pypi.org/project/tesla-dashcam/", "platform": "", "project_url": "https://pypi.org/project/tesla-dashcam/", "project_urls": {"Homepage": "https://github.com/ehendrix23/tesla_dashcam"}, "release_url": "https://pypi.org/project/tesla-dashcam/0.1.16/", "requires_dist": ["tzlocal", "requests", "psutil", "python-dateutil"], "requires_python": ">=3.7.0", "summary": "Python program to merge video files created by Tesla dashcam", "version": "0.1.16", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>Python program that provides an easy method to merge saved Tesla Dashcam footage into a single video.</p>\n<p>When saving Tesla Dashcam footage a folder is created on the USB drive for each event and within it multiple MP4 video files are\ncreated. Currently the dashcam leverages four (4) cameras (front, rear, left repeater, and right repeater) and will create a\nfile for each of them. Every minute is stored into a separate file as well. This means that when saving dashcam footage\nthere is a total of 40 files video files for every 10 minutes, each event of 10 minutes is put into a separate folder.</p>\n<p>Using this program, one can combine the 40 video files of an event into one (1), and combine video of multiple events together.\nThe layout of the four (4) different cameras within the resulting video can be determined by choosing one of the available layouts.</p>\n<p>This program has multiple options providing a high level of flexibility on the videos to process, cameras to include,\nlayout of the resulting videos, location, format, encoding, …. See usage section below to read upon all the possibilities.</p>\n<p><strong>Video Input</strong> provides options related to the source videos.</p>\n<p><em>Trigger Monitor</em> is to have processing of videos not start upon execution of the program but instead be based on a trigger\n(i.e. inserting the USB/SD card in the PC).</p>\n<p><strong>Video Layout</strong> provides parameters to define what the resulting video should look like. There are 4 different layouts to\nchoose from. This can then be further adjusted by having the left/right cameras be in perspective or not. Swap left/right\nor front/rear cameras, change the scale for all cameras and/or for certain cameras, make left/right/rear seem as if you\nwere watching it through a mirror, or as if you turn your head around and looking backwards.</p>\n<p><strong>Camera Exclusion</strong> exclude certain cameras from the resulting video.</p>\n<p><strong>Timestamp</strong> options allow you to define what the timestamp in the resulting video should look like, or just to not have\nit display at all.</p>\n<p><strong>Timestamp Restriction</strong> provides with the possibility to only create a video of the portion that are important. Instead\nof uploading a video where the first 5 minutes is nothing, specify the start and end timestamps to shorten the video\nto the important section instead.</p>\n<p><strong>Event offsets</strong> allows you to skip a portion from the start (and/or the end) for each event.</p>\n<p><strong>Video Output</strong> then further defines what the output should look like. Fast-forward through the Sentry video where nothing\nis happening, speed up or slow down the video, …</p>\n<p><strong>Advanced encoding settings</strong> allows you to further define additional encoding settings</p>\n<p>And <strong>Update Check</strong> will make sure you always have the latest version available.</p>\n<p>Check out the Usage section of this README to get more information on all available parameters and what each does.</p>\n<div id=\"binaries\">\n<h2>Binaries</h2>\n<p>Stand-alone binaries can be retrieved from:</p>\n<ul>\n<li>Windows: <a href=\"https://github.com/ehendrix23/tesla_dashcam/releases/latest/download/tesla_dashcam.zip\" rel=\"nofollow\">https://github.com/ehendrix23/tesla_dashcam/releases/latest/download/tesla_dashcam.zip</a></li>\n<li>MacOS (OSX): <a href=\"https://github.com/ehendrix23/tesla_dashcam/releases/latest/download/tesla_dashcam.dmg\" rel=\"nofollow\">https://github.com/ehendrix23/tesla_dashcam/releases/latest/download/tesla_dashcam.dmg</a></li>\n</ul>\n<p><a href=\"https://www.ffmpeg.org/legal.html\" rel=\"nofollow\">ffmpeg</a> is included within the respective package.\nffmpeg is a separately licensed product under the <a href=\"http://www.gnu.org/licenses/old-licenses/lgpl-2.1.html\" rel=\"nofollow\">GNU Lesser General Public License (LGPL) version 2.1 or later</a>.\nFFmpeg incorporates several optional parts and optimizations that are covered by the GNU General Public License (GPL) version 2 or later. If those parts get used the GPL applies to all of FFmpeg.\nFor more information on ffmpeg license please see: <a href=\"https://www.ffmpeg.org/legal.html\" rel=\"nofollow\">https://www.ffmpeg.org/legal.html</a></p>\n<p>Windows binary of ffmpeg was downloaded from: <a href=\"https://ffmpeg.zeranoe.com/builds/\" rel=\"nofollow\">https://ffmpeg.zeranoe.com/builds/</a></p>\n<p>MacOS binary of ffmpeg was downloaded from: <a href=\"https://evermeet.cx/ffmpeg/\" rel=\"nofollow\">https://evermeet.cx/ffmpeg/</a></p>\n</div>\n<div id=\"notes\">\n<h2>Notes</h2>\n<p>The video files for the same minute between the 4 cameras are not always the same length. If there is a difference in\ntheir duration then the background color (black by default) will be shown for the camera which video ended before the\nothers (within the minute).\nIt is thus possible within a video to see the background color for one of the cameras, and then when that minute has passed\nfor it to show video again.</p>\n<p>The date and time shown within the video comes from the timestamp embedded in the saved videos themselves, not from the\nfilename. Date and time shown within resulting videos is converted to timezone set upon the PC it is being run on.</p>\n</div>\n<div id=\"requirements\">\n<h2>Requirements</h2>\n<p>This package relies on <a href=\"https://ffmpeg.org\" rel=\"nofollow\">ffmpeg</a> to be installed, this is a free, open source cross-platform\nsolution to convert video. The created executables for Windows and MacOS include an ffmpeg version.</p>\n<p>If not using the executables (Windows and MacOS) then <a href=\"https://www.python.org\" rel=\"nofollow\">Python</a> 3.7 or higher is required.</p>\n</div>\n<div id=\"installation\">\n<h2>Installation</h2>\n<p>Downloading the respective bundle (ZIP for Windows, DMG for MacOS) and unpacking this in a location of your choosing is\nsufficient to install this.</p>\n<p>If downloading the source files (i.e. for Linux) then Python has to be installed as well. I recommend in that case to\ninstall the package from pypi using pip to ensure all package requirements (except for ffmpeg) are met.</p>\n<p>This package is available from <a href=\"https://pypi.org/project/tesla-dashcam/\" rel=\"nofollow\">pypi</a>.</p>\n<p>Install from pypi is done through:</p>\n<pre>python3 -m pip install tesla_dashcam\n</pre>\n</div>\n<div id=\"usage\">\n<h2>Usage</h2>\n<pre>usage: tesla_dashcam.py <span class=\"o\">[</span>-h<span class=\"o\">]</span> <span class=\"o\">[</span>--version<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--loglevel <span class=\"o\">{</span>DEBUG,INFO,WARNING,ERROR,CRITICAL<span class=\"o\">}]</span>\n                        <span class=\"o\">[</span>--temp_dir TEMP_DIR<span class=\"o\">]</span> <span class=\"o\">[</span>--no-notification<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--skip_existing<span class=\"o\">]</span> <span class=\"o\">[</span>--delete_source<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--exclude_subdirs<span class=\"o\">]</span> <span class=\"o\">[</span>--monitor<span class=\"o\">]</span> <span class=\"o\">[</span>--monitor_once<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--monitor_trigger MONITOR_TRIGGER<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--layout <span class=\"o\">{</span>WIDESCREEN,FULLSCREEN,PERSPECTIVE,CROSS,DIAMOND<span class=\"o\">}]</span>\n                        <span class=\"o\">[</span>--perspective<span class=\"o\">]</span> <span class=\"o\">[</span>--scale CLIP_SCALE <span class=\"o\">[</span>CLIP_SCALE ...<span class=\"o\">]]</span>\n                        <span class=\"o\">[</span>--mirror<span class=\"o\">]</span> <span class=\"o\">[</span>--rear<span class=\"o\">]</span> <span class=\"o\">[</span>--swap<span class=\"o\">]</span> <span class=\"o\">[</span>--no-swap<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--swap_frontrear<span class=\"o\">]</span> <span class=\"o\">[</span>--background BACKGROUND<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--no-front<span class=\"o\">]</span> <span class=\"o\">[</span>--no-left<span class=\"o\">]</span> <span class=\"o\">[</span>--no-right<span class=\"o\">]</span> <span class=\"o\">[</span>--no-rear<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--no-timestamp<span class=\"o\">]</span> <span class=\"o\">[</span>--halign <span class=\"o\">{</span>LEFT,CENTER,RIGHT<span class=\"o\">}]</span>\n                        <span class=\"o\">[</span>--valign <span class=\"o\">{</span>TOP,MIDDLE,BOTTOM<span class=\"o\">}]</span> <span class=\"o\">[</span>--font FONT<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--fontsize FONTSIZE<span class=\"o\">]</span> <span class=\"o\">[</span>--fontcolor FONTCOLOR<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--start_timestamp START_TIMESTAMP<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--end_timestamp END_TIMESTAMP<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--start_offset START_OFFSET<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--end_offset END_OFFSET<span class=\"o\">]</span> <span class=\"o\">[</span>--output OUTPUT<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--motion_only<span class=\"o\">]</span> <span class=\"o\">[</span>--slowdown SLOW_DOWN<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--speedup SPEED_UP<span class=\"o\">]</span> <span class=\"o\">[</span>--chapter_offset CHAPTER_OFFSET<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--merge<span class=\"o\">]</span> <span class=\"o\">[</span>--keep-intermediate<span class=\"o\">]</span> <span class=\"o\">[</span>--no-gpu<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--no-faststart<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--quality <span class=\"o\">{</span>LOWEST,LOWER,LOW,MEDIUM,HIGH<span class=\"o\">}]</span>\n                        <span class=\"o\">[</span>--compression <span class=\"o\">{</span>ultrafast,superfast,veryfast,faster,fast,medium,slow,slower,veryslow<span class=\"o\">}]</span>\n                        <span class=\"o\">[</span>--fps FPS<span class=\"o\">]</span> <span class=\"o\">[</span>--ffmpeg FFMPEG<span class=\"o\">]</span> <span class=\"o\">[</span>--encoding <span class=\"o\">{</span>x264,x265<span class=\"o\">}]</span>\n                        <span class=\"o\">[</span>--enc ENC<span class=\"o\">]</span> <span class=\"o\">[</span>--check_for_update<span class=\"o\">]</span>\n                        <span class=\"o\">[</span>--no-check_for_update<span class=\"o\">]</span> <span class=\"o\">[</span>--include_test<span class=\"o\">]</span>\n                        <span class=\"o\">[</span><span class=\"nb\">source</span> <span class=\"o\">[</span><span class=\"nb\">source</span> ...<span class=\"o\">]]</span>\n\ntesla_dashcam - Tesla DashCam <span class=\"p\">&amp;</span> Sentry Video Creator\n\npositional arguments:\n  <span class=\"nb\">source</span>                Folder<span class=\"o\">(</span>s<span class=\"o\">)</span> <span class=\"o\">(</span>events<span class=\"o\">)</span> containing the saved camera files.\n                        Filenames can be provided as well to manage individual\n                        clips. <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n\noptional arguments:\n  -h, --help            show this <span class=\"nb\">help</span> message and <span class=\"nb\">exit</span>\n  --version             show program<span class=\"s1\">''</span>s version number and <span class=\"nb\">exit</span>\n  --loglevel <span class=\"o\">{</span>DEBUG,INFO,WARNING,ERROR,CRITICAL<span class=\"o\">}</span>\n                        Logging level. <span class=\"o\">(</span>default: INFO<span class=\"o\">)</span>\n  --temp_dir TEMP_DIR   Path to store temporary files. <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --no-notification     Do not create a notification upon completion.\n                        <span class=\"o\">(</span>default: True<span class=\"o\">)</span>\n\nVideo Input:\n  Options related to what clips and events to process.\n\n  --skip_existing       Skip creating encoded video file <span class=\"k\">if</span> it already exist.\n                        Note that only existence is checked, not <span class=\"k\">if</span> layout\n                        etc. are the same. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --delete_source       Delete the processed files upon completion. <span class=\"o\">(</span>default:\n                        False<span class=\"o\">)</span>\n  --exclude_subdirs     Do not search sub folders <span class=\"o\">(</span>events<span class=\"o\">)</span> <span class=\"k\">for</span> video files to\n                        process. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n\nTrigger Monitor:\n  Parameters <span class=\"k\">for</span> monitoring of insertion of TeslaCam drive, folder, or file\n  existence.\n\n  --monitor             Enable monitoring <span class=\"k\">for</span> drive to be attached with\n                        TeslaCam folder. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --monitor_once        Enable monitoring and <span class=\"nb\">exit</span> once drive with TeslaCam\n                        folder has been attached and files processed.\n                        <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --monitor_trigger MONITOR_TRIGGER\n                        Trigger file to look <span class=\"k\">for</span> instead of waiting <span class=\"k\">for</span> drive\n                        to be attached. Once file is discovered <span class=\"k\">then</span>\n                        processing will start, file will be deleted when\n                        processing has been completed. If <span class=\"nb\">source</span> is not\n                        provided <span class=\"k\">then</span> folder where file is located will be\n                        used as source. <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n\nVideo Layout:\n  Set what the layout of the resulting video should be\n\n  --layout <span class=\"o\">{</span>WIDESCREEN,FULLSCREEN,PERSPECTIVE,CROSS,DIAMOND<span class=\"o\">}</span>\n                        Layout of the created video.\n                            FULLSCREEN: Front camera center top, side cameras underneath it with rear camera between side camera.\n                            WIDESCREEN: Front camera on top with side and rear cameras smaller underneath it.\n                            PERSPECTIVE: Similar to FULLSCREEN but <span class=\"k\">then</span> with side cameras in perspective.\n                            CROSS: Front camera center top, side cameras underneath, and rear camera center bottom.\n                            DIAMOND: Front camera center top, side cameras below front camera left and right of front, and rear camera center bottom.\n                         <span class=\"o\">(</span>default: FULLSCREEN<span class=\"o\">)</span>\n  --perspective         Show side cameras in perspective. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --scale CLIP_SCALE <span class=\"o\">[</span>CLIP_SCALE ...<span class=\"o\">]</span>\n                        Set camera clip scale <span class=\"k\">for</span> all clips, scale of <span class=\"m\">1</span> is 1280x960 camera clip.\n                        If provided with value <span class=\"k\">then</span> it is default <span class=\"k\">for</span> all cameras, to <span class=\"nb\">set</span> the scale <span class=\"k\">for</span> a specific camera provide <span class=\"nv\">camera</span><span class=\"o\">=</span>&lt;front, left, right,rear&gt; &lt;scale&gt;\n                        <span class=\"k\">for</span> example:\n                          --scale <span class=\"m\">0</span>.5                                             all are 640x480\n                          --scale 640x480                                         all are 640x480\n                          --scale <span class=\"m\">0</span>.5 --scale <span class=\"nv\">camera</span><span class=\"o\">=</span>front <span class=\"m\">1</span>                      all are 640x480 except front at 1280x960\n                          --scale <span class=\"nv\">camera</span><span class=\"o\">=</span>left .25 --scale <span class=\"nv\">camera</span><span class=\"o\">=</span>right 320x240    left and right are <span class=\"nb\">set</span> to 320x240\n                        Defaults:\n                            WIDESCREEN: <span class=\"m\">1</span>/2 <span class=\"o\">(</span>front 1280x960, others 640x480, video is 1920x1920<span class=\"o\">)</span>\n                            FULLSCREEN: <span class=\"m\">1</span>/2 <span class=\"o\">(</span>640x480, video is 1920x960<span class=\"o\">)</span>\n                            CROSS: <span class=\"m\">1</span>/2 <span class=\"o\">(</span>640x480, video is 1280x1440<span class=\"o\">)</span>\n                            DIAMOND: <span class=\"m\">1</span>/2 <span class=\"o\">(</span>640x480, video is 1920x976<span class=\"o\">)</span>\n                         <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --mirror              Video from side and rear cameras as <span class=\"k\">if</span> being viewed\n                        through the mirror. Default when not providing\n                        parameter --no-front. Cannot be used in combination\n                        with --rear. <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --rear                Video from side and rear cameras as <span class=\"k\">if</span> looking\n                        backwards. Default when providing parameter --no-\n                        front. Cannot be used in combination with --mirror.\n                        <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --swap                Swap left and right cameras in output, default when\n                        side and rear cameras are as <span class=\"k\">if</span> looking backwards. See\n                        --rear parameter. <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --no-swap             Do not swap left and right cameras, default when side\n                        and rear cameras are as <span class=\"k\">if</span> looking through a mirror.\n                        Also see --mirror parameter <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --swap_frontrear      Swap front and rear cameras in output. <span class=\"o\">(</span>default:\n                        False<span class=\"o\">)</span>\n  --background BACKGROUND\n                        Background color <span class=\"k\">for</span> video. Can be a color string or\n                        RGB value. Also see --fontcolor. <span class=\"o\">(</span>default: black<span class=\"o\">)</span>\n\nCamera Exclusion:\n  Exclude one or more cameras:\n\n  --no-front            Exclude front camera from video. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --no-left             Exclude left camera from video. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --no-right            Exclude right camera from video. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --no-rear             Exclude rear camera from video. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n\nTimestamp:\n  Options on how to show date/time in resulting video:\n\n  --no-timestamp        Do not show timestamp in video <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --halign <span class=\"o\">{</span>LEFT,CENTER,RIGHT<span class=\"o\">}</span>\n                        Horizontal alignment <span class=\"k\">for</span> timestamp <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --valign <span class=\"o\">{</span>TOP,MIDDLE,BOTTOM<span class=\"o\">}</span>\n                        Vertical Alignment <span class=\"k\">for</span> timestamp <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --font FONT           Fully qualified filename <span class=\"o\">(</span>.ttf<span class=\"o\">)</span> to the font to be\n                        chosen <span class=\"k\">for</span> timestamp. <span class=\"o\">(</span>default: /Library/Fonts/Arial\n                        Unicode.ttf<span class=\"o\">)</span>\n  --fontsize FONTSIZE   Font size <span class=\"k\">for</span> timestamp. Default is scaled based on\n                        resulting video size. <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --fontcolor FONTCOLOR\n                        Font color <span class=\"k\">for</span> timestamp. Any color is accepted as a color string or RGB value.\n                        Some potential values are:\n                            white\n                            yellowgreen\n                            yellowgreen@0.9\n                            Red\n                        :    0x2E8B57\n                        For more information on this see ffmpeg documentation <span class=\"k\">for</span> color: https://ffmpeg.org/ffmpeg-utils.html#Color <span class=\"o\">(</span>default: white<span class=\"o\">)</span>\n\nTimestamp Restriction:\n  Restrict video to be between start and/or end timestamps. Timestamp to be\n  provided in a ISO-8601 format <span class=\"o\">(</span>see https://fits.gsfc.nasa.gov/iso-\n  time.html <span class=\"k\">for</span> examples<span class=\"o\">)</span>\n\n  --start_timestamp START_TIMESTAMP\n                        Starting timestamp <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --end_timestamp END_TIMESTAMP\n                        Ending timestamp <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n\nEvent offsets:\n  Start and/or end offsets <span class=\"k\">for</span> events\n\n  --start_offset START_OFFSET\n                        Skip x number of seconds from start of event <span class=\"k\">for</span>\n                        resulting video. <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n  --end_offset END_OFFSET\n                        Ignore the last x seconds of the event <span class=\"k\">for</span> resulting\n                        video <span class=\"o\">(</span>default: None<span class=\"o\">)</span>\n\nVideo Output:\n  Options related to resulting video creation.\n\n  --output OUTPUT       Path/Filename <span class=\"k\">for</span> the new movie file. Event files will be stored in same folder.\n                         <span class=\"o\">(</span>default: /Users/ehendrix/Movies/Tesla_Dashcam/<span class=\"o\">)</span>\n  --motion_only         Fast-forward through video when there is no motion.\n                        <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --slowdown SLOW_DOWN  Slow down video output. Accepts a number that is <span class=\"k\">then</span>\n                        used as multiplier, providing <span class=\"m\">2</span> means half the speed.\n  --speedup SPEED_UP    Speed up the video. Accepts a number that is <span class=\"k\">then</span> used\n                        as a multiplier, providing <span class=\"m\">2</span> means twice the speed.\n  --chapter_offset CHAPTER_OFFSET\n                        Offset in seconds <span class=\"k\">for</span> chapters in merged video.\n                        Negative offset is <span class=\"c1\"># of seconds before the end of the\n</span>                        subdir video, positive offset <span class=\"k\">if</span> <span class=\"c1\"># of seconds after\n</span>                        the start of the subdir video. <span class=\"o\">(</span>default: <span class=\"m\">0</span><span class=\"o\">)</span>\n  --merge               Merge the video files from different folders <span class=\"o\">(</span>events<span class=\"o\">)</span>\n                        into <span class=\"m\">1</span> big video file. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --keep-intermediate   Do not remove the clip video files that are created\n                        <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n\nAdvanced encoding settings:\n  Advanced options <span class=\"k\">for</span> encoding\n\n  --no-gpu <span class=\"o\">(</span>Mac<span class=\"o\">)</span><span class=\"p\">|</span>--gpu <span class=\"o\">(</span>Non-Mac Only<span class=\"o\">)</span>\n                        Use GPU acceleration, only <span class=\"nb\">enable</span> <span class=\"k\">if</span> supported by hardware.\n                         MAC: All MACs with Haswell CPU or later support this <span class=\"o\">(</span>Macs after <span class=\"m\">2013</span><span class=\"o\">)</span>.\n                              See following link as well:\n                                 https://en.wikipedia.org/wiki/List_of_Macintosh_models_grouped_by_CPU_type#Haswell\n                         <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n\n  --gpu_type <span class=\"o\">{</span>nvidia,intel,RPi<span class=\"o\">}</span> <span class=\"o\">(</span>Non-Mac only<span class=\"o\">)</span>\n                        Type of graphics card <span class=\"o\">(</span>GPU<span class=\"o\">)</span> in the system. This\n                        determines the encoder that will be used.This\n                        parameter is mandatory <span class=\"k\">if</span> --gpu is provided. <span class=\"o\">(</span>default:\n                        None<span class=\"o\">)</span>\n\n  --no-faststart        Do not <span class=\"nb\">enable</span> flag faststart on the resulting video\n                        files. Use this when using a network share and errors\n                        occur during encoding. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --quality <span class=\"o\">{</span>LOWEST,LOWER,LOW,MEDIUM,HIGH<span class=\"o\">}</span>\n                        Define the quality setting <span class=\"k\">for</span> the video, higher\n                        quality means bigger file size but might not be\n                        noticeable. <span class=\"o\">(</span>default: LOWER<span class=\"o\">)</span>\n  --compression <span class=\"o\">{</span>ultrafast,superfast,veryfast,faster,fast,medium,slow,slower,veryslow<span class=\"o\">}</span>\n                        Speed to optimize video. Faster speed results in a\n                        bigger file. This does not impact the quality of the\n                        video, just how much <span class=\"nb\">time</span> is used to compress it.\n                        <span class=\"o\">(</span>default: medium<span class=\"o\">)</span>\n  --fps FPS             Frames per second <span class=\"k\">for</span> resulting video. Tesla records\n                        at about 33fps hence going higher wouldn<span class=\"err\">'</span>t <span class=\"k\">do</span> much as\n                        frames would just be duplicated. Default is 24fps\n                        which is the standard <span class=\"k\">for</span> movies and TV shows\n                        <span class=\"o\">(</span>default: <span class=\"m\">24</span><span class=\"o\">)</span>\n  --ffmpeg FFMPEG       Path and filename <span class=\"k\">for</span> ffmpeg. Specify <span class=\"k\">if</span> ffmpeg is not\n                        within path. <span class=\"o\">(</span>default: /Users/ehendrix/Documents_local\n                        /GitHub/tesla_dashcam/tesla_dashcam/ffmpeg<span class=\"o\">)</span>\n  --encoding <span class=\"o\">{</span>x264,x265<span class=\"o\">}</span>\n                        Encoding to use <span class=\"k\">for</span> video creation.\n                            x264: standard encoding, can be viewed on most devices but results in bigger file.\n                            x265: newer encoding standard but not all devices support this yet.\n  --enc ENC             Provide a custom encoder <span class=\"k\">for</span> video creation. Cannot be used in combination with --encoding.\n                        Note: when using this option the --gpu option is ignored. To use GPU hardware acceleration specify an encoding that provides this.\n\nUpdate Check:\n  Check <span class=\"k\">for</span> updates\n\n  --check_for_update    Check <span class=\"k\">for</span> update and exit. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --no-check_for_update\n                        A check <span class=\"k\">for</span> new updates is performed every time. With\n                        this parameter that can be disabled <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n  --include_test        Include <span class=\"nb\">test</span> <span class=\"o\">(</span>beta<span class=\"o\">)</span> releases when checking <span class=\"k\">for</span>\n                        updates. <span class=\"o\">(</span>default: False<span class=\"o\">)</span>\n</pre>\n</div>\n<div id=\"positional-argument\">\n<h2>Positional Argument</h2>\n<p>Source does not have a specific parameter. Just provide the folder(s) to be scanned and processed. One can provide\nfolder(s) and/or file(s) here. Source is not mandatory, if not provided then the default will be SavedClips and SentryClips.\nThe path searches for SavedClips and SentryClips will depend if there was a Trigger Monitor parameter provided or not.\nIf source is not provided and no Trigger Monitor provided then –monitor_once will be enabled with SavedClips and SentryClips.</p>\n</div>\n<div id=\"optional-arguments\">\n<h2>Optional Arguments</h2>\n<p>These are some other optional arguments that don’t change in what will be processed, how, layout, resulting video file\nor so.</p>\n<p><em>-h or –help</em></p>\n<blockquote>\nShow the help message and exit.</blockquote>\n<p><em>–version</em></p>\n<blockquote>\nShow the version number of the program and exit.</blockquote>\n<p><em>–loglevel &lt;level&gt;</em></p>\n<blockquote>\nLog level for additional output. Currently only used for DEBUG, providing any other value will not change anything.</blockquote>\n<p><em>–temp_dir &lt;path&gt;</em></p>\n<blockquote>\nTemporary path to store the temporary (intermediate) clip video files. When processing a temporary video file is\ncreated for each minute within an event folder combining the different cameras together. Then these temporary video\nfiles are merged together to produce the resulting event video file. By default the temporary clip video files will\nbe stored in the same folder as specified where the resulting video file will be stored. Using this parameter one\ncan thus specify another folder instead. Can be especially helpful when the resulting videos are being stored on\na network share as one can then specify a local drive that would be faster for the temporary files.</blockquote>\n<p><em>–no-notification</em></p>\n<blockquote>\nUpon completion a notification is provided on the screen that processing is completed. Use this parameter to\ndisable this notification.</blockquote>\n</div>\n<div id=\"video-input\">\n<h2>Video Input</h2>\n<p>Following options are to manage what should be processed and what to do once processed.</p>\n<p><em>–skip_existing</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>By default if a resulting video files already exist then it will be overwritten (except with –monitor). By providing this\nparameter if the resulting video file already exist then it will not be recreated. Note that this only checks for existence\nof the video file and not if the layout etc. of that video file matches current selection.</p>\n</blockquote>\n<p><em>–delete_source</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Delete the clips (files) and events (folders) on the source once processing has been completed.</p>\n</blockquote>\n<p><em>–exclude_subdirs</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Do not scan any subfolders within the source provided for valid clips.</p>\n</blockquote>\n</div>\n<div id=\"trigger-monitor\">\n<h2>Trigger Monitor</h2>\n<p>When the program is executed the provide source folders are being scanned for events and clip files, processed, and\nthen the program exits. Using these parameters it is possible however to start the program before the SD or USB has been\ninserted and have it wait. It can then be set to wait again after first time processing or to stop.</p>\n<p><em>–monitor</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Monitor for drive to be attached that has the TeslaCam folder in its root. If not already one attached then wait till\none is attached. Once a drive with the TeslaCam folder is attached processing will start based on the source provided.\nIf no source was provided then all events within SavedClips and SentryClips will be processed instead. To have it\nprocess all 3 folders then provide the following for source:</p>\n<p>SavedClips SentryClips RecentClips</p>\n<p>After processing the program will wait until the drive has been ejected from the system. Once ejected it will\nstart monitoring again for a drive to be attached. This loop will continue until stopped with CTRL-C.</p>\n</blockquote>\n<p><em>–monitor_once</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>This is the same as –monitor however instead of waiting for the drive to be ejected after processing the program\nwill stop.</p>\n</blockquote>\n<p><em>–monitor_trigger &lt;File or folder&gt;</em></p>\n<blockquote>\n<p>Monitor for existence of a folder (or file) instead of a drive with TeslaCam folder. Once the file (or folder) exist\nthen processing will start. If source is provided then that will be used for scanning for events and clips. If no\nsource was provided then the path provided for this parameter will be used as source instead. If the provided source\nis a relative path (i.e. Tesla/MyVideos) then it will be relative based on the location of the trigger file/path.</p>\n<p>Upon completion, if a trigger file was provided then that file will be deleted and the program will wait again\nuntil the trigger file exist again. If a trigger folder was provided then the program will wait until this folder\nhas been removed. Then it will start monitoring again for existence for this folder.</p>\n</blockquote>\n</div>\n<div id=\"video-layout\">\n<h2>Video Layout</h2>\n<p>The layout of the resulting video can be adjusted in many ways through multiple parameters. Parameter –layout\nspecifies where each camera clip should be placed within the resulting video. (see above for examples).</p>\n<p><em>–layout</em></p>\n<blockquote>\nDefault: FULLSCREEN</blockquote>\n<ul>\n<li>FULLSCREEN: Resolution: 1920x960</li>\n</ul>\n<pre>+---------------+----------------+----------------+\n|               | Front Camera   |                |\n+---------------+----------------+----------------+\n| Left Camera   |  Rear Camera   |  Right Camera  |\n+---------------+----------------+----------------+\n</pre>\n<p>Video example: <a href=\"https://youtu.be/P5k9PXPGKWQ\" rel=\"nofollow\">https://youtu.be/P5k9PXPGKWQ</a></p>\n<ul>\n<li>WIDESCREEN: Resolution: 1920x1920</li>\n</ul>\n<pre>+---------------+----------------+----------------+\n|                 Front Camera                    |\n+---------------+----------------+----------------+\n| Left Camera   |  Rear Camera   |  Right Camera  |\n+---------------+----------------+----------------+\n</pre>\n<p>Video example: <a href=\"https://youtu.be/nPleIhVxyhQ\" rel=\"nofollow\">https://youtu.be/nPleIhVxyhQ</a></p>\n<ul>\n<li>CROSS: Resolution: 1280x1440</li>\n</ul>\n<pre>+---------------+----------------+----------------+\n|               | Front Camera   |                |\n+---------------+----------------+----------------+\n|     Left Camera      |       Right Camera       |\n+---------------+----------------+----------------+\n|               | Rear Camera    |                |\n+---------------+----------------+----------------+\n</pre>\n<ul>\n<li>DIAMOND: Resolution: 1920x976</li>\n</ul>\n<pre>+---------------+----------------+----------------+\n|               |  Front Camera  |                |\n+---------------+                +----------------+\n|   Left Camera |----------------| Right Camera   |\n+               +  Rear Camera   +                +\n|---------------|                |----------------|\n+---------------+----------------+----------------+\n</pre>\n<p><em>–perspective</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Show the side cameras in perspective mode.</p>\n</blockquote>\n<p><em>–scale</em></p>\n<blockquote>\n<p>This can then be further adjusted by changing the scale for all cameras or changing the scale for one or more making\nthem smaller or bigger then the others. This is done with the –scale parameter. If just provided with a number then\nscale is multiplied based on that number.</p>\n<p>For example, 0.5 results in 640x480 as standard resolution is 1280x960. Or one can also provide the resolution instead\nof the scale. For example providing 640x480. Changing the scale can be done for specific cameras as well. This is\ndone by preceding the scale number (or resolution) with camera=&lt;camera&gt; where &lt;camera&gt; can be front, rear, left,\nor right. One can provide the –scale parameter multiple times.</p>\n<p>For example:</p>\n<p>–scale 1 –scale camera=left .25 –scale camera=right 640x480</p>\n<p>results in front and rear camera clips to be of size 1280x960, left camera would be 320x240, and right camera would\nbe 640x480.</p>\n</blockquote>\n<p><em>–mirror or –rear</em></p>\n<blockquote>\n<p>By default the left, right, and rear cameras are shown as if one is sitting inside the car and looking through the\nmirrors. However, if the front camera is not included (with option –no-front) then this is changed making it seem\nas if one is looking backwards and not through a mirror. With option –mirror or –rear one can override the default\nfor this.</p>\n<p>Using –rear you can thus make it so that it is shown as if looking backwards yet still having the front one shown.\nSame, using –mirror one can make it as if the view is shown through a mirror without showing the front camera.</p>\n</blockquote>\n<p><em>–swap or –no-swap</em></p>\n<blockquote>\n<p>Default is to swap left and right cameras (left one is shown on the right in the video and right one is shown on the left)\nwhen they are viewed as if looking backwards (see –rear). Using –no-swap this can then be overridden.</p>\n<p>Similar, when looking as if through a mirror the default is not to swap left and right cameras. With –swap this can be\noverridden.</p>\n</blockquote>\n<p><em>–swap_frontrear</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Using this you can swap the front and the rear camera in the layouts. The front camera is normally on top with the rear\ncamera being at the bottom. With this the front camera will be shown at the bottom and the rear on the top.</p>\n</blockquote>\n<p><em>–background</em></p>\n<blockquote>\n<p>Default: Black</p>\n<p>Specify the background color for the video. Default is black. See –fontcolor for possible values.</p>\n</blockquote>\n</div>\n<div id=\"camera-exclusion\">\n<h2>Camera Exclusion</h2>\n<p>By default the output from all 4 cameras is shown within the merged video if existing. Using these parameters one can\nexclude one or more cameras from the resulting video.</p>\n<p><em>–no-front</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Exclude the front camera from the resulting video.</p>\n</blockquote>\n<p><em>–no-left</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Exclude the left camera from the resulting video.</p>\n</blockquote>\n<p><em>–no-right</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Exclude the right camera from the resulting video.</p>\n</blockquote>\n<p><em>–no-rear</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Exclude the rear camera from the resulting video.</p>\n</blockquote>\n</div>\n<div id=\"timestamp\">\n<h2>Timestamp</h2>\n<p>Following parameters are to change settings for the timestamp that is being added to the resulting video.</p>\n<p><em>–no-timestamp</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Do not display timestamp within the resulting video.</p>\n</blockquote>\n<p><em>–halign</em></p>\n<blockquote>\n<p>Default: CENTER</p>\n<p>Determine the horizontal alignment of the timestamp within the resulting video. The default for this normally\nis to display the timestamp in the center of the video. Exception to this is for DIAMOND layout when excluding\nleft or right camera in which case the horizontal placement of the font is adjusted so that it is still displayed\nbetween the front and rear camera. The alignment can be overridden with:</p>\n<p>LEFT: place timestamp to the left of the video</p>\n<p>CENTER: place timestamp in the center of the video</p>\n<p>RIGHT: place timestamp to the right of the video</p>\n</blockquote>\n<p><em>–valign</em></p>\n<blockquote>\n<p>Default: BOTTOM</p>\n<p>Set the vertical alignment of the timestamp within the resulting video. Default is at the bottom of the video except\nfor layout DIAMOND where it is in the middle to be placed in the space between the front and rear camera.</p>\n<p>TOP: place timestamp at the top of the video</p>\n<p>MIDDLE: place timestamp in the middle of the video</p>\n<p>BOTTOM: place timestamp at the bottom of the video</p>\n</blockquote>\n<p><em>–font &lt;filename&gt;</em></p>\n<blockquote>\nOverride the default font for the timestamp. Filename/path provided here has to be a fully qualified filename to the\nfont file (.ttf).</blockquote>\n<p><em>–fontsize &lt;size&gt;</em></p>\n<blockquote>\nFont size for the timestamp. Default font size is scaled based on the resulting video size, use this to override and\nprovide a fix font size.</blockquote>\n<p><em>–fontcolor &lt;color</em></p>\n<blockquote>\n<p>Default: white</p>\n<p>The color for the timestamp as a color string or RGB value. More information on how to provide the color can be\nfound here: <a href=\"https://ffmpeg.org/ffmpeg-utils.html#Color\" rel=\"nofollow\">https://ffmpeg.org/ffmpeg-utils.html#Color</a></p>\n<dl>\n<dt>Some possible values are:</dt>\n<dd><p>white</p>\n<p>yellowgreen</p>\n<p><a href=\"mailto:yellowgreen%400.9\">yellowgreen<span>@</span>0<span>.</span>9</a></p>\n<p>Red</p>\n<p>0x2E8B57</p>\n</dd>\n</dl>\n</blockquote>\n</div>\n<div id=\"timestamp-restriction\">\n<h2>Timestamp Restriction</h2>\n<p>The events/clips to be processed and thus be put in the resulting video can be restricted by providing a start and/or\nend timestamp.</p>\n<p>The timestamps provided do not need to match the start or end timestamp of a specific event or specific clip. Video within\nthe clip will be skipped if it falls outside of the timestamp.</p>\n<p>By default the timestamp will be interpreted based on the timezone of the PC the program runs on. This can be\noverridden however.</p>\n<p>The timestamp is to be provided based on the ISO-8601 format (see\n<a href=\"https://fits.gsfc.nasa.gov/iso-time.html\" rel=\"nofollow\">https://fits.gsfc.nasa.gov/iso-time.html</a>) for description and examples of\nthis format.</p>\n<p>In general, the date is provided in the format YYYY, YYYY-MM, YYYY-MM-DD, YYYY-Wxx, YYYY-ddd</p>\n<p>Here are some examples:</p>\n<blockquote>\n<p>2019 to process restrict video to year 2019.</p>\n<p>2019-09 for September, 2019.</p>\n<p>2019-09-10 or 20190910 for 10th of September, 2019</p>\n<p>2019-W37 (or 2019W37) for week 37 in 2019</p>\n<p>2019-W37-2 (or 2019W372) for Tuesday (day 2) of Week 37 in 2019</p>\n<p>2019-253 (or 2019253) for day 253 in 2019 (which is 10th of September, 2019)</p>\n</blockquote>\n<p>To identify the time, one can use hh, hh:mm, or hh:mm:ss.\nIf providing both a date and a time then these are seperated using the letter T:</p>\n<blockquote>\n2019-09-10T11:15:10 for 11:15AM on the 10th of September, 2019.</blockquote>\n<dl>\n<dt>Timezone for the timestamp can be provided as well.</dt>\n<dd>For UTC time add the letter Z to the time: 2019-09-10T11:15:10Z for 11:15AM on the 10th of September, 2019 UTC time.</dd>\n</dl>\n<p>One can also use +hh:mm, +hhmm, +hh, -hh:mm, -hhmm, -hh to use a different timezone.</p>\n<blockquote>\n2019-09-10T11:15:10-0500 is for 11:15AM on the 10th of September, 2019 EST.</blockquote>\n<p>For further guidance on potential values see: <a href=\"https://www.cl.cam.ac.uk/~mgk25/iso-time.html\" rel=\"nofollow\">https://www.cl.cam.ac.uk/~mgk25/iso-time.html</a></p>\n<p><em>–start_timestamp &lt;timestamp&gt;</em></p>\n<blockquote>\nStarting timestamp to include in resulting video. Anything before this timestamp will be skipped (even when inside\nthe clip containing the starting timestamp).</blockquote>\n<p><em>–end_timestamp &lt;timestamp&gt;</em></p>\n<blockquote>\nEnding timestamp to include in resulting video. Anything after this timestamp will be skipped (even when inside\nthe clip containing the ending timestamp).</blockquote>\n</div>\n<div id=\"event-offsets\">\n<h2>Event offsets</h2>\n<p>This is to skip forward or stop earlier within an event. The skipping is done for each event (folder) individually.\nFor example, one can set it to skip the 1st 5 minutes of each event by providing the –start_offset 300 (300 seconds = 5 minutes).\nProvided offsets are calculated before any video adjustments such as speeding up, slowing down, or motion only. Offsets\ncan work in combination with the timestamp restriction however the offsets will always be calculated based on the event\nstart and end timestamps. Thus if the start timestamp is set to be 2 minutes into the event, and the offset is set to 5 minutes\nthen the resulting video will start 5 minutes in (and not 7 minutes into the event). If the start timestamp is 3 minutes into\nthe event, and the starting offset is set to 2 minutes then the resulting video will start at 3 minutes in. Same\nmethodology is applied for ending offset and end timestamp.</p>\n<p><em>–start_offset &lt;offset&gt;</em></p>\n<blockquote>\nStarting offset within the event. &lt;offset&gt; is in seconds.</blockquote>\n<p><em>–end_offset &lt;offset&gt;</em></p>\n<blockquote>\nEnding offset within the event. &lt;offset&gt; is in seconds.</blockquote>\n</div>\n<div id=\"video-output\">\n<h2>Video Output</h2>\n<p>These are additional parameters related to the resulting video creation.</p>\n<p><em>–output &lt;path/filename&gt;</em></p>\n<blockquote>\nPath/filename for the resulting video. If a filename is provided here and –merge is set then the resulting merged\nvideo will be saved with this filename. The event videos will be stored within the same folder.</blockquote>\n<p><em>–motion_only</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Resulting video will show fast forwarded video for any portion where there is no or very little motion. This can\nbe especially useful for Sentry events since those are 10-minute events but often only have a few minutes (if that)\nof useful activity in it that resulted in the event being created.</p>\n</blockquote>\n<p><em>–slowdown &lt;speed&gt;</em></p>\n<blockquote>\nSlow the resulting video down by provided multiplier. For example, a &lt;speed&gt; of 2 would mean that the video\nwill be half the speed of normal.</blockquote>\n<p><em>–speedup &lt;speed&gt;</em></p>\n<blockquote>\nIncrease the speed of the resulting video by provided multiplier. For example, a value of 2 means that the video\nwill be going twice the normal speed.</blockquote>\n<p><em>–chapter_offset &lt;seconds&gt;</em></p>\n<blockquote>\n<p>Sets an offset for the chapter markers in the merged video. By default a chapter marker is set at the start of each\nevent within the merged video. Using this one can set the chapter marker &lt;seconds&gt; before or after the start of the event.</p>\n<p>Providing a negative value here results in the chapter marker being set x number of seconds before the end of the event.</p>\n<p>Providing a positive value results in the chapter marker being set x number of seconds after the start of the event.</p>\n</blockquote>\n<p><em>–merge</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>A video file is created for each event (folder) found. When parameter –merge is provided these individual event\nvideo files will then be further merged into 1 bigger video file.</p>\n</blockquote>\n<p><em>–keep-intermediate</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Temporary video files are being created during the processing of the events. These temporary video files are the\ncombined camera clips for 1 minute, and thus normally 10 of these video files are created (one for each minute).\nThese files are then deleted once the event is processed and the event video file has been created. Use this\nparameter to keep these temporary video files instead. Note that depending on the number of events a lot more\nstorage will be required then.</p>\n</blockquote>\n</div>\n<div id=\"advanced-encoding-settings\">\n<h2>Advanced Encoding Settings</h2>\n<p>The following parameters are more advanced settings to determine how ffmpeg should encode the videos.</p>\n<p><em>–gpu or –no-gpu</em></p>\n<blockquote>\n<p>Determine if GPU acceleration should be used or not. On MACs the default is to use GPU acceleration whereas on all\nother platforms the default is not to use GPU acceleration (this is because the encoder being used on other\nplatforms is depending then on the GPU installed in the PC).</p>\n<p>For Macs, use –no-gpu to disable using the GPU for encoding, note that encoding will use a lot more CPU and will\nend up being slower.</p>\n<p>For all other platforms, use –gpu to enable GPU encoding. When enabling you will also need to provide the GPU\ninstalled within the system (see –gpu_type).</p>\n<p>Note, –gpu option is only available on non-Macs whereas option –no-gpu is only available on Macs!</p>\n</blockquote>\n<p><em>–gpu_type</em></p>\n<blockquote>\n<p>All platforms except Macs. Provide the GPU type installed in the system.</p>\n<blockquote>\n<p>intel: if INTEL GPU is installed</p>\n<p>nvidia: if NVIDIA GPU is installed</p>\n<p>RPi: on Raspberry Pi systems</p>\n</blockquote>\n</blockquote>\n<p><em>–no-faststart</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>By default the ffmpeg flag faststart is set. Doing this will ensure that certain meta data is placed at the start\nof the resulting video which then improves streaming (i.e. YouTube, WebSites, …). This parameter is to disable\nthis and thus having the meta data placed at the end of the video file (which is normal default). This can improve\nperformance as video files will not have to be rewritten after processing to put the metadata at the beginning of the\nfile, and it can also prevent issues with video files are located on a network share.</p>\n</blockquote>\n<p><em>–quality</em></p>\n<blockquote>\n<p>Default: LOWER</p>\n<p>Set the overall quality for the resulting video. Setting this to a higher value can improve the quality (not guaranteed)\nbut most likely will also result in bigger file sizes. Resulting improvement might not be noticeable.</p>\n<blockquote>\nValid values: LOWEST, LOWER, LOW, MEDIUM, HIGH</blockquote>\n</blockquote>\n<p><em>–compression</em></p>\n<blockquote>\n<p>Default: medium</p>\n<p>Defines how much time should be spend to compress the resulting video file. Slower speed can result in improved\ncompression of the video file and thus a smaller video size. However it would also result in longer processing time.</p>\n<blockquote>\n<p>ultrafast will result in least amount of time processing to compress the video file, but largest video size.</p>\n<p>veryslow will result in the smallest video file, but the longest amount of time to create the video file.</p>\n</blockquote>\n<p>Note that increasing or decreasing compression time will not impact the quality of the resulting video. Just the\nresulting file size.</p>\n<blockquote>\nValid values: ultrafast, superfast,veryfast,faster,fast,medium,slow,slower,veryslow</blockquote>\n</blockquote>\n<p><em>–fps &lt;frames&gt;</em></p>\n<blockquote>\n<p>Default: 24</p>\n<p>Set the frames per seconds for the resulting video. Default frames per second for movies and TV shows is 24fps. Tesla\ncameras are recording and saving at about 33fps. Using default about 9 frames per second are dropped from the resulting\nvideo. With this parameter the fps for the resulting video can be adjusted. Set it to 33 to keep the number of frames\nsimilar to Tesla’s. Setting this value higher would just result in frames being duplicated. For example, setting it to\n66 would mean that for every second, each frame is duplicated to get from 33fps to 66fps.</p>\n</blockquote>\n<p><em>–ffmpeg &lt;executable&gt;</em></p>\n<blockquote>\n<p>For Windows and MacOS an executable is delivered with FFMPEG build-in. When using this executable this parameter\ncan be easily ignored unless one wants to specify a different ffmpeg version then what is delivered.</p>\n<p>On all other platforms (or on Windows and MacOS when not using the executable) ffmpeg has to be downloaded and\ninstalled separately. If ffmpeg is within the search path (on most platforms defined through environment variable PATH)\nthen there is also no reason to provide this. If ffmpeg is not within the search path (or one wants to use a different\nffmpeg then what is provided in the executable) then one can provide the fully qualified name for the ffmpeg to be used.</p>\n</blockquote>\n<p><em>–encoding</em></p>\n<blockquote>\n<p>Default: x264</p>\n<p>Provide the encoding for the resulting video. Default is x264 as today this is still the most common format for\nvideo files. One can also encode it in x265 which is the newer video standard. Encoding in x265 results in a smaller\nvideo file however certain programs or platforms might not be able to view this yet. Use x264 if providing the\nvideo to a wide audience, you can use x265 for private usage and ability to view x265.</p>\n<blockquote>\nValid values: x264, x265</blockquote>\n</blockquote>\n<p><em>–enc &lt;encoder&gt;</em></p>\n<blockquote>\nffmpeg uses an encoder to create (encode) the video files. By default the encoder selected is based on platform\n(Windows, Mac, Linux), GPU acceleration and GPU type, and encoding (x264, x265). With this parameter it is possible\nto provide a different encoder instead to create the video file. For further information please see the ffmpeg\ndocumentation on video encoders. The value provided here will be provided to parameter c:v &lt;encoder&gt;</blockquote>\n</div>\n<div id=\"update-check\">\n<h2>Update Check</h2>\n<p>A check to determine if a newer version is available will be performed every time the program is executed. These\nparameters allow you to influence this.</p>\n<p><em>–check_for_update</em></p>\n<blockquote>\nCheck if there is a new update available and then just exit. This allows you to perform the check without processing\nanything.</blockquote>\n<p><em>–no-check_for_update</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Do not perform the check if there is an update available. Not recommended as no checks are performed, but can be\nused when there is no internet available, slow internet, …</p>\n</blockquote>\n<p><em>–include_test</em></p>\n<blockquote>\n<p>Default: False</p>\n<p>Include test (beta) releases when checking for new updates. If this parameter is provided then it will also include\nany beta releases. Note that it has to be an actual beta releases within releases. Sometimes the development branch\ncan have releases that have not been released as a test release.</p>\n</blockquote>\n</div>\n<div id=\"argument-parameter-file\">\n<h2>Argument (Parameter) file</h2>\n<p>A lot of different parameters can be provided, thus to make it easier one can have these parameters within a text file\nand then supply this text file instead of having to enter them each time on the command line. Combination of\nhaving parameters in a text file and supplying it together with additional parameters on the command line is possible\nas well. This thus allows having multiple text files based on different preferences (i.e. layouts, …) and still\nprovide other parameters (i.e. start_timestamp and end_timestamp) on the command line.</p>\n<p>Arguments within the text file can all be on one (1) line, on separate lines, or a combination thereof. Use # to identify\ncomments. Everything behind # on a line is then ignored.\nNote, on Windows the argument specifying the parameter file has to be between double quotes (“)</p>\n<p>Having a text file (i.e. my_preference.txt) with the following contents:</p>\n<pre>--speedup <span class=\"m\">10</span> --rear\n--merge --output /home/me/Tesla\n--monitor_once SavedClips\n</pre>\n<p>And then executing tesla_dashcam as follows:</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe <span class=\"s2\">\"@my_preference.txt\"</span>\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam @my_preference.txt\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py @my_preference.txt\n</pre>\n<p>Would result in the same as if those parameters were provided on the command itself. One can also combine a parameter file with parameters on the command line.\nPreference is given to what occurs first. For example, if providing the following arguments:</p>\n<pre>--speedup <span class=\"m\">2</span> @my_preference.txt\n</pre>\n<p>Then the clips will only be sped up two-fold instead of 10-fold as –speedup 2 occurs before –speedup 10 from the parameter file.\nBut with:</p>\n<pre>@my_preference.txt --speedup <span class=\"m\">2</span>\n</pre>\n<p>the clips will be sped up ten-fold.</p>\n</div>\n<div id=\"examples\">\n<h2>Examples</h2>\n<p>To show help:</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe -h\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam -h\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py -h\n</pre>\n<p>Using defaults:</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\2</span><span class=\"m\">019</span>-02-27_14-02-03\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py /home/me/Tesla/2019-02-27_14-02-03\n</pre>\n<p>Using defaults but not knowing what to provide for source path. Goal to only process the SavedClips and only do this once.\nStore the resulting video files in c:Tesla (Windows) or /Users/me/Desktop/Tesla (MacOS). Delete the files from the\nUSB (or SD) when processed.</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe --monitor_once --delete_source --output c:<span class=\"se\">\\T</span>esla SavedClips\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam --monitor_once --delete_source --output /Users/me/Desktop/Tesla SavedClips\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py --monitor_once --delete_source --output /home/me/Tesla SavedClips\n</pre>\n<p>Specify video file and location:</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe --output c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\M</span>y_Video_Trip.mp4 c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\2</span><span class=\"m\">019</span>-02-27_14-02-03\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam --output /Users/me/Desktop/Tesla/My_Video_Trip.mp4 /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py --output /home/me/Tesla/My_Video_Trip.mp4 /home/me/Tesla/2019-02-27_14-02-03\n</pre>\n<p>Without timestamp:</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe --no-timestamp c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\2</span><span class=\"m\">019</span>-02-27_14-02-03\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam --no-timestamp /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py --no-timestamp /home/me/Tesla/2019-02-27_14-02-03\n</pre>\n<p>Put timestamp center top in yellowgreen:</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe --fontcolor yellowgreen@0.9 -halign CENTER -valign TOP c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\2</span><span class=\"m\">019</span>-02-27_14-02-03\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam --fontcolor yellowgreen@0.9 -halign CENTER -valign TOP /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py --fontcolor yellowgreen@0.9 -halign CENTER -valign TOP /home/me/Tesla/2019-02-27_14-02-03\n</pre>\n<p>Layout so front is shown top middle with side cameras below it and font size of 24 (FULLSCREEN):</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe --layout FULLSCREEN --fontsize <span class=\"m\">24</span> c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\2</span><span class=\"m\">019</span>-02-27_14-02-03\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam --layout FULLSCREEN --fontsize <span class=\"m\">24</span> /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py --layout FULLSCREEN --fontsize <span class=\"m\">24</span> /home/me/Tesla/2019-02-27_14-02-03\n</pre>\n<p>Specify location of ffmpeg binay (in case ffmpeg is not in path):</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe --ffmpeg c:<span class=\"se\">\\f</span>fmpeg<span class=\"se\">\\f</span>fmpeg.exe c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\2</span><span class=\"m\">019</span>-02-27_14-02-03\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam --ffmpeg /Applications/ffmpeg /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py --ffmpeg /home/me/ffmpeg /home/me/Tesla/2019-02-27_14-02-03\n</pre>\n<p>Layout of PERSPECTIVE with a different font for timestamp and path for ffmpeg:</p>\n<ul>\n<li>Windows: Note how to specify the path, : and needs to be escaped by putting a in front of them.</li>\n</ul>\n<pre>tesla_dashcam.exe --layout PERSPECTIVE --ffmpeg c:<span class=\"se\">\\f</span>fmpeg<span class=\"se\">\\f</span>fmpeg.exe --font <span class=\"s2\">\"C\\:\\\\Windows\\\\Fonts\\\\Courier New.ttf\"</span> c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\2</span><span class=\"m\">019</span>-02-27_14-02-03\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam --layout PERSPECTIVE --ffmpeg /Applications/ffmpeg --font <span class=\"s1\">'/Library/Fonts/Courier New.ttf'</span> /Users/me/Desktop/Tesla/2019-02-27_14-02-03\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py --layout PERSPECTIVE --ffmpeg /Applications/ffmpeg --font <span class=\"s1\">'/usr/share/fonts/truetype/freefont/Courier New.ttf'</span> /home/me/Tesla/2019-02-27_14-02-03\n</pre>\n<p>Enable monitoring for the Tesla Dashcam USB (or SD) to be inserted and then process all the files (both RecentClips and SavedClips).\nIncrease speed of resulting videos tenfold and store all videos in folder specified by output.\nDelete the source files afterwards:</p>\n<pre>tesla_dashcam.exe --speed <span class=\"m\">10</span> --output c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\ </span>--monitor .\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam /Users/me/Desktop/Tesla --monitor .\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py /home/me/Desktop/Tesla --monitor .\n</pre>\n<p>Enable one-time monitoring for the Tesla Dashcam USB (or SD) to be inserted and then process all the files from SavedClips.\nNote that for source we provide the folder name (SavedClips), the complete path will be created by the program.\nSlowdown speed of resulting videos to half, show left/right cameras as if looking backwards, store all videos in folder specified by output.\nAlso create a movie file that has them all merged together.</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe --slowdown <span class=\"m\">2</span> --rear --merge --output c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\ </span>--monitor_once SavedClips\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam --slowdown <span class=\"m\">2</span> --rear --merge --output /Users/me/Desktop/Tesla --monitor_once SavedClips\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py --slowdown <span class=\"m\">2</span> --rear --merge --output /home/me/Tesla --monitor_once SavedClips\n</pre>\n<p>Enable monitoring using a trigger file (or folder) to start processing all the files from SavedClips.\nNote that for source we provide the folder name (SavedClips), the complete path will be created by the program using the\npath of the trigger file (if it is a file) or folder. Videos are stored in folder specified by –output. Videos from all\nthe folders are then merged into 1 folder with name TeslaDashcam followed by timestamp of processing (timestamp is\nadded automatically). Chapter offset is set to be 2 minutes (120 seconds) before the end of the respective folder clips.</p>\n<ul>\n<li>Windows:</li>\n</ul>\n<pre>tesla_dashcam.exe --merge --chapter_offset -120 --output c:<span class=\"se\">\\T</span>esla<span class=\"se\">\\T</span>eslaDashcam.mp4 --monitor --monitor_trigger x:<span class=\"se\">\\T</span>eslaCam<span class=\"se\">\\s</span>tart_processing.txt SavedClips\n</pre>\n<ul>\n<li>Mac:</li>\n</ul>\n<pre>tesla_dashcam --merge --chapter_offset -120 --output /Users/me/Desktop/Tesla --monitor --monitor_trigger /Users/me/TeslaCam/start_processing.txt SavedClips\n</pre>\n<ul>\n<li>Linux:</li>\n</ul>\n<pre>python3 tesla_dashcam.py --merge --chapter_offset -120 --output /home/me/Tesla --monitor --monitor_trigger /home/me/TeslaCam/start_processing.txt SavedClips\n</pre>\n</div>\n<div id=\"support\">\n<h2>Support</h2>\n<p>There is no official support nor should there be any expectation for support to be provided. As per license this is\nprovided As-Is.\nHowever, any issues or requests can be reported on <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues\" rel=\"nofollow\">GitHub</a> and\nI will do my best (time permitting) to provide support.</p>\n</div>\n<div id=\"release-notes\">\n<h2>Release Notes</h2>\n<dl>\n<dt>0.1.4:</dt>\n<dd><ul>\n<li>Initial Release</li>\n</ul>\n</dd>\n<dt>0.1.5:</dt>\n<dd><ul>\n<li>Fixed: font issue on Windows</li>\n</ul>\n</dd>\n<dt>0.1.6:</dt>\n<dd><ul>\n<li>Changed: Output folder is now optional</li>\n<li>Changed: Source is positional argument (in preparation for self-contained executable and drag&amp;drop)</li>\n</ul>\n</dd>\n<dt>0.1.7:</dt>\n<dd><ul>\n<li>New: Added perspective layout (thanks to <a href=\"https://model3ownersclub.com/members/lairdb.16314/\" rel=\"nofollow\">lairdb</a> from <a href=\"https://model3ownersclub.com\" rel=\"nofollow\">model3ownersclub</a> forums to provide this layout).</li>\n<li>New: Added font size option to set the font size for timestamp</li>\n<li>New: Added font color option to set the font color for timestamp</li>\n<li>New: Added halign option to horizontally align timestamp (left, center, right)</li>\n<li>New: Added valign option to vertically align timestamp (top, middle, bottom)</li>\n<li>Changed: Perspective is now default layout.</li>\n</ul>\n</dd>\n<dt>0.1.8:</dt>\n<dd><ul>\n<li>New: Added GPU hardware accelerated encoding for Mac and PCs with NVIDIA. On Mac it is enabled by default</li>\n<li>New: Added option to have video from side cameras be shown as if one were to look at it through the mirror (option –mirror). This is now the default</li>\n<li>New: Added option –rear to show video from side cameras as if one was looking to the rear of the car. This was how it was originally.</li>\n<li>New: Added option to swap left and right camera in output. Mostly beneficial in FULLSCREEN with –rear option as it then seems like it is from a rear camera</li>\n<li>New: Added option to speedup (–speedup) or slowdown (–slowdown) the video.</li>\n<li>New: Added option to provide a different encoder for ffmpeg to use. This is for those more experienced with ffmpeg.</li>\n<li>New: Added a default font path for Linux systems</li>\n<li>New: Added –version to get the version number</li>\n<li>New: Releases will now be bundled in a ZIP file (Windows) or a DMG file (MacOS) with self-contained executables in them. This means Python does not need to be installed anymore (located on github)</li>\n<li>New: ffmpeg executable binary for Windows and MacOS added into respective bundle.</li>\n<li>Changed: For output (–output) one can now also just specify a folder name. The resulting filename will be based on the name of the folder it is then put in</li>\n<li>Changed: If there is only 1 video file for merging then will now just rename intermediate (or copy if –keep-intermediate is set).</li>\n<li>Changed: The intermediate files (combining of the 3 cameras into 1 video file per minute) will now be written to the output folder if one provided.</li>\n<li>Changed: The intermediate files will be deleted once the complete video file is created. This can be disabled through option –keep-intermediate</li>\n<li>Changed: Set FULLSCREEN back as the default layout</li>\n<li>Changed: Help output (-h) will show what default value is for each parameter</li>\n<li>Changed: Cleaned up help output</li>\n<li>Changed: Default path for ffmpeg will be set to same path as tesla_dashcam is located in, if not exist then default will be based that ffmpeg is part of PATH.</li>\n<li>Fixed: Now able to handle if a camera file is missing, a black screen will be shown for that duration for the missing file</li>\n<li>Fixed: Fixed (I believe) cygwin path for fonts.</li>\n</ul>\n</dd>\n<dt>0.1.9:</dt>\n<dd><ul>\n<li>New: Added scanning of sub-folders clip files. Each folder will be processed and resulting movie file created. This can be disabled through parameter –exclude_subdirs</li>\n<li>New: Added option to merge the video files from multiple sub-folders into 1 movie file. Use parameter –merge to enable.</li>\n<li>New: Added option to monitor if the USB drive (or SD card) is inserted in the PC and then automatically start processing the files. Use parameter –monitor to enable.\nParameter –monitor_once will stop monitoring and exit after 1st time drive was inserted.\nParameter –delete_source will delete the source files and folder once the movie file for that folder has been created.</li>\n<li>New: Added update checker to determine if there is a newer version, additional arguments to just perform check (–check_for_update), include test releases (–include_test), or disable always checking for updates (–no-check_for_update)</li>\n<li>New: ffmpeg is part of the tesla_dashcam executable</li>\n<li>New: Desktop notification when processing starts (when using monitor) and when it completes.</li>\n<li>New: DockerFile added making it easy to run tesla_dashcam within Docker (jeanfabrice)</li>\n<li>New: Time it took to create the video files will now be provided upon completion of processing.</li>\n<li>Changed: Formatted output to easily show progress</li>\n<li>Fixed: Will now handle it much better if a video file from a camera is corrupt (i.e. zero-byte file).</li>\n<li>Fixed: combining clips to movie would not use GPU or provided encoding.</li>\n<li>Fixed: Added additional check that video file exist before merging into movie.</li>\n</ul>\n</dd>\n<dt>0.1.10:</dt>\n<dd><ul>\n<li>New: Added scale option to set the scale of the clips and thus resulting video. (–scale)</li>\n<li>New: Added option to specify a parameter file using @&lt;filename&gt; where parameters can be located in. (@&lt;filename&gt;)</li>\n<li>New: One can now specify multiple sources instead of just 1.</li>\n<li>New: Individual file(s) can now be provided as a source as well (only 1 camera filename has to be provided to get all 3)</li>\n<li>New: Source is now optional, if not provided then it will be same as –monitor_once with as source SavedClips.</li>\n<li>Changed: Timestamp within video will now be used for concatenation of the clips at folder level and all (–merge option) instead of filename. This will ensure that even when crossing timezones the order of the video is still accurate.</li>\n<li>Changed: –delete_source will delete source files when specified even when –monitor or –monitor_once is not specified <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/28\" rel=\"nofollow\">Issue #28</a></li>\n<li>Changed: output will default to VideosTesla_Dashcam (Windows) Movies/Tesla_Dashcam (MacOS), or VideosTesla_Dashcam (Linux) if not output folder specified.</li>\n<li>Changed: Filename for the folder video files will not have start and end timestamp in local timezone instead of just folder name. <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/30\" rel=\"nofollow\">Issue #30</a> and <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/33\" rel=\"nofollow\">Issue #33</a></li>\n<li>Changed: Updated release notes for each release better identifying what is new, changed, and fixed.</li>\n<li>Fixed: issue where sometimes encoding with GPU would fail by also allowing software based encoding</li>\n<li>Fixed: traceback when unable to retrieve latest release from GitHub</li>\n<li>Fixed: running tesla_dashcam when installed using pip. <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/23\" rel=\"nofollow\">Issue #23</a> and <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/31\" rel=\"nofollow\">Issue #31</a></li>\n<li>Fixed: Folder clip would be removed if only 1 set in folder with same name as folder name if keep_intermediate not specified</li>\n<li>Fixed: Font issue in Windows (hopefully final fix) <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/29\" rel=\"nofollow\">Issue #29</a></li>\n<li>Fixed: Python version has to be 3.7 or higher due to use of capture_output <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/19\" rel=\"nofollow\">Issue #19</a></li>\n</ul>\n</dd>\n<dt>0.1.11:</dt>\n<dd><ul>\n<li>Fixed: Traceback when getting ffmpeg path in Linux <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/39\" rel=\"nofollow\">Issue #39</a></li>\n<li>Fixed: Running tesla_dashcam when installed using pip. <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/38\" rel=\"nofollow\">Issue #38</a></li>\n<li>Fixed: Just providing a filename for output would result in traceback.</li>\n<li>Fixed: When providing a folder as output it would be possible that the last folder name was stripped potentially resulting in error.</li>\n</ul>\n</dd>\n<dt>0.1.12:</dt>\n<dd><ul>\n<li>New: Added chapter markers in the concatenated movies. Folder ones will have a chapter marker for each intermediate clip, merged one has a chapter marker for each folder.</li>\n<li>New: Option –chapter_offset for use with –merge to offset the chapter marker in relation to the folder clip.</li>\n<li>New: Added flag -movstart +faststart for video files better suited with browsers etc. (i.e. YouTube). Thanks to sf302 for suggestion.</li>\n<li>New: Option to add trigger (–monitor_trigger_file) to use existence of a file/folder/link for starting processing instead of USB/SD being inserted.</li>\n<li>Changed: Method for concatenating the clips together has been changed resulting in massive performance improvement (less then 1 second to do concatenation). Big thanks to sf302!</li>\n<li>Fixed: Folders will now be deleted if there are 0-byte or corrupt video files within the folder <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/40\" rel=\"nofollow\">Issue #40</a></li>\n<li>Fixed: Providing a filename for –output would create a folder instead and not setting resulting file to filename provided <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/52\" rel=\"nofollow\">Issue #52</a></li>\n<li>Fixed: Thread exception in Windows that ToastNotifier does not have an attribute classAtom (potential fix). <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/54\" rel=\"nofollow\">Issue #54</a></li>\n<li>Fixed: Traceback when invalid output path (none-existing) is provided or when unable to create target folder in given path.</li>\n<li>Fixed: Including sub dirs did not work correctly, it would only grab the 1st folder.</li>\n<li>Fixed: When using monitor, if . was provided as source then nothing would be processed. Now it will process everything as intended.</li>\n<li>Fixed: File created when providing a filename with –output and –monitor option did not put timestamp in filename to ensure unique filenames</li>\n<li>Fixed: Argument to get release notes was provided incorrectly when checking for updates. Thank you to demonbane for fixing.</li>\n</ul>\n</dd>\n<dt>0.1.13:</dt>\n<dd><ul>\n<li>New: Support for rear camera (introduced in V10). This also results in layouts having been modified to allow inclusion of rear camera. <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/71\" rel=\"nofollow\">Issue #71</a></li>\n<li>New: Support for hardware encoding for systems with supported Intel GPUs.</li>\n<li>New: Support for hardware encoding on Raspberry Pi (RPi) (H.264 only) <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/66\" rel=\"nofollow\">Issue #66</a></li>\n<li>New: Layout CROSS with front camera top centered, side camera underneath it, and rear camera then underneath side cameras centered.</li>\n<li>New: Layout DIAMOND with front camera top centered, rear camera under front and side camera centered at the left and right of front&amp;rear.</li>\n<li>New: Option –motion_only to fast-forward through the portions in the video that does not have anything motion (done through removal of duplicate frames). Thanks to supRy for providing this</li>\n<li>New: Option –skip_existing to skip creation of video files that already exist. Existence only is checked, not if layout etc are the same.</li>\n<li>New: Option –perspective for showing side cameras to be displayed in perspective mode irrespective of layout. Layout PERSPECTIVE is thus same as layout FULLSCREEN with –perspective option.</li>\n<li>New: Options –start_offset and –end_offset can be used to provide starting and ending offset in seconds for resulting video (at folder level).</li>\n<li>New: Options –start_timestamp and –end_timestamp can be used to restrict resulting video (and processing) to specific timestamps. This can be used in combination with –start_offset and/or –end_offset</li>\n<li>New: Options –no-front, –no-left, –no-right, and –no-rear to exclude camera(s) from the videos</li>\n<li>New: Option –gpu_type to provide GPU installed in the system for Windows/Linux. Current supported options are nvidia, intel, and RPi.</li>\n<li>New: Option  –no-faststart for not setting the faststart flag in the video files as doing this can result in encoding failures on network shares <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/62\" rel=\"nofollow\">Issue #62</a></li>\n<li>New: Option –temp_dir to provide a different path to store the temporary video files that are created <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/67\" rel=\"nofollow\">Issue #67</a></li>\n<li>New: Description metadata to include video was created by tesla_dashcam with version number.</li>\n<li>Changed: WIDESCREEN layout will now by default show the front camera on top with higher resolution compared to others due to incorporation of rear camera</li>\n<li>Changed: Include folder SentryClips in default source list if no source provided (SavedClips was already default).</li>\n<li>Changed: Check to ensure that Python version is at required level or higher (currently 3.7).</li>\n<li>Changed: Existence of font file (provided or default) will be checked and error returned if not existing.</li>\n<li>Changed: Existence of ffmpeg will be checked and error returned if not existing.</li>\n<li>Changed: If no filename provided for merged video then current date/time will be used for filename.</li>\n<li>Fixed: Merge of videos fails when a relative path instead of an absolute path is provided for –output <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/62\" rel=\"nofollow\">Issue #62</a></li>\n<li>Fixed: Issue during processing of metadata if files were missing</li>\n<li>Fixed: Hidden files (files starting with period) on Mac/Linux were not ignored. This could cause issues as some programs might create these files when viewing the video.</li>\n</ul>\n</dd>\n<dt>0.1.14:</dt>\n<dd><ul>\n<li>Fixed: Checking if font path exist in Windows failed.</li>\n</ul>\n</dd>\n<dt>0.1.15:</dt>\n<dd><ul>\n<li>Changed: Reduced sensitivity for motion detection</li>\n<li>Changed: Minor improvement for font path checking, mainly message provided.</li>\n<li>Fixed: Rear view camera filename was changed from -rear_view to -back in TeslaCam folders. <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/78\" rel=\"nofollow\">Issue #78</a></li>\n<li>Fixed: Missing python-dateutil package when installing from PIP <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/77\" rel=\"nofollow\">Issue #77</a></li>\n<li>Fixed: Missing fonts in Docker Image (thanks to moorecp for providing fix)</li>\n<li>Fixed: Only the 1st source was processed When using MONITOR or MONITOR_ONCE, or with V10 only SavedClips was processed when not providing a source</li>\n</ul>\n</dd>\n<dt>0.1.16:</dt>\n<dd><ul>\n<li>New: Option –scale now accepts value of camera=&lt;front, rear, left, right&gt;. to set the scale of for each camera individually (value of 1 is 1280x960 for the clip)</li>\n<li>New: Option –swap_frontrear to swap front&amp;rear cameras in output.</li>\n<li>New: Option –background to specify background color (default is black).</li>\n<li>New: Option –fps to set the frame rate for resulting video. Default is set to 24 (Tesla records at about 33 fps). <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/85\" rel=\"nofollow\">Issue #85</a></li>\n<li>New: Parameter file (provided using @) can now include comments (specify using #)</li>\n<li>New: Option –loglevel to allow for debug information to be printed.</li>\n<li>Changed: –speedup and –slowdown now accepts a float allowing for example to speed video up by 1.5</li>\n<li>Changed: Option –scale also accept fixed resolution (i.e. 640x480) for the clip.</li>\n<li>Changed: View of rear camera will be mirrored as well if side cameras are shown as mirror</li>\n<li>Changed: For all layouts default is to show mirror for rear&amp;side if front camera is shown, otherwise show as rear viewing.</li>\n<li>Changed: Swap left&amp;right cameras when showing rear&amp;side as rear viewing, and not to swap them when showing rear&amp;side as mirror view.</li>\n<li>Changed: Re-organized help (-h) for all parameters by grouping them.</li>\n<li>Changed: Added message to install fonts using apt-get install ttf-freefont on Linux if font file is not found.</li>\n<li>Changed: Only execute if we’re main allowing to be imported into other scripts. <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/94\" rel=\"nofollow\">Issue #94</a></li>\n<li>Changed: Cleaned-up this README file to provide better information.</li>\n<li>Fixed: Providing paths with spaces did not work in parameter files even although it worked from command line. <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/89\" rel=\"nofollow\">Issue #89</a></li>\n<li>Fixed: Changed Arial font on MacOS to Arial Unicode (from Arial) as it seems Arial is not available anymore on MacOS 10.15 (Catalina). <a href=\"https://github.com/ehendrix23/tesla_dashcam/issues/64\" rel=\"nofollow\">Issue #64</a></li>\n<li>Fixed: Incorrect encoder for x265 with Intel GPU hardware encoding - mbaileys</li>\n</ul>\n</dd>\n</dl>\n</div>\n<div id=\"todo\">\n<h2>TODO</h2>\n<ul>\n<li>Implement option to crop individual camera output</li>\n<li>Option for end-user layout</li>\n<li>Monitor path for new folders/files as trigger option</li>\n<li>Provide option to copy or move from source to output folder before starting to process</li>\n<li>Develop method to run as a service with –monitor option</li>\n<li>GUI Front-end</li>\n<li>Support drag&amp;drop of video folder (supported in Windows now, MacOS not yet)</li>\n<li>Add object detection (i.e. people) and possible output when object was detected</li>\n<li>Saving of options</li>\n<li>Use timestamp in video to ensure full synchronization between the 4 cameras</li>\n<li>Add option for source/output to be S3 bucket (with temp folder for creating temporary files)</li>\n<li>Develop Web Front-End</li>\n<li>Develop method to have run in AWS, allowing user to upload video files and interact using Web Front-End</li>\n</ul>\n</div>\n\n          </div>"}, "last_serial": 6144523, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "f6af7651e9fcd72e0dc0e3ec1778238e", "sha256": "833df476f2acb123068d236566de48e7e35414a993996b1654837ca037605416"}, "downloads": -1, "filename": "tesla_dashcam-0.1.0-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "f6af7651e9fcd72e0dc0e3ec1778238e", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5.3", "size": 11938, "upload_time": "2019-02-28T00:12:58", "upload_time_iso_8601": "2019-02-28T00:12:58.869069Z", "url": "https://files.pythonhosted.org/packages/86/ac/c41284f03180c031defb54f397da889e635dda93ea1316f759a36b1a3f3d/tesla_dashcam-0.1.0-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7ed6e6289980536effc3633faa77b6d8", "sha256": "f2f845644ff4a83d1c1ca9987fb7c7618aeeaeda8d33f44872469272bf6ad76d"}, "downloads": -1, "filename": "tesla_dashcam-0.1.0.tar.gz", "has_sig": false, "md5_digest": "7ed6e6289980536effc3633faa77b6d8", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5.3", "size": 8395, "upload_time": "2019-02-28T00:13:00", "upload_time_iso_8601": "2019-02-28T00:13:00.809713Z", "url": "https://files.pythonhosted.org/packages/d8/4a/261c624e1096f5831113c1503ce3862b9cd87b0525ba515b5725be407996/tesla_dashcam-0.1.0.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "0387192a7609d1e667df240f30d29fe3", "sha256": "ce8e52bc38285e7ae48937625759a62fb2cb3fd27a7f982c11d6241d054d14e2"}, "downloads": -1, "filename": "tesla_dashcam-0.1.1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "0387192a7609d1e667df240f30d29fe3", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5.3", "size": 11857, "upload_time": "2019-02-28T00:17:28", "upload_time_iso_8601": "2019-02-28T00:17:28.223833Z", "url": "https://files.pythonhosted.org/packages/eb/0e/51e2802b792a4e1bd4ccd7a030cdc5cf2989c0d0117313c63dd726dbf3e8/tesla_dashcam-0.1.1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "67bdcf596bd9d99a5ca676549ea5d27d", "sha256": "7cb5af7d70d4f7a1da256123debd040c0d7d82375e77099a6c9007cac98deaf8"}, "downloads": -1, "filename": "tesla_dashcam-0.1.1.tar.gz", "has_sig": false, "md5_digest": "67bdcf596bd9d99a5ca676549ea5d27d", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5.3", "size": 8322, "upload_time": "2019-02-28T00:17:29", "upload_time_iso_8601": "2019-02-28T00:17:29.263003Z", "url": "https://files.pythonhosted.org/packages/d8/f3/35d1d6264457ae7b942afbfc5145fd62403a5b0c60818e4135862bd9f17c/tesla_dashcam-0.1.1.tar.gz", "yanked": false}], "0.1.10": [{"comment_text": "", "digests": {"md5": "6c21e965d43991d17958b1e4ef4d55ea", "sha256": "512306aa1075fbe6c4d840f3bbc844c56241ab2917ca412ea2938cceef3b3436"}, "downloads": -1, "filename": "tesla_dashcam-0.1.10-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "6c21e965d43991d17958b1e4ef4d55ea", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.7.0", "size": 31784, "upload_time": "2019-05-30T17:11:58", "upload_time_iso_8601": "2019-05-30T17:11:58.986560Z", "url": "https://files.pythonhosted.org/packages/4c/50/e3418317a9438c02798daffa48b019401cecbe7070487e6275e1d05256ec/tesla_dashcam-0.1.10-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9ed606a1f46827cd14ef028fde660671", "sha256": "d0e6cf2d71193ce43371d8a9774fe9236b1da8ebbf255e5b2509f01760af5608"}, "downloads": -1, "filename": "tesla_dashcam-0.1.10.tar.gz", "has_sig": false, "md5_digest": "9ed606a1f46827cd14ef028fde660671", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7.0", "size": 43790, "upload_time": "2019-05-30T17:12:01", "upload_time_iso_8601": "2019-05-30T17:12:01.409113Z", "url": "https://files.pythonhosted.org/packages/f6/37/28a7a2a4b2d1f10c348e3d06c71cd9b5415db1d53f45e867f2dc62a95d3d/tesla_dashcam-0.1.10.tar.gz", "yanked": false}], "0.1.11": [{"comment_text": "", "digests": {"md5": "7a5dcb473e2afb0996091d190fc0a143", "sha256": "5c0db022e4af804ed5dd2478eb79c7b943eb3aff1f7c1b412019c18f3811c208"}, "downloads": -1, "filename": "tesla_dashcam-0.1.11-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "7a5dcb473e2afb0996091d190fc0a143", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.7.0", "size": 31915, "upload_time": "2019-07-29T23:07:29", "upload_time_iso_8601": "2019-07-29T23:07:29.177941Z", "url": "https://files.pythonhosted.org/packages/fd/16/25fb0b6c07baca26bd03bef20a612d944b19c5f223ac7beba17245790309/tesla_dashcam-0.1.11-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "dcbda414e91e2ee6cd6653a759ef1509", "sha256": "c7f487aadddbbcaefd1c030de48a4579061d9cb45d79a4647fd3fff903e05eb1"}, "downloads": -1, "filename": "tesla_dashcam-0.1.11.tar.gz", "has_sig": false, "md5_digest": "dcbda414e91e2ee6cd6653a759ef1509", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7.0", "size": 45130, "upload_time": "2019-07-29T23:07:31", "upload_time_iso_8601": "2019-07-29T23:07:31.332780Z", "url": "https://files.pythonhosted.org/packages/3d/23/18fc1a237c73522c395b02b4e67e852049def66e11fbd5479c006ae33f28/tesla_dashcam-0.1.11.tar.gz", "yanked": false}], "0.1.12": [{"comment_text": "", "digests": {"md5": "b014c6400a646156d542c841b96fd9d8", "sha256": "5eba8bf89551261e70d2d5245019555ac21166f22fc9ed4551ba0e76a396550a"}, "downloads": -1, "filename": "tesla_dashcam-0.1.12-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "b014c6400a646156d542c841b96fd9d8", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.7.0", "size": 34849, "upload_time": "2019-08-20T14:22:14", "upload_time_iso_8601": "2019-08-20T14:22:14.791706Z", "url": "https://files.pythonhosted.org/packages/50/0d/b1bdca9773d8bafdb6ced1dc1dd219cc28baa07f6ab8670d5e1f747a1cea/tesla_dashcam-0.1.12-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "24ca5ce5133770a291b274a2d4f7c8cd", "sha256": "5d47b780370702922c050bac3f4086e44b7d26c0fc8823dab409cc688fa7fb74"}, "downloads": -1, "filename": "tesla_dashcam-0.1.12.tar.gz", "has_sig": false, "md5_digest": "24ca5ce5133770a291b274a2d4f7c8cd", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7.0", "size": 51216, "upload_time": "2019-08-20T14:22:16", "upload_time_iso_8601": "2019-08-20T14:22:16.740029Z", "url": "https://files.pythonhosted.org/packages/37/de/a696a7312e25525304e0efaca42b226f3796fcee050405dd42841702c585/tesla_dashcam-0.1.12.tar.gz", "yanked": false}], "0.1.13": [{"comment_text": "", "digests": {"md5": "a54eaec11c18828e85a16e4d93e9e7c0", "sha256": "281997c5f48a32a9fa4873f0f35ba7c59c42592cc49a0fe4f237c7c56cd5838d"}, "downloads": -1, "filename": "tesla_dashcam-0.1.13-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "a54eaec11c18828e85a16e4d93e9e7c0", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.7.0", "size": 41392, "upload_time": "2019-09-26T21:49:12", "upload_time_iso_8601": "2019-09-26T21:49:12.519201Z", "url": "https://files.pythonhosted.org/packages/0e/cf/fefd2e22a9e9444a8695e21a5f1533834f9fb05a8c4877900d5d4a0fec3a/tesla_dashcam-0.1.13-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "18b164f99dd483266727be92b40e8251", "sha256": "2b9f363a04d859298a60e5ec0e37d3abd72f7e9c206b6107b57ef9be0a3b8160"}, "downloads": -1, "filename": "tesla_dashcam-0.1.13.tar.gz", "has_sig": false, "md5_digest": "18b164f99dd483266727be92b40e8251", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7.0", "size": 62971, "upload_time": "2019-09-26T21:49:16", "upload_time_iso_8601": "2019-09-26T21:49:16.187833Z", "url": "https://files.pythonhosted.org/packages/98/49/044b55fcd8454575869f798a2ec40ab24432c34fb61a5c5d34a2887e6f57/tesla_dashcam-0.1.13.tar.gz", "yanked": false}], "0.1.14": [{"comment_text": "", "digests": {"md5": "d96e003f01e1442e065728dba57e1e8a", "sha256": "63cfb68b0b786198632650411eb5e9265e608a320db2b07ecd00755f977c0e3f"}, "downloads": -1, "filename": "tesla_dashcam-0.1.14-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "d96e003f01e1442e065728dba57e1e8a", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.7.0", "size": 41447, "upload_time": "2019-09-26T22:42:46", "upload_time_iso_8601": "2019-09-26T22:42:46.762777Z", "url": "https://files.pythonhosted.org/packages/d1/e6/a789a0cd9125ed4489d2c379f4a96212e49ded58a7e441e6d3b4b3be535b/tesla_dashcam-0.1.14-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6a9ba05340a68ba819703a0ffa0d31a8", "sha256": "00a7d981c1619cfa92790bee50fcb69bba7b1bd67e8113d6f73ffd0f68f17e7d"}, "downloads": -1, "filename": "tesla_dashcam-0.1.14.tar.gz", "has_sig": false, "md5_digest": "6a9ba05340a68ba819703a0ffa0d31a8", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7.0", "size": 63061, "upload_time": "2019-09-26T22:42:49", "upload_time_iso_8601": "2019-09-26T22:42:49.912265Z", "url": "https://files.pythonhosted.org/packages/42/ae/4193d30fcd7c90e6e197e969fb4300efb6091044d19b18161f209221f9b5/tesla_dashcam-0.1.14.tar.gz", "yanked": false}], "0.1.15": [{"comment_text": "", "digests": {"md5": "67bf8520d7b6ca9ca2cf1809a2232ea6", "sha256": "e5789452b191e290b0e486608507b005a0b9e98d079655455c2c9605a8052b70"}, "downloads": -1, "filename": "tesla_dashcam-0.1.15-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "67bf8520d7b6ca9ca2cf1809a2232ea6", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.7.0", "size": 41729, "upload_time": "2019-10-01T20:44:52", "upload_time_iso_8601": "2019-10-01T20:44:52.324778Z", "url": "https://files.pythonhosted.org/packages/a3/b3/71fd27f7a024ece6df4ae8c71b8214316ac382270e6e1b2be2cc8aca8745/tesla_dashcam-0.1.15-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "8b9127f3ff64294b86983cd878a97a9a", "sha256": "ce45c7dca8285c485d1a2d5732f6c96d143aa7e3c0c2e3a435099f6bc456ff7e"}, "downloads": -1, "filename": "tesla_dashcam-0.1.15.tar.gz", "has_sig": false, "md5_digest": "8b9127f3ff64294b86983cd878a97a9a", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7.0", "size": 63716, "upload_time": "2019-10-01T20:44:55", "upload_time_iso_8601": "2019-10-01T20:44:55.539603Z", "url": "https://files.pythonhosted.org/packages/c6/a8/c50cfcead6f7b6ed7a1ab2dd51fe752f970f7dd96c6c7357ed17447e04d7/tesla_dashcam-0.1.15.tar.gz", "yanked": false}], "0.1.15.post1": [{"comment_text": "", "digests": {"md5": "f8058d0ed6189e50e49268b82bd0dce6", "sha256": "165ebb0a56d7203eb2d22547e4e5462cb07bda9384bf282f48fa353d5e010ae6"}, "downloads": -1, "filename": "tesla_dashcam-0.1.15.post1-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "f8058d0ed6189e50e49268b82bd0dce6", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.7.0", "size": 41832, "upload_time": "2019-10-01T21:05:19", "upload_time_iso_8601": "2019-10-01T21:05:19.040159Z", "url": "https://files.pythonhosted.org/packages/d3/d0/2ef9d443344d2240621b3e171321a6ab50857de942eab8e6369614f988a5/tesla_dashcam-0.1.15.post1-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "67aacbdb8df013a7f34c2e5f359e8c97", "sha256": "cb91c29523422c09266c7efd74027e39f70028fd43977ac267a62a33a28eb54a"}, "downloads": -1, "filename": "tesla_dashcam-0.1.15.post1.tar.gz", "has_sig": false, "md5_digest": "67aacbdb8df013a7f34c2e5f359e8c97", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7.0", "size": 63746, "upload_time": "2019-10-01T21:05:21", "upload_time_iso_8601": "2019-10-01T21:05:21.723681Z", "url": "https://files.pythonhosted.org/packages/93/4d/bfb987de759a6d2b31300aa332492c98f352f6dab60dcb69aedb83f144da/tesla_dashcam-0.1.15.post1.tar.gz", "yanked": false}], "0.1.16": [{"comment_text": "", "digests": {"md5": "03fda2a83b403f6690f88d3b88b90c8d", "sha256": "bf38f6906b55abfe02ff752ec4353055847cf42df8d24a172a221c4e0f7f2aca"}, "downloads": -1, "filename": "tesla_dashcam-0.1.16-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "03fda2a83b403f6690f88d3b88b90c8d", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.7.0", "size": 49663, "upload_time": "2019-11-15T18:58:59", "upload_time_iso_8601": "2019-11-15T18:58:59.332069Z", "url": "https://files.pythonhosted.org/packages/88/51/fba698dab4b2b2b6be11599cb21351e955b9f4aed43ffad9ef9066909c16/tesla_dashcam-0.1.16-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "21c78c0064b8983995e233a1ec3ab3f7", "sha256": "05027679d47299c1b872fe40e0a2be2a6f4299bcf0da8b79ed45fbb650811e46"}, "downloads": -1, "filename": "tesla_dashcam-0.1.16.tar.gz", "has_sig": false, "md5_digest": "21c78c0064b8983995e233a1ec3ab3f7", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7.0", "size": 83721, "upload_time": "2019-11-15T18:59:01", "upload_time_iso_8601": "2019-11-15T18:59:01.939011Z", "url": "https://files.pythonhosted.org/packages/87/98/c0bbfed3453c1a6429344d35275b25e4467d750e4eb45233f1971cdceb48/tesla_dashcam-0.1.16.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "0d10a5b62bd9b51a81808f84598f4eaa", "sha256": "a9858fd127fb7f0c576db3eb0a4448a4f75d5877bc01789293db11ce8db2b23e"}, "downloads": -1, "filename": "tesla_dashcam-0.1.2-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "0d10a5b62bd9b51a81808f84598f4eaa", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5.3", "size": 12390, "upload_time": "2019-02-28T01:07:59", "upload_time_iso_8601": "2019-02-28T01:07:59.882280Z", "url": "https://files.pythonhosted.org/packages/e6/b9/366419a24ca3fac7d093e413585302cae839f963098abbf841506b58cd38/tesla_dashcam-0.1.2-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "145c2f68e50fee8c99e0e5237efedced", "sha256": "0e18d6239a3e3506bdc13d100d96e554231bddc90cf39513b7608136c191e599"}, "downloads": -1, "filename": "tesla_dashcam-0.1.2.tar.gz", "has_sig": false, "md5_digest": "145c2f68e50fee8c99e0e5237efedced", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5.3", "size": 9483, "upload_time": "2019-02-28T01:08:00", "upload_time_iso_8601": "2019-02-28T01:08:00.971316Z", "url": "https://files.pythonhosted.org/packages/5e/7c/32b4e51d45c283e7fc0a70e9ac857178ba50563f616b54c617638c28dde9/tesla_dashcam-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "54c0dbcb87cabe77fd82ebde6b26eb17", "sha256": "d3bb91331c3cd756908d4f51e39e0a0a9baebe6da510b32ea95be7f24f16d16b"}, "downloads": -1, "filename": "tesla_dashcam-0.1.3-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "54c0dbcb87cabe77fd82ebde6b26eb17", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5.3", "size": 12381, "upload_time": "2019-02-28T01:22:02", "upload_time_iso_8601": "2019-02-28T01:22:02.190768Z", "url": "https://files.pythonhosted.org/packages/55/f2/92f3b69ad8cb8f1086c51390e36f085ad920de82049360c34075ca759de1/tesla_dashcam-0.1.3-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "41d505a80cd00bcf6aefa9b81a6c861d", "sha256": "53e9f3179199c477415138b92430c8c409afc0995b352c88417d920be9413e2a"}, "downloads": -1, "filename": "tesla_dashcam-0.1.3.tar.gz", "has_sig": false, "md5_digest": "41d505a80cd00bcf6aefa9b81a6c861d", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5.3", "size": 9477, "upload_time": "2019-02-28T01:22:03", "upload_time_iso_8601": "2019-02-28T01:22:03.808875Z", "url": "https://files.pythonhosted.org/packages/b1/90/2f356d1678e103dfaca025f5f70795dc9ffc37d73555beb0da63e28001b1/tesla_dashcam-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "e52ebe6232ef260fb6814afba491a047", "sha256": "94bed3b668940ad2ddf2c2f8c19361a27a2cd6a247ff8117b41ae1acc3686fe3"}, "downloads": -1, "filename": "tesla_dashcam-0.1.4-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "e52ebe6232ef260fb6814afba491a047", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5.3", "size": 12785, "upload_time": "2019-02-28T04:36:36", "upload_time_iso_8601": "2019-02-28T04:36:36.237056Z", "url": "https://files.pythonhosted.org/packages/8f/77/d04eac8ce3cc278e150789e0df2d9e07cb7117afc9ebd1244be43daf8aac/tesla_dashcam-0.1.4-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "430f9cb8cf7061cb55e5402b591eb753", "sha256": "854f4c70cb2c4f5e46ef6d6f9a3f81dc14445ea16a369e7611e8170daf59392d"}, "downloads": -1, "filename": "tesla_dashcam-0.1.4.tar.gz", "has_sig": false, "md5_digest": "430f9cb8cf7061cb55e5402b591eb753", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5.3", "size": 11069, "upload_time": "2019-02-28T04:36:37", "upload_time_iso_8601": "2019-02-28T04:36:37.639635Z", "url": "https://files.pythonhosted.org/packages/91/0d/4588b70de96cdb1c6cd514683fb91b6efb2764de66615994111b108a7671/tesla_dashcam-0.1.4.tar.gz", "yanked": false}], "0.1.5": [{"comment_text": "", "digests": {"md5": "0231a015fd099f70f61fd94552deb689", "sha256": "5785a4bf709de5a3c831ba3b38186e71995c1257bb49e667d12bfb60b0372bc4"}, "downloads": -1, "filename": "tesla_dashcam-0.1.5-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "0231a015fd099f70f61fd94552deb689", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5.3", "size": 12809, "upload_time": "2019-03-14T15:14:51", "upload_time_iso_8601": "2019-03-14T15:14:51.720101Z", "url": "https://files.pythonhosted.org/packages/3a/19/a98fcdc6295d30f0cef9d86eaf80b8f0a3df533a1f0c3de7b86f466ab503/tesla_dashcam-0.1.5-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9cc4f9274b9372f33dd6ed446549f1cc", "sha256": "294f8d1cc5c6ebbd24ec48afc53d029f3c53c1085ec6b608abf7253ce971709e"}, "downloads": -1, "filename": "tesla_dashcam-0.1.5.tar.gz", "has_sig": false, "md5_digest": "9cc4f9274b9372f33dd6ed446549f1cc", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5.3", "size": 11109, "upload_time": "2019-03-14T15:14:53", "upload_time_iso_8601": "2019-03-14T15:14:53.284565Z", "url": "https://files.pythonhosted.org/packages/5d/14/99702833473a44871b1e1a4dda22476665c49263e821ba48c03a74dab466/tesla_dashcam-0.1.5.tar.gz", "yanked": false}], "0.1.6": [{"comment_text": "", "digests": {"md5": "fefbd0692c5dd6b0b84499c50682b2d0", "sha256": "f5a5373c5c40cb2fa3400f7f4b2e482aa504e84de4534e3f6e047dc0fe2ad656"}, "downloads": -1, "filename": "tesla_dashcam-0.1.6-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "fefbd0692c5dd6b0b84499c50682b2d0", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5.3", "size": 13156, "upload_time": "2019-03-14T23:54:45", "upload_time_iso_8601": "2019-03-14T23:54:45.341571Z", "url": "https://files.pythonhosted.org/packages/be/fa/a8d1404e74877ceff0b8ed9c43e5e6934011bbd2435859557b3a34ca21ec/tesla_dashcam-0.1.6-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "504153746ef369cebfaca8745c471286", "sha256": "733746030a1b82f05a5bf7d9ce695f34c0de65051acafe7dad6f2ab68b4d6482"}, "downloads": -1, "filename": "tesla_dashcam-0.1.6.tar.gz", "has_sig": false, "md5_digest": "504153746ef369cebfaca8745c471286", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5.3", "size": 11780, "upload_time": "2019-03-14T23:54:46", "upload_time_iso_8601": "2019-03-14T23:54:46.710038Z", "url": "https://files.pythonhosted.org/packages/f7/cf/c2762e4e6afd35de2659f9a240d1871f96ad938d46051cab493673b5d65d/tesla_dashcam-0.1.6.tar.gz", "yanked": false}], "0.1.7": [{"comment_text": "", "digests": {"md5": "e2b467c98e06739161449d546941d990", "sha256": "c9730e4be94bb77f7582cdeaf226b9936f186c210173d61d7ecca047eb55f3c2"}, "downloads": -1, "filename": "tesla_dashcam-0.1.7-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "e2b467c98e06739161449d546941d990", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5.3", "size": 18791, "upload_time": "2019-03-18T18:09:07", "upload_time_iso_8601": "2019-03-18T18:09:07.814251Z", "url": "https://files.pythonhosted.org/packages/06/36/01cc31b7b851c12180ec462e192489a20868306fee69ecf2d9f8cd99da16/tesla_dashcam-0.1.7-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "998de68d700301540a9c6037be6af37c", "sha256": "83bd997ba5a33d50fb4e63ccbe0ae7e1b2e3f118363d45d41fd35d8b9bc84215"}, "downloads": -1, "filename": "tesla_dashcam-0.1.7.tar.gz", "has_sig": false, "md5_digest": "998de68d700301540a9c6037be6af37c", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5.3", "size": 13920, "upload_time": "2019-03-18T18:09:09", "upload_time_iso_8601": "2019-03-18T18:09:09.205799Z", "url": "https://files.pythonhosted.org/packages/17/1f/5c5f13096ef1347405208636391f2d8c20cafaab88395ea02bd350c02c95/tesla_dashcam-0.1.7.tar.gz", "yanked": false}], "0.1.8": [{"comment_text": "", "digests": {"md5": "0fe5ebf146c1026583262cb1e1698ba9", "sha256": "9890f9049e1d2914344c3b423d3dd54c37642c4e2c4a547824c6d777b71d5fb3"}, "downloads": -1, "filename": "tesla_dashcam-0.1.8-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "0fe5ebf146c1026583262cb1e1698ba9", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.5.3", "size": 23330, "upload_time": "2019-04-03T00:00:10", "upload_time_iso_8601": "2019-04-03T00:00:10.470173Z", "url": "https://files.pythonhosted.org/packages/99/5a/0f740e14cd0d83a42d26afe2b2ee05c3e867d7327320d64092de13ee8a1d/tesla_dashcam-0.1.8-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "234be27fdff86bbc01a22fa06b45c282", "sha256": "039f7eef3ace76bf002063e4947f3b45f1e123afb27f1aa5c40e81ed66016822"}, "downloads": -1, "filename": "tesla_dashcam-0.1.8.tar.gz", "has_sig": false, "md5_digest": "234be27fdff86bbc01a22fa06b45c282", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5.3", "size": 20155, "upload_time": "2019-04-03T00:00:12", "upload_time_iso_8601": "2019-04-03T00:00:12.757459Z", "url": "https://files.pythonhosted.org/packages/68/ac/e468be345ad459cfd0d36d0f499828652497ed3c4547c0cebf9bc7be3fad/tesla_dashcam-0.1.8.tar.gz", "yanked": false}], "0.1.9": [{"comment_text": "", "digests": {"md5": "07670703522edb2042981d3098924e1e", "sha256": "8578eba7df4beb85fecd24f7424bf739bf7cd32022b5c418abf1ef868a12e17a"}, "downloads": -1, "filename": "tesla_dashcam-0.1.9-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "07670703522edb2042981d3098924e1e", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.7.0", "size": 27449, "upload_time": "2019-05-01T20:40:25", "upload_time_iso_8601": "2019-05-01T20:40:25.759690Z", "url": "https://files.pythonhosted.org/packages/1b/f6/9ff814475ac2173e1f1ee51f6ef59a961efdc4ff5deed1b6f6195b99904a/tesla_dashcam-0.1.9-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b1d982e191fb54e5df228a5c446016de", "sha256": "d19bc5622338928715f8b1a3b3c81c0da1b575f0100b785d06119b5fce6ea672"}, "downloads": -1, "filename": "tesla_dashcam-0.1.9.tar.gz", "has_sig": false, "md5_digest": "b1d982e191fb54e5df228a5c446016de", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7.0", "size": 31954, "upload_time": "2019-05-01T20:40:27", "upload_time_iso_8601": "2019-05-01T20:40:27.107637Z", "url": "https://files.pythonhosted.org/packages/bc/d8/86cdc18fb86ed45c13c496b7af375685982a2feefafab0aa83dd50ca6057/tesla_dashcam-0.1.9.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "03fda2a83b403f6690f88d3b88b90c8d", "sha256": "bf38f6906b55abfe02ff752ec4353055847cf42df8d24a172a221c4e0f7f2aca"}, "downloads": -1, "filename": "tesla_dashcam-0.1.16-py2.py3-none-any.whl", "has_sig": false, "md5_digest": "03fda2a83b403f6690f88d3b88b90c8d", "packagetype": "bdist_wheel", "python_version": "py2.py3", "requires_python": ">=3.7.0", "size": 49663, "upload_time": "2019-11-15T18:58:59", "upload_time_iso_8601": "2019-11-15T18:58:59.332069Z", "url": "https://files.pythonhosted.org/packages/88/51/fba698dab4b2b2b6be11599cb21351e955b9f4aed43ffad9ef9066909c16/tesla_dashcam-0.1.16-py2.py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "21c78c0064b8983995e233a1ec3ab3f7", "sha256": "05027679d47299c1b872fe40e0a2be2a6f4299bcf0da8b79ed45fbb650811e46"}, "downloads": -1, "filename": "tesla_dashcam-0.1.16.tar.gz", "has_sig": false, "md5_digest": "21c78c0064b8983995e233a1ec3ab3f7", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.7.0", "size": 83721, "upload_time": "2019-11-15T18:59:01", "upload_time_iso_8601": "2019-11-15T18:59:01.939011Z", "url": "https://files.pythonhosted.org/packages/87/98/c0bbfed3453c1a6429344d35275b25e4467d750e4eb45233f1971cdceb48/tesla_dashcam-0.1.16.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:55:43 2020"}