{"info": {"author": "Nora L. Eisner", "author_email": "nora.eisner@new.ox.ac.uk", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.7"], "description": "# LATTE\n\nWritten by Nora L. Eisner\n\nemail: *nora.eisner@new.ox.ac.uk*\n\n### THE CODE\n\n--------\n\n*The aim of this code is to provide a series of diagnostic tests which are used in order to determine the nature of events found in *TESS* lightcurves.*\n\nLATTE is an open source Python package that performs standard diagnostic tests to help identify, vet and characterise signals in the *TESS* lightcurves in order to weed out instrumental and astrophysical false positives. The program is designed to allow for a fast, in depth analysis of targets that have already been identified as promising candidates by the main *TESS* pipelines or via alternative methods such as citizen science. The code automatically downloads the data products for any chosen TIC ID (short or long cadence TESS data) and produces a number of diagnostic plots (outlined below) that are compiled in a concise report. \n\nThe implemented diagnostic tests are similar to the ‘Data Validation’ steps performed by the Science Processing Operations Center (SPOC)pipeline for the short-cadence data, and by the quick-look pipeline (QLP) for the long-cadence data. However, while the SPOC pipeline tests are performed on a selection of two-minute cadence *TESS* targets only, LATTE allows for the analysis of any *TESS* target with a valid TIC ID, including both the two-minute and thirty-minute cadence targets.\n\nThe code is designed to be fully interactive and does not require any prior knowledge of python coding. \n\n--------\n--------\n\n### Installation\n\nLATTE requires python3 to be installed on your computer, which can be download from https://www.python.org/downloads/. Once you have python3, you can download the code directly from the LATTE Github page. Alternatively, you can install LATTE using pip (https://pypi.org/project/tessLATTE/) via your command line with:\n\n\tpip3 install tessLATTE      \n\nIn order for LATTE to work you will need to have the right versions of certain modules installed, so downloading it in a virtual environment. **Note: ensure that the matplotlib version that you are using is v3.2.0rc1 (pip install matplotlib==3.2.0rc1). You will also need a module called TKinter installed. If this is not already installed, please use: sudo apt-get install python3-tk.**\n\nThe first time that the program is run you will be prompted to enter a path to a file on your computer where all the output data will be stored (this path can be changed later using --new-path). The first time that the code is run it will also have to download the text data files from MAST, which are around 325M. This download will only have to run in full once but may take a couple of minutes to complete. Please note that this step does not download any of the actual TESS data, but only text files that contain curl scripts that are needed to download individual light curves when LATTE is run. This one-time bulk download increases the speed of LATTE by ensuring that these curl scripts do not have be downloaded every time that the code is executed.\n\nIf the code doesn't run when you first install it, this could be due to an SSL issue. To check, please try executing the following command from your command line: **python -m tess_stars2px -t 261136679**.\n\nIf this command returns the error: *\"ssl.SSLError: [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed\"*, you will need to change your SSL settings, which can be done following these [instructions](https://timonweb.com/tutorials/fixing-certificate_verify_failed-error-when-trying-requests_html-out-on-mac/). \n\n\n### How to run it?\n\nLATTE is simply run through the command line with:\n\n\tpython3 -m LATTE      or     python3 -m LATTE --new-data     (if run for the first time or when new data is released)\n\nThis will open up a box for you that prompts you to enter a TIC ID and indicate whether you would like to extract the information from the 2-minute cadence ('Standard mode') or 30-minute cadence Full Frame Image (FFI) data ('FFI mode').\n\nOnce a TIC ID has been entered, the program will tell you in what sectors that target has been observed. If you want to look at all of the sectors, either enter them or simply press enter with nothing in the box. Alternatively, enter the sectors that you are interested in and enter them separated by commas. Remember that LATTE will have to download all the data for each sector so you might not always want to look at all of the sectors. \n\n**Normal Mode**\n\nThe '*normal mode*' looks at the short-cadence *TESS* data which has already been detrended and extracted by the SPOC pipeline. Optimal aperture lightcurve extraction aperture sizes have therefore already been identified and do not need to be selected manually.\n\n**FFI Mode**\n\nIn *FFI mode* the data is downloaded using TESScut and the data detrended using PCA, a moving average filter and k-sigma clipping. Unlike the *TESS* 2-minute cadence targets, the FFIs do not come with a pre-chosen optimal aperture. By default, the user is given the option to manually select the pixels within each aperture for a 'large' and a 'small' aperture. This GUI opens automatically and the two apertures are selected by clicking on the desired pixels in the interface (see image below). The two (large and small aperture) lightcurves are simultaneously displayed. When the FFI mode is run with the command '--auto', the aperture size is chosen manually using a threshold flux value centred at the midpoint of the postage stamp.\n\nPlease see the LATTE Github page for an example of what the interface looks like.\n\n## Input target list\n\nIn order to efficiently generate diagnostic plots for multiple targets without having to interactively enter the target TIC IDs, LATTE can be executed with an input file that lists the TIC IDs, the times of the transit-like events, and the observational sectors to consider (if known). See example. In the cases where the times of the transit events or the sectors have not been entered, the user is prompted to enter these manually via the GUI, as described above. For longer target lists the code can also be parallelized (see example). If you want to run it with this mode, enter: \n\n\tpython3 -m LATTE --targetlist=path/to/the/csv/input/file\n\nThe program will skip targets that have already been analysed by you, so if you want to overwrite data add '--o' to the command.\n\n### Transit time selection\n\nOnce you have identified the TIC ID, the observational sectors and the aperture sizes (*FFI mode* only), you will see a screen that has the full lightcurve as well as a zoom in of the lightcurve (see figure below). The solid red line across the full lightcurve lets you know where on the lightcurve you are zooming in on. Click on the top (full) or bottom (zoomed in) plots to change the location of the zoom in until the red vertical line is centred on the mid-point of a transit-event. When you are happy with the location press the 'Add Time' button below the plots in order to record this time (in TBJD). You can delete wrongly entered times with the 'Delete time'. The saved times will be shown on the screen. The position of the red line can also be changed by dragging the teal coloured 'Transit' slider with your mouse. The y-scale of the plots can be changed with the grey coloured slider.\n\nPlease see the LATTE Github page for an example of what the interface looks like.\n\nAdditional options are displayed to the left of the plot.\n\nSector Selection: \n- The sectors that you have chosen to look at are listed in the 'Sector' bar below the plot. You can change the sector to look at by clicking on the corresponding number in the bar, or on 'all' too look at all of them. Alternatively you can use the arrows to the right of the bar to scroll through them. Only the top panel will change. \n\nBinning Factor: \n- change the binning of the top plot (only available in the normal and not FFI mode)\n\nSettings:\n- Simple: only run the most basic diagnostic tests (not suing TPF). This is for a very quick analysis. \n- Show Plots: Display the plots after they are made. This slows down the code but allows you to see and analyse them as they are being made.\n- North: Align all the images due North (this slows down the code).\n- BLS: Run a Box-Least-Squares algorithm that searches for periodic signals in the lightcurve. \n- Save: Save all the images (default this is already checked)\n- Report: Generate a pdf file at the end of the code to summarise the findings (default this is already checked).\n\nFinally, there is an optional box to enter a 'Memorable name' for the candidate. This name is used to store the data at the end in order to make identifying certain targets easier.\n\nOnce all the options have been chosen and the transit times stored (you have to enter at least one transit time), press the orange 'Done' button to continue.\n\nThe code will then generate download and process all of the data. Note that all the data is downloaded but not stored. The more sectors you analyse in one go the longer the code will take to run.\n\n\n### Output\n\nFor more information on how to interpret the results shown in the reports look at the 'How to make a LATTE' document in the 'example' folder. Please see the LATTE Github page for example plots.\n\n**Figures:**\n\n- Full lightcurve with the times of the momentum dumps marked. \n\n\nThe solid red lines at the bottom of the figure indicated the times of the reaction wheel momentum dumps and the dashed black line(s) show the times of the marked transit events. Momentum dumps occur around every 2 to 2.5 days and typically last around half an hour. This can affect the satellite pointing, resulting in spurious transit-like signals. \n\n\n- Background flux around the times of the marked transit event(s).\n\nEnhanced scattered light in the telescope optics can cause the background flux to rise sharply each time TESS approaches the perigee of its eccentric orbit around the Earth. Additionally, solar system objects, such as asteroids passing through the field of view will show up as a spike in the background flux. Both of these can result in a transit-like signal in the light curve. \n\n\n- Centroid positions around the time of the marked transit event(s).\n\nThe black points shows the CCD column and row position of the target’s flux-weighted centroid. The red shows the CCD column and row local motion differential velocity aberration (DVA), pointing drift, and thermal effects. Significant spikes in either of these at the time of the transit-like event suggest that the signal is not due to a transiting planet. \n\n\n- The lightcurve around the time of the marked event(s) extracted in two different aperture sizes. \n\nFor a transiting planet, the transit shape and depth are expected to remain constant when extracted with different aperture sizes. Conversely, they are expected to change if the signal is due to a blended eclipsing binary. This is because for blended binaries, the signal is not centred on the target and instead originates from elsewhere in the field of view, thus changing the shape and depth of the signal with different apertures. I caution that if the selected aperture is not centred on the target, this test can lead to the mis-interpretation of a moving signal. I, therefore, recommend to always check the figure showing the used apertures before interpreting these results. These data are extracted from the Target Pixel Files (TPFs) and are neither detrended nor corrected for systematics.\n\n\n- The apertures used for the extraction. Please note that for very bright and very faint stars the aperture selection for the smaller aperture may not work correctly so these should be checked in order to correctly interpret the results.\n\n- The average flux in and out of the marked event(s) and the differences between the two.\n\nA plot showing the average in-transit and average out of-transit flux as well as the difference between the two. A change in spatial distribution of the flux suggests that the transit-like event is caused by a blend with a background eclipsing binary. The data are extracted from the TPFs and corrected for systematic effects using Principal Component Analysis. \n\n- The average flux of the target pixel file with the locations of nearby stars (magnitude < 15) indicated (GAIA DR2 queried).\n\nA plot showing the location of nearby stars brighter than *TESS* magnitude 17 as queried from the Gaia Data Release 2 catalogue and the DSS2 red field of view around the target star. The sizes of the markers indicate the positions of the Gaia stars relate to the magnitude of each companion. The *Astropy reproject* module is used to align the plots such that north points towards the top of the page.\n\n- The lightcurves of the 5 closest stars that were also observed by *TESS* (TP files).\n\nLightcurves of the five two-minute cadence stars closest to the selected target. The occurrence of similar transit-like events in nearby lightcurves may suggest that the signal is caused by a background event or a blended eclipsing binary.\n\n- A lightcurve around the time of the marked event(s) extracted for every pixel in the target pixel file.\n\nA plot showing lightcurves extracted for each individual pixel around the target. The data are extracted from the TPFs and detrended using a third order spline fit. If the transit-like signal is more prominent in pixels that are not centred on the target star, this suggests that the signal is caused by a blended background eclipsing binary. \n\n- (optional) Two simple BLS plots that look for periodic signals in the data. The second with the highest detected signal-to-noise transits from the initial run removed.\n- (in progress, will be available in next release of LATTE) Modelling of the signal using a Bayesian approach with an MCMC sampling. This makes use of the Pyaneti code (Barragan et al. 2017). \n\n**FFI Mode**\n\n- The FFI mode currently does not plot the nearby stars lightcurves (will be implemented soon).\n- Saves the extracted apertures used\n- Saves the corrected and the uncorrected lightcurves to verify that the detrending is working correctly - there's are nt stored in the DV reports. \n\n\n**Tables:**\n\n- Stellar parameters summarized, as well as information to whether the target has been flagged as a TCE or a TOI. The table links to the relevant reports (if applicable) as well as to the Exofop page on the star.\n- (optional) Summary of the BLS results. \n- (optional) Fitting parameters with uncertainties from the modelling. \n\n### Arguments\n\nNOTE: all of these arguments (except new-path, auto and targetlist, new-data) can be changed as option in the GUI. They are arguments in case the same options wish to be run multiple times and the user therefore wishes to identify them in the command line when the program is executed.\n\n**--new-data**  The code requires multiple text files to be stored on your computer in order to run - these are downloaded automatically from the MAST server. The first time the program is run, and any time that there is new data available, add **--new-data** to the command line when running the program. The code checks what data has already been downloaded and doesn't re-download anything that already exists.\n\n**--auto** When looking at the FFIs, the default option is that you choose both the large and small apertures interactively. In order for the system to choose them run the command with '--auto'.\n\n**--targetlist***=path/to/the/csv/input/file* instead of entering the information manually every time, you can provide LATTE with an input file which lists all the TIC IDs and the times of the transit events. Look at the example file to see the required format of the information.\n\n**--new-path** If you want to define a new path to store the data.\n\n**--o** If the input target list option is chosen, the program will check whether each target has already been analysed, in which case it will skip this target. If you do not wish to skip targets that have already been assessed use this in order to specify the 'overwrite' option. When the program is run interactively (not with an input file) this option has no effect.\n\n**--noshow** if you do not want the figures to pop up on your screen you can run the program with this command in the command line. The program will run significantly faster with this run. If this option is chosen the files are always saved (also option in the GUI)\n\n**--nickname** In order to keep track of all of the candidates, it can be useful to asign them a nickname. This can be entered here which will simply change the name of the folder at the end (also option in the GUI)\n\n**--FFI** If you want to look at an FFI write '--FFI' in the command line (also option in the GUI) \n\n**--north** If you want all the images to be oriented due north (this is not the default as it takes longer to run)\n\n**--mpi** If the code is parallelized (see example), this needs to be entered in the command line. This is because the module that reprojects the TPFs, astroplan, cannot be parallelized due to problems with multiple processes accessing python's shelve storage at the same time.\n\n**--tic** You can skip the box to enter the tic ID by entering it in the command line with e.g. --tic=55525572. \n\n**--sector** You can skip entering the sectors by entering them in the command line with e.g. --sector=2,5. You will need to know in what sectors this target was observed (option in the GUI)\n\n\n### Example\n\nPlease see the LATTE Github page for a short video that shows how to run LATTE for example target TIC 94986319 (TOI 421). The output files that this example produces can be found in the folder called 'example_output'. The summary DV report, which can be found in this folder, can be used to verify that this these target stars pass all of the initial vetting stages and inform decisions as to whether to follow it up using ground based telescopes. \n\n\nIf you want to set or change the input/output path, alter the terminal command to: \n\n\tpython -m LATTE --new-path\n\nand if you want to download new data (or check for new data) use the command: \n\n\tpython -m LATTE --new-data\n\n\n#### MPI example\n\nIf you have a computer with multiple cores you can generate multiple reports in one go by parallelizing the code. There is an example script for how this can be done on the Github page, although I caution that the code may have to be adapted to work with your operating system. \n\nThe MPI code requires an input file (see 'example_input_file.csv'). In order to keep track of the targets that have been processed, the code generates a manifest file listing some of the information of the processed targets such as the transit-event times, the RA, Dec, sectors, TMag, Teff, whether it's a TOI and the link to the TCE report if it's available. \n\nAn additional input parameter for this code is --number. This sets the number of targets that you want to analyse from the list. For example, if you have a list of 1000 targets but you only want to look at the first 10, you can set --number=10. \n\nOn a mac, the example parallelized code can be executed using: \n\n\tmpiexec -np 2 python example_parallelized_code.py --targetlist=/path/to/input/code/example/example_input_file.csv --number=10  --mpi\n\nIt's import that you add the --mpi, otherwise the code cannot be parallelized due to memory conflicts. \n\n\n### LATTE workflow - what is being downloaded, when and why?\n\nBelow is an outline of how the code works and when it downloads the various different data files. \n\n1) When the code is first executed, a number of text files are downloaded which are required for the code run more quickly for all subsequent runs. These include: \n\n\ta) Two text files for each TESS observational sector, one for the short cadence light curves, and one for the target pixel files, which contain curl commands that link to the download of each individual TESS light curve. These are simply text files and no actual TESS data and will only have to be downloaded once for each sector. This is in order to increase the speed of the code later on. These files are around 3.9 MB each.\n\n\tb) One text file for each sector containing the RA, Dec and TESS magnitude for each target (760 KB per file). This information is used to identify the TIC IDs of the 5 closest TESS short-cadence targets.\n\n\tc) One file that lists the times of the momentum dumps across all of the sectors (23 KB). In order to generate this file one lightcurve is downloaded from each sector and the data extracted. These lightcurves are opened but never saved. This is only needed when looking at the FFIs.\n\n\td) A list of all of the confirmed TOIs (274 KB) and all of the targets that were flagged as TCEs by the SPOC pipeline (20.2 MB). \n\n2) When you run LATTE, you will first be prompted to enter the TIC ID. Once the TIC ID has been entered, LATTE calls a program known as 'tess-point', which tells us in which TESS observational sectors this target was observed in. This information is stored in a temporary text file so that it can be accessed by the code later on. \n\n3) You are then prompted to enter the observational sectors that you want to look at in more detail. At this point LATTE opens the short cadence text files for each observational sector that you entered, and uses the curl scripts for the relevant TIC ID to download a short-cadence light curve (2MB per light curve). The more sectors that you stated to look at, the longer this step will take. If you chose the 'simple' option within the TESS GUI, this will be the only data that is downloaded. \n\n4) Once you have identified the times of the transit like events, the code will generate a plot showing the background flux, and one showing the mean centroid positions. These plots use the already downloaded lightcurve file. \n\n5) Next, the code will download the target pixel file using the lightkurve package (unless you run the 'simple' mode). This file is downloaded once the centroid plot has been closed and used to extract lightcurves with two different aperture sizes. Due to the size of the file and the time taken to determine the optimal aperture size, this step may take a couple of seconds to complete. \n\n6) The next figure shows the brightest stars surrounding the target, both on the average TPF data and on an SDSS image. The target pixel files are downloaded directly from the MAST server at this stage (48 MB per light curve), using the previously downloaded curl scripts. This file is larger than the light curve data and will therefore take longer to download. This file will be used for multiple plots. If the 'north' option has been selected, the image will be reprojected such that both images are oriented such that North is directed upwards. This option takes longer.\n\n7) The next figure compares the flux in-transit to out-of-transit for each marked transit-like event. This uses the already downloaded TPF and should therefore not take long to load. \n\n8) The next figure shows a lightcurve extracted for each pixel surrounding the target around the time of the marked transit-like event using the already downloaded TPF. This is done individually for each marked transit and will therefore take longer if more transit have been identified. Your terminal window will indicate how much longer this step takes to run. \n\n9) If more than one transit-like event has been identified, the lightcurve will be phase folded. This uses the previously downloaded lightcurve file and should be completed very quickly. \n\n10) The next figure shows the lightcurves of the five closest short-cadence TESS stars to the target. The data for each star is downloaded using the curl scripts. Your terminal window will indicate once each lightcurve has been downloaded successfully. \n\n11) The final step is to compile and save the LATTE data validation report. \n\n\n### Overview of the main LATTE scripts\n\n__main__.py      : Initialises the parameters: TIC ID, Sector, FFI or not, run with input file or not, check that the data has been downloaded etc. In brief, this code is designed check that all of the input parameters are consistent with one another and informs the rest of the code how to run. \n\nLATTEutils.py    : All the functions needed to download data and text files, function to run the interactive GUI and all of the plotting and data handling. Functions in this script are called both from 'main' and from 'brew'.\n\nLATTE_DV.py      : Script to combine all of the results from LATTEbrew in order to generate a pdf data validation report.\n\nLATTEbrew.py     : Script that calls the LATTEutils functions in turn in order to store the results. Calls the LATTE_DV.py function to collate all the results at the end.\n\n\n### Perform automated tests\n\nThe code has been tested using the python unittest module. There are a number of tests including testing the connections to the servers where data is downloaded as well as tests that process pre-downloaded data in order to ensure that the outputs are as expected. In order to execute the tests please clone the GitHub LATTE repository. You must then be in the parent LATTE directory and from there you can run all the tests using: \n\n\tpython3 -m unittest\n\nor individual tests using, for example: \n\n\tpython3 -m unittest LATTE/tests/test_DVreport.py\n\nBefore running the tests makes sure that you have configured an output path (*python3 -m LATTE --new-path*) and that the data files are downloaded (*python3 -m LATTE --new-data*). \n\n### Contributing\n\nIf you believe that you have found any bugs in the code or if you need help or have any questions or suggestions, please feel free to file a new Github issue. You can also raise an issue or a pull request which fixes the issue. Please see CONTRIBUTING.md for more details. \n\n\n### Future Work\n\nThe next release will allow for the option to model the transit-like events using the open source package *Pyaneti* [@pyaneti] which uses a Bayesian approach with an MCMC sampling to determine the parameters of the best-fit.\n\nFuture releases will also allow for modelling and removal of periodic trends in the light curve. This is useful for the detection and circumbinary planets and for the analysis of multi-star systems. \n\n\n### License \n\nLATTE can be used under GNU Lesser General Public License v3.0\n\n\n### Acknowledgements\n\nI thank all of the Planet Hunters *TESS* volunteers whose dedication to the project encouraged me to write this analysis tool. I am also extremely grateful to all of the support provided by the Zooniverse team and the Oxford exoplanet group.\n\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/noraeisner/LATTE", "keywords": "", "license": "GNU Lesser General Public License v3.0", "maintainer": "", "maintainer_email": "", "name": "tessLATTE", "package_url": "https://pypi.org/project/tessLATTE/", "platform": "", "project_url": "https://pypi.org/project/tessLATTE/", "project_urls": {"Homepage": "https://github.com/noraeisner/LATTE"}, "release_url": "https://pypi.org/project/tessLATTE/0.1.18/", "requires_dist": ["numpy", "pandas", "seaborn", "requests", "lightkurve (>1.2.0)", "matplotlib (==3.2.0rc1)", "astroplan", "astroquery", "sklearn", "scipy", "tess-point", "reproject (==0.4)", "reportlab", "astropy (==3.1.1)", "mock (>2.0.0)"], "requires_python": "", "summary": "Lightcurve Analysis Tool for Transiting Exoplanets", "version": "0.1.18", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>LATTE</h1>\n<p>Written by Nora L. Eisner</p>\n<p>email: <em><a href=\"mailto:nora.eisner@new.ox.ac.uk\">nora.eisner@new.ox.ac.uk</a></em></p>\n<h3>THE CODE</h3>\n<hr>\n<p><em>The aim of this code is to provide a series of diagnostic tests which are used in order to determine the nature of events found in <em>TESS</em> lightcurves.</em></p>\n<p>LATTE is an open source Python package that performs standard diagnostic tests to help identify, vet and characterise signals in the <em>TESS</em> lightcurves in order to weed out instrumental and astrophysical false positives. The program is designed to allow for a fast, in depth analysis of targets that have already been identified as promising candidates by the main <em>TESS</em> pipelines or via alternative methods such as citizen science. The code automatically downloads the data products for any chosen TIC ID (short or long cadence TESS data) and produces a number of diagnostic plots (outlined below) that are compiled in a concise report.</p>\n<p>The implemented diagnostic tests are similar to the ‘Data Validation’ steps performed by the Science Processing Operations Center (SPOC)pipeline for the short-cadence data, and by the quick-look pipeline (QLP) for the long-cadence data. However, while the SPOC pipeline tests are performed on a selection of two-minute cadence <em>TESS</em> targets only, LATTE allows for the analysis of any <em>TESS</em> target with a valid TIC ID, including both the two-minute and thirty-minute cadence targets.</p>\n<p>The code is designed to be fully interactive and does not require any prior knowledge of python coding.</p>\n<hr>\n<hr>\n<h3>Installation</h3>\n<p>LATTE requires python3 to be installed on your computer, which can be download from <a href=\"https://www.python.org/downloads/\" rel=\"nofollow\">https://www.python.org/downloads/</a>. Once you have python3, you can download the code directly from the LATTE Github page. Alternatively, you can install LATTE using pip (<a href=\"https://pypi.org/project/tessLATTE/\" rel=\"nofollow\">https://pypi.org/project/tessLATTE/</a>) via your command line with:</p>\n<pre><code>pip3 install tessLATTE      \n</code></pre>\n<p>In order for LATTE to work you will need to have the right versions of certain modules installed, so downloading it in a virtual environment. <strong>Note: ensure that the matplotlib version that you are using is v3.2.0rc1 (pip install matplotlib==3.2.0rc1). You will also need a module called TKinter installed. If this is not already installed, please use: sudo apt-get install python3-tk.</strong></p>\n<p>The first time that the program is run you will be prompted to enter a path to a file on your computer where all the output data will be stored (this path can be changed later using --new-path). The first time that the code is run it will also have to download the text data files from MAST, which are around 325M. This download will only have to run in full once but may take a couple of minutes to complete. Please note that this step does not download any of the actual TESS data, but only text files that contain curl scripts that are needed to download individual light curves when LATTE is run. This one-time bulk download increases the speed of LATTE by ensuring that these curl scripts do not have be downloaded every time that the code is executed.</p>\n<p>If the code doesn't run when you first install it, this could be due to an SSL issue. To check, please try executing the following command from your command line: <strong>python -m tess_stars2px -t 261136679</strong>.</p>\n<p>If this command returns the error: <em>\"ssl.SSLError: [SSL: CERTIFICATE_VERIFY_FAILED] certificate verify failed\"</em>, you will need to change your SSL settings, which can be done following these <a href=\"https://timonweb.com/tutorials/fixing-certificate_verify_failed-error-when-trying-requests_html-out-on-mac/\" rel=\"nofollow\">instructions</a>.</p>\n<h3>How to run it?</h3>\n<p>LATTE is simply run through the command line with:</p>\n<pre><code>python3 -m LATTE      or     python3 -m LATTE --new-data     (if run for the first time or when new data is released)\n</code></pre>\n<p>This will open up a box for you that prompts you to enter a TIC ID and indicate whether you would like to extract the information from the 2-minute cadence ('Standard mode') or 30-minute cadence Full Frame Image (FFI) data ('FFI mode').</p>\n<p>Once a TIC ID has been entered, the program will tell you in what sectors that target has been observed. If you want to look at all of the sectors, either enter them or simply press enter with nothing in the box. Alternatively, enter the sectors that you are interested in and enter them separated by commas. Remember that LATTE will have to download all the data for each sector so you might not always want to look at all of the sectors.</p>\n<p><strong>Normal Mode</strong></p>\n<p>The '<em>normal mode</em>' looks at the short-cadence <em>TESS</em> data which has already been detrended and extracted by the SPOC pipeline. Optimal aperture lightcurve extraction aperture sizes have therefore already been identified and do not need to be selected manually.</p>\n<p><strong>FFI Mode</strong></p>\n<p>In <em>FFI mode</em> the data is downloaded using TESScut and the data detrended using PCA, a moving average filter and k-sigma clipping. Unlike the <em>TESS</em> 2-minute cadence targets, the FFIs do not come with a pre-chosen optimal aperture. By default, the user is given the option to manually select the pixels within each aperture for a 'large' and a 'small' aperture. This GUI opens automatically and the two apertures are selected by clicking on the desired pixels in the interface (see image below). The two (large and small aperture) lightcurves are simultaneously displayed. When the FFI mode is run with the command '--auto', the aperture size is chosen manually using a threshold flux value centred at the midpoint of the postage stamp.</p>\n<p>Please see the LATTE Github page for an example of what the interface looks like.</p>\n<h2>Input target list</h2>\n<p>In order to efficiently generate diagnostic plots for multiple targets without having to interactively enter the target TIC IDs, LATTE can be executed with an input file that lists the TIC IDs, the times of the transit-like events, and the observational sectors to consider (if known). See example. In the cases where the times of the transit events or the sectors have not been entered, the user is prompted to enter these manually via the GUI, as described above. For longer target lists the code can also be parallelized (see example). If you want to run it with this mode, enter:</p>\n<pre><code>python3 -m LATTE --targetlist=path/to/the/csv/input/file\n</code></pre>\n<p>The program will skip targets that have already been analysed by you, so if you want to overwrite data add '--o' to the command.</p>\n<h3>Transit time selection</h3>\n<p>Once you have identified the TIC ID, the observational sectors and the aperture sizes (<em>FFI mode</em> only), you will see a screen that has the full lightcurve as well as a zoom in of the lightcurve (see figure below). The solid red line across the full lightcurve lets you know where on the lightcurve you are zooming in on. Click on the top (full) or bottom (zoomed in) plots to change the location of the zoom in until the red vertical line is centred on the mid-point of a transit-event. When you are happy with the location press the 'Add Time' button below the plots in order to record this time (in TBJD). You can delete wrongly entered times with the 'Delete time'. The saved times will be shown on the screen. The position of the red line can also be changed by dragging the teal coloured 'Transit' slider with your mouse. The y-scale of the plots can be changed with the grey coloured slider.</p>\n<p>Please see the LATTE Github page for an example of what the interface looks like.</p>\n<p>Additional options are displayed to the left of the plot.</p>\n<p>Sector Selection:</p>\n<ul>\n<li>The sectors that you have chosen to look at are listed in the 'Sector' bar below the plot. You can change the sector to look at by clicking on the corresponding number in the bar, or on 'all' too look at all of them. Alternatively you can use the arrows to the right of the bar to scroll through them. Only the top panel will change.</li>\n</ul>\n<p>Binning Factor:</p>\n<ul>\n<li>change the binning of the top plot (only available in the normal and not FFI mode)</li>\n</ul>\n<p>Settings:</p>\n<ul>\n<li>Simple: only run the most basic diagnostic tests (not suing TPF). This is for a very quick analysis.</li>\n<li>Show Plots: Display the plots after they are made. This slows down the code but allows you to see and analyse them as they are being made.</li>\n<li>North: Align all the images due North (this slows down the code).</li>\n<li>BLS: Run a Box-Least-Squares algorithm that searches for periodic signals in the lightcurve.</li>\n<li>Save: Save all the images (default this is already checked)</li>\n<li>Report: Generate a pdf file at the end of the code to summarise the findings (default this is already checked).</li>\n</ul>\n<p>Finally, there is an optional box to enter a 'Memorable name' for the candidate. This name is used to store the data at the end in order to make identifying certain targets easier.</p>\n<p>Once all the options have been chosen and the transit times stored (you have to enter at least one transit time), press the orange 'Done' button to continue.</p>\n<p>The code will then generate download and process all of the data. Note that all the data is downloaded but not stored. The more sectors you analyse in one go the longer the code will take to run.</p>\n<h3>Output</h3>\n<p>For more information on how to interpret the results shown in the reports look at the 'How to make a LATTE' document in the 'example' folder. Please see the LATTE Github page for example plots.</p>\n<p><strong>Figures:</strong></p>\n<ul>\n<li>Full lightcurve with the times of the momentum dumps marked.</li>\n</ul>\n<p>The solid red lines at the bottom of the figure indicated the times of the reaction wheel momentum dumps and the dashed black line(s) show the times of the marked transit events. Momentum dumps occur around every 2 to 2.5 days and typically last around half an hour. This can affect the satellite pointing, resulting in spurious transit-like signals.</p>\n<ul>\n<li>Background flux around the times of the marked transit event(s).</li>\n</ul>\n<p>Enhanced scattered light in the telescope optics can cause the background flux to rise sharply each time TESS approaches the perigee of its eccentric orbit around the Earth. Additionally, solar system objects, such as asteroids passing through the field of view will show up as a spike in the background flux. Both of these can result in a transit-like signal in the light curve.</p>\n<ul>\n<li>Centroid positions around the time of the marked transit event(s).</li>\n</ul>\n<p>The black points shows the CCD column and row position of the target’s flux-weighted centroid. The red shows the CCD column and row local motion differential velocity aberration (DVA), pointing drift, and thermal effects. Significant spikes in either of these at the time of the transit-like event suggest that the signal is not due to a transiting planet.</p>\n<ul>\n<li>The lightcurve around the time of the marked event(s) extracted in two different aperture sizes.</li>\n</ul>\n<p>For a transiting planet, the transit shape and depth are expected to remain constant when extracted with different aperture sizes. Conversely, they are expected to change if the signal is due to a blended eclipsing binary. This is because for blended binaries, the signal is not centred on the target and instead originates from elsewhere in the field of view, thus changing the shape and depth of the signal with different apertures. I caution that if the selected aperture is not centred on the target, this test can lead to the mis-interpretation of a moving signal. I, therefore, recommend to always check the figure showing the used apertures before interpreting these results. These data are extracted from the Target Pixel Files (TPFs) and are neither detrended nor corrected for systematics.</p>\n<ul>\n<li>\n<p>The apertures used for the extraction. Please note that for very bright and very faint stars the aperture selection for the smaller aperture may not work correctly so these should be checked in order to correctly interpret the results.</p>\n</li>\n<li>\n<p>The average flux in and out of the marked event(s) and the differences between the two.</p>\n</li>\n</ul>\n<p>A plot showing the average in-transit and average out of-transit flux as well as the difference between the two. A change in spatial distribution of the flux suggests that the transit-like event is caused by a blend with a background eclipsing binary. The data are extracted from the TPFs and corrected for systematic effects using Principal Component Analysis.</p>\n<ul>\n<li>The average flux of the target pixel file with the locations of nearby stars (magnitude &lt; 15) indicated (GAIA DR2 queried).</li>\n</ul>\n<p>A plot showing the location of nearby stars brighter than <em>TESS</em> magnitude 17 as queried from the Gaia Data Release 2 catalogue and the DSS2 red field of view around the target star. The sizes of the markers indicate the positions of the Gaia stars relate to the magnitude of each companion. The <em>Astropy reproject</em> module is used to align the plots such that north points towards the top of the page.</p>\n<ul>\n<li>The lightcurves of the 5 closest stars that were also observed by <em>TESS</em> (TP files).</li>\n</ul>\n<p>Lightcurves of the five two-minute cadence stars closest to the selected target. The occurrence of similar transit-like events in nearby lightcurves may suggest that the signal is caused by a background event or a blended eclipsing binary.</p>\n<ul>\n<li>A lightcurve around the time of the marked event(s) extracted for every pixel in the target pixel file.</li>\n</ul>\n<p>A plot showing lightcurves extracted for each individual pixel around the target. The data are extracted from the TPFs and detrended using a third order spline fit. If the transit-like signal is more prominent in pixels that are not centred on the target star, this suggests that the signal is caused by a blended background eclipsing binary.</p>\n<ul>\n<li>(optional) Two simple BLS plots that look for periodic signals in the data. The second with the highest detected signal-to-noise transits from the initial run removed.</li>\n<li>(in progress, will be available in next release of LATTE) Modelling of the signal using a Bayesian approach with an MCMC sampling. This makes use of the Pyaneti code (Barragan et al. 2017).</li>\n</ul>\n<p><strong>FFI Mode</strong></p>\n<ul>\n<li>The FFI mode currently does not plot the nearby stars lightcurves (will be implemented soon).</li>\n<li>Saves the extracted apertures used</li>\n<li>Saves the corrected and the uncorrected lightcurves to verify that the detrending is working correctly - there's are nt stored in the DV reports.</li>\n</ul>\n<p><strong>Tables:</strong></p>\n<ul>\n<li>Stellar parameters summarized, as well as information to whether the target has been flagged as a TCE or a TOI. The table links to the relevant reports (if applicable) as well as to the Exofop page on the star.</li>\n<li>(optional) Summary of the BLS results.</li>\n<li>(optional) Fitting parameters with uncertainties from the modelling.</li>\n</ul>\n<h3>Arguments</h3>\n<p>NOTE: all of these arguments (except new-path, auto and targetlist, new-data) can be changed as option in the GUI. They are arguments in case the same options wish to be run multiple times and the user therefore wishes to identify them in the command line when the program is executed.</p>\n<p><strong>--new-data</strong>  The code requires multiple text files to be stored on your computer in order to run - these are downloaded automatically from the MAST server. The first time the program is run, and any time that there is new data available, add <strong>--new-data</strong> to the command line when running the program. The code checks what data has already been downloaded and doesn't re-download anything that already exists.</p>\n<p><strong>--auto</strong> When looking at the FFIs, the default option is that you choose both the large and small apertures interactively. In order for the system to choose them run the command with '--auto'.</p>\n<p><strong>--targetlist</strong>*=path/to/the/csv/input/file* instead of entering the information manually every time, you can provide LATTE with an input file which lists all the TIC IDs and the times of the transit events. Look at the example file to see the required format of the information.</p>\n<p><strong>--new-path</strong> If you want to define a new path to store the data.</p>\n<p><strong>--o</strong> If the input target list option is chosen, the program will check whether each target has already been analysed, in which case it will skip this target. If you do not wish to skip targets that have already been assessed use this in order to specify the 'overwrite' option. When the program is run interactively (not with an input file) this option has no effect.</p>\n<p><strong>--noshow</strong> if you do not want the figures to pop up on your screen you can run the program with this command in the command line. The program will run significantly faster with this run. If this option is chosen the files are always saved (also option in the GUI)</p>\n<p><strong>--nickname</strong> In order to keep track of all of the candidates, it can be useful to asign them a nickname. This can be entered here which will simply change the name of the folder at the end (also option in the GUI)</p>\n<p><strong>--FFI</strong> If you want to look at an FFI write '--FFI' in the command line (also option in the GUI)</p>\n<p><strong>--north</strong> If you want all the images to be oriented due north (this is not the default as it takes longer to run)</p>\n<p><strong>--mpi</strong> If the code is parallelized (see example), this needs to be entered in the command line. This is because the module that reprojects the TPFs, astroplan, cannot be parallelized due to problems with multiple processes accessing python's shelve storage at the same time.</p>\n<p><strong>--tic</strong> You can skip the box to enter the tic ID by entering it in the command line with e.g. --tic=55525572.</p>\n<p><strong>--sector</strong> You can skip entering the sectors by entering them in the command line with e.g. --sector=2,5. You will need to know in what sectors this target was observed (option in the GUI)</p>\n<h3>Example</h3>\n<p>Please see the LATTE Github page for a short video that shows how to run LATTE for example target TIC 94986319 (TOI 421). The output files that this example produces can be found in the folder called 'example_output'. The summary DV report, which can be found in this folder, can be used to verify that this these target stars pass all of the initial vetting stages and inform decisions as to whether to follow it up using ground based telescopes.</p>\n<p>If you want to set or change the input/output path, alter the terminal command to:</p>\n<pre><code>python -m LATTE --new-path\n</code></pre>\n<p>and if you want to download new data (or check for new data) use the command:</p>\n<pre><code>python -m LATTE --new-data\n</code></pre>\n<h4>MPI example</h4>\n<p>If you have a computer with multiple cores you can generate multiple reports in one go by parallelizing the code. There is an example script for how this can be done on the Github page, although I caution that the code may have to be adapted to work with your operating system.</p>\n<p>The MPI code requires an input file (see 'example_input_file.csv'). In order to keep track of the targets that have been processed, the code generates a manifest file listing some of the information of the processed targets such as the transit-event times, the RA, Dec, sectors, TMag, Teff, whether it's a TOI and the link to the TCE report if it's available.</p>\n<p>An additional input parameter for this code is --number. This sets the number of targets that you want to analyse from the list. For example, if you have a list of 1000 targets but you only want to look at the first 10, you can set --number=10.</p>\n<p>On a mac, the example parallelized code can be executed using:</p>\n<pre><code>mpiexec -np 2 python example_parallelized_code.py --targetlist=/path/to/input/code/example/example_input_file.csv --number=10  --mpi\n</code></pre>\n<p>It's import that you add the --mpi, otherwise the code cannot be parallelized due to memory conflicts.</p>\n<h3>LATTE workflow - what is being downloaded, when and why?</h3>\n<p>Below is an outline of how the code works and when it downloads the various different data files.</p>\n<ol>\n<li>\n<p>When the code is first executed, a number of text files are downloaded which are required for the code run more quickly for all subsequent runs. These include:</p>\n<p>a) Two text files for each TESS observational sector, one for the short cadence light curves, and one for the target pixel files, which contain curl commands that link to the download of each individual TESS light curve. These are simply text files and no actual TESS data and will only have to be downloaded once for each sector. This is in order to increase the speed of the code later on. These files are around 3.9 MB each.</p>\n<p>b) One text file for each sector containing the RA, Dec and TESS magnitude for each target (760 KB per file). This information is used to identify the TIC IDs of the 5 closest TESS short-cadence targets.</p>\n<p>c) One file that lists the times of the momentum dumps across all of the sectors (23 KB). In order to generate this file one lightcurve is downloaded from each sector and the data extracted. These lightcurves are opened but never saved. This is only needed when looking at the FFIs.</p>\n<p>d) A list of all of the confirmed TOIs (274 KB) and all of the targets that were flagged as TCEs by the SPOC pipeline (20.2 MB).</p>\n</li>\n<li>\n<p>When you run LATTE, you will first be prompted to enter the TIC ID. Once the TIC ID has been entered, LATTE calls a program known as 'tess-point', which tells us in which TESS observational sectors this target was observed in. This information is stored in a temporary text file so that it can be accessed by the code later on.</p>\n</li>\n<li>\n<p>You are then prompted to enter the observational sectors that you want to look at in more detail. At this point LATTE opens the short cadence text files for each observational sector that you entered, and uses the curl scripts for the relevant TIC ID to download a short-cadence light curve (2MB per light curve). The more sectors that you stated to look at, the longer this step will take. If you chose the 'simple' option within the TESS GUI, this will be the only data that is downloaded.</p>\n</li>\n<li>\n<p>Once you have identified the times of the transit like events, the code will generate a plot showing the background flux, and one showing the mean centroid positions. These plots use the already downloaded lightcurve file.</p>\n</li>\n<li>\n<p>Next, the code will download the target pixel file using the lightkurve package (unless you run the 'simple' mode). This file is downloaded once the centroid plot has been closed and used to extract lightcurves with two different aperture sizes. Due to the size of the file and the time taken to determine the optimal aperture size, this step may take a couple of seconds to complete.</p>\n</li>\n<li>\n<p>The next figure shows the brightest stars surrounding the target, both on the average TPF data and on an SDSS image. The target pixel files are downloaded directly from the MAST server at this stage (48 MB per light curve), using the previously downloaded curl scripts. This file is larger than the light curve data and will therefore take longer to download. This file will be used for multiple plots. If the 'north' option has been selected, the image will be reprojected such that both images are oriented such that North is directed upwards. This option takes longer.</p>\n</li>\n<li>\n<p>The next figure compares the flux in-transit to out-of-transit for each marked transit-like event. This uses the already downloaded TPF and should therefore not take long to load.</p>\n</li>\n<li>\n<p>The next figure shows a lightcurve extracted for each pixel surrounding the target around the time of the marked transit-like event using the already downloaded TPF. This is done individually for each marked transit and will therefore take longer if more transit have been identified. Your terminal window will indicate how much longer this step takes to run.</p>\n</li>\n<li>\n<p>If more than one transit-like event has been identified, the lightcurve will be phase folded. This uses the previously downloaded lightcurve file and should be completed very quickly.</p>\n</li>\n<li>\n<p>The next figure shows the lightcurves of the five closest short-cadence TESS stars to the target. The data for each star is downloaded using the curl scripts. Your terminal window will indicate once each lightcurve has been downloaded successfully.</p>\n</li>\n<li>\n<p>The final step is to compile and save the LATTE data validation report.</p>\n</li>\n</ol>\n<h3>Overview of the main LATTE scripts</h3>\n<p><strong>main</strong>.py      : Initialises the parameters: TIC ID, Sector, FFI or not, run with input file or not, check that the data has been downloaded etc. In brief, this code is designed check that all of the input parameters are consistent with one another and informs the rest of the code how to run.</p>\n<p>LATTEutils.py    : All the functions needed to download data and text files, function to run the interactive GUI and all of the plotting and data handling. Functions in this script are called both from 'main' and from 'brew'.</p>\n<p>LATTE_DV.py      : Script to combine all of the results from LATTEbrew in order to generate a pdf data validation report.</p>\n<p>LATTEbrew.py     : Script that calls the LATTEutils functions in turn in order to store the results. Calls the LATTE_DV.py function to collate all the results at the end.</p>\n<h3>Perform automated tests</h3>\n<p>The code has been tested using the python unittest module. There are a number of tests including testing the connections to the servers where data is downloaded as well as tests that process pre-downloaded data in order to ensure that the outputs are as expected. In order to execute the tests please clone the GitHub LATTE repository. You must then be in the parent LATTE directory and from there you can run all the tests using:</p>\n<pre><code>python3 -m unittest\n</code></pre>\n<p>or individual tests using, for example:</p>\n<pre><code>python3 -m unittest LATTE/tests/test_DVreport.py\n</code></pre>\n<p>Before running the tests makes sure that you have configured an output path (<em>python3 -m LATTE --new-path</em>) and that the data files are downloaded (<em>python3 -m LATTE --new-data</em>).</p>\n<h3>Contributing</h3>\n<p>If you believe that you have found any bugs in the code or if you need help or have any questions or suggestions, please feel free to file a new Github issue. You can also raise an issue or a pull request which fixes the issue. Please see CONTRIBUTING.md for more details.</p>\n<h3>Future Work</h3>\n<p>The next release will allow for the option to model the transit-like events using the open source package <em>Pyaneti</em> [@pyaneti] which uses a Bayesian approach with an MCMC sampling to determine the parameters of the best-fit.</p>\n<p>Future releases will also allow for modelling and removal of periodic trends in the light curve. This is useful for the detection and circumbinary planets and for the analysis of multi-star systems.</p>\n<h3>License</h3>\n<p>LATTE can be used under GNU Lesser General Public License v3.0</p>\n<h3>Acknowledgements</h3>\n<p>I thank all of the Planet Hunters <em>TESS</em> volunteers whose dedication to the project encouraged me to write this analysis tool. I am also extremely grateful to all of the support provided by the Zooniverse team and the Oxford exoplanet group.</p>\n\n          </div>"}, "last_serial": 7059567, "releases": {"0.1.0": [{"comment_text": "", "digests": {"md5": "91bf072f399363b10ba130ed555d1866", "sha256": "bfce5f2c377f7f741ee3bfe198da4db6810e860311fcb2ac7ec561367b31ffb1"}, "downloads": -1, "filename": "tessLATTE-0.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "91bf072f399363b10ba130ed555d1866", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 65256, "upload_time": "2020-01-09T10:15:07", "upload_time_iso_8601": "2020-01-09T10:15:07.979682Z", "url": "https://files.pythonhosted.org/packages/a8/0c/700a09cb2bbce560f78ca5db96c7c14a7a632577bed726a1d36d6809fa49/tessLATTE-0.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "63c2a6638dcda38497e0670ccc8447dd", "sha256": "ecd06ecc0a4bf0225dee220dcf9faea31262feba9f58667882a9ebfe879773dc"}, "downloads": -1, "filename": "tessLATTE-0.1.0.tar.gz", "has_sig": false, "md5_digest": "63c2a6638dcda38497e0670ccc8447dd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58379, "upload_time": "2020-01-09T10:15:10", "upload_time_iso_8601": "2020-01-09T10:15:10.370011Z", "url": "https://files.pythonhosted.org/packages/95/1e/95fde05f75e073fdf472b3623f3c69cebbb5d9fb21c452de39f95fe758b0/tessLATTE-0.1.0.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "40afb2bbff4b6c51e6da90f7100f09e1", "sha256": "8157272ac9bc672315f6120b077562de773efd0fdc6b544b8842a8beb1845389"}, "downloads": -1, "filename": "tessLATTE-0.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "40afb2bbff4b6c51e6da90f7100f09e1", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 64969, "upload_time": "2020-01-09T11:58:34", "upload_time_iso_8601": "2020-01-09T11:58:34.484898Z", "url": "https://files.pythonhosted.org/packages/46/89/b15028ec2af90f4898ce1adc3d0d95a13388f52ecfd6897aa666f80d6aec/tessLATTE-0.1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7f5f48732fc659fac3924152a20b83c2", "sha256": "df95fe5be7826406b4a6d21d1ff86878e6672ee246cae7a7f26f56fc088982fc"}, "downloads": -1, "filename": "tessLATTE-0.1.1.tar.gz", "has_sig": false, "md5_digest": "7f5f48732fc659fac3924152a20b83c2", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58244, "upload_time": "2020-01-09T11:58:38", "upload_time_iso_8601": "2020-01-09T11:58:38.023761Z", "url": "https://files.pythonhosted.org/packages/96/41/24e56d426265832e500f06ca0d7c95cabdc2be2df7f8be74101aa01bac92/tessLATTE-0.1.1.tar.gz", "yanked": false}], "0.1.10": [{"comment_text": "", "digests": {"md5": "3cc61d4dead13da09e1f3fe22823e5dc", "sha256": "d6d75142f90894548688cfc915b0504e7d00481313f37a37a431e8a2f49f14a7"}, "downloads": -1, "filename": "tessLATTE-0.1.10-py3-none-any.whl", "has_sig": false, "md5_digest": "3cc61d4dead13da09e1f3fe22823e5dc", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 4989223, "upload_time": "2020-01-14T22:33:10", "upload_time_iso_8601": "2020-01-14T22:33:10.247147Z", "url": "https://files.pythonhosted.org/packages/a4/d6/ce74342dcba6f6f6c04c4e592d46f58689f88bdc3bbfd0f3f660df6555e4/tessLATTE-0.1.10-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "820632b06e8e42bbb9e0b5f1101f44df", "sha256": "b8950c9baea0a5a2deb0d90b2897abb2cad02470818c573105702bc9079f550e"}, "downloads": -1, "filename": "tessLATTE-0.1.10.tar.gz", "has_sig": false, "md5_digest": "820632b06e8e42bbb9e0b5f1101f44df", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 4983841, "upload_time": "2020-01-14T22:33:19", "upload_time_iso_8601": "2020-01-14T22:33:19.442013Z", "url": "https://files.pythonhosted.org/packages/d7/6c/a34e71a1a08f7617d6afdb06bee696349968d68a23a3d296190cacd10f63/tessLATTE-0.1.10.tar.gz", "yanked": false}], "0.1.11": [{"comment_text": "", "digests": {"md5": "7763352212b47f3c6f6bdb1fe1613ac1", "sha256": "8c11bdabdb7f4c05072bd75904a786d2a52dcfc2aefba86ccfa263560f554226"}, "downloads": -1, "filename": "tessLATTE-0.1.11-py3-none-any.whl", "has_sig": false, "md5_digest": "7763352212b47f3c6f6bdb1fe1613ac1", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 4989311, "upload_time": "2020-01-15T13:31:15", "upload_time_iso_8601": "2020-01-15T13:31:15.169484Z", "url": "https://files.pythonhosted.org/packages/de/ea/97203dec8410ae3dc0c33eeb294b1c7db550cf77cf74614d75b967dc8aba/tessLATTE-0.1.11-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "87d72e09a351a873a92d0a0c85a74f8b", "sha256": "4dff3e850a019f9587494850e99591b7b7e0fd5b48e5bbb474fede3ec63b5b8c"}, "downloads": -1, "filename": "tessLATTE-0.1.11.tar.gz", "has_sig": false, "md5_digest": "87d72e09a351a873a92d0a0c85a74f8b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 4984166, "upload_time": "2020-01-15T13:31:21", "upload_time_iso_8601": "2020-01-15T13:31:21.326105Z", "url": "https://files.pythonhosted.org/packages/93/54/47b2f56e1de22783f745cfd0d9b9ad7e60eba2a3de1cdf6463714d13175e/tessLATTE-0.1.11.tar.gz", "yanked": false}], "0.1.12": [{"comment_text": "", "digests": {"md5": "93b0ef66b7ffc5dbf623d715847a0d7c", "sha256": "55af953bd37a25ffa85f013788d374af24dca6ff2067b568b93fbc512e22c41d"}, "downloads": -1, "filename": "tessLATTE-0.1.12-py3.7.egg", "has_sig": false, "md5_digest": "93b0ef66b7ffc5dbf623d715847a0d7c", "packagetype": "bdist_egg", "python_version": "3.7", "requires_python": null, "size": 5056355, "upload_time": "2020-02-24T10:28:47", "upload_time_iso_8601": "2020-02-24T10:28:47.838396Z", "url": "https://files.pythonhosted.org/packages/b7/e2/0ede425abf46c658a2473da80e82c3e1deb26ce48bbd44db8e042de16517/tessLATTE-0.1.12-py3.7.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "4774ab5acc72e0bb7daae7ce9aab2ba7", "sha256": "94f841a01201319ed659432a94942c70557821010128ec48403c1ad8a4e3aa21"}, "downloads": -1, "filename": "tessLATTE-0.1.12-py3-none-any.whl", "has_sig": false, "md5_digest": "4774ab5acc72e0bb7daae7ce9aab2ba7", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 4993616, "upload_time": "2020-02-04T16:22:32", "upload_time_iso_8601": "2020-02-04T16:22:32.439289Z", "url": "https://files.pythonhosted.org/packages/87/cc/13cb74dd95319287dd46037a7b5ae2552b6d94c3a386832bbee41960abb9/tessLATTE-0.1.12-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "29ab4476006fc1f5a680a6cd88fe2e51", "sha256": "a2b8b6866857e73a26bb260305b6b6b82892ca0f15c0bd988015d6a5dc892035"}, "downloads": -1, "filename": "tessLATTE-0.1.12.tar.gz", "has_sig": false, "md5_digest": "29ab4476006fc1f5a680a6cd88fe2e51", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 4988551, "upload_time": "2020-02-04T16:22:34", "upload_time_iso_8601": "2020-02-04T16:22:34.931889Z", "url": "https://files.pythonhosted.org/packages/10/31/847e1453726d8dde968cf91569be19d0c59e1b09bdf902bdc3855ed77f49/tessLATTE-0.1.12.tar.gz", "yanked": false}], "0.1.13": [{"comment_text": "", "digests": {"md5": "73e6b5e50e86fe44d13fc27ba5869ccb", "sha256": "0f8261dd5155ff7190536b3be2c912c660ae51a872acd4bf3bcb8a1ffc137ce0"}, "downloads": -1, "filename": "tessLATTE-0.1.13-py3-none-any.whl", "has_sig": false, "md5_digest": "73e6b5e50e86fe44d13fc27ba5869ccb", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 42274870, "upload_time": "2020-02-24T10:28:39", "upload_time_iso_8601": "2020-02-24T10:28:39.666270Z", "url": "https://files.pythonhosted.org/packages/8e/e9/8d4ebd4aa1e7a1d4283a7ba07f3ab368fe72b38e5c8b7d44529a9eba1fc3/tessLATTE-0.1.13-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "774aaf72c07aa56d110b891d6250bd40", "sha256": "88f1d360464a18ddf03cf743f0e9a77db7777405260c7f69bf9d16ebaa7c97db"}, "downloads": -1, "filename": "tessLATTE-0.1.13.tar.gz", "has_sig": false, "md5_digest": "774aaf72c07aa56d110b891d6250bd40", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42038965, "upload_time": "2020-02-24T10:29:50", "upload_time_iso_8601": "2020-02-24T10:29:50.792095Z", "url": "https://files.pythonhosted.org/packages/fd/f6/b8b3d4522962346b3a428640963f31f2d2a52e7804e9dcd635a4e10e39b2/tessLATTE-0.1.13.tar.gz", "yanked": false}], "0.1.14": [{"comment_text": "", "digests": {"md5": "e0ea66cc2d5d61b9df7141c5abe70f1e", "sha256": "496303a21268c5b9dd555504affd9118eb635e1bfa4b78505f6237f49656e82b"}, "downloads": -1, "filename": "tessLATTE-0.1.14-py3-none-any.whl", "has_sig": false, "md5_digest": "e0ea66cc2d5d61b9df7141c5abe70f1e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 42275184, "upload_time": "2020-03-04T09:42:09", "upload_time_iso_8601": "2020-03-04T09:42:09.067599Z", "url": "https://files.pythonhosted.org/packages/77/b9/1f0d55175b176d4937a849dc9fccad559672d0eaf3093f6c92b7156f093b/tessLATTE-0.1.14-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "99be6f0aeddacf537434b5ca7c3ceaf1", "sha256": "ce120bbe50d6c0c421744f63911ad66d5d3eee1ae8a2dfe15e7cd0f3002334cd"}, "downloads": -1, "filename": "tessLATTE-0.1.14.tar.gz", "has_sig": false, "md5_digest": "99be6f0aeddacf537434b5ca7c3ceaf1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42039459, "upload_time": "2020-03-04T09:43:20", "upload_time_iso_8601": "2020-03-04T09:43:20.355454Z", "url": "https://files.pythonhosted.org/packages/8b/8c/01bc823ff604a3db99e97e61d7bcfce6b535757aea82d187418f8c3715b5/tessLATTE-0.1.14.tar.gz", "yanked": false}], "0.1.15": [{"comment_text": "", "digests": {"md5": "2f74458f0944c10a7189b0afd586d2bc", "sha256": "37d4097de5d261adcf36e414ceb95260d1955a343242b9ff68ddc920a30f5c32"}, "downloads": -1, "filename": "tessLATTE-0.1.15-py3-none-any.whl", "has_sig": false, "md5_digest": "2f74458f0944c10a7189b0afd586d2bc", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 42275147, "upload_time": "2020-03-04T10:31:42", "upload_time_iso_8601": "2020-03-04T10:31:42.456236Z", "url": "https://files.pythonhosted.org/packages/6c/4d/097e5963d4ddff78909c4887522420d0796c36dbf06ee903d9b56a22602f/tessLATTE-0.1.15-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7ecbf964fa09713553c5fb89febb6b1c", "sha256": "563cecd79d481319af495acc49c55a2b1bf4d18a8579437a566ee778ab88bc22"}, "downloads": -1, "filename": "tessLATTE-0.1.15.tar.gz", "has_sig": false, "md5_digest": "7ecbf964fa09713553c5fb89febb6b1c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 42039391, "upload_time": "2020-03-04T10:32:42", "upload_time_iso_8601": "2020-03-04T10:32:42.886222Z", "url": "https://files.pythonhosted.org/packages/30/7f/184d31807ebd2be3839cbc0e52425d2f4be00febdb0cc811bf5c2f28baed/tessLATTE-0.1.15.tar.gz", "yanked": false}], "0.1.16": [{"comment_text": "", "digests": {"md5": "da965ebc935dd97e10056c6930366dc2", "sha256": "8bc844ed9b32d3845c634bd28276c4f781fa1363ecc94c0d2e677590e762cd28"}, "downloads": -1, "filename": "tessLATTE-0.1.16-py3-none-any.whl", "has_sig": false, "md5_digest": "da965ebc935dd97e10056c6930366dc2", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 42283912, "upload_time": "2020-03-23T11:04:21", "upload_time_iso_8601": "2020-03-23T11:04:21.206756Z", "url": "https://files.pythonhosted.org/packages/3c/9f/0835f2dfc5d13d5587494b4b4e657060ce3d321f9ec5decef434e8547fa2/tessLATTE-0.1.16-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "13d35468f450e7df9c92badba4ffe5d5", "sha256": "349ab6136c8a7ade23600fa2b15da5b61e72c8f41eb7bb2329784128207e3ca5"}, "downloads": -1, "filename": "tessLATTE-0.1.16.tar.gz", "has_sig": false, "md5_digest": "13d35468f450e7df9c92badba4ffe5d5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5206493, "upload_time": "2020-03-23T11:04:25", "upload_time_iso_8601": "2020-03-23T11:04:25.642188Z", "url": "https://files.pythonhosted.org/packages/e1/42/0305804b837dbcea79278f7b8c960c789aacb6f60c8f3b7044d3a94e99e4/tessLATTE-0.1.16.tar.gz", "yanked": false}], "0.1.17": [{"comment_text": "", "digests": {"md5": "3d89fa45715f4028c42d3ac8b850036e", "sha256": "e2e4e749e653bcdc0f9191da73224665283f00a3a1f80f1617b2f6d2075f2c2b"}, "downloads": -1, "filename": "tessLATTE-0.1.17-py3-none-any.whl", "has_sig": false, "md5_digest": "3d89fa45715f4028c42d3ac8b850036e", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 14512451, "upload_time": "2020-04-20T09:26:18", "upload_time_iso_8601": "2020-04-20T09:26:18.899235Z", "url": "https://files.pythonhosted.org/packages/69/af/7039b670bb116151b86c9a394199322e59c6ead064518e031606118501ce/tessLATTE-0.1.17-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "92c6d3d0c6a7bb3a35c6318caf110695", "sha256": "b2e86a7fd6cba334ae986bb4d0ecfa148e1d1a50de8b1312e97ea7928bbdb0c8"}, "downloads": -1, "filename": "tessLATTE-0.1.17.tar.gz", "has_sig": false, "md5_digest": "92c6d3d0c6a7bb3a35c6318caf110695", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5216334, "upload_time": "2020-04-20T09:26:24", "upload_time_iso_8601": "2020-04-20T09:26:24.264585Z", "url": "https://files.pythonhosted.org/packages/71/2b/a1386032dda811a31007c08052002ddd0119234d7054de1c5d77b6a6d84f/tessLATTE-0.1.17.tar.gz", "yanked": false}], "0.1.18": [{"comment_text": "", "digests": {"md5": "c3dc9755397818fc56447391b2186f0d", "sha256": "db3e4351ecebdb781acb55c3a1cd046e78a88ba54c6781787ff9f1ce454b9852"}, "downloads": -1, "filename": "tessLATTE-0.1.18-py3-none-any.whl", "has_sig": false, "md5_digest": "c3dc9755397818fc56447391b2186f0d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 14512725, "upload_time": "2020-04-20T12:03:04", "upload_time_iso_8601": "2020-04-20T12:03:04.969831Z", "url": "https://files.pythonhosted.org/packages/c6/7b/81ed1bd31ca7b447f098ba4615dae499a4f5d9be221bd32db1fc6ccba70f/tessLATTE-0.1.18-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e29102ac5c787c268ce82ff1ce10bc94", "sha256": "0b5164251f3eb982e18d81f949a2ec83cbe13e73a386c7d6e3be518d678d05b7"}, "downloads": -1, "filename": "tessLATTE-0.1.18.tar.gz", "has_sig": false, "md5_digest": "e29102ac5c787c268ce82ff1ce10bc94", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5216668, "upload_time": "2020-04-20T12:03:11", "upload_time_iso_8601": "2020-04-20T12:03:11.272612Z", "url": "https://files.pythonhosted.org/packages/b3/6d/ebd9a8e8fea570bd14fc31ae50cf5f59459561732296a1762065b34c744a/tessLATTE-0.1.18.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "9195af4786ad2f3962f07e71416b9aa6", "sha256": "9045f65c605355d63a422025f23189c94dd2f9db2caca7e569e8b27e830a107a"}, "downloads": -1, "filename": "tessLATTE-0.1.2-py3-none-any.whl", "has_sig": false, "md5_digest": "9195af4786ad2f3962f07e71416b9aa6", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 64969, "upload_time": "2020-01-09T11:58:36", "upload_time_iso_8601": "2020-01-09T11:58:36.280875Z", "url": "https://files.pythonhosted.org/packages/04/5a/0d8bb8bad791932585eda960e502db5d85abe76e4a5dc6dd4488a97aac9d/tessLATTE-0.1.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1d1f02275e75833ea9fd74820b24b43b", "sha256": "481c2217d7322bc9ceb25e7815282768df7fd9bfae59adb67224c6f35c5e3606"}, "downloads": -1, "filename": "tessLATTE-0.1.2.tar.gz", "has_sig": false, "md5_digest": "1d1f02275e75833ea9fd74820b24b43b", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58246, "upload_time": "2020-01-09T11:58:39", "upload_time_iso_8601": "2020-01-09T11:58:39.543424Z", "url": "https://files.pythonhosted.org/packages/6d/ba/60ca244177dd4af746a98fa4dee60d333b673b491e3047de5150026f64e0/tessLATTE-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "843ebab2c48967098a274320e01b16b2", "sha256": "c95a9bcc055ee488ad5a59e957084dd0a3e1be2d8de43e187af80246d13fdbea"}, "downloads": -1, "filename": "tessLATTE-0.1.3-py3-none-any.whl", "has_sig": false, "md5_digest": "843ebab2c48967098a274320e01b16b2", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 64968, "upload_time": "2020-01-09T13:26:47", "upload_time_iso_8601": "2020-01-09T13:26:47.602086Z", "url": "https://files.pythonhosted.org/packages/6c/a0/9d4de9ab12477c84043555608fbd191df947eb32a31ba01ab6b4b8ef5fc8/tessLATTE-0.1.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "07f5510e6dc48dc7c51c60dddb3be5dd", "sha256": "e55042cecfa113345ae12938ba58258844254f884e75b5be9f2912b1e05b0afd"}, "downloads": -1, "filename": "tessLATTE-0.1.3.tar.gz", "has_sig": false, "md5_digest": "07f5510e6dc48dc7c51c60dddb3be5dd", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58237, "upload_time": "2020-01-09T13:26:51", "upload_time_iso_8601": "2020-01-09T13:26:51.013865Z", "url": "https://files.pythonhosted.org/packages/87/61/5f15131768eb170109bbb1c982626dbdc886882c5fc0aa07e0fb06663136/tessLATTE-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "c6103d02e906c84d429980d432ead6ce", "sha256": "0cdebaadb8c63df9659ad06fc2e6c7c8b78dd7738dcf9b7fa6facf06bf96a472"}, "downloads": -1, "filename": "tessLATTE-0.1.4-py3-none-any.whl", "has_sig": false, "md5_digest": "c6103d02e906c84d429980d432ead6ce", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 65050, "upload_time": "2020-01-09T15:39:48", "upload_time_iso_8601": "2020-01-09T15:39:48.843492Z", "url": "https://files.pythonhosted.org/packages/30/6f/3fce0f39b5a03bcfbd7a6ff87399bc8c1af3d32a55c3f9809b3965ad5a03/tessLATTE-0.1.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "dd9c28a77c5b60a6042426c19f716f64", "sha256": "31ca4b2fb2b41e41d029b7b4046010ccac9108831f477161647a847d1ed6f33c"}, "downloads": -1, "filename": "tessLATTE-0.1.4.tar.gz", "has_sig": false, "md5_digest": "dd9c28a77c5b60a6042426c19f716f64", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58323, "upload_time": "2020-01-09T15:39:52", "upload_time_iso_8601": "2020-01-09T15:39:52.617846Z", "url": "https://files.pythonhosted.org/packages/8d/47/1204cf3a54e3dbcbe47f4dba15bbcf367f749298948744dcab33dfaf1333/tessLATTE-0.1.4.tar.gz", "yanked": false}], "0.1.5": [{"comment_text": "", "digests": {"md5": "965f8e4728a8f8d2ca7573925d106833", "sha256": "90a45fc15d94e5b7fa355e9f4f1e40436b0d67e5f8d7809a5aaabec800ec6175"}, "downloads": -1, "filename": "tessLATTE-0.1.5-py3-none-any.whl", "has_sig": false, "md5_digest": "965f8e4728a8f8d2ca7573925d106833", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 65071, "upload_time": "2020-01-09T16:20:24", "upload_time_iso_8601": "2020-01-09T16:20:24.626780Z", "url": "https://files.pythonhosted.org/packages/08/61/53f0c1d81657365a897a4b9723f41857d87086b016b7c41a3dd96fd27a8c/tessLATTE-0.1.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a74a71d64d7ae3ef7573053b6a7a0df1", "sha256": "4f9e485dd82336cc7c88a1139e078840c9d005192df94f27c9a2506928e7e6cb"}, "downloads": -1, "filename": "tessLATTE-0.1.5.tar.gz", "has_sig": false, "md5_digest": "a74a71d64d7ae3ef7573053b6a7a0df1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58354, "upload_time": "2020-01-09T16:20:29", "upload_time_iso_8601": "2020-01-09T16:20:29.217906Z", "url": "https://files.pythonhosted.org/packages/83/a7/f04ee6b9ca5d108ec999756741354f7a94ba262bb5866cfb34b62ea79bf1/tessLATTE-0.1.5.tar.gz", "yanked": false}], "0.1.6": [{"comment_text": "", "digests": {"md5": "65bdeec89dd7417b7778038bc616050d", "sha256": "7e2941bc8764f74ae51194ec0ff8286c0736ff60b59f16cb01b18ad63d253411"}, "downloads": -1, "filename": "tessLATTE-0.1.6-py3-none-any.whl", "has_sig": false, "md5_digest": "65bdeec89dd7417b7778038bc616050d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 66308, "upload_time": "2020-01-09T19:20:11", "upload_time_iso_8601": "2020-01-09T19:20:11.578870Z", "url": "https://files.pythonhosted.org/packages/dc/f7/a2b84a757126cd9403f388d0c08c121a6a1a9a556058aebc2f51e3a89b8d/tessLATTE-0.1.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "4163d8dfcb1bf21380d4fa72744d1746", "sha256": "68edd21ba95191e4b8fa7b8e62e39fa4bf16364c86397bfb45acec9ae2201aaa"}, "downloads": -1, "filename": "tessLATTE-0.1.6.tar.gz", "has_sig": false, "md5_digest": "4163d8dfcb1bf21380d4fa72744d1746", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58692, "upload_time": "2020-01-09T19:20:13", "upload_time_iso_8601": "2020-01-09T19:20:13.305547Z", "url": "https://files.pythonhosted.org/packages/33/97/8926c59ff147a3a966f8e804cc3b5056712052d8b49846da966ed31f3506/tessLATTE-0.1.6.tar.gz", "yanked": false}], "0.1.7": [{"comment_text": "", "digests": {"md5": "c01430654754fb4a8acb19ec16f783cd", "sha256": "624bbf5b330e6ad3cd96052085aea7ad59def4b612791eb7b59c98a6cab5108b"}, "downloads": -1, "filename": "tessLATTE-0.1.7-py3-none-any.whl", "has_sig": false, "md5_digest": "c01430654754fb4a8acb19ec16f783cd", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 66317, "upload_time": "2020-01-09T23:53:37", "upload_time_iso_8601": "2020-01-09T23:53:37.930380Z", "url": "https://files.pythonhosted.org/packages/35/e9/d40261e655212a61c345e876b1f5ed96ce6fda6bd36b8b61f5941dad0712/tessLATTE-0.1.7-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "68f3104be6dd1c84e4f6bb683eb9caac", "sha256": "4c0e48487c617b417844958f34db1126fdc35ace8288487d3531cedd9c3aed9e"}, "downloads": -1, "filename": "tessLATTE-0.1.7.tar.gz", "has_sig": false, "md5_digest": "68f3104be6dd1c84e4f6bb683eb9caac", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 58700, "upload_time": "2020-01-09T23:53:40", "upload_time_iso_8601": "2020-01-09T23:53:40.443715Z", "url": "https://files.pythonhosted.org/packages/0c/c8/93e860b0ea79a06c5523ce9069b113b4e02fc1a6ae81fb980f950d6b9506/tessLATTE-0.1.7.tar.gz", "yanked": false}], "0.1.8": [{"comment_text": "", "digests": {"md5": "7d092247b9fd642bd93365a985c91e69", "sha256": "7755a601b138859651fe8a591ab4a0dd7343a22606b52cfd21a6a1899565ffc1"}, "downloads": -1, "filename": "tessLATTE-0.1.8-py3-none-any.whl", "has_sig": false, "md5_digest": "7d092247b9fd642bd93365a985c91e69", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 66739, "upload_time": "2020-01-09T23:58:10", "upload_time_iso_8601": "2020-01-09T23:58:10.063033Z", "url": "https://files.pythonhosted.org/packages/ae/c4/6301fb31916379b2d5042ca94f117b2c653f45b35a3dec62d0d9bf8e6c0b/tessLATTE-0.1.8-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "3a3d4a425c64ae44b2fa3cbb2b32f830", "sha256": "adee7e8254bb27455f70f302514f4351810f80d46ea5f2d590d561d10863c156"}, "downloads": -1, "filename": "tessLATTE-0.1.8.tar.gz", "has_sig": false, "md5_digest": "3a3d4a425c64ae44b2fa3cbb2b32f830", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 59180, "upload_time": "2020-01-09T23:58:13", "upload_time_iso_8601": "2020-01-09T23:58:13.722843Z", "url": "https://files.pythonhosted.org/packages/d3/ad/7f11f4ce9b49b750913c62133aaea7a75ab0841051ef9b6a7cd27ae9803a/tessLATTE-0.1.8.tar.gz", "yanked": false}], "0.1.9": [{"comment_text": "", "digests": {"md5": "ddddd67f91372a8562509f304687242a", "sha256": "6a1c822b1ff9ff03d946662f8e188d7d01dc6e5126167ab36f3654601dd92113"}, "downloads": -1, "filename": "tessLATTE-0.1.9-py3-none-any.whl", "has_sig": false, "md5_digest": "ddddd67f91372a8562509f304687242a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 68702, "upload_time": "2020-01-13T14:22:34", "upload_time_iso_8601": "2020-01-13T14:22:34.016911Z", "url": "https://files.pythonhosted.org/packages/d9/2f/aae4e202f21b3700b8471939aedeed6beeeadf204ebefb7a60654740e60b/tessLATTE-0.1.9-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "1e7d39e909f116011db1c87038bdf8f0", "sha256": "1162ff6bf767d7f357f18582f816e72fca37ef27808d63c6dd2b04369a4361bb"}, "downloads": -1, "filename": "tessLATTE-0.1.9.tar.gz", "has_sig": false, "md5_digest": "1e7d39e909f116011db1c87038bdf8f0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 61521, "upload_time": "2020-01-13T14:22:37", "upload_time_iso_8601": "2020-01-13T14:22:37.890011Z", "url": "https://files.pythonhosted.org/packages/c7/94/765099eb72057c0c497b2f0909574bad7d40d3eb4ded5acfdc90e9625db8/tessLATTE-0.1.9.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "c3dc9755397818fc56447391b2186f0d", "sha256": "db3e4351ecebdb781acb55c3a1cd046e78a88ba54c6781787ff9f1ce454b9852"}, "downloads": -1, "filename": "tessLATTE-0.1.18-py3-none-any.whl", "has_sig": false, "md5_digest": "c3dc9755397818fc56447391b2186f0d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 14512725, "upload_time": "2020-04-20T12:03:04", "upload_time_iso_8601": "2020-04-20T12:03:04.969831Z", "url": "https://files.pythonhosted.org/packages/c6/7b/81ed1bd31ca7b447f098ba4615dae499a4f5d9be221bd32db1fc6ccba70f/tessLATTE-0.1.18-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "e29102ac5c787c268ce82ff1ce10bc94", "sha256": "0b5164251f3eb982e18d81f949a2ec83cbe13e73a386c7d6e3be518d678d05b7"}, "downloads": -1, "filename": "tessLATTE-0.1.18.tar.gz", "has_sig": false, "md5_digest": "e29102ac5c787c268ce82ff1ce10bc94", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5216668, "upload_time": "2020-04-20T12:03:11", "upload_time_iso_8601": "2020-04-20T12:03:11.272612Z", "url": "https://files.pythonhosted.org/packages/b3/6d/ebd9a8e8fea570bd14fc31ae50cf5f59459561732296a1762065b34c744a/tessLATTE-0.1.18.tar.gz", "yanked": false}], "timestamp": "Fri May  8 02:55:41 2020"}