{"info": {"author": "Pedro Fernández", "author_email": "rockersuke@gmail.com", "bugtrack_url": null, "classifiers": [], "description": "Trizio2sce\n**********\n\nEnglish instructions below.\n\nTriz2sce versión 1.0.5rc2 190410 (c) 2018 Pedro Fernández\n\nTrizio2sce.py es un script de Python 3.x que transforma un fichero generado con la utilidad on-line para mapear aventuras Trizbort.io en un código fuente compatible con el compilador del DAAD. Está basado en Triz2sce, que usa los ficheros XML de la aplicación de escritorio Trizbort.\nNo es un diseñador visual de aventuras ni una aplicación para su desarrollo completo. Está concebido como herramienta para hacer prototipos iniciales de aventuras con rapidez y facilidad y, a su vez, como herramienta de apoyo a autores nóveles, ideal para su uso en talleres de aprendizaje.\n\nUso:\n====\n\nUsar \"Python trizio2sce.py -h\" en una linea de comandos o powershell para ver las opciones.\n\nEl script requiere como argumentos un fichero de entrada (que debe ser un mapa generado por la utilidad Trizbort.io en formato json) y, opcionalmente, el nombre de un fichero de salida, que será un código fuente en formato .SCE compatible con la versión 2.40-2.42 del compilador del DAAD. Si no se especifica se creará un fichero con el mismo nombre y la extensión .SCE\n\nLa opción -p1 generará un listado SCE con los mensajes del sistema en primera persona. Por defecto éstos se crearán en segunda persona.\nLa opción -e generará un listado SCE con los textos y el vocabulario en inglés. Por defecto se crearán en español.\nLa opción -md añadirá código (de compilación condicional) para el modo \"dibujo invisible\" en los Amstrad CPC.\n\n- Trizbort.io:\n\n - http://trizbort.io/\n\n- DAAD\n\n - http://wiki.caad.es/DAAD\n - http://www.caad.es/fichas/daad.html\n - http://www.rockersuke.com/if/ebbp/\n - http://8-bit.info/infinite-imaginations-aventuras-ad/\n\n\nHasta el momento parece convertir correctamente:\n\n- Habitaciones, incluyendo sus descripciones y estableciendo la localidad de comienzo.\n- Conexiones comunes por puntos cardinales (N,S,E,O,NE,NO,SE,SO).\n- Conexiones up/down o in/out.\n- Conexiones de una sola dirección.\n- Objetos incluidos en las habitaciones.\n- Localidades marcadas como \"oscuras\".\n\nTrizio2sce añade por su cuenta una barra de estado con el nombre de la localidad actual y el número de turnos transcurridos en la aventura.\nTambién añade un listado automático de salidas y soporte para respuestas por defecto a los comandos \"SALIDAS\", \"MIRAR\",\"EXAMINAR\", \"AYUDA\", \"METER\", \"SACAR\" Y \"VACIAR\". Esto gastará un número variable de mensajes en la sección /MTX y las banderas 100 y 101.\n\nTrizio2sce usa los textos del cuadro de diálogo \"map settings\" como pantalla de presentación y créditos (añadiendo frases por defecto en caso de que estuviesen vacíos). Creará un texto por defecto de introducción a la aventura editable en el mensaje nº 14.\n\nA su vez usará el campo \"subtitle\" de cada localidad como texto para su descripción corta en la barra de estado (máximo 26 caracteres). Si no lo hubiera usará el campo \"name\" y si éste fuera el elegido por defecto \"Room\" lo cambiará por \"Localidad xx\". A su vez usará el campo \"description\" para la descripción larga de la localidad en la ventana de texto de la aventura (usando de nuevo un texto por defecto \"Descripción localidad xx\" si no encontrase ninguno).\n\nIgualmente, trizio2sce usará el campo \"Name\" de los objetos como su palabra en el vocabulario. El campo \"Description\" se usará en los listados de objetos. Se recomienda usar el mismo nombre con el artículo indeterminado apropiado según género y número para su óptimo procesamiento por el motor del DAAD. Ej: \"Libro\" -> \"Un libro\", \"Gafas\" -> \"Unas gafas\".\nSiguiendo las convenciones del Trizbort original, Trizio2sce buscará las cadenas [w] y [c] en el nombre de los objetos para añadirles los atributos ropa y contenedor.\n\nY por el momento trizio2sce no puede manejarse con:\n\n- Textos personalizados en los extremos de las conexiones.\n- Conexiones con puntos intermedios en los espacios del mapa. Cualquier cosa que no sea una conexión directa entre una habitación y otra la ignorará.\n\nBugs conocidos:\n===============\n\n- Debido al comportamiento ligeramente distinto del intérprete inglés, intentar meter un objeto contenedor dentro de sí mismo (o de un objeto inexistente) en una obra inglesa, en lugar de un mensaje de error hace que el jugador deje el objeto en la localidad actual.\n\n- Debido a que los condactos para meter y/o sacar objetos de contenedores usan un único mensaje del sistema, es probable que haya disonancias con el número (singular/plural) del objeto.\n\nHISTORIA\n========\n\n- **1.0.5** 190410\n\n - Comentarios en el código fuente sustancialmente mejorados (aunque aún no definitivos).\n - Soporte para localidades \"oscuras\".\n - Soporte para el modo \"dibujo invisible\" en Amstrad CPC.\n\n- **1.0.4** 190323\n\n - Pleno soporte para objetos ropa y contenedores.\n\n- **1.0.3** 180916\n\n - Arreglado: error en el texto de presentación por defecto de la aventura.\n\n- **1.0.2** 180911\n\n - Parche para que el contador de turnos pase de 65535 a 0 en lugar de 65200 y algo.\n - Corregido bug que mantiene la localidad inicial a 0 si no se especifica ninguna. Ahora pone por defecto la 1.\n - Comprueba que el título del juego no sea \"Untitled map\"\n\n- **1.0.1** 180822\n\n - Cambios menores.\n\n- **1.0** 180819\n\n - Lanzamiento inicial.\n \n\n\nTrizio2sce english doc\n**********************\n\nTrizio2sce version 1.0.5rc2 190410 (c) 2018 Pedro Fernández\n\nTrizio2sce is a Python 3.x script that transforms a file generated with the on-line text-adventure mapping tool Trizbort.io into a source code compatible with the DAAD compilator. It's based in Triz2sce, which uses XML files from the Trizbort desktop application.\nIt's not meant to be either an adventure visual designer or a complete development tool. It's conceived as a fast and easy text-adventura prototyping tool, and also as a supporting tool for novel authors, specially suitable for learning workshops.\n\nUsage:\n======\n\nType \"Python trizio2sce.py -h\" in a command line or powershell window to see the options.\n\nThe script requires as an argument a file (wwhich must be a map generated with the Trizbort.io utility in json format) and, optionally, the name of an output file which will be a SCE formatted source code compatible with version 2.40-2.42 of the DAAD compiler. If it's not specified, a file with the same name and a .SCE extension will be created. \n\nOption -p1 will create a SCE listing with first-person system messages. Default is second-person.\nOption -e will create a SCE listing with english texts and vocabulary. Default is spanish.\nOption -md will add some conditional code to support \"Invisible string\" mode in Amstrad CPC.\n\n- Trizbort.io:\n\n - http://trizbort.io/\n\n- DAAD\n\n - http://wiki.caad.es/DAAD\n - http://www.caad.es/fichas/daad.html (download)\n\nSo far it seems to convert correctly:\n\n- Rooms, including descriptions and setting the initial location.\n- Common cardinal points connections (N,S,E,W,NE,NW,SE,SW).\n- Up/down and in/out connections.\n- One way connections\n- Objects included in locations.\n- Locations labelled as \"dark\".\n\nTrizio2sce adds on its own a status line with the current location name and the number of used turns.\nIt also adds an automatic exits listing and support for default answers to the \"EXITS\", \"LOOK\", \"EXAMINE\", \"HELP\" AND \"EMPTY\" commands. This will use a variable amount of messages in the /MTX section and flags 100 and 101.\n\nTrizio2sce uses the fields in the \"map settings\" dialogue as an introduction screen and credits (adding default sentences if they were empty). It will create a default adventure introduction text the user can edit at message number 14.\n\nIt will also use each location \"subtitle\" field as a text for its short description at the status line (max. 26 characters). If it wasn't provided it will use the \"name\" field and if this was the default text \"Room\" it will be changed to \"Loaction xx\". In turn, the \"description\" field will form the long room description in the adventure text window (again using a default \"Location xx description\" if there wasn't any)\n\nEqually, trizio2sce will use the objects field \"name\" as its word in the vocabulary. \"description\" will be used in the objects listing. It's highly recommended tu use the same name with an appropriate indefinite article in order to secure an optimized processing by the DAAD engine. Examples: \"Book\" -> \"a book\", \"trousers\" - \"some trousers\".\nFollowing original Trizbort standards, Trizio2sce will search for the [w] and [c] strings inside objects name, giving then wearable and container atributes.\n\nAnd for the moment trizio2sce cannot handle:\n\n- Personalized texts at the connections extremes.\n- Connections with intermediate points along the map. Anything other than a direct connection between a room and another will be ignored.\n\nKnown bugs:\n===========\n\n- Due to the slighty different behavior of the english interpreter, trying to put a container object inside itself (or into a non-existent object) in an english work, instead of displaying an error message will make player drop the object at current location.\n\n- Number (singular/plural) discordances are to be expected due to the fact that putting in and out condacts use just one system message for both cases.\n\nHISTORY\n=======\n\n- **1.0.5** 190410\n\n - Substantially updated comments in the sce source code (not definitive yet).\n - Support for locations labelled as \"dark\".\n - Support for \"invisible string\" mode in Amstrad CPC.\n\n- **1.0.4** 190322\n\n - Full wearable and container objects support.\n - Extra checks to avoid invalid object names (null string, blank spaces).\n\n- **1.0.3** 180916\n\n - Fixed: wrong default adventure introduction text.\n\n- **1.0.2**\n\n - Fix the turns counter so it skips from 65535 to 0 instead of 65200 something.\n - Fixed bug that kept initial location as 0 if no one was indicated. Now default is 1.\n - Checks the game's title is not the default \"Untitled map\".\n\n- **1.0.1** 180822\n\n - Minor polishing\n\n- **1.0.** 180819\n\n - Initial release", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://www.zonafi.rockersuke.com/trizio2sce/index.html", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "trizio2sce", "package_url": "https://pypi.org/project/trizio2sce/", "platform": "", "project_url": "https://pypi.org/project/trizio2sce/", "project_urls": {"Homepage": "http://www.zonafi.rockersuke.com/trizio2sce/index.html"}, "release_url": "https://pypi.org/project/trizio2sce/1.0.5/", "requires_dist": null, "requires_python": ">=3.5", "summary": "Convierte mapas de aventuras de texto generados por Trizbort.io en código fuente para el DAAD.", "version": "1.0.5", "yanked": false, "html_description": "<div class=\"project-description\">\n            <div id=\"trizio2sce\">\n<h2>Trizio2sce</h2>\n<p>English instructions below.</p>\n<p>Triz2sce versión 1.0.5rc2 190410 (c) 2018 Pedro Fernández</p>\n<p>Trizio2sce.py es un script de Python 3.x que transforma un fichero generado con la utilidad on-line para mapear aventuras Trizbort.io en un código fuente compatible con el compilador del DAAD. Está basado en Triz2sce, que usa los ficheros XML de la aplicación de escritorio Trizbort.\nNo es un diseñador visual de aventuras ni una aplicación para su desarrollo completo. Está concebido como herramienta para hacer prototipos iniciales de aventuras con rapidez y facilidad y, a su vez, como herramienta de apoyo a autores nóveles, ideal para su uso en talleres de aprendizaje.</p>\n<div id=\"uso\">\n<h3>Uso:</h3>\n<p>Usar “Python trizio2sce.py -h” en una linea de comandos o powershell para ver las opciones.</p>\n<p>El script requiere como argumentos un fichero de entrada (que debe ser un mapa generado por la utilidad Trizbort.io en formato json) y, opcionalmente, el nombre de un fichero de salida, que será un código fuente en formato .SCE compatible con la versión 2.40-2.42 del compilador del DAAD. Si no se especifica se creará un fichero con el mismo nombre y la extensión .SCE</p>\n<p>La opción -p1 generará un listado SCE con los mensajes del sistema en primera persona. Por defecto éstos se crearán en segunda persona.\nLa opción -e generará un listado SCE con los textos y el vocabulario en inglés. Por defecto se crearán en español.\nLa opción -md añadirá código (de compilación condicional) para el modo “dibujo invisible” en los Amstrad CPC.</p>\n<ul>\n<li>Trizbort.io:</li>\n</ul>\n<blockquote>\n<ul>\n<li><a href=\"http://trizbort.io/\" rel=\"nofollow\">http://trizbort.io/</a></li>\n</ul>\n</blockquote>\n<ul>\n<li>DAAD</li>\n</ul>\n<blockquote>\n<ul>\n<li><a href=\"http://wiki.caad.es/DAAD\" rel=\"nofollow\">http://wiki.caad.es/DAAD</a></li>\n<li><a href=\"http://www.caad.es/fichas/daad.html\" rel=\"nofollow\">http://www.caad.es/fichas/daad.html</a></li>\n<li><a href=\"http://www.rockersuke.com/if/ebbp/\" rel=\"nofollow\">http://www.rockersuke.com/if/ebbp/</a></li>\n<li><a href=\"http://8-bit.info/infinite-imaginations-aventuras-ad/\" rel=\"nofollow\">http://8-bit.info/infinite-imaginations-aventuras-ad/</a></li>\n</ul>\n</blockquote>\n<p>Hasta el momento parece convertir correctamente:</p>\n<ul>\n<li>Habitaciones, incluyendo sus descripciones y estableciendo la localidad de comienzo.</li>\n<li>Conexiones comunes por puntos cardinales (N,S,E,O,NE,NO,SE,SO).</li>\n<li>Conexiones up/down o in/out.</li>\n<li>Conexiones de una sola dirección.</li>\n<li>Objetos incluidos en las habitaciones.</li>\n<li>Localidades marcadas como “oscuras”.</li>\n</ul>\n<p>Trizio2sce añade por su cuenta una barra de estado con el nombre de la localidad actual y el número de turnos transcurridos en la aventura.\nTambién añade un listado automático de salidas y soporte para respuestas por defecto a los comandos “SALIDAS”, “MIRAR”,”EXAMINAR”, “AYUDA”, “METER”, “SACAR” Y “VACIAR”. Esto gastará un número variable de mensajes en la sección /MTX y las banderas 100 y 101.</p>\n<p>Trizio2sce usa los textos del cuadro de diálogo “map settings” como pantalla de presentación y créditos (añadiendo frases por defecto en caso de que estuviesen vacíos). Creará un texto por defecto de introducción a la aventura editable en el mensaje nº 14.</p>\n<p>A su vez usará el campo “subtitle” de cada localidad como texto para su descripción corta en la barra de estado (máximo 26 caracteres). Si no lo hubiera usará el campo “name” y si éste fuera el elegido por defecto “Room” lo cambiará por “Localidad xx”. A su vez usará el campo “description” para la descripción larga de la localidad en la ventana de texto de la aventura (usando de nuevo un texto por defecto “Descripción localidad xx” si no encontrase ninguno).</p>\n<p>Igualmente, trizio2sce usará el campo “Name” de los objetos como su palabra en el vocabulario. El campo “Description” se usará en los listados de objetos. Se recomienda usar el mismo nombre con el artículo indeterminado apropiado según género y número para su óptimo procesamiento por el motor del DAAD. Ej: “Libro” -&gt; “Un libro”, “Gafas” -&gt; “Unas gafas”.\nSiguiendo las convenciones del Trizbort original, Trizio2sce buscará las cadenas [w] y [c] en el nombre de los objetos para añadirles los atributos ropa y contenedor.</p>\n<p>Y por el momento trizio2sce no puede manejarse con:</p>\n<ul>\n<li>Textos personalizados en los extremos de las conexiones.</li>\n<li>Conexiones con puntos intermedios en los espacios del mapa. Cualquier cosa que no sea una conexión directa entre una habitación y otra la ignorará.</li>\n</ul>\n</div>\n<div id=\"bugs-conocidos\">\n<h3>Bugs conocidos:</h3>\n<ul>\n<li>Debido al comportamiento ligeramente distinto del intérprete inglés, intentar meter un objeto contenedor dentro de sí mismo (o de un objeto inexistente) en una obra inglesa, en lugar de un mensaje de error hace que el jugador deje el objeto en la localidad actual.</li>\n<li>Debido a que los condactos para meter y/o sacar objetos de contenedores usan un único mensaje del sistema, es probable que haya disonancias con el número (singular/plural) del objeto.</li>\n</ul>\n</div>\n<div id=\"historia\">\n<h3>HISTORIA</h3>\n<ul>\n<li><strong>1.0.5</strong> 190410</li>\n</ul>\n<blockquote>\n<ul>\n<li>Comentarios en el código fuente sustancialmente mejorados (aunque aún no definitivos).</li>\n<li>Soporte para localidades “oscuras”.</li>\n<li>Soporte para el modo “dibujo invisible” en Amstrad CPC.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.4</strong> 190323</li>\n</ul>\n<blockquote>\n<ul>\n<li>Pleno soporte para objetos ropa y contenedores.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.3</strong> 180916</li>\n</ul>\n<blockquote>\n<ul>\n<li>Arreglado: error en el texto de presentación por defecto de la aventura.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.2</strong> 180911</li>\n</ul>\n<blockquote>\n<ul>\n<li>Parche para que el contador de turnos pase de 65535 a 0 en lugar de 65200 y algo.</li>\n<li>Corregido bug que mantiene la localidad inicial a 0 si no se especifica ninguna. Ahora pone por defecto la 1.</li>\n<li>Comprueba que el título del juego no sea “Untitled map”</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.1</strong> 180822</li>\n</ul>\n<blockquote>\n<ul>\n<li>Cambios menores.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0</strong> 180819</li>\n</ul>\n<blockquote>\n<ul>\n<li>Lanzamiento inicial.</li>\n</ul>\n</blockquote>\n</div>\n</div>\n<div id=\"trizio2sce-english-doc\">\n<h2>Trizio2sce english doc</h2>\n<p>Trizio2sce version 1.0.5rc2 190410 (c) 2018 Pedro Fernández</p>\n<p>Trizio2sce is a Python 3.x script that transforms a file generated with the on-line text-adventure mapping tool Trizbort.io into a source code compatible with the DAAD compilator. It’s based in Triz2sce, which uses XML files from the Trizbort desktop application.\nIt’s not meant to be either an adventure visual designer or a complete development tool. It’s conceived as a fast and easy text-adventura prototyping tool, and also as a supporting tool for novel authors, specially suitable for learning workshops.</p>\n<div id=\"usage\">\n<h3>Usage:</h3>\n<p>Type “Python trizio2sce.py -h” in a command line or powershell window to see the options.</p>\n<p>The script requires as an argument a file (wwhich must be a map generated with the Trizbort.io utility in json format) and, optionally, the name of an output file which will be a SCE formatted source code compatible with version 2.40-2.42 of the DAAD compiler. If it’s not specified, a file with the same name and a .SCE extension will be created.</p>\n<p>Option -p1 will create a SCE listing with first-person system messages. Default is second-person.\nOption -e will create a SCE listing with english texts and vocabulary. Default is spanish.\nOption -md will add some conditional code to support “Invisible string” mode in Amstrad CPC.</p>\n<ul>\n<li>Trizbort.io:</li>\n</ul>\n<blockquote>\n<ul>\n<li><a href=\"http://trizbort.io/\" rel=\"nofollow\">http://trizbort.io/</a></li>\n</ul>\n</blockquote>\n<ul>\n<li>DAAD</li>\n</ul>\n<blockquote>\n<ul>\n<li><a href=\"http://wiki.caad.es/DAAD\" rel=\"nofollow\">http://wiki.caad.es/DAAD</a></li>\n<li><a href=\"http://www.caad.es/fichas/daad.html\" rel=\"nofollow\">http://www.caad.es/fichas/daad.html</a> (download)</li>\n</ul>\n</blockquote>\n<p>So far it seems to convert correctly:</p>\n<ul>\n<li>Rooms, including descriptions and setting the initial location.</li>\n<li>Common cardinal points connections (N,S,E,W,NE,NW,SE,SW).</li>\n<li>Up/down and in/out connections.</li>\n<li>One way connections</li>\n<li>Objects included in locations.</li>\n<li>Locations labelled as “dark”.</li>\n</ul>\n<p>Trizio2sce adds on its own a status line with the current location name and the number of used turns.\nIt also adds an automatic exits listing and support for default answers to the “EXITS”, “LOOK”, “EXAMINE”, “HELP” AND “EMPTY” commands. This will use a variable amount of messages in the /MTX section and flags 100 and 101.</p>\n<p>Trizio2sce uses the fields in the “map settings” dialogue as an introduction screen and credits (adding default sentences if they were empty). It will create a default adventure introduction text the user can edit at message number 14.</p>\n<p>It will also use each location “subtitle” field as a text for its short description at the status line (max. 26 characters). If it wasn’t provided it will use the “name” field and if this was the default text “Room” it will be changed to “Loaction xx”. In turn, the “description” field will form the long room description in the adventure text window (again using a default “Location xx description” if there wasn’t any)</p>\n<p>Equally, trizio2sce will use the objects field “name” as its word in the vocabulary. “description” will be used in the objects listing. It’s highly recommended tu use the same name with an appropriate indefinite article in order to secure an optimized processing by the DAAD engine. Examples: “Book” -&gt; “a book”, “trousers” - “some trousers”.\nFollowing original Trizbort standards, Trizio2sce will search for the [w] and [c] strings inside objects name, giving then wearable and container atributes.</p>\n<p>And for the moment trizio2sce cannot handle:</p>\n<ul>\n<li>Personalized texts at the connections extremes.</li>\n<li>Connections with intermediate points along the map. Anything other than a direct connection between a room and another will be ignored.</li>\n</ul>\n</div>\n<div id=\"known-bugs\">\n<h3>Known bugs:</h3>\n<ul>\n<li>Due to the slighty different behavior of the english interpreter, trying to put a container object inside itself (or into a non-existent object) in an english work, instead of displaying an error message will make player drop the object at current location.</li>\n<li>Number (singular/plural) discordances are to be expected due to the fact that putting in and out condacts use just one system message for both cases.</li>\n</ul>\n</div>\n<div id=\"history\">\n<h3>HISTORY</h3>\n<ul>\n<li><strong>1.0.5</strong> 190410</li>\n</ul>\n<blockquote>\n<ul>\n<li>Substantially updated comments in the sce source code (not definitive yet).</li>\n<li>Support for locations labelled as “dark”.</li>\n<li>Support for “invisible string” mode in Amstrad CPC.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.4</strong> 190322</li>\n</ul>\n<blockquote>\n<ul>\n<li>Full wearable and container objects support.</li>\n<li>Extra checks to avoid invalid object names (null string, blank spaces).</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.3</strong> 180916</li>\n</ul>\n<blockquote>\n<ul>\n<li>Fixed: wrong default adventure introduction text.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.2</strong></li>\n</ul>\n<blockquote>\n<ul>\n<li>Fix the turns counter so it skips from 65535 to 0 instead of 65200 something.</li>\n<li>Fixed bug that kept initial location as 0 if no one was indicated. Now default is 1.</li>\n<li>Checks the game’s title is not the default “Untitled map”.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.1</strong> 180822</li>\n</ul>\n<blockquote>\n<ul>\n<li>Minor polishing</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.</strong> 180819</li>\n</ul>\n<blockquote>\n<ul>\n<li>Initial release</li>\n</ul>\n</blockquote>\n</div>\n</div>\n\n          </div>"}, "last_serial": 5125647, "releases": {"1.0": [{"comment_text": "", "digests": {"md5": "00d9163e7d8fde29ee7df2fbf38f4aeb", "sha256": "0bdb2a0247f7091d3e25f007a690bf475faf7d4291b37e6fb8c1ca59b1bc40a1"}, "downloads": -1, "filename": "trizio2sce-1.0.zip", "has_sig": false, "md5_digest": "00d9163e7d8fde29ee7df2fbf38f4aeb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 24613, "upload_time": "2018-08-20T22:04:50", "upload_time_iso_8601": "2018-08-20T22:04:50.978388Z", "url": "https://files.pythonhosted.org/packages/e8/d1/b16a625e110191056b186f49d847b59a65c0890ecee652efac48a6d866b4/trizio2sce-1.0.zip", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "c6deb1b8ca20a5bedb92dbee9d62f811", "sha256": "800e9e0a1a26ceb8b0baba079c106672b1af590e5d3ee7fc4cf8d5509362cf4b"}, "downloads": -1, "filename": "trizio2sce-1.0.1.zip", "has_sig": false, "md5_digest": "c6deb1b8ca20a5bedb92dbee9d62f811", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 24799, "upload_time": "2018-08-22T17:36:34", "upload_time_iso_8601": "2018-08-22T17:36:34.996355Z", "url": "https://files.pythonhosted.org/packages/93/ac/96d4b8c4d4d1ec7340f4c8f67c74264c6bbc4b80c7f9d9292b92b99b3b3a/trizio2sce-1.0.1.zip", "yanked": false}], "1.0.2": [{"comment_text": "", "digests": {"md5": "6d80c367fec072a397f52f72536e3284", "sha256": "4eb62cf360cf170d1448737bbcd1567c9fedd73f22abc810136fff602eb97965"}, "downloads": -1, "filename": "trizio2sce-1.0.2.zip", "has_sig": false, "md5_digest": "6d80c367fec072a397f52f72536e3284", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 25268, "upload_time": "2018-09-15T16:57:30", "upload_time_iso_8601": "2018-09-15T16:57:30.386739Z", "url": "https://files.pythonhosted.org/packages/e2/69/1e10151ebfd8a25a398c428a30caf54e32a0b65a207d61502e602defe0b7/trizio2sce-1.0.2.zip", "yanked": false}], "1.0.3": [{"comment_text": "", "digests": {"md5": "c5f9b5a65c723dab653ccd9a6f50bb66", "sha256": "c57b940878320bd25edd707d46f3a4144a90365309f32902c73dd7092d0143dd"}, "downloads": -1, "filename": "trizio2sce-1.0.3.zip", "has_sig": false, "md5_digest": "c5f9b5a65c723dab653ccd9a6f50bb66", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 25417, "upload_time": "2018-09-15T23:00:12", "upload_time_iso_8601": "2018-09-15T23:00:12.444584Z", "url": "https://files.pythonhosted.org/packages/ad/19/9b40952192edbf65c4fda60eb4038d1456eb0ddaa25ec078bf7c53133a93/trizio2sce-1.0.3.zip", "yanked": false}], "1.0.4": [{"comment_text": "", "digests": {"md5": "3d5bcc8274052d75d051dc9612ea8b32", "sha256": "795849667fd23b0cc7973a8dae5dd9c65417f431a6dc7e2a256cec18f4460405"}, "downloads": -1, "filename": "trizio2sce-1.0.4.zip", "has_sig": false, "md5_digest": "3d5bcc8274052d75d051dc9612ea8b32", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 29808, "upload_time": "2019-03-23T11:29:32", "upload_time_iso_8601": "2019-03-23T11:29:32.395505Z", "url": "https://files.pythonhosted.org/packages/54/33/b312a626a8f2cd0a9492ce7c0e7717b8db45410cb3f971c94899cc021d5a/trizio2sce-1.0.4.zip", "yanked": false}], "1.0.4.post1": [{"comment_text": "", "digests": {"md5": "d0ef25c6818b38af48124c928a50590e", "sha256": "19cbeb2786e82c5a65a820d630fb3beb756e9fb2736ef59a94a226eb98ede8b4"}, "downloads": -1, "filename": "trizio2sce-1.0.4.post1.zip", "has_sig": false, "md5_digest": "d0ef25c6818b38af48124c928a50590e", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 29980, "upload_time": "2019-03-23T11:56:52", "upload_time_iso_8601": "2019-03-23T11:56:52.174967Z", "url": "https://files.pythonhosted.org/packages/8e/04/9be964eb68c2c022627e24350e2aaa9530aa70ccdf80b23218c0d1c07c1a/trizio2sce-1.0.4.post1.zip", "yanked": false}], "1.0.4.post2": [{"comment_text": "", "digests": {"md5": "918c1a0e7370357134258610a5130ed5", "sha256": "2bfaa9441754eed99ab5be541b2e7b5d869c8a92254fd3ca6e7e238699e99a51"}, "downloads": -1, "filename": "trizio2sce-1.0.4.post2.zip", "has_sig": false, "md5_digest": "918c1a0e7370357134258610a5130ed5", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 30113, "upload_time": "2019-03-23T12:35:36", "upload_time_iso_8601": "2019-03-23T12:35:36.816274Z", "url": "https://files.pythonhosted.org/packages/76/f4/21c0400d03b41573ecd6890aa081f0086842b52ec47f959d546663a9c66f/trizio2sce-1.0.4.post2.zip", "yanked": false}], "1.0.4b1": [{"comment_text": "", "digests": {"md5": "cbeb4f0281206d1bb7d6830ddc012ace", "sha256": "d3554f0cbf21ad0cb5a39929be461e5c0db2085c00cf5cc3e92df08ed1581a26"}, "downloads": -1, "filename": "trizio2sce-1.0.4b1.zip", "has_sig": false, "md5_digest": "cbeb4f0281206d1bb7d6830ddc012ace", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 27750, "upload_time": "2019-03-18T00:09:21", "upload_time_iso_8601": "2019-03-18T00:09:21.449979Z", "url": "https://files.pythonhosted.org/packages/b5/5b/f40ffd73525b2cef257fb779d81467b574ca15b7c7a70d2d0b379f069add/trizio2sce-1.0.4b1.zip", "yanked": false}], "1.0.4rc1": [{"comment_text": "", "digests": {"md5": "29a2e78169a8541d3db181729072bdd5", "sha256": "2306c7764114b6fdd4a8f198fb76b3cd1b41d58f33ab292bd0e0cd6a89e07196"}, "downloads": -1, "filename": "trizio2sce-1.0.4rc1.zip", "has_sig": false, "md5_digest": "29a2e78169a8541d3db181729072bdd5", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 28681, "upload_time": "2019-03-20T00:15:52", "upload_time_iso_8601": "2019-03-20T00:15:52.232678Z", "url": "https://files.pythonhosted.org/packages/0a/48/b934484db896fd78eebda097d5e1173974c3bab0ca812ba9d3a92df8fbb9/trizio2sce-1.0.4rc1.zip", "yanked": false}], "1.0.4rc2": [{"comment_text": "", "digests": {"md5": "250da24cad8aac37ed59548cbce2b0f4", "sha256": "cd1bb4da890729d6043fa906ef62ef8837bba7f72144986bba6e177a61e8de9c"}, "downloads": -1, "filename": "trizio2sce-1.0.4rc2.zip", "has_sig": false, "md5_digest": "250da24cad8aac37ed59548cbce2b0f4", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 28672, "upload_time": "2019-03-20T19:37:39", "upload_time_iso_8601": "2019-03-20T19:37:39.306254Z", "url": "https://files.pythonhosted.org/packages/4b/da/81e4ef57dfd366f404673bcc231018d832aacd6e9820fddfe473149713f7/trizio2sce-1.0.4rc2.zip", "yanked": false}], "1.0.5": [{"comment_text": "", "digests": {"md5": "729f9c7c29ef024c2ced7195ad43eec2", "sha256": "866716c350d83fcdb26daaf3cf953c2f9f2d6261fb6a02be6d3f22a0d0e4f416"}, "downloads": -1, "filename": "trizio2sce-1.0.5.zip", "has_sig": false, "md5_digest": "729f9c7c29ef024c2ced7195ad43eec2", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 33894, "upload_time": "2019-04-10T19:43:10", "upload_time_iso_8601": "2019-04-10T19:43:10.676067Z", "url": "https://files.pythonhosted.org/packages/22/4c/4dc3938c95d2691cc625af254656f9255b06a11d5caba0ff861e44c3a1c1/trizio2sce-1.0.5.zip", "yanked": false}], "1.0.5b1": [{"comment_text": "", "digests": {"md5": "d5212b33004a90388f74a6ba2430e359", "sha256": "2a8ea608a818f6490ce490c7260b0439da33f02febe1f478593cf1a05e8bb53a"}, "downloads": -1, "filename": "trizio2sce-1.0.5b1.zip", "has_sig": false, "md5_digest": "d5212b33004a90388f74a6ba2430e359", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 30709, "upload_time": "2019-03-23T21:39:42", "upload_time_iso_8601": "2019-03-23T21:39:42.340840Z", "url": "https://files.pythonhosted.org/packages/bb/0f/c369402b7f380045eb63fb2e8c99aaf59414639d538068d9c55d8c42a9f8/trizio2sce-1.0.5b1.zip", "yanked": false}], "1.0.5b2": [{"comment_text": "", "digests": {"md5": "e5ef25a32468040edb366e9f99230326", "sha256": "36be81ca2f3aaf017badc0b9523fa3fe800933f07eac33c86ea72cbee3fee64b"}, "downloads": -1, "filename": "trizio2sce-1.0.5b2.zip", "has_sig": false, "md5_digest": "e5ef25a32468040edb366e9f99230326", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 30855, "upload_time": "2019-03-24T12:00:28", "upload_time_iso_8601": "2019-03-24T12:00:28.547264Z", "url": "https://files.pythonhosted.org/packages/62/0e/c133a6bbc19430a3bed07410808b4f4532cebe2e08efbfe9f00b886a04e2/trizio2sce-1.0.5b2.zip", "yanked": false}], "1.0.5rc1": [{"comment_text": "", "digests": {"md5": "c92b3b94b592622fc5babb4c70bbef93", "sha256": "018a9913243ce56f39c74b435c67b5b9d07de30c1835fc757dd757ad6bf0acdd"}, "downloads": -1, "filename": "trizio2sce-1.0.5rc1.zip", "has_sig": false, "md5_digest": "c92b3b94b592622fc5babb4c70bbef93", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 31789, "upload_time": "2019-04-01T00:10:27", "upload_time_iso_8601": "2019-04-01T00:10:27.167396Z", "url": "https://files.pythonhosted.org/packages/ce/42/1e19f5008fe3798f82c24484c50b6afa72872040129bb7ac30bb6c32e4c4/trizio2sce-1.0.5rc1.zip", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "729f9c7c29ef024c2ced7195ad43eec2", "sha256": "866716c350d83fcdb26daaf3cf953c2f9f2d6261fb6a02be6d3f22a0d0e4f416"}, "downloads": -1, "filename": "trizio2sce-1.0.5.zip", "has_sig": false, "md5_digest": "729f9c7c29ef024c2ced7195ad43eec2", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 33894, "upload_time": "2019-04-10T19:43:10", "upload_time_iso_8601": "2019-04-10T19:43:10.676067Z", "url": "https://files.pythonhosted.org/packages/22/4c/4dc3938c95d2691cc625af254656f9255b06a11d5caba0ff861e44c3a1c1/trizio2sce-1.0.5.zip", "yanked": false}], "timestamp": "Fri May  8 03:46:49 2020"}