{"info": {"author": "Pedro Fernández", "author_email": "rockersuke@gmail.com", "bugtrack_url": null, "classifiers": [], "description": "Triz2sce\n********\n\nEnglish instructions below.\n\nTriz2sce versión 1.0.8 190323 (c) 2018 Pedro Fernández\n\nTriz2sce.py es un script de Python 3.x que transforma un fichero generado con la utilidad para mapear aventuras Trizbort en un código fuente compatible con el compilador del DAAD.\nNo es un diseñador visual de aventuras ni una aplicación para su desarrollo completo. Está concebido como herramienta para hacer prototipos iniciales de aventuras con rapidez y facilidad y, a su vez, como herramienta de apoyo a autores nóveles, ideal para su uso en talleres de aprendizaje.\n\nUso:\n====\n\nUsar \"Python triz2sce.py -h\" en una linea de comandos o powershell para ver las opciones.\n\nEl script requiere como argumentos un fichero de entrada (que debe ser un mapa generado por la utilidad Trizbort en formato XML, con soporte para la versión 1.7.0) y, opcionalmente, el nombre de un fichero de salida, que será un código fuente en formato .SCE compatible con la versión 2.40-2.42 del compilador del DAAD. Si no se especifica se creará un fichero con el mismo nombre y la extensión .SCE\n\nLa opción -p1 generará un listado SCE con los mensajes del sistema en primera persona. Por defecto éstos se crearán en segunda persona.\nLa opción -e generará un listado SCE con los textos y el vocabulario en inglés. Por defecto se crearán en español.\n\n- Trizbort:\n\n - http://www.trizbort.com/\n\n- DAAD\n\n - http://wiki.caad.es/DAAD\n - http://www.caad.es/fichas/daad.html\n - http://www.rockersuke.com/if/ebbp/\n - http://8-bit.info/infinite-imaginations-aventuras-ad/\n\n\nHasta el momento parece convertir correctamente:\n\n- Habitaciones, incluyendo sus descripciones y estableciendo la localidad de comienzo.\n- Conexiones comunes por puntos cardinales (N,S,E,O,NE,NO,SE,SO).\n- Conexiones up/down o in/out.\n- Conexiones de una sola dirección.\n- Objetos incluidos en las habitaciones.\n\nTriz2sce añade por su cuenta una barra de estado con el nombre de la localidad actual y el número de turnos transcurridos en la aventura.\nTambién añade un listado automático de salidas y soporte para respuestas por defecto a los comandos \"SALIDAS\", \"MIRAR\", \"EXAMINAR\", \"AYUDA\", \"METER\", \"SACAR\" y \"VACIAR\". Esto gastará un número variable de mensajes en la sección /MTX y las banderas 100 y 101.\n\nTriz2sce usa los textos del cuadro de diálogo \"map settings\" (menu \"tools\") como pantalla de presentación, créditos y texto de introducción a la aventura (añadiendo frases por defecto en caso de que estuviesen vacíos).\n\nA su vez usará el campo \"subtitle\" de cada localidad como texto para su descripción corta en la barra de estado (máximo 26 caracteres). Si no lo hubiera usará el campo \"name\" y si éste fuera el elegido por defecto \"Cave\" lo cambiará por \"Localidad xx\". A su vez usará el campo \"description\" para la descripción larga de la localidad en la ventana de texto de la aventura (usando de nuevo un texto por defecto \"Descripción localidad xx\" si no encontrase ninguno).\n\nIgualmente triz2sce leerá, si los hubiera, los atributos [m], [f], [1], [2], [w] y [c] en el nombre de los objetos, entendiéndolos como masculino, fememnino, singular, plural, ropa y contenedor, y añadirá el artículo indeterminado correspondiente (un, uno, una, unas) al comienzo del texto de los objetos en la sección /OTX. Tanto si los hay como si no, entenderá la primera palabra del texto como la palabra de vocabulario para ese objeto y el texto completo como texto para su uso en listados.\n\nY por el momento triz2sce no puede manejarse con:\n\n- Textos personalizados en los extremos de las conexiones, así como el resto de características personalizables de dichas conexiones en Trizbort (puertas, oscuridad) que al fin y al cabo tampoco tienen un soporte universal en los distintos formatos de fichero a los que Trizbort puede exportar.\n- Conexiones con puntos intermedios en los espacios del mapa. Cualquier cosa que no sea una conexión directa entre una habitación y otra la ignorará.\n\nBugs conocidos:\n===============\n\n- Debido al comportamiento ligeramente distinto del intérprete inglés, intentar meter un objeto contenedor dentro de sí mismo (o de un objeto inexistente) en una obra inglesa, en lugar de un mensaje de error hace que el jugador deje el objeto en la localidad actual.\n\n- Debido a que los condactos para meter y/o sacar objetos de contenedores usan un único mensaje del sistema, es probable que haya disonancias con el número (singular/plural) del objeto.\n\nHISTORIA\n========\n\n- **1.0.8 190323**\n\n - Pleno soporte para objetos ropa y contenedores.\n - Chequeos adicionales para evitar nombres no válidos de objetos (cadenas nulas, espacios en blanco).\n\n- **1.0.7** 181208\n\n - Arreglado: el script se colgaba si se cambiaba la posición por defecto de los objetos en una localidad sin añadir ningún objeto.\n\n- **1.0.6** 181205\n\n - Arreglado: el objeto dummy creado si el mapa no incluye objetos no tenía todos los atributos necesarios.\n\n- **1.0.5** 180916\n\n - Arreglado: extensión erronea al crear el fichero de salida.\n\n- **1.0.4** 180915\n\n - Parche para que el contador de turnos pase de 65535 a 0 en lugar de 65200 y algo.\n\n- **1.0.3** 180822 \n\n - El fichero de salida es ahora un argumento opcional.\n - Añadida opción para la creación de plantillas de DAAD en inglés.\n\n- **1.0.1** 180420\n\n - Añadida forma imperativa pronominal al verbo \"poner\"\n - Añadido soporte al atributo [w] (que entenderá como \"wearable\")\n\n- **1.0** 180404\n\n - Primer lanzamiento.\n\n- **Beta 0.9.1** 180402\n\n - Filtra acentos en el campo \"author\" antes de pasarlo a mayúsculas (las mayúsculas acentuadas no son admimtidas por el compilador del DAAD).\n - Añadida el verbo \"AYUDA\" al vocabulario e implementada su correspondiente acción.\n\n- **Beta 0.9** 180331\n\n - Añadida barra de estado que muestra el atributo \"subtitle\" de la localidad y el nº de turnos ejecutados durante el juego.\n - Añadido soporte para el verbo \"EXAMINAR\" con respuesta por defecto.\n - El texto de los objetos de la sección /OTX añade artículos indeterminados (un, unos, una, unas) en función de los atributos de los objetos.\n\n- **Beta 0.6** 180315\n\n - Listado de salidas deja de ser opcional (el aprendiz puede aprender a retirarlo manualmente con facilidad, lo que es más acorde con el carácter de herramienta de aprendizaje de triz2sce)\n - Se usan los textos del cuadro de diálogo \"map settings\" (menú tools) de trizbort como pantalla de presentación y créditos de la aventura.\n\n- **Beta 0.5** 181103\n\n - Números de vocabulario diferentes para las acciones EXAMINAR y MIRAR\n - Corregido bug por el que se producía un error al intentar convertir mapas sin objetos (a base de añadir un objeto dummy)\n - Añadido listado automático de salidas (opcional) que, ojo, gasta los flags 100 y 101\n\nTriz2sce english doc\n********************\n\nTriz2sce version 1.0.8 190323 (c) 2018 Pedro Fernández\n\nTriz2sce is a Python 3.x script that transforms a file generated with the text-adventure mapping tool Trizbort into a source code compatible with the DAAD compiler.\nIt's not meant to be either an adventure visual designer or a complete development tool. It's conceived as a fast and easy text-adventura prototyping tool, and also as a supporting tool for novel authors, specially suitable for learning workshops.\n\nUsage:\n======\n\nType \"Python triz2sce.py -h\" in a command line or powershell window to see the options.\n\nThe script requires as an argument a file (wwhich must be a map generated with the Trizbort utility in XML format) and, optionally, the name of an output file which will be a SCE formatted source code compatible with version 2.40-2.42 of the DAAD compiler. If it's not specified, a file with the same name and a .SCE extension will be created. \n\nOption -p1 will create a SCE listing with first-person system messages. Default is second-person.\nOption -e will create a SCE listing with english texts and vocabulary. Default is spanish.\n\n- Trizbort:\n\n - http://www.trizbort.com/\n\n- DAAD\n\n - http://wiki.caad.es/DAAD\n - http://www.caad.es/fichas/daad.html (download)\n\nSo far it seems to convert correctly:\n\n- Rooms, including descriptions and setting the initial location.\n- Common cardinal points connections (N,S,E,W,NE,NW,SE,SW).\n- Up/down and in/out connections.\n- One way connections\n- Objects included in locations.\n\nTrizio2sce adds on its own a status line with the current location name and the number of used turns.\nIt also adds an automatic exits listing and support for default answers to the \"EXITS\", \"LOOK\", \"EXAMINE\", \"HELP\" and \"EMPTY\" commands. This will use a variable amount of messages in the /MTX section and flags 100 and 101.\n\nIt will also use each location \"subtitle\" field as a text for its short description at the status line (max. 26 characters). If it wasn't provided it will use the \"name\" field and if this was the default text \"Cave\" it will be changed to \"Loaction xx\". In turn, the \"description\" field will form the long room description in the adventure text window (again using a default \"Location xx description\" if there wasn't any)\n\nEqually, triz2sce will read, if any, the [m], [f], [1], [2], [w] and [c] attributes in the objects' name, understanding them as male, female, singular, plural, wearable and container, and will add the corresponding indefinite article at he start of the object text in the /OTX section. In any case it will use the first word in the text as its vocabulary word and the whole text as text for listings.\n\nAnd for the moment trizio2sce cannot handle:\n\n- Personalized texts at the connections extremes.\n- Connections with intermediate points along the map. Anything other than a direct connection between a room and another will be ignored.\n\nKnown bugs:\n===========\n\n- Due to the slighty different behavior of the english interpreter, trying to put a container object inside itself (or into a non-existent object) in an english work, instead of displaying an error message will make player drop the object at current location.\n\n- Number (singular/plural) discordances are to be expected due to the fact that putting in and out condacts use just one system message for both cases.\n\nHISTORY\n=======\n\n- **1.0.8** 190323\n\n - Full support for wearable and container objects.\n - Extra checks for non valid object names (null strings, blank spaces).\n \n- **1.0.7** 181208\n\n - Fixed: Changing default position of objects in a room made script crash if no object were added.\n\n- **1.0.6** 181205\n\n - Fixed: Dummy object created if map does not include any object lacked some needed atributes.\n\n- **1.0.5** 180916\n\n - Fixed: wrong extension when creating output file.\n\n- **1.0.4** 180915\n\n - Fix the turns counter so it skips from 65535 to 0 instead of 65200 something.\n\n- **1.0.3** 180822 \n\n - Output file is now an optional argument\n - Added option to create english DAAD templates.", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "http://www.zonafi.rockersuke.com/triz2sce/index.html", "keywords": "", "license": "MIT", "maintainer": "", "maintainer_email": "", "name": "triz2sce", "package_url": "https://pypi.org/project/triz2sce/", "platform": "", "project_url": "https://pypi.org/project/triz2sce/", "project_urls": {"Homepage": "http://www.zonafi.rockersuke.com/triz2sce/index.html"}, "release_url": "https://pypi.org/project/triz2sce/1.0.8.post1/", "requires_dist": null, "requires_python": ">=3.5", "summary": "Convierte mapas de aventuras de texto generados por Trizbort en código fuente para el DAAD.", "version": "1.0.8.post1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <div id=\"triz2sce\">\n<h2>Triz2sce</h2>\n<p>English instructions below.</p>\n<p>Triz2sce versión 1.0.8 190323 (c) 2018 Pedro Fernández</p>\n<p>Triz2sce.py es un script de Python 3.x que transforma un fichero generado con la utilidad para mapear aventuras Trizbort en un código fuente compatible con el compilador del DAAD.\nNo es un diseñador visual de aventuras ni una aplicación para su desarrollo completo. Está concebido como herramienta para hacer prototipos iniciales de aventuras con rapidez y facilidad y, a su vez, como herramienta de apoyo a autores nóveles, ideal para su uso en talleres de aprendizaje.</p>\n<div id=\"uso\">\n<h3>Uso:</h3>\n<p>Usar “Python triz2sce.py -h” en una linea de comandos o powershell para ver las opciones.</p>\n<p>El script requiere como argumentos un fichero de entrada (que debe ser un mapa generado por la utilidad Trizbort en formato XML, con soporte para la versión 1.7.0) y, opcionalmente, el nombre de un fichero de salida, que será un código fuente en formato .SCE compatible con la versión 2.40-2.42 del compilador del DAAD. Si no se especifica se creará un fichero con el mismo nombre y la extensión .SCE</p>\n<p>La opción -p1 generará un listado SCE con los mensajes del sistema en primera persona. Por defecto éstos se crearán en segunda persona.\nLa opción -e generará un listado SCE con los textos y el vocabulario en inglés. Por defecto se crearán en español.</p>\n<ul>\n<li>Trizbort:</li>\n</ul>\n<blockquote>\n<ul>\n<li><a href=\"http://www.trizbort.com/\" rel=\"nofollow\">http://www.trizbort.com/</a></li>\n</ul>\n</blockquote>\n<ul>\n<li>DAAD</li>\n</ul>\n<blockquote>\n<ul>\n<li><a href=\"http://wiki.caad.es/DAAD\" rel=\"nofollow\">http://wiki.caad.es/DAAD</a></li>\n<li><a href=\"http://www.caad.es/fichas/daad.html\" rel=\"nofollow\">http://www.caad.es/fichas/daad.html</a></li>\n<li><a href=\"http://www.rockersuke.com/if/ebbp/\" rel=\"nofollow\">http://www.rockersuke.com/if/ebbp/</a></li>\n<li><a href=\"http://8-bit.info/infinite-imaginations-aventuras-ad/\" rel=\"nofollow\">http://8-bit.info/infinite-imaginations-aventuras-ad/</a></li>\n</ul>\n</blockquote>\n<p>Hasta el momento parece convertir correctamente:</p>\n<ul>\n<li>Habitaciones, incluyendo sus descripciones y estableciendo la localidad de comienzo.</li>\n<li>Conexiones comunes por puntos cardinales (N,S,E,O,NE,NO,SE,SO).</li>\n<li>Conexiones up/down o in/out.</li>\n<li>Conexiones de una sola dirección.</li>\n<li>Objetos incluidos en las habitaciones.</li>\n</ul>\n<p>Triz2sce añade por su cuenta una barra de estado con el nombre de la localidad actual y el número de turnos transcurridos en la aventura.\nTambién añade un listado automático de salidas y soporte para respuestas por defecto a los comandos “SALIDAS”, “MIRAR”, “EXAMINAR”, “AYUDA”, “METER”, “SACAR” y “VACIAR”. Esto gastará un número variable de mensajes en la sección /MTX y las banderas 100 y 101.</p>\n<p>Triz2sce usa los textos del cuadro de diálogo “map settings” (menu “tools”) como pantalla de presentación, créditos y texto de introducción a la aventura (añadiendo frases por defecto en caso de que estuviesen vacíos).</p>\n<p>A su vez usará el campo “subtitle” de cada localidad como texto para su descripción corta en la barra de estado (máximo 26 caracteres). Si no lo hubiera usará el campo “name” y si éste fuera el elegido por defecto “Cave” lo cambiará por “Localidad xx”. A su vez usará el campo “description” para la descripción larga de la localidad en la ventana de texto de la aventura (usando de nuevo un texto por defecto “Descripción localidad xx” si no encontrase ninguno).</p>\n<p>Igualmente triz2sce leerá, si los hubiera, los atributos [m], [f], [1], [2], [w] y [c] en el nombre de los objetos, entendiéndolos como masculino, fememnino, singular, plural, ropa y contenedor, y añadirá el artículo indeterminado correspondiente (un, uno, una, unas) al comienzo del texto de los objetos en la sección /OTX. Tanto si los hay como si no, entenderá la primera palabra del texto como la palabra de vocabulario para ese objeto y el texto completo como texto para su uso en listados.</p>\n<p>Y por el momento triz2sce no puede manejarse con:</p>\n<ul>\n<li>Textos personalizados en los extremos de las conexiones, así como el resto de características personalizables de dichas conexiones en Trizbort (puertas, oscuridad) que al fin y al cabo tampoco tienen un soporte universal en los distintos formatos de fichero a los que Trizbort puede exportar.</li>\n<li>Conexiones con puntos intermedios en los espacios del mapa. Cualquier cosa que no sea una conexión directa entre una habitación y otra la ignorará.</li>\n</ul>\n</div>\n<div id=\"bugs-conocidos\">\n<h3>Bugs conocidos:</h3>\n<ul>\n<li>Debido al comportamiento ligeramente distinto del intérprete inglés, intentar meter un objeto contenedor dentro de sí mismo (o de un objeto inexistente) en una obra inglesa, en lugar de un mensaje de error hace que el jugador deje el objeto en la localidad actual.</li>\n<li>Debido a que los condactos para meter y/o sacar objetos de contenedores usan un único mensaje del sistema, es probable que haya disonancias con el número (singular/plural) del objeto.</li>\n</ul>\n</div>\n<div id=\"historia\">\n<h3>HISTORIA</h3>\n<ul>\n<li><strong>1.0.8 190323</strong></li>\n</ul>\n<blockquote>\n<ul>\n<li>Pleno soporte para objetos ropa y contenedores.</li>\n<li>Chequeos adicionales para evitar nombres no válidos de objetos (cadenas nulas, espacios en blanco).</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.7</strong> 181208</li>\n</ul>\n<blockquote>\n<ul>\n<li>Arreglado: el script se colgaba si se cambiaba la posición por defecto de los objetos en una localidad sin añadir ningún objeto.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.6</strong> 181205</li>\n</ul>\n<blockquote>\n<ul>\n<li>Arreglado: el objeto dummy creado si el mapa no incluye objetos no tenía todos los atributos necesarios.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.5</strong> 180916</li>\n</ul>\n<blockquote>\n<ul>\n<li>Arreglado: extensión erronea al crear el fichero de salida.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.4</strong> 180915</li>\n</ul>\n<blockquote>\n<ul>\n<li>Parche para que el contador de turnos pase de 65535 a 0 en lugar de 65200 y algo.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.3</strong> 180822</li>\n</ul>\n<blockquote>\n<ul>\n<li>El fichero de salida es ahora un argumento opcional.</li>\n<li>Añadida opción para la creación de plantillas de DAAD en inglés.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.1</strong> 180420</li>\n</ul>\n<blockquote>\n<ul>\n<li>Añadida forma imperativa pronominal al verbo “poner”</li>\n<li>Añadido soporte al atributo [w] (que entenderá como “wearable”)</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0</strong> 180404</li>\n</ul>\n<blockquote>\n<ul>\n<li>Primer lanzamiento.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>Beta 0.9.1</strong> 180402</li>\n</ul>\n<blockquote>\n<ul>\n<li>Filtra acentos en el campo “author” antes de pasarlo a mayúsculas (las mayúsculas acentuadas no son admimtidas por el compilador del DAAD).</li>\n<li>Añadida el verbo “AYUDA” al vocabulario e implementada su correspondiente acción.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>Beta 0.9</strong> 180331</li>\n</ul>\n<blockquote>\n<ul>\n<li>Añadida barra de estado que muestra el atributo “subtitle” de la localidad y el nº de turnos ejecutados durante el juego.</li>\n<li>Añadido soporte para el verbo “EXAMINAR” con respuesta por defecto.</li>\n<li>El texto de los objetos de la sección /OTX añade artículos indeterminados (un, unos, una, unas) en función de los atributos de los objetos.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>Beta 0.6</strong> 180315</li>\n</ul>\n<blockquote>\n<ul>\n<li>Listado de salidas deja de ser opcional (el aprendiz puede aprender a retirarlo manualmente con facilidad, lo que es más acorde con el carácter de herramienta de aprendizaje de triz2sce)</li>\n<li>Se usan los textos del cuadro de diálogo “map settings” (menú tools) de trizbort como pantalla de presentación y créditos de la aventura.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>Beta 0.5</strong> 181103</li>\n</ul>\n<blockquote>\n<ul>\n<li>Números de vocabulario diferentes para las acciones EXAMINAR y MIRAR</li>\n<li>Corregido bug por el que se producía un error al intentar convertir mapas sin objetos (a base de añadir un objeto dummy)</li>\n<li>Añadido listado automático de salidas (opcional) que, ojo, gasta los flags 100 y 101</li>\n</ul>\n</blockquote>\n</div>\n</div>\n<div id=\"triz2sce-english-doc\">\n<h2>Triz2sce english doc</h2>\n<p>Triz2sce version 1.0.8 190323 (c) 2018 Pedro Fernández</p>\n<p>Triz2sce is a Python 3.x script that transforms a file generated with the text-adventure mapping tool Trizbort into a source code compatible with the DAAD compiler.\nIt’s not meant to be either an adventure visual designer or a complete development tool. It’s conceived as a fast and easy text-adventura prototyping tool, and also as a supporting tool for novel authors, specially suitable for learning workshops.</p>\n<div id=\"usage\">\n<h3>Usage:</h3>\n<p>Type “Python triz2sce.py -h” in a command line or powershell window to see the options.</p>\n<p>The script requires as an argument a file (wwhich must be a map generated with the Trizbort utility in XML format) and, optionally, the name of an output file which will be a SCE formatted source code compatible with version 2.40-2.42 of the DAAD compiler. If it’s not specified, a file with the same name and a .SCE extension will be created.</p>\n<p>Option -p1 will create a SCE listing with first-person system messages. Default is second-person.\nOption -e will create a SCE listing with english texts and vocabulary. Default is spanish.</p>\n<ul>\n<li>Trizbort:</li>\n</ul>\n<blockquote>\n<ul>\n<li><a href=\"http://www.trizbort.com/\" rel=\"nofollow\">http://www.trizbort.com/</a></li>\n</ul>\n</blockquote>\n<ul>\n<li>DAAD</li>\n</ul>\n<blockquote>\n<ul>\n<li><a href=\"http://wiki.caad.es/DAAD\" rel=\"nofollow\">http://wiki.caad.es/DAAD</a></li>\n<li><a href=\"http://www.caad.es/fichas/daad.html\" rel=\"nofollow\">http://www.caad.es/fichas/daad.html</a> (download)</li>\n</ul>\n</blockquote>\n<p>So far it seems to convert correctly:</p>\n<ul>\n<li>Rooms, including descriptions and setting the initial location.</li>\n<li>Common cardinal points connections (N,S,E,W,NE,NW,SE,SW).</li>\n<li>Up/down and in/out connections.</li>\n<li>One way connections</li>\n<li>Objects included in locations.</li>\n</ul>\n<p>Trizio2sce adds on its own a status line with the current location name and the number of used turns.\nIt also adds an automatic exits listing and support for default answers to the “EXITS”, “LOOK”, “EXAMINE”, “HELP” and “EMPTY” commands. This will use a variable amount of messages in the /MTX section and flags 100 and 101.</p>\n<p>It will also use each location “subtitle” field as a text for its short description at the status line (max. 26 characters). If it wasn’t provided it will use the “name” field and if this was the default text “Cave” it will be changed to “Loaction xx”. In turn, the “description” field will form the long room description in the adventure text window (again using a default “Location xx description” if there wasn’t any)</p>\n<p>Equally, triz2sce will read, if any, the [m], [f], [1], [2], [w] and [c] attributes in the objects’ name, understanding them as male, female, singular, plural, wearable and container, and will add the corresponding indefinite article at he start of the object text in the /OTX section. In any case it will use the first word in the text as its vocabulary word and the whole text as text for listings.</p>\n<p>And for the moment trizio2sce cannot handle:</p>\n<ul>\n<li>Personalized texts at the connections extremes.</li>\n<li>Connections with intermediate points along the map. Anything other than a direct connection between a room and another will be ignored.</li>\n</ul>\n</div>\n<div id=\"known-bugs\">\n<h3>Known bugs:</h3>\n<ul>\n<li>Due to the slighty different behavior of the english interpreter, trying to put a container object inside itself (or into a non-existent object) in an english work, instead of displaying an error message will make player drop the object at current location.</li>\n<li>Number (singular/plural) discordances are to be expected due to the fact that putting in and out condacts use just one system message for both cases.</li>\n</ul>\n</div>\n<div id=\"history\">\n<h3>HISTORY</h3>\n<ul>\n<li><strong>1.0.8</strong> 190323</li>\n</ul>\n<blockquote>\n<ul>\n<li>Full support for wearable and container objects.</li>\n<li>Extra checks for non valid object names (null strings, blank spaces).</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.7</strong> 181208</li>\n</ul>\n<blockquote>\n<ul>\n<li>Fixed: Changing default position of objects in a room made script crash if no object were added.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.6</strong> 181205</li>\n</ul>\n<blockquote>\n<ul>\n<li>Fixed: Dummy object created if map does not include any object lacked some needed atributes.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.5</strong> 180916</li>\n</ul>\n<blockquote>\n<ul>\n<li>Fixed: wrong extension when creating output file.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.4</strong> 180915</li>\n</ul>\n<blockquote>\n<ul>\n<li>Fix the turns counter so it skips from 65535 to 0 instead of 65200 something.</li>\n</ul>\n</blockquote>\n<ul>\n<li><strong>1.0.3</strong> 180822</li>\n</ul>\n<blockquote>\n<ul>\n<li>Output file is now an optional argument</li>\n<li>Added option to create english DAAD templates.</li>\n</ul>\n</blockquote>\n</div>\n</div>\n\n          </div>"}, "last_serial": 4975689, "releases": {"1.0": [{"comment_text": "", "digests": {"md5": "0f0b3a82658645ba0b90b850ec24cb54", "sha256": "f883d913df4420679fc75d8ba462795b298d61de4ee7008ac466c3997fa0cb05"}, "downloads": -1, "filename": "triz2sce-1.0.zip", "has_sig": false, "md5_digest": "0f0b3a82658645ba0b90b850ec24cb54", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 19863, "upload_time": "2018-04-09T21:04:55", "upload_time_iso_8601": "2018-04-09T21:04:55.870853Z", "url": "https://files.pythonhosted.org/packages/39/53/b8354410fc1725b01ed4db475f53472fcd6f6cc7a7fb5d359f65411d0041/triz2sce-1.0.zip", "yanked": false}], "1.0.1": [{"comment_text": "", "digests": {"md5": "371b590d1bc9a0524708469b70f29a81", "sha256": "e6080f82580057e3116bf809232ff1f6b0aed34abd6884eb6ccd2eaa9c944bed"}, "downloads": -1, "filename": "triz2sce-1.0.1.zip", "has_sig": false, "md5_digest": "371b590d1bc9a0524708469b70f29a81", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 20184, "upload_time": "2018-04-19T23:30:35", "upload_time_iso_8601": "2018-04-19T23:30:35.910437Z", "url": "https://files.pythonhosted.org/packages/3c/c2/7fe44a4f145dd79d2ebe5711e5cdfb24a64505503029ca8403e053c0fedc/triz2sce-1.0.1.zip", "yanked": false}], "1.0.3": [{"comment_text": "", "digests": {"md5": "21453f47ee7544a3b719c027160be68d", "sha256": "f8716ffdc2928f5811f366a5ed394e784dee0a40eecb5470d41413f1d014c4be"}, "downloads": -1, "filename": "triz2sce-1.0.3.zip", "has_sig": false, "md5_digest": "21453f47ee7544a3b719c027160be68d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27038, "upload_time": "2018-08-22T17:05:38", "upload_time_iso_8601": "2018-08-22T17:05:38.446081Z", "url": "https://files.pythonhosted.org/packages/74/0c/9de8590cd4f64dd7d6c93bea33abaa3f13a568556dc2c2eadb45f3a296ef/triz2sce-1.0.3.zip", "yanked": false}], "1.0.4": [{"comment_text": "", "digests": {"md5": "7882b681a2beb9bee2250624bb60d28a", "sha256": "357aa74b56cf25697f71cd55459ede0a3fb07ba08a9f2ce4d0b326c8e33ec656"}, "downloads": -1, "filename": "triz2sce-1.0.4.zip", "has_sig": false, "md5_digest": "7882b681a2beb9bee2250624bb60d28a", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 27095, "upload_time": "2018-09-15T17:04:10", "upload_time_iso_8601": "2018-09-15T17:04:10.992692Z", "url": "https://files.pythonhosted.org/packages/5e/00/695e38e8f27f2afd0e228761d6f9701441bfa017aef9541cd73c2b8ebd61/triz2sce-1.0.4.zip", "yanked": false}], "1.0.5": [{"comment_text": "", "digests": {"md5": "7fa24b81415b9a03fc1ae927f47ca900", "sha256": "3007272f8e73f3bebd3e6bf62ef7cfe4e24538aa07b9e071e4303bc40514077b"}, "downloads": -1, "filename": "triz2sce-1.0.5.zip", "has_sig": false, "md5_digest": "7fa24b81415b9a03fc1ae927f47ca900", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 27233, "upload_time": "2018-09-15T22:51:05", "upload_time_iso_8601": "2018-09-15T22:51:05.765607Z", "url": "https://files.pythonhosted.org/packages/e0/45/6e2f93a34e78a01ac0489cb3cea69ee340488712273300ad1662cadfd494/triz2sce-1.0.5.zip", "yanked": false}], "1.0.6": [{"comment_text": "", "digests": {"md5": "84b89782416a74b7bbc0c4705b2e59a8", "sha256": "cc1ef4a19acc26b53b66ae0120899661b04b2d872cdcb1c28c6364830c4d8cc7"}, "downloads": -1, "filename": "triz2sce-1.0.6.zip", "has_sig": false, "md5_digest": "84b89782416a74b7bbc0c4705b2e59a8", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 27506, "upload_time": "2018-12-04T23:37:00", "upload_time_iso_8601": "2018-12-04T23:37:00.151461Z", "url": "https://files.pythonhosted.org/packages/97/4b/27853379205a486f8ceaeaf73d33b629a02d91c11769fcf08ddf4a8b06e2/triz2sce-1.0.6.zip", "yanked": false}], "1.0.7": [{"comment_text": "", "digests": {"md5": "c294864d8a76101943e444a7b16987a0", "sha256": "ec08672e44cee3da35fea799bd5b987e1ffa801dc860cd056eebb2ab993457f3"}, "downloads": -1, "filename": "triz2sce-1.0.7.zip", "has_sig": false, "md5_digest": "c294864d8a76101943e444a7b16987a0", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 27811, "upload_time": "2018-12-08T17:35:04", "upload_time_iso_8601": "2018-12-08T17:35:04.289087Z", "url": "https://files.pythonhosted.org/packages/e7/30/8f55ebd0ff2ee5af2295320266be6c64cf6704e69530aee0511cfbfef896/triz2sce-1.0.7.zip", "yanked": false}], "1.0.8": [{"comment_text": "", "digests": {"md5": "bec9102a6fa536075f3d46eab5a85ee9", "sha256": "8ad5192f7214706a74217de08c97955505062793ffacf1c05d8b0e4a0319f11d"}, "downloads": -1, "filename": "triz2sce-1.0.8.zip", "has_sig": false, "md5_digest": "bec9102a6fa536075f3d46eab5a85ee9", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 31602, "upload_time": "2019-03-23T11:23:20", "upload_time_iso_8601": "2019-03-23T11:23:20.167747Z", "url": "https://files.pythonhosted.org/packages/01/15/489cb26cebf7904bb71d289c4c59dd17d6228f3dd5515ae2d5cb2794c553/triz2sce-1.0.8.zip", "yanked": false}], "1.0.8.post1": [{"comment_text": "", "digests": {"md5": "2a1556a24deadaec40a5e70a88ff700e", "sha256": "72f3e7a3b449acf0a03f4894a214878a0de4559d9a61b39c6a41891eb16dc167"}, "downloads": -1, "filename": "triz2sce-1.0.8.post1.zip", "has_sig": false, "md5_digest": "2a1556a24deadaec40a5e70a88ff700e", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 31952, "upload_time": "2019-03-23T12:37:10", "upload_time_iso_8601": "2019-03-23T12:37:10.334312Z", "url": "https://files.pythonhosted.org/packages/c9/c4/21d652bea2e257557fa562638c8f645edf2fc86b917d2d30ea1dd5e92d03/triz2sce-1.0.8.post1.zip", "yanked": false}], "1.0.8b0": [{"comment_text": "", "digests": {"md5": "39db30561c7dd8aca9442d7e094b43bd", "sha256": "30774bd5dac9973cd42af1ab4f7d633aad8522f3292af3c1a82fb69443bc1cde"}, "downloads": -1, "filename": "triz2sce-1.0.8b0.zip", "has_sig": false, "md5_digest": "39db30561c7dd8aca9442d7e094b43bd", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 29221, "upload_time": "2019-02-24T01:04:44", "upload_time_iso_8601": "2019-02-24T01:04:44.320968Z", "url": "https://files.pythonhosted.org/packages/9f/86/a40eed0420e6820be48c855aa5a17b275f7f1aa6b270fada2b16d8726de7/triz2sce-1.0.8b0.zip", "yanked": false}], "1.0.8b1": [{"comment_text": "", "digests": {"md5": "1ae11f921d1272d199ac562d7df3192b", "sha256": "c3a13d0252c90823dc7b9ff783d73d4660aed1895ff06dd81b3a7575d501d872"}, "downloads": -1, "filename": "triz2sce-1.0.8b1.zip", "has_sig": false, "md5_digest": "1ae11f921d1272d199ac562d7df3192b", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 29681, "upload_time": "2019-02-25T23:50:50", "upload_time_iso_8601": "2019-02-25T23:50:50.946466Z", "url": "https://files.pythonhosted.org/packages/aa/76/1098f882ab06005d00377be8aef3c8ae0202dfa2af0fe0ead5bc3708384f/triz2sce-1.0.8b1.zip", "yanked": false}], "1.0.8b2": [{"comment_text": "", "digests": {"md5": "432bdd0f58a7c62d317cecf42472ba06", "sha256": "da53fc6a2ac58ebb8eafec5ef449a42f9e021ea8acebc0e81a27a118b4c96f98"}, "downloads": -1, "filename": "triz2sce-1.0.8b2.zip", "has_sig": false, "md5_digest": "432bdd0f58a7c62d317cecf42472ba06", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 30204, "upload_time": "2019-03-12T19:41:52", "upload_time_iso_8601": "2019-03-12T19:41:52.057197Z", "url": "https://files.pythonhosted.org/packages/e8/13/c359cd6835caf20da7f8670e5ccec9797c9e7cc99e8bbee7dcd45915f47f/triz2sce-1.0.8b2.zip", "yanked": false}], "1.0.8b3": [{"comment_text": "", "digests": {"md5": "bedcc61fb4dbd613493da2e5ccfad71e", "sha256": "43852aa0da3c398bcc627769fc38378d5dcd06ece1542567b064104de8f56d30"}, "downloads": -1, "filename": "triz2sce-1.0.8b3.zip", "has_sig": false, "md5_digest": "bedcc61fb4dbd613493da2e5ccfad71e", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 30188, "upload_time": "2019-03-13T22:45:22", "upload_time_iso_8601": "2019-03-13T22:45:22.203857Z", "url": "https://files.pythonhosted.org/packages/fc/24/f3ca382834595daaf647d7109ba292fc5f8f2a72193a87be7fde4a8c88f0/triz2sce-1.0.8b3.zip", "yanked": false}], "1.0.8rc1": [{"comment_text": "", "digests": {"md5": "eee004c692884e1af76ae612d63175f8", "sha256": "661eed4448039057ec1e937b8a3911e72515fbdc61f9720f20a7ef5fa0bf4311"}, "downloads": -1, "filename": "triz2sce-1.0.8rc1.zip", "has_sig": false, "md5_digest": "eee004c692884e1af76ae612d63175f8", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 31060, "upload_time": "2019-03-16T17:10:20", "upload_time_iso_8601": "2019-03-16T17:10:20.140312Z", "url": "https://files.pythonhosted.org/packages/5f/89/4c2acb0024470e6b72cde51792dc633c58f6aab098df6b54a4a2f8a0d8e4/triz2sce-1.0.8rc1.zip", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "2a1556a24deadaec40a5e70a88ff700e", "sha256": "72f3e7a3b449acf0a03f4894a214878a0de4559d9a61b39c6a41891eb16dc167"}, "downloads": -1, "filename": "triz2sce-1.0.8.post1.zip", "has_sig": false, "md5_digest": "2a1556a24deadaec40a5e70a88ff700e", "packagetype": "sdist", "python_version": "source", "requires_python": ">=3.5", "size": 31952, "upload_time": "2019-03-23T12:37:10", "upload_time_iso_8601": "2019-03-23T12:37:10.334312Z", "url": "https://files.pythonhosted.org/packages/c9/c4/21d652bea2e257557fa562638c8f645edf2fc86b917d2d30ea1dd5e92d03/triz2sce-1.0.8.post1.zip", "yanked": false}], "timestamp": "Fri May  8 03:46:49 2020"}