{"info": {"author": "Yaco Sistemas and independent contributors", "author_email": "lgs@yaco.es", "bugtrack_url": null, "classifiers": ["Development Status :: 4 - Beta", "Environment :: Web Environment", "Framework :: Django", "Framework :: Django :: 1.10", "Framework :: Django :: 1.11", "Framework :: Django :: 1.8", "Framework :: Django :: 1.9", "Intended Audience :: Developers", "License :: OSI Approved :: Apache Software License", "Operating System :: OS Independent", "Programming Language :: Python", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Topic :: Internet :: WWW/HTTP", "Topic :: Internet :: WWW/HTTP :: WSGI", "Topic :: Security", "Topic :: Software Development :: Libraries :: Application Frameworks"], "description": "===========\ndjangosaml2\n===========\n\n.. image:: https://travis-ci.org/knaperek/djangosaml2.svg?branch=master\n    :target: https://travis-ci.org/knaperek/djangosaml2\n    :align: left\n\n\ndjangosaml2 is a Django application that integrates the PySAML2 library\ninto your project. This mean that you can protect your Django based project\nwith a service provider based on PySAML. This way it will talk SAML2 with\nyour Identity Provider allowing you to use this authentication mechanism.\nThis document will guide you through a few simple steps to accomplish\nsuch goal.\n\n.. contents::\n\nInstallation\n============\n\nPySAML2 uses xmlsec1_ binary to sign SAML assertions so you need to install\nit either through your operating system package or by compiling the source\ncode. It doesn't matter where the final executable is installed because\nyou will need to set the full path to it in the configuration stage.\n\n.. _xmlsec1: http://www.aleksey.com/xmlsec/\n\nNow you can install the djangosaml2 package using easy_install or pip. This\nwill also install PySAML2 and its dependencies automatically.\n\n\nConfiguration\n=============\n\nThere are three things you need to setup to make djangosaml2 work in your\nDjango project:\n\n1. **settings.py** as you may already know, it is the main Django\n   configuration file.\n2. **urls.py** is the file where you will include djangosaml2 urls.\n3. **pysaml2** specific files such as an attribute map directory and a\n   certificate.\n\n\nChanges in the settings.py file\n-------------------------------\nThe first thing you need to do is add ``djangosaml2`` to the list of\ninstalled apps::\n\n  INSTALLED_APPS = (\n      'django.contrib.auth',\n      'django.contrib.contenttypes',\n      'django.contrib.sessions',\n      'django.contrib.sites',\n      'django.contrib.messages',\n      'django.contrib.admin',\n      'djangosaml2',  # new application\n  )\n\nActually this is not really required since djangosaml2 does not include\nany data model. The only reason we include it is to be able to run\ndjangosaml2 test suite from our project, something you should always\ndo to make sure it is compatible with your Django version and environment.\n\n.. note::\n\n  When you finish the configuration you can run the djangosaml2 test suite as\n  you run any other Django application test suite. Just type ``python manage.py\n  test djangosaml2``.\n\n  Python 2 users need to ``pip install djangosaml2[test]`` in order to run the\n  tests.\n\nThen you have to add the ``djangosaml2.backends.Saml2Backend``\nauthentication backend to the list of authentications backends.\nBy default only the ModelBackend included in Django is configured.\nA typical configuration would look like this::\n\n  AUTHENTICATION_BACKENDS = (\n      'django.contrib.auth.backends.ModelBackend',\n      'djangosaml2.backends.Saml2Backend',\n  )\n\n.. note::\n\n  Before djangosaml2 0.5.0 this authentication backend was\n  automatically added by djangosaml2. This turned out to be\n  a bad idea since some applications want to use their own\n  custom policies for authorization and the authentication\n  backend is a good place to define that. Starting from\n  djangosaml2 0.5.0 it is now possible to define such\n  backends.\n\nFinally we have to tell Django what the new login url we want to use is::\n\n  LOGIN_URL = '/saml2/login/'\n  SESSION_EXPIRE_AT_BROWSER_CLOSE = True\n\nHere we are telling Django that any view that requires an authenticated\nuser should redirect the user browser to that url if the user has not\nbeen authenticated before. We are also telling that when the user closes\nhis browser, the session should be terminated. This is useful in SAML2\nfederations where the logout protocol is not always available.\n\n.. note::\n\n  The login url starts with ``/saml2/`` as an example but you can change that\n  if you want. Check the section about changes in the ``urls.py``\n  file for more information.\n\nIf you want to allow several authentication mechanisms in your project\nyou should set the LOGIN_URL option to another view and put a link in such\nview to the ``/saml2/login/`` view.\n\nPreferred Logout binding\n------------------------\nUse the following setting to choose your preferred binding for SP initiated logout requests::\n\n  SAML_LOGOUT_REQUEST_PREFERRED_BINDING\n\nFor example::\n\n  import saml2\n  SAML_LOGOUT_REQUEST_PREFERRED_BINDING = saml2.BINDING_HTTP_POST\n\nChanges in the urls.py file\n---------------------------\n\nThe next thing you need to do is to include ``djangosaml2.urls`` module in your\nmain ``urls.py`` module::\n\n  urlpatterns = patterns(\n      '',\n      #  lots of url definitions here\n\n      (r'^saml2/', include('djangosaml2.urls')),\n\n      #  more url definitions\n  )\n\nAs you can see we are including ``djangosaml2.urls`` under the *saml2*\nprefix. Feel free to use your own prefix but be consistent with what\nyou have put in the ``settings.py`` file in the LOGIN_URL parameter.\n\n\nPySAML2 specific files and configuration\n----------------------------------------\nOnce you have finished configuring your Django project you have to\nstart configuring PySAML. If you use just that library you have to\nput your configuration options in a file and initialize PySAML2 with\nthe path to that file.\n\nIn djangosaml2 you just put the same information in the Django\nsettings.py file under the SAML_CONFIG option.\n\nWe will see a typical configuration for protecting a Django project::\n\n  from os import path\n  import saml2\n  import saml2.saml\n  BASEDIR = path.dirname(path.abspath(__file__))\n  SAML_CONFIG = {\n    # full path to the xmlsec1 binary programm\n    'xmlsec_binary': '/usr/bin/xmlsec1',\n\n    # your entity id, usually your subdomain plus the url to the metadata view\n    'entityid': 'http://localhost:8000/saml2/metadata/',\n\n    # directory with attribute mapping\n    'attribute_map_dir': path.join(BASEDIR, 'attribute-maps'),\n\n    # this block states what services we provide\n    'service': {\n        # we are just a lonely SP\n        'sp' : {\n            'name': 'Federated Django sample SP',\n            'name_id_format': saml2.saml.NAMEID_FORMAT_PERSISTENT,\n            'endpoints': {\n                # url and binding to the assetion consumer service view\n                # do not change the binding or service name\n                'assertion_consumer_service': [\n                    ('http://localhost:8000/saml2/acs/',\n                     saml2.BINDING_HTTP_POST),\n                    ],\n                # url and binding to the single logout service view\n                # do not change the binding or service name\n                'single_logout_service': [\n                    ('http://localhost:8000/saml2/ls/',\n                     saml2.BINDING_HTTP_REDIRECT),\n                    ('http://localhost:8000/saml2/ls/post',\n                     saml2.BINDING_HTTP_POST),\n                    ],\n                },\n\n             # attributes that this project need to identify a user\n            'required_attributes': ['uid'],\n\n             # attributes that may be useful to have but not required\n            'optional_attributes': ['eduPersonAffiliation'],\n\n            # in this section the list of IdPs we talk to are defined\n            'idp': {\n                # we do not need a WAYF service since there is\n                # only an IdP defined here. This IdP should be\n                # present in our metadata\n\n                # the keys of this dictionary are entity ids\n                'https://localhost/simplesaml/saml2/idp/metadata.php': {\n                    'single_sign_on_service': {\n                        saml2.BINDING_HTTP_REDIRECT: 'https://localhost/simplesaml/saml2/idp/SSOService.php',\n                        },\n                    'single_logout_service': {\n                        saml2.BINDING_HTTP_REDIRECT: 'https://localhost/simplesaml/saml2/idp/SingleLogoutService.php',\n                        },\n                    },\n                },\n            },\n        },\n\n    # where the remote metadata is stored\n    'metadata': {\n        'local': [path.join(BASEDIR, 'remote_metadata.xml')],\n        },\n\n    # set to 1 to output debugging information\n    'debug': 1,\n\n    # Signing\n    'key_file': path.join(BASEDIR, 'mycert.key'),  # private part\n    'cert_file': path.join(BASEDIR, 'mycert.pem'),  # public part\n\n    # Encryption\n    'encryption_keypairs': [{\n        'key_file': path.join(BASEDIR, 'my_encryption_key.key'),  # private part\n        'cert_file': path.join(BASEDIR, 'my_encryption_cert.pem'),  # public part\n    }],\n\n    # own metadata settings\n    'contact_person': [\n        {'given_name': 'Lorenzo',\n         'sur_name': 'Gil',\n         'company': 'Yaco Sistemas',\n         'email_address': 'lgs@yaco.es',\n         'contact_type': 'technical'},\n        {'given_name': 'Angel',\n         'sur_name': 'Fernandez',\n         'company': 'Yaco Sistemas',\n         'email_address': 'angel@yaco.es',\n         'contact_type': 'administrative'},\n        ],\n    # you can set multilanguage information here\n    'organization': {\n        'name': [('Yaco Sistemas', 'es'), ('Yaco Systems', 'en')],\n        'display_name': [('Yaco', 'es'), ('Yaco', 'en')],\n        'url': [('http://www.yaco.es', 'es'), ('http://www.yaco.com', 'en')],\n        },\n    'valid_for': 24,  # how long is our metadata valid\n    }\n\n.. note::\n\n  Please check the `PySAML2 documentation`_ for more information about\n  these and other configuration options.\n\n.. _`PySAML2 documentation`: http://pysaml2.readthedocs.io/en/latest/\n\nThere are several external files and directories you have to create according\nto this configuration.\n\nThe xmlsec1 binary was mentioned in the installation section. Here, in the\nconfiguration part you just need to put the full path to xmlsec1 so PySAML2\ncan call it as it needs.\n\nThe ``attribute_map_dir`` points to a directory with attribute mappings that\nare used to translate user attribute names from several standards. It's usually\nsafe to just copy the default PySAML2 attribute maps that you can find in the\n``tests/attributemaps`` directory of the source distribution.\n\nThe ``metadata`` option is a dictionary where you can define several types of\nmetadata for remote entities. Usually the easiest type is the ``local`` where\nyou just put the name of a local XML file with the contents of the remote\nentities metadata. This XML file should be in the SAML2 metadata format.\n\nThe ``key_file`` and ``cert_file`` options reference the two parts of a\nstandard x509 certificate. You need it to sign your metadata. For assertion\nencryption/decryption support please configure another set of ``key_file`` and\n``cert_file``, but as inner attributes of ``encryption_keypairs`` option.\n\n.. note::\n\n  Check your openssl documentation to generate a test certificate but don't\n  forget to order a real one when you go into production.\n\n\nCustom and dynamic configuration loading\n........................................\n\nBy default, djangosaml2 reads the pysaml2 configuration options from the\nSAML_CONFIG setting but sometimes you want to read this information from\nanother place, like a file or a database. Sometimes you even want this\nconfiguration to be different depending on the request.\n\nStarting from djangosaml2 0.5.0 you can define your own configuration\nloader which is a callable that accepts a request parameter and returns\na saml2.config.SPConfig object. In order to do so you set the following\nsetting::\n\n  SAML_CONFIG_LOADER = 'python.path.to.your.callable'\n\n\nUser attributes\n---------------\n\nIn the SAML 2.0 authentication process the Identity Provider (IdP) will\nsend a security assertion to the Service Provider (SP) upon a successful\nauthentication. This assertion contains attributes about the user that\nwas authenticated. It depends on the IdP configuration what exact\nattributes are sent to each SP it can talk to.\n\nWhen such assertion is received on the Django side it is used to find a Django\nuser and create a session for it. By default djangosaml2 will do a query on the\nUser model with the USERNAME_FIELD_ attribute but you can change it to any\nother attribute of the User model. For example, you can do this lookup using\nthe 'email' attribute. In order to do so you should set the following setting::\n\n  SAML_DJANGO_USER_MAIN_ATTRIBUTE = 'email'\n\n.. _USERNAME_FIELD: https://docs.djangoproject.com/en/dev/topics/auth/customizing/#django.contrib.auth.models.CustomUser.USERNAME_FIELD\n\nPlease, use an unique attribute when setting this option. Otherwise\nthe authentication process may fail because djangosaml2 will not know\nwhich Django user it should pick.\n\nIf your main attribute is something inherently case-insensitive (such as\nan email address), you may set::\n\n  SAML_DJANGO_USER_MAIN_ATTRIBUTE_LOOKUP = '__iexact'\n\n(This is simply appended to the main attribute name to form a Django\nquery. Your main attribute must be unique even given this lookup.)\n\nAnother option is to use the SAML2 name id as the username by setting::\n\n  SAML_USE_NAME_ID_AS_USERNAME = True\n\nYou can configure djangosaml2 to create such user if it is not already in\nthe Django database or maybe you don't want to allow users that are not\nin your database already. For this purpose there is another option you\ncan set in the settings.py file::\n\n  SAML_CREATE_UNKNOWN_USER = True\n\nThis setting is True by default.\n\n  ACS_DEFAULT_REDIRECT_URL = reverse_lazy('some_url_name')\n\nThis setting lets you specify a URL for redirection after a successful\nauthentication. Particularly useful when you only plan to use\nIdP initiated login and the IdP does not have a configured RelayState\nparameter. The default is ``/``.\n\nThe other thing you will probably want to configure is the mapping of\nSAML2 user attributes to Django user attributes. By default only the\nUser.username attribute is mapped but you can add more attributes or\nchange that one. In order to do so you need to change the\nSAML_ATTRIBUTE_MAPPING option in your settings.py::\n\n  SAML_ATTRIBUTE_MAPPING = {\n      'uid': ('username', ),\n      'mail': ('email', ),\n      'cn': ('first_name', ),\n      'sn': ('last_name', ),\n  }\n\nwhere the keys of this dictionary are SAML user attributes and the values\nare Django User attributes.\n\nIf you are using Django user profile objects to store extra attributes\nabout your user you can add those attributes to the SAML_ATTRIBUTE_MAPPING\ndictionary. For each (key, value) pair, djangosaml2 will try to store the\nattribute in the User model if there is a matching field in that model.\nOtherwise it will try to do the same with your profile custom model. For\nmulti-valued attributes only the first value is assigned to the destination field.\n\nAlternatively, custom processing of attributes can be achieved by setting the\nvalue(s) in the SAML_ATTRIBUTE_MAPPING, to name(s) of method(s) defined on a\ncustom django User object. In this case, each method is called by djangosaml2,\npassing the full list of attribute values extracted from the <saml:AttributeValue>\nelements of the <saml:Attribute>. Among other uses, this is a useful way to process\nmulti-valued attributes such as lists of user group names.\n\nFor example:\n\nSaml assertion snippet::\n\n  <saml:Attribute Name=\"groups\" NameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\">\n        <saml:AttributeValue>group1</saml:AttributeValue>\n        <saml:AttributeValue>group2</saml:AttributeValue>\n        <saml:AttributeValue>group3</saml:AttributeValue>\n  </saml:Attribute>\n\nCustom User object::\n\n  from django.contrib.auth.models import AbstractUser\n\n  class User(AbstractUser):\n\n    def process_groups(self, groups):\n      // process list of group names in argument 'groups'\n      pass;\n\nsettings.py::\n\n  SAML_ATTRIBUTE_MAPPING = {\n      'groups': ('process_groups', ),\n  }\n\n\nLearn more about Django profile models at:\n\nhttps://docs.djangoproject.com/en/dev/topics/auth/customizing/#substituting-a-custom-user-model\n\n\nSometimes you need to use special logic to update the user object\ndepending on the SAML2 attributes and the mapping described above\nis simply not enough. For these cases djangosaml2 provides a Django\nsignal that you can listen to. In order to do so you can add the\nfollowing code to your app::\n\n  from djangosaml2.signals import pre_user_save\n\n  def custom_update_user(sender=User, instance, attributes, user_modified, **kargs)\n     ...\n     return True  # I modified the user object\n\n\nYour handler will receive the user object, the list of SAML attributes\nand a flag telling you if the user is already modified and need\nto be saved after your handler is executed. If your handler\nmodifies the user object it should return True. Otherwise it should\nreturn False. This way djangosaml2 will know if it should save\nthe user object so you don't need to do it and no more calls to\nthe save method are issued.\n\n\nIdP setup\n=========\nCongratulations, you have finished configuring the SP side of the federation.\nNow you need to send the entity id and the metadata of this new SP to the\nIdP administrators so they can add it to their list of trusted services.\n\nYou can get this information starting your Django development server and\ngoing to the http://localhost:8000/saml2/metadata url. If you have included\nthe djangosaml2 urls under a different url prefix you need to correct this\nurl.\n\nSimpleSAMLphp issues\n--------------------\nAs of SimpleSAMLphp 1.8.2 there is a problem if you specify attributes in\nthe SP configuration. When the SimpleSAMLphp metadata parser converts the\nXML into its custom php format it puts the following option::\n\n  'attributes.NameFormat' => 'urn:oasis:names:tc:SAML:2.0:attrname-format:uri'\n\nBut it need to be replaced by this one::\n\n  'AttributeNameFormat' => 'urn:oasis:names:tc:SAML:2.0:attrname-format:uri'\n\nOtherwise the Assertions sent from the IdP to the SP will have a wrong\nAttribute Name Format and pysaml2 will be confused.\n\nFurthermore if you have a AttributeLimit filter in your SimpleSAMLphp\nconfiguration  you will need to enable another attribute filter just\nbefore to make sure that the AttributeLimit does not remove the attributes\nfrom the authentication source. The filter you need to add is an AttributeMap\nfilter like this::\n\n  10 => array(\n             'class' => 'core:AttributeMap', 'name2oid'\n        ),\n\nTesting\n=======\n\nOne way to check if everything is working as expected is to enable the\nfollowing url::\n\n  urlpatterns = patterns(\n      '',\n      #  lots of url definitions here\n\n      (r'^saml2/', include('djangosaml2.urls')),\n      (r'^test/', 'djangosaml2.views.echo_attributes'),\n\n      #  more url definitions\n  )\n\n\nNow if you go to the /test/ url you will see your SAML attributes and also\na link to do a global logout.\n\nYou can also run the unit tests with the following command::\n\n  python tests/run_tests.py\n\nIf you have `tox`_ installed you can simply call tox inside the root directory\nand it will run the tests in multiple versions of Python.\n\n.. _`tox`: http://pypi.python.org/pypi/tox\n\nFAQ\n===\n\n**Why can't SAML be implemented as an Django Authentication Backend?**\n\nwell SAML authentication is not that simple as a set of credentials you can\nput on a login form and get a response back. Actually the user password is\nnot given to the service provider at all. This is by design. You have to\ndelegate the task of authentication to the IdP and then get an asynchronous\nresponse from it.\n\nGiven said that, djangosaml2 does use a Django Authentication Backend to\ntransform the SAML assertion about the user into a Django user object.\n\n**Why not put everything in a Django middleware class and make our lifes\neasier?**\n\nYes, that was an option I did evaluate but at the end the current design\nwon. In my opinion putting this logic into a middleware has the advantage\nof making it easier to configure but has a couple of disadvantages: first,\nthe middleware would need to check if the request path is one of the\nSAML endpoints for every request. Second, it would be too magical and in\ncase of a problem, much harder to debug.\n\n**Why not call this package django-saml as many other Django applications?**\n\nFollowing that pattern then I should import the application with\nimport saml but unfortunately that module name is already used in pysaml2.\n\n\nChanges\n=======\n\n0.17.1 (2018-07-16)\n----------\n- A 403 (permission denied) is now raised if a SAMLResponse is replayed, instead of 500.\n- Dropped support for Python 3.3\n- Upgraded pysaml2 dependency to version 4.5.0\n\nThanks to francoisfreitag, mhindery, vkurup, peppelinux\n\n0.16.11 (2017-12-25)\n----------\n- Dropped compatibility for Python < 2.7 and Django < 1.8.\n- Added a clean_attributes hook allowing backends to restructure attributes extracted from SAML response.\n- Log when fields are missing in a SAML response.\n- Log when attribute_mapping maps to nonexistent User fields.\n- Multiple compatibility fixes and other minor improvements and code cleanups\n\nThanks to francoisfreitag, mhindery, charn, jdufresne\n\n0.16.10 (2017-10-02)\n-------------------\n- Bugfixes and internal refactorings.\n- Added support for custom USERNAME_FIELD on custom User models. Many thanks to francoisfreitag.\n\n0.16.9 (2017-09-19)\n-------------------\n- Bugfixes and minor improvements. Thanks to goetzk and AmbientLighter.\n- Added option SAML_LOGOUT_REQUEST_PREFERRED_BINDING\n- Added Django 1.11 to tox.\n\n0.16.4 (2017-09-11)\n-------------------\n- Added support for SHA-256 signing. Thanks to WebSpider.\n- Bugfixes. Thanks to justinsg and charn.\n- Error handling made more extensible. This will be further improved in next versions.\n\n0.16.1 (2017-07-15)\n-------------------\n- Bugfixes. Thanks to canni, AmbientLighter, cranti and logston.\n- request is now passed to authentication backend (introduced in Django 1.11). Thanks to terite.\n\n0.16.0 (2017-04-14)\n-------------------\n- Upgrade pysaml2 dependency to version 4.4.0 which fixes some serialization issues. Thanks to nakato for the report.\n- Added support for HTTP Redirect binding with signed authentication requests. Many thanks to liquidpele for this feature and other related refactorings.\n- The custom permission_denied.html template was removed in favor of standard PermissionDenied exception. Thanks to mhindery.\n\n0.15.0 (2016-12-18)\n-------------------\n- Python 3.5 support. Thanks to timheap.\n- Added support for callable user attributes. Thanks to andy-miracl and joetsoi.\n- Security improvement: \"next\" URL is now checked. thanks to flupzor.\n- Improved testability. Thanks to flupzor.\n- Other bugfixes and minor improvements. Thanks to jamaalscarlett, ws0w, jaywink and liquidpele.\n\n0.14.5 (2016-09-19)\n-------------------\n- Django 1.10 support. Thanks to inducer.\n- Various fixes and minor improvements. Thanks to ajsmilutin, ganiserb, inducer, grunichev, liquidpele and darbula\n\n0.14.4 (2016-03-29)\n-------------------\n- Fix compatibility issue with pysaml2-4.0.3+. Thanks to jimr and astoltz.\n- Fix Django 1.9 compatibility issue in templates. Thanks to nikoskal.\n\n0.14.3 (2016-03-18)\n-------------------\n- Upgraded to pysaml2-4.0.5.\n- Added 'ACS_DEFAULT_REDIRECT_URL' setting for default redirection after successful authentication. Thanks to ganiserb.\n\n0.14.2 (2016-03-11)\n-------------------\n- Released under the original 'djangosaml2' package name; abandoning the djangosaml2-knaperek fork.\n\n0.14.1 (2016-03-09)\n-------------------\n- Upgraded to pysaml2-4.0.4.\n\n0.14.0 (2016-01-28)\n-------------------\n- Upgrade to pysaml2-4.0.2. Thanks to kviktor\n- Django 1.9 support. Thanks to Jordi Gutiérrez Hermoso\n\n0.13.2 (2015-06-24)\n-------------------\n- Improved usage of standard Python logging.\n\n0.13.1 (2015-06-05)\n-------------------\n- Added support for djangosaml2 specific user model defined by SAML_USER_MODEL setting\n\n0.13.0 (2015-02-12)\n-------------------\n- Django 1.7 support. Thanks to Kamei Toshimitsu\n\n0.12.0 (2014-11-18)\n-------------------\n- Pysaml2 2.2.0 support. Thanks to Erick Tryzelaar\n\n0.11.0 (2014-06-15)\n-------------------\n- Django 1.5 custom user model support. Thanks to Jos van Velzen\n- Django 1.5 compatibility url template tag. Thanks to bula\n- Support Django 1.5 and 1.6. Thanks to David Evans and Justin Quick\n\n0.10.0 (2013-05-05)\n-------------------\n- Check that RelayState is not empty before redirecting into a loop. Thanks\n  to Sam Bull for reporting this issue.\n- In the global logout process, when the session is lost, report an error\n  message to the user and perform a local logout.\n\n0.9.2 (2013-04-19)\n------------------\n- Upgrade to pysaml2-0.4.3.\n\n0.9.1 (2013-01-29)\n------------------\n- Add a method to the authentication backend so it is possible\n  to customize the authorization based on SAML attributes.\n\n0.9.0 (2012-10-30)\n------------------\n- Add a signal for modifying the user just before saving it on\n  the update_user method of the authentication backend.\n\n0.8.1 (2012-10-29)\n------------------\n- Trim the SAML attributes before setting them to the Django objects\n  if they are too long. This fixes a crash with MySQL.\n\n0.8.0 (2012-10-25)\n------------------\n- Allow to use different attributes besides 'username' to look for\n  existing users.\n\n0.7.0 (2012-10-19)\n------------------\n- Add a setting to decide if the user should be redirected to the\n  next view or shown an authorization error when the user tries to\n  login twice.\n\n0.6.1 (2012-09-03)\n------------------\n- Remove Django from our dependencies\n- Restore support for Django 1.3\n\n0.6.0 (2012-08-29)\n------------------\n- Add tox support configured to run the tests with Python 2.6 and 2.7\n- Fix some dependencies and sdist generation. Lorenzo Gil\n- Allow defining a logout redirect url in the settings. Lorenzo Gil\n- Add some logging calls to improve debugging. Lorenzo Gil\n- Add support for custom conf loading function. Sam Bull.\n- Make the tests more robust and easier to run when djangosaml2 is\n  included in a Django project. Sam Bull.\n- Make sure the profile is not None before saving it. Bug reported by\n  Leif Johansson\n\n0.5.0 (2012-05-22)\n------------------\n- Allow defining custom config loaders. They can be dynamic depending on\n  the request.\n- Do not automatically add the authentication backend. This way\n  we allow other people to add their own backends.\n- Support for additional attributes other than the ones that get mapped\n  into the User model. Those attributes get stored in the UserProfile model.\n\n0.4.2 (2012-03-23)\n------------------\n- Fix a crash in the idplist templatetag about using an old pysaml2 function\n- Added a test for the previous crash\n\n0.4.1 (2012-03-19)\n------------------\n- Upgrade pysaml2 dependency to version 0.4.1\n\n0.4.0 (2012-03-18)\n------------------\n- Upgrade pysaml2 dependency to version 0.4.0 (update our tests as a result\n  of this)\n- Add logging calls to make debugging easier\n- Use the Django configured logger in pysaml2\n\n0.3.3 (2012-02-14)\n------------------\n- Freeze the version of pysaml2 since we are not (yet!) compatible with\n  version 0.4.0\n\n0.3.2 (2011-12-13)\n------------------\n- Avoid a crash when reading the SAML attribute that maps to the Django\n  username\n\n0.3.1 (2011-12-01)\n------------------\n- Load the config in the render method of the idplist templatetag to\n  make it more flexible and reentrant.\n\n0.3.0 (2011-11-30)\n------------------\n- Templatetag to get the list of available idps.\n- Allow to map the same SAML attribute into several Django field.\n\n0.2.4 (2011-11-29)\n------------------\n- Fix restructured text bugs that made pypi page looks bad.\n\n0.2.3 (2011-06-14)\n------------------\n- Set a unusable password when the user is created for the first time\n\n0.2.2 (2011-06-07)\n------------------\n- Prevent infinite loop when going to the /saml2/login/ endpoint and the user\n  is already logged in and the settings.LOGIN_REDIRECT_URL is (badly) pointing\n  to /saml2/login.\n\n0.2.1 (2011-05-09)\n------------------\n- If no next parameter is supplied to the login view, use the\n  settings.LOGIN_REDIRECT_URL as default\n\n0.2.0 (2011-04-26)\n------------------\n- Python 2.4 compatible if the elementtree library is installed\n- Allow post processing after the authentication phase by using\n  Django signals.\n\n0.1.1 (2011-04-18)\n------------------\n- Simple view to echo SAML attributes\n- Improve documentation\n- Change default behaviour when a new user is created. Now their attributes\n  are filled this first time\n- Allow to set a next page after the logout\n\n0.1.0 (2011-03-16)\n------------------\n- Emancipation from the pysaml package", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/unicef/djangosaml2", "keywords": "django,pysaml2,sso,saml2,federated authentication,authentication", "license": "Apache 2.0", "maintainer": "Jozef Knaperek", "maintainer_email": "", "name": "unicef-djangosaml2", "package_url": "https://pypi.org/project/unicef-djangosaml2/", "platform": "", "project_url": "https://pypi.org/project/unicef-djangosaml2/", "project_urls": {"Homepage": "https://github.com/unicef/djangosaml2"}, "release_url": "https://pypi.org/project/unicef-djangosaml2/0.17.2/", "requires_dist": null, "requires_python": "", "summary": "pysaml2 integration for Django", "version": "0.17.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            ===========<br>djangosaml2<br>===========<br><br>.. image:: https://travis-ci.org/knaperek/djangosaml2.svg?branch=master<br>    :target: https://travis-ci.org/knaperek/djangosaml2<br>    :align: left<br><br><br>djangosaml2 is a Django application that integrates the PySAML2 library<br>into your project. This mean that you can protect your Django based project<br>with a service provider based on PySAML. This way it will talk SAML2 with<br>your Identity Provider allowing you to use this authentication mechanism.<br>This document will guide you through a few simple steps to accomplish<br>such goal.<br><br>.. contents::<br><br>Installation<br>============<br><br>PySAML2 uses xmlsec1_ binary to sign SAML assertions so you need to install<br>it either through your operating system package or by compiling the source<br>code. It doesn't matter where the final executable is installed because<br>you will need to set the full path to it in the configuration stage.<br><br>.. _xmlsec1: http://www.aleksey.com/xmlsec/<br><br>Now you can install the djangosaml2 package using easy_install or pip. This<br>will also install PySAML2 and its dependencies automatically.<br><br><br>Configuration<br>=============<br><br>There are three things you need to setup to make djangosaml2 work in your<br>Django project:<br><br>1. **settings.py** as you may already know, it is the main Django<br>   configuration file.<br>2. **urls.py** is the file where you will include djangosaml2 urls.<br>3. **pysaml2** specific files such as an attribute map directory and a<br>   certificate.<br><br><br>Changes in the settings.py file<br>-------------------------------<br>The first thing you need to do is add ``djangosaml2`` to the list of<br>installed apps::<br><br>  INSTALLED_APPS = (<br>      'django.contrib.auth',<br>      'django.contrib.contenttypes',<br>      'django.contrib.sessions',<br>      'django.contrib.sites',<br>      'django.contrib.messages',<br>      'django.contrib.admin',<br>      'djangosaml2',  # new application<br>  )<br><br>Actually this is not really required since djangosaml2 does not include<br>any data model. The only reason we include it is to be able to run<br>djangosaml2 test suite from our project, something you should always<br>do to make sure it is compatible with your Django version and environment.<br><br>.. note::<br><br>  When you finish the configuration you can run the djangosaml2 test suite as<br>  you run any other Django application test suite. Just type ``python manage.py<br>  test djangosaml2``.<br><br>  Python 2 users need to ``pip install djangosaml2[test]`` in order to run the<br>  tests.<br><br>Then you have to add the ``djangosaml2.backends.Saml2Backend``<br>authentication backend to the list of authentications backends.<br>By default only the ModelBackend included in Django is configured.<br>A typical configuration would look like this::<br><br>  AUTHENTICATION_BACKENDS = (<br>      'django.contrib.auth.backends.ModelBackend',<br>      'djangosaml2.backends.Saml2Backend',<br>  )<br><br>.. note::<br><br>  Before djangosaml2 0.5.0 this authentication backend was<br>  automatically added by djangosaml2. This turned out to be<br>  a bad idea since some applications want to use their own<br>  custom policies for authorization and the authentication<br>  backend is a good place to define that. Starting from<br>  djangosaml2 0.5.0 it is now possible to define such<br>  backends.<br><br>Finally we have to tell Django what the new login url we want to use is::<br><br>  LOGIN_URL = '/saml2/login/'<br>  SESSION_EXPIRE_AT_BROWSER_CLOSE = True<br><br>Here we are telling Django that any view that requires an authenticated<br>user should redirect the user browser to that url if the user has not<br>been authenticated before. We are also telling that when the user closes<br>his browser, the session should be terminated. This is useful in SAML2<br>federations where the logout protocol is not always available.<br><br>.. note::<br><br>  The login url starts with ``/saml2/`` as an example but you can change that<br>  if you want. Check the section about changes in the ``urls.py``<br>  file for more information.<br><br>If you want to allow several authentication mechanisms in your project<br>you should set the LOGIN_URL option to another view and put a link in such<br>view to the ``/saml2/login/`` view.<br><br>Preferred Logout binding<br>------------------------<br>Use the following setting to choose your preferred binding for SP initiated logout requests::<br><br>  SAML_LOGOUT_REQUEST_PREFERRED_BINDING<br><br>For example::<br><br>  import saml2<br>  SAML_LOGOUT_REQUEST_PREFERRED_BINDING = saml2.BINDING_HTTP_POST<br><br>Changes in the urls.py file<br>---------------------------<br><br>The next thing you need to do is to include ``djangosaml2.urls`` module in your<br>main ``urls.py`` module::<br><br>  urlpatterns = patterns(<br>      '',<br>      #  lots of url definitions here<br><br>      (r'^saml2/', include('djangosaml2.urls')),<br><br>      #  more url definitions<br>  )<br><br>As you can see we are including ``djangosaml2.urls`` under the *saml2*<br>prefix. Feel free to use your own prefix but be consistent with what<br>you have put in the ``settings.py`` file in the LOGIN_URL parameter.<br><br><br>PySAML2 specific files and configuration<br>----------------------------------------<br>Once you have finished configuring your Django project you have to<br>start configuring PySAML. If you use just that library you have to<br>put your configuration options in a file and initialize PySAML2 with<br>the path to that file.<br><br>In djangosaml2 you just put the same information in the Django<br>settings.py file under the SAML_CONFIG option.<br><br>We will see a typical configuration for protecting a Django project::<br><br>  from os import path<br>  import saml2<br>  import saml2.saml<br>  BASEDIR = path.dirname(path.abspath(__file__))<br>  SAML_CONFIG = {<br>    # full path to the xmlsec1 binary programm<br>    'xmlsec_binary': '/usr/bin/xmlsec1',<br><br>    # your entity id, usually your subdomain plus the url to the metadata view<br>    'entityid': 'http://localhost:8000/saml2/metadata/',<br><br>    # directory with attribute mapping<br>    'attribute_map_dir': path.join(BASEDIR, 'attribute-maps'),<br><br>    # this block states what services we provide<br>    'service': {<br>        # we are just a lonely SP<br>        'sp' : {<br>            'name': 'Federated Django sample SP',<br>            'name_id_format': saml2.saml.NAMEID_FORMAT_PERSISTENT,<br>            'endpoints': {<br>                # url and binding to the assetion consumer service view<br>                # do not change the binding or service name<br>                'assertion_consumer_service': [<br>                    ('http://localhost:8000/saml2/acs/',<br>                     saml2.BINDING_HTTP_POST),<br>                    ],<br>                # url and binding to the single logout service view<br>                # do not change the binding or service name<br>                'single_logout_service': [<br>                    ('http://localhost:8000/saml2/ls/',<br>                     saml2.BINDING_HTTP_REDIRECT),<br>                    ('http://localhost:8000/saml2/ls/post',<br>                     saml2.BINDING_HTTP_POST),<br>                    ],<br>                },<br><br>             # attributes that this project need to identify a user<br>            'required_attributes': ['uid'],<br><br>             # attributes that may be useful to have but not required<br>            'optional_attributes': ['eduPersonAffiliation'],<br><br>            # in this section the list of IdPs we talk to are defined<br>            'idp': {<br>                # we do not need a WAYF service since there is<br>                # only an IdP defined here. This IdP should be<br>                # present in our metadata<br><br>                # the keys of this dictionary are entity ids<br>                'https://localhost/simplesaml/saml2/idp/metadata.php': {<br>                    'single_sign_on_service': {<br>                        saml2.BINDING_HTTP_REDIRECT: 'https://localhost/simplesaml/saml2/idp/SSOService.php',<br>                        },<br>                    'single_logout_service': {<br>                        saml2.BINDING_HTTP_REDIRECT: 'https://localhost/simplesaml/saml2/idp/SingleLogoutService.php',<br>                        },<br>                    },<br>                },<br>            },<br>        },<br><br>    # where the remote metadata is stored<br>    'metadata': {<br>        'local': [path.join(BASEDIR, 'remote_metadata.xml')],<br>        },<br><br>    # set to 1 to output debugging information<br>    'debug': 1,<br><br>    # Signing<br>    'key_file': path.join(BASEDIR, 'mycert.key'),  # private part<br>    'cert_file': path.join(BASEDIR, 'mycert.pem'),  # public part<br><br>    # Encryption<br>    'encryption_keypairs': [{<br>        'key_file': path.join(BASEDIR, 'my_encryption_key.key'),  # private part<br>        'cert_file': path.join(BASEDIR, 'my_encryption_cert.pem'),  # public part<br>    }],<br><br>    # own metadata settings<br>    'contact_person': [<br>        {'given_name': 'Lorenzo',<br>         'sur_name': 'Gil',<br>         'company': 'Yaco Sistemas',<br>         'email_address': 'lgs@yaco.es',<br>         'contact_type': 'technical'},<br>        {'given_name': 'Angel',<br>         'sur_name': 'Fernandez',<br>         'company': 'Yaco Sistemas',<br>         'email_address': 'angel@yaco.es',<br>         'contact_type': 'administrative'},<br>        ],<br>    # you can set multilanguage information here<br>    'organization': {<br>        'name': [('Yaco Sistemas', 'es'), ('Yaco Systems', 'en')],<br>        'display_name': [('Yaco', 'es'), ('Yaco', 'en')],<br>        'url': [('http://www.yaco.es', 'es'), ('http://www.yaco.com', 'en')],<br>        },<br>    'valid_for': 24,  # how long is our metadata valid<br>    }<br><br>.. note::<br><br>  Please check the `PySAML2 documentation`_ for more information about<br>  these and other configuration options.<br><br>.. _`PySAML2 documentation`: http://pysaml2.readthedocs.io/en/latest/<br><br>There are several external files and directories you have to create according<br>to this configuration.<br><br>The xmlsec1 binary was mentioned in the installation section. Here, in the<br>configuration part you just need to put the full path to xmlsec1 so PySAML2<br>can call it as it needs.<br><br>The ``attribute_map_dir`` points to a directory with attribute mappings that<br>are used to translate user attribute names from several standards. It's usually<br>safe to just copy the default PySAML2 attribute maps that you can find in the<br>``tests/attributemaps`` directory of the source distribution.<br><br>The ``metadata`` option is a dictionary where you can define several types of<br>metadata for remote entities. Usually the easiest type is the ``local`` where<br>you just put the name of a local XML file with the contents of the remote<br>entities metadata. This XML file should be in the SAML2 metadata format.<br><br>The ``key_file`` and ``cert_file`` options reference the two parts of a<br>standard x509 certificate. You need it to sign your metadata. For assertion<br>encryption/decryption support please configure another set of ``key_file`` and<br>``cert_file``, but as inner attributes of ``encryption_keypairs`` option.<br><br>.. note::<br><br>  Check your openssl documentation to generate a test certificate but don't<br>  forget to order a real one when you go into production.<br><br><br>Custom and dynamic configuration loading<br>........................................<br><br>By default, djangosaml2 reads the pysaml2 configuration options from the<br>SAML_CONFIG setting but sometimes you want to read this information from<br>another place, like a file or a database. Sometimes you even want this<br>configuration to be different depending on the request.<br><br>Starting from djangosaml2 0.5.0 you can define your own configuration<br>loader which is a callable that accepts a request parameter and returns<br>a saml2.config.SPConfig object. In order to do so you set the following<br>setting::<br><br>  SAML_CONFIG_LOADER = 'python.path.to.your.callable'<br><br><br>User attributes<br>---------------<br><br>In the SAML 2.0 authentication process the Identity Provider (IdP) will<br>send a security assertion to the Service Provider (SP) upon a successful<br>authentication. This assertion contains attributes about the user that<br>was authenticated. It depends on the IdP configuration what exact<br>attributes are sent to each SP it can talk to.<br><br>When such assertion is received on the Django side it is used to find a Django<br>user and create a session for it. By default djangosaml2 will do a query on the<br>User model with the USERNAME_FIELD_ attribute but you can change it to any<br>other attribute of the User model. For example, you can do this lookup using<br>the 'email' attribute. In order to do so you should set the following setting::<br><br>  SAML_DJANGO_USER_MAIN_ATTRIBUTE = 'email'<br><br>.. _USERNAME_FIELD: https://docs.djangoproject.com/en/dev/topics/auth/customizing/#django.contrib.auth.models.CustomUser.USERNAME_FIELD<br><br>Please, use an unique attribute when setting this option. Otherwise<br>the authentication process may fail because djangosaml2 will not know<br>which Django user it should pick.<br><br>If your main attribute is something inherently case-insensitive (such as<br>an email address), you may set::<br><br>  SAML_DJANGO_USER_MAIN_ATTRIBUTE_LOOKUP = '__iexact'<br><br>(This is simply appended to the main attribute name to form a Django<br>query. Your main attribute must be unique even given this lookup.)<br><br>Another option is to use the SAML2 name id as the username by setting::<br><br>  SAML_USE_NAME_ID_AS_USERNAME = True<br><br>You can configure djangosaml2 to create such user if it is not already in<br>the Django database or maybe you don't want to allow users that are not<br>in your database already. For this purpose there is another option you<br>can set in the settings.py file::<br><br>  SAML_CREATE_UNKNOWN_USER = True<br><br>This setting is True by default.<br><br>  ACS_DEFAULT_REDIRECT_URL = reverse_lazy('some_url_name')<br><br>This setting lets you specify a URL for redirection after a successful<br>authentication. Particularly useful when you only plan to use<br>IdP initiated login and the IdP does not have a configured RelayState<br>parameter. The default is ``/``.<br><br>The other thing you will probably want to configure is the mapping of<br>SAML2 user attributes to Django user attributes. By default only the<br>User.username attribute is mapped but you can add more attributes or<br>change that one. In order to do so you need to change the<br>SAML_ATTRIBUTE_MAPPING option in your settings.py::<br><br>  SAML_ATTRIBUTE_MAPPING = {<br>      'uid': ('username', ),<br>      'mail': ('email', ),<br>      'cn': ('first_name', ),<br>      'sn': ('last_name', ),<br>  }<br><br>where the keys of this dictionary are SAML user attributes and the values<br>are Django User attributes.<br><br>If you are using Django user profile objects to store extra attributes<br>about your user you can add those attributes to the SAML_ATTRIBUTE_MAPPING<br>dictionary. For each (key, value) pair, djangosaml2 will try to store the<br>attribute in the User model if there is a matching field in that model.<br>Otherwise it will try to do the same with your profile custom model. For<br>multi-valued attributes only the first value is assigned to the destination field.<br><br>Alternatively, custom processing of attributes can be achieved by setting the<br>value(s) in the SAML_ATTRIBUTE_MAPPING, to name(s) of method(s) defined on a<br>custom django User object. In this case, each method is called by djangosaml2,<br>passing the full list of attribute values extracted from the &lt;saml:AttributeValue&gt;<br>elements of the &lt;saml:Attribute&gt;. Among other uses, this is a useful way to process<br>multi-valued attributes such as lists of user group names.<br><br>For example:<br><br>Saml assertion snippet::<br><br>  &lt;saml:Attribute Name=\"groups\" NameFormat=\"urn:oasis:names:tc:SAML:2.0:attrname-format:basic\"&gt;<br>        &lt;saml:AttributeValue&gt;group1&lt;/saml:AttributeValue&gt;<br>        &lt;saml:AttributeValue&gt;group2&lt;/saml:AttributeValue&gt;<br>        &lt;saml:AttributeValue&gt;group3&lt;/saml:AttributeValue&gt;<br>  &lt;/saml:Attribute&gt;<br><br>Custom User object::<br><br>  from django.contrib.auth.models import AbstractUser<br><br>  class User(AbstractUser):<br><br>    def process_groups(self, groups):<br>      // process list of group names in argument 'groups'<br>      pass;<br><br>settings.py::<br><br>  SAML_ATTRIBUTE_MAPPING = {<br>      'groups': ('process_groups', ),<br>  }<br><br><br>Learn more about Django profile models at:<br><br>https://docs.djangoproject.com/en/dev/topics/auth/customizing/#substituting-a-custom-user-model<br><br><br>Sometimes you need to use special logic to update the user object<br>depending on the SAML2 attributes and the mapping described above<br>is simply not enough. For these cases djangosaml2 provides a Django<br>signal that you can listen to. In order to do so you can add the<br>following code to your app::<br><br>  from djangosaml2.signals import pre_user_save<br><br>  def custom_update_user(sender=User, instance, attributes, user_modified, **kargs)<br>     ...<br>     return True  # I modified the user object<br><br><br>Your handler will receive the user object, the list of SAML attributes<br>and a flag telling you if the user is already modified and need<br>to be saved after your handler is executed. If your handler<br>modifies the user object it should return True. Otherwise it should<br>return False. This way djangosaml2 will know if it should save<br>the user object so you don't need to do it and no more calls to<br>the save method are issued.<br><br><br>IdP setup<br>=========<br>Congratulations, you have finished configuring the SP side of the federation.<br>Now you need to send the entity id and the metadata of this new SP to the<br>IdP administrators so they can add it to their list of trusted services.<br><br>You can get this information starting your Django development server and<br>going to the http://localhost:8000/saml2/metadata url. If you have included<br>the djangosaml2 urls under a different url prefix you need to correct this<br>url.<br><br>SimpleSAMLphp issues<br>--------------------<br>As of SimpleSAMLphp 1.8.2 there is a problem if you specify attributes in<br>the SP configuration. When the SimpleSAMLphp metadata parser converts the<br>XML into its custom php format it puts the following option::<br><br>  'attributes.NameFormat' =&gt; 'urn:oasis:names:tc:SAML:2.0:attrname-format:uri'<br><br>But it need to be replaced by this one::<br><br>  'AttributeNameFormat' =&gt; 'urn:oasis:names:tc:SAML:2.0:attrname-format:uri'<br><br>Otherwise the Assertions sent from the IdP to the SP will have a wrong<br>Attribute Name Format and pysaml2 will be confused.<br><br>Furthermore if you have a AttributeLimit filter in your SimpleSAMLphp<br>configuration  you will need to enable another attribute filter just<br>before to make sure that the AttributeLimit does not remove the attributes<br>from the authentication source. The filter you need to add is an AttributeMap<br>filter like this::<br><br>  10 =&gt; array(<br>             'class' =&gt; 'core:AttributeMap', 'name2oid'<br>        ),<br><br>Testing<br>=======<br><br>One way to check if everything is working as expected is to enable the<br>following url::<br><br>  urlpatterns = patterns(<br>      '',<br>      #  lots of url definitions here<br><br>      (r'^saml2/', include('djangosaml2.urls')),<br>      (r'^test/', 'djangosaml2.views.echo_attributes'),<br><br>      #  more url definitions<br>  )<br><br><br>Now if you go to the /test/ url you will see your SAML attributes and also<br>a link to do a global logout.<br><br>You can also run the unit tests with the following command::<br><br>  python tests/run_tests.py<br><br>If you have `tox`_ installed you can simply call tox inside the root directory<br>and it will run the tests in multiple versions of Python.<br><br>.. _`tox`: http://pypi.python.org/pypi/tox<br><br>FAQ<br>===<br><br>**Why can't SAML be implemented as an Django Authentication Backend?**<br><br>well SAML authentication is not that simple as a set of credentials you can<br>put on a login form and get a response back. Actually the user password is<br>not given to the service provider at all. This is by design. You have to<br>delegate the task of authentication to the IdP and then get an asynchronous<br>response from it.<br><br>Given said that, djangosaml2 does use a Django Authentication Backend to<br>transform the SAML assertion about the user into a Django user object.<br><br>**Why not put everything in a Django middleware class and make our lifes<br>easier?**<br><br>Yes, that was an option I did evaluate but at the end the current design<br>won. In my opinion putting this logic into a middleware has the advantage<br>of making it easier to configure but has a couple of disadvantages: first,<br>the middleware would need to check if the request path is one of the<br>SAML endpoints for every request. Second, it would be too magical and in<br>case of a problem, much harder to debug.<br><br>**Why not call this package django-saml as many other Django applications?**<br><br>Following that pattern then I should import the application with<br>import saml but unfortunately that module name is already used in pysaml2.<br><br><br>Changes<br>=======<br><br>0.17.1 (2018-07-16)<br>----------<br>- A 403 (permission denied) is now raised if a SAMLResponse is replayed, instead of 500.<br>- Dropped support for Python 3.3<br>- Upgraded pysaml2 dependency to version 4.5.0<br><br>Thanks to francoisfreitag, mhindery, vkurup, peppelinux<br><br>0.16.11 (2017-12-25)<br>----------<br>- Dropped compatibility for Python &lt; 2.7 and Django &lt; 1.8.<br>- Added a clean_attributes hook allowing backends to restructure attributes extracted from SAML response.<br>- Log when fields are missing in a SAML response.<br>- Log when attribute_mapping maps to nonexistent User fields.<br>- Multiple compatibility fixes and other minor improvements and code cleanups<br><br>Thanks to francoisfreitag, mhindery, charn, jdufresne<br><br>0.16.10 (2017-10-02)<br>-------------------<br>- Bugfixes and internal refactorings.<br>- Added support for custom USERNAME_FIELD on custom User models. Many thanks to francoisfreitag.<br><br>0.16.9 (2017-09-19)<br>-------------------<br>- Bugfixes and minor improvements. Thanks to goetzk and AmbientLighter.<br>- Added option SAML_LOGOUT_REQUEST_PREFERRED_BINDING<br>- Added Django 1.11 to tox.<br><br>0.16.4 (2017-09-11)<br>-------------------<br>- Added support for SHA-256 signing. Thanks to WebSpider.<br>- Bugfixes. Thanks to justinsg and charn.<br>- Error handling made more extensible. This will be further improved in next versions.<br><br>0.16.1 (2017-07-15)<br>-------------------<br>- Bugfixes. Thanks to canni, AmbientLighter, cranti and logston.<br>- request is now passed to authentication backend (introduced in Django 1.11). Thanks to terite.<br><br>0.16.0 (2017-04-14)<br>-------------------<br>- Upgrade pysaml2 dependency to version 4.4.0 which fixes some serialization issues. Thanks to nakato for the report.<br>- Added support for HTTP Redirect binding with signed authentication requests. Many thanks to liquidpele for this feature and other related refactorings.<br>- The custom permission_denied.html template was removed in favor of standard PermissionDenied exception. Thanks to mhindery.<br><br>0.15.0 (2016-12-18)<br>-------------------<br>- Python 3.5 support. Thanks to timheap.<br>- Added support for callable user attributes. Thanks to andy-miracl and joetsoi.<br>- Security improvement: \"next\" URL is now checked. thanks to flupzor.<br>- Improved testability. Thanks to flupzor.<br>- Other bugfixes and minor improvements. Thanks to jamaalscarlett, ws0w, jaywink and liquidpele.<br><br>0.14.5 (2016-09-19)<br>-------------------<br>- Django 1.10 support. Thanks to inducer.<br>- Various fixes and minor improvements. Thanks to ajsmilutin, ganiserb, inducer, grunichev, liquidpele and darbula<br><br>0.14.4 (2016-03-29)<br>-------------------<br>- Fix compatibility issue with pysaml2-4.0.3+. Thanks to jimr and astoltz.<br>- Fix Django 1.9 compatibility issue in templates. Thanks to nikoskal.<br><br>0.14.3 (2016-03-18)<br>-------------------<br>- Upgraded to pysaml2-4.0.5.<br>- Added 'ACS_DEFAULT_REDIRECT_URL' setting for default redirection after successful authentication. Thanks to ganiserb.<br><br>0.14.2 (2016-03-11)<br>-------------------<br>- Released under the original 'djangosaml2' package name; abandoning the djangosaml2-knaperek fork.<br><br>0.14.1 (2016-03-09)<br>-------------------<br>- Upgraded to pysaml2-4.0.4.<br><br>0.14.0 (2016-01-28)<br>-------------------<br>- Upgrade to pysaml2-4.0.2. Thanks to kviktor<br>- Django 1.9 support. Thanks to Jordi Gutiérrez Hermoso<br><br>0.13.2 (2015-06-24)<br>-------------------<br>- Improved usage of standard Python logging.<br><br>0.13.1 (2015-06-05)<br>-------------------<br>- Added support for djangosaml2 specific user model defined by SAML_USER_MODEL setting<br><br>0.13.0 (2015-02-12)<br>-------------------<br>- Django 1.7 support. Thanks to Kamei Toshimitsu<br><br>0.12.0 (2014-11-18)<br>-------------------<br>- Pysaml2 2.2.0 support. Thanks to Erick Tryzelaar<br><br>0.11.0 (2014-06-15)<br>-------------------<br>- Django 1.5 custom user model support. Thanks to Jos van Velzen<br>- Django 1.5 compatibility url template tag. Thanks to bula<br>- Support Django 1.5 and 1.6. Thanks to David Evans and Justin Quick<br><br>0.10.0 (2013-05-05)<br>-------------------<br>- Check that RelayState is not empty before redirecting into a loop. Thanks<br>  to Sam Bull for reporting this issue.<br>- In the global logout process, when the session is lost, report an error<br>  message to the user and perform a local logout.<br><br>0.9.2 (2013-04-19)<br>------------------<br>- Upgrade to pysaml2-0.4.3.<br><br>0.9.1 (2013-01-29)<br>------------------<br>- Add a method to the authentication backend so it is possible<br>  to customize the authorization based on SAML attributes.<br><br>0.9.0 (2012-10-30)<br>------------------<br>- Add a signal for modifying the user just before saving it on<br>  the update_user method of the authentication backend.<br><br>0.8.1 (2012-10-29)<br>------------------<br>- Trim the SAML attributes before setting them to the Django objects<br>  if they are too long. This fixes a crash with MySQL.<br><br>0.8.0 (2012-10-25)<br>------------------<br>- Allow to use different attributes besides 'username' to look for<br>  existing users.<br><br>0.7.0 (2012-10-19)<br>------------------<br>- Add a setting to decide if the user should be redirected to the<br>  next view or shown an authorization error when the user tries to<br>  login twice.<br><br>0.6.1 (2012-09-03)<br>------------------<br>- Remove Django from our dependencies<br>- Restore support for Django 1.3<br><br>0.6.0 (2012-08-29)<br>------------------<br>- Add tox support configured to run the tests with Python 2.6 and 2.7<br>- Fix some dependencies and sdist generation. Lorenzo Gil<br>- Allow defining a logout redirect url in the settings. Lorenzo Gil<br>- Add some logging calls to improve debugging. Lorenzo Gil<br>- Add support for custom conf loading function. Sam Bull.<br>- Make the tests more robust and easier to run when djangosaml2 is<br>  included in a Django project. Sam Bull.<br>- Make sure the profile is not None before saving it. Bug reported by<br>  Leif Johansson<br><br>0.5.0 (2012-05-22)<br>------------------<br>- Allow defining custom config loaders. They can be dynamic depending on<br>  the request.<br>- Do not automatically add the authentication backend. This way<br>  we allow other people to add their own backends.<br>- Support for additional attributes other than the ones that get mapped<br>  into the User model. Those attributes get stored in the UserProfile model.<br><br>0.4.2 (2012-03-23)<br>------------------<br>- Fix a crash in the idplist templatetag about using an old pysaml2 function<br>- Added a test for the previous crash<br><br>0.4.1 (2012-03-19)<br>------------------<br>- Upgrade pysaml2 dependency to version 0.4.1<br><br>0.4.0 (2012-03-18)<br>------------------<br>- Upgrade pysaml2 dependency to version 0.4.0 (update our tests as a result<br>  of this)<br>- Add logging calls to make debugging easier<br>- Use the Django configured logger in pysaml2<br><br>0.3.3 (2012-02-14)<br>------------------<br>- Freeze the version of pysaml2 since we are not (yet!) compatible with<br>  version 0.4.0<br><br>0.3.2 (2011-12-13)<br>------------------<br>- Avoid a crash when reading the SAML attribute that maps to the Django<br>  username<br><br>0.3.1 (2011-12-01)<br>------------------<br>- Load the config in the render method of the idplist templatetag to<br>  make it more flexible and reentrant.<br><br>0.3.0 (2011-11-30)<br>------------------<br>- Templatetag to get the list of available idps.<br>- Allow to map the same SAML attribute into several Django field.<br><br>0.2.4 (2011-11-29)<br>------------------<br>- Fix restructured text bugs that made pypi page looks bad.<br><br>0.2.3 (2011-06-14)<br>------------------<br>- Set a unusable password when the user is created for the first time<br><br>0.2.2 (2011-06-07)<br>------------------<br>- Prevent infinite loop when going to the /saml2/login/ endpoint and the user<br>  is already logged in and the settings.LOGIN_REDIRECT_URL is (badly) pointing<br>  to /saml2/login.<br><br>0.2.1 (2011-05-09)<br>------------------<br>- If no next parameter is supplied to the login view, use the<br>  settings.LOGIN_REDIRECT_URL as default<br><br>0.2.0 (2011-04-26)<br>------------------<br>- Python 2.4 compatible if the elementtree library is installed<br>- Allow post processing after the authentication phase by using<br>  Django signals.<br><br>0.1.1 (2011-04-18)<br>------------------<br>- Simple view to echo SAML attributes<br>- Improve documentation<br>- Change default behaviour when a new user is created. Now their attributes<br>  are filled this first time<br>- Allow to set a next page after the logout<br><br>0.1.0 (2011-03-16)<br>------------------<br>- Emancipation from the pysaml package\n          </div>"}, "last_serial": 4406183, "releases": {"0.17.2": [{"comment_text": "", "digests": {"md5": "a9d6317455f6129cf04a54e99552d162", "sha256": "e347d5ba3d13971eb367669550162b46c37bedca514889ad97e5e90395b1befa"}, "downloads": -1, "filename": "unicef-djangosaml2-0.17.2.tar.gz", "has_sig": false, "md5_digest": "a9d6317455f6129cf04a54e99552d162", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3898752, "upload_time": "2018-10-23T12:03:39", "upload_time_iso_8601": "2018-10-23T12:03:39.696714Z", "url": "https://files.pythonhosted.org/packages/43/f7/efbfe1c6b3216872e4a39cf59b85bd6b4ea176fbd30baa017e158ed1c1f2/unicef-djangosaml2-0.17.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "a9d6317455f6129cf04a54e99552d162", "sha256": "e347d5ba3d13971eb367669550162b46c37bedca514889ad97e5e90395b1befa"}, "downloads": -1, "filename": "unicef-djangosaml2-0.17.2.tar.gz", "has_sig": false, "md5_digest": "a9d6317455f6129cf04a54e99552d162", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 3898752, "upload_time": "2018-10-23T12:03:39", "upload_time_iso_8601": "2018-10-23T12:03:39.696714Z", "url": "https://files.pythonhosted.org/packages/43/f7/efbfe1c6b3216872e4a39cf59b85bd6b4ea176fbd30baa017e158ed1c1f2/unicef-djangosaml2-0.17.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:40:47 2020"}