{"info": {"author": "Verius Technologhy", "author_email": "info@verius.ai", "bugtrack_url": null, "classifiers": ["Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# PROJECT DESCRIPTION\n\nA Gateway for VeriUs Text Mining API.\nVersion: 0.1.8-beta (Anything on this document is subject to change.)\nPlease always use the most recent version.\n---\n\n## Authentication\n\nVeriUs Text API’s uses \"API KEY\"s to authenticate incoming requests.\nYou should pass in your \"API KEY\" while creating the VeriUsAPI Object.\n\n###### INFO\n\n- You must replace **“$API_KEY”** with your **“API KEY”**.\n- Since our services are constantly get updated results in this page may or may not represent actual values.\n\n---\n## Installation and Importation\n\n```\n$ pip install requests\n$ pip install veriusapigateway\n$ python3\nfrom veriusapigateway import VeriUsAPIGateway\nVeriUsAPI = VeriUsAPIGateway(\"$API_KEY\")\n```\n\n---\n## Text Similarity\n\n**Estimate the degree of similarity between two texts**\n\n**Usage:**\n\n```\ntext1 = \"Artificial intelligence (AI), the ability of a digital computer or computer-controlled robot to perform tasks commonly associated with intelligent beings.\"\ntext2 = \"AI (artificial intelligence) is the simulation of human intelligence processes by machines, especially computer systems.\"\nVeriUsAPI.text_similarity(text1, text2)\n{'result': 0.4136701519960154}\n```\n\n---\n## Language Detection\n\n**Detect the language of a text.**\n\n**Usage:**\n\n```\ntext = \"Yapay zeka (AI), bir dijital bilgisayarın veya bilgisayar kontrollü robotun, akıllı varlıklar ile yaygın olarak ilişkili görevleri gerçekleştirme kabiliyetidir.\"\nVeriUsAPI.language(text)\n{'result': 'tr'}\n```\n\n---\n## Abusive Content Detection\n\n**Check if a sentence is abusive or not.**\n\n**Usage:**\n\n```\ntext = \"Yapay zeka (AI), bir dijital bilgisayarın veya bilgisayar kontrollü robotun, akıllı varlıklar ile yaygın olarak ilişkili görevleri gerçekleştirme kabiliyetidir.\"\nVeriUsAPI.abusive(text)\n{'confidency': '0.9427243215855821', 'result': 'Non-abusive'}\n```\n\n---\n## Text Summarization\n\n**Summarize with the major points of the original document.**\n\n**Usage:**\n\n```\ntext = \"Bir kedi varmış, çok yalnızmış.  Çünkü kedi, annesini ve babasını kaybetmiş.Her gün yollarda gezermiş aç aç. Çöplükte yaşarmış. Bir gün bir evin yanından geçerken bir çocuğa rastlamış. Çocuk kediyi 2-3 dakika sevdikten sonra onu evine götürmüş, kedi ise hiç bir şey dememiş çünkü kedi hiç  Olamaz çünkü onun bir ailesi var demiş. Ancak çocuk ısrar etmiş ve babasını ikna etmiş. Çocuk da mutluymuş kedi  de. Kediyi beslemeye başlamışlar. 1 sene geçtikten sonra kedinin annesi ve babası ortaya çıkmış. Yavrularını bulmak için çabalamışlar ve sonunda bulmuşlar. Kedi ilk önce gitmek istememiş fakat annesi babası olduğunu anlayınca hemen onların yanına gitmiş. Çocuk ağlamaya başlamış.-Anladım baba, mutlu mutlu yaşasınlar, demiş. Kedi ve ailesi yola çıkmışlar, iyi bir hayata yeniden başlamışlar.\"\nVeriUsAPI.summary(text)\n{'result': 'Çocuk kediyi 2-3 dakika sevdikten sonra onu evine götürmüş, kedi ise hiç bir şey dememiş çünkü kedi hiç  Olamaz çünkü onun bir ailesi var demiş. Çocuk da mutluymuş kedi  de.'}\n\n```\n\n---\n## Keyword Extraction\n\n**Identify terms that best decribe the subject of a document.**\n\n**Usage:**\n\n```\ntext = \"Carl Sagan, Dünya dışında akıllı hayatın araştırılmasından yanaydı. Bilim dünyasını, Dünya dışı akıllı yaşam formlarından gelen sinyalleri dinlemek için büyük radyo-teleskopları kullanmaya sevk etmiştir. Diğer gezegenlere sondalar gönderilmesi gerektiğini savunmuştur. Carl Sagan, 12 yıl boyunca Icarus dergisinin editörlüğünü yapmıştır. Planetary Society nin kurucularındandır. Carl Sagan, SETI Enstitüsü nün yönetim kurulunun bir üyesiydi.\"\nVeriUsAPI.keywords(text)\n{'result': 'Carl Sagan Akıllı'}\n```\n\n---\n## Entity Extraction\n\n**Identify relevant nouns (people, places and organizations) that are mentioned in a text.**\n\n**Usage:**\n\n```\ntext = \"Merhaba ben Ahmet, nasılsınız?\"\nVeriUsAPI.named_entitites(text)\n{'word_list': ['Merhaba', 'ben', 'Ahmet', ',', 'nasılsınız', '?'], 'prediction_list': ['O', 'O', 'B-PERSON', 'O', 'O', 'O']}\n```\n\n---\n## Distorted Language Detection\n\n**A fun project to detect distorted language spoken by the white collar.**\n\n**Usage:**\n\n```\ntext = \"Gelecek hafta için bir toplantı assign edip brainstorming yapalım ve bir an önce bu konuda aksiyon alalım çünkü deadline yaklaşıyor.\"\nVeriUsAPI.distorted(text)\n{'result': '0.9992382579798134'}\n```\n\n---\n## Intent Detection\n\n**Determine the expressed intent of given text.**\n\n**Usage:**\n\n```\ntext = \"Merhaba banka hesabı açmak istiyorum yardımcı olabilir misiniz?\"\nVeriUsAPI.intent(text)\n{'result': 'QUERY'}\n```\n\n---\n## Normalization\n\n**Normalize a given sentence to its proper written form**\n\n**Usage:**\n\n```\ntext = \"@dida bi yere gitcem büttttttüüüünnnnn insanlar hür, haysiyet ve haklari bakimindan e$it doğarlaaaar.\"\nVeriUsAPI.normal(text)\n{'result': '@mansiyon[@dida] bir yere gideceğim bütün insanlar hür , haysiyet ve haklar bakımından eşit doğarlar .'}\n```\n\n---\n## Deasciifier\n\n**Replace ascii characters with Turkish characters**\n\n**Usage:**\n\n```\ntext = \"Dun yolda bir kedi gordum, cok sevımlıydı. Hemen alıp cantama koydum ve eve getırdım.\"\nVeriUsAPI.deasciified(text)\n{'result': 'Dün yolda bir kedi gördüm, çok sevimliydi. Hemen alıp çantama koydum ve eve getirdim.'}\n```\n\n---\n## Morphological Analysis\n\n**Decompose a given text to its morphogical characteristics**\n\n**Usage:**\n\n```\ntext = \"Bütün insanlar hür , haysiyet ve haklar bakımından eşit doğarlar .\"\nVeriUsAPI.morphology(text)\n{'result': '[[bütün:Adj] bütün:Adj, [insan:Noun] insan:Noun+lar:A3pl, [hür:Adj] hür:Adj, [,:Punc] ,:Punc, [haysiyet:Noun] haysiyet:Noun+A3sg, [ve:Conj] ve:Conj, [hak:Noun] hak:Noun+lar:A3pl, [bakım:Noun] bakım:Noun+A3sg+ı:P3sg+ndan:Abl, [eşit:Adj] eşit:Adj, [doğmak:Verb] doğ:Verb+ar:Aor+lar:A3pl, [.:Punc] .:Punc]'}\n```\n\n---\n## Sexual Content Detection\n\n**An aggressive service to detect sexual content**\n\n**Usage:**\n\n```\ntext = \"Senden her yerin gözükecek şekilde fotoğraf istiyorum.\"\nVeriUsAPI.sexual(text)\n{'confidency': 0.9279416838064626, 'result': 'SEXUAL'}\n```\n\n---\n## Gibberish Detection\n\n**Detect whether words in a sentence are meaningful or not**\n\n**Usage:**\n\n```\ntext = \"RÖHAEHÖHEY. Gülmeyi unuttuk be Hüseyin.\"\nVeriUsAPI.gibberish(text)\n{'result': 'GIBBERISH'}\n```\n\n---\n## Sentence Tokenizer\n\n**Decompose a given text to its sentences**\n\n**Usage:**\n\n```\ntext = \"Geçen gün o geldi ama neden geldi hala belli değil.\"\nVeriUsAPI.sentence_tokens(text)\n{'result': ['Geçen gün o geldi', 'ama neden geldi', 'hala belli değil .']}\n```\n\n\n---\n## Sentiment Classification\n\n**Determine whether a text is positive or negative**\n\n**Usage:**\n\n```\ntext = \"Bu ürünü hiç beğenmedim, iade etmek istiyorum.\"\nVeriUsAPI.sentiment(text)\n{'result': 'Negative'}\n```\n\n\n---\n## Turkish Stemmer\n\n**Find roots of given words in a sentence**\n\n**Usage:**\n\n```\ntext = \"Büyük haberlerle geldim sana.\"\nVeriUsAPI.stem(text)\n{'result': 'Büyük haber gel sen .'}\n```\n\n\n---\n## Topic Detection (Electronic Shop Domain)\n\n**Extract relevant topics from a given complaint on a specific domain**\n\n**Usage:**\n\n```\ntext = \"güven veren güler yüzlü eleman enes için teşekkür ederim\"\nVeriUsAPI.topics_electronics(text)\n{'result': ['personel', 'teşekkür']}\n```\n\n\n---\n## Topic Detection (Clothing Domain)\n\n**Extract relevant topics from a given complaint on a specific domain**\n\n**Usage:**\n\n```\ntext = \"pantolon aldım 200 lira para verdim. İndirim yok mu hiç?\"\nVeriUsAPI.topics_clothing(text)\n{'result': ['ürün', 'fiyat_kampanya']}\n```\n\n\n---\n## Topic Detection (Banking Domain)\n\n**Extract relevant topics from a given complaint on a specific domain**\n\n**Usage:**\n\n```\ntext = \"güven veren güler yüzlü eleman enes için teşekkür ederim\"\nVeriUsAPI.topics_banking(text)\n{'result': ['personel', 'teşekkür']}\n```\n\n\n---\n## Topic Detection (Hospital Domain)\n\n**Extract relevant topics from a given complaint on a specific domain**\n\n**Usage:**\n\n```\ntext = \"Doktor beyden çok memnun kaldım. Teşekkürler.\"\nVeriUsAPI.topics_hospital(text)\n{'result': ['hekimlik_hizmeti', 'teşekkür']}\n```\n\n\n---\n## Topic Detection (Retail Domain)\n\n**Extract relevant topics from a given complaint on a specific domain**\n\n**Usage:**\n\n```\ntext = \"market içinde mevcut kötü bir koku var; balık, et ve peynir reyonundan geliyor.\"\nVeriUsAPI.topics_market(text)\n{'result': ['ortam', 'ürün']}\n```\n\n\n---\n## Taxonomy\n\n**Classify the description of web sites**\n\n**Usage:**\n\n```\ntext = \"VeriUs teknoloji servis olarak yapay zeka (AIaaS) ürünleri geliştiren çeşitli yapay zeka, makine öğrenmesi, metin madenciliği, doğal dil isleme ve sosyal ağ analizi servisleri ve danışmanlığı sağlayan bir yapay zeka servis sağlayıcıdır. Ekibimiz oldukça donanımlı Yapay Zeka araştırmacıları, makine öğrenmesi yazılım mühendisleri ve veri bilimcilerden oluşmaktadır. Şirketin kurucusunun 15+ yıl akademik ve uygulamalı makine öğrenmesi ve metin madenciliği tecrübesi bulunmaktadır. Bir üniversite spin-off şirketi olarak VeriUs bu akademik araştırma tecrübesi ve üniversite araştırma grupları ve laboratuvarındaki birikmiş olan bilgiyle desteklenmektedir. İsmimiz VeriUs Türkçe Veri ve Us yani zeka kelimelerinin birleşiminden oluşmaktadır. İsmimiz odak noktamızı vurgulamaktadır; veri analizi ve yapay zeka.\"\nVeriUsAPI.taxonomy(text)\n{'result': 'Bilgisayar'}\n```\n\n\n---\n## Arabic Sentiment Classification\n\n**Determine whether a text is positive or negative**\n\n**Usage:**\n\n```\ntext = \"لم يعجبني هذا المنتج وأردت إعادته\"\nVeriUsAPI.arabic_sentiment(text)\n{'result': 'Negative'}\n```\n\n\n---\n## Arabic News Classification\n\n**Classify the subject of the given news**\n\n**Usage:**\n\n```\ntext = \"ينتظر لاعب فريق نابولي الإيطالي لكرة القدم للشباب، جيانلوكا غايتانو، مستقبل كروي مشرق نظرا لإمكانياته ومهاراته الفنية العالية، والتحاقه بالفريق الأول ليس إلا مسألة وقت.واستعرض جيانلوكا غايتانو مهاراته الفنية العالية، كما يظهر في الفيديو الملحق، خلال مباراة فريقه ضد كالياري، فقد انطلق اللاعب الواعد من منتصف الملعب تقريبا وراوغ عددا من اللاعبين ومن ثم حارس المرمى قبل أن يسجلا هدفا جميلا، واستغرق كل ذلك ثماني ثوان فقط.\"\nVeriUsAPI.arabic_news_class(text)\n{'result': 'SPORTS'}\n```\n\n\n---\n## Arabic Text Summarization\n\n**Summarize with the major points of the original document in Arabic**\n\n**Usage:**\n\n```\ntext = \"كانت حادثة استهداف موكب رئيس الوزراء الفلسطيني، رامي الحمد الله، في قطاع غزة خلال شهر مارس/ آذار الماضي، صادمة للشارع الفلسطيني، وأصابت جهد تحقيق المصالحة الداخلية في مقتل، لا سيما بعدما تلاها من اتهام السلطة الفلسطينية المباشر لحركة حماس بوقوفها خلف الحادث .وجاءت الزيارة في حينه بعد إتمام اتفاق بين حركتي فتح وحماس وبحضور الجانب المصري في القاهرة في أكتوبر / تشرين الأول من عام 2017، والذي نص على تسليم حكومة الوفاق مهامها في وزارات ومؤسسات قطاع غزة، وتسليم المعابر لأمن السلطة الفلسطينية. أعقاب ذلك الاتفاق كانت حكومة الوفاق قد أعلنت حلها قضية رواتب عشرات الآلاف من الموظفين الذين عُينوا بعد تولي حركة حماس الحكم في غزة، من موازنتها لعام 2018، وأعلنت الحكومة الفلسطينية أن حركة حماس أعاقت تمكين حكومة الوفاق في غزة. هدد زعيم حركة فتح، رئيس السلطة الفلسطينية، محمود عباس، في الشهر ذاته، باتخاذ مزيد من الإجراءات القانونية والمالية ضد حركة حماس ما لم تلتزم الأخيرة باتفاقيات المصالحة المتعاقبة، وتُمكن حكومة الوفاق من عملها في القطاع بشكل كامل وفعل حركة حماس فأكدت أنها سلمت بالفعل السيطرة الكاملة لحكومة الوفاق، والمعابر لأمن السلطة الفلسطينية، موجهة الاتهام لحركة فتح والسلطة الفلسطينية بالمماطلة في رفع ما وصفته بعقوباتها عن قطاع غزة. وقال القيادي في حركة حماس, أحمد يوسف لبي بي سي نحن التزمنا بكل ما علينا لتمكين حكومة الوفاق، وطرحنا إمكانية وجود طرف ثالث مكون إما من الإطار القيادي الفلسطيني المؤقت أو وفد من المصريين، للإقامة في قطاع غزة وليحكموا على مسألة التمكين من عدمها وبالمواصفات التي ترضي حركتي فتح وحماس.. التمكين موجود وهناك استحقاقات وذمم مالية للموظفين في عنق الحكومة يجب التعامل معها لضمان هذا التمكين أيضا، الحكومة وفتح في رام الله لديهم اعتراضات ويبدو أنهم غير راغبين بالقدوم وتحمل المسؤولية في قطاع غزة، فهم يواصلون التهرب ووضع الاشتراطات على حركة حماس\"\nVeriUsAPI.arabic_summary(text)\n{'result': 'كانت حادثة استهداف موكب رئيس الوزراء الفلسطيني، رامي الحمد الله، في قطاع غزة خلال شهر مارس/ آذار الماضي، صادمة للشارع الفلسطيني، وأصابت جهد تحقيق المصالحة الداخلية في مقتل، لا سيما بعدما تلاها من اتهام السلطة الفلسطينية المباشر لحركة حماس بوقوفها خلف الحادث .وجاءت الزيارة في حينه بعد إتمام اتفاق بين حركتي فتح وحماس وبحضور الجانب المصري في القاهرة في أكتوبر / تشرين الأول من عام 2017، والذي نص على تسليم حكومة الوفاق مهامها في وزارات ومؤسسات قطاع غزة، وتسليم المعابر لأمن السلطة الفلسطينية.'}\n```\n\n\n\n---\n## Arabic Keyword Extraction\n\n**Identify terms that best describe the subject of a document in Arabic**\n\n**Usage:**\n\n```\ntext = \"كانت حادثة استهداف موكب رئيس الوزراء الفلسطيني، رامي الحمد الله، في قطاع غزة خلال شهر مارس/ آذار الماضي، صادمة للشارع الفلسطيني، وأصابت جهد تحقيق المصالحة الداخلية في مقتل، لا سيما بعدما تلاها من اتهام السلطة الفلسطينية المباشر لحركة حماس بوقوفها خلف الحادث .وجاءت الزيارة في حينه بعد إتمام اتفاق بين حركتي فتح وحماس وبحضور الجانب المصري في القاهرة في أكتوبر / تشرين الأول من عام 2017، والذي نص على تسليم حكومة الوفاق مهامها في وزارات ومؤسسات قطاع غزة، وتسليم المعابر لأمن السلطة الفلسطينية. أعقاب ذلك الاتفاق كانت حكومة الوفاق قد أعلنت حلها قضية رواتب عشرات الآلاف من الموظفين الذين عُينوا بعد تولي حركة حماس الحكم في غزة، من موازنتها لعام 2018، وأعلنت الحكومة الفلسطينية أن حركة حماس أعاقت تمكين حكومة الوفاق في غزة. هدد زعيم حركة فتح، رئيس السلطة الفلسطينية، محمود عباس، في الشهر ذاته، باتخاذ مزيد من الإجراءات القانونية والمالية ضد حركة حماس ما لم تلتزم الأخيرة باتفاقيات المصالحة المتعاقبة، وتُمكن حكومة الوفاق من عملها في القطاع بشكل كامل وفعل حركة حماس فأكدت أنها سلمت بالفعل السيطرة الكاملة لحكومة الوفاق، والمعابر لأمن السلطة الفلسطينية، موجهة الاتهام لحركة فتح والسلطة الفلسطينية بالمماطلة في رفع ما وصفته بعقوباتها عن قطاع غزة. وقال القيادي في حركة حماس, أحمد يوسف لبي بي سي نحن التزمنا بكل ما علينا لتمكين حكومة الوفاق، وطرحنا إمكانية وجود طرف ثالث مكون إما من الإطار القيادي الفلسطيني المؤقت أو وفد من المصريين، للإقامة في قطاع غزة وليحكموا على مسألة التمكين من عدمها وبالمواصفات التي ترضي حركتي فتح وحماس.. التمكين موجود وهناك استحقاقات وذمم مالية للموظفين في عنق الحكومة يجب التعامل معها لضمان هذا التمكين أيضا، الحكومة وفتح في رام الله لديهم اعتراضات ويبدو أنهم غير راغبين بالقدوم وتحمل المسؤولية في قطاع غزة، فهم يواصلون التهرب ووضع الاشتراطات على حركة حماس\"\nVeriUsAPI.arabic_keywords(text)\n{'result': 'حكومة حركة لحرك حماس الفلسطيني حكوم وفاق حرك فتح حماس وأعلن حكومة تمكين لتمكين التمكين السلط فلسطينية المصالحة وفعل بالفعل والسلطة غزة والمالية مالية الله رئيس حينه الحكم الحمد أحمد بعدم لاها بالقدوم حمل التهرب وضع ذ اتخاذ أعلنت عدم'}\n```\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://bitbucket.org/veriusai/veriusapigateway/", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "veriusapigateway", "package_url": "https://pypi.org/project/veriusapigateway/", "platform": "", "project_url": "https://pypi.org/project/veriusapigateway/", "project_urls": {"Homepage": "https://bitbucket.org/veriusai/veriusapigateway/"}, "release_url": "https://pypi.org/project/veriusapigateway/0.1.8/", "requires_dist": null, "requires_python": "", "summary": "API Gateway for accessing Verius Web Services.", "version": "0.1.8", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>PROJECT DESCRIPTION</h1>\n<h2>A Gateway for VeriUs Text Mining API.\nVersion: 0.1.8-beta (Anything on this document is subject to change.)\nPlease always use the most recent version.</h2>\n<h2>Authentication</h2>\n<p>VeriUs Text API’s uses \"API KEY\"s to authenticate incoming requests.\nYou should pass in your \"API KEY\" while creating the VeriUsAPI Object.</p>\n<h6>INFO</h6>\n<ul>\n<li>You must replace <strong>“$API_KEY”</strong> with your <strong>“API KEY”</strong>.</li>\n<li>Since our services are constantly get updated results in this page may or may not represent actual values.</li>\n</ul>\n<hr>\n<h2>Installation and Importation</h2>\n<pre><code>$ pip install requests\n$ pip install veriusapigateway\n$ python3\nfrom veriusapigateway import VeriUsAPIGateway\nVeriUsAPI = VeriUsAPIGateway(\"$API_KEY\")\n</code></pre>\n<hr>\n<h2>Text Similarity</h2>\n<p><strong>Estimate the degree of similarity between two texts</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text1 = \"Artificial intelligence (AI), the ability of a digital computer or computer-controlled robot to perform tasks commonly associated with intelligent beings.\"\ntext2 = \"AI (artificial intelligence) is the simulation of human intelligence processes by machines, especially computer systems.\"\nVeriUsAPI.text_similarity(text1, text2)\n{'result': 0.4136701519960154}\n</code></pre>\n<hr>\n<h2>Language Detection</h2>\n<p><strong>Detect the language of a text.</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Yapay zeka (AI), bir dijital bilgisayarın veya bilgisayar kontrollü robotun, akıllı varlıklar ile yaygın olarak ilişkili görevleri gerçekleştirme kabiliyetidir.\"\nVeriUsAPI.language(text)\n{'result': 'tr'}\n</code></pre>\n<hr>\n<h2>Abusive Content Detection</h2>\n<p><strong>Check if a sentence is abusive or not.</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Yapay zeka (AI), bir dijital bilgisayarın veya bilgisayar kontrollü robotun, akıllı varlıklar ile yaygın olarak ilişkili görevleri gerçekleştirme kabiliyetidir.\"\nVeriUsAPI.abusive(text)\n{'confidency': '0.9427243215855821', 'result': 'Non-abusive'}\n</code></pre>\n<hr>\n<h2>Text Summarization</h2>\n<p><strong>Summarize with the major points of the original document.</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Bir kedi varmış, çok yalnızmış.  Çünkü kedi, annesini ve babasını kaybetmiş.Her gün yollarda gezermiş aç aç. Çöplükte yaşarmış. Bir gün bir evin yanından geçerken bir çocuğa rastlamış. Çocuk kediyi 2-3 dakika sevdikten sonra onu evine götürmüş, kedi ise hiç bir şey dememiş çünkü kedi hiç  Olamaz çünkü onun bir ailesi var demiş. Ancak çocuk ısrar etmiş ve babasını ikna etmiş. Çocuk da mutluymuş kedi  de. Kediyi beslemeye başlamışlar. 1 sene geçtikten sonra kedinin annesi ve babası ortaya çıkmış. Yavrularını bulmak için çabalamışlar ve sonunda bulmuşlar. Kedi ilk önce gitmek istememiş fakat annesi babası olduğunu anlayınca hemen onların yanına gitmiş. Çocuk ağlamaya başlamış.-Anladım baba, mutlu mutlu yaşasınlar, demiş. Kedi ve ailesi yola çıkmışlar, iyi bir hayata yeniden başlamışlar.\"\nVeriUsAPI.summary(text)\n{'result': 'Çocuk kediyi 2-3 dakika sevdikten sonra onu evine götürmüş, kedi ise hiç bir şey dememiş çünkü kedi hiç  Olamaz çünkü onun bir ailesi var demiş. Çocuk da mutluymuş kedi  de.'}\n\n</code></pre>\n<hr>\n<h2>Keyword Extraction</h2>\n<p><strong>Identify terms that best decribe the subject of a document.</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Carl Sagan, Dünya dışında akıllı hayatın araştırılmasından yanaydı. Bilim dünyasını, Dünya dışı akıllı yaşam formlarından gelen sinyalleri dinlemek için büyük radyo-teleskopları kullanmaya sevk etmiştir. Diğer gezegenlere sondalar gönderilmesi gerektiğini savunmuştur. Carl Sagan, 12 yıl boyunca Icarus dergisinin editörlüğünü yapmıştır. Planetary Society nin kurucularındandır. Carl Sagan, SETI Enstitüsü nün yönetim kurulunun bir üyesiydi.\"\nVeriUsAPI.keywords(text)\n{'result': 'Carl Sagan Akıllı'}\n</code></pre>\n<hr>\n<h2>Entity Extraction</h2>\n<p><strong>Identify relevant nouns (people, places and organizations) that are mentioned in a text.</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Merhaba ben Ahmet, nasılsınız?\"\nVeriUsAPI.named_entitites(text)\n{'word_list': ['Merhaba', 'ben', 'Ahmet', ',', 'nasılsınız', '?'], 'prediction_list': ['O', 'O', 'B-PERSON', 'O', 'O', 'O']}\n</code></pre>\n<hr>\n<h2>Distorted Language Detection</h2>\n<p><strong>A fun project to detect distorted language spoken by the white collar.</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Gelecek hafta için bir toplantı assign edip brainstorming yapalım ve bir an önce bu konuda aksiyon alalım çünkü deadline yaklaşıyor.\"\nVeriUsAPI.distorted(text)\n{'result': '0.9992382579798134'}\n</code></pre>\n<hr>\n<h2>Intent Detection</h2>\n<p><strong>Determine the expressed intent of given text.</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Merhaba banka hesabı açmak istiyorum yardımcı olabilir misiniz?\"\nVeriUsAPI.intent(text)\n{'result': 'QUERY'}\n</code></pre>\n<hr>\n<h2>Normalization</h2>\n<p><strong>Normalize a given sentence to its proper written form</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"@dida bi yere gitcem büttttttüüüünnnnn insanlar hür, haysiyet ve haklari bakimindan e$it doğarlaaaar.\"\nVeriUsAPI.normal(text)\n{'result': '@mansiyon[@dida] bir yere gideceğim bütün insanlar hür , haysiyet ve haklar bakımından eşit doğarlar .'}\n</code></pre>\n<hr>\n<h2>Deasciifier</h2>\n<p><strong>Replace ascii characters with Turkish characters</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Dun yolda bir kedi gordum, cok sevımlıydı. Hemen alıp cantama koydum ve eve getırdım.\"\nVeriUsAPI.deasciified(text)\n{'result': 'Dün yolda bir kedi gördüm, çok sevimliydi. Hemen alıp çantama koydum ve eve getirdim.'}\n</code></pre>\n<hr>\n<h2>Morphological Analysis</h2>\n<p><strong>Decompose a given text to its morphogical characteristics</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Bütün insanlar hür , haysiyet ve haklar bakımından eşit doğarlar .\"\nVeriUsAPI.morphology(text)\n{'result': '[[bütün:Adj] bütün:Adj, [insan:Noun] insan:Noun+lar:A3pl, [hür:Adj] hür:Adj, [,:Punc] ,:Punc, [haysiyet:Noun] haysiyet:Noun+A3sg, [ve:Conj] ve:Conj, [hak:Noun] hak:Noun+lar:A3pl, [bakım:Noun] bakım:Noun+A3sg+ı:P3sg+ndan:Abl, [eşit:Adj] eşit:Adj, [doğmak:Verb] doğ:Verb+ar:Aor+lar:A3pl, [.:Punc] .:Punc]'}\n</code></pre>\n<hr>\n<h2>Sexual Content Detection</h2>\n<p><strong>An aggressive service to detect sexual content</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Senden her yerin gözükecek şekilde fotoğraf istiyorum.\"\nVeriUsAPI.sexual(text)\n{'confidency': 0.9279416838064626, 'result': 'SEXUAL'}\n</code></pre>\n<hr>\n<h2>Gibberish Detection</h2>\n<p><strong>Detect whether words in a sentence are meaningful or not</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"RÖHAEHÖHEY. Gülmeyi unuttuk be Hüseyin.\"\nVeriUsAPI.gibberish(text)\n{'result': 'GIBBERISH'}\n</code></pre>\n<hr>\n<h2>Sentence Tokenizer</h2>\n<p><strong>Decompose a given text to its sentences</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Geçen gün o geldi ama neden geldi hala belli değil.\"\nVeriUsAPI.sentence_tokens(text)\n{'result': ['Geçen gün o geldi', 'ama neden geldi', 'hala belli değil .']}\n</code></pre>\n<hr>\n<h2>Sentiment Classification</h2>\n<p><strong>Determine whether a text is positive or negative</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Bu ürünü hiç beğenmedim, iade etmek istiyorum.\"\nVeriUsAPI.sentiment(text)\n{'result': 'Negative'}\n</code></pre>\n<hr>\n<h2>Turkish Stemmer</h2>\n<p><strong>Find roots of given words in a sentence</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Büyük haberlerle geldim sana.\"\nVeriUsAPI.stem(text)\n{'result': 'Büyük haber gel sen .'}\n</code></pre>\n<hr>\n<h2>Topic Detection (Electronic Shop Domain)</h2>\n<p><strong>Extract relevant topics from a given complaint on a specific domain</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"güven veren güler yüzlü eleman enes için teşekkür ederim\"\nVeriUsAPI.topics_electronics(text)\n{'result': ['personel', 'teşekkür']}\n</code></pre>\n<hr>\n<h2>Topic Detection (Clothing Domain)</h2>\n<p><strong>Extract relevant topics from a given complaint on a specific domain</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"pantolon aldım 200 lira para verdim. İndirim yok mu hiç?\"\nVeriUsAPI.topics_clothing(text)\n{'result': ['ürün', 'fiyat_kampanya']}\n</code></pre>\n<hr>\n<h2>Topic Detection (Banking Domain)</h2>\n<p><strong>Extract relevant topics from a given complaint on a specific domain</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"güven veren güler yüzlü eleman enes için teşekkür ederim\"\nVeriUsAPI.topics_banking(text)\n{'result': ['personel', 'teşekkür']}\n</code></pre>\n<hr>\n<h2>Topic Detection (Hospital Domain)</h2>\n<p><strong>Extract relevant topics from a given complaint on a specific domain</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"Doktor beyden çok memnun kaldım. Teşekkürler.\"\nVeriUsAPI.topics_hospital(text)\n{'result': ['hekimlik_hizmeti', 'teşekkür']}\n</code></pre>\n<hr>\n<h2>Topic Detection (Retail Domain)</h2>\n<p><strong>Extract relevant topics from a given complaint on a specific domain</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"market içinde mevcut kötü bir koku var; balık, et ve peynir reyonundan geliyor.\"\nVeriUsAPI.topics_market(text)\n{'result': ['ortam', 'ürün']}\n</code></pre>\n<hr>\n<h2>Taxonomy</h2>\n<p><strong>Classify the description of web sites</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"VeriUs teknoloji servis olarak yapay zeka (AIaaS) ürünleri geliştiren çeşitli yapay zeka, makine öğrenmesi, metin madenciliği, doğal dil isleme ve sosyal ağ analizi servisleri ve danışmanlığı sağlayan bir yapay zeka servis sağlayıcıdır. Ekibimiz oldukça donanımlı Yapay Zeka araştırmacıları, makine öğrenmesi yazılım mühendisleri ve veri bilimcilerden oluşmaktadır. Şirketin kurucusunun 15+ yıl akademik ve uygulamalı makine öğrenmesi ve metin madenciliği tecrübesi bulunmaktadır. Bir üniversite spin-off şirketi olarak VeriUs bu akademik araştırma tecrübesi ve üniversite araştırma grupları ve laboratuvarındaki birikmiş olan bilgiyle desteklenmektedir. İsmimiz VeriUs Türkçe Veri ve Us yani zeka kelimelerinin birleşiminden oluşmaktadır. İsmimiz odak noktamızı vurgulamaktadır; veri analizi ve yapay zeka.\"\nVeriUsAPI.taxonomy(text)\n{'result': 'Bilgisayar'}\n</code></pre>\n<hr>\n<h2>Arabic Sentiment Classification</h2>\n<p><strong>Determine whether a text is positive or negative</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"لم يعجبني هذا المنتج وأردت إعادته\"\nVeriUsAPI.arabic_sentiment(text)\n{'result': 'Negative'}\n</code></pre>\n<hr>\n<h2>Arabic News Classification</h2>\n<p><strong>Classify the subject of the given news</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"ينتظر لاعب فريق نابولي الإيطالي لكرة القدم للشباب، جيانلوكا غايتانو، مستقبل كروي مشرق نظرا لإمكانياته ومهاراته الفنية العالية، والتحاقه بالفريق الأول ليس إلا مسألة وقت.واستعرض جيانلوكا غايتانو مهاراته الفنية العالية، كما يظهر في الفيديو الملحق، خلال مباراة فريقه ضد كالياري، فقد انطلق اللاعب الواعد من منتصف الملعب تقريبا وراوغ عددا من اللاعبين ومن ثم حارس المرمى قبل أن يسجلا هدفا جميلا، واستغرق كل ذلك ثماني ثوان فقط.\"\nVeriUsAPI.arabic_news_class(text)\n{'result': 'SPORTS'}\n</code></pre>\n<hr>\n<h2>Arabic Text Summarization</h2>\n<p><strong>Summarize with the major points of the original document in Arabic</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"كانت حادثة استهداف موكب رئيس الوزراء الفلسطيني، رامي الحمد الله، في قطاع غزة خلال شهر مارس/ آذار الماضي، صادمة للشارع الفلسطيني، وأصابت جهد تحقيق المصالحة الداخلية في مقتل، لا سيما بعدما تلاها من اتهام السلطة الفلسطينية المباشر لحركة حماس بوقوفها خلف الحادث .وجاءت الزيارة في حينه بعد إتمام اتفاق بين حركتي فتح وحماس وبحضور الجانب المصري في القاهرة في أكتوبر / تشرين الأول من عام 2017، والذي نص على تسليم حكومة الوفاق مهامها في وزارات ومؤسسات قطاع غزة، وتسليم المعابر لأمن السلطة الفلسطينية. أعقاب ذلك الاتفاق كانت حكومة الوفاق قد أعلنت حلها قضية رواتب عشرات الآلاف من الموظفين الذين عُينوا بعد تولي حركة حماس الحكم في غزة، من موازنتها لعام 2018، وأعلنت الحكومة الفلسطينية أن حركة حماس أعاقت تمكين حكومة الوفاق في غزة. هدد زعيم حركة فتح، رئيس السلطة الفلسطينية، محمود عباس، في الشهر ذاته، باتخاذ مزيد من الإجراءات القانونية والمالية ضد حركة حماس ما لم تلتزم الأخيرة باتفاقيات المصالحة المتعاقبة، وتُمكن حكومة الوفاق من عملها في القطاع بشكل كامل وفعل حركة حماس فأكدت أنها سلمت بالفعل السيطرة الكاملة لحكومة الوفاق، والمعابر لأمن السلطة الفلسطينية، موجهة الاتهام لحركة فتح والسلطة الفلسطينية بالمماطلة في رفع ما وصفته بعقوباتها عن قطاع غزة. وقال القيادي في حركة حماس, أحمد يوسف لبي بي سي نحن التزمنا بكل ما علينا لتمكين حكومة الوفاق، وطرحنا إمكانية وجود طرف ثالث مكون إما من الإطار القيادي الفلسطيني المؤقت أو وفد من المصريين، للإقامة في قطاع غزة وليحكموا على مسألة التمكين من عدمها وبالمواصفات التي ترضي حركتي فتح وحماس.. التمكين موجود وهناك استحقاقات وذمم مالية للموظفين في عنق الحكومة يجب التعامل معها لضمان هذا التمكين أيضا، الحكومة وفتح في رام الله لديهم اعتراضات ويبدو أنهم غير راغبين بالقدوم وتحمل المسؤولية في قطاع غزة، فهم يواصلون التهرب ووضع الاشتراطات على حركة حماس\"\nVeriUsAPI.arabic_summary(text)\n{'result': 'كانت حادثة استهداف موكب رئيس الوزراء الفلسطيني، رامي الحمد الله، في قطاع غزة خلال شهر مارس/ آذار الماضي، صادمة للشارع الفلسطيني، وأصابت جهد تحقيق المصالحة الداخلية في مقتل، لا سيما بعدما تلاها من اتهام السلطة الفلسطينية المباشر لحركة حماس بوقوفها خلف الحادث .وجاءت الزيارة في حينه بعد إتمام اتفاق بين حركتي فتح وحماس وبحضور الجانب المصري في القاهرة في أكتوبر / تشرين الأول من عام 2017، والذي نص على تسليم حكومة الوفاق مهامها في وزارات ومؤسسات قطاع غزة، وتسليم المعابر لأمن السلطة الفلسطينية.'}\n</code></pre>\n<hr>\n<h2>Arabic Keyword Extraction</h2>\n<p><strong>Identify terms that best describe the subject of a document in Arabic</strong></p>\n<p><strong>Usage:</strong></p>\n<pre><code>text = \"كانت حادثة استهداف موكب رئيس الوزراء الفلسطيني، رامي الحمد الله، في قطاع غزة خلال شهر مارس/ آذار الماضي، صادمة للشارع الفلسطيني، وأصابت جهد تحقيق المصالحة الداخلية في مقتل، لا سيما بعدما تلاها من اتهام السلطة الفلسطينية المباشر لحركة حماس بوقوفها خلف الحادث .وجاءت الزيارة في حينه بعد إتمام اتفاق بين حركتي فتح وحماس وبحضور الجانب المصري في القاهرة في أكتوبر / تشرين الأول من عام 2017، والذي نص على تسليم حكومة الوفاق مهامها في وزارات ومؤسسات قطاع غزة، وتسليم المعابر لأمن السلطة الفلسطينية. أعقاب ذلك الاتفاق كانت حكومة الوفاق قد أعلنت حلها قضية رواتب عشرات الآلاف من الموظفين الذين عُينوا بعد تولي حركة حماس الحكم في غزة، من موازنتها لعام 2018، وأعلنت الحكومة الفلسطينية أن حركة حماس أعاقت تمكين حكومة الوفاق في غزة. هدد زعيم حركة فتح، رئيس السلطة الفلسطينية، محمود عباس، في الشهر ذاته، باتخاذ مزيد من الإجراءات القانونية والمالية ضد حركة حماس ما لم تلتزم الأخيرة باتفاقيات المصالحة المتعاقبة، وتُمكن حكومة الوفاق من عملها في القطاع بشكل كامل وفعل حركة حماس فأكدت أنها سلمت بالفعل السيطرة الكاملة لحكومة الوفاق، والمعابر لأمن السلطة الفلسطينية، موجهة الاتهام لحركة فتح والسلطة الفلسطينية بالمماطلة في رفع ما وصفته بعقوباتها عن قطاع غزة. وقال القيادي في حركة حماس, أحمد يوسف لبي بي سي نحن التزمنا بكل ما علينا لتمكين حكومة الوفاق، وطرحنا إمكانية وجود طرف ثالث مكون إما من الإطار القيادي الفلسطيني المؤقت أو وفد من المصريين، للإقامة في قطاع غزة وليحكموا على مسألة التمكين من عدمها وبالمواصفات التي ترضي حركتي فتح وحماس.. التمكين موجود وهناك استحقاقات وذمم مالية للموظفين في عنق الحكومة يجب التعامل معها لضمان هذا التمكين أيضا، الحكومة وفتح في رام الله لديهم اعتراضات ويبدو أنهم غير راغبين بالقدوم وتحمل المسؤولية في قطاع غزة، فهم يواصلون التهرب ووضع الاشتراطات على حركة حماس\"\nVeriUsAPI.arabic_keywords(text)\n{'result': 'حكومة حركة لحرك حماس الفلسطيني حكوم وفاق حرك فتح حماس وأعلن حكومة تمكين لتمكين التمكين السلط فلسطينية المصالحة وفعل بالفعل والسلطة غزة والمالية مالية الله رئيس حينه الحكم الحمد أحمد بعدم لاها بالقدوم حمل التهرب وضع ذ اتخاذ أعلنت عدم'}\n</code></pre>\n\n          </div>"}, "last_serial": 6193096, "releases": {"0.0.11": [{"comment_text": "", "digests": {"md5": "7df8dc86b8a665f7da67a0a892b8c87b", "sha256": "9b933182538f83243e6d7fed6c94e11b0b8a453f2cb6c7ea65b2f3e6716739c3"}, "downloads": -1, "filename": "veriusapigateway-0.0.11-py3-none-any.whl", "has_sig": false, "md5_digest": "7df8dc86b8a665f7da67a0a892b8c87b", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 3001, "upload_time": "2018-09-13T10:47:24", "upload_time_iso_8601": "2018-09-13T10:47:24.812819Z", "url": "https://files.pythonhosted.org/packages/c5/58/5de752cb991664a925e0d22caaf9095ad7fd61f61d8ecdafa1321518a2cf/veriusapigateway-0.0.11-py3-none-any.whl", "yanked": false}], "0.0.12": [{"comment_text": "", "digests": {"md5": "198c6e65cd4c5cf73ca3815cf8bb6f6c", "sha256": "8485569e27223eb644da5c1ecaae96baf02797619985c107f4d569d02c02def8"}, "downloads": -1, "filename": "veriusapigateway-0.0.12-py3-none-any.whl", "has_sig": false, "md5_digest": "198c6e65cd4c5cf73ca3815cf8bb6f6c", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 5999, "upload_time": "2018-09-14T14:18:36", "upload_time_iso_8601": "2018-09-14T14:18:36.117867Z", "url": "https://files.pythonhosted.org/packages/e5/a8/ed54977972af58599686788065a6975a47aa0b454c0ecb6ebc6064ad78bb/veriusapigateway-0.0.12-py3-none-any.whl", "yanked": false}], "0.0.13": [{"comment_text": "", "digests": {"md5": "0e0cbb7db9b10ec85aae1994941378f6", "sha256": "fde667cde4d5188879c96437ddab8361d30e46c06e2dcbee5ef053786339fe7e"}, "downloads": -1, "filename": "veriusapigateway-0.0.13-py3-none-any.whl", "has_sig": false, "md5_digest": "0e0cbb7db9b10ec85aae1994941378f6", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 6902, "upload_time": "2018-11-06T09:13:09", "upload_time_iso_8601": "2018-11-06T09:13:09.170191Z", "url": "https://files.pythonhosted.org/packages/87/f8/a4480d28c444798294e13cfa603ae01096b03b324420bb1def19547055e4/veriusapigateway-0.0.13-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "bdf9291449afe013e53be185c6a44e15", "sha256": "e090f24b895018cfe5191dcd2a11dcc8eef0ebf49deec4b3e6888f260dea8284"}, "downloads": -1, "filename": "veriusapigateway-0.0.13.tar.gz", "has_sig": false, "md5_digest": "bdf9291449afe013e53be185c6a44e15", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6180, "upload_time": "2018-11-06T09:13:11", "upload_time_iso_8601": "2018-11-06T09:13:11.895632Z", "url": "https://files.pythonhosted.org/packages/62/14/efefe2c68ef596ed63626168470f349a9730b3a73f1ed24b78b3bf2b9173/veriusapigateway-0.0.13.tar.gz", "yanked": false}], "0.0.14": [{"comment_text": "", "digests": {"md5": "68f51356bdd4aa54eb3f32670d5dfe62", "sha256": "5e8e02f55373db84f805aeb9aa669a90e0da8d570e9878df34fae3c562d6cd04"}, "downloads": -1, "filename": "veriusapigateway-0.0.14-py3-none-any.whl", "has_sig": false, "md5_digest": "68f51356bdd4aa54eb3f32670d5dfe62", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 6919, "upload_time": "2018-11-14T08:03:25", "upload_time_iso_8601": "2018-11-14T08:03:25.137586Z", "url": "https://files.pythonhosted.org/packages/84/2b/e83136c8e3da77f53079a08402d4a2231bd00e0fe5784b0daa599a36c02d/veriusapigateway-0.0.14-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f1d0e062b96901ad998f50ed1f831d77", "sha256": "902c654eb2ccced08d9053eed77ee9ab2a88cc463876eba95c97e5fd13d98cb8"}, "downloads": -1, "filename": "veriusapigateway-0.0.14.tar.gz", "has_sig": false, "md5_digest": "f1d0e062b96901ad998f50ed1f831d77", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6200, "upload_time": "2018-11-14T08:03:27", "upload_time_iso_8601": "2018-11-14T08:03:27.891800Z", "url": "https://files.pythonhosted.org/packages/cc/77/1c7e937a6da2bdc4bf561525a1374aed8c3529ecae3c47950243ca53e2e5/veriusapigateway-0.0.14.tar.gz", "yanked": false}], "0.0.15": [{"comment_text": "", "digests": {"md5": "91e081f3f3a48f3515dc47749add6384", "sha256": "6252e4657ddc18a9b7b7ae2d58c54d0e18d6d3bb2d459113b44a2aa955fab025"}, "downloads": -1, "filename": "veriusapigateway-0.0.15-py3-none-any.whl", "has_sig": false, "md5_digest": "91e081f3f3a48f3515dc47749add6384", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 6577, "upload_time": "2018-11-14T12:39:36", "upload_time_iso_8601": "2018-11-14T12:39:36.900020Z", "url": "https://files.pythonhosted.org/packages/20/3c/4835ccd6f300e9e0e66683b3817ae61e21ef16040657e7b96f51c41b0cea/veriusapigateway-0.0.15-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "9cfa2212e3f57f0c64e4eff48ef7ec46", "sha256": "1178ca0fa8a702da67c5b631410018d587d96e24884d53868530d402816c7326"}, "downloads": -1, "filename": "veriusapigateway-0.0.15.tar.gz", "has_sig": false, "md5_digest": "9cfa2212e3f57f0c64e4eff48ef7ec46", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5898, "upload_time": "2018-11-14T12:39:38", "upload_time_iso_8601": "2018-11-14T12:39:38.428926Z", "url": "https://files.pythonhosted.org/packages/f1/bc/f8b4b864e98d739714468e9adcaf3123890c7a42a12e4786b05d9175e48d/veriusapigateway-0.0.15.tar.gz", "yanked": false}], "0.0.16": [{"comment_text": "", "digests": {"md5": "6ebb57eb1160d57f9d3631d115ee4a8a", "sha256": "6c1ffc81d9b06c797631eb7d8d943d0d04f2341d415eb9c831cf0e8be64ff287"}, "downloads": -1, "filename": "veriusapigateway-0.0.16-py3-none-any.whl", "has_sig": false, "md5_digest": "6ebb57eb1160d57f9d3631d115ee4a8a", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 6849, "upload_time": "2018-11-15T12:10:39", "upload_time_iso_8601": "2018-11-15T12:10:39.001434Z", "url": "https://files.pythonhosted.org/packages/a8/cc/4e99593f7b395ec7114d5acd3ebfdce19bedfd48b2375b7390e65a48bda3/veriusapigateway-0.0.16-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "01334ae5181344aebf13cb4218a4edda", "sha256": "342c54fb5190023ba1324c31128389352e7271efb6b854014a8160feac60e883"}, "downloads": -1, "filename": "veriusapigateway-0.0.16.tar.gz", "has_sig": false, "md5_digest": "01334ae5181344aebf13cb4218a4edda", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6246, "upload_time": "2018-11-15T12:10:40", "upload_time_iso_8601": "2018-11-15T12:10:40.533753Z", "url": "https://files.pythonhosted.org/packages/35/46/169fa3e4048c960b1d9b47574f59579e875a8601e41d03d21d0a1388149b/veriusapigateway-0.0.16.tar.gz", "yanked": false}], "0.0.17": [{"comment_text": "", "digests": {"md5": "33ee8ecc0b231f6dbb1daa7933673c05", "sha256": "4be8d929a64585e48a330861f12d06f0b1cb42e06e2254bf78b8251ec05f3c42"}, "downloads": -1, "filename": "veriusapigateway-0.0.17-py3-none-any.whl", "has_sig": false, "md5_digest": "33ee8ecc0b231f6dbb1daa7933673c05", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 6928, "upload_time": "2018-11-23T10:15:44", "upload_time_iso_8601": "2018-11-23T10:15:44.156047Z", "url": "https://files.pythonhosted.org/packages/7b/86/d940df3e5a3606ec3b4a25b64cffa469c4dab2193662496c5596eee743fe/veriusapigateway-0.0.17-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "3e19d504244c7b6a8c94c0006a7a3f83", "sha256": "093a53486f6eaac9be612e1695b2b5997f46845940e22bf4cfc80fd4d02b050e"}, "downloads": -1, "filename": "veriusapigateway-0.0.17.tar.gz", "has_sig": false, "md5_digest": "3e19d504244c7b6a8c94c0006a7a3f83", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 6355, "upload_time": "2018-11-23T10:15:45", "upload_time_iso_8601": "2018-11-23T10:15:45.690490Z", "url": "https://files.pythonhosted.org/packages/4c/d0/3b0b7bb546998441d18c76e876bfa9b0b9de9eba447f4c2c12ffbe151bea/veriusapigateway-0.0.17.tar.gz", "yanked": false}], "0.0.18": [{"comment_text": "", "digests": {"md5": "1c8c26b5efbff7df7dc8ba0bbdd12335", "sha256": "043a6ef94819661cb16ea59299f30c6a81716ac91fe6862bda3781f0e191c54a"}, "downloads": -1, "filename": "veriusapigateway-0.0.18-py3-none-any.whl", "has_sig": false, "md5_digest": "1c8c26b5efbff7df7dc8ba0bbdd12335", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 6484, "upload_time": "2018-12-25T09:21:12", "upload_time_iso_8601": "2018-12-25T09:21:12.982245Z", "url": "https://files.pythonhosted.org/packages/d2/a9/a2681a27752fbda950ae6dece3e1dcb442c8aa1107cd5af6e450e796125c/veriusapigateway-0.0.18-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "8efc751b28944c93ab39a10227cc2b68", "sha256": "334da7d7e7e92c4b00b3806a2eb50d128fa28e55c9a9c61650e3288432635422"}, "downloads": -1, "filename": "veriusapigateway-0.0.18.tar.gz", "has_sig": false, "md5_digest": "8efc751b28944c93ab39a10227cc2b68", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5862, "upload_time": "2018-12-25T09:21:14", "upload_time_iso_8601": "2018-12-25T09:21:14.925698Z", "url": "https://files.pythonhosted.org/packages/8d/ea/19b24392f88ea771ec900d4c07145310582c3783732bb7a66cdd3db8a5b1/veriusapigateway-0.0.18.tar.gz", "yanked": false}], "0.0.19": [{"comment_text": "", "digests": {"md5": "3098452d0f7fc1905f0bc29cfe56b9c5", "sha256": "0e4c82f601da1f06c84a7fe3ecae4090697235d9b14b9d41f0dbb24f5adcb8b6"}, "downloads": -1, "filename": "veriusapigateway-0.0.19-py3-none-any.whl", "has_sig": false, "md5_digest": "3098452d0f7fc1905f0bc29cfe56b9c5", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 6476, "upload_time": "2019-01-03T11:42:41", "upload_time_iso_8601": "2019-01-03T11:42:41.827597Z", "url": "https://files.pythonhosted.org/packages/cd/77/d04a4e97c2bd65dc5cb8b0252ea2c1bf86cd70e626977688af805f10556e/veriusapigateway-0.0.19-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "f74fe32ffec425240fc7ba7c4260a831", "sha256": "a0b4f4fa1da53a3e26cc51f51f6e386f6319f44037e7199738a26957de6a2d4a"}, "downloads": -1, "filename": "veriusapigateway-0.0.19.tar.gz", "has_sig": false, "md5_digest": "f74fe32ffec425240fc7ba7c4260a831", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 5856, "upload_time": "2019-01-03T11:42:43", "upload_time_iso_8601": "2019-01-03T11:42:43.762547Z", "url": "https://files.pythonhosted.org/packages/25/5a/7b56bd77794b1e3749a882ed4ec335e801ab42e143aa7525618cbf78dd81/veriusapigateway-0.0.19.tar.gz", "yanked": false}], "0.0.20": [{"comment_text": "", "digests": {"md5": "943082b8cff6c46fa47697743e4ec9cb", "sha256": "3bb1b2cccdf7953d4f9ac9add6d789cee799e707deee2f8c7b3957b724527c95"}, "downloads": -1, "filename": "veriusapigateway-0.0.20-py3-none-any.whl", "has_sig": false, "md5_digest": "943082b8cff6c46fa47697743e4ec9cb", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 8273, "upload_time": "2019-05-08T10:28:44", "upload_time_iso_8601": "2019-05-08T10:28:44.442544Z", "url": "https://files.pythonhosted.org/packages/e2/28/a90a1b078ae1c33f7e6814a58d234ef537596949a875cc7b4d97b63819d7/veriusapigateway-0.0.20-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "8c822384de7b496d71a30d6f30f6007e", "sha256": "a66502af4d85de341e8ea49daf4d01e80ac8a6ab2a76ed83fca4aa462232e87e"}, "downloads": -1, "filename": "veriusapigateway-0.0.20.tar.gz", "has_sig": false, "md5_digest": "8c822384de7b496d71a30d6f30f6007e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8776, "upload_time": "2019-05-08T10:28:46", "upload_time_iso_8601": "2019-05-08T10:28:46.534999Z", "url": "https://files.pythonhosted.org/packages/ab/d4/5da25b8d0b5612daaf0b4a50a6eee59229340decf13d3ab9e0b92e4750af/veriusapigateway-0.0.20.tar.gz", "yanked": false}], "0.1.0": [{"comment_text": "", "digests": {"md5": "e65cf04cf981bef0d9964a008f8f2038", "sha256": "30143f3b503ce2ae54ff3d12941690eea05cb72cdc48bbc9f0bf834ae6f0e8b6"}, "downloads": -1, "filename": "veriusapigateway-0.1.0-py3-none-any.whl", "has_sig": false, "md5_digest": "e65cf04cf981bef0d9964a008f8f2038", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 8317, "upload_time": "2019-07-25T11:48:43", "upload_time_iso_8601": "2019-07-25T11:48:43.809573Z", "url": "https://files.pythonhosted.org/packages/dd/56/e5649a41d8179e05698d33a27972252b642087131a44ae78b1c7fcd8d23d/veriusapigateway-0.1.0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "345f7ee09f38611555b62ab3c5417a18", "sha256": "5d8c669f0c567c8e33cf5bec1fff944b036166c6a25205fd1e58e83bec579497"}, "downloads": -1, "filename": "veriusapigateway-0.1.0.tar.gz", "has_sig": false, "md5_digest": "345f7ee09f38611555b62ab3c5417a18", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8641, "upload_time": "2019-07-25T11:48:46", "upload_time_iso_8601": "2019-07-25T11:48:46.216966Z", "url": "https://files.pythonhosted.org/packages/43/70/a2d5c5fd7ce2f326643b2467067219318c528efef9b73dd983f47f7bdd38/veriusapigateway-0.1.0.tar.gz", "yanked": false}], "0.1.1": [{"comment_text": "", "digests": {"md5": "fe2fff97970330c61ac72f0ab21767e0", "sha256": "d1560f043bd2e85aeb8e5b940c755e9e8d946b0cf9661ae3e2e2b8b81fd4d3ec"}, "downloads": -1, "filename": "veriusapigateway-0.1.1-py3-none-any.whl", "has_sig": false, "md5_digest": "fe2fff97970330c61ac72f0ab21767e0", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 7951, "upload_time": "2019-08-07T10:18:04", "upload_time_iso_8601": "2019-08-07T10:18:04.814740Z", "url": "https://files.pythonhosted.org/packages/db/2e/d5c0605b6e04c630bef4ac5dfbce246411f4e2f81f6a4d00e4c4e4cc0311/veriusapigateway-0.1.1-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "8c6e27e31643e7b133c024ee8c148d6d", "sha256": "59fcd4467be62775bd92a6e3674ac590d75e7fabe9e474fb90addf78d117c410"}, "downloads": -1, "filename": "veriusapigateway-0.1.1.tar.gz", "has_sig": false, "md5_digest": "8c6e27e31643e7b133c024ee8c148d6d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8131, "upload_time": "2019-08-07T10:18:06", "upload_time_iso_8601": "2019-08-07T10:18:06.853166Z", "url": "https://files.pythonhosted.org/packages/0c/1e/695d174a023316b58e9c22415949758a64ec1a748bac4f2a751eaf4219d4/veriusapigateway-0.1.1.tar.gz", "yanked": false}], "0.1.2": [{"comment_text": "", "digests": {"md5": "ad3718f4918947c37c9795409bd1e54d", "sha256": "fe6c1179ddf651627ca4d4ce81ef26dc98a1973ceb9379336b0f1b53fe4e6e35"}, "downloads": -1, "filename": "veriusapigateway-0.1.2-py3-none-any.whl", "has_sig": false, "md5_digest": "ad3718f4918947c37c9795409bd1e54d", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 7963, "upload_time": "2019-09-04T12:22:33", "upload_time_iso_8601": "2019-09-04T12:22:33.834268Z", "url": "https://files.pythonhosted.org/packages/d1/d8/f81318e87b5a587e78f98a0254517c1c50bceed465b1930d220007de9e91/veriusapigateway-0.1.2-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "98320a2e7d5cbd7c972b7e75843030f5", "sha256": "e989f911400b152cac30427dcba743316a5474efadc76601e9146d36064bf052"}, "downloads": -1, "filename": "veriusapigateway-0.1.2.tar.gz", "has_sig": false, "md5_digest": "98320a2e7d5cbd7c972b7e75843030f5", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8144, "upload_time": "2019-09-04T12:22:35", "upload_time_iso_8601": "2019-09-04T12:22:35.684670Z", "url": "https://files.pythonhosted.org/packages/e9/22/8fce217aab5fdbaa4ef09c55a93c655f1dc8c85cda20c2dd52e9f86d6d5d/veriusapigateway-0.1.2.tar.gz", "yanked": false}], "0.1.3": [{"comment_text": "", "digests": {"md5": "606b6454f76ed97bceb41466b86f32d8", "sha256": "1e4d6940c15d7a7933b178d58778cb69104fa7271a20f45c022946aa08da95cf"}, "downloads": -1, "filename": "veriusapigateway-0.1.3-py3-none-any.whl", "has_sig": false, "md5_digest": "606b6454f76ed97bceb41466b86f32d8", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 7972, "upload_time": "2019-09-09T08:00:52", "upload_time_iso_8601": "2019-09-09T08:00:52.491929Z", "url": "https://files.pythonhosted.org/packages/a1/3d/5c2c121ab1c19711ca1e485cdfafa0cc0283100f15640d0c581df49cf2f4/veriusapigateway-0.1.3-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "a3d1e05035c22dbc85150d06a98d4f8a", "sha256": "5677c1e3554ccdf00b9796860ad4d91a63aa1035cbcc1c005d9e234bf62920f9"}, "downloads": -1, "filename": "veriusapigateway-0.1.3.tar.gz", "has_sig": false, "md5_digest": "a3d1e05035c22dbc85150d06a98d4f8a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 8164, "upload_time": "2019-09-09T08:00:54", "upload_time_iso_8601": "2019-09-09T08:00:54.430777Z", "url": "https://files.pythonhosted.org/packages/dd/a4/be7551796dd76ea5029236ec9d99f60621294e3bd7c97b0b03c6cdf8827a/veriusapigateway-0.1.3.tar.gz", "yanked": false}], "0.1.4": [{"comment_text": "", "digests": {"md5": "b1ed0073b31e304a29a861b550f324ec", "sha256": "cd1344575ec4433fcf52d9e695cc74fee7465b5fdff359eb5e390f452e50235d"}, "downloads": -1, "filename": "veriusapigateway-0.1.4-py3-none-any.whl", "has_sig": false, "md5_digest": "b1ed0073b31e304a29a861b550f324ec", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 9089, "upload_time": "2019-09-12T07:37:55", "upload_time_iso_8601": "2019-09-12T07:37:55.560242Z", "url": "https://files.pythonhosted.org/packages/65/ca/f6c70f00a009af1e11a4d77261ebe8900e5bdfbed2d2c2b5183d2ca6c21c/veriusapigateway-0.1.4-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "fd331671e0c9706199bffd72138e3259", "sha256": "28820ced1a0ab077cf98642f38ad24a4a805056330ef2fa068968c7c39d61eee"}, "downloads": -1, "filename": "veriusapigateway-0.1.4.tar.gz", "has_sig": false, "md5_digest": "fd331671e0c9706199bffd72138e3259", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 9945, "upload_time": "2019-09-12T07:37:57", "upload_time_iso_8601": "2019-09-12T07:37:57.400600Z", "url": "https://files.pythonhosted.org/packages/81/02/b611261b34abb455371b3e275cff88c652ec4e535fed70e853486e90fc8e/veriusapigateway-0.1.4.tar.gz", "yanked": false}], "0.1.5": [{"comment_text": "", "digests": {"md5": "c6983ddecb27465e4403b1f630a832f7", "sha256": "3a67b3750ff80206a5d9f8cbf25e958392a4127b46cc8a2cc73c2749007a47a1"}, "downloads": -1, "filename": "veriusapigateway-0.1.5-py3-none-any.whl", "has_sig": false, "md5_digest": "c6983ddecb27465e4403b1f630a832f7", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 9128, "upload_time": "2019-09-23T13:09:48", "upload_time_iso_8601": "2019-09-23T13:09:48.621169Z", "url": "https://files.pythonhosted.org/packages/a4/15/6095d91a7e6ffd5cd381e1b1754ee8e0860ea7484fdff7aa60c6f8107938/veriusapigateway-0.1.5-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "d79c648d3d53142549498820290ce20d", "sha256": "260b87b8fe5678af223a1f6f4e865deb5457c1078269a690f1b9aba90fb69555"}, "downloads": -1, "filename": "veriusapigateway-0.1.5.tar.gz", "has_sig": false, "md5_digest": "d79c648d3d53142549498820290ce20d", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10723, "upload_time": "2019-09-23T13:09:50", "upload_time_iso_8601": "2019-09-23T13:09:50.524864Z", "url": "https://files.pythonhosted.org/packages/8d/82/4a33722202076593912601610bd6906a80f6da2c01da1a176709258e0257/veriusapigateway-0.1.5.tar.gz", "yanked": false}], "0.1.6": [{"comment_text": "", "digests": {"md5": "d9e75e8e43394d047b8cda39622d1864", "sha256": "d3742d258ba7c8ac1c3876926b89610165e6cc080475f9945e2cca5a7db12ea8"}, "downloads": -1, "filename": "veriusapigateway-0.1.6-py3-none-any.whl", "has_sig": false, "md5_digest": "d9e75e8e43394d047b8cda39622d1864", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 9123, "upload_time": "2019-09-23T13:39:21", "upload_time_iso_8601": "2019-09-23T13:39:21.296976Z", "url": "https://files.pythonhosted.org/packages/5d/d2/749d3c75117de858077603ee3b65700a65bc3764da4c5a783d1076f0b2e4/veriusapigateway-0.1.6-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "cf14d64994e37a66b9a65cc34f1024b1", "sha256": "ba0976ef2f120ebbab01ed92f6911d01dc9132d17638aabf142afabb64e9fd7a"}, "downloads": -1, "filename": "veriusapigateway-0.1.6.tar.gz", "has_sig": false, "md5_digest": "cf14d64994e37a66b9a65cc34f1024b1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 10553, "upload_time": "2019-09-23T13:39:23", "upload_time_iso_8601": "2019-09-23T13:39:23.355921Z", "url": "https://files.pythonhosted.org/packages/e2/00/738a681c46f8b58dcf3ec89c62f26a0ba1ca38eb36a0d2bc4920a7a473f7/veriusapigateway-0.1.6.tar.gz", "yanked": false}], "0.1.7": [{"comment_text": "", "digests": {"md5": "8d127adb5bd92df83896c65eaeb1bdb7", "sha256": "4e7d37cbf6b33d2ace4467c2bedde5f323bacae3f5820dc135e1d89c5659feb7"}, "downloads": -1, "filename": "veriusapigateway-0.1.7-py3-none-any.whl", "has_sig": false, "md5_digest": "8d127adb5bd92df83896c65eaeb1bdb7", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 9328, "upload_time": "2019-11-21T06:58:45", "upload_time_iso_8601": "2019-11-21T06:58:45.075354Z", "url": "https://files.pythonhosted.org/packages/a0/de/4ab48dab233e3d2cd061e8b01d410296fa2c7a773fd5b02988e82ca7c4a9/veriusapigateway-0.1.7-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "7311c361b1aa0e6358691d9bd3c1c61a", "sha256": "65996824945694fd12f6ae5c9292f8335151fef35ce0caa2a4c6549c34cd1e27"}, "downloads": -1, "filename": "veriusapigateway-0.1.7.tar.gz", "has_sig": false, "md5_digest": "7311c361b1aa0e6358691d9bd3c1c61a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 11252, "upload_time": "2019-11-21T06:58:47", "upload_time_iso_8601": "2019-11-21T06:58:47.107298Z", "url": "https://files.pythonhosted.org/packages/dc/b6/20c3fc2856bd1e952a7d9043b54e6eeeb05452c9557e9788544ebdf6effb/veriusapigateway-0.1.7.tar.gz", "yanked": false}], "0.1.8": [{"comment_text": "", "digests": {"md5": "7fdfd80ad98d914bdd339ddce0affde6", "sha256": "6852d217bc3bf7cf0753bd6899b3180a2d75e8fca4c09afc8e1b2804653b5c2f"}, "downloads": -1, "filename": "veriusapigateway-0.1.8-py3-none-any.whl", "has_sig": false, "md5_digest": "7fdfd80ad98d914bdd339ddce0affde6", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 9349, "upload_time": "2019-11-25T10:01:11", "upload_time_iso_8601": "2019-11-25T10:01:11.406960Z", "url": "https://files.pythonhosted.org/packages/77/6e/ac8a05ab551cb9986b39c04312ba30f18923e8c199e09168ad28d1d9990e/veriusapigateway-0.1.8-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6cf2652de98f62ad856be1be58fb34e6", "sha256": "68594f14e57e574e0789a83cfd8fb91a00df81b1cff46c02a192e058dee1b96d"}, "downloads": -1, "filename": "veriusapigateway-0.1.8.tar.gz", "has_sig": false, "md5_digest": "6cf2652de98f62ad856be1be58fb34e6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12187, "upload_time": "2019-11-25T10:01:13", "upload_time_iso_8601": "2019-11-25T10:01:13.232350Z", "url": "https://files.pythonhosted.org/packages/96/0e/b96ac757c2ca417f92585f73769d0a2decd41bfbc9259c380168aa204ea5/veriusapigateway-0.1.8.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "7fdfd80ad98d914bdd339ddce0affde6", "sha256": "6852d217bc3bf7cf0753bd6899b3180a2d75e8fca4c09afc8e1b2804653b5c2f"}, "downloads": -1, "filename": "veriusapigateway-0.1.8-py3-none-any.whl", "has_sig": false, "md5_digest": "7fdfd80ad98d914bdd339ddce0affde6", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 9349, "upload_time": "2019-11-25T10:01:11", "upload_time_iso_8601": "2019-11-25T10:01:11.406960Z", "url": "https://files.pythonhosted.org/packages/77/6e/ac8a05ab551cb9986b39c04312ba30f18923e8c199e09168ad28d1d9990e/veriusapigateway-0.1.8-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "6cf2652de98f62ad856be1be58fb34e6", "sha256": "68594f14e57e574e0789a83cfd8fb91a00df81b1cff46c02a192e058dee1b96d"}, "downloads": -1, "filename": "veriusapigateway-0.1.8.tar.gz", "has_sig": false, "md5_digest": "6cf2652de98f62ad856be1be58fb34e6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12187, "upload_time": "2019-11-25T10:01:13", "upload_time_iso_8601": "2019-11-25T10:01:13.232350Z", "url": "https://files.pythonhosted.org/packages/96/0e/b96ac757c2ca417f92585f73769d0a2decd41bfbc9259c380168aa204ea5/veriusapigateway-0.1.8.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:36:46 2020"}