{"info": {"author": "Jimut Bahan Pal", "author_email": "jimutbahanpal@yahoo.com", "bugtrack_url": null, "classifiers": ["License :: OSI Approved :: MIT License", "Operating System :: OS Independent", "Programming Language :: Python :: 3"], "description": "# Wisp : A preference based location finder app\n\n\n```\n██╗    ██╗██╗███████╗██████╗       \n██║    ██║██║██╔════╝██╔══██╗       \n██║ █╗ ██║██║███████╗██████╔╝        \n██║███╗██║██║╚════██║██╔═══╝       \n╚███╔███╔╝██║███████║██║                 \n ╚══╝╚══╝ ╚═╝╚══════╝╚═╝     \t0.0.8-beta \n                                JIMUT(TM) \n```\n\n## Installation\n\n```\n$ git clone https://github.com/Jimut123/wisp\n$ cd wisp\n$ sudo pip install -r requirements.txt\n$ sudo python setup.py install\n$ wisp -h\nusage: wisp [-h] [-q] [-t {1,2,3}] [-v]\n\noptional arguments:\n  -h, --help            show this help message and exit\n  -q, --quiet           will not display anything in the terminal\n  -t {1,2,3}, --theme {1,2,3}\n                        to select theme [1] classic [2] light [3] dark\n  -v, -V, --version     displays version\n```\n\n\n\n## Credentials \n\nMake an account in [Foursquare](https://foursquare.com/) to get the key and ID, which is used for this application to fetch the data.\n\n\nMake a file secrets.txt with the following contents (not mandatory, only for using \"use default secrets\" button) on the directory which you want to run wisp:=>\n```\n{\n    \"client_id\":\"your-client-id here\",\n    \"client_secret\":\"your-client-secret here\"\n}\n```\n\n\n\n## Features\n\n* **WISP** comes in 3 themes :\n\n\n<table border=\"1px\" align=\"center\">\n    <tr>\n        <td align=\"center\">\n            <img src=\"img/classic_wisp_theme.png\" height=\"400px\" width=\"400px\" alt=\"classic -t 1\">\n        </td>\n        <td align=\"center\">\n            <img src=\"img/light_wisp_theme.png\" height=\"400px\" width=\"400px\" alt=\"light -t 2\">\n        </td align=\"center\">\n        <td>\n            <img src=\"img/dark_wisp_theme.png\" height=\"400px\" width=\"400px\" alt=\"light -t 3\">\n        </td>\n    </tr>\n    <tr>\n        <td align=\"center\">\n             -t 1\n        </td>\n        <td align=\"center\">\n             -t 2\n        </td>\n        <td align=\"center\">\n             -t 3\n        </td>\n    </tr>\n</table>\n\n* **WISP** have 5 maps, we can visualise it in any one of the five maps\n\n<table border=\"1px\">\n    <tr>\n        <td><img src=\"img/maps/kolkata_mb_4.png\" height=\"520px\" width=\"650px\" alt=\"map box - kolkata\"></td>\n        <td><img src=\"img/maps/kolkata_stamen_toner_4.png\" height=\"520px\" width=\"650px\" alt=\"stamen toner - kolkata\"></td>\n    </tr>\n    <tr>\n        <td align=\"center\"> <a href=\"https://cdn.staticaly.com/gh/Jimut123/prog_backups/8f93bfaf/python/wisp_things/test_scripts/maps/kolkata_mb_4.html\" target=\"_blank\" alt=\"mapbox bright \">Mapbox Bright - Kolkata with 4 preference </a></td>\n        <td align=\"center\"><a href=\"https://cdn.staticaly.com/gh/Jimut123/prog_backups/8f93bfaf/python/wisp_things/test_scripts/maps/kolkata_st_4.html\" target=\"_blank\" alt=\"stamen toner\"> Stamen Toner - Kolkata with 4 preference</a></td>\n    </tr>\n     <tr>\n        <td><img src=\"img/maps/kolkata_st_3.png\" height=\"520px\" width=\"650px\" alt=\"map box - kolkata\"></td>\n        <td><img src=\"img/maps/Pune_osm_4.png\" height=\"520px\" width=\"650px\" alt=\"stamen toner - kolkata\"></td>\n    </tr>\n    <tr>\n        <td align=\"center\"> <a href=\"https://cdn.staticaly.com/gh/Jimut123/prog_backups/8f93bfaf/python/wisp_things/test_scripts/maps/kolkata_st_3.html\" alt=\"stammen terrain\" target=\"_blank\">Stamen Terrain - Kolkata with 3 preference </a></td>\n        <td align=\"center\"> \n        <a href=\"https://cdn.staticaly.com/gh/Jimut123/prog_backups/8f93bfaf/python/wisp_things/test_scripts/maps/Pune_osm_4.html\" target=\"_blank\" alt=\"openstreet map\">OpenStreetMap - Pune with 4 preference </a></td>\n    </tr>\n    <tr>\n        <td colspan=\"2\" align=\"center\"><img src=\"img/maps/canada_mcr_5.png\" height=\"600px\" width=\"1000px\" alt=\"stamen toner - kolkata\"></td>\n    </tr>\n    <tr>\n        <td colspan=\"2\" align=\"center\"><a href=\"https://cdn.staticaly.com/gh/Jimut123/prog_backups/8f93bfaf/python/wisp_things/test_scripts/maps/canada_mcr_5.html\" target=\"_blank\" alt=\"mapbox canada\"> Mapbox Control Room - Canada with 5 preference </a></td>\n    </tr>\n</table>\n\n* We can save the map for later use by giving the name in 'save map as' entry.\n\n* We can pass optional arguments to keep the terminal clean ``` -q``` for quiet running of application.\n\n* We can also use a file named as [secrets.txt](secrets.txt), to store the foursquare ID and client ID in the folder where you are running the wisp application, so that you don't have to type this again and again, and use the button \"use default secrets\" to fill up the client ID and foursquare ID automatically. It is a simple JSON file, and just have to store the ID and secrets without any spaces.\n\n\n\n\n## Why WISP ?\n\nNow, what is the significance of the name wisp ?\n\nAccording to any standard dictionary, Wisp means :\n\n<img src=\"img/wisp_meaning.png\" alt=\"WISP MEANING\" align=\"center\" height=\"300px\" width=\"400px\">\n\n\nSo, it is \"a bunch of something\", in our case it is the bunch of data points, clustered as hotspots. This doesn't uses any advanced machine learning algorithm, but simple ```MarkerCluster()``` algorithm, built-in in Folium map API.\n\n## Video \n\n[![youtube-video](https://github.com/Jimut123/wisp/blob/master/img/wisp_yt.png)](https://www.youtube.com/watch?v=__q1H-RrCu8&t=0s)\n\n\n## Introduction\n\n#### Background\n\nWhile planning a tour to Pune in India, for the first time and we don’t know the best place according to our preferences and benefits. We may prefer to stay in a restaurant which is close to Market, or we may prefer cold breeze of a river or a lake. Yet, we may also like Park in our preferences or maybe Cafe or Dominoes for those who likes Pizza or Tea. We may have some other preferences or choices. So, what can we do? We can search the Internet and then research a bit, we may find some service providers or other groups where the people know the places according to the preference of the user. If one gets too lucky, they may have somebody known there, which is of course a local person to Pune who knows nook and corner of the city. The user, who wants to go for a vacation, might call his/her friend and may tell them to visit the best place, which is affordable for staying and which has the preferences according to the choices the users want and get their job done. But, in today’s busy world nobody cares to do such research and call friend, everybody is dependent on some application to find genuinely good places based on mass reviews from lot of local people. So, we come up with an application named Wisp **[1]**. It is a standalone application based on Python programming language. It eliminates the overhead of doing research of a place for finding the hot-spots according to their preferences, which uses clustering algorithm along with fetching data from a remote server and visualises it in map. We provided certain features in the application to save that map and use it for future. Since, data is the new oil, we use data from a rich community maintained Foursquare API to visualise our map. We also think that if we could promote the use of Foursquare API, more users would actually use and provide data to the API by giving reviews, comments, etc, which will in turn increase the data and content of the API. \n\n#### Objectives\n\nTo develop an application, we need to make it visually appealing [2] to the user and also we need to make it user friendly. Hence, we build Wisp, which can take parameters in text-box like - location of the place, which may be a city name, radius in meters from that city or location and number of preferences as input along with the client ID and the secrets of the API of Foursquare account to fetch the data from a remote server. The number of preferences creates a sub-form accordingly, and the data is inserted and map type is given as additional input. The data is fetched in JSON format, cleaned and plotted accordingly to the Folium Map. We can select a range of map present in the Folium library in Python. We can select any one of the map from, Mapbox Bright, Stamen Toner, Stamen Terrain, Open Street Map, Mapbox Control Room, and maps. After the data is cleaned and plotted, it is visualised using a custom made live http server in python. It is visualised in browser and we can also save the map for later use. The format for saving would be HTML, so that it could be used for future purposes. Here, we can zoom in the map to see the cluster vividly which breaks into sub cluster to choose our preferences.\n\n#### Purpose and Scope\n\nOur main objective is to save time and energy for researching a place and to find out the best location according to user preference. One could also get to know about a place by passing data and comparing places to choose their location easily. We make this software open source for our benefit and for its development in the near future. Development may be done in future in terms of visualisations, by building custom made libraries for Folium and particularly for this Wisp software. To use this application, we need to make an account in [foursquare.com](https://foursquare.com) **[3]** and get the necessary credentials for making JSON request using this application. Since, we use free data from Foursquare API, the premium data will unlock evidence for more places and more precise locations. It will give the app power to compute hot-spots for a wide variety of locations.\n\n\n## Survey of Technologies\n\nWe believe in the power and development of open source tools, technology and software. For this reason, we chose to use Python3 as a language for coding this application from scratch. The reason behind choosing python3 over other languages is, inter-alia, it can do rapid prototyping of almost any software from scratch. We can build anything from it in less time. It has a community of developers which provide support in every field. It also has too many libraries for making things much easier for everybody. Python is rich in its Machine learning libraries, cloud computing libraries, web development libraries, computer vision libraries etc. The code written in python runs on almost all three OS, i.e., Linux, Mac and Windows, provided the developer uses the common libraries, so transferring this software from one OS to another is not a problem in Python3. Since our application needs a GUI for user to input the raw data, we need a good data transfer library, a library for fast computation for doing machine learning stuffs and finally a browser to display the map. Python have all the libraries required for this project. We used here tkinter **[4]**, json, numpy, pandas, ipython and folium as libraries to build this application.\n\n\n## Requirement and Analysis\n\n####  Problem Definition\n\nOur goal is to create an application which acts as a bridge between the users and the data in raw format for plotting it in real time. We implemented command line arguments, for example passing an additional argument, such as –t 2 that will change the theme to light, or passing –t 3 will change the colour of the application to dark. We also provided usable and upgradable visually appealing GUI to perform necessary tasks required by the user. The data is fetched and processed, using one of the best libraries for data manipulation and conversion, named as Pandas. Moreover, we use Numpy for further cleaning and processing the data. The raw data is then fetched in JSON format, cleaned, and plotted to folium map. The map is then visualised in a custom made live http server. Consequently, we can save the map for later use too, by adding the text file name in the entry box in the GUI as an optional argument. We can select from a variety of Maps to visualise it according to our need.\n\n#### Requirements Specifications\n\nApart from using the inbuilt libraries present in ```Python3.7.2[GCC 8.2.1 20181127]``` we need the following libraries:\n```\nrequests==2.21.0\npandas==0.24.1\nfolium==0.7.0\ngeopy==1.18.1\nnumpy==1.16.1\nwget==3.2\ndatetime (latest inbuilt version)\nIPython (latest inbuilt version)\npip (latest inbuilt version)\n```\nThe version name doesn’t make any problems in the installation of the software, since the python packages are well version controlled and doesn’t create much problem in resolving dependency issues.\n\n#### Planning and Scheduling\n\nThough we have gone through a rigorous iterative process of planning and scheduling, nevertheless, this was the total time in designing the whole software. This is how we, in fact, completed the project as shown in **Fig 1**. The planning was done for a short period of time, the focus and emphasis was given in testing the software and making it upgradable after each of the test was passed. Many bugs were fixed and this software is now ready for production. After each planning and coding of the GUI part by part in modules, we upgraded it in each step, generating a version in each step. In total, we looped over 8 times and created a version named 0.0.8-beta, which is actually production stable. After designing the GUI, we added colours and arguments in the application and thought of other features which could be implemented to make it more innovative to work.\n\n<center><img src=\"img/planning.png\" height=\"400px\" width=\"800px\" alt=\"light -t 3\"></center>\n<center>Fig 1</center>\n\n\n#### Software and Hardware Requirements\n````\nWe tested this software on a machine with the following specifications:\nArchitecture:        x86_64\nCPU op-mode(s):      32-bit, 64-bit\nByte Order:          Little Endian\nAddress sizes:       39 bits physical, 48 bits virtual\nCPU(s):              4\nOn-line CPU(s) list: 0-3\nThread(s) per core:  2\nCore(s) per socket:  2\nSocket(s):           1\nNUMA node(s):        1\nVendor ID:           GenuineIntel\nCPU family:          6\nModel:               78\nModel name:          Intel(R) Core(TM) i5-6200U CPU @ 2.30GHz\nStepping:            3\nCPU MHz:             500.002\nCPU max MHz:         2800.0000\nCPU min MHz:         400.0000\nBogoMIPS:            4801.00\nVirtualization:      VT-x\nL1d cache:           32K\nL1i cache:           32K\nL2 cache:            256K\nL3 cache:            3072K\nNUMA node0 CPU(s):   0-3\nFlags: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush dts acpi mmx fxsr sse sse2 ss ht tm pbe syscall nx pdpe1gb rdtscp lm constant_tsc art arch_perfmon pebs bts rep_good nopl xtopology nonstop_tsc cpuid aperfmperf tsc_known_freq pni pclmulqdq dtes64 monitor ds_cpl vmx est tm2 ssse3 sdbg fma cx16 xtpr pdcm pcid sse4_1 sse4_2 x2apic movbe popcnt tsc_deadline_timer aes xsave avx f16c rdrand lahf_lm abm 3dnowprefetch cpuid_fault epb invpcid_single pti ssbd ibrs ibpb stibp tpr_shadow vnmi flexpriority ept vpid fsgsbase tsc_adjust bmi1 avx2 smep bmi2 erms invpcid mpx rdseed adx smap clflushopt intel_pt xsaveopt xsavec xgetbv1 xsaves dtherm ida arat pln pts hwp hwp_notify hwp_act_window hwp_epp flush_l1d\n````\n\n\n#### Preliminary Product Description\n\nWe built a full-fledged application for linux, which can take arguments for changing themes, saving maps for future use, take the necessary data for visualisation in a browser and cluster them according to the algorithm. We used the constant looping model for creating a prototype and checking it for errors and then upgrading the software in each loop for more features. We maintained a deadline to build the application. The latest application is 0.0.8-beta which is production stable. The application can take values for a major number of locations and visualise the map and also have legend for further reference in the map.\n\n#### Conceptual Models\nThough the application for Wisp is very simple, yet there are a lot of processes involved during the designing of the Wisp structure as shown in **Fig 2**. The user gives the credentials as data to the application, the application then issues a request to the remote server and gets the JSON formatted data as response. The data is then cleaned and used in the next step by further pre-processing. The actual folium map is then created and the legend is generated according to the data returned from the application. The map is then run on a browser and sent to the user as the final output of the application. The user then sees the map and decides the best place according to the Map’s cluster.\n\n<center><img src=\"img/model.png\" height=\"400px\" width=\"800px\" alt=\"light -t 3\"></center>\n<center>Fig 2</center>\n\n\n#### Conclusions\n\nWe have successfully built a console application with GUI and CLI which can take parameters as input for the location and give the output as hot-spot for each of the places in cluster in a browser. It eliminates the overhead of doing research of a place for finding the hot-spots according to their preferences and gives the output in real time\n\n## Scope\n\nThis software can be used for any number of preferences and for any location provided the data exists in [FourSquare API](https://foursquare.com/). The reason behind choosing foursquare API is that there is rich availability of data and a good community to update data.\n\n## Survey of Technologies\n\nWe have used python3 for building the software from scratch which includes many libraries. We have also used tkinter to build the custom-made GUI. It uses folium to plot the cluster in map, and foursquare API to collect the updated data for cleaning and then plotting.\n\n\n\n## References\n* [Jimut Bahan Pal, Ultimate Date Finder (Github)](https://github.com/Jimut123/ultimate_date_finder)\n* Coursera, IBM data science specialisation Course.\n* [Foursquare API](https://foursquare.com)\n* [Tkinter application](https://wiki.python.org/moin/TkInter)\n\n\n\n", "description_content_type": "text/markdown", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/Jimut123/wisp", "keywords": "", "license": "", "maintainer": "", "maintainer_email": "", "name": "wisp", "package_url": "https://pypi.org/project/wisp/", "platform": "", "project_url": "https://pypi.org/project/wisp/", "project_urls": {"Homepage": "https://github.com/Jimut123/wisp"}, "release_url": "https://pypi.org/project/wisp/0.0.8b0/", "requires_dist": ["requests", "pandas", "folium", "geopy", "numpy", "wget", "datetime", "IPython", "pip"], "requires_python": "", "summary": "A preference based location finder application", "version": "0.0.8b0", "yanked": false, "html_description": "<div class=\"project-description\">\n            <h1>Wisp : A preference based location finder app</h1>\n<pre><code>██╗    ██╗██╗███████╗██████╗       \n██║    ██║██║██╔════╝██╔══██╗       \n██║ █╗ ██║██║███████╗██████╔╝        \n██║███╗██║██║╚════██║██╔═══╝       \n╚███╔███╔╝██║███████║██║                 \n ╚══╝╚══╝ ╚═╝╚══════╝╚═╝     \t0.0.8-beta \n                                JIMUT(TM) \n</code></pre>\n<h2>Installation</h2>\n<pre><code>$ git clone https://github.com/Jimut123/wisp\n$ cd wisp\n$ sudo pip install -r requirements.txt\n$ sudo python setup.py install\n$ wisp -h\nusage: wisp [-h] [-q] [-t {1,2,3}] [-v]\n\noptional arguments:\n  -h, --help            show this help message and exit\n  -q, --quiet           will not display anything in the terminal\n  -t {1,2,3}, --theme {1,2,3}\n                        to select theme [1] classic [2] light [3] dark\n  -v, -V, --version     displays version\n</code></pre>\n<h2>Credentials</h2>\n<p>Make an account in <a href=\"https://foursquare.com/\" rel=\"nofollow\">Foursquare</a> to get the key and ID, which is used for this application to fetch the data.</p>\n<p>Make a file secrets.txt with the following contents (not mandatory, only for using \"use default secrets\" button) on the directory which you want to run wisp:=&gt;</p>\n<pre><code>{\n    \"client_id\":\"your-client-id here\",\n    \"client_secret\":\"your-client-secret here\"\n}\n</code></pre>\n<h2>Features</h2>\n<ul>\n<li><strong>WISP</strong> comes in 3 themes :</li>\n</ul>\n<table>\n    <tr>\n        <td align=\"center\">\n            <img alt=\"classic -t 1\" height=\"400px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/21705b6e5e3ef8651a0fd1ad285a0742eab49845/696d672f636c61737369635f776973705f7468656d652e706e67\" width=\"400px\">\n        </td>\n        <td align=\"center\">\n            <img alt=\"light -t 2\" height=\"400px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/49e2e79e537222eb241e53b11c5613594d7a46fd/696d672f6c696768745f776973705f7468656d652e706e67\" width=\"400px\">\n        </td>\n        <td>\n            <img alt=\"light -t 3\" height=\"400px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/63691fbb8a60fc5caed6054cef0903d45302b959/696d672f6461726b5f776973705f7468656d652e706e67\" width=\"400px\">\n        </td>\n    </tr>\n    <tr>\n        <td align=\"center\">\n             -t 1\n        </td>\n        <td align=\"center\">\n             -t 2\n        </td>\n        <td align=\"center\">\n             -t 3\n        </td>\n    </tr>\n</table>\n<ul>\n<li><strong>WISP</strong> have 5 maps, we can visualise it in any one of the five maps</li>\n</ul>\n<table>\n    <tr>\n        <td><img alt=\"map box - kolkata\" height=\"520px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/c3477bebd363bdb2bdd18d9fe47151ea7862693c/696d672f6d6170732f6b6f6c6b6174615f6d625f342e706e67\" width=\"650px\"></td>\n        <td><img alt=\"stamen toner - kolkata\" height=\"520px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/81eb33e697e45ec23c83809990924c41988fe045/696d672f6d6170732f6b6f6c6b6174615f7374616d656e5f746f6e65725f342e706e67\" width=\"650px\"></td>\n    </tr>\n    <tr>\n        <td align=\"center\"> <a href=\"https://cdn.staticaly.com/gh/Jimut123/prog_backups/8f93bfaf/python/wisp_things/test_scripts/maps/kolkata_mb_4.html\" rel=\"nofollow\">Mapbox Bright - Kolkata with 4 preference </a></td>\n        <td align=\"center\"><a href=\"https://cdn.staticaly.com/gh/Jimut123/prog_backups/8f93bfaf/python/wisp_things/test_scripts/maps/kolkata_st_4.html\" rel=\"nofollow\"> Stamen Toner - Kolkata with 4 preference</a></td>\n    </tr>\n     <tr>\n        <td><img alt=\"map box - kolkata\" height=\"520px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/bdc6f5833e5c40dfa7ebbc6f4549a871aac67d4c/696d672f6d6170732f6b6f6c6b6174615f73745f332e706e67\" width=\"650px\"></td>\n        <td><img alt=\"stamen toner - kolkata\" height=\"520px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/4ea2df32cc81910748d5c8b958eb82d967d57132/696d672f6d6170732f50756e655f6f736d5f342e706e67\" width=\"650px\"></td>\n    </tr>\n    <tr>\n        <td align=\"center\"> <a href=\"https://cdn.staticaly.com/gh/Jimut123/prog_backups/8f93bfaf/python/wisp_things/test_scripts/maps/kolkata_st_3.html\" rel=\"nofollow\">Stamen Terrain - Kolkata with 3 preference </a></td>\n        <td align=\"center\"> \n        <a href=\"https://cdn.staticaly.com/gh/Jimut123/prog_backups/8f93bfaf/python/wisp_things/test_scripts/maps/Pune_osm_4.html\" rel=\"nofollow\">OpenStreetMap - Pune with 4 preference </a></td>\n    </tr>\n    <tr>\n        <td align=\"center\"><img alt=\"stamen toner - kolkata\" height=\"600px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/3e0efb216b8fceb433baf3f47c7323ee3101d2f8/696d672f6d6170732f63616e6164615f6d63725f352e706e67\" width=\"1000px\"></td>\n    </tr>\n    <tr>\n        <td align=\"center\"><a href=\"https://cdn.staticaly.com/gh/Jimut123/prog_backups/8f93bfaf/python/wisp_things/test_scripts/maps/canada_mcr_5.html\" rel=\"nofollow\"> Mapbox Control Room - Canada with 5 preference </a></td>\n    </tr>\n</table>\n<ul>\n<li>\n<p>We can save the map for later use by giving the name in 'save map as' entry.</p>\n</li>\n<li>\n<p>We can pass optional arguments to keep the terminal clean <code>-q</code> for quiet running of application.</p>\n</li>\n<li>\n<p>We can also use a file named as <a href=\"secrets.txt\" rel=\"nofollow\">secrets.txt</a>, to store the foursquare ID and client ID in the folder where you are running the wisp application, so that you don't have to type this again and again, and use the button \"use default secrets\" to fill up the client ID and foursquare ID automatically. It is a simple JSON file, and just have to store the ID and secrets without any spaces.</p>\n</li>\n</ul>\n<h2>Why WISP ?</h2>\n<p>Now, what is the significance of the name wisp ?</p>\n<p>According to any standard dictionary, Wisp means :</p>\n<img align=\"center\" alt=\"WISP MEANING\" height=\"300px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/216b5817f091b90b18fc2ec312d4a8109a41d862/696d672f776973705f6d65616e696e672e706e67\" width=\"400px\">\n<p>So, it is \"a bunch of something\", in our case it is the bunch of data points, clustered as hotspots. This doesn't uses any advanced machine learning algorithm, but simple <code>MarkerCluster()</code> algorithm, built-in in Folium map API.</p>\n<h2>Video</h2>\n<p><a href=\"https://www.youtube.com/watch?v=__q1H-RrCu8&amp;t=0s\" rel=\"nofollow\"><img alt=\"youtube-video\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/2a21faad1aac0b17bbd8dbdf6916bfde8b0f117b/68747470733a2f2f6769746875622e636f6d2f4a696d75743132332f776973702f626c6f622f6d61737465722f696d672f776973705f79742e706e67\"></a></p>\n<h2>Introduction</h2>\n<h4>Background</h4>\n<p>While planning a tour to Pune in India, for the first time and we don’t know the best place according to our preferences and benefits. We may prefer to stay in a restaurant which is close to Market, or we may prefer cold breeze of a river or a lake. Yet, we may also like Park in our preferences or maybe Cafe or Dominoes for those who likes Pizza or Tea. We may have some other preferences or choices. So, what can we do? We can search the Internet and then research a bit, we may find some service providers or other groups where the people know the places according to the preference of the user. If one gets too lucky, they may have somebody known there, which is of course a local person to Pune who knows nook and corner of the city. The user, who wants to go for a vacation, might call his/her friend and may tell them to visit the best place, which is affordable for staying and which has the preferences according to the choices the users want and get their job done. But, in today’s busy world nobody cares to do such research and call friend, everybody is dependent on some application to find genuinely good places based on mass reviews from lot of local people. So, we come up with an application named Wisp <strong>[1]</strong>. It is a standalone application based on Python programming language. It eliminates the overhead of doing research of a place for finding the hot-spots according to their preferences, which uses clustering algorithm along with fetching data from a remote server and visualises it in map. We provided certain features in the application to save that map and use it for future. Since, data is the new oil, we use data from a rich community maintained Foursquare API to visualise our map. We also think that if we could promote the use of Foursquare API, more users would actually use and provide data to the API by giving reviews, comments, etc, which will in turn increase the data and content of the API.</p>\n<h4>Objectives</h4>\n<p>To develop an application, we need to make it visually appealing [2] to the user and also we need to make it user friendly. Hence, we build Wisp, which can take parameters in text-box like - location of the place, which may be a city name, radius in meters from that city or location and number of preferences as input along with the client ID and the secrets of the API of Foursquare account to fetch the data from a remote server. The number of preferences creates a sub-form accordingly, and the data is inserted and map type is given as additional input. The data is fetched in JSON format, cleaned and plotted accordingly to the Folium Map. We can select a range of map present in the Folium library in Python. We can select any one of the map from, Mapbox Bright, Stamen Toner, Stamen Terrain, Open Street Map, Mapbox Control Room, and maps. After the data is cleaned and plotted, it is visualised using a custom made live http server in python. It is visualised in browser and we can also save the map for later use. The format for saving would be HTML, so that it could be used for future purposes. Here, we can zoom in the map to see the cluster vividly which breaks into sub cluster to choose our preferences.</p>\n<h4>Purpose and Scope</h4>\n<p>Our main objective is to save time and energy for researching a place and to find out the best location according to user preference. One could also get to know about a place by passing data and comparing places to choose their location easily. We make this software open source for our benefit and for its development in the near future. Development may be done in future in terms of visualisations, by building custom made libraries for Folium and particularly for this Wisp software. To use this application, we need to make an account in <a href=\"https://foursquare.com\" rel=\"nofollow\">foursquare.com</a> <strong>[3]</strong> and get the necessary credentials for making JSON request using this application. Since, we use free data from Foursquare API, the premium data will unlock evidence for more places and more precise locations. It will give the app power to compute hot-spots for a wide variety of locations.</p>\n<h2>Survey of Technologies</h2>\n<p>We believe in the power and development of open source tools, technology and software. For this reason, we chose to use Python3 as a language for coding this application from scratch. The reason behind choosing python3 over other languages is, inter-alia, it can do rapid prototyping of almost any software from scratch. We can build anything from it in less time. It has a community of developers which provide support in every field. It also has too many libraries for making things much easier for everybody. Python is rich in its Machine learning libraries, cloud computing libraries, web development libraries, computer vision libraries etc. The code written in python runs on almost all three OS, i.e., Linux, Mac and Windows, provided the developer uses the common libraries, so transferring this software from one OS to another is not a problem in Python3. Since our application needs a GUI for user to input the raw data, we need a good data transfer library, a library for fast computation for doing machine learning stuffs and finally a browser to display the map. Python have all the libraries required for this project. We used here tkinter <strong>[4]</strong>, json, numpy, pandas, ipython and folium as libraries to build this application.</p>\n<h2>Requirement and Analysis</h2>\n<h4>Problem Definition</h4>\n<p>Our goal is to create an application which acts as a bridge between the users and the data in raw format for plotting it in real time. We implemented command line arguments, for example passing an additional argument, such as –t 2 that will change the theme to light, or passing –t 3 will change the colour of the application to dark. We also provided usable and upgradable visually appealing GUI to perform necessary tasks required by the user. The data is fetched and processed, using one of the best libraries for data manipulation and conversion, named as Pandas. Moreover, we use Numpy for further cleaning and processing the data. The raw data is then fetched in JSON format, cleaned, and plotted to folium map. The map is then visualised in a custom made live http server. Consequently, we can save the map for later use too, by adding the text file name in the entry box in the GUI as an optional argument. We can select from a variety of Maps to visualise it according to our need.</p>\n<h4>Requirements Specifications</h4>\n<p>Apart from using the inbuilt libraries present in <code>Python3.7.2[GCC 8.2.1 20181127]</code> we need the following libraries:</p>\n<pre><code>requests==2.21.0\npandas==0.24.1\nfolium==0.7.0\ngeopy==1.18.1\nnumpy==1.16.1\nwget==3.2\ndatetime (latest inbuilt version)\nIPython (latest inbuilt version)\npip (latest inbuilt version)\n</code></pre>\n<p>The version name doesn’t make any problems in the installation of the software, since the python packages are well version controlled and doesn’t create much problem in resolving dependency issues.</p>\n<h4>Planning and Scheduling</h4>\n<p>Though we have gone through a rigorous iterative process of planning and scheduling, nevertheless, this was the total time in designing the whole software. This is how we, in fact, completed the project as shown in <strong>Fig 1</strong>. The planning was done for a short period of time, the focus and emphasis was given in testing the software and making it upgradable after each of the test was passed. Many bugs were fixed and this software is now ready for production. After each planning and coding of the GUI part by part in modules, we upgraded it in each step, generating a version in each step. In total, we looped over 8 times and created a version named 0.0.8-beta, which is actually production stable. After designing the GUI, we added colours and arguments in the application and thought of other features which could be implemented to make it more innovative to work.</p>\n&lt;center&gt;<img alt=\"light -t 3\" height=\"400px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/8986472103b24f20c26094e49f6e25f16f5eccb6/696d672f706c616e6e696e672e706e67\" width=\"800px\">&lt;/center&gt;\n&lt;center&gt;Fig 1&lt;/center&gt;\n<h4>Software and Hardware Requirements</h4>\n<pre><code>We tested this software on a machine with the following specifications:\nArchitecture:        x86_64\nCPU op-mode(s):      32-bit, 64-bit\nByte Order:          Little Endian\nAddress sizes:       39 bits physical, 48 bits virtual\nCPU(s):              4\nOn-line CPU(s) list: 0-3\nThread(s) per core:  2\nCore(s) per socket:  2\nSocket(s):           1\nNUMA node(s):        1\nVendor ID:           GenuineIntel\nCPU family:          6\nModel:               78\nModel name:          Intel(R) Core(TM) i5-6200U CPU @ 2.30GHz\nStepping:            3\nCPU MHz:             500.002\nCPU max MHz:         2800.0000\nCPU min MHz:         400.0000\nBogoMIPS:            4801.00\nVirtualization:      VT-x\nL1d cache:           32K\nL1i cache:           32K\nL2 cache:            256K\nL3 cache:            3072K\nNUMA node0 CPU(s):   0-3\nFlags: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush dts acpi mmx fxsr sse sse2 ss ht tm pbe syscall nx pdpe1gb rdtscp lm constant_tsc art arch_perfmon pebs bts rep_good nopl xtopology nonstop_tsc cpuid aperfmperf tsc_known_freq pni pclmulqdq dtes64 monitor ds_cpl vmx est tm2 ssse3 sdbg fma cx16 xtpr pdcm pcid sse4_1 sse4_2 x2apic movbe popcnt tsc_deadline_timer aes xsave avx f16c rdrand lahf_lm abm 3dnowprefetch cpuid_fault epb invpcid_single pti ssbd ibrs ibpb stibp tpr_shadow vnmi flexpriority ept vpid fsgsbase tsc_adjust bmi1 avx2 smep bmi2 erms invpcid mpx rdseed adx smap clflushopt intel_pt xsaveopt xsavec xgetbv1 xsaves dtherm ida arat pln pts hwp hwp_notify hwp_act_window hwp_epp flush_l1d\n</code></pre>\n<h4>Preliminary Product Description</h4>\n<p>We built a full-fledged application for linux, which can take arguments for changing themes, saving maps for future use, take the necessary data for visualisation in a browser and cluster them according to the algorithm. We used the constant looping model for creating a prototype and checking it for errors and then upgrading the software in each loop for more features. We maintained a deadline to build the application. The latest application is 0.0.8-beta which is production stable. The application can take values for a major number of locations and visualise the map and also have legend for further reference in the map.</p>\n<h4>Conceptual Models</h4>\n<p>Though the application for Wisp is very simple, yet there are a lot of processes involved during the designing of the Wisp structure as shown in <strong>Fig 2</strong>. The user gives the credentials as data to the application, the application then issues a request to the remote server and gets the JSON formatted data as response. The data is then cleaned and used in the next step by further pre-processing. The actual folium map is then created and the legend is generated according to the data returned from the application. The map is then run on a browser and sent to the user as the final output of the application. The user then sees the map and decides the best place according to the Map’s cluster.</p>\n&lt;center&gt;<img alt=\"light -t 3\" height=\"400px\" src=\"https://warehouse-camo.ingress.cmh1.psfhosted.org/1b04496ac7780e7a551f7f5aa32ec587ad907b09/696d672f6d6f64656c2e706e67\" width=\"800px\">&lt;/center&gt;\n&lt;center&gt;Fig 2&lt;/center&gt;\n<h4>Conclusions</h4>\n<p>We have successfully built a console application with GUI and CLI which can take parameters as input for the location and give the output as hot-spot for each of the places in cluster in a browser. It eliminates the overhead of doing research of a place for finding the hot-spots according to their preferences and gives the output in real time</p>\n<h2>Scope</h2>\n<p>This software can be used for any number of preferences and for any location provided the data exists in <a href=\"https://foursquare.com/\" rel=\"nofollow\">FourSquare API</a>. The reason behind choosing foursquare API is that there is rich availability of data and a good community to update data.</p>\n<h2>Survey of Technologies</h2>\n<p>We have used python3 for building the software from scratch which includes many libraries. We have also used tkinter to build the custom-made GUI. It uses folium to plot the cluster in map, and foursquare API to collect the updated data for cleaning and then plotting.</p>\n<h2>References</h2>\n<ul>\n<li><a href=\"https://github.com/Jimut123/ultimate_date_finder\" rel=\"nofollow\">Jimut Bahan Pal, Ultimate Date Finder (Github)</a></li>\n<li>Coursera, IBM data science specialisation Course.</li>\n<li><a href=\"https://foursquare.com\" rel=\"nofollow\">Foursquare API</a></li>\n<li><a href=\"https://wiki.python.org/moin/TkInter\" rel=\"nofollow\">Tkinter application</a></li>\n</ul>\n\n          </div>"}, "last_serial": 5108001, "releases": {"0.0.8b0": [{"comment_text": "", "digests": {"md5": "7e7c25a202f1f5473ecf73b31bdfbb71", "sha256": "19a499d1c33ef2316812d8744353dceaf742747852b215780133a0dccf33be4d"}, "downloads": -1, "filename": "wisp-0.0.8b0-py3-none-any.whl", "has_sig": false, "md5_digest": "7e7c25a202f1f5473ecf73b31bdfbb71", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 37610, "upload_time": "2019-04-06T18:51:19", "upload_time_iso_8601": "2019-04-06T18:51:19.141162Z", "url": "https://files.pythonhosted.org/packages/4e/3a/bbf66b5bd859fb503d0d8239b17c00d9142565e4db5ac0357631a451a82a/wisp-0.0.8b0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b8b71317e9cfdac60ee911aba1e9d0eb", "sha256": "894a8933605f327dc77f3d92337db28d24570d58cb80481a80b1333ed08a16c5"}, "downloads": -1, "filename": "wisp-0.0.8b0.tar.gz", "has_sig": false, "md5_digest": "b8b71317e9cfdac60ee911aba1e9d0eb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23257, "upload_time": "2019-04-06T18:51:21", "upload_time_iso_8601": "2019-04-06T18:51:21.775955Z", "url": "https://files.pythonhosted.org/packages/fb/0a/7c71b3a4a5601f544676fd8ee963cac4dc786cec0591243191107b93fdeb/wisp-0.0.8b0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "7e7c25a202f1f5473ecf73b31bdfbb71", "sha256": "19a499d1c33ef2316812d8744353dceaf742747852b215780133a0dccf33be4d"}, "downloads": -1, "filename": "wisp-0.0.8b0-py3-none-any.whl", "has_sig": false, "md5_digest": "7e7c25a202f1f5473ecf73b31bdfbb71", "packagetype": "bdist_wheel", "python_version": "py3", "requires_python": null, "size": 37610, "upload_time": "2019-04-06T18:51:19", "upload_time_iso_8601": "2019-04-06T18:51:19.141162Z", "url": "https://files.pythonhosted.org/packages/4e/3a/bbf66b5bd859fb503d0d8239b17c00d9142565e4db5ac0357631a451a82a/wisp-0.0.8b0-py3-none-any.whl", "yanked": false}, {"comment_text": "", "digests": {"md5": "b8b71317e9cfdac60ee911aba1e9d0eb", "sha256": "894a8933605f327dc77f3d92337db28d24570d58cb80481a80b1333ed08a16c5"}, "downloads": -1, "filename": "wisp-0.0.8b0.tar.gz", "has_sig": false, "md5_digest": "b8b71317e9cfdac60ee911aba1e9d0eb", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23257, "upload_time": "2019-04-06T18:51:21", "upload_time_iso_8601": "2019-04-06T18:51:21.775955Z", "url": "https://files.pythonhosted.org/packages/fb/0a/7c71b3a4a5601f544676fd8ee963cac4dc786cec0591243191107b93fdeb/wisp-0.0.8b0.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:28:35 2020"}