{"info": {"author": "Christophe-Marie Duquesne", "author_email": "chm.duquesne@gmail.com", "bugtrack_url": null, "classifiers": ["Development Status :: 3 - Alpha", "Environment :: Console", "Intended Audience :: Science/Research", "License :: OSI Approved", "Natural Language :: English", "Topic :: Scientific/Engineering :: Mathematics"], "description": "OVERVIEW\n========\n\nYaposib is a python binding to OSI, the Open Solver Interface from\nCOIN-OR. It intends to give access to various solvers through python.\nYaposib was created in order to be integrated in pulp-or\n(http://code.google.com/p/pulp-or).\n\nYAPOSIB PROJECT PAGE\n====================\n\nThe official project page has yet to move to coin-or.\n\nDOCUMENTATION\n=============\n\nThe documentation can be built with sphinx from the source. For your\nconvenience, it is also hosted on http://yaposib.readthedocs.org\n\nDEPENDENCIES\n============\n\nyaposib depends on\n- boost python http://www.boost.org\n- coin osi https://projects.coin-or.org/Osi\n\nINSTALLATION\n============\nTo build and install this package, just use pip or easy_install. You need\ngcc and boost::python.\n\nAdvanced configuration is possible: see the documentation for that.\n\nTESTING\n=======\n\nRun the executable that comes installed in the package\n    $ yaposib-config\n\nADDING TESTS\n============\nYaposib uses the unittest package. Adding tests is encouraged: To do so,\nedit the file yaposib/test/test_yaposib.py. Anything bug filed on the\nbugtracker should result (if possible) in a new test.\n\nBUGS\n====\nReport them on http://code.google.com/p/yaposib/issues/list", "description_content_type": null, "docs_url": null, "download_url": "UNKNOWN", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://code.google.code/p/yaposib/", "keywords": "Optimization,Linear Programming,Operations Research", "license": "Eclipse Public License -v 1.0\n\nTHE ACCOMPANYING PROGRAM IS PROVIDED UNDER THE TERMS OF THIS ECLIPSE\nPUBLIC LICENSE (\"AGREEMENT\"). ANY USE, REPRODUCTION OR DISTRIBUTION OF THE\nPROGRAM CONSTITUTES RECIPIENT'S ACCEPTANCE OF THIS AGREEMENT.\n\n1. DEFINITIONS\n\n\"Contribution\" means:\n\na) in the case of the initial Contributor, the initial code and\ndocumentation distributed under this Agreement, and\n\nb) in the case of each subsequent Contributor:\n\ni) changes to the Program, and\n\nii) additions to the Program;\n\nwhere such changes and/or additions to the Program originate from and are\ndistributed by that particular Contributor. A Contribution 'originates'\nfrom a Contributor if it was added to the Program by such Contributor\nitself or anyone acting on such Contributor's behalf. Contributions do not\ninclude additions to the Program which: (i) are separate modules of\nsoftware distributed in conjunction with the Program under their own\nlicense agreement, and (ii) are not derivative works of the Program.\n\n\"Contributor\" means any person or entity that distributes the Program.\n\n\"Licensed Patents \" mean patent claims licensable by a Contributor which\nare necessarily infringed by the use or sale of its Contribution alone or\nwhen combined with the Program.\n\n\"Program\" means the Contributions distributed in accordance with this\nAgreement.\n\n\"Recipient\" means anyone who receives the Program under this Agreement,\nincluding all Contributors.\n\n2. GRANT OF RIGHTS\n\na) Subject to the terms of this Agreement, each Contributor hereby grants\nRecipient a non-exclusive, worldwide, royalty-free copyright license to\nreproduce, prepare derivative works of, publicly display, publicly\nperform, distribute and sublicense the Contribution of such Contributor,\nif any, and such derivative works, in source code and object code form.\n\nb) Subject to the terms of this Agreement, each Contributor hereby grants\nRecipient a non-exclusive, worldwide, royalty-free patent license under\nLicensed Patents to make, use, sell, offer to sell, import and otherwise\ntransfer the Contribution of such Contributor, if any, in source code and\nobject code form. This patent license shall apply to the combination of\nthe Contribution and the Program if, at the time the Contribution is added\nby the Contributor, such addition of the Contribution causes such\ncombination to be covered by the Licensed Patents. The patent license\nshall not apply to any other combinations which include the Contribution.\nNo hardware per se is licensed hereunder.\n\nc) Recipient understands that although each Contributor grants the\nlicenses to its Contributions set forth herein, no assurances are provided\nby any Contributor that the Program does not infringe the patent or other\nintellectual property rights of any other entity. Each Contributor\ndisclaims any liability to Recipient for claims brought by any other\nentity based on infringement of intellectual property rights or otherwise.\nAs a condition to exercising the rights and licenses granted hereunder,\neach Recipient hereby assumes sole responsibility to secure any other\nintellectual property rights needed, if any. For example, if a third party\npatent license is required to allow Recipient to distribute the Program,\nit is Recipient's responsibility to acquire that license before\ndistributing the Program.\n\nd) Each Contributor represents that to its knowledge it has sufficient\ncopyright rights in its Contribution, if any, to grant the copyright\nlicense set forth in this Agreement.\n\n3. REQUIREMENTS\n\nA Contributor may choose to distribute the Program in object code form\nunder its own license agreement, provided that:\n\na) it complies with the terms and conditions of this Agreement; and\n\nb) its license agreement:\n\ni) effectively disclaims on behalf of all Contributors all warranties and\nconditions, express and implied, including warranties or conditions of\ntitle and non-infringement, and implied warranties or conditions of\nmerchantability and fitness for a particular purpose;\n\nii) effectively excludes on behalf of all Contributors all liability for\ndamages, including direct, indirect, special, incidental and consequential\ndamages, such as lost profits;\n\niii) states that any provisions which differ from this Agreement are\noffered by that Contributor alone and not by any other party; and\n\niv) states that source code for the Program is available from such\nContributor, and informs licensees how to obtain it in a reasonable manner\non or through a medium customarily used for software exchange.\n\nWhen the Program is made available in source code form:\n\na) it must be made available under this Agreement; and\n\nb) a copy of this Agreement must be included with each copy of the\nProgram.\n\nContributors may not remove or alter any copyright notices contained\nwithin the Program.\n\nEach Contributor must identify itself as the originator of its\nContribution, if any, in a manner that reasonably allows subsequent\nRecipients to identify the originator of the Contribution.\n\n4. COMMERCIAL DISTRIBUTION\n\nCommercial distributors of software may accept certain responsibilities\nwith respect to end users, business partners and the like. While this\nlicense is intended to facilitate the commercial use of the Program, the\nContributor who includes the Program in a commercial product offering\nshould do so in a manner which does not create potential liability for\nother Contributors. Therefore, if a Contributor includes the Program in a\ncommercial product offering, such Contributor (\"Commercial Contributor\")\nhereby agrees to defend and indemnify every other Contributor\n(\"Indemnified Contributor\") against any losses, damages and costs\n(collectively \"Losses\") arising from claims, lawsuits and other legal\nactions brought by a third party against the Indemnified Contributor to\nthe extent caused by the acts or omissions of such Commercial Contributor\nin connection with its distribution of the Program in a commercial product\noffering. The obligations in this section do not apply to any claims or\nLosses relating to any actual or alleged intellectual property\ninfringement. In order to qualify, an Indemnified Contributor must: a)\npromptly notify the Commercial Contributor in writing of such claim, and\nb) allow the Commercial Contributor to control, and cooperate with the\nCommercial Contributor in, the defense and any related settlement\nnegotiations. The Indemnified Contributor may participate in any such\nclaim at its own expense.\n\nFor example, a Contributor might include the Program in a commercial\nproduct offering, Product X. That Contributor is then a Commercial\nContributor. If that Commercial Contributor then makes performance claims,\nor offers warranties related to Product X, those performance claims and\nwarranties are such Commercial Contributor's responsibility alone. Under\nthis section, the Commercial Contributor would have to defend claims\nagainst the other Contributors related to those performance claims and\nwarranties, and if a court requires any other Contributor to pay any\ndamages as a result, the Commercial Contributor must pay those damages.\n\n5. NO WARRANTY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, THE PROGRAM IS PROVIDED\nON AN \"AS IS\" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, EITHER\nEXPRESS OR IMPLIED INCLUDING, WITHOUT LIMITATION, ANY WARRANTIES OR\nCONDITIONS OF TITLE, NON-INFRINGEMENT, MERCHANTABILITY OR FITNESS FOR A\nPARTICULAR PURPOSE. Each Recipient is solely responsible for determining\nthe appropriateness of using and distributing the Program and assumes all\nrisks associated with its exercise of rights under this Agreement ,\nincluding but not limited to the risks and costs of program errors,\ncompliance with applicable laws, damage to or loss of data, programs or\nequipment, and unavailability or interruption of operations.\n\n6. DISCLAIMER OF LIABILITY\n\nEXCEPT AS EXPRESSLY SET FORTH IN THIS AGREEMENT, NEITHER RECIPIENT NOR ANY\nCONTRIBUTORS SHALL HAVE ANY LIABILITY FOR ANY DIRECT, INDIRECT,\nINCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING\nWITHOUT LIMITATION LOST PROFITS), HOWEVER CAUSED AND ON ANY THEORY OF\nLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\nNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OR DISTRIBUTION\nOF THE PROGRAM OR THE EXERCISE OF ANY RIGHTS GRANTED HEREUNDER, EVEN IF\nADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n7. GENERAL\n\nIf any provision of this Agreement is invalid or unenforceable under\napplicable law, it shall not affect the validity or enforceability of the\nremainder of the terms of this Agreement, and without further action by\nthe parties hereto, such provision shall be reformed to the minimum extent\nnecessary to make such provision valid and enforceable.\n\nIf Recipient institutes patent litigation against any entity (including a\ncross-claim or counterclaim in a lawsuit) alleging that the Program itself\n(excluding combinations of the Program with other software or hardware)\ninfringes such Recipient's patent(s), then such Recipient's rights granted\nunder Section 2(b) shall terminate as of the date such litigation is\nfiled.\n\nAll Recipient's rights under this Agreement shall terminate if it fails to\ncomply with any of the material terms or conditions of this Agreement and\ndoes not cure such failure in a reasonable period of time after becoming\naware of such noncompliance. If all Recipient's rights under this\nAgreement terminate, Recipient agrees to cease use and distribution of the\nProgram as soon as reasonably practicable. However, Recipient's\nobligations under this Agreement and any licenses granted by Recipient\nrelating to the Program shall continue and survive.\n\nEveryone is permitted to copy and distribute copies of this Agreement, but\nin order to avoid inconsistency the Agreement is copyrighted and may only\nbe modified in the following manner. The Agreement Steward reserves the\nright to publish new versions (including revisions) of this Agreement from\ntime to time. No one other than the Agreement Steward has the right to\nmodify this Agreement. The Eclipse Foundation is the initial Agreement\nSteward. The Eclipse Foundation may assign the responsibility to serve as\nthe Agreement Steward to a suitable separate entity. Each new version of\nthe Agreement will be given a distinguishing version number. The Program\n(including Contributions) may always be distributed subject to the version\nof the Agreement under which it was received. In addition, after a new\nversion of the Agreement is published, Contributor may elect to distribute\nthe Program (including its Contributions) under the new version. Except as\nexpressly stated in Sections 2(a) and 2(b) above, Recipient receives no\nrights or licenses to the intellectual property of any Contributor under\nthis Agreement, whether expressly, by implication, estoppel or otherwise.\nAll rights in the Program not expressly granted under this Agreement are\nreserved.\n\nThis Agreement is governed by the laws of the State of New York and the\nintellectual property laws of the United States of America. No party to\nthis Agreement will bring a legal action under this Agreement more than\none year after the cause of action arose. Each party waives its rights to\na jury trial in any resulting litigation.", "maintainer": null, "maintainer_email": null, "name": "yaposib", "package_url": "https://pypi.org/project/yaposib/", "platform": "UNKNOWN", "project_url": "https://pypi.org/project/yaposib/", "project_urls": {"Download": "UNKNOWN", "Homepage": "https://code.google.code/p/yaposib/"}, "release_url": "https://pypi.org/project/yaposib/0.3.2/", "requires_dist": null, "requires_python": null, "summary": "Yaposib is a python binding to OSI, the Open Solver Interface from\nCOIN-OR. It intends to give access to various solvers through\npython. Yaposib was created in order to be integrated in pulp-or\n(http://code.google.com/p/pulp-or).", "version": "0.3.2", "yanked": false, "html_description": "<div class=\"project-description\">\n            <div id=\"overview\">\n<h2>OVERVIEW</h2>\n<p>Yaposib is a python binding to OSI, the Open Solver Interface from\nCOIN-OR. It intends to give access to various solvers through python.\nYaposib was created in order to be integrated in pulp-or\n(<a href=\"http://code.google.com/p/pulp-or\" rel=\"nofollow\">http://code.google.com/p/pulp-or</a>).</p>\n</div>\n<div id=\"yaposib-project-page\">\n<h2>YAPOSIB PROJECT PAGE</h2>\n<p>The official project page has yet to move to coin-or.</p>\n</div>\n<div id=\"documentation\">\n<h2>DOCUMENTATION</h2>\n<p>The documentation can be built with sphinx from the source. For your\nconvenience, it is also hosted on <a href=\"http://yaposib.readthedocs.org\" rel=\"nofollow\">http://yaposib.readthedocs.org</a></p>\n</div>\n<div id=\"dependencies\">\n<h2>DEPENDENCIES</h2>\n<p>yaposib depends on\n- boost python <a href=\"http://www.boost.org\" rel=\"nofollow\">http://www.boost.org</a>\n- coin osi <a href=\"https://projects.coin-or.org/Osi\" rel=\"nofollow\">https://projects.coin-or.org/Osi</a></p>\n</div>\n<div id=\"installation\">\n<h2>INSTALLATION</h2>\n<p>To build and install this package, just use pip or easy_install. You need\ngcc and boost::python.</p>\n<p>Advanced configuration is possible: see the documentation for that.</p>\n</div>\n<div id=\"testing\">\n<h2>TESTING</h2>\n<dl>\n<dt>Run the executable that comes installed in the package</dt>\n<dd>$ yaposib-config</dd>\n</dl>\n</div>\n<div id=\"adding-tests\">\n<h2>ADDING TESTS</h2>\n<p>Yaposib uses the unittest package. Adding tests is encouraged: To do so,\nedit the file yaposib/test/test_yaposib.py. Anything bug filed on the\nbugtracker should result (if possible) in a new test.</p>\n</div>\n<div id=\"bugs\">\n<h2>BUGS</h2>\n<p>Report them on <a href=\"http://code.google.com/p/yaposib/issues/list\" rel=\"nofollow\">http://code.google.com/p/yaposib/issues/list</a></p>\n</div>\n\n          </div>"}, "last_serial": 1010227, "releases": {"0.2.6": [], "0.2.7": [{"comment_text": "", "digests": {"md5": "6a2070c0a2244ee863e96d3814644969", "sha256": "0832075601f2d819e5f1bb0b8bb87d45f5ffa1e45315d503d7e92738a557b346"}, "downloads": -1, "filename": "yaposib-0.2.7.tar.gz", "has_sig": false, "md5_digest": "6a2070c0a2244ee863e96d3814644969", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 18672, "upload_time": "2011-11-30T17:59:06", "upload_time_iso_8601": "2011-11-30T17:59:06.994278Z", "url": "https://files.pythonhosted.org/packages/aa/a3/912db6f656f701633eaa60c65e258d51cef2ed6452819cd13af05c6b904b/yaposib-0.2.7.tar.gz", "yanked": false}], "0.2.71": [{"comment_text": "", "digests": {"md5": "56ea500e4adcfd3251ba3d33287eb6cf", "sha256": "4025ee2803d4dd2784d89526fe7378524e50014d2875f2b3cc23c1bd42aa343a"}, "downloads": -1, "filename": "yaposib-0.2.71.tar.gz", "has_sig": false, "md5_digest": "56ea500e4adcfd3251ba3d33287eb6cf", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 23945, "upload_time": "2011-11-30T18:05:09", "upload_time_iso_8601": "2011-11-30T18:05:09.849970Z", "url": "https://files.pythonhosted.org/packages/ab/da/1b9be0d818c29d9a22dd4cd06ea4a174536d0ca6ef8b1dd80f2203067871/yaposib-0.2.71.tar.gz", "yanked": false}], "0.2.72": [{"comment_text": "", "digests": {"md5": "f121e8c5f3ea1a18175d4c781cd7bede", "sha256": "0182a941562b0acce326d4059faf2aa4cbeaf556100932db89ed9a8f24380ec0"}, "downloads": -1, "filename": "yaposib-0.2.72.tar.gz", "has_sig": false, "md5_digest": "f121e8c5f3ea1a18175d4c781cd7bede", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 24261, "upload_time": "2011-11-30T18:06:10", "upload_time_iso_8601": "2011-11-30T18:06:10.993180Z", "url": "https://files.pythonhosted.org/packages/e0/2a/f1f87bb6a544c5481a895f11aee5abed2799f636e2ff79cab19f80d0bf7a/yaposib-0.2.72.tar.gz", "yanked": false}], "0.2.73": [{"comment_text": "", "digests": {"md5": "d2b3b142268d8d581a1ff93266811260", "sha256": "8ed43ed080da278b66fdc3c63ec0877808f735af7a2698e20c1efcce904d49bb"}, "downloads": -1, "filename": "yaposib-0.2.73.tar.gz", "has_sig": false, "md5_digest": "d2b3b142268d8d581a1ff93266811260", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 24361, "upload_time": "2011-11-30T18:09:32", "upload_time_iso_8601": "2011-11-30T18:09:32.548719Z", "url": "https://files.pythonhosted.org/packages/7e/f4/4ffaf0da740a654aa93a73c28b019f669a2891aa84b68bb161e3e2ad989f/yaposib-0.2.73.tar.gz", "yanked": false}], "0.2.74": [{"comment_text": "", "digests": {"md5": "41361dc464a986967440bc8c9451db4e", "sha256": "c196ee25d7f951b00fce47fb9fbf3b90e829f036c43e1c919cce677c8e07b810"}, "downloads": -1, "filename": "yaposib-0.2.74.tar.gz", "has_sig": false, "md5_digest": "41361dc464a986967440bc8c9451db4e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 27764, "upload_time": "2011-11-30T18:12:14", "upload_time_iso_8601": "2011-11-30T18:12:14.867670Z", "url": "https://files.pythonhosted.org/packages/22/48/64f634b820bdde616c831896ef2d44aef3f6e4a961d37c1f8106cf1d2f12/yaposib-0.2.74.tar.gz", "yanked": false}], "0.2.75": [{"comment_text": "", "digests": {"md5": "cfc43ae747d93543eed889e73b230524", "sha256": "a2063aaa673790d3c1bc986156dbc0097b1fbd75519204a6651b092464e61b3b"}, "downloads": -1, "filename": "yaposib-0.2.75-py2.7-linux-i686.egg", "has_sig": false, "md5_digest": "cfc43ae747d93543eed889e73b230524", "packagetype": "bdist_egg", "python_version": "2.7", "requires_python": null, "size": 13730193, "upload_time": "2011-12-01T16:34:04", "upload_time_iso_8601": "2011-12-01T16:34:04.223061Z", "url": "https://files.pythonhosted.org/packages/1e/83/5fa8eb5580f0429eb49928b8dbda9dc47bd5781f1728e0a03d95ad7ad52f/yaposib-0.2.75-py2.7-linux-i686.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "53457ceaf6c0f92190f2a3c57da0fa2c", "sha256": "966bb6fc56428c09f2bd0d199fb88a5063473b40536e31458cfbddfbfc2b2dbc"}, "downloads": -1, "filename": "yaposib-0.2.75-py2.7-linux-x86_64.egg", "has_sig": false, "md5_digest": "53457ceaf6c0f92190f2a3c57da0fa2c", "packagetype": "bdist_egg", "python_version": "2.7", "requires_python": null, "size": 13375186, "upload_time": "2011-12-01T16:30:38", "upload_time_iso_8601": "2011-12-01T16:30:38.077012Z", "url": "https://files.pythonhosted.org/packages/17/e6/fcc08e3da36f3cf2949091f06178c21b5f30bddff14a469b139afb268b86/yaposib-0.2.75-py2.7-linux-x86_64.egg", "yanked": false}, {"comment_text": "", "digests": {"md5": "78e835da0b03aa487b5cbbaf83ac79b3", "sha256": "a7bdd1d3472630745b6e66050d60686355993a2eb65228a1c5cab5c4db693e27"}, "downloads": -1, "filename": "yaposib-0.2.75.tar.gz", "has_sig": false, "md5_digest": "78e835da0b03aa487b5cbbaf83ac79b3", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 28723, "upload_time": "2011-11-30T19:26:30", "upload_time_iso_8601": "2011-11-30T19:26:30.128929Z", "url": "https://files.pythonhosted.org/packages/81/6c/2337f4e571c237cc1e4679922c2897bfdb22c116b9cb21b45a169fee052b/yaposib-0.2.75.tar.gz", "yanked": false}], "0.2.76": [{"comment_text": "", "digests": {"md5": "0f8b7ad8a077c940cdc7b238af3aed7a", "sha256": "4e5dc7461f6e51545d137c7ccb84b15be454611c2582b2d32b8a15745087d0c7"}, "downloads": -1, "filename": "yaposib-0.2.76.tar.gz", "has_sig": false, "md5_digest": "0f8b7ad8a077c940cdc7b238af3aed7a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 12531767, "upload_time": "2012-04-05T12:57:58", "upload_time_iso_8601": "2012-04-05T12:57:58.958378Z", "url": "https://files.pythonhosted.org/packages/3e/2e/e77aada80226ccd4f592a16cef38a6513d9574816574fc7e5281e8c9ac78/yaposib-0.2.76.tar.gz", "yanked": false}], "0.3.0": [{"comment_text": "", "digests": {"md5": "d0eea3a86680a7833d662c1318497c5c", "sha256": "efaf6b03a7e2197764020ddbe31582f524b46c82f875dce30d7fc0e696f40a77"}, "downloads": -1, "filename": "yaposib-0.3.0.tar.gz", "has_sig": false, "md5_digest": "d0eea3a86680a7833d662c1318497c5c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 25864, "upload_time": "2012-08-20T15:01:05", "upload_time_iso_8601": "2012-08-20T15:01:05.138619Z", "url": "https://files.pythonhosted.org/packages/84/2f/19097f0702985f928fd3d5de0a9ca850044459d94c0b489f86144dc90582/yaposib-0.3.0.tar.gz", "yanked": false}], "0.3.1": [{"comment_text": "", "digests": {"md5": "3619b5562d07400f60bbed3be4b80753", "sha256": "d9abf548ef02b98a62460e8cafaa56c41888384473267600c57449ab702cc3c5"}, "downloads": -1, "filename": "yaposib-0.3.1.tar.gz", "has_sig": false, "md5_digest": "3619b5562d07400f60bbed3be4b80753", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 25865, "upload_time": "2012-08-20T15:11:33", "upload_time_iso_8601": "2012-08-20T15:11:33.878347Z", "url": "https://files.pythonhosted.org/packages/1c/60/d1fb488a71d2d685e9a6a5c29b09e260af9d314a6c434334ab18ae608402/yaposib-0.3.1.tar.gz", "yanked": false}], "0.3.2": [{"comment_text": "", "digests": {"md5": "321a460b1e775abeafcbc77cceed61b1", "sha256": "d6a0ef0cdfff76038e5b55910610fff315bb17ac502d82132d806fe2f0c6a6b3"}, "downloads": -1, "filename": "yaposib-0.3.2.tar.gz", "has_sig": false, "md5_digest": "321a460b1e775abeafcbc77cceed61b1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 24225, "upload_time": "2012-08-22T13:38:32", "upload_time_iso_8601": "2012-08-22T13:38:32.219594Z", "url": "https://files.pythonhosted.org/packages/ad/1f/ed2581ae6238f0884f3166726821672db08a8cf459d8fa869821fb00fd73/yaposib-0.3.2.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "321a460b1e775abeafcbc77cceed61b1", "sha256": "d6a0ef0cdfff76038e5b55910610fff315bb17ac502d82132d806fe2f0c6a6b3"}, "downloads": -1, "filename": "yaposib-0.3.2.tar.gz", "has_sig": false, "md5_digest": "321a460b1e775abeafcbc77cceed61b1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 24225, "upload_time": "2012-08-22T13:38:32", "upload_time_iso_8601": "2012-08-22T13:38:32.219594Z", "url": "https://files.pythonhosted.org/packages/ad/1f/ed2581ae6238f0884f3166726821672db08a8cf459d8fa869821fb00fd73/yaposib-0.3.2.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:23:02 2020"}