{"info": {"author": "Zope Foundation and Contributors", "author_email": "zodb@googlegroups.com", "bugtrack_url": null, "classifiers": ["Framework :: ZODB", "Intended Audience :: Developers", "License :: OSI Approved :: Zope Public License", "Operating System :: Microsoft :: Windows", "Operating System :: Unix", "Programming Language :: Python :: 2", "Programming Language :: Python :: 2.7", "Programming Language :: Python :: 3", "Programming Language :: Python :: 3.4", "Programming Language :: Python :: 3.5", "Programming Language :: Python :: 3.6", "Programming Language :: Python :: 3.7", "Programming Language :: Python :: Implementation :: CPython", "Programming Language :: Python :: Implementation :: PyPy", "Topic :: Database", "Topic :: Software Development :: Libraries :: Python Modules"], "description": "============================================================\nZEO - Single-server client-server database server for ZODB\n============================================================\n\nZEO is a client-server storage for `ZODB <http://www.zodb.org>`_ for\nsharing a single storage among many clients. When you use ZEO, a\nlower-level storage, typically a file storage, is opened in the ZEO\nserver process.  Client programs connect to this process using a ZEO\nClientStorage.  ZEO provides a consistent view of the database to all\nclients.  The ZEO client and server communicate using a custom\nprotocol layered on top of TCP.\n\nSome alternatives to ZEO:\n\n- `NEO <http://www.neoppod.org/>`_ is a distributed-server\n  client-server storage.\n\n- `RelStorage <http://relstorage.readthedocs.io/en/latest/>`_\n  leverages the RDBMS servers to provide a client-server storage.\n\n.. contents::\n\nIntroduction\n============\n\nThere are several features that affect the behavior of\nZEO.  This section describes how a few of these features\nwork.  Subsequent sections describe how to configure every option.\n\nClient cache\n------------\n\nEach ZEO client keeps an on-disk cache of recently used data records\nto avoid fetching those records from the server each time they are\nrequested.  It is usually faster to read the objects from disk than it\nis to fetch them over the network.  The cache can also provide\nread-only copies of objects during server outages.\n\nThe cache may be persistent or transient. If the cache is persistent,\nthen the cache files are retained for use after process restarts. A\nnon-persistent cache uses temporary files that are removed when the\nclient storage is closed.\n\nThe client cache size is configured when the ClientStorage is created.\nThe default size is 20MB, but the right size depends entirely on the\nparticular database.  Setting the cache size too small can hurt\nperformance, but in most cases making it too big just wastes disk\nspace.\n\nZEO uses invalidations for cache consistency.  Every time an object is\nmodified, the server sends a message to each client informing it of\nthe change.  The client will discard the object from its cache when it\nreceives an invalidation. (It's actually a little more complicated,\nbut we won't get into that here.)\n\nEach time a client connects to a server, it must verify that its cache\ncontents are still valid.  (It did not receive any invalidation\nmessages while it was disconnected.)  This involves asking the server\nto replay invalidations it missed. If it's been disconnected too long,\nit discards its cache.\n\n\nInvalidation queue\n------------------\n\nThe ZEO server keeps a queue of recent invalidation messages in\nmemory.  When a client connects to the server, it sends the timestamp\nof the most recent invalidation message it has received.  If that\nmessage is still in the invalidation queue, then the server sends the\nclient all the missing invalidations.\n\nThe default size of the invalidation queue is 100.  If the\ninvalidation queue is larger, it will be more likely that a client\nthat reconnects will be able to verify its cache using the queue.  On\nthe other hand, a large queue uses more memory on the server to store\nthe message.  Invalidation messages tend to be small, perhaps a few\nhundred bytes each on average; it depends on the number of objects\nmodified by a transaction.\n\nYou can also provide an invalidation age when configuring the\nserver. In this case, if the invalidation queue is too small, but a\nclient has been disconnected for a time interval that is less than the\ninvalidation age, then invalidations are replayed by iterating over\nthe lower-level storage on the server.  If the age is too high, and\nclients are disconnected for a long time, then this can put a lot of\nload on the server.\n\nTransaction timeouts\n--------------------\n\nA ZEO server can be configured to timeout a transaction if it takes\ntoo long to complete.  Only a single transaction can commit at a time;\nso if one transaction takes too long, all other clients will be\ndelayed waiting for it.  In the extreme, a client can hang during the\ncommit process.  If the client hangs, the server will be unable to\ncommit other transactions until it restarts.  A well-behaved client\nwill not hang, but the server can be configured with a transaction\ntimeout to guard against bugs that cause a client to hang.\n\nIf any transaction exceeds the timeout threshold, the client's\nconnection to the server will be closed and the transaction aborted.\nOnce the transaction is aborted, the server can start processing other\nclient's requests.  Most transactions should take very little time to\ncommit.  The timer begins for a transaction after all the data has\nbeen sent to the server.  At this point, the cost of commit should be\ndominated by the cost of writing data to disk; it should be unusual\nfor a commit to take longer than 1 second.  A transaction timeout of\n30 seconds should tolerate heavy load and slow communications between\nclient and server, while guarding against hung servers.\n\nWhen a transaction times out, the client can be left in an awkward\nposition.  If the timeout occurs during the second phase of the two\nphase commit, the client will log a panic message.  This should only\ncause problems if the client transaction involved multiple storages.\nIf it did, it is possible that some storages committed the client\nchanges and others did not.\n\nConnection management\n---------------------\n\nA ZEO client manages its connection to the ZEO server.  If it loses\nthe connection, it attempts to reconnect.  While\nit is disconnected, it can satisfy some reads by using its cache.\n\nThe client can be configured with multiple server addresses.  In this\ncase, it assumes that each server has identical content and will use\nany server that is available.  It is possible to configure the client\nto accept a read-only connection to one of these servers if no\nread-write connection is available.  If it has a read-only connection,\nit will continue to poll for a read-write connection.\n\nIf a single address resolves to multiple IPv4 or IPv6 addresses,\nthe client will connect to an arbitrary of these addresses.\n\nSSL\n---\n\nZEO supports the use of SSL connections between servers and clients,\nincluding certificate authentication.  We're still understanding use\ncases for this, so details of operation may change.\n\nInstalling software\n===================\n\nZEO is installed like any other Python package using pip, buildout, or\nother Python packaging tools.\n\nRunning the server\n==================\n\nTypically, the ZEO server is run using the ``runzeo`` script that's\ninstalled as part of a ZEO installation.  The ``runzeo`` script\naccepts command line options, the most important of which is the\n``-C`` (``--configuration``) option.  ZEO servers are best configured\nvia configuration files.  The ``runzeo`` script also accepts some\ncommand-line arguments for ad-hoc configurations, but there's an\neasier way to run an ad-hoc server described below.  For more on\nconfiguring a ZEO server see `Server configuration`_ below.\n\nServer quick-start/ad-hoc operation\n-----------------------------------\n\nYou can quickly start a ZEO server from a Python prompt::\n\n  import ZEO\n  address, stop = ZEO.server()\n\nThis runs a ZEO server on a dynamic address and using an in-memory\nstorage.\n\nWe can then create a ZEO client connection using the address\nreturned::\n\n  connection = ZEO.connection(addr)\n\nThis is a ZODB connection for a database opened on a client storage\ninstance created on the fly.  This is a shorthand for::\n\n  db = ZEO.DB(addr)\n  connection = db.open()\n\nWhich is a short-hand for::\n\n  client_storage = ZEO.client(addr)\n\n  import ZODB\n  db = ZODB.db(client_storage)\n  connection = db.open()\n\nIf you exit the Python process, the storage exits as well, as it's run\nin an in-process thread.\n\nYou shut down the server more cleanly by calling the stop function\nreturned by the ``ZEO.server`` function.\n\nTo have data stored persistently, you can specify a file-storage path\nname using a ``path`` parameter.  If you want blob support, you can\nspecify a blob-file directory using the ``blob_dir`` directory.\n\nYou can also supply a port to listen on, full storage configuration\nand ZEO server configuration options to the ``ZEO.server``\nfunction. See it's documentation string for more information.\n\nServer configuration\n--------------------\n\nThe script ``runzeo`` runs the ZEO server.  The server can be\nconfigured using command-line arguments or a configuration file.  This\ndocument only describes the configuration file.  Run ``runzeo``\n-h to see the list of command-line arguments.\n\nThe configuration file specifies the underlying storage the server\nuses, the address it binds to, and a few other optional parameters.\nAn example is::\n\n    <zeo>\n      address zeo.example.com:8090\n    </zeo>\n\n    <filestorage>\n      path /var/tmp/Data.fs\n    </filestorage>\n\n    <eventlog>\n      <logfile>\n        path /var/tmp/zeo.log\n        format %(asctime)s %(message)s\n      </logfile>\n    </eventlog>\n\nThe format is similar to the Apache configuration format.  Individual\nsettings have a name, 1 or more spaces and a value, as in::\n\n  address zeo.example.com:8090\n\nSettings are grouped into hierarchical sections.\n\nThe example above configures a server to use a file storage from\n``/var/tmp/Data.fs``.  The server listens on port ``8090`` of\n``zeo.example.com``.  The ZEO server writes its log file to\n``/var/tmp/zeo.log`` and uses a custom format for each line.  Assuming the\nexample configuration it stored in ``zeo.config``, you can run a server by\ntyping::\n\n    runzeo -C zeo.config\n\nA configuration file consists of a ``<zeo>`` section and a storage\nsection, where the storage section can use any of the valid ZODB\nstorage types.  It may also contain an event log configuration.  See\n`ZODB documentation <http://www.zodb.org>`_ for information on\nconfiguring storages.\n\nThe ``zeo`` section must list the address.  All the other keys are\noptional.\n\naddress\n        The address at which the server should listen.  This can be in\n        the form 'host:port' to signify a TCP/IP connection or a\n        pathname string to signify a Unix domain socket connection (at\n        least one '/' is required).  A hostname may be a DNS name or a\n        dotted IP address.  If the hostname is omitted, the platform's\n        default behavior is used when binding the listening socket (''\n        is passed to socket.bind() as the hostname portion of the\n        address).\n\nread-only\n        Flag indicating whether the server should operate in read-only\n        mode.  Defaults to false.  Note that even if the server is\n        operating in writable mode, individual storages may still be\n        read-only.  But if the server is in read-only mode, no write\n        operations are allowed, even if the storages are writable.  Note\n        that pack() is considered a read-only operation.\n\ninvalidation-queue-size\n        The storage server keeps a queue of the objects modified by the\n        last N transactions, where N == invalidation_queue_size.  This\n        queue is used to support client cache verification when a client\n        disconnects for a short period of time.\n\ninvalidation-age\n        The maximum age of a client for which quick-verification\n        invalidations will be provided by iterating over the served\n        storage. This option should only be used if the served storage\n        supports efficient iteration from a starting point near the\n        end of the transaction history (e.g. end of file).\n\ntransaction-timeout\n        The maximum amount of time, in seconds, to wait for a\n        transaction to commit after acquiring the storage lock,\n        specified in seconds.  If the transaction takes too long, the\n        client connection will be closed and the transaction aborted.\n\n        This defaults to 30 seconds.\n\nclient-conflict-resolution\n        Flag indicating that clients should perform conflict\n        resolution. This option defaults to false.\n\nmsgpack\n        Use `msgpack <http://msgpack.org/index.html>`_ to serialize\n        and de-serialize ZEO protocol messages.\n\n        An advantage of using msgpack for ZEO communication is that\n        it's a tiny bit faster and a ZEO server can support Python 2\n        or Python 3 clients (but not both).\n\n        msgpack can also be enabled by setting the ``ZEO_MSGPACK``\n        environment to a non-empty string.\n\nServer SSL configuration\n~~~~~~~~~~~~~~~~~~~~~~~~\n\nA server can optionally support SSL.  Do do so, include a `ssl`\nsubsection of the ZEO section, as in::\n\n    <zeo>\n      address zeo.example.com:8090\n      <ssl>\n        certificate server_certificate.pem\n        key server_certificate_key.pem\n      </ssl>\n    </zeo>\n\n    <filestorage>\n      path /var/tmp/Data.fs\n    </filestorage>\n\n    <eventlog>\n      <logfile>\n        path /var/tmp/zeo.log\n        format %(asctime)s %(message)s\n      </logfile>\n    </eventlog>\n\nThe ``ssl`` section has settings:\n\ncertificate\n  The path to an SSL certificate file for the server. (required)\n\nkey\n  The path to the SSL key file for the server certificate (if not\n  included in certificate file).\n\npassword-function\n  The dotted name if an importable function that, when imported, returns\n  the password needed to unlock the key (if the key requires a password.)\n\nauthenticate\n  The path to a file or directory containing client certificates\n  to authenticate.  (See the ``cafile`` and ``capath``\n  parameters in the Python documentation for\n  ``ssl.SSLContext.load_verify_locations``.)\n\n  If this setting is used. then certificate authentication is\n  used to authenticate clients.  A client must be configured\n  with one of the certificates supplied using this setting.\n\n  This option assumes that you're using self-signed certificates.\n\nRunning the ZEO server as a daemon\n----------------------------------\n\nIn an operational setting, you will want to run the ZEO server as a\ndaemon process that is restarted when it dies.  ``runzeo`` makes no\nattempt to implement a well behaved daemon. It expects that\nfunctionality to be provided by a wrapper like `zdaemon\n<https://pypi.python.org/pypi/zdaemon>`_ or `supervisord\n<http://supervisord.org/>`_.\n\nRotating log files\n------------------\n\n``runzeo`` will re-initialize its logging subsystem when it receives a\nSIGUSR2 signal.  If you are using the standard event logger, you\nshould first rename the log file and then send the signal to the\nserver.  The server will continue writing to the renamed log file\nuntil it receives the signal.  After it receives the signal, the\nserver will create a new file with the old name and write to it.\n\nZEO Clients\n===========\n\nTo use a ZEO server, you need to connect to it using a ZEO client\nstorage.  You create client storages either using a Python API or\nusing a ZODB storage configuration in a ZODB storage configuration\nsection.\n\nPython API for creating a ZEO client storage\n--------------------------------------------\n\nTo create a client storage from Python, use the ``ZEO.client``\nfunction::\n\n    import ZEO\n    client = ZEO.client(8200)\n\nIn the example above, we created a client that connected to a storage\nlistening on port 8200 on local host.  The first argument is an\naddress, or list of addresses to connect to.  There are many additional\noptions, documented below that should be given as keyword arguments.\n\nAddresses can be:\n\n- A host/port tuple\n\n- An integer, which implies that the host is '127.0.0.1'\n\n- A unix domain socket file name.\n\nOptions:\n\ncache_size\n   The cache size in bytes. This defaults to a 20MB.\n\ncache\n   The ZEO cache to be used.  This can be a file name, which will\n   cause a persistent standard persistent ZEO cache to be used and\n   stored in the given name.  This can also be an object that\n   implements ``ZEO.interfaces.ICache``.\n\n   If not specified, then a non-persistent cache will be used.\n\nblob_dir\n   The name of a directory to hold/cache blob data downloaded from the\n   server.  This must be provided if blobs are to be used.  (Of\n   course, the server storage must be configured to use blobs as\n   well.)\n\nshared_blob_dir\n   A client can use a network files system (or a local directory if\n   the server runs on the same machine) to share a blob directory with\n   the server.  This allows downloading of blobs (except via a\n   distributed file system) to be avoided.\n\nblob_cache_size\n   The size of the blob cache in bytes.  IF unset, then blobs will\n   accumulate. If set, then blobs are removed when the total size\n   exceeds this amount.  Blobs accessed least recently are removed\n   first.\n\nblob_cache_size_check\n   The total size of data to be downloaded to trigger blob cache size\n   reduction. The default is 10 (percent).  This controls how often to\n   remove blobs from the cache.\n\nssl\n   An ``ssl.SSLContext`` object used to make SSL connections.\n\nssl_server_hostname\n   Host name to use for SSL host name checks.\n\n   If using SSL and if host name checking is enabled in the given SSL\n   context then use this as the value to check.  If an address is a\n   host/port pair, then this defaults to the host in the address.\n\nread_only\n   Set to true for a read-only connection.\n\n   If false (the default), then request a read/write connection.\n\n   This option is ignored if ``read_only_fallback`` is set to a true value.\n\nread_only_fallback\n   Set to true, then prefer a read/write connection, but be willing to\n   use a read-only connection.  This defaults to a false value.\n\n   If ``read_only_fallback`` is set, then ``read_only`` is ignored.\n\nserver_sync\n   Flag, false by default, indicating whether the ``sync`` method\n   should make a server request.  The ``sync`` method is called at the\n   start of explicitly begin transactions.  Making a server requests assures\n   that any invalidations outstanding at the beginning of a\n   transaction are processed.\n\n   Setting this to True is important when application activity is\n   spread over multiple ZEO clients. The classic example of this is\n   when a web browser makes a request to an application server (ZEO\n   client) that makes a change and then makes a request to another\n   application server that depends on the change.\n\n   Setting this to True makes transactions a little slower because of\n   the added server round trip.  For transactions that don't otherwise\n   need to access the storage server, the impact can be significant.\n\nwait_timeout\n   How long to wait for an initial connection, defaulting to 30\n   seconds.  If an initial connection can't be made within this time\n   limit, then creation of the client storage will fail with a\n   ``ZEO.Exceptions.ClientDisconnected`` exception.\n\n   After the initial connection, if the client is disconnected:\n\n   - In-flight server requests will fail with a\n     ``ZEO.Exceptions.ClientDisconnected`` exception.\n\n   - New requests will block for up to ``wait_timeout`` waiting for a\n     connection to be established before failing with a\n     ``ZEO.Exceptions.ClientDisconnected`` exception.\n\nclient_label\n   A short string to display in *server* logs for an event relating to\n   this client. This can be helpful when debugging.\n\ndisconnect_poll\n   The delay in seconds between attempts to connect to the\n   server, in seconds.  Defaults to 1 second.\n\nConfiguration strings/files\n---------------------------\n\nZODB databases and storages can be configured using configuration\nfiles, or strings (extracted from configuration files).  They use the\nsame syntax as the server configuration files described above, but\nwith different sections and options.\n\nAn application that used ZODB might configure it's database using a\nstring like::\n\n  <zodb>\n     cache-size-bytes 1000MB\n\n     <filestorage>\n       path /var/lib/Data.fs\n     </filestorage>\n  </zodb>\n\nIn this example, we configured a ZODB database with a object cache\nsize of 1GB.  Inside the database, we configured a file storage.  The\n``filestorage`` section provided file-storage parameters.  We saw a\nsimilar section in the storage-server configuration example in `Server\nconfiguration`_.\n\nTo configure a client storage, you use a ``clientstorage`` section,\nbut first you have to import it's definition, because ZEO isn't built\ninto ZODB.  Here's an example::\n\n  <zodb>\n     cache-size-bytes 1000MB\n\n     %import ZEO\n\n     <clientstorage>\n       server 8200\n     </clientstorage>\n  </zodb>\n\nIn this example, we defined a client storage that connected to a\nserver on port 8200.\n\nThe following settings are supported:\n\ncache-size\n   The cache size in bytes, KB or MB. This defaults to a 20MB.\n   Optional ``KB`` or ``MB`` suffixes can (and usually are) used to\n   specify units other than bytes.\n\ncache-path\n   The file path of a persistent cache file\n\nblob-dir\n   The name of a directory to hold/cache blob data downloaded from the\n   server.  This must be provided if blobs are to be used.  (Of\n   course, the server storage must be configured to use blobs as\n   well.)\n\nshared-blob-dir\n   A client can use a network files system (or a local directory if\n   the server runs on the same machine) to share a blob directory with\n   the server.  This allows downloading of blobs (except via a\n   distributed file system) to be avoided.\n\nblob-cache-size\n   The size of the blob cache in bytes.  IF unset, then blobs will\n   accumulate. If set, then blobs are removed when the total size\n   exceeds this amount.  Blobs accessed least recently are removed\n   first.\n\nblob-cache-size-check\n   The total size of data to be downloaded to trigger blob cache size\n   reduction. The default is 10 (percent).  This controls how often to\n   remove blobs from the cache.\n\nread-only\n   Set to true for a read-only connection.\n\n   If false (the default), then request a read/write connection.\n\n   This option is ignored if ``read_only_fallback`` is set to a true value.\n\nread-only-fallback\n   Set to true, then prefer a read/write connection, but be willing to\n   use a read-only connection.  This defaults to a false value.\n\n   If ``read_only_fallback`` is set, then ``read_only`` is ignored.\n\nserver-sync\n   Sets the ``server_sync`` option described above.\n\nwait_timeout\n   How long to wait for an initial connection, defaulting to 30\n   seconds.  If an initial connection can't be made within this time\n   limit, then creation of the client storage will fail with a\n   ``ZEO.Exceptions.ClientDisconnected`` exception.\n\n   After the initial connection, if the client is disconnected:\n\n   - In-flight server requests will fail with a\n     ``ZEO.Exceptions.ClientDisconnected`` exception.\n\n   - New requests will block for up to ``wait_timeout`` waiting for a\n     connection to be established before failing with a\n     ``ZEO.Exceptions.ClientDisconnected`` exception.\n\nclient_label\n   A short string to display in *server* logs for an event relating to\n   this client. This can be helpful when debugging.\n\ndisconnect_poll\n   The delay in seconds between attempts to connect to the\n   server, in seconds.  Defaults to 1 second.\n\nClient SSL configuration\n~~~~~~~~~~~~~~~~~~~~~~~~\n\nAn ``ssl`` subsection can be used to enable and configure SSL, as in::\n\n  %import ZEO\n\n  <clientstorage>\n    server zeo.example.com8200\n    <ssl>\n    </ssl>\n  </clientstorage>\n\nIn the example above, SSL is enabled in it's simplest form:\n\n- The client expects the server to have a signed certificate, which the\n  client validates.\n\n- The server server host name ``zeo.example.com`` is checked against\n  the server's certificate.\n\nA number of settings can be provided to configure SSL:\n\ncertificate\n  The path to an SSL certificate file for the client.  This is\n  needed to allow the server to authenticate the client.\n\nkey\n  The path to the SSL key file for the client certificate (if not\n  included in the certificate file).\n\npassword-function\n  A dotted name if an importable function that, when imported, returns\n  the password needed to unlock the key (if the key requires a password.)\n\nauthenticate\n  The path to a file or directory containing server certificates\n  to authenticate.  (See the ``cafile`` and ``capath``\n  parameters in the Python documentation for\n  ``ssl.SSLContext.load_verify_locations``.)\n\n  If this setting is used. then certificate authentication is\n  used to authenticate the server.  The server must be configured\n  with one of the certificates supplied using this setting.\n\ncheck-hostname\n  This is a boolean setting that defaults to true. Verify the\n  host name in the server certificate is as expected.\n\nserver-hostname\n  The expected server host name.  This defaults to the host name\n  used in the server address.  This option must be used when\n  ``check-hostname`` is true and when a server address has no host\n  name (localhost, or unix domain socket) or when there is more\n  than one server and server hostnames differ.\n\n  Using this setting implies a true value for the ``check-hostname`` setting.\n\nChangelog\n=========\n\n5.2.1 (2019-02-09)\n------------------\n\n- Add support for Python 3.7.\n\n- Switch from ``msgpack-python`` to ``msgpack``. Currently a version < 0.6\n  is required.\n\n- Stop calling the deprecated ``checkSecure`` method when creating a\n  ``ClientStorage``. With ZODB 5.2.2 and above, this issued a warning.\n  With older versions, this *could* issue a log message, but this was\n  considered `a misfeature\n  <https://github.com/zopefoundation/ZODB/issues/155>`_. See `issue\n  134 <https://github.com/zopefoundation/ZEO/issues/134>`_.\n\n5.2.0 (2018-03-28)\n------------------\n\n- Fixed: The quickstart/ad-hoc/play ZEO server relied on test\n  dependencies. See `issue 105\n  <https://github.com/zopefoundation/ZEO/issues/105>`_.\n\n- Disallow passing strings as addresses to ClientStorage under Windows\n  because string addresses are used for unix-domain sockets, which\n  aren't supported on Windows. See `issue 107\n  <https://github.com/zopefoundation/ZEO/issues/107>`_.\n\n- Renamed all ``async`` attributes to ``async_`` for compatibility\n  with Python 3.7. See `issue 104\n  <https://github.com/zopefoundation/ZEO/issues/104>`_.\n\n- Fixed to work with some changes made in ZODB 5.4.0.\n\n  Client-side updates are incuded for ZODB 5.4.0 or databases that\n  already had ``zodbpickle.binary`` OIDs. See `issue 113\n  <https://github.com/zopefoundation/ZEO/issues/113>`_.\n\n- ZEO now uses pickle protocol 3 for both Python 2 and Python 3.\n  (Previously protocol 1 was used for Python 2.) This matches the\n  change in ZODB 5.4.0.\n\n5.1.2 (2018-03-27)\n------------------\n\n- Fix: ZEO didn't work with a change in ZODB 5.4.0.\n\n  (Allow ``zodbpickle.binary`` to be used in RPC requests, which is\n  necessary for compatibility with ZODB 5.4.0 on Python 2. See `issue\n  107 <https://github.com/zopefoundation/ZEO/issues/107>`_.)\n\n5.1.1 (2017-12-18)\n------------------\n\n- All classes are new-style classes on Python 2 (they were already\n  new-style on Python 3). This improves performance on PyPy. See\n  `issue 86 <https://github.com/zopefoundation/ZEO/pull/86>`_.\n\n- Fixed removing UNIX socket files under Python 2 with ZConfig 3.2.0.\n  See `issue 90 <https://github.com/zopefoundation/ZEO/issues/90>`_.\n\n5.1.0 (2017-04-03)\n------------------\n\n- Added support for serializing ZEO messages using `msgpack\n  <http://msgpack.org/index.html>`_ rather than pickle.  This helps\n  pave the way to supporting `byteserver\n  <https://github.com/jimfulton/byteserver>`_, but it also allows ZEO\n  servers to support Python 2 or 3 clients (but not both at the same\n  time) and may provide a small performance improvement.\n\n- Possibly fixed the deprecated and untested zeoctl script.\n\n- Removed zeopasswd, which no longer makes sense given that ZEO\n  authentication was removed, in favor of SSL.\n\n5.0.4 (2016-11-18)\n------------------\n\n- Fixed: ZEO needed changes to work with recent transaction changes.\n\n  ZEO now works with the latest versions of ZODB and transaction\n\n5.0.3 (2016-11-18)\n------------------\n\n- Temporarily require non-quite-current versions of ZODB and\n  transaction until we can sort out some recent breakage.\n\n5.0.2 (2016-11-02)\n------------------\n\n- Provide much better performance on Python 2.\n\n- Provide better error messages when pip tries to install ZEO on an\n  unsupported Python version. See `issue 75\n  <https://github.com/zopefoundation/ZEO/issues/75>`_.\n\n5.0.1 (2016-09-06)\n------------------\n\nPackaging-related doc fix\n\n5.0.0 (2016-09-06)\n------------------\n\nThis is a major ZEO revision, which replaces the ZEO network protocol\nimplementation.\n\nNew features:\n\n- SSL support\n\n- Optional client-side conflict resolution.\n\n- Lots of mostly internal clean ups.\n\n- ``ClientStorage``server-sync`` configuration option and\n  ``server_sync`` constructor argument to force a server round trip at\n  the beginning of transactions to wait for any outstanding\n  invalidations at the start of the transaction to be delivered.\n\n- Client disconnect errors are now transient errors.  When\n  applications retry jobs that raise transient errors, jobs (e.g. web\n  requests) with disconnect errors will be retried. Together with\n  blocking synchronous ZEO server calls for a limited time while\n  disconnected, this change should allow brief disconnections due to\n  server restart to avoid generating client-visible errors (e.g. 500\n  web responses).\n\n- ClientStorage prefetch method to prefetch oids.\n\n  When oids are prefetched, requests are made at once, but the caller\n  doesn't block waiting for the results.  Rather, then the caller\n  later tries to fetch data for one of the object ids, it's either\n  delivered right away from the ZEO cache, if the prefetch for the\n  object id has completed, or the caller blocks until the inflight\n  prefetch completes. (No new request is made.)\n\nDropped features:\n\n- The ZEO authentication protocol.\n\n  This will be replaced by new authentication mechanims leveraging SSL.\n\n- The ZEO monitor server.\n\n- Full cache verification.\n\n- Client suppprt for servers older than ZODB 3.9\n\n- Server support for clients older than ZEO 4.2.0\n\n5.0.0b0 (2016-08-18)\n--------------------\n\n- Added a ``ClientStorage`` ``server-sync`` configuration option and\n  ``server_sync`` constructor argument to force a server round trip at\n  the beginning of transactions to wait for any outstanding\n  invalidations at the start of the transaction to be delivered.\n\n- When creating an ad hoc server, a log file isn't created by\n  default. You must pass a ``log`` option specifying a log file name.\n\n- The ZEO server register method now returns the storage last\n  transaction, allowing the client to avoid an extra round trip during\n  cache verification.\n\n- Client disconnect errors are now transient errors.  When\n  applications retry jobs that raise transient errors, jobs (e.g. web\n  requests) with disconnect errors will be retried. Together with\n  blocking synchronous ZEO server calls for a limited time while\n  disconnected, this change should allow brief disconnections due to\n  server restart to avoid generating client-visible errors (e.g. 500\n  web responses).\n\n- Fixed bugs in using the ZEO 5 client with ZEO 4 servers.\n\n5.0.0a2 (2016-07-30)\n--------------------\n\n- Added the ability to pass credentials when creating client storages.\n\n  This is experimental in that passing credentials will cause\n  connections to an ordinary ZEO server to fail, but it facilitates\n  experimentation with custom ZEO servers. Doing this with custom ZEO\n  clients would have been awkward due to the many levels of\n  composition involved.\n\n  In the future, we expect to support server security plugins that\n  consume credentials for authentication (typically over SSL).\n\n  Note that credentials are opaque to ZEO. They can be any object with\n  a true value.  The client mearly passes them to the server, which\n  will someday pass them to a plugin.\n\n5.0.0a1 (2016-07-21)\n--------------------\n\n- Added a ClientStorage prefetch method to prefetch oids.\n\n  When oids are prefetched, requests are made at once, but the caller\n  doesn't block waiting for the results.  Rather, then the caller\n  later tries to fetch data for one of the object ids, it's either\n  delivered right away from the ZEO cache, if the prefetch for the\n  object id has completed, or the caller blocks until the inflight\n  prefetch completes. (No new request is made.)\n\n- Fixed: SSL clients of servers with signed certs didn't load default\n  certs and were unable to connect.\n\n5.0.0a0 (2016-07-08)\n--------------------\n\nThis is a major ZEO revision, which replaces the ZEO network protocol\nimplementation.\n\nNew features:\n\n- SSL support\n\n- Optional client-side conflict resolution.\n\n- Lots of mostly internal clean ups.\n\nDropped features:\n\n- The ZEO authentication protocol.\n\n  This will be replaced by new authentication mechanims leveraging SSL.\n\n- The ZEO monitor server.\n\n- Full cache verification.\n\n- Client suppprt for servers older than ZODB 3.9\n\n- Server support for clients older than ZEO 4.2.0\n\n4.2.0 (2016-06-15)\n------------------\n\n- Changed loadBefore to operate more like load behaved, especially\n  with regard to the load lock.  This allowes ZEO to work with the\n  upcoming ZODB 5, which used loadbefore rather than load.\n\n  Reimplemented load using loadBefore, thus testing loadBefore\n  extensively via existing tests.\n\n- Other changes to work with ZODB 5 (as well as ZODB 4)\n\n- Fixed: the ZEO cache loadBefore method failed to utilize current data.\n\n- Drop support for Python 2.6 and 3.2.\n\n- Fix AttributeError: 'ZEOServer' object has no attribute 'server' when\n  StorageServer creation fails.\n\n4.2.0b1 (2015-06-05)\n--------------------\n\n- Add support for PyPy.\n\n4.1.0 (2015-01-06)\n------------------\n\n- Add support for Python 3.4.\n\n- Added a new ``ruok`` client protocol for getting server status on\n  the ZEO port without creating a full-blown client connection and\n  without logging in the server log.\n\n- Log errors on server side even if using multi threaded delay.\n\n4.0.0 (2013-08-18)\n------------------\n\n- Avoid reading excess random bytes when setting up an auth_digest session.\n\n- Optimize socket address enumeration in ZEO client (avoid non-TCP types).\n\n- Improve Travis CI testing support.\n\n- Assign names to all threads for better runtime debugging.\n\n- Fix \"assignment to keyword\" error under Py3k in 'ZEO.scripts.zeoqueue'.\n\n4.0.0b1 (2013-05-20)\n--------------------\n\n- Depend on ZODB >= 4.0.0b2\n\n- Add support for Python 3.2 / 3.3.\n\n4.0.0a1 (2012-11-19)\n--------------------\n\nFirst (in a long time) separate ZEO release.\n\nSince ZODB 3.10.5:\n\n- Storage servers now emit Serving and Closed events so subscribers\n  can discover addresses when dynamic port assignment (bind to port 0)\n  is used. This could, for example, be used to update address\n  information in a ZooKeeper database.\n\n- Client storages have a method, new_addr, that can be used to change\n  the server address(es). This can be used, for example, to update a\n  dynamically determined server address from information in a\n  ZooKeeper database.", "description_content_type": "", "docs_url": null, "download_url": "", "downloads": {"last_day": -1, "last_month": -1, "last_week": -1}, "home_page": "https://github.com/zopefoundation/ZEO", "keywords": "database,zodb", "license": "ZPL 2.1", "maintainer": "", "maintainer_email": "", "name": "ZEO", "package_url": "https://pypi.org/project/ZEO/", "platform": "any", "project_url": "https://pypi.org/project/ZEO/", "project_urls": {"Homepage": "https://github.com/zopefoundation/ZEO"}, "release_url": "https://pypi.org/project/ZEO/5.2.1/", "requires_dist": null, "requires_python": ">=2.7.9,!=3.0.*,!=3.1.*,!=3.2.*,!=3.3.*", "summary": "ZEO - Single-server client-server database server for ZODB", "version": "5.2.1", "yanked": false, "html_description": "<div class=\"project-description\">\n            <p>ZEO is a client-server storage for <a href=\"http://www.zodb.org\" rel=\"nofollow\">ZODB</a> for\nsharing a single storage among many clients. When you use ZEO, a\nlower-level storage, typically a file storage, is opened in the ZEO\nserver process.  Client programs connect to this process using a ZEO\nClientStorage.  ZEO provides a consistent view of the database to all\nclients.  The ZEO client and server communicate using a custom\nprotocol layered on top of TCP.</p>\n<p>Some alternatives to ZEO:</p>\n<ul>\n<li><a href=\"http://www.neoppod.org/\" rel=\"nofollow\">NEO</a> is a distributed-server\nclient-server storage.</li>\n<li><a href=\"http://relstorage.readthedocs.io/en/latest/\" rel=\"nofollow\">RelStorage</a>\nleverages the RDBMS servers to provide a client-server storage.</li>\n</ul>\n<div id=\"contents\">\n<p>Contents</p>\n<ul>\n<li><a href=\"#introduction\" id=\"id16\" rel=\"nofollow\">Introduction</a><ul>\n<li><a href=\"#client-cache\" id=\"id17\" rel=\"nofollow\">Client cache</a></li>\n<li><a href=\"#invalidation-queue\" id=\"id18\" rel=\"nofollow\">Invalidation queue</a></li>\n<li><a href=\"#transaction-timeouts\" id=\"id19\" rel=\"nofollow\">Transaction timeouts</a></li>\n<li><a href=\"#connection-management\" id=\"id20\" rel=\"nofollow\">Connection management</a></li>\n<li><a href=\"#ssl\" id=\"id21\" rel=\"nofollow\">SSL</a></li>\n</ul>\n</li>\n<li><a href=\"#installing-software\" id=\"id22\" rel=\"nofollow\">Installing software</a></li>\n<li><a href=\"#running-the-server\" id=\"id23\" rel=\"nofollow\">Running the server</a><ul>\n<li><a href=\"#server-quick-start-ad-hoc-operation\" id=\"id24\" rel=\"nofollow\">Server quick-start/ad-hoc operation</a></li>\n<li><a href=\"#server-configuration\" id=\"id25\" rel=\"nofollow\">Server configuration</a><ul>\n<li><a href=\"#server-ssl-configuration\" id=\"id26\" rel=\"nofollow\">Server SSL configuration</a></li>\n</ul>\n</li>\n<li><a href=\"#running-the-zeo-server-as-a-daemon\" id=\"id27\" rel=\"nofollow\">Running the ZEO server as a daemon</a></li>\n<li><a href=\"#rotating-log-files\" id=\"id28\" rel=\"nofollow\">Rotating log files</a></li>\n</ul>\n</li>\n<li><a href=\"#zeo-clients\" id=\"id29\" rel=\"nofollow\">ZEO Clients</a><ul>\n<li><a href=\"#python-api-for-creating-a-zeo-client-storage\" id=\"id30\" rel=\"nofollow\">Python API for creating a ZEO client storage</a></li>\n<li><a href=\"#configuration-strings-files\" id=\"id31\" rel=\"nofollow\">Configuration strings/files</a><ul>\n<li><a href=\"#client-ssl-configuration\" id=\"id32\" rel=\"nofollow\">Client SSL configuration</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li><a href=\"#changelog\" id=\"id33\" rel=\"nofollow\">Changelog</a><ul>\n<li><a href=\"#id1\" id=\"id34\" rel=\"nofollow\">5.2.1 (2019-02-09)</a></li>\n<li><a href=\"#id2\" id=\"id35\" rel=\"nofollow\">5.2.0 (2018-03-28)</a></li>\n<li><a href=\"#id3\" id=\"id36\" rel=\"nofollow\">5.1.2 (2018-03-27)</a></li>\n<li><a href=\"#id5\" id=\"id37\" rel=\"nofollow\">5.1.1 (2017-12-18)</a></li>\n<li><a href=\"#id6\" id=\"id38\" rel=\"nofollow\">5.1.0 (2017-04-03)</a></li>\n<li><a href=\"#id8\" id=\"id39\" rel=\"nofollow\">5.0.4 (2016-11-18)</a></li>\n<li><a href=\"#id9\" id=\"id40\" rel=\"nofollow\">5.0.3 (2016-11-18)</a></li>\n<li><a href=\"#id10\" id=\"id41\" rel=\"nofollow\">5.0.2 (2016-11-02)</a></li>\n<li><a href=\"#id11\" id=\"id42\" rel=\"nofollow\">5.0.1 (2016-09-06)</a></li>\n<li><a href=\"#id12\" id=\"id43\" rel=\"nofollow\">5.0.0 (2016-09-06)</a></li>\n<li><a href=\"#b0-2016-08-18\" id=\"id44\" rel=\"nofollow\">5.0.0b0 (2016-08-18)</a></li>\n<li><a href=\"#a2-2016-07-30\" id=\"id45\" rel=\"nofollow\">5.0.0a2 (2016-07-30)</a></li>\n<li><a href=\"#a1-2016-07-21\" id=\"id46\" rel=\"nofollow\">5.0.0a1 (2016-07-21)</a></li>\n<li><a href=\"#a0-2016-07-08\" id=\"id47\" rel=\"nofollow\">5.0.0a0 (2016-07-08)</a></li>\n<li><a href=\"#id13\" id=\"id48\" rel=\"nofollow\">4.2.0 (2016-06-15)</a></li>\n<li><a href=\"#b1-2015-06-05\" id=\"id49\" rel=\"nofollow\">4.2.0b1 (2015-06-05)</a></li>\n<li><a href=\"#id14\" id=\"id50\" rel=\"nofollow\">4.1.0 (2015-01-06)</a></li>\n<li><a href=\"#id15\" id=\"id51\" rel=\"nofollow\">4.0.0 (2013-08-18)</a></li>\n<li><a href=\"#b1-2013-05-20\" id=\"id52\" rel=\"nofollow\">4.0.0b1 (2013-05-20)</a></li>\n<li><a href=\"#a1-2012-11-19\" id=\"id53\" rel=\"nofollow\">4.0.0a1 (2012-11-19)</a></li>\n</ul>\n</li>\n</ul>\n</div>\n<div id=\"introduction\">\n<h2><a href=\"#id16\" rel=\"nofollow\">Introduction</a></h2>\n<p>There are several features that affect the behavior of\nZEO.  This section describes how a few of these features\nwork.  Subsequent sections describe how to configure every option.</p>\n<div id=\"client-cache\">\n<h3><a href=\"#id17\" rel=\"nofollow\">Client cache</a></h3>\n<p>Each ZEO client keeps an on-disk cache of recently used data records\nto avoid fetching those records from the server each time they are\nrequested.  It is usually faster to read the objects from disk than it\nis to fetch them over the network.  The cache can also provide\nread-only copies of objects during server outages.</p>\n<p>The cache may be persistent or transient. If the cache is persistent,\nthen the cache files are retained for use after process restarts. A\nnon-persistent cache uses temporary files that are removed when the\nclient storage is closed.</p>\n<p>The client cache size is configured when the ClientStorage is created.\nThe default size is 20MB, but the right size depends entirely on the\nparticular database.  Setting the cache size too small can hurt\nperformance, but in most cases making it too big just wastes disk\nspace.</p>\n<p>ZEO uses invalidations for cache consistency.  Every time an object is\nmodified, the server sends a message to each client informing it of\nthe change.  The client will discard the object from its cache when it\nreceives an invalidation. (It’s actually a little more complicated,\nbut we won’t get into that here.)</p>\n<p>Each time a client connects to a server, it must verify that its cache\ncontents are still valid.  (It did not receive any invalidation\nmessages while it was disconnected.)  This involves asking the server\nto replay invalidations it missed. If it’s been disconnected too long,\nit discards its cache.</p>\n</div>\n<div id=\"invalidation-queue\">\n<h3><a href=\"#id18\" rel=\"nofollow\">Invalidation queue</a></h3>\n<p>The ZEO server keeps a queue of recent invalidation messages in\nmemory.  When a client connects to the server, it sends the timestamp\nof the most recent invalidation message it has received.  If that\nmessage is still in the invalidation queue, then the server sends the\nclient all the missing invalidations.</p>\n<p>The default size of the invalidation queue is 100.  If the\ninvalidation queue is larger, it will be more likely that a client\nthat reconnects will be able to verify its cache using the queue.  On\nthe other hand, a large queue uses more memory on the server to store\nthe message.  Invalidation messages tend to be small, perhaps a few\nhundred bytes each on average; it depends on the number of objects\nmodified by a transaction.</p>\n<p>You can also provide an invalidation age when configuring the\nserver. In this case, if the invalidation queue is too small, but a\nclient has been disconnected for a time interval that is less than the\ninvalidation age, then invalidations are replayed by iterating over\nthe lower-level storage on the server.  If the age is too high, and\nclients are disconnected for a long time, then this can put a lot of\nload on the server.</p>\n</div>\n<div id=\"transaction-timeouts\">\n<h3><a href=\"#id19\" rel=\"nofollow\">Transaction timeouts</a></h3>\n<p>A ZEO server can be configured to timeout a transaction if it takes\ntoo long to complete.  Only a single transaction can commit at a time;\nso if one transaction takes too long, all other clients will be\ndelayed waiting for it.  In the extreme, a client can hang during the\ncommit process.  If the client hangs, the server will be unable to\ncommit other transactions until it restarts.  A well-behaved client\nwill not hang, but the server can be configured with a transaction\ntimeout to guard against bugs that cause a client to hang.</p>\n<p>If any transaction exceeds the timeout threshold, the client’s\nconnection to the server will be closed and the transaction aborted.\nOnce the transaction is aborted, the server can start processing other\nclient’s requests.  Most transactions should take very little time to\ncommit.  The timer begins for a transaction after all the data has\nbeen sent to the server.  At this point, the cost of commit should be\ndominated by the cost of writing data to disk; it should be unusual\nfor a commit to take longer than 1 second.  A transaction timeout of\n30 seconds should tolerate heavy load and slow communications between\nclient and server, while guarding against hung servers.</p>\n<p>When a transaction times out, the client can be left in an awkward\nposition.  If the timeout occurs during the second phase of the two\nphase commit, the client will log a panic message.  This should only\ncause problems if the client transaction involved multiple storages.\nIf it did, it is possible that some storages committed the client\nchanges and others did not.</p>\n</div>\n<div id=\"connection-management\">\n<h3><a href=\"#id20\" rel=\"nofollow\">Connection management</a></h3>\n<p>A ZEO client manages its connection to the ZEO server.  If it loses\nthe connection, it attempts to reconnect.  While\nit is disconnected, it can satisfy some reads by using its cache.</p>\n<p>The client can be configured with multiple server addresses.  In this\ncase, it assumes that each server has identical content and will use\nany server that is available.  It is possible to configure the client\nto accept a read-only connection to one of these servers if no\nread-write connection is available.  If it has a read-only connection,\nit will continue to poll for a read-write connection.</p>\n<p>If a single address resolves to multiple IPv4 or IPv6 addresses,\nthe client will connect to an arbitrary of these addresses.</p>\n</div>\n<div id=\"ssl\">\n<h3><a href=\"#id21\" rel=\"nofollow\">SSL</a></h3>\n<p>ZEO supports the use of SSL connections between servers and clients,\nincluding certificate authentication.  We’re still understanding use\ncases for this, so details of operation may change.</p>\n</div>\n</div>\n<div id=\"installing-software\">\n<h2><a href=\"#id22\" rel=\"nofollow\">Installing software</a></h2>\n<p>ZEO is installed like any other Python package using pip, buildout, or\nother Python packaging tools.</p>\n</div>\n<div id=\"running-the-server\">\n<h2><a href=\"#id23\" rel=\"nofollow\">Running the server</a></h2>\n<p>Typically, the ZEO server is run using the <tt>runzeo</tt> script that’s\ninstalled as part of a ZEO installation.  The <tt>runzeo</tt> script\naccepts command line options, the most important of which is the\n<tt><span class=\"pre\">-C</span></tt> (<tt><span class=\"pre\">--configuration</span></tt>) option.  ZEO servers are best configured\nvia configuration files.  The <tt>runzeo</tt> script also accepts some\ncommand-line arguments for ad-hoc configurations, but there’s an\neasier way to run an ad-hoc server described below.  For more on\nconfiguring a ZEO server see <a href=\"#server-configuration\" rel=\"nofollow\">Server configuration</a> below.</p>\n<div id=\"server-quick-start-ad-hoc-operation\">\n<h3><a href=\"#id24\" rel=\"nofollow\">Server quick-start/ad-hoc operation</a></h3>\n<p>You can quickly start a ZEO server from a Python prompt:</p>\n<pre>import ZEO\naddress, stop = ZEO.server()\n</pre>\n<p>This runs a ZEO server on a dynamic address and using an in-memory\nstorage.</p>\n<p>We can then create a ZEO client connection using the address\nreturned:</p>\n<pre>connection = ZEO.connection(addr)\n</pre>\n<p>This is a ZODB connection for a database opened on a client storage\ninstance created on the fly.  This is a shorthand for:</p>\n<pre>db = ZEO.DB(addr)\nconnection = db.open()\n</pre>\n<p>Which is a short-hand for:</p>\n<pre>client_storage = ZEO.client(addr)\n\nimport ZODB\ndb = ZODB.db(client_storage)\nconnection = db.open()\n</pre>\n<p>If you exit the Python process, the storage exits as well, as it’s run\nin an in-process thread.</p>\n<p>You shut down the server more cleanly by calling the stop function\nreturned by the <tt>ZEO.server</tt> function.</p>\n<p>To have data stored persistently, you can specify a file-storage path\nname using a <tt>path</tt> parameter.  If you want blob support, you can\nspecify a blob-file directory using the <tt>blob_dir</tt> directory.</p>\n<p>You can also supply a port to listen on, full storage configuration\nand ZEO server configuration options to the <tt>ZEO.server</tt>\nfunction. See it’s documentation string for more information.</p>\n</div>\n<div id=\"server-configuration\">\n<h3><a href=\"#id25\" rel=\"nofollow\">Server configuration</a></h3>\n<p>The script <tt>runzeo</tt> runs the ZEO server.  The server can be\nconfigured using command-line arguments or a configuration file.  This\ndocument only describes the configuration file.  Run <tt>runzeo</tt>\n-h to see the list of command-line arguments.</p>\n<p>The configuration file specifies the underlying storage the server\nuses, the address it binds to, and a few other optional parameters.\nAn example is:</p>\n<pre>&lt;zeo&gt;\n  address zeo.example.com:8090\n&lt;/zeo&gt;\n\n&lt;filestorage&gt;\n  path /var/tmp/Data.fs\n&lt;/filestorage&gt;\n\n&lt;eventlog&gt;\n  &lt;logfile&gt;\n    path /var/tmp/zeo.log\n    format %(asctime)s %(message)s\n  &lt;/logfile&gt;\n&lt;/eventlog&gt;\n</pre>\n<p>The format is similar to the Apache configuration format.  Individual\nsettings have a name, 1 or more spaces and a value, as in:</p>\n<pre>address zeo.example.com:8090\n</pre>\n<p>Settings are grouped into hierarchical sections.</p>\n<p>The example above configures a server to use a file storage from\n<tt>/var/tmp/Data.fs</tt>.  The server listens on port <tt>8090</tt> of\n<tt>zeo.example.com</tt>.  The ZEO server writes its log file to\n<tt>/var/tmp/zeo.log</tt> and uses a custom format for each line.  Assuming the\nexample configuration it stored in <tt>zeo.config</tt>, you can run a server by\ntyping:</p>\n<pre>runzeo -C zeo.config\n</pre>\n<p>A configuration file consists of a <tt>&lt;zeo&gt;</tt> section and a storage\nsection, where the storage section can use any of the valid ZODB\nstorage types.  It may also contain an event log configuration.  See\n<a href=\"http://www.zodb.org\" rel=\"nofollow\">ZODB documentation</a> for information on\nconfiguring storages.</p>\n<p>The <tt>zeo</tt> section must list the address.  All the other keys are\noptional.</p>\n<dl>\n<dt>address</dt>\n<dd>The address at which the server should listen.  This can be in\nthe form ‘host:port’ to signify a TCP/IP connection or a\npathname string to signify a Unix domain socket connection (at\nleast one ‘/’ is required).  A hostname may be a DNS name or a\ndotted IP address.  If the hostname is omitted, the platform’s\ndefault behavior is used when binding the listening socket (‘’\nis passed to socket.bind() as the hostname portion of the\naddress).</dd>\n<dt>read-only</dt>\n<dd>Flag indicating whether the server should operate in read-only\nmode.  Defaults to false.  Note that even if the server is\noperating in writable mode, individual storages may still be\nread-only.  But if the server is in read-only mode, no write\noperations are allowed, even if the storages are writable.  Note\nthat pack() is considered a read-only operation.</dd>\n<dt>invalidation-queue-size</dt>\n<dd>The storage server keeps a queue of the objects modified by the\nlast N transactions, where N == invalidation_queue_size.  This\nqueue is used to support client cache verification when a client\ndisconnects for a short period of time.</dd>\n<dt>invalidation-age</dt>\n<dd>The maximum age of a client for which quick-verification\ninvalidations will be provided by iterating over the served\nstorage. This option should only be used if the served storage\nsupports efficient iteration from a starting point near the\nend of the transaction history (e.g. end of file).</dd>\n<dt>transaction-timeout</dt>\n<dd><p>The maximum amount of time, in seconds, to wait for a\ntransaction to commit after acquiring the storage lock,\nspecified in seconds.  If the transaction takes too long, the\nclient connection will be closed and the transaction aborted.</p>\n<p>This defaults to 30 seconds.</p>\n</dd>\n<dt>client-conflict-resolution</dt>\n<dd>Flag indicating that clients should perform conflict\nresolution. This option defaults to false.</dd>\n<dt>msgpack</dt>\n<dd><p>Use <a href=\"http://msgpack.org/index.html\" rel=\"nofollow\">msgpack</a> to serialize\nand de-serialize ZEO protocol messages.</p>\n<p>An advantage of using msgpack for ZEO communication is that\nit’s a tiny bit faster and a ZEO server can support Python 2\nor Python 3 clients (but not both).</p>\n<p>msgpack can also be enabled by setting the <tt>ZEO_MSGPACK</tt>\nenvironment to a non-empty string.</p>\n</dd>\n</dl>\n<div id=\"server-ssl-configuration\">\n<h4><a href=\"#id26\" rel=\"nofollow\">Server SSL configuration</a></h4>\n<p>A server can optionally support SSL.  Do do so, include a <cite>ssl</cite>\nsubsection of the ZEO section, as in:</p>\n<pre>&lt;zeo&gt;\n  address zeo.example.com:8090\n  &lt;ssl&gt;\n    certificate server_certificate.pem\n    key server_certificate_key.pem\n  &lt;/ssl&gt;\n&lt;/zeo&gt;\n\n&lt;filestorage&gt;\n  path /var/tmp/Data.fs\n&lt;/filestorage&gt;\n\n&lt;eventlog&gt;\n  &lt;logfile&gt;\n    path /var/tmp/zeo.log\n    format %(asctime)s %(message)s\n  &lt;/logfile&gt;\n&lt;/eventlog&gt;\n</pre>\n<p>The <tt>ssl</tt> section has settings:</p>\n<dl>\n<dt>certificate</dt>\n<dd>The path to an SSL certificate file for the server. (required)</dd>\n<dt>key</dt>\n<dd>The path to the SSL key file for the server certificate (if not\nincluded in certificate file).</dd>\n<dt>password-function</dt>\n<dd>The dotted name if an importable function that, when imported, returns\nthe password needed to unlock the key (if the key requires a password.)</dd>\n<dt>authenticate</dt>\n<dd><p>The path to a file or directory containing client certificates\nto authenticate.  (See the <tt>cafile</tt> and <tt>capath</tt>\nparameters in the Python documentation for\n<tt>ssl.SSLContext.load_verify_locations</tt>.)</p>\n<p>If this setting is used. then certificate authentication is\nused to authenticate clients.  A client must be configured\nwith one of the certificates supplied using this setting.</p>\n<p>This option assumes that you’re using self-signed certificates.</p>\n</dd>\n</dl>\n</div>\n</div>\n<div id=\"running-the-zeo-server-as-a-daemon\">\n<h3><a href=\"#id27\" rel=\"nofollow\">Running the ZEO server as a daemon</a></h3>\n<p>In an operational setting, you will want to run the ZEO server as a\ndaemon process that is restarted when it dies.  <tt>runzeo</tt> makes no\nattempt to implement a well behaved daemon. It expects that\nfunctionality to be provided by a wrapper like <a href=\"https://pypi.python.org/pypi/zdaemon\" rel=\"nofollow\">zdaemon</a> or <a href=\"http://supervisord.org/\" rel=\"nofollow\">supervisord</a>.</p>\n</div>\n<div id=\"rotating-log-files\">\n<h3><a href=\"#id28\" rel=\"nofollow\">Rotating log files</a></h3>\n<p><tt>runzeo</tt> will re-initialize its logging subsystem when it receives a\nSIGUSR2 signal.  If you are using the standard event logger, you\nshould first rename the log file and then send the signal to the\nserver.  The server will continue writing to the renamed log file\nuntil it receives the signal.  After it receives the signal, the\nserver will create a new file with the old name and write to it.</p>\n</div>\n</div>\n<div id=\"zeo-clients\">\n<h2><a href=\"#id29\" rel=\"nofollow\">ZEO Clients</a></h2>\n<p>To use a ZEO server, you need to connect to it using a ZEO client\nstorage.  You create client storages either using a Python API or\nusing a ZODB storage configuration in a ZODB storage configuration\nsection.</p>\n<div id=\"python-api-for-creating-a-zeo-client-storage\">\n<h3><a href=\"#id30\" rel=\"nofollow\">Python API for creating a ZEO client storage</a></h3>\n<p>To create a client storage from Python, use the <tt>ZEO.client</tt>\nfunction:</p>\n<pre>import ZEO\nclient = ZEO.client(8200)\n</pre>\n<p>In the example above, we created a client that connected to a storage\nlistening on port 8200 on local host.  The first argument is an\naddress, or list of addresses to connect to.  There are many additional\noptions, documented below that should be given as keyword arguments.</p>\n<p>Addresses can be:</p>\n<ul>\n<li>A host/port tuple</li>\n<li>An integer, which implies that the host is ‘127.0.0.1’</li>\n<li>A unix domain socket file name.</li>\n</ul>\n<p>Options:</p>\n<dl>\n<dt>cache_size</dt>\n<dd>The cache size in bytes. This defaults to a 20MB.</dd>\n<dt>cache</dt>\n<dd><p>The ZEO cache to be used.  This can be a file name, which will\ncause a persistent standard persistent ZEO cache to be used and\nstored in the given name.  This can also be an object that\nimplements <tt>ZEO.interfaces.ICache</tt>.</p>\n<p>If not specified, then a non-persistent cache will be used.</p>\n</dd>\n<dt>blob_dir</dt>\n<dd>The name of a directory to hold/cache blob data downloaded from the\nserver.  This must be provided if blobs are to be used.  (Of\ncourse, the server storage must be configured to use blobs as\nwell.)</dd>\n<dt>shared_blob_dir</dt>\n<dd>A client can use a network files system (or a local directory if\nthe server runs on the same machine) to share a blob directory with\nthe server.  This allows downloading of blobs (except via a\ndistributed file system) to be avoided.</dd>\n<dt>blob_cache_size</dt>\n<dd>The size of the blob cache in bytes.  IF unset, then blobs will\naccumulate. If set, then blobs are removed when the total size\nexceeds this amount.  Blobs accessed least recently are removed\nfirst.</dd>\n<dt>blob_cache_size_check</dt>\n<dd>The total size of data to be downloaded to trigger blob cache size\nreduction. The default is 10 (percent).  This controls how often to\nremove blobs from the cache.</dd>\n<dt>ssl</dt>\n<dd>An <tt>ssl.SSLContext</tt> object used to make SSL connections.</dd>\n<dt>ssl_server_hostname</dt>\n<dd><p>Host name to use for SSL host name checks.</p>\n<p>If using SSL and if host name checking is enabled in the given SSL\ncontext then use this as the value to check.  If an address is a\nhost/port pair, then this defaults to the host in the address.</p>\n</dd>\n<dt>read_only</dt>\n<dd><p>Set to true for a read-only connection.</p>\n<p>If false (the default), then request a read/write connection.</p>\n<p>This option is ignored if <tt>read_only_fallback</tt> is set to a true value.</p>\n</dd>\n<dt>read_only_fallback</dt>\n<dd><p>Set to true, then prefer a read/write connection, but be willing to\nuse a read-only connection.  This defaults to a false value.</p>\n<p>If <tt>read_only_fallback</tt> is set, then <tt>read_only</tt> is ignored.</p>\n</dd>\n<dt>server_sync</dt>\n<dd><p>Flag, false by default, indicating whether the <tt>sync</tt> method\nshould make a server request.  The <tt>sync</tt> method is called at the\nstart of explicitly begin transactions.  Making a server requests assures\nthat any invalidations outstanding at the beginning of a\ntransaction are processed.</p>\n<p>Setting this to True is important when application activity is\nspread over multiple ZEO clients. The classic example of this is\nwhen a web browser makes a request to an application server (ZEO\nclient) that makes a change and then makes a request to another\napplication server that depends on the change.</p>\n<p>Setting this to True makes transactions a little slower because of\nthe added server round trip.  For transactions that don’t otherwise\nneed to access the storage server, the impact can be significant.</p>\n</dd>\n<dt>wait_timeout</dt>\n<dd><p>How long to wait for an initial connection, defaulting to 30\nseconds.  If an initial connection can’t be made within this time\nlimit, then creation of the client storage will fail with a\n<tt>ZEO.Exceptions.ClientDisconnected</tt> exception.</p>\n<p>After the initial connection, if the client is disconnected:</p>\n<ul>\n<li>In-flight server requests will fail with a\n<tt>ZEO.Exceptions.ClientDisconnected</tt> exception.</li>\n<li>New requests will block for up to <tt>wait_timeout</tt> waiting for a\nconnection to be established before failing with a\n<tt>ZEO.Exceptions.ClientDisconnected</tt> exception.</li>\n</ul>\n</dd>\n<dt>client_label</dt>\n<dd>A short string to display in <em>server</em> logs for an event relating to\nthis client. This can be helpful when debugging.</dd>\n<dt>disconnect_poll</dt>\n<dd>The delay in seconds between attempts to connect to the\nserver, in seconds.  Defaults to 1 second.</dd>\n</dl>\n</div>\n<div id=\"configuration-strings-files\">\n<h3><a href=\"#id31\" rel=\"nofollow\">Configuration strings/files</a></h3>\n<p>ZODB databases and storages can be configured using configuration\nfiles, or strings (extracted from configuration files).  They use the\nsame syntax as the server configuration files described above, but\nwith different sections and options.</p>\n<p>An application that used ZODB might configure it’s database using a\nstring like:</p>\n<pre>&lt;zodb&gt;\n   cache-size-bytes 1000MB\n\n   &lt;filestorage&gt;\n     path /var/lib/Data.fs\n   &lt;/filestorage&gt;\n&lt;/zodb&gt;\n</pre>\n<p>In this example, we configured a ZODB database with a object cache\nsize of 1GB.  Inside the database, we configured a file storage.  The\n<tt>filestorage</tt> section provided file-storage parameters.  We saw a\nsimilar section in the storage-server configuration example in <a href=\"#server-configuration\" rel=\"nofollow\">Server\nconfiguration</a>.</p>\n<p>To configure a client storage, you use a <tt>clientstorage</tt> section,\nbut first you have to import it’s definition, because ZEO isn’t built\ninto ZODB.  Here’s an example:</p>\n<pre>&lt;zodb&gt;\n   cache-size-bytes 1000MB\n\n   %import ZEO\n\n   &lt;clientstorage&gt;\n     server 8200\n   &lt;/clientstorage&gt;\n&lt;/zodb&gt;\n</pre>\n<p>In this example, we defined a client storage that connected to a\nserver on port 8200.</p>\n<p>The following settings are supported:</p>\n<dl>\n<dt>cache-size</dt>\n<dd>The cache size in bytes, KB or MB. This defaults to a 20MB.\nOptional <tt>KB</tt> or <tt>MB</tt> suffixes can (and usually are) used to\nspecify units other than bytes.</dd>\n<dt>cache-path</dt>\n<dd>The file path of a persistent cache file</dd>\n<dt>blob-dir</dt>\n<dd>The name of a directory to hold/cache blob data downloaded from the\nserver.  This must be provided if blobs are to be used.  (Of\ncourse, the server storage must be configured to use blobs as\nwell.)</dd>\n<dt>shared-blob-dir</dt>\n<dd>A client can use a network files system (or a local directory if\nthe server runs on the same machine) to share a blob directory with\nthe server.  This allows downloading of blobs (except via a\ndistributed file system) to be avoided.</dd>\n<dt>blob-cache-size</dt>\n<dd>The size of the blob cache in bytes.  IF unset, then blobs will\naccumulate. If set, then blobs are removed when the total size\nexceeds this amount.  Blobs accessed least recently are removed\nfirst.</dd>\n<dt>blob-cache-size-check</dt>\n<dd>The total size of data to be downloaded to trigger blob cache size\nreduction. The default is 10 (percent).  This controls how often to\nremove blobs from the cache.</dd>\n<dt>read-only</dt>\n<dd><p>Set to true for a read-only connection.</p>\n<p>If false (the default), then request a read/write connection.</p>\n<p>This option is ignored if <tt>read_only_fallback</tt> is set to a true value.</p>\n</dd>\n<dt>read-only-fallback</dt>\n<dd><p>Set to true, then prefer a read/write connection, but be willing to\nuse a read-only connection.  This defaults to a false value.</p>\n<p>If <tt>read_only_fallback</tt> is set, then <tt>read_only</tt> is ignored.</p>\n</dd>\n<dt>server-sync</dt>\n<dd>Sets the <tt>server_sync</tt> option described above.</dd>\n<dt>wait_timeout</dt>\n<dd><p>How long to wait for an initial connection, defaulting to 30\nseconds.  If an initial connection can’t be made within this time\nlimit, then creation of the client storage will fail with a\n<tt>ZEO.Exceptions.ClientDisconnected</tt> exception.</p>\n<p>After the initial connection, if the client is disconnected:</p>\n<ul>\n<li>In-flight server requests will fail with a\n<tt>ZEO.Exceptions.ClientDisconnected</tt> exception.</li>\n<li>New requests will block for up to <tt>wait_timeout</tt> waiting for a\nconnection to be established before failing with a\n<tt>ZEO.Exceptions.ClientDisconnected</tt> exception.</li>\n</ul>\n</dd>\n<dt>client_label</dt>\n<dd>A short string to display in <em>server</em> logs for an event relating to\nthis client. This can be helpful when debugging.</dd>\n<dt>disconnect_poll</dt>\n<dd>The delay in seconds between attempts to connect to the\nserver, in seconds.  Defaults to 1 second.</dd>\n</dl>\n<div id=\"client-ssl-configuration\">\n<h4><a href=\"#id32\" rel=\"nofollow\">Client SSL configuration</a></h4>\n<p>An <tt>ssl</tt> subsection can be used to enable and configure SSL, as in:</p>\n<pre>%import ZEO\n\n&lt;clientstorage&gt;\n  server zeo.example.com8200\n  &lt;ssl&gt;\n  &lt;/ssl&gt;\n&lt;/clientstorage&gt;\n</pre>\n<p>In the example above, SSL is enabled in it’s simplest form:</p>\n<ul>\n<li>The client expects the server to have a signed certificate, which the\nclient validates.</li>\n<li>The server server host name <tt>zeo.example.com</tt> is checked against\nthe server’s certificate.</li>\n</ul>\n<p>A number of settings can be provided to configure SSL:</p>\n<dl>\n<dt>certificate</dt>\n<dd>The path to an SSL certificate file for the client.  This is\nneeded to allow the server to authenticate the client.</dd>\n<dt>key</dt>\n<dd>The path to the SSL key file for the client certificate (if not\nincluded in the certificate file).</dd>\n<dt>password-function</dt>\n<dd>A dotted name if an importable function that, when imported, returns\nthe password needed to unlock the key (if the key requires a password.)</dd>\n<dt>authenticate</dt>\n<dd><p>The path to a file or directory containing server certificates\nto authenticate.  (See the <tt>cafile</tt> and <tt>capath</tt>\nparameters in the Python documentation for\n<tt>ssl.SSLContext.load_verify_locations</tt>.)</p>\n<p>If this setting is used. then certificate authentication is\nused to authenticate the server.  The server must be configured\nwith one of the certificates supplied using this setting.</p>\n</dd>\n<dt>check-hostname</dt>\n<dd>This is a boolean setting that defaults to true. Verify the\nhost name in the server certificate is as expected.</dd>\n<dt>server-hostname</dt>\n<dd><p>The expected server host name.  This defaults to the host name\nused in the server address.  This option must be used when\n<tt><span class=\"pre\">check-hostname</span></tt> is true and when a server address has no host\nname (localhost, or unix domain socket) or when there is more\nthan one server and server hostnames differ.</p>\n<p>Using this setting implies a true value for the <tt><span class=\"pre\">check-hostname</span></tt> setting.</p>\n</dd>\n</dl>\n</div>\n</div>\n</div>\n<div id=\"changelog\">\n<h2><a href=\"#id33\" rel=\"nofollow\">Changelog</a></h2>\n<div id=\"id1\">\n<h3><a href=\"#id34\" rel=\"nofollow\">5.2.1 (2019-02-09)</a></h3>\n<ul>\n<li>Add support for Python 3.7.</li>\n<li>Switch from <tt><span class=\"pre\">msgpack-python</span></tt> to <tt>msgpack</tt>. Currently a version &lt; 0.6\nis required.</li>\n<li>Stop calling the deprecated <tt>checkSecure</tt> method when creating a\n<tt>ClientStorage</tt>. With ZODB 5.2.2 and above, this issued a warning.\nWith older versions, this <em>could</em> issue a log message, but this was\nconsidered <a href=\"https://github.com/zopefoundation/ZODB/issues/155\" rel=\"nofollow\">a misfeature</a>. See <a href=\"https://github.com/zopefoundation/ZEO/issues/134\" rel=\"nofollow\">issue\n134</a>.</li>\n</ul>\n</div>\n<div id=\"id2\">\n<h3><a href=\"#id35\" rel=\"nofollow\">5.2.0 (2018-03-28)</a></h3>\n<ul>\n<li><p>Fixed: The quickstart/ad-hoc/play ZEO server relied on test\ndependencies. See <a href=\"https://github.com/zopefoundation/ZEO/issues/105\" rel=\"nofollow\">issue 105</a>.</p>\n</li>\n<li><p>Disallow passing strings as addresses to ClientStorage under Windows\nbecause string addresses are used for unix-domain sockets, which\naren’t supported on Windows. See <a href=\"https://github.com/zopefoundation/ZEO/issues/107\" rel=\"nofollow\">issue 107</a>.</p>\n</li>\n<li><p>Renamed all <tt>async</tt> attributes to <tt>async_</tt> for compatibility\nwith Python 3.7. See <a href=\"https://github.com/zopefoundation/ZEO/issues/104\" rel=\"nofollow\">issue 104</a>.</p>\n</li>\n<li><p>Fixed to work with some changes made in ZODB 5.4.0.</p>\n<p>Client-side updates are incuded for ZODB 5.4.0 or databases that\nalready had <tt>zodbpickle.binary</tt> OIDs. See <a href=\"https://github.com/zopefoundation/ZEO/issues/113\" rel=\"nofollow\">issue 113</a>.</p>\n</li>\n<li><p>ZEO now uses pickle protocol 3 for both Python 2 and Python 3.\n(Previously protocol 1 was used for Python 2.) This matches the\nchange in ZODB 5.4.0.</p>\n</li>\n</ul>\n</div>\n<div id=\"id3\">\n<h3><a href=\"#id36\" rel=\"nofollow\">5.1.2 (2018-03-27)</a></h3>\n<ul>\n<li><p>Fix: ZEO didn’t work with a change in ZODB 5.4.0.</p>\n<p>(Allow <tt>zodbpickle.binary</tt> to be used in RPC requests, which is\nnecessary for compatibility with ZODB 5.4.0 on Python 2. See <a href=\"https://github.com/zopefoundation/ZEO/issues/107\" rel=\"nofollow\">issue\n107</a>.)</p>\n</li>\n</ul>\n</div>\n<div id=\"id5\">\n<h3><a href=\"#id37\" rel=\"nofollow\">5.1.1 (2017-12-18)</a></h3>\n<ul>\n<li>All classes are new-style classes on Python 2 (they were already\nnew-style on Python 3). This improves performance on PyPy. See\n<a href=\"https://github.com/zopefoundation/ZEO/pull/86\" rel=\"nofollow\">issue 86</a>.</li>\n<li>Fixed removing UNIX socket files under Python 2 with ZConfig 3.2.0.\nSee <a href=\"https://github.com/zopefoundation/ZEO/issues/90\" rel=\"nofollow\">issue 90</a>.</li>\n</ul>\n</div>\n<div id=\"id6\">\n<h3><a href=\"#id38\" rel=\"nofollow\">5.1.0 (2017-04-03)</a></h3>\n<ul>\n<li>Added support for serializing ZEO messages using <a href=\"http://msgpack.org/index.html\" rel=\"nofollow\">msgpack</a> rather than pickle.  This helps\npave the way to supporting <a href=\"https://github.com/jimfulton/byteserver\" rel=\"nofollow\">byteserver</a>, but it also allows ZEO\nservers to support Python 2 or 3 clients (but not both at the same\ntime) and may provide a small performance improvement.</li>\n<li>Possibly fixed the deprecated and untested zeoctl script.</li>\n<li>Removed zeopasswd, which no longer makes sense given that ZEO\nauthentication was removed, in favor of SSL.</li>\n</ul>\n</div>\n<div id=\"id8\">\n<h3><a href=\"#id39\" rel=\"nofollow\">5.0.4 (2016-11-18)</a></h3>\n<ul>\n<li><p>Fixed: ZEO needed changes to work with recent transaction changes.</p>\n<p>ZEO now works with the latest versions of ZODB and transaction</p>\n</li>\n</ul>\n</div>\n<div id=\"id9\">\n<h3><a href=\"#id40\" rel=\"nofollow\">5.0.3 (2016-11-18)</a></h3>\n<ul>\n<li>Temporarily require non-quite-current versions of ZODB and\ntransaction until we can sort out some recent breakage.</li>\n</ul>\n</div>\n<div id=\"id10\">\n<h3><a href=\"#id41\" rel=\"nofollow\">5.0.2 (2016-11-02)</a></h3>\n<ul>\n<li>Provide much better performance on Python 2.</li>\n<li>Provide better error messages when pip tries to install ZEO on an\nunsupported Python version. See <a href=\"https://github.com/zopefoundation/ZEO/issues/75\" rel=\"nofollow\">issue 75</a>.</li>\n</ul>\n</div>\n<div id=\"id11\">\n<h3><a href=\"#id42\" rel=\"nofollow\">5.0.1 (2016-09-06)</a></h3>\n<p>Packaging-related doc fix</p>\n</div>\n<div id=\"id12\">\n<h3><a href=\"#id43\" rel=\"nofollow\">5.0.0 (2016-09-06)</a></h3>\n<p>This is a major ZEO revision, which replaces the ZEO network protocol\nimplementation.</p>\n<p>New features:</p>\n<ul>\n<li><p>SSL support</p>\n</li>\n<li><p>Optional client-side conflict resolution.</p>\n</li>\n<li><p>Lots of mostly internal clean ups.</p>\n</li>\n<li><p><tt><span class=\"pre\">ClientStorage``server-sync</span></tt> configuration option and\n<tt>server_sync</tt> constructor argument to force a server round trip at\nthe beginning of transactions to wait for any outstanding\ninvalidations at the start of the transaction to be delivered.</p>\n</li>\n<li><p>Client disconnect errors are now transient errors.  When\napplications retry jobs that raise transient errors, jobs (e.g. web\nrequests) with disconnect errors will be retried. Together with\nblocking synchronous ZEO server calls for a limited time while\ndisconnected, this change should allow brief disconnections due to\nserver restart to avoid generating client-visible errors (e.g. 500\nweb responses).</p>\n</li>\n<li><p>ClientStorage prefetch method to prefetch oids.</p>\n<p>When oids are prefetched, requests are made at once, but the caller\ndoesn’t block waiting for the results.  Rather, then the caller\nlater tries to fetch data for one of the object ids, it’s either\ndelivered right away from the ZEO cache, if the prefetch for the\nobject id has completed, or the caller blocks until the inflight\nprefetch completes. (No new request is made.)</p>\n</li>\n</ul>\n<p>Dropped features:</p>\n<ul>\n<li><p>The ZEO authentication protocol.</p>\n<p>This will be replaced by new authentication mechanims leveraging SSL.</p>\n</li>\n<li><p>The ZEO monitor server.</p>\n</li>\n<li><p>Full cache verification.</p>\n</li>\n<li><p>Client suppprt for servers older than ZODB 3.9</p>\n</li>\n<li><p>Server support for clients older than ZEO 4.2.0</p>\n</li>\n</ul>\n</div>\n<div id=\"b0-2016-08-18\">\n<h3><a href=\"#id44\" rel=\"nofollow\">5.0.0b0 (2016-08-18)</a></h3>\n<ul>\n<li>Added a <tt>ClientStorage</tt> <tt><span class=\"pre\">server-sync</span></tt> configuration option and\n<tt>server_sync</tt> constructor argument to force a server round trip at\nthe beginning of transactions to wait for any outstanding\ninvalidations at the start of the transaction to be delivered.</li>\n<li>When creating an ad hoc server, a log file isn’t created by\ndefault. You must pass a <tt>log</tt> option specifying a log file name.</li>\n<li>The ZEO server register method now returns the storage last\ntransaction, allowing the client to avoid an extra round trip during\ncache verification.</li>\n<li>Client disconnect errors are now transient errors.  When\napplications retry jobs that raise transient errors, jobs (e.g. web\nrequests) with disconnect errors will be retried. Together with\nblocking synchronous ZEO server calls for a limited time while\ndisconnected, this change should allow brief disconnections due to\nserver restart to avoid generating client-visible errors (e.g. 500\nweb responses).</li>\n<li>Fixed bugs in using the ZEO 5 client with ZEO 4 servers.</li>\n</ul>\n</div>\n<div id=\"a2-2016-07-30\">\n<h3><a href=\"#id45\" rel=\"nofollow\">5.0.0a2 (2016-07-30)</a></h3>\n<ul>\n<li><p>Added the ability to pass credentials when creating client storages.</p>\n<p>This is experimental in that passing credentials will cause\nconnections to an ordinary ZEO server to fail, but it facilitates\nexperimentation with custom ZEO servers. Doing this with custom ZEO\nclients would have been awkward due to the many levels of\ncomposition involved.</p>\n<p>In the future, we expect to support server security plugins that\nconsume credentials for authentication (typically over SSL).</p>\n<p>Note that credentials are opaque to ZEO. They can be any object with\na true value.  The client mearly passes them to the server, which\nwill someday pass them to a plugin.</p>\n</li>\n</ul>\n</div>\n<div id=\"a1-2016-07-21\">\n<h3><a href=\"#id46\" rel=\"nofollow\">5.0.0a1 (2016-07-21)</a></h3>\n<ul>\n<li><p>Added a ClientStorage prefetch method to prefetch oids.</p>\n<p>When oids are prefetched, requests are made at once, but the caller\ndoesn’t block waiting for the results.  Rather, then the caller\nlater tries to fetch data for one of the object ids, it’s either\ndelivered right away from the ZEO cache, if the prefetch for the\nobject id has completed, or the caller blocks until the inflight\nprefetch completes. (No new request is made.)</p>\n</li>\n<li><p>Fixed: SSL clients of servers with signed certs didn’t load default\ncerts and were unable to connect.</p>\n</li>\n</ul>\n</div>\n<div id=\"a0-2016-07-08\">\n<h3><a href=\"#id47\" rel=\"nofollow\">5.0.0a0 (2016-07-08)</a></h3>\n<p>This is a major ZEO revision, which replaces the ZEO network protocol\nimplementation.</p>\n<p>New features:</p>\n<ul>\n<li>SSL support</li>\n<li>Optional client-side conflict resolution.</li>\n<li>Lots of mostly internal clean ups.</li>\n</ul>\n<p>Dropped features:</p>\n<ul>\n<li><p>The ZEO authentication protocol.</p>\n<p>This will be replaced by new authentication mechanims leveraging SSL.</p>\n</li>\n<li><p>The ZEO monitor server.</p>\n</li>\n<li><p>Full cache verification.</p>\n</li>\n<li><p>Client suppprt for servers older than ZODB 3.9</p>\n</li>\n<li><p>Server support for clients older than ZEO 4.2.0</p>\n</li>\n</ul>\n</div>\n<div id=\"id13\">\n<h3><a href=\"#id48\" rel=\"nofollow\">4.2.0 (2016-06-15)</a></h3>\n<ul>\n<li><p>Changed loadBefore to operate more like load behaved, especially\nwith regard to the load lock.  This allowes ZEO to work with the\nupcoming ZODB 5, which used loadbefore rather than load.</p>\n<p>Reimplemented load using loadBefore, thus testing loadBefore\nextensively via existing tests.</p>\n</li>\n<li><p>Other changes to work with ZODB 5 (as well as ZODB 4)</p>\n</li>\n<li><p>Fixed: the ZEO cache loadBefore method failed to utilize current data.</p>\n</li>\n<li><p>Drop support for Python 2.6 and 3.2.</p>\n</li>\n<li><p>Fix AttributeError: ‘ZEOServer’ object has no attribute ‘server’ when\nStorageServer creation fails.</p>\n</li>\n</ul>\n</div>\n<div id=\"b1-2015-06-05\">\n<h3><a href=\"#id49\" rel=\"nofollow\">4.2.0b1 (2015-06-05)</a></h3>\n<ul>\n<li>Add support for PyPy.</li>\n</ul>\n</div>\n<div id=\"id14\">\n<h3><a href=\"#id50\" rel=\"nofollow\">4.1.0 (2015-01-06)</a></h3>\n<ul>\n<li>Add support for Python 3.4.</li>\n<li>Added a new <tt>ruok</tt> client protocol for getting server status on\nthe ZEO port without creating a full-blown client connection and\nwithout logging in the server log.</li>\n<li>Log errors on server side even if using multi threaded delay.</li>\n</ul>\n</div>\n<div id=\"id15\">\n<h3><a href=\"#id51\" rel=\"nofollow\">4.0.0 (2013-08-18)</a></h3>\n<ul>\n<li>Avoid reading excess random bytes when setting up an auth_digest session.</li>\n<li>Optimize socket address enumeration in ZEO client (avoid non-TCP types).</li>\n<li>Improve Travis CI testing support.</li>\n<li>Assign names to all threads for better runtime debugging.</li>\n<li>Fix “assignment to keyword” error under Py3k in ‘ZEO.scripts.zeoqueue’.</li>\n</ul>\n</div>\n<div id=\"b1-2013-05-20\">\n<h3><a href=\"#id52\" rel=\"nofollow\">4.0.0b1 (2013-05-20)</a></h3>\n<ul>\n<li>Depend on ZODB &gt;= 4.0.0b2</li>\n<li>Add support for Python 3.2 / 3.3.</li>\n</ul>\n</div>\n<div id=\"a1-2012-11-19\">\n<h3><a href=\"#id53\" rel=\"nofollow\">4.0.0a1 (2012-11-19)</a></h3>\n<p>First (in a long time) separate ZEO release.</p>\n<p>Since ZODB 3.10.5:</p>\n<ul>\n<li>Storage servers now emit Serving and Closed events so subscribers\ncan discover addresses when dynamic port assignment (bind to port 0)\nis used. This could, for example, be used to update address\ninformation in a ZooKeeper database.</li>\n<li>Client storages have a method, new_addr, that can be used to change\nthe server address(es). This can be used, for example, to update a\ndynamically determined server address from information in a\nZooKeeper database.</li>\n</ul>\n</div>\n</div>\n\n          </div>"}, "last_serial": 4800559, "releases": {"4.0.0": [{"comment_text": "", "digests": {"md5": "494d8320549185097ba4a6b6b76017d6", "sha256": "63555b6d2b5f98d215c4b5fdce004fb0475daa6efc8b70f39c77d646c12d7e51"}, "downloads": -1, "filename": "ZEO-4.0.0.tar.gz", "has_sig": false, "md5_digest": "494d8320549185097ba4a6b6b76017d6", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 200268, "upload_time": "2013-09-18T16:08:20", "upload_time_iso_8601": "2013-09-18T16:08:20.205520Z", "url": "https://files.pythonhosted.org/packages/c7/5c/7aa1353f7c82ce4df4695f48eef99c47856912f6a44f74598fb823324a34/ZEO-4.0.0.tar.gz", "yanked": false}], "4.0.0a1": [{"comment_text": "", "digests": {"md5": "63d983f65625ea0ec87167e4b1868d0f", "sha256": "922d1206f1aa9e04931c32e6cbd34d175a60f04b6d3c72044da7b26a4ea06853"}, "downloads": -1, "filename": "ZEO-4.0.0a1.tar.gz", "has_sig": false, "md5_digest": "63d983f65625ea0ec87167e4b1868d0f", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 204611, "upload_time": "2012-11-19T19:51:11", "upload_time_iso_8601": "2012-11-19T19:51:11.018818Z", "url": "https://files.pythonhosted.org/packages/0d/d9/79ad6484da2887ef01f69202fdd9f3f03ed503a71a54925bc73ee7b22164/ZEO-4.0.0a1.tar.gz", "yanked": false}], "4.0.0b1": [{"comment_text": "", "digests": {"md5": "34ad6007afa58ceab92ca47333bfb729", "sha256": "b6f8eaf2fac57f7b5ba16dac5c1a0d43d06683b1b5ba2e2906cb6bdfff883b2f"}, "downloads": -1, "filename": "ZEO-4.0.0b1.tar.gz", "has_sig": false, "md5_digest": "34ad6007afa58ceab92ca47333bfb729", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 205692, "upload_time": "2013-05-20T19:57:07", "upload_time_iso_8601": "2013-05-20T19:57:07.093442Z", "url": "https://files.pythonhosted.org/packages/db/d9/4e3dc378394d03ac1c53e184bb05edfbd6a8844b97a0025e54d5b3c1c71b/ZEO-4.0.0b1.tar.gz", "yanked": false}], "4.1.0": [{"comment_text": "", "digests": {"md5": "39a3fde5aa89bd56d2747a8d13fd08d1", "sha256": "952998a28411eb1e7594b57e9c4fcb30a19ea38c0fec22abb339a844c3ca134f"}, "downloads": -1, "filename": "ZEO-4.1.0.tar.gz", "has_sig": false, "md5_digest": "39a3fde5aa89bd56d2747a8d13fd08d1", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 242306, "upload_time": "2015-01-06T10:53:26", "upload_time_iso_8601": "2015-01-06T10:53:26.250636Z", "url": "https://files.pythonhosted.org/packages/22/ea/eecffa25ae5318e9cafb0e04e8310a44afb76ec30bd3c2162f4c12206b91/ZEO-4.1.0.tar.gz", "yanked": false}], "4.2.0": [{"comment_text": "", "digests": {"md5": "e4219c6079cfd6cb7cc0430d43e3cae8", "sha256": "b30d70bef49ba510dc622e5c85b303f6a73c04bf6b34069634790dd234ad9b83"}, "downloads": -1, "filename": "ZEO-4.2.0.tar.gz", "has_sig": false, "md5_digest": "e4219c6079cfd6cb7cc0430d43e3cae8", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 284783, "upload_time": "2016-06-15T18:24:58", "upload_time_iso_8601": "2016-06-15T18:24:58.957459Z", "url": "https://files.pythonhosted.org/packages/6f/18/bd9a692144bdd99c706556cab23588e1b478ddc9fb4b62b49649efe6a621/ZEO-4.2.0.tar.gz", "yanked": false}], "4.2.0b1": [{"comment_text": "", "digests": {"md5": "c1117f607a38d95525ebf220eaf49bd0", "sha256": "ece7b0d8d69f76d07d7f8a6e16d2d45a5c9465b6e9d8d37e285057767bb27f4d"}, "downloads": -1, "filename": "ZEO-4.2.0b1.tar.gz", "has_sig": true, "md5_digest": "c1117f607a38d95525ebf220eaf49bd0", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 216627, "upload_time": "2015-06-05T13:40:33", "upload_time_iso_8601": "2015-06-05T13:40:33.430091Z", "url": "https://files.pythonhosted.org/packages/93/5d/3b060e816e01add863a4906a5c7ff52a1c862e063b81b787cdca7237e901/ZEO-4.2.0b1.tar.gz", "yanked": false}], "4.2.1": [{"comment_text": "", "digests": {"md5": "c285d1e534a5c7e508deaffc5e2ab597", "sha256": "331f99c395c355f88479f1f4e4545ae85bd6c5c6c11ff84e6182817ffb70bd9b"}, "downloads": -1, "filename": "ZEO-4.2.1.tar.gz", "has_sig": false, "md5_digest": "c285d1e534a5c7e508deaffc5e2ab597", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 284869, "upload_time": "2016-06-30T17:22:50", "upload_time_iso_8601": "2016-06-30T17:22:50.773063Z", "url": "https://files.pythonhosted.org/packages/f6/ad/0fd2076890291b4a1334a3f865b5993de60ecb872d2543c3f59298ee7afa/ZEO-4.2.1.tar.gz", "yanked": false}], "4.3.0": [{"comment_text": "", "digests": {"md5": "c04c6725b1b905d041c13b8c0a883d88", "sha256": "d9683cd8ba83b5deb30c4dd27995b95faf39741d267588cf196ae8cd70d17d95"}, "downloads": -1, "filename": "ZEO-4.3.0.tar.gz", "has_sig": false, "md5_digest": "c04c6725b1b905d041c13b8c0a883d88", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 301568, "upload_time": "2016-08-02T14:28:20", "upload_time_iso_8601": "2016-08-02T14:28:20.463946Z", "url": "https://files.pythonhosted.org/packages/8a/1d/673c0dd32fd420df14485434efa5f2c5288ba2046aaa179b007914c887d5/ZEO-4.3.0.tar.gz", "yanked": false}], "4.3.1": [{"comment_text": "", "digests": {"md5": "09b08eb53532fe71618ce5398cd1bb23", "sha256": "c94f2b7a40bfd23f45674e144480b09b63db20b43bb3b711477324513401df3b"}, "downloads": -1, "filename": "ZEO-4.3.1.tar.gz", "has_sig": false, "md5_digest": "09b08eb53532fe71618ce5398cd1bb23", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 304922, "upload_time": "2016-11-18T15:44:33", "upload_time_iso_8601": "2016-11-18T15:44:33.854816Z", "url": "https://files.pythonhosted.org/packages/f5/3a/5d15ad251b81563b1b41ccab8d62261383368d8d4d688c200facc3416eeb/ZEO-4.3.1.tar.gz", "yanked": false}], "5.0.0": [{"comment_text": "", "digests": {"md5": "efc5490ed7e9d89d7447a5d3795f733e", "sha256": "5b0d662d90a1e78c94e0e3e425bb4dce8e6bcbac88be262e659a356d51bf8ba1"}, "downloads": -1, "filename": "ZEO-5.0.0.tar.gz", "has_sig": false, "md5_digest": "efc5490ed7e9d89d7447a5d3795f733e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 328737, "upload_time": "2016-09-06T14:53:25", "upload_time_iso_8601": "2016-09-06T14:53:25.263632Z", "url": "https://files.pythonhosted.org/packages/1f/23/1c19970201dfa9ab0d5ed088528db3ad3b5d5ff6534785c1ba10124af6c9/ZEO-5.0.0.tar.gz", "yanked": false}], "5.0.0a0": [{"comment_text": "", "digests": {"md5": "b7afce7b963b986f343086c5acd6bd44", "sha256": "50d3c939955160ea6805050a42a95af07a29f3cdfa78fe0a65ef4fe0cec84a47"}, "downloads": -1, "filename": "ZEO-5.0.0a0.tar.gz", "has_sig": false, "md5_digest": "b7afce7b963b986f343086c5acd6bd44", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 284117, "upload_time": "2016-07-08T13:56:41", "upload_time_iso_8601": "2016-07-08T13:56:41.250896Z", "url": "https://files.pythonhosted.org/packages/e4/1c/acb28be0837ec200210b03ae68fef4e719074f795a791baa62a578c50a6b/ZEO-5.0.0a0.tar.gz", "yanked": false}], "5.0.0a1": [{"comment_text": "", "digests": {"md5": "6361744888f29468d3ca1f2fbf705f0e", "sha256": "1d8a978ac95d7728a9444d5574778bb71747c45e1fc8fff84ab574a2b2f7d9d2"}, "downloads": -1, "filename": "ZEO-5.0.0a1.tar.gz", "has_sig": false, "md5_digest": "6361744888f29468d3ca1f2fbf705f0e", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 288528, "upload_time": "2016-07-21T15:58:12", "upload_time_iso_8601": "2016-07-21T15:58:12.612017Z", "url": "https://files.pythonhosted.org/packages/5f/ee/852f4a291d64e0bafd8663bd63652baa663254421d12ef103ae2052ead99/ZEO-5.0.0a1.tar.gz", "yanked": false}], "5.0.0a2": [{"comment_text": "", "digests": {"md5": "753f0112b37ce2e1be7ea23c248d7d06", "sha256": "0c17c12caaecf6d6b7d19f9f80b93a0d68a4eff3e7abd338f85f740b133ed2bf"}, "downloads": -1, "filename": "ZEO-5.0.0a2.tar.gz", "has_sig": false, "md5_digest": "753f0112b37ce2e1be7ea23c248d7d06", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 290049, "upload_time": "2016-07-30T10:22:19", "upload_time_iso_8601": "2016-07-30T10:22:19.686248Z", "url": "https://files.pythonhosted.org/packages/b8/2e/d44627a825d7f63a4828ef143f078d03694c9123c8de338c2317280590ac/ZEO-5.0.0a2.tar.gz", "yanked": false}], "5.0.0b0": [{"comment_text": "", "digests": {"md5": "780f7fabc1dd975c07e1024b3579a61a", "sha256": "715bf5a5566d1e9f57b9bde263ea61acc80c81a7ad9befbaf7fd7f892bdd1831"}, "downloads": -1, "filename": "ZEO-5.0.0b0.tar.gz", "has_sig": false, "md5_digest": "780f7fabc1dd975c07e1024b3579a61a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 360728, "upload_time": "2016-08-18T13:17:01", "upload_time_iso_8601": "2016-08-18T13:17:01.585766Z", "url": "https://files.pythonhosted.org/packages/a8/19/8f1a4a022d40450d56bb0eb6dd296bc3157888cd2b28ecae42c8acdd222e/ZEO-5.0.0b0.tar.gz", "yanked": false}], "5.0.1": [{"comment_text": "", "digests": {"md5": "6d138445e2e3dcef8bc50361f077407c", "sha256": "ce843018b17138a548c59ac5e98b4492ecced4324f561455e9239fb766c2699a"}, "downloads": -1, "filename": "ZEO-5.0.1.tar.gz", "has_sig": false, "md5_digest": "6d138445e2e3dcef8bc50361f077407c", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 328782, "upload_time": "2016-09-06T14:58:22", "upload_time_iso_8601": "2016-09-06T14:58:22.942705Z", "url": "https://files.pythonhosted.org/packages/a0/24/732aac114931ba3c932d4560edf2a608fe5be47233103d9fd57112203a26/ZEO-5.0.1.tar.gz", "yanked": false}], "5.0.2": [{"comment_text": "", "digests": {"md5": "a2f4959beb65488950faf681e4cad411", "sha256": "68ec9a2a581dc0630e3dbd83f5a47fa7aaff7b243af804a8a85a26bc8c231fde"}, "downloads": -1, "filename": "ZEO-5.0.2.tar.gz", "has_sig": false, "md5_digest": "a2f4959beb65488950faf681e4cad411", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 371917, "upload_time": "2016-11-01T17:37:31", "upload_time_iso_8601": "2016-11-01T17:37:31.042706Z", "url": "https://files.pythonhosted.org/packages/8d/19/5eba4c05acc5f55a28b782e6342cdf4e182e8fce011c9cb00d3851d067f1/ZEO-5.0.2.tar.gz", "yanked": false}], "5.0.3": [{"comment_text": "", "digests": {"md5": "00bb007a1abdcc22daed14ef1ecbc258", "sha256": "21c037e0cd4cf7011c5eac9565ea495316c334485c535934e9b8e126c5b871cf"}, "downloads": -1, "filename": "ZEO-5.0.3.tar.gz", "has_sig": false, "md5_digest": "00bb007a1abdcc22daed14ef1ecbc258", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 386157, "upload_time": "2016-11-18T16:03:08", "upload_time_iso_8601": "2016-11-18T16:03:08.689594Z", "url": "https://files.pythonhosted.org/packages/e1/52/c09f6a348474d569c49f33e354d805f8bff2738990f8005ff925df4f3439/ZEO-5.0.3.tar.gz", "yanked": false}], "5.0.4": [{"comment_text": "", "digests": {"md5": "ae94e63e7b002857b87c194d2d457715", "sha256": "6462adb6e41735942ce2f120328c9e170468552d61075a4087b68d0637244b2f"}, "downloads": -1, "filename": "ZEO-5.0.4.tar.gz", "has_sig": false, "md5_digest": "ae94e63e7b002857b87c194d2d457715", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 386783, "upload_time": "2016-11-18T19:11:41", "upload_time_iso_8601": "2016-11-18T19:11:41.088894Z", "url": "https://files.pythonhosted.org/packages/be/d0/c2a4d4764d89e45ec5a8ecf619afe94f7a3caebc2eb36d0f48ce9e972f04/ZEO-5.0.4.tar.gz", "yanked": false}], "5.1.0": [{"comment_text": "", "digests": {"md5": "571b95602bf1ef67ecdfb345fbf12f48", "sha256": "142edf8fcabaeec8c438319d71a12a1d4461befa9111a073c362b75e481e7522"}, "downloads": -1, "filename": "ZEO-5.1.0.tar.gz", "has_sig": false, "md5_digest": "571b95602bf1ef67ecdfb345fbf12f48", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 266903, "upload_time": "2017-04-03T13:07:34", "upload_time_iso_8601": "2017-04-03T13:07:34.018735Z", "url": "https://files.pythonhosted.org/packages/d3/ca/7e7ccc650be679058b1dceebd19521120fba11689996a73cd2cad5c43875/ZEO-5.1.0.tar.gz", "yanked": false}], "5.1.1": [{"comment_text": "", "digests": {"md5": "cd303604d9b91a5ce5c9b4bc37ebe6fe", "sha256": "bb4fcf272ea2d3df5b5faacf66a71ec32d1413070cb1a0ca2e1cccfa8229a0e7"}, "downloads": -1, "filename": "ZEO-5.1.1.tar.gz", "has_sig": false, "md5_digest": "cd303604d9b91a5ce5c9b4bc37ebe6fe", "packagetype": "sdist", "python_version": "source", "requires_python": ">=2.7.9,!=3.0.*,!=3.1.*,!=3.2.*,!=3.3.*", "size": 274204, "upload_time": "2017-12-18T15:55:49", "upload_time_iso_8601": "2017-12-18T15:55:49.508522Z", "url": "https://files.pythonhosted.org/packages/16/f3/52e390acdfaa8ce2c0c2b42cf7fb2c703524cb2276c08071c9b1c99ba343/ZEO-5.1.1.tar.gz", "yanked": false}], "5.1.2": [{"comment_text": "", "digests": {"md5": "6e565512347e64f9bdb0b95d4aa290b5", "sha256": "9b9be96dcead54994ef7bb516044f8721f866a9c8a01f3fe5f48d7d0fc457429"}, "downloads": -1, "filename": "ZEO-5.1.2.tar.gz", "has_sig": false, "md5_digest": "6e565512347e64f9bdb0b95d4aa290b5", "packagetype": "sdist", "python_version": "source", "requires_python": ">=2.7.9,!=3.0.*,!=3.1.*,!=3.2.*,!=3.3.*", "size": 276061, "upload_time": "2018-03-27T14:34:31", "upload_time_iso_8601": "2018-03-27T14:34:31.221517Z", "url": "https://files.pythonhosted.org/packages/e7/17/7e136b90add76419d5f894b995d075bbc0531726adfe73b9c9979266aa8b/ZEO-5.1.2.tar.gz", "yanked": false}], "5.2.0": [{"comment_text": "", "digests": {"md5": "3e86a69a3098d1ab5a2ca09ac372c78a", "sha256": "4c1a9fc01114382e58b7ae21135fe0c222f214bf680ad073d5fdccaaaccd6e57"}, "downloads": -1, "filename": "ZEO-5.2.0.tar.gz", "has_sig": false, "md5_digest": "3e86a69a3098d1ab5a2ca09ac372c78a", "packagetype": "sdist", "python_version": "source", "requires_python": null, "size": 276286, "upload_time": "2018-03-28T23:32:00", "upload_time_iso_8601": "2018-03-28T23:32:00.771915Z", "url": "https://files.pythonhosted.org/packages/c4/cf/5e10a975effe9eea47bc502d29ce0735d3e145b7cddea5ec1b4aca858fce/ZEO-5.2.0.tar.gz", "yanked": false}], "5.2.1": [{"comment_text": "", "digests": {"md5": "2474216428d622e562e5163d79040e48", "sha256": "cd65379f3c231a411a000c352bb700c4a635d74be947b09b1ce84b514f16beb4"}, "downloads": -1, "filename": "ZEO-5.2.1.tar.gz", "has_sig": false, "md5_digest": "2474216428d622e562e5163d79040e48", "packagetype": "sdist", "python_version": "source", "requires_python": ">=2.7.9,!=3.0.*,!=3.1.*,!=3.2.*,!=3.3.*", "size": 276884, "upload_time": "2019-02-09T22:21:30", "upload_time_iso_8601": "2019-02-09T22:21:30.989886Z", "url": "https://files.pythonhosted.org/packages/0c/0c/8864fa8ba26182007ab088b24d9a704416d62e1da1c12595bcb671c6f241/ZEO-5.2.1.tar.gz", "yanked": false}], "5.2.1.dev0": [{"comment_text": "", "digests": {"md5": "8cc08c8e03cf1eca17ea9254f966f8cb", "sha256": "7fda5d0b6add81abaca96062fee9ed80de43bdc97453ea9aa75880e397302933"}, "downloads": -1, "filename": "ZEO-5.2.1.dev0.tar.gz", "has_sig": false, "md5_digest": "8cc08c8e03cf1eca17ea9254f966f8cb", "packagetype": "sdist", "python_version": "source", "requires_python": ">=2.7.9,!=3.0.*,!=3.1.*,!=3.2.*,!=3.3.*", "size": 276945, "upload_time": "2019-02-09T22:19:20", "upload_time_iso_8601": "2019-02-09T22:19:20.934585Z", "url": "https://files.pythonhosted.org/packages/09/c0/b81858c6726d79e9b6d5977b9eea8213a576467d4a3396f7b480ab52c68f/ZEO-5.2.1.dev0.tar.gz", "yanked": false}]}, "urls": [{"comment_text": "", "digests": {"md5": "2474216428d622e562e5163d79040e48", "sha256": "cd65379f3c231a411a000c352bb700c4a635d74be947b09b1ce84b514f16beb4"}, "downloads": -1, "filename": "ZEO-5.2.1.tar.gz", "has_sig": false, "md5_digest": "2474216428d622e562e5163d79040e48", "packagetype": "sdist", "python_version": "source", "requires_python": ">=2.7.9,!=3.0.*,!=3.1.*,!=3.2.*,!=3.3.*", "size": 276884, "upload_time": "2019-02-09T22:21:30", "upload_time_iso_8601": "2019-02-09T22:21:30.989886Z", "url": "https://files.pythonhosted.org/packages/0c/0c/8864fa8ba26182007ab088b24d9a704416d62e1da1c12595bcb671c6f241/ZEO-5.2.1.tar.gz", "yanked": false}], "timestamp": "Fri May  8 03:17:55 2020"}